[
    {
        "id": 19171,
        "title": "Coevolution",
        "authors": "Avi Max Spiegel",
        "published": "2017-10-19",
        "citations": 0,
        "abstract": "This chapter seeks to understand how Islamist movements have evolved over time, and, in the process, provide important background on the political and religious contexts of the movements in question. In particular, it shows that Islamist movements coevolve. Focusing on the histories of Morocco's two main Islamist movements—the Justice and Spirituality Organization, or Al Adl wal Ihsan (Al Adl) and the Party of Justice and Development (PJD)—it suggests that their evolutions can only be fully appreciated if they are relayed in unison. These movements mirror one another depending on the competitive context, sometimes reflecting, sometimes refracting, sometimes borrowing, sometimes adapting or even reorganizing in order to keep up with the other.",
        "link": "http://dx.doi.org/10.23943/princeton/9780691159843.003.0003"
    },
    {
        "id": 19172,
        "title": "Coevolution",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0016"
    },
    {
        "id": 19173,
        "title": "Compensatory coevolution",
        "authors": "Geoffrey E. Hill",
        "published": "2019-4-30",
        "citations": 0,
        "abstract": "In most eukaryotes, mitochondrial genes mutate at a higher rate than nuclear genes. In addition, mitochondrial genes are transmitted without recombination, so slightly deleterious mutations are predicted to perpetually accumulate in mt genes. Accumulation of deleterious mutations in mt genes can potentially lead to loss of mitonuclear coadaptation. There is growing evidence that variant nuclear genes evolve so as to compensate for mitochondrial mutations and restore mitochondrial function. This is compensatory coevolution and is the focus of this chapter. The chapter also explores the idea that the many nuclear-encoded subunits in eukaryotic electron transport system enzymes were recruited to regulate and control the core catalytic reactions undertaken by the core mitochondrial subunits. It will also consider the evidence that when mutational erosion occurs, corrupted mitochondrial genotypes can be rescued by introgression of entire mitochondrial genomes. Compensatory coevolution has important implications for speciation, sexual selection, and adaptation.",
        "link": "http://dx.doi.org/10.1093/oso/9780198818250.003.0003"
    },
    {
        "id": 19174,
        "title": "Coevolution (socio-biophysical coevolution)",
        "authors": "Miquel A. Gual, Richard B. Norgaard",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4337/9781802200416.ch11"
    },
    {
        "id": 19175,
        "title": "Coevolution, co-transmission, and conflict",
        "authors": "Geoffrey E. Hill",
        "published": "2019-4-30",
        "citations": 0,
        "abstract": "Mitochondrial genes and nuclear genes are replicated and transmitted across generations as physically separated units. The extent to which these autonomous genomes are co-transmitted depends on the position of nuclear genes on autosomes versus sex chromosomes, and co-transmission has important implications for mitonuclear coevolution and conflict. Mitonuclear co-transmission, coadaptation, and coevolution are potentially very important for understanding fundamental evolutionary phenomena like Haldane’s rule. In addition, because mitochondrial genomes are transmitted strictly through maternal lines in most eukaryotes, selection on mitochondrial genes can favor female fitness over male fitness, leading to mother’s curse. The chapter assesses and draws conclusions about the relative importance of mitonuclear coadaptation and conflict in the evolution of eukaryotic lineages.",
        "link": "http://dx.doi.org/10.1093/oso/9780198818250.003.0004"
    },
    {
        "id": 19176,
        "title": "Gene-Culture Coevolution",
        "authors": "Kevin N. Laland",
        "published": "2018-9-11",
        "citations": 0,
        "abstract": "This chapter examines the evidence that our cultural activities have influenced our biological evolution, by drawing on a cocktail of theoretical and empirical findings. It begins by relating findings from theoretical studies, which show through mathematical modeling that gene–culture coevolution is, at least in principle, highly plausible. Then the anthropological evidence for gene–culture coevolution is surveyed. Here, compelling and well-researched case studies provide incontrovertible evidence that gene–culture coevolution is a biological fact. Finally, some genetic data are presented—specifically, studies that have identified human genes subject to recent natural selection, including genes expressed in the brain. Many such genes (strictly, “alleles,” or gene variants) have increased extremely rapidly in frequency over a few thousand years, and this unusually swift spread, known as a “selective sweep,” is taken as a sign of their having being favored by natural selection. The relevance of such studies stems from the fact that the geneticists who carried them out have concluded that the sweeps are almost certainly a response to human cultural activities. Collectively, these three bodies of evidence make a compelling case that culture is not just a product, but also a codirector, of human evolution.",
        "link": "http://dx.doi.org/10.23943/princeton/9780691182810.003.0009"
    },
    {
        "id": 19177,
        "title": "Megaregions and Coevolution in World Politics",
        "authors": "Robert R. Bianchi",
        "published": "2019-4-4",
        "citations": 0,
        "abstract": "The rise of the New Silk Road is generating fierce debates over the emergence of new megaregions and their role in reshaping world politics. Chinese writers are avid consumers of and contributors to these discussions both at home and internationally. China’s growing interest in megaregional integration accompanied a sharp turn in foreign policy—from a defensive posture that feared provoking war with the United States toward a bold campaign to assert global leadership, economically and diplomatically. Gradually, Chinese leaders are beginning to realize that all of the emerging megaregions are developing lives of their own that cannot be directed by a hierarchical network centered in Beijing. This realization is forcing China’s policymakers to reconsider their traditional assumption that sovereignty belongs only to formal governments and the elites that control them rather than to the all of the citizens who comprise the national communities.",
        "link": "http://dx.doi.org/10.1093/oso/9780190915285.003.0003"
    },
    {
        "id": 19178,
        "title": "The Coevolution of Language, Brains, and Technology",
        "authors": "Donald M. Morrison",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-48543-6_5"
    },
    {
        "id": 19179,
        "title": "Coevolution",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-58292-0_30714"
    },
    {
        "id": 19180,
        "title": "Review for \"Female-driven intersexual coevolution in beetle genitalia\"",
        "authors": "",
        "published": "2020-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/jeb.13627/v1/review1"
    },
    {
        "id": 19181,
        "title": "Cooperation, Norms, and Gene-Culture Coevolution",
        "authors": "Fabian Mankat",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4455734"
    },
    {
        "id": 19182,
        "title": "Review for \"Female-driven intersexual coevolution in beetle genitalia\"",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/jeb.13627/v1/review2"
    },
    {
        "id": 19183,
        "title": "Thermodynamic Basis of Coevolution and Self-optimization, and Ecosystem",
        "authors": "Chang YF",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "First, Darwinian evolution and mutual help seem to conflict. Second, since the second law of thermodynamics is based on isolated-equilibrium systems, it is in fact very limited. But, in essence, the vast majority of systems in the universe and nature are constantly changing and evolving with “life”. We proposed possible entropy decrease in isolated system due to internal interactions, etc. Based on biophysics, we research coevolution from thermodynamics and entropy by unified method. Let the entropy change dSA of a subsystem A is a set of its elements dSi , which may have various internal interactions with cooperation and complementary each other, so entropy may be decrease. This corresponds to the principle of least action of entropy change. It includes self evolution, and competition each other, etc. Third, evolution may combine self-optimization and selforganization, etc. Brain control of the body is the most typical of an internal interaction. No one would think that this only leads to an entropy increase. Fourth, we discuss the biological synergetics, ecosystem, and sustainable development. The cooperation-competition is a common phenomenon in the ecosystem. Coevolution is the more general evolution-development law of biological and active systems. This can unify natural competition and mutual help in biology, and is an important model for human development direction.",
        "link": "http://dx.doi.org/10.23880/psbj-16000233"
    },
    {
        "id": 19184,
        "title": "Coevolution",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12266.003.0016"
    },
    {
        "id": 19185,
        "title": "Genital Coevolution",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_302037"
    },
    {
        "id": 19186,
        "title": "Review for \"Coevolution of rostrum and brain in pig species\"",
        "authors": "",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cne.25461/v1/review2"
    },
    {
        "id": 19187,
        "title": "Coevolution: Pain or Promise?",
        "authors": "",
        "published": "2017-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315243665-23"
    },
    {
        "id": 19188,
        "title": "Adaptation, Specialization, and Coevolution within Phytobiomes",
        "authors": "David A Baltrus",
        "published": "No Date",
        "citations": 0,
        "abstract": "Growth patterns of individual plants and evolutionary trajectories of plant communities are intimately linked with and are critically affected by host-associated microbiomes. Research across systems has begun to shed light on how these phytobiomes are established and under laboratory and natural conditions, and have cultivated hope that a better understanding of the governing principles for host-microbe interactions can guide attempts to engineer microbiomes to boost agricultural yields. One important, yet relatively understudied, parameter in regards to phytobiome membership is the degree to which specialization and coevolution between plant species and microbial strains structures these communities. In this article, I provide an broad overview about current knowledge concerning mechanisms enabling adaptation and specialization of phytobiome communties to host plants as well as the potential for plants themselves to recruit and cultivate interactions with beneficial microbes. I further explore the possibility of host-beneficial microbe coevolution and suggest interactions that could promote the evolution of such close-knit partnerships. It is my hope that this overview will encourage future experiments that can begin to fill in this black box of ecological and evolutionary interactions across phytobiomes.",
        "link": "http://dx.doi.org/10.1101/120493"
    },
    {
        "id": 19189,
        "title": "Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-287-588-4_100101"
    },
    {
        "id": 19190,
        "title": "Gene-Culture Coevolution",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_302012"
    },
    {
        "id": 19191,
        "title": "Coevolution",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-15347-6_300145"
    },
    {
        "id": 19192,
        "title": "Coevolution of Camouflage",
        "authors": "Craig Reynolds",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1162/isal_a_00583"
    },
    {
        "id": 19193,
        "title": "1 MAPPING COEVOLUTION",
        "authors": "",
        "published": "2018-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7591/9781501705854-005"
    },
    {
        "id": 19194,
        "title": "Review for \"Coevolution, diversification and alternative states in two‐trophic communities\"",
        "authors": "",
        "published": "2020-5-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ele.13639/v1/review2"
    },
    {
        "id": 19195,
        "title": "Review for \"Coevolution, diversification and alternative states in two‐trophic communities\"",
        "authors": "",
        "published": "2020-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ele.13639/v1/review1"
    },
    {
        "id": 19196,
        "title": "Law's Coevolution",
        "authors": "Alan Calnan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3363356"
    },
    {
        "id": 19197,
        "title": "Review for \"Coevolution, diversification and alternative states in two‐trophic communities\"",
        "authors": "",
        "published": "2020-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ele.13639/v2/review1"
    },
    {
        "id": 19198,
        "title": "Tropical Intimacy:",
        "authors": "",
        "published": "2017-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvc77grg.15"
    },
    {
        "id": 19199,
        "title": "Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100067"
    },
    {
        "id": 19200,
        "title": "Coevolution",
        "authors": "Stéphane Tirard",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-662-65093-6_5255"
    },
    {
        "id": 19201,
        "title": "Review for \"Coevolution, diversification and alternative states in two‐trophic communities\"",
        "authors": "",
        "published": "2020-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ele.13639/v2/review2"
    },
    {
        "id": 19202,
        "title": "Culture-Gene Coevolution",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_301128"
    },
    {
        "id": 19203,
        "title": "Antagonistic coevolution between hosts and sexually transmitted infections",
        "authors": "Ben Ashby",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractSexually transmitted infections (STIs) are predicted to play an important role in the evolution of host mating strategies, and vice versa, yet our understanding of host-STI coevolution is limited. Here, I present a model of acute STI infection in populations with ephemeral mating dynamics, where hosts evolve their preference for healthy mates and STIs evolve mortality or sterility virulence. Mate choice readily evolves even though ephemeral mating and acute infections reduce the advantages of mate choice compared to previous theory based on serial monogamy and chronic infections. Selection for mate choice constrains both mortality and sterility virulence, leading to optimal strategies in each population, host polymorphism, or fluctuating selection. I show how the mode of virulence, costs associated with mate choice, recovery, and host lifespan impact on host-STI coevolution, with fluctuating selection most likely when hosts have intermediate lifespans, STIs cause sterility and longer infections, and costs of mate choice are not too high. The results reveal new insights into the evolution of mate choice and how coevolution unfolds for different host and STI life-history traits, providing increased support for parasite-mediated sexual selection as a potential driver of host mate choice, and mate choice as a constraint on STI virulence.",
        "link": "http://dx.doi.org/10.1101/590232"
    },
    {
        "id": 19204,
        "title": "Pollination and Coevolution",
        "authors": "T.J. Pandian",
        "published": "2022-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003258155-16"
    },
    {
        "id": 19205,
        "title": "The Integration of Phylogenetics, Historical Biogeography, and Host-Parasite Coevolution",
        "authors": "Andrew V. Z. Brower, Randall T. Schuh",
        "published": "2021-3-15",
        "citations": 0,
        "abstract": "This chapter highlights the use of consensus techniques and other approaches for understanding historical biogeographic relationships and patterns of associations between parasites and their hosts. It deals primarily with analyses that are often placed under the heading of cospeciation or codivergence, situations in which hosts and their parasites appear to have intimate, long-standing historical connections and in which speciation in the host may result in speciation in the parasite. This type of association appears to obtain for many internal parasites and for certain external parasites, such as lice. In addition, or on the other hand, there is a whole class of host associations, such as those between herbivorous insects and their food plants, in which the relationship of the parasite and the host generally does not show such long-term fidelity but involves many apparent host shifts. These latter situations are often referred to under the more liberal heading of coevolution.",
        "link": "http://dx.doi.org/10.7591/cornell/9781501752773.003.0009"
    },
    {
        "id": 19206,
        "title": "Cooperative Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100086"
    },
    {
        "id": 19207,
        "title": "Competitive Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100074"
    },
    {
        "id": 19208,
        "title": "Coevolution in Economic Systems",
        "authors": "Isabel Almudi, Francisco Fatas-Villafranca",
        "published": "2021-5-31",
        "citations": 6,
        "abstract": "Coevolution in economic systems plays a key role in the dynamics of contemporary societies. Coevolution operates when, considering several evolving realms within a socio-economic system, these realms mutually shape their respective innovation, replication and/or selection processes. The processes which emerge from coevolution should be analyzed as being globally codetermined in dynamic terms. The notion of coevolution has been appearing in the literature on modern innovation economics since the neo-Schumpeterian inception, four decades ago. In this Element, these antecedents are drawn upon to formally clarify and develop how the coevolution notion can expand the analytical and methodological scope of evolutionary economics, allowing for further unification and advance of evolutionary subfields.",
        "link": "http://dx.doi.org/10.1017/9781108767798"
    },
    {
        "id": 19209,
        "title": "Review for \"Coevolution of rostrum and brain in pig species\"",
        "authors": " Ehud Ahissar",
        "published": "2022-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cne.25461/v1/review1"
    },
    {
        "id": 19210,
        "title": "Review for \"Coevolution of rostrum and brain in pig species\"",
        "authors": "Bruno Cozzi",
        "published": "2023-1-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cne.25461/v2/review1"
    },
    {
        "id": 19211,
        "title": "Review for \"The coevolution of rostral keratin and tooth distribution in dinosaurs\"",
        "authors": "",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1098/rspb.2023.1713/v1/review1"
    },
    {
        "id": 19212,
        "title": "Review for \"The coevolution of rostral keratin and tooth distribution in dinosaurs\"",
        "authors": "",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1098/rspb.2023.1713/v1/review2"
    },
    {
        "id": 19213,
        "title": "Coevolution of the Sexes",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_300766"
    },
    {
        "id": 19214,
        "title": "Compositional Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_150"
    },
    {
        "id": 19215,
        "title": "NOTES",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.11"
    },
    {
        "id": 19216,
        "title": "Coevolution and Diversity",
        "authors": "T. J. Pandian",
        "published": "2021-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003176381-4"
    },
    {
        "id": 19217,
        "title": "Intelligences",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0011"
    },
    {
        "id": 19218,
        "title": "Index",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0019"
    },
    {
        "id": 19219,
        "title": "Life history and deleterious mutation rate coevolution",
        "authors": "Piret Avila, Laurent Lehmann",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThe cost of germline maintenance gives rise to a trade-off between lowering the deleterious mutation rate and investing in life history functions. Therefore, life history and the mutation rate coevolve, but this coevolution is not well understood. We develop a mathematical model to analyse the evolution of resource allocation traits, which simultaneously affect life history and the deleterious mutation rate. First, we show that the invasion fitness of such resource allocation traits can be approximated by the basic reproductive number of the least-loaded class; the expected lifetime production of offspring without deleterious mutations born to individuals without deleterious mutations. Second, we apply the model to investigate (i) the coevolution of reproductive effort and germline maintenance and (ii) the coevolution of age-at-maturity and germline maintenance. This analysis provides two resource allocation predictions when exposure to environmental mutagens is higher. First, selection favours higher allocation to germline maintenance, even if it comes at the expense of life history functions, and leads to a shift in allocation towards reproduction rather than survival. Second, life histories tend to be faster, characterized by individuals with shorter lifespans and smaller body sizes at maturity. Our results suggest that mutation accumulation via the cost of germline maintenance can be a major force shaping life-history traits.",
        "link": "http://dx.doi.org/10.1101/2022.05.11.491530"
    },
    {
        "id": 19220,
        "title": "FingerprintContacts: Predicting Alternative Conformations of Proteins from Coevolution",
        "authors": "Jiangyan Feng, Diwakar Shukla",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractProteins are dynamic molecules which perform diverse molecular functions by adopting different three-dimensional structures. Recent progress in residue-residue contacts prediction opens up new avenues for thede novoprotein structure prediction from sequence information. However, it is still difficult to predict more than one conformation from residue-residue contacts alone. This is due to the inability to deconvolve the complex signals of residue-residue contacts, i.e. spatial contacts relevant for protein folding, conformational diversity, and ligand binding. Here, we introduce a machine learning based method, called FingerprintContacts, for extending the capabilities of residue-residue contacts. This algorithm leverages the features of residue-residue contacts, that is, (1) a single conformation outperforms the others in the structural prediction using all the top ranking residue-residue contacts as structural constraints, and (2) conformation specific contacts rank lower and constitute a small fraction of residue-residue contacts. We demonstrate the capabilities of FingerprintContacts on eight ligand binding proteins with varying conformational motions. Furthermore, FingerprintContacts identifies small clusters of residue-residue contacts which are preferentially located in the dynamically fluctuating regions. With the rapid growth in protein sequence information, we expect FingerprintContacts to be a powerful first step in structural understanding of protein functional mechanisms.",
        "link": "http://dx.doi.org/10.1101/2020.04.13.037234"
    },
    {
        "id": 19221,
        "title": "Factors Affecting the Rates of Coevolution Between Obligate Avian Brood Parasites and Their Hosts",
        "authors": "Virginia E. Abernathy, Naomi E. Langmore",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-73138-4_2"
    },
    {
        "id": 19222,
        "title": "Pathologies",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0015"
    },
    {
        "id": 19223,
        "title": "Interaction",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0014"
    },
    {
        "id": 19224,
        "title": "ACKNOWLEDGMENTS",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.3"
    },
    {
        "id": 19225,
        "title": "Host-parasite coevolution can promote the evolution of seed banking as a bet-hedging strategy",
        "authors": "Mélissa Verin, Aurélien Tellier",
        "published": "2018-7",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/evo.13483"
    },
    {
        "id": 19226,
        "title": "Evolutionary Arms Races:",
        "authors": "",
        "published": "2017-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvc77grg.16"
    },
    {
        "id": 19227,
        "title": "Accountability",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0012"
    },
    {
        "id": 19228,
        "title": "Acknowledgments",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0002"
    },
    {
        "id": 19229,
        "title": "Test-Based Coevolution",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_822"
    },
    {
        "id": 19230,
        "title": "Coevolution of RNA and Peptides",
        "authors": "Peter Strazewski",
        "published": "2018-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b22230-29"
    },
    {
        "id": 19231,
        "title": "Chapter 10. Tropical Intimacy: Mutualism and Coevolution",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781400885589-013"
    },
    {
        "id": 19232,
        "title": "Synergistic coevolution accelerates genome evolution",
        "authors": "Daniel Preussger, Alexander Herbig, Christian Kost",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractEcological interactions are key drivers of evolutionary change. Although it is well-documented that antagonistic coevolution can accelerate molecular evolution, the evolutionary consequences of synergistic coevolution remain poorly understood. Here we show experimentally that also synergistic coevolution can speed up the rate of molecular evolution. Pairs of auxotrophic genotypes of the bacterium Escherichia coli, whose growth depended on a reciprocal exchange of amino acids, were experimentally coevolved, and compared to two control groups of independently growing cells. Coevolution drove the rapid emergence of a strong metabolic cooperation that correlated with a significantly increased number of mutations in coevolved auxotrophs as compared to monoculture controls. These results demonstrate that synergistic coevolution can cause rapid evolution that in the long run may drive diversification of mutualistically interacting species.One-Sentence SummarySynergistic coevolution among obligate mutualists increases the rate of molecular evolution relative to independent types.",
        "link": "http://dx.doi.org/10.1101/2021.05.19.444833"
    },
    {
        "id": 19233,
        "title": "BIBLIOGRAPHY",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.12"
    },
    {
        "id": 19234,
        "title": "Notes",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0017"
    },
    {
        "id": 19235,
        "title": "Preface",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0001"
    },
    {
        "id": 19236,
        "title": "Bibliography",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0018"
    },
    {
        "id": 19237,
        "title": "INDEX",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.13"
    },
    {
        "id": 19238,
        "title": "Decision letter for \"Female-driven intersexual coevolution in beetle genitalia\"",
        "authors": "",
        "published": "2020-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/jeb.13627/v2/decision1"
    },
    {
        "id": 19239,
        "title": "Detecting natural selection in trait-trait coevolution",
        "authors": "Daohan Jiang, Jianzhi Zhang",
        "published": "No Date",
        "citations": 1,
        "abstract": "ABSTRACTNo phenotypic trait evolves independently of all other traits, but the cause of trait-trait coevolution is poorly understood. While the coevolution could arise simply from pleiotropic mutations that simultaneously affect the traits concerned, it could also result from multivariate natural selection favoring certain trait relationships. To gain a general mechanistic understanding of trait-trait coevolution, we examine the evolution of 220 cell morphology traits across 16 natural strains of the yeastSaccharomyces cerevisiaeand the evolution of 24 wing morphology traits across 110 fly species of the family Drosophilidae, along with the variations of these traits among gene deletion or mutation accumulation lines (a.k.a. mutants). For numerous trait pairs, the phenotypic correlation among evolutionary lineages differs significantly from that among mutants. Specifically, we find hundreds of cases where the evolutionary correlation between traits is strengthened or reversed relative to the mutational correlation, which, according to our population genetic simulation, is likely caused by multivariate selection. Furthermore, we detect selection for enhanced modularity of the yeast traits analyzed. Together, these results demonstrate that trait-trait coevolution is shaped by natural selection and suggest that the pleiotropic structure of mutation is not optimal. Because the morphological traits analyzed here are chosen largely because of their measurability and thereby are not expected to be biased with regard to natural selection, our conclusion is likely general.",
        "link": "http://dx.doi.org/10.1101/2021.05.05.442737"
    },
    {
        "id": 19240,
        "title": "Causes",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0013"
    },
    {
        "id": 19241,
        "title": "[Illustrations]",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.4"
    },
    {
        "id": 19242,
        "title": "Decision letter for \"Female-driven intersexual coevolution in beetle genitalia\"",
        "authors": "",
        "published": "2020-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/jeb.13627/v1/decision1"
    },
    {
        "id": 19243,
        "title": "Canis Modernis",
        "authors": "Karalyn Kendall-Morwick",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj"
    },
    {
        "id": 19244,
        "title": "Parasitism of Paleozoic Crinoids and Related Stalked Echinoderms: Paleopathology, Ichnology, Coevolution, and Evolutionary Paleoecology",
        "authors": "James R. Thomka, Carlton E. Brett",
        "published": "2021",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-52233-9_9"
    },
    {
        "id": 19245,
        "title": "Index",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5749/j.ctvx5w8sw.10"
    },
    {
        "id": 19246,
        "title": "Coevolution",
        "authors": "Vishwa Gandhi",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-47829-6_505-1"
    },
    {
        "id": 19247,
        "title": "Coevolution",
        "authors": "Flávia M.D. Marquitti, Ana P.A. Assis",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-822562-2.00364-9"
    },
    {
        "id": 19248,
        "title": "Coevolution of age-structured tolerance and virulence",
        "authors": "Lydia J. Buckingham, Ben Ashby",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractHosts can evolve a variety of defences against parasitism, including resistance (which prevents or reduces the spread of infection) and tolerance (which protects against virulence). Some organisms have evolved different levels of tolerance at different life-stages, which is likely to be the result of coevolution with pathogens, and yet it is currently unclear how coevolution drives patterns of age-specific tolerance. Here, we use a model of tolerance-virulence coevolution to investigate how age structure influences coevolutionary dynamics. Specifically, we explore how coevolution unfolds when tolerance and virulence (disease-induced mortality) are age-specific compared to when these traits are uniform across the host lifespan. We find that coevolutionary cycling is relatively common when host tolerance is age-specific, but cycling does not occur when tolerance is the same across all ages. We also find that age-structured tolerance can lead to selection for higher virulence in shorter-lived than in longer-lived hosts, whereas non-age-structured tolerance always leads virulence to increase with host lifespan. Our findings therefore suggest that age structure can have substantial qualitative impacts on host-pathogen coevolution.",
        "link": "http://dx.doi.org/10.1101/2023.12.18.572099"
    },
    {
        "id": 19249,
        "title": "Bibliography",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5749/j.ctvx5w8sw.9"
    },
    {
        "id": 19250,
        "title": "Appendix A: STEPS FOR MAPPING COEVOLUTION",
        "authors": "",
        "published": "2018-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7591/9781501705854-012"
    },
    {
        "id": 19251,
        "title": "Coevolution of norm psychology and cooperation through exapted conformity",
        "authors": "Yuta Kido, Masanori Takezawa",
        "published": "No Date",
        "citations": 0,
        "abstract": "People willingly follow norms and values, often incurring material costs. This behavior supposedly stems from evolved norm psychology, contributing to large-scale cooperation among humans. It has been argued that cooperation is influenced by two types of norms: injunctive and descriptive. This study theoretically explores the socialization of humans under these norms. Our agent-based model simulates scenarios where diverse agents with heterogeneous norm psychologies engage in collective action to maximize their utility functions that capture three motives: gaining material payoff, following injunctive and descriptive norms. Multilevel selective pressure drives the evolution of norm psychology that affects the utility function. Further, we develop a model with exapted conformity, assuming selective advantage for descriptive norm psychology. We show that norm psychology can evolve via cultural group selection. We then identify two normative conditions that favor the evolution of norm psychology, and therefore cooperation: injunctive norms promoting punitive behavior and descriptive norms. Furthermore, we delineate different characteristics of cooperative societies under these two conditions and explore the potential for a macro transition between them. Together, our results validate the emergence of large-scale cooperative societies through social norms and suggest complementary roles that conformity and punishment play in human prosociality.",
        "link": "http://dx.doi.org/10.31235/osf.io/r6hj9"
    },
    {
        "id": 19252,
        "title": "Front Matter",
        "authors": "",
        "published": "2020-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5325/j.ctv1c5cscj.1"
    },
    {
        "id": 19253,
        "title": "Review for \"Mutualistic coevolution and community diversity favour persistence in metacommunities under environmental changes\"",
        "authors": "",
        "published": "2022-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1098/rspb.2022.1909/v1/review1"
    },
    {
        "id": 19254,
        "title": "Decision letter for \"Coevolution of rostrum and brain in pig species\"",
        "authors": "",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cne.25461/v2/decision1"
    },
    {
        "id": 19255,
        "title": "High Diversity of Brood Parasites in China and Coevolution Between Cuckoos and Their Hosts",
        "authors": "Wei Liang, Canchao Yang, Anders Pape Møller",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-73138-4_14"
    },
    {
        "id": 19256,
        "title": "Notes",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5749/j.ctvx5w8sw.8"
    },
    {
        "id": 19257,
        "title": "A Differential Equation for Mutation Rates in Environmental Coevolution",
        "authors": "C E Neal-Sturgess",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractIn their paper Natural selection for least action (Kaila and Annila 2008) they depict evolution as a process conforming to the Principle of Least Action (PLA). From this concept, together with the Coevolution model of Lewontin, an equation of motion for environmental coevolution is derived which shows that it is the time rate (frequency) of evolutionary change of the organism (mutations) that responds to changes in the environment. It is not possible to compare the theory with viral or bacterial mutation rates, as these are not measured on a time base. There is positive evidence from population level avian studies where the coefficient of additive evolvability (Cav) and its square (IA) change with environmental favourability in agreement with this model. Further analysis shows that the time rate of change of the coefficient of additive evolvability (Cav) and its square (IA) are linear with environmental favourability, which could help in defining the Lagrangian of the environmental effects.",
        "link": "http://dx.doi.org/10.1101/2021.03.19.436176"
    },
    {
        "id": 19258,
        "title": "Introduction",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5749/j.ctvx5w8sw.3"
    },
    {
        "id": 19259,
        "title": "Coevolution",
        "authors": "Vishwa Gandhi",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-55065-7_505"
    },
    {
        "id": 19260,
        "title": "Conclusion",
        "authors": "",
        "published": "2020-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5749/j.ctvx5w8sw.7"
    },
    {
        "id": 19261,
        "title": "The Coevolution",
        "authors": "Edward Ashford Lee",
        "published": "2020-4-21",
        "citations": 24,
        "abstract": "Should digital technology be viewed as a new life form, sharing our ecosystem and coevolving with us?\nAre humans defining technology, or is technology defining humans? In this book, Edward Ashford Lee considers the case that we are less in control of the trajectory of technology than we think. It shapes us as much as we shape it, and it may be more defensible to think of technology as the result of a Darwinian coevolution than the result of top-down intelligent design. Richard Dawkins famously said that a chicken is an egg's way of making another egg. Is a human a computer's way of making another computer? To understand this question requires a deep dive into how evolution works, how humans are different from computers, and how the way technology develops resembles the emergence of a new life form on our planet.\nLee presents the case for considering digital beings to be living, then offers counterarguments. What we humans do with our minds is more than computation, and what digital systems do—be teleported at the speed of light, backed up, and restored—may never be possible for humans. To believe that we are simply computations, he argues, is a “dataist” faith and scientifically indefensible. Digital beings depend on humans—and humans depend on digital beings. More likely than a planetary wipe-out of humanity is an ongoing, symbiotic coevolution of culture and technology.",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.001.0001"
    },
    {
        "id": 19262,
        "title": "Decision letter for \"Coevolution of rostrum and brain in pig species\"",
        "authors": "",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cne.25461/v1/decision1"
    },
    {
        "id": 19263,
        "title": "[ Front Matter ]",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0020"
    },
    {
        "id": 19264,
        "title": "Negative Feedback",
        "authors": "",
        "published": "2020-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/12307.003.0007"
    },
    {
        "id": 19265,
        "title": "Review for \"Mutualistic coevolution and community diversity favour persistence in metacommunities under environmental changes\"",
        "authors": "",
        "published": "2022-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1098/rspb.2022.1909/v1/review2"
    },
    {
        "id": 19266,
        "title": "Sympatric ecological divergence with coevolution of niche preference",
        "authors": "Pavel Payne, Jitka Polechová",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractReinforcement, the increase of assortative mating driven by selection against unfit hybrids, is conditional on pre-existing divergence. Yet, for ecological divergence to precede the evolution of assortment, strict symmetries between fitnesses in niches must hold, and/or there must be low gene flow between the nascent species. It has thus been argued that conditions favouring sympatric speciation are rarely met in nature. Indeed, we show that under disruptive selection, violating symmetries in niche sizes and increasing strength of the trade-off in selection between the niches quickly leads to loss of genetic variation, instead of evolution of specialists. The region of the parameter space where polymorphism is maintained further narrows with increasing number of loci encoding the diverging trait and the rate of recombination between them. Yet, evolvable assortment and pre-existing assortment both substantially broaden the parameter space within which polymorphism is maintained. Notably, pre-existing niche preference speeds up further increase of assortment, thus facilitating reinforcement in the later phases of speciation. We conclude that in order for sympatric ecological divergence to occur, niche preference must co-evolve throughout the divergence process. Even if populations come into secondary contact, having diverged in isolation, niche preference substantially broadens the conditions for coexistence in sympatry and completion of the speciation process.",
        "link": "http://dx.doi.org/10.1101/2019.12.20.884817"
    },
    {
        "id": 19267,
        "title": "Coevolution of Networks and Behavior",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_100116"
    },
    {
        "id": 19268,
        "title": "Coevolution",
        "authors": "Brian D. Inouye",
        "published": "2019-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1525/9780520951785-026"
    },
    {
        "id": 19269,
        "title": "Acknowledgments",
        "authors": "",
        "published": "2020-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9780271088402-001"
    },
    {
        "id": 19270,
        "title": "Decision letter for \"Coevolution, diversification and alternative states in two‐trophic communities\"",
        "authors": "",
        "published": "2020-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ele.13639/v3/decision1"
    }
]