[
    {
        "id": 1305,
        "title": "When the Few Outweigh the Many: Illicit Content Recognition with Few-Shot Learning",
        "authors": "G. Cascavilla, G. Catolino, M. Conti, D. Mellios, D. Tamburri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012049400003555"
    },
    {
        "id": 1306,
        "title": "Metric-Based Few-Shot Learning for Pollen Grain Image Classification",
        "authors": "Philipp Viertel, Matthias König, Jan Rexilius",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011727900003411"
    },
    {
        "id": 1307,
        "title": "A few shots at few shot learning",
        "authors": "Donald Waagen, Don Hulsey, David Gray",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2661719"
    },
    {
        "id": 1308,
        "title": "Learning End-to-End Deep Learning Based Image Signal Processing Pipeline Using a Few-Shot Domain Adaptation",
        "authors": "Georgy Perevozchikov, Egor Ershov",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012268900003660"
    },
    {
        "id": 1309,
        "title": "Image Semantic Segmentation Based on Few-Shot Learning",
        "authors": "Renjie Ma, An-Min Zou",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451379"
    },
    {
        "id": 1310,
        "title": "Learning Class-Aware Prototypical Representations for Few-Shot Learning",
        "authors": "Xiaoying Chen, Weijie Ye",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icivc58118.2023.10270788"
    },
    {
        "id": 1311,
        "title": "Few-Shot Open-Set Learning for On-Device Customization of KeyWord Spotting Systems",
        "authors": "Manuele Rusci, Tinne Tuytelaars",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1904"
    },
    {
        "id": 1312,
        "title": "Unsupervised Few-Shot Image Segmentation with Dense Feature Learning and Sparse Clustering",
        "authors": "Kuangdai Leng, Robert Atwood, Winfried Kockelmann, Deniza Chekrygina, Jeyan Thiyagalingam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012380700003660"
    },
    {
        "id": 1313,
        "title": "Active Learning with few shot learning for crisis management",
        "authors": "Matthieu François, Paul Gay",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3617233.3617278"
    },
    {
        "id": 1314,
        "title": "A two-generation based method for few-shot learning with few-shot instance-level privileged information",
        "authors": "Jian Xu, Jinghui He, Bo Liu, Fan Cao, Yanshan Xiao",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-024-05388-z"
    },
    {
        "id": 1315,
        "title": "Few-Shot Learning for WiFi Fingerprinting Indoor Positioning",
        "authors": "Zhenjie Ma, Ke Shi",
        "published": "2023-10-13",
        "citations": 1,
        "abstract": "In recent years, deep-learning-based WiFi fingerprinting has been intensively studied as a promising technology for providing accurate indoor location services. However, it still demands a time-consuming and labor-intensive site survey and suffers from the fluctuation of wireless signals. To address these issues, we propose a prototypical network-based positioning system, which explores the power of few-shot learning to establish a robust RSSI-position matching model with limited labels. Our system uses a temporal convolutional network as the encoder to learn an embedding of the individual sample, as well as its quality. Each prototype is a weighted combination of the embedded support samples belonging to its position. Online positioning is performed for an embedded query sample by simply finding the nearest position prototype. To mitigate the space ambiguity caused by signal fluctuation, the Kalman Filter estimates the most likely current RSSI based on the historical measurements and current measurement in the online stage. The extensive experiments demonstrate that the proposed system performs better than the existing deep-learning-based models with fewer labeled samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23208458"
    },
    {
        "id": 1316,
        "title": "Mitigating Catastrophic Forgetting for Few-Shot Spoken Word Classification Through Meta-Learning",
        "authors": "Ruan van der Merwe, Herman Kamper",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-385"
    },
    {
        "id": 1317,
        "title": "Few-shot learning using the median prototype of the support set",
        "authors": "Eu-Tteum Baek,  ",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Meta-learning is metacognition that instantly distinguishes between knowing and unknown. It is a learning method that adapts and solves new problems by self-learning with a small amount of data.A few-shot learning method is a type of meta-learning method that accurately predicts query data even with a very small support set. In this study, we propose a method to solve the limitations of the prototype created with the mean-point vector of each class. For this purpose, we use the few-shot learning method that created the prototype used in the few-shot learning method as the median prototype. For quantitative evaluation, a handwriting recognition dataset and mini-Imagenet dataset were used and compared with the existing method. Through the experimental results, it was confirmed that the performance was improved compared to the existing method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30693/smj.2023.12.1.24"
    },
    {
        "id": 1318,
        "title": "Lightweight Workloads in Heterogeneous Federated Learning via Few-shot Learning",
        "authors": "Hongrui Shi, Valentin Radu, Po Yang",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3630048.3630185"
    },
    {
        "id": 1319,
        "title": "Few-shot learning based on deep learning: A survey",
        "authors": "Wu Zeng, Zheng-ying Xiao",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>In recent years, with the development of science and technology, powerful computing devices have been constantly developing. As an important foundation, deep learning (DL) technology has achieved many successes in multiple fields. In addition, the success of deep learning also relies on the support of large-scale datasets, which can provide models with a variety of images. The rich information in these images can help the model learn more about various categories of images, thereby improving the classification performance and generalization ability of the model. However, in real application scenarios, it may be difficult for most tasks to collect a large number of images or enough images for model training, which also restricts the performance of the trained model to a certain extent. Therefore, how to use limited samples to train the model with high performance becomes key. In order to improve this problem, the few-shot learning (FSL) strategy is proposed, which aims to obtain a model with strong performance through a small amount of data. Therefore, FSL can play its advantages in some real scene tasks where a large number of training data cannot be obtained. In this review, we will mainly introduce the FSL methods for image classification based on DL, which are mainly divided into four categories: methods based on data enhancement, metric learning, meta-learning and adding other tasks. First, we introduce some classic and advanced FSL methods in the order of categories. Second, we introduce some datasets that are often used to test the performance of FSL methods and the performance of some classical and advanced FSL methods on two common datasets. Finally, we discuss the current challenges and future prospects in this field.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2024029"
    },
    {
        "id": 1320,
        "title": "Weakly Supervised Few-Shot and Zero-Shot Semantic Segmentation with Mean Instance Aware Prompt Learning",
        "authors": "Prashant Pandey, Mustafa Chasmai, Monish Natarajan, Brejesh Lall",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00009"
    },
    {
        "id": 1321,
        "title": "Angular Penalty for Few-Shot Incremental 3D Object Learning",
        "authors": "Bingtao Ma, Yang Cong",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10192030"
    },
    {
        "id": 1322,
        "title": "Few-Shot Personality-Specific Image Captioning via Meta-Learning",
        "authors": "Mehrdad Hosseinzadeh, Yang Wang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crv60082.2023.00048"
    },
    {
        "id": 1323,
        "title": "Weighted Prototype Network for Few-Shot Learning Via Graph Structure",
        "authors": "Yifan Zhou, Lei Yu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4379715"
    },
    {
        "id": 1324,
        "title": "Few-Shot Learning for New Environment Adaptation",
        "authors": "Ouya Wang, Shenglong Zhou, Geoffrey Ye Li",
        "published": "2023-12-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437273"
    },
    {
        "id": 1325,
        "title": "Logarithm-transform aided Gaussian Sampling for Few-Shot Learning",
        "authors": "Vaibhav Ganatra",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00032"
    },
    {
        "id": 1326,
        "title": "Few-Shot Learning for CNN-based Animal Classification in Camera Traps using an Infrared Camera",
        "authors": "Koki Kishi, Masako Kishimoto, Sulfayanti F. Situju, Hironori Takimoto, Akihiro Kanagawa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/icisip2023.005"
    },
    {
        "id": 1327,
        "title": "Learning to Learn from Corrupted Data for Few-Shot Learning",
        "authors": "Yuexuan An, Xingyu Zhao, Hui Xue",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Few-shot learning which aims to generalize knowledge learned from annotated base training data to recognize unseen novel classes has attracted considerable attention. Existing few-shot methods rely on completely clean training data. However, in the real world, the training data are always corrupted and accompanied by noise due to the disturbance in data transmission and low-quality annotation, which severely degrades the performance and generalization capability of few-shot models. To address the problem, we propose a unified peer-collaboration learning (PCL) framework to extract valid knowledge from corrupted data for few-shot learning. PCL leverages two modules to mimic the peer collaboration process which cooperatively evaluates the importance of each sample. Specifically, each module first estimates the importance weights of different samples by encoding the information provided by the other module from both global and local perspectives. Then, both modules leverage the obtained importance weights to guide the reevaluation of the loss value of each sample. In this way, the peers can mutually absorb knowledge to improve the robustness of few-shot models. Experiments verify that our framework combined with different few-shot methods can significantly improve the performance and robustness of original models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/381"
    },
    {
        "id": 1328,
        "title": "Efficient plant disease identification using few-shot learning: a transfer learning approach",
        "authors": "Pınar Uskaner Hepsağ",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17824-2"
    },
    {
        "id": 1329,
        "title": "Few-Shot Learning Based on Deep Learning for Image Classification",
        "authors": "Linglong Tan, Fengzhi Wu, Xianmeng Meng",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccisp59915.2023.10355802"
    },
    {
        "id": 1330,
        "title": "Exploring lottery ticket hypothesis in few-shot learning",
        "authors": "Yu Xie, Qiang Sun, Yanwei Fu",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126426"
    },
    {
        "id": 1331,
        "title": "Few-Shot Multimodal Learning for Social Relation Understanding With Supervised Bi-Transformers",
        "authors": "Hanqing Li, Niannian Chen",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/swc57546.2023.10448819"
    },
    {
        "id": 1332,
        "title": "Multi Aspect Attention Online Integrated Distillation For Few-shot Learning",
        "authors": "Cailing Wang, Qingchen Wei",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326814"
    },
    {
        "id": 1333,
        "title": "Few-shot Learning with Prompting Methods",
        "authors": "Morteza Bahrami, Muharram Mansoorizadeh, Hassan Khotanlou",
        "published": "2023-2-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipria59240.2023.10147172"
    },
    {
        "id": 1334,
        "title": "Behavior Retrieval: Few-Shot Imitation Learning by Querying Unlabeled Datasets",
        "authors": "Maximilian Du, Suraj Nair, Dorsa Sadigh, Chelsea Finn",
        "published": "2023-7-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.011"
    },
    {
        "id": 1335,
        "title": "Learning Spatially-Adaptive Squeeze-Excitation Networks for Few Shot Image Synthesis",
        "authors": "Jianghao Shen, Tianfu Wu",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222248"
    },
    {
        "id": 1336,
        "title": "Prompt-Based Metric Learning for Few-Shot NER",
        "authors": "Yanru Chen, Yanan Zheng, Zhilin Yang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.451"
    },
    {
        "id": 1337,
        "title": "Few-Shot Continual Learning: Approaches and Future Directions",
        "authors": "Rupatai Lichode, Swapnili Karmore",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307756"
    },
    {
        "id": 1338,
        "title": "Subspace Adaptation Prior for Few-Shot Learning",
        "authors": "Mike Huisman, Aske Plaat, Jan N. van Rijn",
        "published": "2024-2",
        "citations": 1,
        "abstract": "AbstractGradient-based meta-learning techniques aim to distill useful prior knowledge from a set of training tasks such that new tasks can be learned more efficiently with gradient descent. While these methods have achieved successes in various scenarios, they commonly adapt all parameters of trainable layers when learning new tasks. This neglects potentially more efficient learning strategies for a given task distribution and may be susceptible to overfitting, especially in few-shot learning where tasks must be learned from a limited number of examples. To address these issues, we propose Subspace Adaptation Prior (SAP), a novel gradient-based meta-learning algorithm that jointly learns good initialization parameters (prior knowledge) and layer-wise parameter subspaces in the form of operation subsets that should be adaptable. In this way, SAP can learn which operation subsets to adjust with gradient descent based on the underlying task distribution, simultaneously decreasing the risk of overfitting when learning new tasks. We demonstrate that this ability is helpful as SAP yields superior or competitive performance in few-shot image classification settings (gains between 0.1% and 3.9% in accuracy). Analysis of the learned subspaces demonstrates that low-dimensional operations often yield high activation strengths, indicating that they may be important for achieving good few-shot learning performance. For reproducibility purposes, we publish all our research code publicly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06393-y"
    },
    {
        "id": 1339,
        "title": "Cross Domain Few-Shot Learning for Fine-Grained SAR Ship Recognition",
        "authors": "Binquan Li, Yuan Yao, Pengwei Li, Qiao Wang",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451173"
    },
    {
        "id": 1340,
        "title": "Non-episodic Variational Weight Imprinting for Few-Shot Learning",
        "authors": "V. Padma, Chakravarthy Bhagvati",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01732-1"
    },
    {
        "id": 1341,
        "title": "Plant Leaf Diseases Classification Based on Few-Shot Learning",
        "authors": "Wei Wu",
        "published": "2023-3-21",
        "citations": 0,
        "abstract": "Plant leaf disease is one of the important factors affecting the normal growth of plants. It is important to accurately identify the types of leaf disease and take effective measures to ensure the increase of crop production. In this study, we propose a plant leaf diseases classification method based on Few-Shot Learning (FSL), which can obtain good identification accuracy in the classification task with few samples. By changing the parameter setting in FSL, some key features affecting classification accuracy are revealed. The proposal of this research method expands the application scope of artificial intelligence in agriculture, which has important practical significance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ajst.v5i2.6287"
    },
    {
        "id": 1342,
        "title": "Self-Supervised and Few-Shot Contrastive Learning Frameworks for Text Clustering",
        "authors": "Haoxiang Shi, Tetsuya Sakai",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3302913"
    },
    {
        "id": 1343,
        "title": "Few shot learning approaches to essay scoring",
        "authors": "Robert K. Helmeczi, Savas Yıldırım, Mucahit Cevik, Sojin Lee",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21428/594757db.8702fa2f"
    },
    {
        "id": 1344,
        "title": "Learning Few-shot Segmentation from Bounding Box Annotations",
        "authors": "Byeolyi Han, Tae-Hyun Oh",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00374"
    },
    {
        "id": 1345,
        "title": "Recent Advancement for Few-Shot Learning",
        "authors": "Ronghao Zhang",
        "published": "2023-12",
        "citations": 1,
        "abstract": "Machine learning has revolutionized data-driven decision-making, few-shot learning extends its capabilities to situations with data scarcity, offering solutions to some of the most pressing challenges in various domains. This article review illustrated the recent advances for few-shot learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56397/jpeps.2023.12.06"
    },
    {
        "id": 1346,
        "title": "Editorial note for few-shot learning for intelligent multimedia systems",
        "authors": "",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00530-023-01150-6"
    },
    {
        "id": 1347,
        "title": "MEAL: Stable and Active Learning for Few-Shot Prompting",
        "authors": "Abdullatif Köksal, Timo Schick, Hinrich Schuetze",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.36"
    },
    {
        "id": 1348,
        "title": "Domain-Aware Few-Shot Learning for Optical Coherence Tomography Noise Reduction",
        "authors": "Deborah Pereg",
        "published": "2023-10-30",
        "citations": 1,
        "abstract": "Speckle noise has long been an extensively studied problem in medical imaging. In recent years, there have been significant advances in leveraging deep learning methods for noise reduction. Nevertheless, adaptation of supervised learning models to unseen domains remains a challenging problem. Specifically, deep neural networks (DNNs) trained for computational imaging tasks are vulnerable to changes in the acquisition system’s physical parameters, such as: sampling space, resolution, and contrast. Even within the same acquisition system, performance degrades across datasets of different biological tissues. In this work, we propose a few-shot supervised learning framework for optical coherence tomography (OCT) noise reduction, that offers high-speed training (of the order of seconds) and requires only a single image, or part of an image, and a corresponding speckle-suppressed ground truth, for training. Furthermore, we formulate the domain shift problem for OCT diverse imaging systems and prove that the output resolution of a despeckling trained model is determined by the source domain resolution. We also provide possible remedies. We propose different practical implementations of our approach, verify and compare their applicability, robustness, and computational efficiency. Our results demonstrate the potential to improve sample complexity, generalization, and time efficiency, for coherent and non-coherent noise reduction via supervised learning models, that can also be leveraged for other real-time computer vision applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jimaging9110237"
    },
    {
        "id": 1349,
        "title": "Few-shot Fault Detection Based on Meta Learning for Transmission Lines",
        "authors": "Siying Zhang, Chao Jing, Huimin Wang, Yundong Shi",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451906"
    },
    {
        "id": 1350,
        "title": "Cycle optimization metric learning for few-shot classification",
        "authors": "Qifan Liu, Wenming Cao, Zhihai He",
        "published": "2023-7",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109468"
    },
    {
        "id": 1351,
        "title": "Can we improve meta-learning model in few-shot learning by aligning data distributions?",
        "authors": "Pinzhuo Tian, Hang Yu",
        "published": "2023-10",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110800"
    },
    {
        "id": 1352,
        "title": "Few-Shot Classification of Seals Based on Improved Ensemble Learning Algorithm",
        "authors": "Chao Wang, Xiaohua Niu, Qilin Zhou",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlccim60412.2023.00065"
    },
    {
        "id": 1353,
        "title": "Learning and Adapting Diverse Representations for Cross-domain Few-shot Learning",
        "authors": "Ge Liu, Zhongqiang Zhang, Fuhan Cai, Duo Liu, Xiangzhong Fang",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdmw60847.2023.00043"
    },
    {
        "id": 1354,
        "title": "Bayesian Sharpness-Aware Prompt Tuning for Cross-Domain Few-shot Learning",
        "authors": "Shuo Fan, Liansheng Zhuang, Aodi Li",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191224"
    },
    {
        "id": 1355,
        "title": "Multi-scale Self-similarity Network for Few-Shot Segmentation",
        "authors": "Jingtao Liang, Zongqing Lu",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424910"
    },
    {
        "id": 1356,
        "title": "Few-shot learning on point clouds for railroad segmentation",
        "authors": "Abdur Razzaq Fayjie, Patrick Vandewalle",
        "published": "2023-1-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2352/ei.2023.35.17.3dia-100"
    },
    {
        "id": 1357,
        "title": "Improving Adversarial Robustness of Few-Shot Learning with Contrastive Learning and Hypersphere Embedding",
        "authors": "Madhushan Buwaneswaran, Tehara Fonseka, Apurva Narayan, Katarina Grolinger",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00041"
    },
    {
        "id": 1358,
        "title": "CORL: Compositional Representation Learning for Few-Shot Classification",
        "authors": "Ju He, Adam Kortylewski, Alan Yuille",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00388"
    },
    {
        "id": 1359,
        "title": "MCSNet:Multi-Scene Crack Segmentation Network Based on Few-Shot Learning",
        "authors": "Yang Liu, Xiangyang Xu, Zhongjian Dai, Yan Zhao, Jingxin Shi",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450407"
    },
    {
        "id": 1360,
        "title": "Few-shot Class Incremental Learning for Event Extraction",
        "authors": "Xuemeng Tian, Bin Ge, Chi Xu",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdia60676.2023.10429065"
    },
    {
        "id": 1361,
        "title": "Adaptive Anchor Label Propagation for Transductive Few-Shot Learning",
        "authors": "Michalis Lazarou, Yannis Avrithis, Guangyu Ren, Tania Stathaki",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223033"
    },
    {
        "id": 1362,
        "title": "Metric-based few-shot learning method for driver distracted behaviors detection",
        "authors": "Peng Wang, Haibin Li, Boxu Zhang, Minghui Xia",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424735"
    },
    {
        "id": 1363,
        "title": "Few Shot Object Detection Based on Graph Attention Network",
        "authors": "Rou Ding, Yu Zhang",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/prml59573.2023.10348234"
    },
    {
        "id": 1364,
        "title": "Few-Shot Learning with Feature Pairing and Mean Discrepancy",
        "authors": "K K Singh, K Hima Bindu",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscss57650.2023.10169437"
    },
    {
        "id": 1365,
        "title": "Few-shot learning for trajectory outlier detection with only normal trajectories",
        "authors": "Yueyang Su, Di Yao, Jingping Bi",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191398"
    },
    {
        "id": 1366,
        "title": "Enhanced few-shot learning for plant leaf diseases recognition",
        "authors": "Wei Wu",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "With the breakthrough progress of deep learning technology in multiple fields, its application in specialized areas such as plant leaf disease recognition is constrained by the cost of data annotation and the lack of sample diversity. This study proposes an enhanced few-shot learning method that integrates self-supervised learning and semi-supervised learning to improve the model's generalization ability in plant leaf disease recognition tasks. Through self-supervised pre-training and semi-supervised fine-tuning, the model can effectively utilize limited annotated data and expand the training set by generating high-quality pseudo-labels. Experimental results show that this method significantly improves the model's recognition performance on unseen categories. Future research will explore more self-supervised tasks and complex pseudo-label generation algorithms to further enhance the model's accuracy and robustness, promoting the application of few-shot learning technology in the field of agriculture.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jceim.v11i3.06"
    },
    {
        "id": 1367,
        "title": "Few-shot Learning for Bagel Defect Detection",
        "authors": "Hsien-Yang Liao, Chih-Cheng Chen, An-Bang Cheng",
        "published": "2023-2-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecei57668.2023.10105421"
    },
    {
        "id": 1368,
        "title": "Adaptive manifold for imbalanced transductive few-shot learning",
        "authors": "Michalis Lazarou, Yannis Avrithis, Tania Stathaki",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00229"
    },
    {
        "id": 1369,
        "title": "Image-free classification via few-shot learning",
        "authors": "Songbo Wan, Xuyang Chang, Liheng Bian",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2686474"
    },
    {
        "id": 1370,
        "title": "Learning Spatial-Temporal Decoupling Representations for Few-Shot Action Recognition",
        "authors": "Yu Zhang, Zhonghua Sun, Meng Dai, Jinchao Feng, Kebin Jia",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450167"
    },
    {
        "id": 1371,
        "title": "CoDA-Few: Few Shot Domain Adaptation for Medical Image Semantic Segmentation",
        "authors": "Arthur Pinto, Jefersson Santos, Hugo Oliveira, Alexei Machado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011616800003417"
    },
    {
        "id": 1372,
        "title": "Collaborative Self-Supervised Transductive Few-Shot Learning for Remote Sensing Scene Classification",
        "authors": "Haiyan Han, Yangchao Huang, Zhe Wang",
        "published": "2023-9-11",
        "citations": 2,
        "abstract": "With the advent of deep learning and the accessibility of massive data, scene classification algorithms based on deep learning have been extensively researched and have achieved exciting developments. However, the success of deep models often relies on a large amount of annotated remote sensing data. Additionally, deep models are typically trained and tested on the same set of classes, leading to compromised generalization performance when encountering new classes. This is where few-shot learning aims to enable models to quickly generalize to new classes with only a few reference samples. In this paper, we propose a novel collaborative self-supervised transductive few-shot learning (CS2TFSL) algorithm for remote sensing scene classification. In our approach, we construct two distinct self-supervised auxiliary tasks to jointly train the feature extractor, aiming to obtain a powerful representation. Subsequently, the feature extractor’s parameters are frozen, requiring no further training, and transferred to the inference stage. During testing, we employ transductive inference to enhance the associative information between the support and query sets by leveraging additional sample information in the data. Extensive comparisons with state-of-the-art few-shot scene classification algorithms on the WHU-RS19 and NWPU-RESISC45 datasets demonstrate the effectiveness of the proposed CS2TFSL. More specifically, CS2TFSL ranks first in the settings of five-way one-shot and five-way five-shot. Additionally, detailed ablation experiments are conducted to analyze the CS2TFSL. The experimental results reveal significant and promising performance improvements in few-shot scene classification through the combination of self-supervised learning and direct transductive inference.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12183846"
    },
    {
        "id": 1373,
        "title": "Dynamic Heuristic Approach to Enhance the Performance of Few-Shot Meta-Learning",
        "authors": "Amer Mirkhan, Numan Çelebİ",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dese60595.2023.10469142"
    },
    {
        "id": 1374,
        "title": "Dual-Level Curriculum Meta-Learning for Noisy Few-Shot Learning Tasks",
        "authors": "Xiaofan Que, Qi Yu",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Few-shot learning (FSL) is essential in many practical applications. However, the limited training examples make the models more vulnerable to label noise, which can lead to poor generalization capability. To address this critical challenge, we propose a curriculum meta-learning model that employs a novel dual-level class-example sampling strategy to create a robust curriculum for adaptive task distribution formulation and robust model training. The dual-level framework proposes a heuristic class sampling criterion that measures pairwise class boundary complexity to form a class curriculum; it uses effective example sampling through an under-trained proxy model to form an example curriculum. By utilizing both class-level and example-level information, our approach is more robust to handle limited training data and noisy labels that commonly occur in few-shot learning tasks.\nThe model has efficient convergence behavior, which is verified through rigorous convergence analysis. Additionally, we establish a novel error bound through a hierarchical PAC-Bayesian analysis for curriculum meta-learning under noise. We conduct extensive experiments that demonstrate the effectiveness of our framework in outperforming existing noisy few-shot learning methods under various few-shot classification benchmarks. Our code is available at https://github.com/ritmininglab/DCML.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i13.29392"
    },
    {
        "id": 1375,
        "title": "Engine fault detection algorithm EA-EFNC based on few-shot learning",
        "authors": "Caiyun Wu, Fuqi Li, Fan Bai",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675146"
    },
    {
        "id": 1376,
        "title": "Learning to complement: Relation complementation network for few-shot class-incremental learning",
        "authors": "Ye Wang, Yaxiong Wang, Guoshuai Zhao, Xueming Qian",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.111130"
    },
    {
        "id": 1377,
        "title": "Correction: Global and local representation collaborative learning for few-shot learning",
        "authors": "Jun Zhou, Qingling Cai",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10845-023-02101-8"
    },
    {
        "id": 1378,
        "title": "Incremental few-shot learning via implanting and consolidating",
        "authors": "Yiting Li, Haiyue Zhu, Jun Ma, Cheng Xiang, Prahlad Vadakkepat",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126800"
    },
    {
        "id": 1379,
        "title": "Enhancing Few-Shot Learning for Tropical Cyclone Severity Prediction: A Deep Learning Approach",
        "authors": "Harshal Patil, Snehal Bhosale",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/mmep.100639"
    },
    {
        "id": 1380,
        "title": "Few-Shot Learning for Issue Report Classification",
        "authors": "Giuseppe Colavito, Filippo Lanubile, Nicole Novielli",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nlbse59153.2023.00011"
    },
    {
        "id": 1381,
        "title": "Japanese Patent Classification Using Few-shot Learning",
        "authors": "Shota Hachisuka, Yuta Nakada, Hidetsugu Nanba, Satoshi Fukuda",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iiai-aai59060.2023.00032"
    },
    {
        "id": 1382,
        "title": "Multimodal Parameter-Efficient Few-Shot Class Incremental Learning",
        "authors": "Marco D’Alessandro, Alberto Alonso, Enrique Calabrés, Mikel Galar",
        "published": "2023-10-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00364"
    },
    {
        "id": 1383,
        "title": "Removing Adverse Background Shortcut with Text for Few-Shot Classification",
        "authors": "Yuhui Deng, Le Dong",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424747"
    },
    {
        "id": 1384,
        "title": "Cross-Domain Few-Shot Relation Extraction via Representation Learning and Domain Adaptation",
        "authors": "Zhongju Yuan, Zhenkun Wang, Genghui Li",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191836"
    },
    {
        "id": 1385,
        "title": "Enhancing IoT Security: A Few-Shot Learning Approach for Intrusion Detection",
        "authors": "Theyab Althiyabi, Iftikhar Ahmad, Madini O. Alassafi",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Recently, the number of Internet of Things (IoT)-connected devices has increased daily. Consequently, cybersecurity challenges have increased due to the natural diversity of the IoT, limited hardware resources, and limited security capabilities. Intrusion detection systems (IDSs) play a substantial role in securing IoT networks. Several researchers have focused on machine learning (ML) and deep learning (DL) to develop intrusion detection techniques. Although ML is good for classification, other methods perform better in feature transformation. However, at the level of accuracy, both learning techniques have their own certain compromises. Although IDSs based on ML and DL methods can achieve a high detection rate, the performance depends on the training dataset size. Incidentally, collecting a large amount of data is one of the main drawbacks that limits performance when training datasets are lacking, and such methods can fail to detect novel attacks. Few-shot learning (FSL) is an emerging approach that is employed in different domains because of its proven ability to learn from a few training samples. Although numerous studies have addressed the issues of IDSs and improved IDS performance, the literature on FSL-based IDSs is scarce. Therefore, an investigation is required to explore the performance of FSL in IoT IDSs. This work proposes an IoT intrusion detection model based on a convolutional neural network as a feature extractor and a prototypical network as an FSL classifier. The empirical results were analyzed and compared with those of recent intrusion detection approaches. The accuracy results reached 99.44%, which shows a promising direction for involving FSL in IoT IDSs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12071055"
    },
    {
        "id": 1386,
        "title": "Towards Informative Few-Shot Prompt with Maximum Information Gain for In-Context Learning",
        "authors": "Hongfu Liu, Ye Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.1060"
    },
    {
        "id": 1387,
        "title": "Retrieval-Based Prompt Selection for Code-Related Few-Shot Learning",
        "authors": "Noor Nashid, Mifta Sintaha, Ali Mesbah",
        "published": "2023-5",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icse48619.2023.00205"
    },
    {
        "id": 1388,
        "title": "CON-GAN-BERT: combining Contrastive Learning with Generative Adversarial Nets for Few-Shot Sentiment Classification",
        "authors": "Qishun Mei",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00038"
    },
    {
        "id": 1389,
        "title": "Argumentative Stance Prediction: An Exploratory Study on Multimodality and Few-Shot Learning",
        "authors": "Arushi Sharma, Abhibha Gupta, Maneesh Bilalpur",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.argmining-1.18"
    },
    {
        "id": 1390,
        "title": "Attentive Cross-Domain Few-shot Learning and Domain Adaptation in HSI Classification",
        "authors": "Rojan Basnet, Rimsa Goperma, Liang Zhao",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tencon58879.2023.10322397"
    },
    {
        "id": 1391,
        "title": "Using Bidirectional Prompt Learning in NLP Few Shot Tasks",
        "authors": "Li Ding, Shiren Ye",
        "published": "2023-3-22",
        "citations": 1,
        "abstract": "Few-Shot Learning, a subfield of machine learning, aims to solve the problem of learning new tasks with only a small amount of annotated data. Compared to traditional supervised learning, Few-Shot Learning is more challenging because there are very few training samples available during the training process, which means that the model must learn quickly and generalize to new samples. Prompt learning is a recently emerged training paradigm in natural language processing, which can quickly leverage the language capabilities of large pre-trained language models to achieve fast start-up. Based on the prompt learning paradigm, this paper proposes to use its conjugate tasks to further enhance the model's ability in few-shot learning. The experimental results show that the proposed method can effectively improve the performance of the model on multiple datasets and can be combined quickly with other methods for joint optimization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v3i1.6362"
    },
    {
        "id": 1392,
        "title": "Semantic Guided Latent Parts Embedding for Few-Shot Learning",
        "authors": "Fengyuan Yang, Ruiping Wang, Xilin Chen",
        "published": "2023-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00541"
    },
    {
        "id": 1393,
        "title": "Few-shot 3D Point Cloud Semantic Segmentation with Prototype Alignment",
        "authors": "Maolin Wei",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589883.3589913"
    },
    {
        "id": 1394,
        "title": "MT-DST: Multi-Task Strategy for Few-shot Dialog State Tracking",
        "authors": "Jingyao Tang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlbdbi60823.2023.10482155"
    },
    {
        "id": 1395,
        "title": "Transductive clustering optimization learning for few-shot image classification",
        "authors": "Yi Wang, Xiong Bian, Songhao Zhu",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.4.043005"
    },
    {
        "id": 1396,
        "title": "State of health estimation for lithium-ion batteries on few-shot learning",
        "authors": "Shuxin Zhang, Zhitao Liu, Hongye Su",
        "published": "2023-4",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.126726"
    },
    {
        "id": 1397,
        "title": "VL-Few: Vision Language Alignment for Multimodal Few-Shot Meta Learning",
        "authors": "Han Ma, Baoyu Fan, Benjamin K. Ng, Chan-Tong Lam",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Complex tasks in the real world involve different modal models, such as visual question answering (VQA). However, traditional multimodal learning requires a large amount of aligned data, such as image text pairs, and constructing a large amount of training data is a challenge for multimodal learning. Therefore, we propose VL-Few, which is a simple and effective method to solve the multimodal few-shot problem. VL-Few (1) proposes the modal alignment, which aligns visual features into language space through a lightweight model network and improves the multimodal understanding ability of the model; (2) adopts few-shot meta learning in the multimodal problem, which constructs a few-shot meta task pool to improve the generalization ability of the model; (3) proposes semantic alignment to enhance the semantic understanding ability of the model for the task, context, and demonstration; (4) proposes task alignment that constructs training data into the target task form and improves the task understanding ability of the model; (5) proposes generation alignment, which adopts the token-level training and multitask fusion loss to improve the generation ability of the model. Our experimental results show the effectiveness of VL-Few for multimodal few-shot problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14031169"
    },
    {
        "id": 1398,
        "title": "Retracted: Feature Learning-Based Generative Adversarial Network Data Augmentation for Class-Based Few-Shot Learning",
        "authors": "",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9840853"
    },
    {
        "id": 1399,
        "title": "Pseudo-Labeling with Graph Active Learning for Few-shot Node Classification",
        "authors": "Quan Li, Lingwei Chen, Shixiong Jing, Dinghao Wu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdm58522.2023.00133"
    },
    {
        "id": 1400,
        "title": "Contextualizing Enhances Gradient Based Meta Learning for Few Shot Image Classification",
        "authors": "Evan Vogelbaum, Rumen Dangovski, Li Jing, Marin Soljacic",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hpec58863.2023.10363479"
    },
    {
        "id": 1401,
        "title": "Self-Supervison with data-augmentation improves few-shot learning",
        "authors": "Prashant Kumar, Durga Toshniwal",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-024-05340-1"
    },
    {
        "id": 1402,
        "title": "Expanding Hyperspherical Space for Few-Shot Class-Incremental Learning",
        "authors": "Yao Deng, Xiang Xiang",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00197"
    },
    {
        "id": 1403,
        "title": "Generalized representation of local relationships for few-shot incremental learning",
        "authors": "一凡 赵, 甲 李, 永鸿 田",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1360/ssi-2022-0231"
    },
    {
        "id": 1404,
        "title": "Towards Few-Shot Time Series Anomaly Detection with Temporal Attention and Dynamic Thresholding",
        "authors": "Chandana Priya Nivarthi, Bernhard Sick",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00218"
    },
    {
        "id": 1405,
        "title": "Bi-Channel Attention Meta Learning for Few-Shot Fine-Grained Image Recognition",
        "authors": "Yao Wang, Yang Ji, Wei Wang, Bailing Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4370424"
    },
    {
        "id": 1406,
        "title": "Dual-stream Multi-Modal Graph Neural Network for Few-Shot Learning",
        "authors": "Wenli Zhang, Luping Shi",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mipr59079.2023.00026"
    },
    {
        "id": 1407,
        "title": "Real-world abnormal event detection via super-resolution and few-shot learning",
        "authors": "Limin Xia, Changhong Wei",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.3.033005"
    },
    {
        "id": 1408,
        "title": "Frequency Guidance Matters in Few-Shot Learning",
        "authors": "Hao Cheng, Siyuan Yang, Joey Tianyi Zhou, Lanqing Guo, Bihan Wen",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01085"
    },
    {
        "id": 1409,
        "title": "Fractal Few-Shot Learning",
        "authors": "Fobao Zhou, Wenkai Huang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3293995"
    },
    {
        "id": 1410,
        "title": "Few-Shot Learning for Crop Mapping from Satellite Image Time Series",
        "authors": "Sina Mohammadi, Mariana Belgiu, Alfred Stein",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "Recently, deep learning methods have achieved promising crop mapping results. Yet, their classification performance is constrained by the scarcity of labeled samples. Therefore, the development of methods capable of exploiting label-rich environments to classify crops in label-scarce environments using only a few labeled samples per class is required. Few-shot learning (FSL) methods have achieved this goal in computer vision for natural images, but they remain largely unexplored in crop mapping from time series data. In order to address this gap, we adapted eight FSL methods to map infrequent crops cultivated in the selected study areas from France and a large diversity of crops from a complex agricultural area situated in Ghana. The FSL methods are commonly evaluated using class-balanced unlabeled sets from the target domain data (query sets), leading to overestimated classification results. This is unrealistic since these sets can have an arbitrary number of samples per class. In our work, we used the Dirichlet distribution to model the class proportions in few-shot query sets as random variables. We demonstrated that transductive information maximization based on α-divergence (α-TIM) performs better than the competing methods, including dynamic time warping (DTW), which is commonly used to tackle the lack of labeled samples. α-TIM achieved, for example, a macro F1-score of 59.6% in Ghana in a 24-way 20-shot setting (i.e., 20 labeled samples from each of the 24 crop types) and a macro F1-score of 75.9% in a seven-way 20-shot setting in France, outperforming the second best-performing methods by 2.7% and 5.7%, respectively. Moreover, α-TIM outperformed a baseline deep learning model, highlighting the benefits of effectively integrating the query sets into the learning process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs16061026"
    },
    {
        "id": 1411,
        "title": "Few-Shot Named Entity Recognition via Meta-Learning (Extended Abstract)",
        "authors": "Jing Li, Billy Chiu, Shanshan Feng, Hao Wang",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00329"
    },
    {
        "id": 1412,
        "title": "Efficient Few-Shot Classification Using Self-Supervised Learning and Class Factor Analysis",
        "authors": "Youngjae Lee, Hyeyoung Park",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiic60209.2024.10463486"
    },
    {
        "id": 1413,
        "title": "Explore pretraining for few-shot learning",
        "authors": "Yan Li, Jinjie Huang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15223-1"
    },
    {
        "id": 1414,
        "title": "Few-Shot Learning-Based Light-Weight WDCNN Model for Bearing Fault Diagnosis in Siamese Network",
        "authors": "Daehwan Lee, Jongpil Jeong",
        "published": "2023-7-21",
        "citations": 2,
        "abstract": "In this study, bearing fault diagnosis is performed with a small amount of data through few-shot learning. Recently, a fault diagnosis method based on deep learning has achieved promising results. Most studies required numerous training samples for fault diagnosis. However, at manufacturing sites, it is impossible to have enough training samples to represent all fault types under all operating conditions. In addition, most studies consider only accuracy, and models are complex and computationally expensive. Research that only considers accuracy is inefficient since manufacturing sites change rapidly. Therefore, in this study, we propose a few-shot learning model that can effectively learn with small data. In addition, a Depthwise Separable Convolution layer that can effectively reduce parameters is used together. In order to find an efficient model, the optimal hyperparameters were found by adjusting the number of blocks and hyperparameters, and by using a Depthwise Separable Convolution layer for the optimal hyperparameters, it showed higher accuracy and fewer parameters than the existing model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23146587"
    },
    {
        "id": 1415,
        "title": "Mitigate forgetting in few-shot class-incremental learning using different image views",
        "authors": "Pratik Mazumder, Pravendra Singh",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.043"
    },
    {
        "id": 1416,
        "title": "Task Adaptation Meta Learning for Few-Shot Fault Diagnosis under Multiple Working Conditions",
        "authors": "Chao Ren, Bin Jiang, Ningyun Lu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164461"
    },
    {
        "id": 1417,
        "title": "Improving Plant Disease Recognition Through Gradient-Based Few-shot Learning with Attention Mechanisms",
        "authors": "Gültekin IŞIK",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "This study investigates the use of few-shot learning algorithms to improve classification performance in situations where traditional deep learning methods fail due to a lack of training data. Specifically, we propose a few-shot learning approach using the Almost No Inner Loop (ANIL) algorithm and attention modules to classify tomato diseases in the Plant Village dataset. The attended features obtained from the five separate attention modules are classified using a Multi Layer Perceptron (MLP) classifier, and the soft voting method is used to weigh the classification scores from each classifier. The results demonstrate that our proposed approach achieves state-of-the-art accuracy rates of 97.05% and 97.66% for 10-shot and 20-shot classification, respectively. Our approach demonstrates the potential for incorporating attention mechanisms in feature extraction processes and suggests new avenues for research in few-shot learning methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21597/jist.1283491"
    },
    {
        "id": 1418,
        "title": "Classificação de Sons Pulmonares com Técnica de Few-Shot Learning",
        "authors": "Rafael Santos, Danielle Fortunato, Danton Diego Ferreira, Bruno Barbosa",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "A pandemia em decorrência da COVID-19 evidenciou para a humanidade a gravidade que uma doença pulmonar pode ter e a consequência se a mesma não for diagnosticada e contida o mais rápido possível. Dessa maneira, o reconhecimento de doenças pulmonares, o tratamento e a contenção são alvos de estudo ha anos. Porém, as limitações de identificação manual utilizando os estetoscopios nos procedimentos de auscultas pulmonares acarreta na necessidade de outros exames, e consequentemente mais tempo para discernir a doença, e em casos graves onde isso não é imediato pode provocar a morte do paciente. Por esse motivo, este trabalho visa a elaboração de dois modelos de classificação de sons pulmonares utilizando o banco de dados ICBHI 2017 e as técnicas Random Forest e Rede Siamesa, comparando seus resultados e seus métodos. Utilizando o criterio de validação cruzada k-fold, tais modelos obtiveram acurácias médias de 84.84% e 85.74% nos melhores métodos, respectivamente, mostrando ser viável a identificação de doenças a partir da análise de sinais de áudio de ausculta pulmonar.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21528/cbic2023-069"
    },
    {
        "id": 1419,
        "title": "Few-shot Object Detection with Refined Contrastive Learning",
        "authors": "Zeyu Shangguan, Lian Huai, Tong Liu, Xingqun Jiang",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictai59109.2023.00148"
    },
    {
        "id": 1420,
        "title": "Learning self-target knowledge for few-shot segmentation",
        "authors": "Yadang Chen, Sihan Chen, Zhi-Xin Yang, Enhua Wu",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2024.110266"
    },
    {
        "id": 1421,
        "title": "Few-Shot Bearing Fault Diagnosis Based on Multi-Metric Fusion Learning",
        "authors": "Lili Liang, Ping Yuan",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451539"
    },
    {
        "id": 1422,
        "title": "Similar Class Style Augmentation for Efficient Cross-Domain Few-Shot Learning",
        "authors": "Manogna Sreenivas, Soma Biswas",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00483"
    },
    {
        "id": 1423,
        "title": "Few-shot classification based on manifold metric learning",
        "authors": "Qingzhen Shang, Jinfu Yang, Jiaqi Ma, Jiahui Zhang",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.33.1.013026"
    },
    {
        "id": 1424,
        "title": "IoT Botnet-Traffic Classification Using Few-Shot Learning",
        "authors": "Davide Di Monda, Giampaolo Bovenzi, Antonio Montieri, Valerio Persico, Antonio Pescapè",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386602"
    },
    {
        "id": 1425,
        "title": "Few-shot time series forecasting in a meta-learning framework",
        "authors": "Ping Ma, Zhengwei Ni",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Time series forecasting has a wide range of applications in various fields. To eliminate the need for time series data volume, a meta-learning-based few-shot time series forecasting method is proposed. This method uses a residual stack module as its backbone and connects the residuals forward and backward through a multilayer fully connected network so that the model and the meta-learning framework can be seamlessly combined. The Empirical knowledge of different time-sequence tasks is obtained through meta-training. To enable fast adaptation to new prediction tasks, a small meta-network is introduced to adaptively and dynamically generate the learning rate and weight decay coefficient of each step in the network. This method can use sequences of different data distribution characteristics for cross-task learning, and each training task only needs a small number of time series to achieve sequence prediction for the target task. The results show that compared with the two baselines, the proposed method has improved performance on 67.07% and 58.53% of the evaluated tasks. Thus, this method can effectively alleviate the problems caused by insufficient data during training and has broad application prospects in the field of time series.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-233520"
    },
    {
        "id": 1426,
        "title": "Generative Data Augmentation for Few-Shot Domain Adaptation",
        "authors": "Carlos López Fortín, Ikuko Nishikawa",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012338000003654"
    },
    {
        "id": 1427,
        "title": "Identification of unknown faults in chemical processes using few-shot learning",
        "authors": "Somayeh Mirzaei, Kuo-Yao Chiu, Jia-Lin Kang",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2022.112393"
    },
    {
        "id": 1428,
        "title": "GPr-Net: Geometric Prototypical Network for Point Cloud Few-Shot Learning",
        "authors": "Tejas Anvekar, Dena Bazazian",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00440"
    },
    {
        "id": 1429,
        "title": "Electromyography Based Gesture Decoding Employing Few-Shot Learning, Transfer Learning, and Training From Scratch",
        "authors": "Ricardo V. Godoy, Bonnie Guan, Felipe Sanches, Anany Dwivedi, Minas Liarokapis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3317956"
    },
    {
        "id": 1430,
        "title": "CTVAE: Current Task Variational Auto-Encoder with Dynamic Ensemble Loss for Few-Shot Learning",
        "authors": "Hao-Chin Su, Yi-Ling Chen",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191886"
    },
    {
        "id": 1431,
        "title": "Self-Attention Message Passing for Contrastive Few-Shot Learning",
        "authors": "Ojas Kishorkumar Shirekar, Anuj Singh, Hadi Jamali-Rad",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00539"
    },
    {
        "id": 1432,
        "title": "Learning a Good Representation for Metric-based Few-shot Classification",
        "authors": "Dianqi Liu, Liang Bai, Tianyuan Yu, Aiming Zhang",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccrd56364.2023.10080350"
    },
    {
        "id": 1433,
        "title": "FSL-HD: Accelerating Few-Shot Learning on ReRAM using Hyperdimensional Computing",
        "authors": "Weihong Xu, Jaeyoung Kang, Tajana Rosing",
        "published": "2023-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/date56975.2023.10136901"
    },
    {
        "id": 1434,
        "title": "Few-shot Fault Diagnosis Based on Supervised Contrast Learning",
        "authors": "Houliang Wang, Yinglong Yan, Shi Jia, Zenghui An",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/phm-hangzhou58797.2023.10482482"
    },
    {
        "id": 1435,
        "title": "Learning Stable Task-Level Manifold for Few-Shot Learning",
        "authors": "Siyi Yu, Wei Luo, Gang Li, Bo Yang",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00063"
    },
    {
        "id": 1436,
        "title": "Prompt Prototype Learning Based on Ranking Instruction For Few-Shot Visual Tasks",
        "authors": "Li Sun, Liuan Wang, Jun Sun, Takayuki Okatani",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222039"
    },
    {
        "id": 1437,
        "title": "Rethinking Self-Supervision for Few-Shot Class-Incremental Learning",
        "authors": "Linglan Zhao, Jing Lu, Zhanzhan Cheng, Duo Liu, Xiangzhong Fang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00130"
    },
    {
        "id": 1438,
        "title": "Collaborative Learning-based Dual Network for Few-Shot Image Classification",
        "authors": "Min Xiong, Wenming Cao, Jianqi Zhong",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/prmvia58252.2023.00011"
    },
    {
        "id": 1439,
        "title": "FewSOL: A Dataset for Few-Shot Object Learning in Robotic Environments",
        "authors": "Jishnu Jaykumar P, Yu-Wei Chao, Yu Xiang",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10161143"
    },
    {
        "id": 1440,
        "title": "Intrusion Detection System Using Initialization-based Few-shot Learning",
        "authors": "Bashir Haruna, Nurudeen M. Ibrahim, Moussa M. Boukar",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmeas58693.2023.10379422"
    },
    {
        "id": 1441,
        "title": "Transductive Few-Shot Learning with Prototype-Based Label Propagation by Iterative Graph Refinement",
        "authors": "Hao Zhu, Piotr Koniusz",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.02298"
    },
    {
        "id": 1442,
        "title": "From patch, sample to domain: Capture geometric structures for few-shot learning",
        "authors": "Qiaonan Li, Guihua Wen, Pei Yang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.110147"
    },
    {
        "id": 1443,
        "title": "Few-Shot Learning for Images Classification Considering Feature Variance",
        "authors": "Lei Wang, Minhao Xue, Li Wang, Ming Cheng",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiect60552.2023.10442062"
    },
    {
        "id": 1444,
        "title": "Few‐shot learning for word‐level scene text script identification",
        "authors": "Veronica Naosekpam, Nilkanta Sahu",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractScript identification of text in scene images has attracted massive attention recently. However, the existing techniques primarily emphasize on scripts where data are available abundantly, such as English, European, or East Asian. Although these methods are robust in dealing with high‐resource data, how these techniques will work on low‐resource scripts has yet to be discovered. For example, in India, there is a disparity among the text scripts across the country's demographic. To bridge the research gap for resource‐constraint script identification, we present a few‐shot learning network called the TextScriptFSLNet. This network does not require huge training data while achieving state‐of‐the‐art performance on benchmark datasets. Our proposed method acts in accordance with a ‐way ‐shot paradigm by splitting the train set as support and query set, respectively. The support set learns representative knowledge of each class and creates its prototypes. We use multi‐kernel spatial attention fused 2‐layer convolutional neural network and averaging technique to generate the prototype of each class. This spatial attention aids in grasping important information in an image and enriches the feature representation. To the best of our knowledge, the proposed work is the first of its kind in the scene text understanding domain. Additionally, we created a dataset called Indic‐FSL2023 comprising 10 of the 22 officially recognized Indian scripts. The proposed method achieves the highest accuracy among the tested methods on the newly created Indic‐FSL2023. Experiments are also conducted on MLe2e to demonstrate its versatility. Furthermore, we also showed how our proposed model performed concerning illumination changes and blur on scene text script images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/coin.12612"
    },
    {
        "id": 1445,
        "title": "Cross-Domain Few-Shot Incremental Learning for Point-Cloud Recognition",
        "authors": "Yuwen Tan, Xiang Xiang",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00230"
    },
    {
        "id": 1446,
        "title": "Few-Shot KBQA Method Based on Multi-Task Learning",
        "authors": "Yuan Ren, Xutong Li, Xudong Liu, Richong Zhang",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigcomp60711.2024.00043"
    },
    {
        "id": 1447,
        "title": "Domain Adaptive Few-Shot Open-Set Learning",
        "authors": "Debabrata Pal, Deeptej More, Sai Bhargav, Dipesh Tamboli, Vaneet Aggarwal, Biplab Banerjee",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01726"
    },
    {
        "id": 1448,
        "title": "Few-Shot Video Classification via Representation Fusion and Promotion Learning",
        "authors": "Haifeng Xia, Kai Li, Martin Renqiang Min, Zhengming Ding",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01769"
    },
    {
        "id": 1449,
        "title": "Few-Shot Gaze Estimation via Gaze Transfer",
        "authors": "Nikolaos Poulopoulos, Emmanouil Psarakis",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011789800003417"
    },
    {
        "id": 1450,
        "title": "SW-Net: A novel few-shot learning approach for disease subtype prediction",
        "authors": "YUHAN JI, YONG LIANG, ZIYI YANG, NING AI",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/biocell.2023.025865"
    },
    {
        "id": 1451,
        "title": "Active Learning for Efficient Few-Shot Classification",
        "authors": "Aymane Abdali, Vincent Gripon, Lucas Drumetz, Bartosz Boguslawski",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095220"
    },
    {
        "id": 1452,
        "title": "Few-shot graph and smiles learning for molecular property prediction",
        "authors": "Dan Sun",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005809"
    },
    {
        "id": 1453,
        "title": "Representative Feature Learning and Task Decoupling for Few-Shot Object Detection",
        "authors": "Xiaozhong Chen, Binghao Liu, Qixiang Ye",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscsic60498.2023.00033"
    },
    {
        "id": 1454,
        "title": "Simple and effective meta relational learning for few-shot knowledge graph completion",
        "authors": "Shujian Chen, Bin Yang, Chenxing Zhao",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11081-024-09880-w"
    },
    {
        "id": 1455,
        "title": "Log Parsing with Prompt-based Few-shot Learning",
        "authors": "Van-Hoang Le, Hongyu Zhang",
        "published": "2023-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icse48619.2023.00204"
    },
    {
        "id": 1456,
        "title": "Object Detection in Pineapple Fields Drone Imagery Using Few Shot Learning and the Segment Anything Model",
        "authors": "Fabian Fallas-Moya, Saul Calderon-Ramirez, Amir Sadovnik, Hairong Qi",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00247"
    },
    {
        "id": 1457,
        "title": "Addressing Data Scarcity in Thai Car Recognition Using Few-Shot Learning",
        "authors": "Suphanut Chaiyungyuen, Panumate Chetprayoon, Warasinee Chaisangmongkon, Theerat Sakdejayont",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbir57571.2023.10147672"
    },
    {
        "id": 1458,
        "title": "Knowledge Transfer for Few-Shot Vibrational Spectrum Recognition via Learning Unified Representations",
        "authors": "Xin Niu, Jingchao Liu",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10240779"
    },
    {
        "id": 1459,
        "title": "SiaKey: A Method for Improving Few-shot Learning with Clinical Domain Information",
        "authors": "Zhuochun Li, Khushboo Thaker, Daqing He",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bhi58575.2023.10313362"
    },
    {
        "id": 1460,
        "title": "Research on Cross-site Scripting Attack Detection Technology Based on Few-shot Learning",
        "authors": "Dongzhe Lu, Long Liu",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itnec56291.2023.10082596"
    },
    {
        "id": 1461,
        "title": "Meta-training with Demonstration Retrieval for Efficient Few-shot Learning",
        "authors": "Aaron Mueller, Kanika Narang, Lambert Mathias, Qifan Wang, Hamed Firooz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.376"
    },
    {
        "id": 1462,
        "title": "ChatICD: Prompt Learning for Few-shot ICD Coding through ChatGPT",
        "authors": "Junping Liu, Shichen Yang, Tao Peng, Xinrong Hu, Qiang Zhu",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibm58861.2023.10385482"
    },
    {
        "id": 1463,
        "title": "Contrastive knowledge-augmented self-distillation approach for few-shot learning",
        "authors": "Lixu Zhang, Mingwen Shao, Sijie Chen, Fukang Liu",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.5.053037"
    },
    {
        "id": 1464,
        "title": "A Few-shot Learning Approach for Multi-Task CT Image Classification",
        "authors": "Mohamed El Hacen Habib, Ayhan Küçükmanisa, Oğuzhan Urhan",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eleco60389.2023.10415985"
    },
    {
        "id": 1465,
        "title": "Research on Target Perforation Identification Method Based on Few-Shot Learning",
        "authors": "Zhang Qianxiao, Li Chao, Wang Bomin",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiip61647.2023.00015"
    },
    {
        "id": 1466,
        "title": "Distributed few-shot learning with prototype distribution correction",
        "authors": "Zhiling Fu, Dongfang Tang, Pingchuan Ma, Zhe Wang, Wen Gao",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-05103-4"
    },
    {
        "id": 1467,
        "title": "Joint Embedding Learning and Latent Subspace Probing for Cross-Domain Few-Shot Keyword Spotting",
        "authors": "Mete Ozay",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10446764"
    },
    {
        "id": 1468,
        "title": "Few-Shot Learning with Discriminative Representation for Cyberattack Detection",
        "authors": "Van Loi Cao, Manh Tuan Nguyen, Trang Dang Le Dinh",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/kse59128.2023.10299444"
    },
    {
        "id": 1469,
        "title": "A Data Augmentation Method Based on Saliency Measures and Feature Transformation for Few-Shot Learning",
        "authors": "Yanbiao Hao, Yihang Wei, Jianting Zhang",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icus58632.2023.10318276"
    },
    {
        "id": 1470,
        "title": "An image classification method based on few-shot learning",
        "authors": "jian wang, ming jun zhang",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2684234"
    },
    {
        "id": 1471,
        "title": "Few-shot Classification via Ensemble Learning with Multi-Order Statistics",
        "authors": "Sai Yang, Fan Liu, Delong Chen, Jun Zhou",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Transfer learning has been widely adopted for few-shot classification. Recent studies reveal that obtaining good generalization representation of images on novel classes is the key to improving the few-shot classification accuracy. To address this need, we prove theoretically that leveraging ensemble learning on the base classes can correspondingly reduce the true error in the novel classes. Following this principle, a novel method named Ensemble Learning with Multi-Order Statistics (ELMOS) is proposed in this paper. In this method, after the backbone network, we use multiple branches to create the individual learners in the ensemble learning, with the goal to reduce the storage cost. We then introduce different order statistics pooling in each branch to increase the diversity of the individual learners. The learners are optimized with supervised losses during the pre-training phase. After pre-training, features from different branches are concatenated for classifier evaluation. Extensive experiments demonstrate that each branch can complement the others and our method can produce a state-of-the-art performance on multiple few-shot classification benchmark datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/181"
    },
    {
        "id": 1472,
        "title": "AppleSeed: Intent-Based Multi-Domain Infrastructure Management via Few-Shot Learning",
        "authors": "Jieyu Lin, Kristina Dzeparoska, Ali Tizghadam, Alberto Leon-Garcia",
        "published": "2023-6-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/netsoft57336.2023.10175410"
    },
    {
        "id": 1473,
        "title": "LSFSL: Leveraging Shape Information in Few-shot Learning",
        "authors": "Deepan Chakravarthi Padmanabhan, Shruthi Gowda, Elahe Arani, Bahram Zonooz",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00525"
    },
    {
        "id": 1474,
        "title": "Crossing Domain Borders with Federated Few-Shot Adaptation",
        "authors": "Manuel Röder, Maximilian Münch, Christoph Raab, Frank-Michael Schleif",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012351900003654"
    },
    {
        "id": 1475,
        "title": "FSG-Net: a Deep Learning model for Semantic Robot Grasping through Few-Shot Learning",
        "authors": "Leonardo Barcellona, Alberto Bacchin, Alberto Gottardi, Emanuele Menegatti, Stefano Ghidoni",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160618"
    },
    {
        "id": 1476,
        "title": "Few-Shot Relation Extraction With Dual Graph Neural Network Interaction",
        "authors": "Jing Li, Shanshan Feng, Billy Chiu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3278938"
    },
    {
        "id": 1477,
        "title": "Tensor-Empowered Adaptive Learning for Few-Shot Streaming Tasks",
        "authors": "Bocheng Ren, Laurence T. Yang, Qingchen Zhang, Jun Feng, Xin Nie",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3227267"
    },
    {
        "id": 1478,
        "title": "Learning Prototype from unlabeled regions for Few-shot segmentation",
        "authors": "Ying Wei, Shanzheng Zhang, Jiaguang Li, Weijiang Yang",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10327244"
    },
    {
        "id": 1479,
        "title": "Filter Bank Networks for Few-Shot Class-Incremental Learning",
        "authors": "Yanzhao Zhou, Binghao Liu, Yiran Liu, Jianbin Jiao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmes.2023.026745"
    },
    {
        "id": 1480,
        "title": "Learning Few-shot Sample-set Operations for Noisy Multi-label Aspect Category Detection",
        "authors": "Shiman Zhao, Wei Chen, Tengjiao Wang",
        "published": "2023-8",
        "citations": 1,
        "abstract": "Multi-label Aspect Category Detection (MACD) is essential for aspect-based sentiment analysis, which aims to identify multiple aspect categories in a given sentence. Few-shot MACD is critical due to the scarcity of labeled data. However, MACD is a high-noise task, and existing methods fail to address it with only two or three training samples per class, which limits the application in practice. To solve above issues, we propose a group of Few-shot Sample-set Operations (FSO) to solve noisy MACD in fewer sample scenarios by identifying the semantic contents of samples. Learning interactions among intersection, subtraction, and union networks, the FSO imitates arithmetic operations on samples to distinguish relevant and irrelevant aspect contents. Eliminating the negative effect caused by noises, the FSO extracts discriminative prototypes and customizes a dedicated query vector for each class. Besides, we design a multi-label architecture, which integrates with score-wise loss and multi-label loss to optimize the FSO for multi-label prediction, avoiding complex threshold training or selection. Experiments show that our method achieves considerable performance. Significantly, it improves by 11.01% at most and an average of 8.59% Macro-F in fewer sample scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/589"
    },
    {
        "id": 1481,
        "title": "HyperShot: Few-Shot Learning by Kernel HyperNetworks",
        "authors": "Marcin Sendera, Marcin Przewiezlikowski, Konrad Karanowski, Maciej Zieba, Jacek Tabor, Przemyslaw Spurek",
        "published": "2023-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00250"
    },
    {
        "id": 1482,
        "title": "RAFF: remote sensing airplane fine grained classification with few shot learning",
        "authors": "Xu Chen, HongBing Ma, ShengJin Wang",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2669648"
    },
    {
        "id": 1483,
        "title": "Boosting Few-Shot Image Classification with Feature Map Reconstruction Network via Statistical Information",
        "authors": "Yongkang Huo",
        "published": "2023-2-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587716.3587781"
    },
    {
        "id": 1484,
        "title": "Speakerbox: Few-Shot Learning for Speaker\nIdentification with Transformers",
        "authors": "Eva Maxfield Brown, To Huynh, Nicholas Weber",
        "published": "2023-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21105/joss.05132"
    },
    {
        "id": 1485,
        "title": "Adaptive Prompt Learning-Based Few-Shot Sentiment Analysis",
        "authors": "Pengfei Zhang, Tingting Chai, Yongdong Xu",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11063-023-11259-4"
    },
    {
        "id": 1486,
        "title": "Features Matter: Cross-Domain Mutual Centralized Learning for Few Shot Remote Sensing Object Detection",
        "authors": "Kai Zhang, Zheng Tan, Qunbo Lv",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282953"
    },
    {
        "id": 1487,
        "title": "MetaFake: Few-shot Face Forgery Detection with Meta Learning",
        "authors": "Nanqing Xu, Weiwei Feng",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3577163.3595108"
    },
    {
        "id": 1488,
        "title": "Visual fileless malware classification via few-shot learning",
        "authors": "Liyan Jiang, Yu Zhang, Yuanquan Shi",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2681579"
    },
    {
        "id": 1489,
        "title": "Meta-ensemble learning with a multi-headed model for few-shot problems",
        "authors": "Seokhyeon Ha, Youngseok Yoon, Jungwoo Lee",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.icte.2022.09.001"
    },
    {
        "id": 1490,
        "title": "The feature selection strategy of few-shot learning based on causal inference",
        "authors": "Jining Zhang, Xiaodong Zhu, Yuanning Liu",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672724"
    },
    {
        "id": 1491,
        "title": "Few Shot Class Incremental Learning via Efficient Prototype Replay and Calibration",
        "authors": "Wei Zhang, Xiaodong Gu",
        "published": "2023-5-10",
        "citations": 2,
        "abstract": "Few shot class incremental learning (FSCIL) is an extremely challenging but valuable problem in real-world applications. When faced with novel few shot tasks in each incremental stage, it should take into account both catastrophic forgetting of old knowledge and overfitting of new categories with limited training data. In this paper, we propose an efficient prototype replay and calibration (EPRC) method with three stages to improve classification performance. We first perform effective pre-training with rotation and mix-up augmentations in order to obtain a strong backbone. Then a series of pseudo few shot tasks are sampled to perform meta-training, which enhances the generalization ability of both the feature extractor and projection layer and then helps mitigate the over-fitting problem of few shot learning. Furthermore, an even nonlinear transformation function is incorporated into the similarity computation to implicitly calibrate the generated prototypes of different categories and alleviate correlations among them. Finally, we replay the stored prototypes to relieve catastrophic forgetting and rectify prototypes to be more discriminative in the incremental-training stage via an explicit regularization within the loss function. The experimental results on CIFAR-100 and miniImageNet demonstrate that our EPRC significantly boosts the classification performance compared with existing mainstream FSCIL methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25050776"
    },
    {
        "id": 1492,
        "title": "Few-Shot Steel Defect Detection Method Based on Improved Meta-Learning Model",
        "authors": "Fengkai Luo, Ruirui Ji, Kehao Deng, Qiliang Sha",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icivc58118.2023.10270277"
    },
    {
        "id": 1493,
        "title": "A Study of Few-Shot Image Classification Model Based on Contrastive Learning and Self-Attention",
        "authors": "Jiapei Sun, Lei Shi",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10441798"
    },
    {
        "id": 1494,
        "title": "Detecting challenging urban environments using a few-shot meta-learning approach",
        "authors": "Thomas Stark, Michael Wurm, Xiao Xiang Zhu, Hannes Taubenböck",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jurse57346.2023.10144170"
    },
    {
        "id": 1495,
        "title": "FLamE: Few-shot Learning from Natural Language Explanations",
        "authors": "Yangqiaoyu Zhou, Yiming Zhang, Chenhao Tan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.372"
    },
    {
        "id": 1496,
        "title": "Few-shot transfer learning using a recurrent neural network for hologram reconstruction (Conference Presentation)",
        "authors": "Luzhe Huang, Xilin Yang, Tairan Liu, Aydogan Ozcan",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2649194"
    },
    {
        "id": 1497,
        "title": "Learning Component-Level and Inter-Class Glyph Representation for few-shot Font Generation",
        "authors": "Yongliang Su, Xu Chen, Lei Wu, Xiangxu Meng",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00132"
    },
    {
        "id": 1498,
        "title": "Improving few-shot relation extraction through semantics-guided learning",
        "authors": "Hui Wu, Yuting He, Yidong Chen, Yu Bai, Xiaodong Shi",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.053"
    },
    {
        "id": 1499,
        "title": "A Dual-view Semi-supervised Learning Framework for Combinatorial Few-shot Fault Diagnosis",
        "authors": "Yumeng Liu, Wenzhang Zhong, Ke Yan, Ling Tian",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipccc59175.2023.10253866"
    },
    {
        "id": 1500,
        "title": "Class similarity weighted knowledge distillation for few shot incremental learning",
        "authors": "Feidu Akmel, Fanman Meng, Qingbo Wu, Shuai Chen, Runtong Zhang, Maregu Assefa",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2024.127587"
    },
    {
        "id": 1501,
        "title": "Stabilized In-Context Learning with Pre-trained Language Models for Few Shot Dialogue State Tracking",
        "authors": "Derek Chen, Kun Qian, Zhou Yu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.115"
    },
    {
        "id": 1502,
        "title": "Memory Mechanisms Based Few-Shot Continual Learning Railway Obstacle Detection",
        "authors": "Zhiyuan Li, Di Shang, Zongru Ma, Yiqing Liu, Yanfeng Lu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10452127"
    },
    {
        "id": 1503,
        "title": "Few-Shot Based Crop Weather Damage Discrimination System",
        "authors": "Jun Park, Se-Hoon Jung, Chun-Bo Sim",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.9717/kmms.2024.27.2.257"
    },
    {
        "id": 1504,
        "title": "Transfer Learning and Few-Shot Learning Based Deep Neural Network Models for Underwater Sonar Image Classification With a Few Samples",
        "authors": "Tincy Thomas Chungath, Athira M. Nambiar, Anurag Mittal",
        "published": "2024-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/joe.2022.3221127"
    }
]