[
    {
        "id": 18471,
        "title": "Policy learning and policy failure: definitions, dimensions and intersections1",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter provides an overview of policy learning and policy failure, both of which are classic topics of policy studies. The links between the two literatures appear obvious, yet there are very few studies that address how one can learn from failure, learn to limit failure, and fail to learn. This book offers a rare attempt to bring these two literatures together. The chapter then begins by defining policy learning and failure before organising the main studies in these fields along the key dimensions of processes, products, and analytical levels. Learning and failure studies are beginning to offer analysis in and for the policy process that concentrates on the prescriptive techniques that can help on the ground. Intellectual endeavours on the design implications of learning and failure are still in their infancy, but two streams of activity are making headway. For learning, analysis of international organisations makes particularly strong offerings on how governments should learn. Different instruments and methods for cross-national learning include: benchmarking, peer review, checklists, facilitated coordination, and extrapolation. Meanwhile, the prescriptive turn in failure studies is less concerned with how not to fail and more focused on its inverse — how to succeed in policy making.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0001"
    },
    {
        "id": 18472,
        "title": "Policy failures, policy learning and institutional change: the case of Australian health insurance policy change",
        "authors": "Adrian Kay",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter studies the connections between repeated assessments of policy failure, the catalysts of deinstitutionalisation, and subsequent opportunities for system-wide policy learning and reform. Selected evidence from the reform trajectory of Australian health insurance policy from the mid-1970s to late-1990s is used to explore these possible relationships. Here, failure delegitimised health policy institutions, making them increasingly vulnerable and giving them weak learning capacity to reform in anything but a suboptimal way. The result is a cycle of failure and dysfunctional learning. The Australian health insurance case allows one to catalogue at least one pattern of the relationships between policy failure, deinstitutionalisation, and learning. Three core analytical arguments underpin this pattern. First, policy failures create opportunities for learning at a system-wide level, only after institutions have been eroded and exhausted by repeated failure. Second, this first claim holds in both the expert and political inquiry dimensions of policy failure. Third, learning processes are related to the particular sequence of deinstitutionalisation processes; in particular, initial deinstitutionalisation in the expert domain creates the conditions for political learning processes.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0006"
    },
    {
        "id": 18473,
        "title": "Policy myopia as a source of policy failure: adaptation and policy learning under deep uncertainty",
        "authors": "Sreeja Nair, Michael Howlett",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter introduces the idea of ‘policy myopia’ as a pressing source of failure in policy making and explores the possibility of developing policies that learn to help mitigate its impacts. It notes that while the problem of bounded rationality and short-term uncertainty is widely acknowledged as the central existential condition for all policy making, the long-term problem of an uncertain, and sometimes unknowable, future is rarely acknowledged. As uncertainty deepens, so too does the probability of policy failure. In these circumstances, actors need to design policies with flexibility and adaptation built in. Where policy solutions are robust over a range of possible scenarios and over time, one can say policies have learning capacity organised into them. Yet, in cases of radical uncertainty, learning may not be possible (or indeed preferable) at all. This reminder of the limits of learning is important. Updating one's belief systems assumes that a certain amount of knowledge exists in the first place.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0007"
    },
    {
        "id": 18474,
        "title": "Policy Learning and Policy Failure",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "First published as a special issue of Policy & Politics, this updated volume explores policy failures and the valuable opportunities for learning that they offer. The book begins with an overview of policy learning and policy failure. The links between the two appear obvious, yet there are very few studies that address how one can learn from failure, learn to limit failure, and fail to learn. The book attempts to bring the two together. In doing so, it explores how dysfunctional forms of policy learning impact policy failure at the meso-level. The book expands on this by demonstrating how different learning processes generated by actors at the meso-level mediate the extent to which policy transfer is a success or failure. It re-assesses some of the literature on policy transfer and policy diffusion, in light of ideas as to what constitutes failure, partial failure, or limited success. This is followed by an examination of situations in which the incentives of partisanship can encourage a government to actively seek to exacerbate an existing policy failure rather than to repair it. The book studies the connections between repeated assessments of policy failure and subsequent opportunities for system-wide policy learning and reform. Finally, it introduces the idea of ‘policy myopia’ as a pressing source of failure in policy making and explores the possibility of developing policies that learn to help mitigate its impacts.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.001.0001"
    },
    {
        "id": 18475,
        "title": "Overcoming the failure of ‘silicon somewheres’: learning in policy transfer processes",
        "authors": "Sarah Giest",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter discusses the impact of different types of learning on the success and failure of the transfer of the famous Silicon Valley Model (SVM) of innovation. Working with the idea of ‘adaptive learning’, it underlines the importance of understanding the learning process, and critically, the depth of learning that underpins policy transfer. Policy transfer is ‘a process in which knowledge about policies, administrative arrangements, institutions and ideas in one political setting (past or present) is used in the development of policies, administrative arrangements, institutions and ideas in another political setting’. Thus, knowledge exchange is highly dependent on the setting it occurs in as well as on the individuals involved in the process. There are different degrees of transfer: copying, emulation, combinations, and inspiration. These categories move from direct and complete transfer to searching for inspiration to create policy change. The chapter looks at four cases to demonstrate how different learning processes generated by actors at the meso-level, mainly networks of stakeholders and experts, mediate the extent to which policy transfer is a success or failure.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0003"
    },
    {
        "id": 18476,
        "title": "Pathologies of policy learning: what are they and how do they contribute to policy failure?1",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 1,
        "abstract": "This chapter explores how dysfunctional forms of policy learning impact policy failure at the meso-level. Using the long-running policy failure of the management of bovine tuberculosis (BTB) in England, analysis focuses on negative lessons generated by the interactions of an epistemic community of scientific experts and civil servants charged with balancing the competing interest actors to craft a workable policy. The chapter then outlines the capacity challenges faced by decision-makers engaged in epistemic learning and the ways in which advisory relationships can go wrong and learning can degenerate. These degenerations are understood as rooted in failures in government's organisational capacities. Empirically, the analysis of BTB policy in England finds that epistemic learning degenerated as a result of weaknesses in the government's analytical and communicative capacities. The chapter concludes with some reflections on the value of learning theories as a conceptual lens for policy failure.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0002"
    },
    {
        "id": 18477,
        "title": "Policy Learning and Policy Failure: Definitions, Dimensions and Intersections",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.001"
    },
    {
        "id": 18478,
        "title": "Policy learning and policy failure:",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.7"
    },
    {
        "id": 18479,
        "title": "British Columbia’s fast ferries and Sydney’s Airport Link: partisan barriers to learning from policy failure",
        "authors": "Joshua Newman, Malcolm G. Bird",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter examines situations in which the incentives of partisanship can encourage a government to actively seek to exacerbate an existing policy failure rather than to repair it. Under these circumstances, the certain benefits of shaming the political opposition outweigh any potential rewards of improving specific policy outcomes. The chapter considers two cases of policy failure in the late 1990s in the transportation sector. The first case explores an effort by the British Columbia Ferry Corporation (BC Ferries), a public provider of marine transportation on Canada's west coast, to introduce a fleet of high-speed aluminium catamaran ferries (the ‘fast ferries’). The second case investigates a public–private partnership scheme to build and operate an urban rail link between the central business district and the airport in Sydney, Australia (the Sydney Airport Link). In both cases, policy options were presented that had the potential to mitigate financial losses and to redirect the project back toward the achievement of stated policy objectives. However, these options were rejected by decision-makers in favour of actions that did nothing for the success of the project but that did deliver some short-term political and electoral rewards.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0005"
    },
    {
        "id": 18480,
        "title": "Policy Failures, Policy Learning and Institutional Change: The Case of Australian Health Insurance Policy Change",
        "authors": "Adrian Kay",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.006"
    },
    {
        "id": 18481,
        "title": "Policy failures, policy learning and institutional change:",
        "authors": "Adrian Kay",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.12"
    },
    {
        "id": 18482,
        "title": "Policy learning and policy failure: definitions, dimensions and intersections",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-005"
    },
    {
        "id": 18483,
        "title": "Policy Myopia as a Source of Policy Failure: Adaptation and Policy Learning Under Deep Uncertainty",
        "authors": "Sreeja Nair, Michael Howlett",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.007"
    },
    {
        "id": 18484,
        "title": "Policy failures, policy learning and institutional change: the case of Australian health insurance policy change",
        "authors": "Adrian Kay",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-010"
    },
    {
        "id": 18485,
        "title": "Policy learning and policy failure: definitions, dimensions and intersections",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch001"
    },
    {
        "id": 18486,
        "title": "Policy myopia as a source of policy failure:",
        "authors": "Sreeja Nair, Michael Howlett",
        "published": "2020-1-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.13"
    },
    {
        "id": 18487,
        "title": "Between policy failure and policy success: bricolage, experimentalism and translation in policy transfer",
        "authors": "Diane Stone",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "This chapter re-assesses some of the literature on policy transfer and policy diffusion, in light of ideas as to what constitutes failure, partial failure, or limited success. Rather than frame a policy transfer as a failure or success, scholars must recognise transfer (and so failure) as a messy process involving an array of meso-level actors. Two aspects are of particular note. First, the treatment of imperfect transfer as underscored by flawed lesson-drawing is useful as it takes one back to questions about the depth of learning. Second, the chapter highlights two aspects of learning that are often overlooked in mainstream accounts: ‘negative lesson-drawing’ and selective learning. Negative lesson-drawing is a quest to avoid policy failure where policy learning is not synonymous with policy adoption. Instead, policy lessons can help crystallise what ideas and policy paths decision-makers do not wish to follow.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447352006.003.0004"
    },
    {
        "id": 18488,
        "title": "Policy failures, policy learning and institutional change: the case of Australian health insurance policy change",
        "authors": "Adrian Kay",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch006"
    },
    {
        "id": 18489,
        "title": "Policy learning and policy change: learning from research citations",
        "authors": "Caner Bakır",
        "published": "2017-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11077-017-9299-8"
    },
    {
        "id": 18490,
        "title": "Policy myopia as a source of policy failure: adaptation and policy learning under deep uncertainty",
        "authors": "Sreeja Nair, Michael Howlett",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-011"
    },
    {
        "id": 18491,
        "title": "Overcoming the Failure of ‘Silicon Somewheres’: Learning in Policy Transfer Processes",
        "authors": "Sarah Giest",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.003"
    },
    {
        "id": 18492,
        "title": "Pathologies of Policy Learning: What are they and how do they Contribute to Policy Failure?",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.002"
    },
    {
        "id": 18493,
        "title": "Overcoming the failure of ‘silicon somewheres’:",
        "authors": "Sarah Giest",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.9"
    },
    {
        "id": 18494,
        "title": "Policy myopia as a source of policy failure: adaptation and policy learning under deep uncertainty",
        "authors": "Sreeja Nair, Michael Howlett",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch007"
    },
    {
        "id": 18495,
        "title": "Pathologies of policy learning:",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.8"
    },
    {
        "id": 18496,
        "title": "Pathologies of policy learning: what are they and how do they contribute to policy failure?",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-006"
    },
    {
        "id": 18497,
        "title": "Policy learning governance: a new perspective on agency across policy learning theories",
        "authors": "Bishoy L. Zaki",
        "published": "2024-1-5",
        "citations": 1,
        "abstract": "The predominant ontological position on agency in policy learning literature has been relatively learner-oriented, thus focusing on policy actors puzzling about policy problems. In other words, it focuses on how actors acquire, translate, and disseminate knowledge and information to address policy problems or ‘puzzles’. However, despite its influence on learning and its outcomes, policy actors’ powering, or agency in shaping learning processes has been scarcely explored or theorised. Drawing on policy learning literature, this article explores and demarcates the concept of ‘policy learning governance’ as a supplementary perspective to the learner-oriented view of agency in policy learning research. Here, learning governance can be understood as the deliberate processes by which policy actors strategise, design, and govern policy learning processes towards achieving technical or political objectives. This article explains how integrating a learning governance perspective into existing conceptual approaches to policy learning can provide a better basis for understanding the interactions between different constitutive elements of policy learning processes and outcomes, such as policy or belief change. In this way, it offers a more robust baseline for explaining learning processes, an advancement that has significant implications for both policy learning theory and practice.",
        "link": "http://dx.doi.org/10.1332/03055736y2023d000000018"
    },
    {
        "id": 18498,
        "title": "Overcoming the failure of ‘silicon somewheres’: learning in policy transfer processes",
        "authors": "Sarah Giest",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-007"
    },
    {
        "id": 18499,
        "title": "Pathologies of policy learning: what are they and how do they contribute to policy failure?",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch002"
    },
    {
        "id": 18500,
        "title": "Overcoming the failure of ‘silicon somewheres’: learning in policy transfer processes",
        "authors": "Sarah Giest",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch003"
    },
    {
        "id": 18501,
        "title": "8. Policy and Learning",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12987/9780300133349-010"
    },
    {
        "id": 18502,
        "title": "Learning in European Energy Policy",
        "authors": "",
        "published": "2021-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/13662.003.0008"
    },
    {
        "id": 18503,
        "title": "6. Learning and Policy",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12987/9780300133349-008"
    },
    {
        "id": 18504,
        "title": "Back Matter",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.15"
    },
    {
        "id": 18505,
        "title": "Foreign Policy Learning",
        "authors": "Guy Ziv",
        "published": "2017-5-24",
        "citations": 2,
        "abstract": "An improved understanding of foreign policy learning necessitates a clarification of what foreign policy learning is, who learns, and how such learning occurs. Cognitive and social psychologists, sociologists, and political scientists situated in a variety of subfields have contributed to the understanding of foreign policy learning, a multidisciplinary area of inquiry. Learning theorists seek to show how a change in an actor’s beliefs due to experience or observation can lead to changes at other units, such as organizations and within the government. This cognitive dimension is important because actors may pursue a new course of action for politically expedient reasons rather than having genuinely “learned”—a distinction referred to as “complex” vs. “simple” learning.\nForeign policy learning can be internal or external. The former type of learning entails what individuals, governments, or organizations learn from their prior experience. Learning theorists who focus on the individual level of analysis borrow insights from political psychology in an effort to shed light on the personal characteristics, the belief structures, and the cognitive psychological mechanisms of political actors that can better inform policymaking. Leaders whose cognitive structures are described as relatively open and complex—like Soviet leader Mikhail Gorbachev, whose learning brought about the dramatic changes that ultimately led to the demise of the Soviet Union—are more likely to alter their beliefs than their cognitively closed and simple counterparts.\nYet external learning occurs as well. Policy diffusion studies show that learning can result from demonstration effects. Foreign policy learning via diffusion is not instrumental, but instead occurs through osmosis. Privatization in the former communist states, China’s Foreign Direct Investment liberalization, and the diffusion of environmental norms in the European Union are examples of learning that is contagious, not chosen. A more conscious mode of learning than diffusion is policy transfer, which entails policymakers’ transferring ideas from one country and implementing them in another. Technological innovations, unlike lessons that involve political ideology, are generally easier lessons to transfer—for example, Japan’s success in applying lessons from the West to modernize its army in the second half of the 19th century.\nThe constraints to foreign policy learning are formidable. Decision makers are not always open to reconsidering views that challenge their beliefs. Leaders tend to resort to, and misuse, analogies that prevent learning. Even a change in a decision maker’s beliefs may not lead to foreign policy change, given the myriad political pressures, bureaucratic hurdles, and economic realities that often get in the way of implementing new ideas. Indeed, foreign policy learning and foreign policy change are not synonymous.\nScholars face significant obstacles in studying foreign policy learning. There is no consensus on the definition of learning, on what constitutes learning, on how actors learn, when they learn, or on how to assess whether learning has taken place. Despite attempts to make sense of the confusion, scholars face the daunting challenge of improving understanding of how learning is shaped and funneled through the interaction of agents and the structures in which they are situated, as well as the relationship between learning and foreign policy change.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190228637.013.428"
    },
    {
        "id": 18506,
        "title": "Policy Learning and Policy Failure",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "First published as a special issue of Policy & Politics, this updated volume explores policy failures and the valuable opportunities for learning that they offer. Policy successes and failures offer important lessons for public officials, but often they do not learn from these experiences. The studies in this volume investigate this broken link. The book defines policy learning and failure and organises the main studies in these fields along the key dimensions of processes, products and analytical levels. Drawing together a range of experts in the field, the volume sketches a research agenda linking policy scholars with policy practice.",
        "link": "http://dx.doi.org/10.46692/9781447352013"
    },
    {
        "id": 18507,
        "title": "1. Policy, Teaching, and Learning",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12987/9780300133349-003"
    },
    {
        "id": 18508,
        "title": "Learning in U.S. Policy Toward Europe",
        "authors": "Wallace J. Thies",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-6"
    },
    {
        "id": 18509,
        "title": "Types of learning and varieties of innovation: how does policy learning enable policy innovation?",
        "authors": "Nihit Goyal, Michael Howlett",
        "published": "2024-1-8",
        "citations": 1,
        "abstract": "Policy innovation is considered important for addressing major challenges such as climate change and the sustainable energy transition. Although policy learning is likely to play a key role in enabling policy innovation, the link between them remains unclear despite much research on both topics. To address this gap, we move beyond a binary treatment of policy innovation and differentiate policy problem innovation from policy instrument innovation and policy process innovation. Subsequently, we synthesise the literature on policy learning with the research on the multiple streams framework (MSF), a well-known lens for explaining policy innovation. Like earlier policy learning studies, we distinguish several types of learning by posing the key questions of learning, but in the context of each stream of the MSF: who learns (actors), what (beliefs), how (modes), and to what effect (ripening). This new conceptualisation clarifies the relationship of each type of policy learning to the varieties of policy innovation. Further, it indicates that policy learning is likely to result in policy innovation if and only if it influences the coupling among the three streams during a window of opportunity – through policy entrepreneurship – and not otherwise. We conclude with the implications of this study for future research on policy innovation, policy learning, and the MSF.",
        "link": "http://dx.doi.org/10.1332/030557321x16841388707452"
    },
    {
        "id": 18510,
        "title": "Learning in Policy Reform Processes: Early Greening of the Common Agricultural Policy, 1985–2003",
        "authors": "",
        "published": "2021-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/13662.003.0009"
    },
    {
        "id": 18511,
        "title": "Table of Contents",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.2"
    },
    {
        "id": 18512,
        "title": "Policy Learning and Policy Failure",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g"
    },
    {
        "id": 18513,
        "title": "Index",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.14"
    },
    {
        "id": 18514,
        "title": "Learning beyond institutions",
        "authors": "Stephen Gorard",
        "published": "2018-9-5",
        "citations": 0,
        "abstract": "This chapter summarises in three strands the common theme of learning or raising academic attainment outside of normal school (or other educational institution) hours. The strands concern out-of-school hours interventions, trying to enhance parental involvement in their child's school work, and learning or self-teaching entirely separate from institutions. This chapter shows how relatively formal activities seemingly unrelated to attainment can benefit attainment at school. However, they do not seem to be able to reduce the poverty gradient in attainment. Moreover, using parents more as a resource for their children's education may not have a beneficial impact at all, and will increase rather than reduce the poverty gradient, unless parents are brought into activities conducted in schools — which is then no longer ‘education otherwise’ but just more school.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447342144.003.0008"
    },
    {
        "id": 18515,
        "title": "Abbreviations",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.7"
    },
    {
        "id": 18516,
        "title": "Learning in European Agriculture Policy, 2003–2018",
        "authors": "",
        "published": "2021-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/13662.003.0010"
    },
    {
        "id": 18517,
        "title": "Acknowledgements",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.4"
    },
    {
        "id": 18518,
        "title": "Policy Failure and Policy Learning: Examining the Conditions of Learning after Disaster",
        "authors": "Kristin O'Donovan",
        "published": "2017-7",
        "citations": 27,
        "abstract": "AbstractThe policy learning literature indicates that governments can and do learn after a policy failure but not always. The purpose of this study is to examine the conditions under which policy failure leads to policy learning. It asks two questions. First, is policy failure associated with policy learning? Second, if policy is associated with policy learning, does the failure initiate different types of learning? Using the policy failure and learning literatures as an organizing framework, this paper analyzes three comparative cases of policy failure revealed by tornados in Greensburg, Kansas (2007); Joplin, Missouri (2011); and Moore, Oklahoma (2013). It finds that failure of the policy process in agenda setting is associated with instrumental policy learning. It also finds that there are two types of failure of decision making: failure to make a timely decision and failure to make any decision. The two types of decision‐making failure are associated with different types of policy learning. In addition, the contextual factors underpinning the link between policy failure and learning are prior experience with the policy problem and capacity to learn.",
        "link": "http://dx.doi.org/10.1111/ropr.12239"
    },
    {
        "id": 18519,
        "title": "British Columbia’s Fast Ferries and Sydney’s Airport Link: Partisan Barriers to Learning from Policy Failure",
        "authors": "Joshua Newman, Malcolm G. Bird",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.005"
    },
    {
        "id": 18520,
        "title": "Contributors",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.8"
    },
    {
        "id": 18521,
        "title": "Article of Journal of Learning and Education Policy",
        "authors": " Revatikumara",
        "published": "2021-8-17",
        "citations": 0,
        "abstract": "This article provides a critical analysis of policies from two education systems that support the education of students from migrant backgrounds. This analysis examines the highly political policy context of multiculturalism to reveal how education systems acquiesce to or resist social and political forces. In making this case, the article presents an historical analysis of the Australian federal government’s multicultural policy and the events that shaped it. The article then presents an analysis of the national policy statement Multicultural Australia: United, Strong, Successful to understand the current federal position on multiculturalism. These analyses provide an understanding of the political rationality of the broader context. This article argues that education policy constructions are likely to reflect this political rationality. Against this backdrop it then examines primary policies from two education systems that relate to education for students from migrant and refugee backgrounds. The key argument is that, whilst the federal government attends to concerns about security, social integration and economic contributions, education departments can ‘resist’ and attend to broader issues related to educational equity and social justice.",
        "link": "http://dx.doi.org/10.55529/jlep.11.1.3"
    },
    {
        "id": 18522,
        "title": "Front Matter",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.1"
    },
    {
        "id": 18523,
        "title": "Policy Learning and Policy Failure",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013"
    },
    {
        "id": 18524,
        "title": "British Columbia’s fast ferries and Sydney’s Airport Link:",
        "authors": "Joshua Newman, Malcolm G. Bird",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.11"
    },
    {
        "id": 18525,
        "title": "Q-Learning in Code",
        "authors": "Mohit Sewak",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-13-8285-7_5"
    },
    {
        "id": 18526,
        "title": "Front Matter",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.1"
    },
    {
        "id": 18527,
        "title": "Between Policy Failure and Policy Success: Bricolage, Experimentalism and Translation in Policy Transfer",
        "authors": "Diane Stone",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46692/9781447352013.004"
    },
    {
        "id": 18528,
        "title": "Lifelong learning policy and quality for continuing professional development",
        "authors": "Georgios C. Papageorgiou",
        "published": "2017-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315407821-9"
    },
    {
        "id": 18529,
        "title": "Learning in Soviet Policy Toward the Arab-Israeli Conflict",
        "authors": "George W. Breslauer",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-15"
    },
    {
        "id": 18530,
        "title": "Why Competitive Politics Inhibits Learning in Soviet Foreign Policy",
        "authors": "Richard D. Anderson",
        "published": "2019-3-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-4"
    },
    {
        "id": 18531,
        "title": "Notes on contributors",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.5"
    },
    {
        "id": 18532,
        "title": "List of abbreviations",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.4"
    },
    {
        "id": 18533,
        "title": "Acknowledgements",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-004"
    },
    {
        "id": 18534,
        "title": "Index",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-012"
    },
    {
        "id": 18535,
        "title": "List of figures",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.5"
    },
    {
        "id": 18536,
        "title": "Foreword",
        "authors": "Glyn Davis",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.3"
    },
    {
        "id": 18537,
        "title": "Between policy failure and policy success:",
        "authors": "Diane Stone",
        "published": "2020-1-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.10"
    },
    {
        "id": 18538,
        "title": "List of tables",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.6"
    },
    {
        "id": 18539,
        "title": "Table of Contents",
        "authors": "",
        "published": "2021-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.2"
    },
    {
        "id": 18540,
        "title": "Policy learning in public policy studies",
        "authors": "",
        "published": "2019-7-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7765/9781526140708.00017"
    },
    {
        "id": 18541,
        "title": "British Columbia’s fast ferries and Sydney’s Airport Link: partisan barriers to learning from policy failure",
        "authors": "Joshua Newman, Malcolm G. Bird",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-009"
    },
    {
        "id": 18542,
        "title": "Learning in U.S. Policy Toward the Soviet Union in the 1980s",
        "authors": "Alexander Dallin",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-11"
    },
    {
        "id": 18543,
        "title": "Policy implementation and evaluation: Learning from experience and evidence",
        "authors": " ",
        "published": "2018-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1787/9789264301528-10-en"
    },
    {
        "id": 18544,
        "title": "British Columbia’s fast ferries and Sydney’s Airport Link: partisan barriers to learning from policy failure",
        "authors": "Joshua Newman, Malcolm G. Bird",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch005"
    },
    {
        "id": 18545,
        "title": "Front Matter",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-fm"
    },
    {
        "id": 18546,
        "title": "Acknowledgements",
        "authors": "Claire A. Dunlop",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.6"
    },
    {
        "id": 18547,
        "title": "Policy Learning and Policy Failure",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013"
    },
    {
        "id": 18548,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s2773-2339(23)00011-6"
    },
    {
        "id": 18549,
        "title": "The Politics of Policy Learning",
        "authors": "Tamara Popic",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-15497-3_2"
    },
    {
        "id": 18550,
        "title": "Types of Policy Learning and the Inquiry Process",
        "authors": "Alastair Stark",
        "published": "2018-11-22",
        "citations": 0,
        "abstract": "This chapter begins the theoretical work of the book through an exploration of the types of policy learning that we might see emerging from a public inquiry and the nature of the inquiry learning process. The purpose of this discussion is to reconceptualize the public inquiry in ways which better reflect its modern character and, in doing so, to build an organizing framework for the subsequent analysis of the book’s case studies. The chapter first presents a typology of policy learning that is used to show that inquiries have the potential to produce a range of learning outcomes that have not been properly considered before. It then discusses the learning process, making the case that we need to think about multiple, complex sequences of learning if we are to properly understand and evaluate inquiries.",
        "link": "http://dx.doi.org/10.1093/oso/9780198831990.003.0002"
    },
    {
        "id": 18551,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s2773-2339(23)00025-6"
    },
    {
        "id": 18552,
        "title": "Attempted Learning: Soviet Policy Toward the United States in the Brezhnev Era",
        "authors": "Franklyn Griffiths",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-17"
    },
    {
        "id": 18553,
        "title": "Learning in U.S. Foreign Policy: The Case of the Middle East",
        "authors": "Steven L. Spiegel",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-8"
    },
    {
        "id": 18554,
        "title": "Structure, Agency and Policy Learning: Australia’s Multinational Corporations Dilemma",
        "authors": "Tim Legrand",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-76210-4_10"
    },
    {
        "id": 18555,
        "title": "We have an SEL policy! Now what?",
        "authors": "Nick Yoder, Aimee Dang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.sel.2023.100019"
    },
    {
        "id": 18556,
        "title": "Between policy failure and policy success: bricolage, experimentalism and translation in policy transfer",
        "authors": "Diane Stone",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-008"
    },
    {
        "id": 18557,
        "title": "Taking lessons from policy theory into practice",
        "authors": "Paul Cairney",
        "published": "2021-3-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1j9mjmg.21"
    },
    {
        "id": 18558,
        "title": "Education policy country snapshots",
        "authors": "",
        "published": "2018-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1787/g276f3ed86-en"
    },
    {
        "id": 18559,
        "title": "SERVICE LEARNING AND PUBLIC POLICY EDUCATION",
        "authors": "J. J. Woo",
        "published": "2019-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789811202797_0001"
    },
    {
        "id": 18560,
        "title": "The Strategic Basic of Learning in U.S. Policy Toward China, 1949–1988",
        "authors": "Banning Ν. Garrett",
        "published": "2019-3-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-7"
    },
    {
        "id": 18561,
        "title": "Table of Contents",
        "authors": "",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s2773-2339(23)00024-4"
    },
    {
        "id": 18562,
        "title": "Table of Contents",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s2773-2339(23)00010-4"
    },
    {
        "id": 18563,
        "title": "Learning in the Nuclear Age: Soviet Strategic Arms Control Policy, 1969-1989",
        "authors": "Coit D. Blacker",
        "published": "2019-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429046285-12"
    },
    {
        "id": 18564,
        "title": "Contents",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-toc"
    },
    {
        "id": 18565,
        "title": "List of abbreviations",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-002"
    },
    {
        "id": 18566,
        "title": "Between policy failure and policy success: bricolage, experimentalism and translation in policy transfer",
        "authors": "Diane Stone",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51952/9781447352013.ch004"
    },
    {
        "id": 18567,
        "title": "List of figures and tables",
        "authors": "",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvtv942g.3"
    },
    {
        "id": 18568,
        "title": "The lessons of policy learning: types, triggers, hindrances and pathologies1",
        "authors": "Claire A Dunlop, Claudio M Radaelli",
        "published": "2021-4-2",
        "citations": 1,
        "abstract": "This chapter reviews the literature on policy learning, which has generated a huge amount of heat producing policy learning taxonomies, concepts, and methods. It discusses what are the lessons of thinking about policy processes in terms of learning, what are their triggers and hindrances, what can go wrong with learning, and what are the pathologies. It also examines features, triggers, hindrances, and pathologies of learning that depend on the policy process context in which actors interact. The chapter refers to policy actors engaged with bargaining or who have tried to understand what works on the basis of science and evidence in order to find solutions within a pre-established hierarchy of rules and procedures. It highlights four process-related contexts: epistemic, reflexivity, bargaining, and compliance with hierarchy.",
        "link": "http://dx.doi.org/10.1332/policypress/9781447359821.003.0005"
    },
    {
        "id": 18569,
        "title": "Notes on contributors",
        "authors": "",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56687/9781447352013-003"
    },
    {
        "id": 18570,
        "title": "Policy Experimentation in China: the Political Economy of Policy Learning",
        "authors": "Shaoda Wang, David Yang",
        "published": "2021-10",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3386/w29402"
    }
]