[
    {
        "id": 17471,
        "title": "SEMANTIC BORROWING FOR GENERALIZED ZERO-SHOT LEARNING",
        "authors": "Xiao-wei CHEN",
        "published": "No Date",
        "citations": 3,
        "abstract": "<p>Generalized\nzero-shot learning (GZSL) is one of the most realistic problems, but also one\nof the most challenging problems due to the partiality of the classifier to\nsupervised classes. Instance-borrowing methods and synthesizing methods solve\nthis problem to some extent with the help of testing semantics, but therefore\nneither can be used under the class-inductive instance-inductive (CIII) training setting where testing data are not available, and the latter\nrequire the training process of a classifier after generating examples. In\ncontrast, a novel method called Semantic Borrowing for\nimproving GZSL methods with compatibility metric learning under CIII is\nproposed in this paper. It borrows similar semantics in the training set, so\nthat the classifier can model the relationship between the semantics of zero-shot and\nsupervised classes more accurately during training. In practice, the\ninformation of semantics of unseen or unknown classes would not be available\nfor training while this approach does NOT need any information of semantics of\nunseen or unknown classes. The experimental results on representative GZSL\nbenchmark datasets show that it can reduce the partiality of the classifier to\nsupervised classes and improve the performance of generalized zero-shot\nclassification.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.13683919"
    },
    {
        "id": 17472,
        "title": "Zero Shot Learning Recent Advances in Robotics",
        "authors": "Sunil Singh",
        "published": "No Date",
        "citations": 0,
        "abstract": "Zero-shot learning  ability robotics enables robots to generalize their knowledge and perform tasks for which they have not been explicitly trained. This ability is extremely helpful because in classic learning approaches, robots are trained on specific tasks and require extensive data and labeled examples to perform accurately. However, in real-world scenarios, robots often encounter new or unseen tasks that were not part of their training data. We briefly survey  works in this area to give the reader a perspective about   progresses in this area.",
        "link": "http://dx.doi.org/10.20944/preprints202306.1353.v1"
    },
    {
        "id": 17473,
        "title": "SEMANTIC BORROWING FOR GENERALIZED ZERO-SHOT LEARNING",
        "authors": "Xiao-wei CHEN",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Generalized\nzero-shot learning (GZSL) is one of the most realistic problems, but also one\nof the most challenging problems due to the partiality of the classifier to\nsupervised classes. Instance-borrowing methods and synthesizing methods solve\nthis problem to some extent with the help of testing semantics, but therefore\nneither can be used under the class-inductive instance-inductive (CIII) training setting where testing data are not available, and the latter\nrequire the training process of a classifier after generating examples. In\ncontrast, a novel method called Semantic Borrowing for\nimproving GZSL methods with compatibility metric learning under CIII is\nproposed in this paper. It borrows similar semantics in the training set, so\nthat the classifier can model the relationship between the semantics of zero-shot and\nsupervised classes more accurately during training. In practice, the\ninformation of semantics of unseen or unknown classes would not be available\nfor training while this approach does NOT need any information of semantics of\nunseen or unknown classes. The experimental results on representative GZSL\nbenchmark datasets show that it can reduce the partiality of the classifier to\nsupervised classes and improve the performance of generalized zero-shot\nclassification.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.13683919.v1"
    },
    {
        "id": 17474,
        "title": "Challenges and Limitations of Few-Shot and Zero-Shot Learning",
        "authors": "V. Dankan Gowda, Sajja Suneel, P. Ramesh Naidu, S. V. Ramanan, Sampathirao Suneetha",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "Essential to the development of AI and machine learning, this chapter explores the complex areas of few-shot and zero-shot learning. There have been great advancements towards more efficient and adaptive AI systems with few-shot learning and zero-shot learning, respectively, which can learn from minimal data and infer from particular data instances without previous exposure. Nevertheless, there are several limits and difficulties associated with these procedures. This chapter delves deeply into the theoretical foundations of both techniques, explaining how they work and what problems they solve in different ways. It examines the semantic gap, domain adaptation problems, and model bias, as well as the computational restrictions, overfitting, and model generalizability that are intrinsic to few-shot learning and zero-shot learning, respectively. We may better understand the ideas' potential use in different real-world contexts by comparing and contrasting them.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch007"
    },
    {
        "id": 17475,
        "title": "Advancing Zero-Shot Learning With Fully Connected Weighted Bipartite Graphs in Machine Learning",
        "authors": "V. Dankan Gowda, Rama Chaithanya Tanguturi, Neha Patwari, S. B. Sridhara, Sampada Abhijit Dhole",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "This chapter presents a novel method for improving zero-shot learning in ML by using fully connected weighted bipartite graphs. Problems with generalizability and adaptability plague zero-shot learning, a method that lets models identify and categorize things or ideas without any explicit training. To overcome these obstacles and greatly enhance machine learning models' ability to absorb and comprehend unknown input, this chapter investigates how fully linked weighted bipartite graphs may be integrated. A thorough introduction to zero-shot learning is provided at the outset of the investigation. It describes the method's value in the machine learning field while drawing attention to the problems with and restrictions on current approaches. Anyone involved with machine learning, whether as a researcher, practitioner, or hobbyist, will find this chapter to be an invaluable resource. It lays out the theory and some practical considerations for improving zero-shot learning with fully connected weighted bipartite graphs.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch001"
    },
    {
        "id": 17476,
        "title": "A Unified Approach for Conventional Zero-Shot, Generalized Zero-Shot, and Few-Shot Learning",
        "authors": "Shafin Rahman, Salman Khan, Fatih Porikli",
        "published": "2018-11",
        "citations": 113,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tip.2018.2861573"
    },
    {
        "id": 17477,
        "title": "From Zero-Shot Machine Learning to Zero-Day Attack Detection",
        "authors": "Mohanad Sarhan, Siamak Layeghy, Marcus Gallagher, Marius Portmann",
        "published": "No Date",
        "citations": 3,
        "abstract": "Abstract\nMachine learning (ML) models have proven to be efficient in classifying data samples into their respective categories. The standard ML evaluation methodology assumes that test data samples are derived from pre-observed classes used in the training phase. However, in applications such as Network Intrusion Detection Systems (NIDSs), obtaining data samples of all attack classes to be observed is challenging. ML-based NIDSs face new attack traffic known as zero-day attacks that are not used in training due to their non-existence at the time. Therefore, this paper proposes a novel zero-shot learning methodology to evaluate the performance of ML-based NIDSs in detecting zero-day attack scenarios. In the attribute learning stage, the learning models map network data features to semantic attributes that distinguish between known attacks and benign behaviour. In the inference stage, the models construct the relationships between known and zero-day attacks to detect them as malicious. A new evaluation metric is defined as Zero-day Detection Rate (Z-DR) to measure the effectiveness of the learning model in detecting unknown attacks. The proposed framework is evaluated using two key ML models and two modern NIDS data sets. The results demonstrate that for certain zero-day attack groups discovered in this paper, ML-based NIDSs are ineffective in detecting them as malicious. Further analysis shows that attacks with a low Z-DR have a significantly distinct feature distribution and a higher Wasserstein Distance range than the other attack classes.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2097775/v1"
    },
    {
        "id": 17478,
        "title": "Peer Review #2 of \"Semantic-visual shared knowledge graph for zero-shot learning (v0.1)\"",
        "authors": "",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1260v0.1/reviews/2"
    },
    {
        "id": 17479,
        "title": "Peer Review #3 of \"Semantic-visual shared knowledge graph for zero-shot learning (v0.1)\"",
        "authors": "",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1260v0.1/reviews/3"
    },
    {
        "id": 17480,
        "title": "Zero-Shot Learning",
        "authors": "Christoph H. Lampert",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63416-2_874"
    },
    {
        "id": 17481,
        "title": "Peer Review #4 of \"Semantic-visual shared knowledge graph for zero-shot learning (v0.1)\"",
        "authors": "",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1260v0.1/reviews/4"
    },
    {
        "id": 17482,
        "title": "Peer Review #3 of \"Semantic-visual shared knowledge graph for zero-shot learning (v0.2)\"",
        "authors": "",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1260v0.2/reviews/3"
    },
    {
        "id": 17483,
        "title": "Learning Unsupervised Side Information for Zero-Shot Learning",
        "authors": "Fan Zhang",
        "published": "2021-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/conf-spml54095.2021.00070"
    },
    {
        "id": 17484,
        "title": "Lvq Treatment for Zero-Shot Learning",
        "authors": "Firat Ismailoglu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4025907"
    },
    {
        "id": 17485,
        "title": "Few-Shot and Zero-Shot Learning for Historical Text Normalization",
        "authors": "Marcel Bollmann, Natalia Korchagina, Anders Søgaard",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/d19-6112"
    },
    {
        "id": 17486,
        "title": "Exploring Few-Shot Learning Approaches for Bioinformatics Advancements",
        "authors": "Neha Bhati, Ronak Duggar, Abdullah Alzahrani",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "This chapter delves deeply into few-shot learning, a rapidly developing area crucial in driving bioinformatics forward. First, the basics of few-shot learning are laid forth, emphasizing the field's applicability to bioinformatics. Case studies showcasing real-world applications in areas as varied as protein structure prediction, drug development, and genomic analysis provide a deep dive into several few-shot learning approaches like meta-learning and transfer learning. The chapter also provides an in-depth analysis of recent developments, highlights current difficulties, and suggests exciting new avenues for exploration. This chapter highlights the rising significance of few-shot learning in bioinformatics and provides insights into its potential to benefit biomedical research.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch016"
    },
    {
        "id": 17487,
        "title": "Peer Review #1 of \"Semantic-visual shared knowledge graph for zero-shot learning (v0.1)\"",
        "authors": "S C",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1260v0.1/reviews/1"
    },
    {
        "id": 17488,
        "title": "Zero-Shot Learning",
        "authors": "Christoph H. Lampert",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-03243-2_874-1"
    },
    {
        "id": 17489,
        "title": "Learning From Scarcity",
        "authors": "Pooja Dixit, Advait Vihan Kommula, Pramod Sing Rathore",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "This chapter delves into the transformative synergy of few-shot learning and healthcare, elucidating its impact on medical procedures. Anchored in machine learning fundamentals, it establishes a core framework through a review of algorithms. Addressing challenges of small healthcare datasets, the chapter highlights the pivotal role of few-shot learning. Innovative methods like multimodal integration and federated learning enhance model robustness, offering insights into complex healthcare scenarios. Formal mathematical explanations categorize few-shot learning challenges, opening avenues for a deeper understanding and implementation in medical imaging.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch018"
    },
    {
        "id": 17490,
        "title": "Zero-shot learning of aerosol optical properties with graph neural networks",
        "authors": "Kara Lamb, Pierre Gentine",
        "published": "No Date",
        "citations": 0,
        "abstract": "Black carbon (BC), a strongly absorbing aerosol sourced from combustion, is an important short-lived climate forcer. BC&#8217;s complex morphology contributes to uncertainty in its direct climate radiative effects, as current methods to accurately calculate the optical properties of these aerosols are too computationally expensive to be used online in models or for observational retrievals. Here we demonstrate that a Graph Neural Network (GNN) trained to predict the optical properties of numerically-generated BC fractal aggregates can accurately generalize to arbitrarily shaped particles, including much larger (10x) aggregates than in the training dataset. This zero-shot learning approach could be used to estimate single particle optical properties of realistically-shaped aerosol and cloud particles for inclusion in radiative transfer codes for atmospheric models and remote sensing inversions. In addition, GNN&#8217;s can be used to gain physical intuition on the relationship between small-scale interactions (here of the spheres&#8217; positions and interactions) and large-scale properties (here of the radiative properties of aerosols).",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-13925"
    },
    {
        "id": 17491,
        "title": "Zero-Shot Learning with Knowledge Transfer: Leveraging Semantic Relationships for Improved Recognition",
        "authors": "Bheema Shanker Neyigapula",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4606493"
    },
    {
        "id": 17492,
        "title": "Visually Analyzing and Steering Zero Shot Learning",
        "authors": "Saroj Sahoo, Matthew Berger",
        "published": "2020-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vis47514.2020.00057"
    },
    {
        "id": 17493,
        "title": "From Zero-Shot Machine Learning to Zero-Day Attack Detection",
        "authors": "Mohanad Sarhan, Siamak Layeghy, Marcus Gallagher, Marius Portmann",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4029439"
    },
    {
        "id": 17494,
        "title": "Unspecialized Belief Learning for Zero-Shot Coordination",
        "authors": "Hongfei Yu, Kunyu Ni, Wenjun Yu, Yu Huang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAn important and challenging problem setting in decentralized partially observable Markov decision processes is zero-shot coordination (ZSC), where an AI agent must coordinate with novel partners without prior coordination. However, agents trained by standard multi-agent reinforcement learning algorithms in self-play setting study policies by playing the game themselves and thus cannot coordinate on the policies when paired with humans or other novel agents. Despite that some recent works have attributed the failure to highly specialized conventions, the lack of the explanation of how the conventions are adopted makes the viewpoint unconvincing. To explain this, we first construct a model to describe the formation of specialized conventions. Then, we present unspecialized belief learning (UBL), which enhances controlling the specialization of belief. UBL can reduce specialized conventions and shows significant performance in a simple toy-setting and the benchmark problem Hanabi. Finally, we discuss the future work of ZSC, including human-AI teaming and interpretability of AI.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1885266/v1"
    },
    {
        "id": 17495,
        "title": "Zero‐Shot Learning",
        "authors": "Ron S. Kenett",
        "published": "2023-8-28",
        "citations": 1,
        "abstract": "AbstractZero hot Learning is a machine learning technique that allows a model to classify objects from previously unseen classes, without any specific training for those classes. It generalizes a predictive analytic model to unseen classes without any additional training.",
        "link": "http://dx.doi.org/10.1002/9781118445112.stat08446"
    },
    {
        "id": 17496,
        "title": "Meta-XNLG: A Meta-Learning Approach Based on Language Clustering for Zero-Shot Cross-Lingual Transfer and Generation: A Meta-Learning Approach Based on Language Clustering for Zero-Shot Cross-Lingual Transfer and Generation",
        "authors": "Kaushal Maurya, Maunendra Desarkar",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.findings-acl.24"
    },
    {
        "id": 17497,
        "title": "Zero-Vuln: Using deep learning and zero-shot learning techniques to detect zero-day Android malware",
        "authors": "Zakaria Sawadogo, Jean-Marie Dembele, Gervais Mendy, Samuel Ouya",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10252803"
    },
    {
        "id": 17498,
        "title": "Introduction to Bioinformatics and Machine Learning",
        "authors": "Rakhi Chauhan",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "ML has revolutionised bioinformatics' difficult biological data analysis. Pattern recognition and biological process categorization help ML systems diagnose diseases, predict protein structures, and investigate gene expression. Few-shot learning and bioinformatics are effective at optimising results with limited resources, overcoming biological dataset access issues. ML and bioinformatics advance precision medicine and drug discovery while improving biological understanding. This chapter examines bioinformatics ML methods like supervised classification, clustering, and probabilistic graphical models to find new insights. Text mining, systems biology, evolution, proteomics, and genomics use deterministic and stochastic heuristics for optimisation. Understanding bioinformatics methods and modern ML technologies while understanding implementation challenges is the study goal. Few-shot learning is highlighted to show its importance. ML and bioinformatics together improve our knowledge and solve real problems, improving research methods in biological and medical sciences.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch017"
    },
    {
        "id": 17499,
        "title": "Exploration of Deep Learning and Transfer Learning in Bioinformatics",
        "authors": "Yash Mahajan, Muskan Sharma",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "In the dynamic field of bioinformatics, the fusion of deep learning and transfer learning techniques has ushered in a transformative era of discovery. Deep learning, powered by neural networks, has emerged as a formidable tool for deciphering intricate biological data, spanning genomics, proteomics, and metabolomics. Its capacity to automatically discern complex patterns and features within vast datasets has revolutionized our comprehension of biological processes. Transfer learning, a complementary approach, introduces a novel dimension to bioinformatics. By harnessing pre-trained models from domains like computer vision and natural language processing, researchers can expedite their analyses, reducing the demand for extensive labeled data. This cross-domain knowledge transfer expedites the progress of bioinformatics applications, from predicting protein structures to identifying disease biomarkers.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch012"
    },
    {
        "id": 17500,
        "title": "Few-Shot and Zero-Shot Multi-Label Learning for Structured Label Spaces",
        "authors": "Anthony Rios, Ramakanth Kavuluru",
        "published": "2018",
        "citations": 69,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/d18-1352"
    },
    {
        "id": 17501,
        "title": "Instance-Specific Model Perturbation Improves Generalized Zero-Shot Learning",
        "authors": "Guanyu Yang, Kaizhu Huang, Rui Zhang, Xi Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4255819"
    },
    {
        "id": 17502,
        "title": "Zero-Shot Kernel Learning",
        "authors": "Hongguang Zhang, Piotr Koniusz",
        "published": "2018-6",
        "citations": 71,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2018.00800"
    },
    {
        "id": 17503,
        "title": "Creativity Inspired Zero-Shot Learning",
        "authors": "Mohamed Elhoseiny, Mohamed Elfeki",
        "published": "2019-10",
        "citations": 28,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2019.00588"
    },
    {
        "id": 17504,
        "title": "Contrastive Prototype-Guided Generation for Generalized Zero-Shot Learning",
        "authors": "Yunyun Wang, Jian Mao, Chenguang Guo, Songcan Chen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4545107"
    },
    {
        "id": 17505,
        "title": "Zero-Shot Federated Learning with New Classes for Audio Classification",
        "authors": "Gautham Krishna Gudur, Satheesh Kumar Perepu",
        "published": "2021-8-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2021-2264"
    },
    {
        "id": 17506,
        "title": "Large Language Models for Text Classification: From Zero-Shot Learning to Fine-Tuning",
        "authors": "Youngjin Chae, Thomas Davidson",
        "published": "No Date",
        "citations": 1,
        "abstract": "This study analyzes large language models (LLMs) as a methodology for computational sociology, focusing on applications to supervised text classification. We consider how the latest generation of text-to-text transformer models can make predictions using prompts and minimal training examples and assess the sensitivity of these approaches to wording and composition. Through a comprehensive case study on identifying opinions expressed about politicians on Twitter and Facebook, we evaluate four different LLM architectures, varying in size, training data, and architecture. We compare the performance across different training regimes, from prompt-based zero-shot learning to fine-tuning using thousands of annotated examples. Our findings demonstrate how LLMs can perform complex text classification tasks with high accuracy, substantially outperforming conventional baselines. We use these results to provide practical recommendations for sociologists interested in employing LLMs for text classification tasks. Fine-tuning smaller models offers an optimal solution for most researchers due to their relatively high accuracy and low cost. We discuss the trade-offs between proprietary and open-source models, the importance of evaluating models for bias, and concerns related to transparency and reproducibility. This study contributes to understanding the capabilities and limitations of these models in a sociological context, providing a foundation for future research and applications in the field.",
        "link": "http://dx.doi.org/10.31235/osf.io/sthwk"
    },
    {
        "id": 17507,
        "title": "System alignment supports cross-domain learning and zero-shot generalisation",
        "authors": "Kaarina Aho, Brett Roads, Bradley C. Love",
        "published": "No Date",
        "citations": 0,
        "abstract": "Recent findings suggest conceptual relationships hold across modalities. For instance, if two concepts occur in similar linguistic contexts, they also likely occur in similar visual contexts. These similarity structures may provide a valuable signal for system alignment when learning to map between domains, such as when learning the names of objects. To assess this possibility, we conducted a paired-associate learning experiment in which participants mapped objects that varied on two visual features to locations that varied along two spatial dimensions. We manipulated whether the featural and spatial systems were \\textit{aligned} or \\textit{misaligned}. Although system alignment was not required to complete this supervised learning task, we found that participants learned more efficiently when systems aligned and that aligned systems facilitated zero-shot generalisation. We fit a variety of models to individuals' responses and found that models which included an offline unsupervised alignment mechanism best accounted for human performance. Our results provide empirical evidence that people align entire representation systems to accelerate learning, even when learning seemingly arbitrary associations between two domains.",
        "link": "http://dx.doi.org/10.31234/osf.io/pm3ay"
    },
    {
        "id": 17508,
        "title": "Zero-Shot Transfer Learning using Affix and Correlated Cross-Lingual Embeddings.",
        "authors": "Abiodun Modupe, Thapelo Sindane, Vukosi Marivate",
        "published": "No Date",
        "citations": 0,
        "abstract": "Learning morphologically supplemented embedding spaces using\ncross-lingual models has become an active area of research and\nfacilitated many research breakthroughs in various applications such as\nmachine translation, named entity recognition, document classification,\nand natural language inference. However, the field has not become\ncustomary for Southern African low-resourced languages. In this paper,\nwe present, evaluate and benchmark a cohort of cross-lingual embeddings\nfor the English-Southern African languages on two classification tasks:\nNews Headlines Classification (NHC) and Named Entity Recognition (NER).\nOur methodology considers four agglutinative languages from the eleven\nofficial South African languages: Isixhosa, Sepedi, Sesotho, and\nSetswana. Canonical correlation analyses and VecMap are the two\ncross-lingual alignment strategies adopted for this study. Monolingual\nembeddings used in this work are Glove (source), and FastText (source\nand target) embeddings. Our results indicate that with enough comparable\ncorpora, we can develop strong inter-joined representations between\nEnglish and the considered Southern African languages. More\nspecifically, the best zero-shot transfer results on the available\nSetswana NHC dataset were achieved using canonically correlated\nembeddings with Multi-layered perceptron as the training model (54.5%\naccuracy). Furthermore, our NER best performance was achieved using\ncanonically correlated cross-lingual embeddings with Conditional Random\nFields as the training model (96.4% F1 score). Collectively, this\nstudy’s results were competitive with the benchmarks of the explored NHC\nand NER datasets, on both zero-short NHC and NER tasks with our\nadvantage being the use of very minimal resources.",
        "link": "http://dx.doi.org/10.22541/au.167878643.36371140/v1"
    },
    {
        "id": 17509,
        "title": "Detecting Errors with Zero-Shot Learning",
        "authors": "Xiaoyu Wu, Ning Wang",
        "published": "2022-7-6",
        "citations": 2,
        "abstract": "Error detection is a critical step in data cleaning. Most traditional error detection methods are based on rules and external information with high cost, especially when dealing with large-scaled data. Recently, with the advances of deep learning, some researchers focus their attention on learning the semantic distribution of data for error detection; however, the low error rate in real datasets makes it hard to collect negative samples for training supervised deep learning models. Most of the existing deep-learning-based error detection algorithms solve the class imbalance problem by data augmentation. Due to the inadequate sampling of negative samples, the features learned by those methods may be biased. In this paper, we propose an AEGAN (Auto-Encoder Generative Adversarial Network)-based deep learning model named SAT-GAN (Self-Attention Generative Adversarial Network) to detect errors in relational datasets. Combining the self-attention mechanism with the pre-trained language model, our model can capture semantic features of the dataset, specifically the functional dependency between attributes, so that no rules or constraints are needed for SAT-GAN to identify inconsistent data. For the lack of negative samples, we propose to train our model via zero-shot learning. As a clean-data tailored model, SAT-GAN tries to recognize error data as outliers by learning the latent features of clean data. In our evaluation, SAT-GAN achieves an average F1-score of 0.95 on five datasets, which yields at least 46.2% F1-score improvement over rule-based methods and outperforms state-of-the-art deep learning approaches in the absence of rules and negative samples.",
        "link": "http://dx.doi.org/10.3390/e24070936"
    },
    {
        "id": 17510,
        "title": "Zero-Shot Learning Across Heterogeneous Overlapping Domains",
        "authors": "Anjishnu Kumar, Pavankumar Reddy Muddireddy, Markus Dreyer, Björn Hoffmeister",
        "published": "2017-8-20",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2017-516"
    },
    {
        "id": 17511,
        "title": "Application of CLIP on Advanced GAN of Zero-Shot Learning",
        "authors": "Peize Li",
        "published": "2021-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/conf-spml54095.2021.00052"
    },
    {
        "id": 17512,
        "title": "CNN-Zero: A Zero-Shot Learning Framework for Jamming Identification",
        "authors": "Ningsong Zhang, Junren Shen, Yuxin Shi, Yusheng Li",
        "published": "2022-11-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icct56141.2022.10072650"
    },
    {
        "id": 17513,
        "title": "Towards Zero Shot Learning of Geometry of Motion Streams and Its Application to Anomaly Recognition",
        "authors": "Himanshu Buckchash, Balasubramanian Raman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Publicly available action recognition datasets were used.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12578306"
    },
    {
        "id": 17514,
        "title": "Bias: Bijective Input And Surjectivity In Zero Shot Learning",
        "authors": "Rishabh Singh",
        "published": "2021-9-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip42928.2021.9506409"
    },
    {
        "id": 17515,
        "title": "Semantic Intervention GAN for Generalized Zero-Shot Learning",
        "authors": "Yun Zaho, Haohao Song, Di Tang",
        "published": "2022-11-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac57257.2022.10055255"
    },
    {
        "id": 17516,
        "title": "Towards Zero Shot Learning of Geometry of Motion Streams and Its Application to Anomaly Recognition",
        "authors": "Himanshu Buckchash, Balasubramanian Raman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Publicly available action recognition datasets were used.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12578306.v1"
    },
    {
        "id": 17517,
        "title": "Infrared Colorization with Cross-Modality Zero-Shot Learning",
        "authors": "Chiheng Wei, Huawei Chen, Lianfa Bai, Jing Han, Xiaoyu Chen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4663076"
    },
    {
        "id": 17518,
        "title": "Co-GZSL: Feature Contrastive Optimization for Generalized Zero-Shot Learning",
        "authors": "Qun Li, Zhuxi Zhan, Yaying Shen, Bir Bhanu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4355391"
    },
    {
        "id": 17519,
        "title": "Ordinal Zero-Shot Learning",
        "authors": "Zengwei Huo, Xin Geng",
        "published": "2017-8",
        "citations": 4,
        "abstract": "Zero-shot learning predicts new class even if no training data is available for that class. The solution to conventional zero-shot learning usually depends on side information such as attribute or text corpora. But these side information is not easy to obtain or use. Fortunately in many classification tasks, the class labels are ordered, and therefore closely related to each other. This paper deals with zero-shot learning for ordinal classification. The key idea is using label relevance to expand supervision information from seen labels to unseen labels. The proposed method SIDL generates a supervision intensity distribution (SID) that contains each label's supervision intensity, and then learns a mapping from instance to SID. Experiments on two typical ordinal classification problems, i.e., head pose estimation and age estimation, show that SIDL performs significantly better than the compared regression methods. Furthermore, SIDL appears much more robust against the increase of unseen labels than other compared baselines.",
        "link": "http://dx.doi.org/10.24963/ijcai.2017/266"
    },
    {
        "id": 17520,
        "title": "Federated Zero-Shot Learning with Mid-Level Semantic Knowledge Transfer",
        "authors": "Shitong Sun, Chenyang Si, Guile Wu, Shaogang Gong",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4743932"
    },
    {
        "id": 17521,
        "title": "Learning a Deep Embedding Model for Zero-Shot Learning",
        "authors": "Li Zhang, Tao Xiang, Shaogang Gong",
        "published": "2017-7",
        "citations": 398,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2017.321"
    },
    {
        "id": 17522,
        "title": "Learning Visually Consistent Label Embeddings for Zero-Shot Learning",
        "authors": "Berkan Demirel, Ramazan Gokberk Cinbis, Nazli Ikizler-Cinbis",
        "published": "2019-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8803458"
    },
    {
        "id": 17523,
        "title": "DeepGOZero: Improving protein function prediction from sequence and zero-shot learning based on ontology axioms",
        "authors": "Maxat Kulmanov, Robert Hoehndorf",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractMotivationProtein functions are often described using the Gene Ontology (GO) which is an ontology consisting of over 50,000 classes and a large set of formal axioms. Predicting the functions of proteins is one of the key challenges in computational biology and a variety of machine learning methods have been developed for this purpose. However, these methods usually require significant amount of training data and cannot make predictions for GO classes which have only few or no experimental annotations.ResultsWe developed DeepGOZero, a machine learning model which improves predictions for functions with no or only a small number of annotations. To achieve this goal, we rely on a model-theoretic approach for learning ontology embeddings and combine it with neural networks for protein function prediction. DeepGOZero can exploit formal axioms in the GO to make zero-shot predictions, i.e., predict protein functions even if not a single protein in the training phase was associated with that function. Furthermore, the zero-shot prediction method employed by DeepGOZero is generic and can be applied whenever associations with ontology classes need to be predicted.Availabilityhttp://github.com/bio-ontology-research-group/deepgozeroContactrobert.hoehndorf@kaust.edu.sa",
        "link": "http://dx.doi.org/10.1101/2022.01.14.476325"
    },
    {
        "id": 17524,
        "title": "Hard Zero Shot Learning for Gesture Recognition",
        "authors": "Naveen Madapana, Juan P. Wachs",
        "published": "2018-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr.2018.8545869"
    },
    {
        "id": 17525,
        "title": "Zero-shot compositional reinforcement learning in humans",
        "authors": "Akshay Kumar Jagadish, Marcel Binz, Tankred Saanum, Jan X. Wang, Eric Schulz",
        "published": "No Date",
        "citations": 0,
        "abstract": "People can easily evoke previously learned concepts, compose them, and apply the result to solve novel tasks on the first attempt. The aim of this paper is to improve our understanding of how people make such zero-shot compositional inferences in a reinforcement learning setting. To achieve this, we introduce an experimental paradigm where people learn two latent reward functions and need to compose them correctly to solve a novel task. We find that people have the capability to engage in zero-shot compositional reinforcement learning but deviate systematically from optimality. However, their mistakes are structured and can be explained by their performance in the sub-tasks leading up to the composition. Through extensive model-based analyses, we found that a meta-learned neural network model that accounts for limited computational resources best captures participants’ behaviour. Moreover, the amount of computational resources this model identified reliably quantifies how good individual participants are at zero-shot compositional reinforcement learning. Taken together, our work takes a considerable step towards studying compositional reasoning in agents – both natural and artificial – with limited computational resources.",
        "link": "http://dx.doi.org/10.31234/osf.io/ymve5"
    },
    {
        "id": 17526,
        "title": "Discriminative Feature Extraction Network for Generalized Zero Shot Learning",
        "authors": "Xiaorong Zhong, Xiao Hu, Jiayu Ding",
        "published": "2022-11-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac57257.2022.10055043"
    },
    {
        "id": 17527,
        "title": "Exploration of Deep Learning and Transfer Learning Techniques in Bioinformatics",
        "authors": "Sumit Bansal, Vandana Sindhi, Bhim Sain Singla",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "The blend of profound learning and more learning techniques has brought about a worldview change in the creating subject of bioinformatics. The revolutionary environment that emerges when the complexity of biological data and artificial intelligence meet is the subject of this book chapter. The section explores profound learning models and moves learning closer, as well as the imaginative applications, hardships, and achievements that have developed at the crossing point of these two powerful fields. The section opens with a point-by-point assessment of profound learning standards and how they are applied to the unique difficulties of bioinformatics datasets. The section likewise digs into the idea of move learning—a strong worldview that utilizes information learned in one space to further develop execution in another. It has been shown that movement learning is powerful. The section likewise dives into the idea of move learning—a strong worldview that involves mastery in one region to further develop execution in another.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch013"
    },
    {
        "id": 17528,
        "title": "An Overview and Analysis of Machine Learning Classification Algorithms in Healthcare",
        "authors": "Soumitra Saha",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "To decode a wide range of complex and challenging problems around us, we must utilize the data that already exists in our surroundings as effectively as possible. This data will be functional in diverse fields in everyday life, and the data plays the most crucial role in healthcare and medicine, finance and banking, and information technology. The first, foremost, and prime reason for forming or generating this big data is the increasing complexity of real-world problems, which takes considerable work to implement. For example, in healthcare and medicine, extensive data are needed to detect deadly diseases like cancer, cardiovascular diseases, and HIV/AIDS effectively. Classification algorithms are the essential and substantial machine learning algorithms used to decode numerous challenging real-life problems in the healthcare industry. Implementing the algorithm encounters fewer problems regarding time and space and comparatively better interpretability and scalability. Through this study, the authors have demonstrated how different classification algorithms perform in the healthcare system.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch003"
    },
    {
        "id": 17529,
        "title": "Learning Discriminative Latent Features for Generalized Zero-and Few-Shot Learning",
        "authors": "Yijie Huang, Zhenghong Deng, Tao Wu",
        "published": "2020-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icme46284.2020.9102802"
    },
    {
        "id": 17530,
        "title": "Zero-Shot Compositional Concept Learning",
        "authors": "Guangyue Xu, Parisa Kordjamshidi, Joyce Chai",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.metanlp-1.3"
    },
    {
        "id": 17531,
        "title": "Weakly Supervised Few-Shot and Zero-Shot Semantic Segmentation with Mean Instance Aware Prompt Learning",
        "authors": "Prashant Pandey, Mustafa Chasmai, Monish Natarajan, Brejesh Lall",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00009"
    },
    {
        "id": 17532,
        "title": "Zero-Shot Learning with Fuzzy Attribute",
        "authors": "Chongwen Liu, Zhaowei Shang, Yuan Yan Tang",
        "published": "2017-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cybconf.2017.7985823"
    },
    {
        "id": 17533,
        "title": "mcBERT: Momentum Contrastive Learning with BERT for Zero-Shot Slot Filling",
        "authors": "Seong-Hwan Heo, WonKee Lee, Jong-Hyeok Lee",
        "published": "2022-9-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2022-839"
    },
    {
        "id": 17534,
        "title": "Field-Guide-Inspired Zero-Shot Learning",
        "authors": "Utkarsh Mall, Bharath Hariharan, Kavita Bala",
        "published": "2021-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv48922.2021.00941"
    },
    {
        "id": 17535,
        "title": "Zero-Shot Learning for Computer Vision Applications",
        "authors": "Sandipan Sarma",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3581783.3613435"
    },
    {
        "id": 17536,
        "title": "Deep Zero-Shot Learning for Scene Sketch",
        "authors": "Yao Xie, Peng Xu, Zhanyu Ma",
        "published": "2019-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8803426"
    },
    {
        "id": 17537,
        "title": "RetailKLIP: Finetuning OpenCLIP Backbone Using Metric Learning on a Single GPU for Zero-Shot Retail Product Image Classification",
        "authors": "Muktabh Srivastava",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012576000003660"
    },
    {
        "id": 17538,
        "title": "Mulit-View Graph Representation with Similarity Diffusion for General Zero-Shot Learning",
        "authors": "Beibei Yu, Cheng Xie, Peng Tang, Haoran Duan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4291796"
    },
    {
        "id": 17539,
        "title": "Self-supervised Contrastive learning for Zero-shot automatic retail checkout",
        "authors": "Annesha Nath",
        "published": "2022-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/asyu56188.2022.9925453"
    },
    {
        "id": 17540,
        "title": "Unveiling the Potential",
        "authors": "Umesh Kumar Lilhore, Sarita Simaiya",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "In the rapidly evolving field of bioinformatics, the surge in biological data necessitates innovative approaches for practical analysis and comprehension. This chapter presents an in-depth exploration of the potential applications of deep learning and transfer learning methods, showcasing their transformative impact on various facets of bioinformatics research. Deep learning methodologies significantly enhance the capacity to extract intricate patterns and features from diverse biological datasets, fostering a more profound understanding of genomic, proteomic, and metabolomic dynamics. Additionally, transfer learning assumes a pivotal role in optimizing model performance, particularly in scenarios where labeled data is scarce, by leveraging knowledge acquired from pre-trained models. The integration of deep learning and transfer learning techniques in bioinformatics yields valuable insights, serving as a guiding framework for researchers and practitioners aiming to harness the full potential of these methodologies in deciphering the complexities of biological systems.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch008"
    },
    {
        "id": 17541,
        "title": "Zero-Shot Learning for Intelligent Fault Detection",
        "authors": "Siyu Zhang, Hua-Liang Wei",
        "published": "2022-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icac55051.2022.9911104"
    },
    {
        "id": 17542,
        "title": "DeepKinZero: Zero-Shot Learning for Predicting Kinase-Phosphosite Associations Involving Understudied Kinases",
        "authors": "Iman Deznabi, Busra Arabaci, Mehmet Koyutürk, Oznur Tastan",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractProtein phosphorylation is a key regulator of protein function in signal transduction pathways. Kinases are the enzymes that catalyze the phosphorylation of other proteins in a target specific manner. The dysregulation of phosphorylation is associated with many diseases including cancer. Although the advances in phosphoproteomics enable the identification of phosphosites at the proteome level, most of the phosphoproteome is still in the dark: more than 95% of the reported human phosphosites have no known kinases. Determining which kinase is responsible for phosphorylating a site remains an experimental challenge. Existing computational methods require several examples of known targets of a kinase to make accurate kinase specific predictions, yet for a large body of kinases, only a few or no target sites are reported. We present DeepKinZero, the first zero-shot learning approach to predict the kinase acting on a phosphosite for kinases with no known phosphosite information. DeepKinZero transfers knowledge from kinases with many known target phosphosites to those kinases with no known sites through a zero-shot learning model. The kinase specific positional amino acid preferences are learned using a bidirectional recurrent neural network. We show that DeepKinZero achieves significant improvement in accuracy for kinases with no known phosphosites in comparison to the baseline model and other methods available. By expanding our knowledge on understudied kinases, DeepKinZero can help to chart the phosphoproteome atlas.",
        "link": "http://dx.doi.org/10.1101/670638"
    },
    {
        "id": 17543,
        "title": "Lifelong Zero-Shot Learning",
        "authors": "Kun Wei, Cheng Deng, Xu Yang",
        "published": "2020-7",
        "citations": 27,
        "abstract": "Zero-Shot Learning (ZSL) handles the problem that some testing classes never appear in training set. Existing ZSL methods are designed for learning from a fixed training set, which do not have the ability to capture and accumulate the knowledge of multiple training sets, causing them infeasible to many real-world applications. In this paper, we propose a new ZSL setting, named as Lifelong Zero-Shot Learning (LZSL), which aims to accumulate the knowledge during the learning from multiple datasets and recognize unseen classes of all trained datasets. Besides, a novel method is conducted to realize LZSL, which effectively alleviates the Catastrophic Forgetting in the continuous training process. Specifically, considering those datasets containing different semantic embeddings, we utilize Variational Auto-Encoder to obtain unified semantic representations. Then, we leverage selective retraining strategy to preserve the\n\ntrained weights of previous tasks and avoid negative transfer when fine-tuning the entire model. Finally, knowledge distillation is employed to transfer knowledge from previous training stages to current stage. We also design the LZSL evaluation protocol and the challenging benchmarks. Extensive experiments on these benchmarks indicate that our method tackles LZSL problem effectively, while existing ZSL methods fail.",
        "link": "http://dx.doi.org/10.24963/ijcai.2020/77"
    },
    {
        "id": 17544,
        "title": "Preserving Semantic Relations for Zero-Shot Learning",
        "authors": "Soma Biswas, Yashas Annadani",
        "published": "2018-6",
        "citations": 41,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2018.00793"
    },
    {
        "id": 17545,
        "title": "Attributes learning network for generalized zero-shot learning",
        "authors": "Yu Yun, Sen Wang, Mingzhen Hou, Quanxue Gao",
        "published": "2022-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.02.018"
    },
    {
        "id": 17546,
        "title": "Dialogue State Tracking with Zero-Shot and Few-Shot Learning for Generalization: A Review",
        "authors": "Seungyeon Kim, Yejin Park, Junseong Bang",
        "published": "2022-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/platcon55845.2022.9932101"
    },
    {
        "id": 17547,
        "title": "Zero-shot Voice Conversion via Self-supervised Prosody Representation Learning",
        "authors": "Shijun Wang, Damian Borth",
        "published": "2022-7-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn55064.2022.9892405"
    },
    {
        "id": 17548,
        "title": "A novel spatial-frequency feature representation network for zero-shot incremental learning",
        "authors": "Jie Ren, Yang Zhao, Weichuan Zhang, Changming Sun",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nZero-shot incremental learning aims to enable the model to generalize to new classes without forgetting previously learned classes. However, the semantic gap between old and new sample classes can lead to catastrophic forgetting. Additionally, existing algorithms lack capturing significant information from each sample image domain, impairing models’ classification performance. Therefore, this paper proposes A novel Spatial-Frequency Feature Representation Network (SFFRNet) which contains a Spatial-Frequency Feature Extraction (SFFE) module and Attention Feature Alignment (AFA) module to improve the Zero-Shot Translation for Class Incremental algorithm. Firstly, SFFE module is designed which contains a dual attention mechanism for obtaining salient spatial-frequency feature information. Secondly, a novel feature fusion module is conducted for obtaining fused spatial-frequency domain features. Thirdly, the Nearest Class Mean classifier is utilized to select the most suitable category. Finally, iteration between tasks is performed using the Zero-Shot Translation model. The proposed SFFRNet has the ability to effectively extract spatial-frequency feature representation from input images, improve the accuracy of image classification, and fundamentally alleviate catastrophic forgetting. Extensive experiments on the CUB 200-2011 and CIFAR-100 datasets demonstrate that our proposed algorithm outperforms state-of-the-art incremental learning algorithms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3963956/v1"
    },
    {
        "id": 17549,
        "title": "Transductive Learning for Zero-Shot Object Detection",
        "authors": "Shafin Rahman, Salman Khan, Nick Barnes",
        "published": "2019-10",
        "citations": 50,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2019.00618"
    },
    {
        "id": 17550,
        "title": "Zero-Shot Task Transfer",
        "authors": "Arghya Pal, Vineeth N. Balasubramanian",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-45529-3_13"
    },
    {
        "id": 17551,
        "title": "Bi-shifting semantic auto-encoder for zero-shot learning",
        "authors": "Yu Wang",
        "published": "2022",
        "citations": 0,
        "abstract": "<abstract><p>Zero-shot learning aims to transfer the model of labeled seen classes in the source domain to the disjoint unseen classes without annotations in the target domain. Most existing approaches generally consider directly adopting the visual-semantic projection function learned in the source domain to the target domain without adaptation. However, due to the distribution discrepancy between the two domains, it remains challenging in dealing with the projection domain shift problem. In this work, we formulate a novel bi-shifting semantic auto-encoder to learn the semantic representations of the target instances and reinforce the generalization ability of the projection function. The encoder aims at mapping the visual features into the semantic space by leveraging the visual features of target instances and is guided by the semantic prototypes of seen classes. While two decoders manage to respectively reconstruct the original visual features in the source and target domains. Thus, our model can capture the generalized semantic characteristics related with the seen and unseen classes to alleviate the projection function problem. Furthermore, we develop an efficient algorithm by the advantage of the linear projection functions. Extensive experiments on the five benchmark datasets demonstrate the competitive performance of our proposed model.</p></abstract>",
        "link": "http://dx.doi.org/10.3934/era.2022008"
    },
    {
        "id": 17552,
        "title": "Averting Mode Collapse for Generative Zero-Shot Learning",
        "authors": "Shayan Ramazi, Setare Shabani",
        "published": "2022-11-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccke57176.2022.9960072"
    },
    {
        "id": 17553,
        "title": "Zero-Shot Classification with Discriminative Semantic Representation Learning",
        "authors": "Meng Ye, Yuhong Guo",
        "published": "2017-7",
        "citations": 74,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2017.542"
    },
    {
        "id": 17554,
        "title": "Exploring Attribute Space with Word Embedding for Zero-shot Learning",
        "authors": "Zhaocheng Zhang, Gang Yang",
        "published": "2022-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn55064.2022.9892132"
    },
    {
        "id": 17555,
        "title": "Zero-Shot Learning via GANs and SAGANs: A Performance Analysis",
        "authors": "Muhammad Ahmed Mohsin",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/fit60620.2023.00017"
    },
    {
        "id": 17556,
        "title": "Entity Completion for Industrial Knowledge Graph Based on Zero-Shot Learning",
        "authors": "Yin Cai, Yuanyuan Li, Zhijun Fang, Jiacheng Xu, Anjie Wang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4450233"
    },
    {
        "id": 17557,
        "title": "Zero-Shot Learning and its Applications from Autonomous Vehicles to COVID-19 Diagnosis: A Review",
        "authors": "Mahdi Rezaei, Mahsa Shahidi",
        "published": "No Date",
        "citations": 1,
        "abstract": "The challenge of learning a new concept, object, or a new medical disease recognition without receiving any examples beforehand is called Zero-Shot Learning (ZSL). One of the major issues in deep learning-based methodologies such as in Medical Imaging, Autonomous Systems and other real-world applications is the requirement of feeding a large annotated and labelled datasets, prepared by an expert human to train the network model. ZSL is known for having minimal human intervention by mainly relying only on previously known concepts and current auxiliary information. This is ever-growing research for the cases where we have very limited or no datasets available and at the same time, the detection/recognition system has human-like characteristics in learning new concepts. Therefore, it makes it applicable in real-world scenarios, from developing autonomous vehicles to medical imaging and COVID-19 Chest X-Ray (CXR) based diagnosis. In this review paper, we present the definition of the problem, we review over fundamentals, and the challenging steps of Zero-Shot Learning, including state-of-the-art categories of solutions as well as our recommended solution, motivations behind each approach, and their advantages over each category to guide the researchers to proceed with the best techniques and practices based on their applications. Inspired from different settings and extensions, we introduce a novel and broaden solution called one/few-shot learning. We then review through different image datasets inducing medical and non-medical images, the variety of splits, and the evaluation protocols proposed so far. Finally, we discuss the recent applications and future directions of ZSL. We aim to convey a useful intuition through this paper towards the goal of handling complex computer vision learning tasks more similar to the way humans learn. We mainly focus on two applications in the current modern yet challenging era: copping with an early and fast diagnosis of COVID-19 cases in the 2020 pandemic, as well as helping to develop safer autonomous systems, such as self-driving cars and ambulances.",
        "link": "http://dx.doi.org/10.31219/osf.io/tbk3e"
    },
    {
        "id": 17558,
        "title": "Assembling hierarchies of action using sequencing and abstraction: studies and models of zero-shot learning",
        "authors": "Gwydion Williams, Stefano Palminteri, Patrick Haggard",
        "published": "No Date",
        "citations": 1,
        "abstract": "Although the hierarchical structure of human action is widely acknowledged, we do not fully understand how hierarchies of action are assembled. The standard view is that low-level actions are sequenced to establish higher-level routines of behaviour. Here we develop an alternative approach to building hierarchies, based on two insights. First, we consider relations between sequence elements. Second, we identify abstract features common to several such relations, and show how these abstract features allow for flexible action sequence learning. We combine sequencing and abstraction within a single model of hierarchical structure and test this model in two distinct versions of a novel experimental paradigm. We demonstrate that humans can learn entirely novel sequences of actions without practice, by generalising learned sequence structures from one context to another. Computational modelling showed that this ‘zero-shot learning’ of novel behaviours was successfully captured by a hierarchical organisation of the kind we propose.",
        "link": "http://dx.doi.org/10.31234/osf.io/gzjur"
    },
    {
        "id": 17559,
        "title": "Deep Representation of Hierarchical Semantic Attributes for Zero-shot Learning",
        "authors": "Zhaocheng Zhang, Gang Yang",
        "published": "2020-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9206924"
    },
    {
        "id": 17560,
        "title": "Semantic Autoencoder for Zero-Shot Learning",
        "authors": "Elyor Kodirov, Tao Xiang, Shaogang Gong",
        "published": "2017-7",
        "citations": 496,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2017.473"
    },
    {
        "id": 17561,
        "title": "Learning Graph Embeddings for Compositional Zero-shot Learning",
        "authors": "Muhammad Ferjad Naeem, Yongqin Xian, Federico Tombari, Zeynep Akata",
        "published": "2021-6",
        "citations": 55,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr46437.2021.00101"
    },
    {
        "id": 17562,
        "title": "Learning Attention as Disentangler for Compositional Zero-Shot Learning",
        "authors": "Shaozhe Hao, Kai Han, Kwan-Yee K. Wong",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01470"
    },
    {
        "id": 17563,
        "title": "Multi-dimensional alignment via Variational Autoencoders for Generalized Zero-Shot and Few-Shot Learning",
        "authors": "Jiyan Cai, Libing Wu, Dan Wu, Jianxin Li, Xianfeng Wu",
        "published": "2022-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/besc57393.2022.9995148"
    },
    {
        "id": 17564,
        "title": "Zero-Shot Learning Based on Mel-Frequency Mapping for Bearing Fault Diagnosis Under Variable Working Conditions",
        "authors": "yubin yue, Hongjun Wang, Shenglun Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4453406"
    },
    {
        "id": 17565,
        "title": "Autoencoder based novelty detection for generalized zero shot learning",
        "authors": "Supritam Bhattacharjee, Devraj Mandal, Soma Biswas",
        "published": "2019-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8803562"
    },
    {
        "id": 17566,
        "title": "Adaptive Confidence Smoothing for Generalized Zero-Shot Learning",
        "authors": "Yuval Atzmon, Gal Chechik",
        "published": "2019-6",
        "citations": 55,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2019.01194"
    },
    {
        "id": 17567,
        "title": "Automatic Check-Out within Generalized Zero-Shot Learning Setting: Help Classifier Learn More Easily",
        "authors": "Yue Han, Hao Chen, Zongyan Han, Zhenyong Fu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4505118"
    },
    {
        "id": 17568,
        "title": "Enhanced Zero shot Learning using Deep Neural Network ResNet50",
        "authors": "Ansari Shaista Khanam, Poonam. N. Sonar",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170025"
    },
    {
        "id": 17569,
        "title": "Synthetic Sample Selection for Generalized Zero-Shot Learning",
        "authors": "Shreyank N Gowda",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00011"
    },
    {
        "id": 17570,
        "title": "A Meta Learning-Based Approach for Zero-Shot Co-Training",
        "authors": "Guy Zaks, Gilad Katz",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2021.3116972"
    }
]