[
    {
        "id": 601,
        "title": "Improving Usual Naive Bayes Classifier Performances with Neural Naive Bayes based Models",
        "authors": "Elie Azeraf, Emmanuel Monfrini, Wojciech Pieczynski",
        "published": "2022",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010890400003122"
    },
    {
        "id": 602,
        "title": "Bayes’ Theorem and Naive Bayes Classifier",
        "authors": "Daniel Berrar",
        "published": "2019",
        "citations": 131,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809633-8.20473-1"
    },
    {
        "id": 603,
        "title": "Predicting Adults' Income using Naive Bayes Classifier",
        "authors": "Ahmed Abd Elrahman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPredicting the income level of adults is an important task in understanding the socio-economic dynamics and identifying key factors that contribute to income disparities. This paper proposes to build a predictive model to predict the income levels of adults using the Naive Bayes classifier. To commence the analysis, we preprocess the dataset by addressing missing values and encoding categorical variables, Subsequently, we train a Naive Bayes classifier on a labeled training set, with income levels as the target variable. To evaluate the performance of the Naive Bayes classifier, we employ standard evaluation metrics such as accuracy, precision, recall, and F1-score. Our experimental findings demonstrate the potential of the Naive Bayes classifier in predicting adults' income based on socio-demographic factors. Based on the findings of the experiments, the Naive Bayesian classifier has an accuracy equal to 80.83%.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3890646/v1"
    },
    {
        "id": 604,
        "title": "Comparison of Correlated Algorithm Accuracy Naive Bayes Classifier and Naive Bayes Classifier for Classification of heart failure",
        "authors": "Pungkas Subarkah, Wenti Risma Damayanti, Reza Aditya Permana",
        "published": "2022-8-31",
        "citations": 1,
        "abstract": "Heart failure (ARF) is a health problem that has relatively high mortality and morbidity rates in developed or developing countries, including Indonesia. In 2016, WHO stated that 17.5 million people died from cardiovascular disease, while in 2008, HF disease represented 31% of patient deaths worldwide. One of the new breakthroughs for early diagnosis is utilizing data mining techniques. In this study, the Correlated Naive Bayes Classifier (C-NBC) and Naive Bayes Classifier (NBC) algorithms are used to obtaining the best accuracy results so that they can be used for the Heart Failure dataset. Based on the results of the tests that have been carried out, it shows that the Correlated Naive Bayes Classifier (C-NBC) algorithm accuracy of 80.6% obtains higher accuracy than the Naive Bayes Classifier (NBC) algorithm of 67.5%. With the results of this study, the use of the Correlated Naive Bayes Classifier (C-NBC) algorithm can be used to diagnose patients with heart failure (heart failure) because it has a high level of accuracy and is categorized as Good Classification.",
        "link": "http://dx.doi.org/10.33096/ilkom.v14i2.1148.120-125"
    },
    {
        "id": 605,
        "title": "Sentiment Analysis using Naive Bayes and Complement Naive Bayes Classifier Algorithms on Hadoop Framework",
        "authors": "Berna Seref, Erkan Bostanci",
        "published": "2018-10",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ismsit.2018.8567243"
    },
    {
        "id": 606,
        "title": "Application of Naive Bayes Classifier for Information Extraction",
        "authors": "Nikhil Ranjan Nayak",
        "published": "No Date",
        "citations": 1,
        "abstract": "Information retrieval (IR) is the activity of obtaining information resources that are relevant to an information need from a collection of those resources. Searches can be based on full-text or other content-based indexing. Information retrieval is the science of searching for information in a document, searching for documents themselves, and also searching for the metadata that describes data, and for databases of texts, images or sounds.Automated information retrieval systems are used to reduce what has been called information overload. An IR system is a software system that provides access to books, journals and other documents; stores and manages those documents. Web Search Engines are the most visible IR applications.It is a classification technique based on Bayes’ Theorem with an assumption of independence among predictors. In simple terms, a Naive Bayes classifier assumes that the presence of a particular feature in a class is unrelated to the presence of any other feature.For example, a fruit may be considered to be an apple if it is red, round, and about 3 inches in diameter. Even if these features depend on each other or upon the existence of the other features, all of these properties independently contribute to the probability that this fruit is an apple and that is why it is known as ‘Naive’.Naive Bayes model is easy to build and particularly useful for very large data sets. Along with simplicity, Naive Bayes is known to outperform even highly sophisticated classification methods.",
        "link": "http://dx.doi.org/10.31219/osf.io/z7q2e"
    },
    {
        "id": 607,
        "title": "Komparasi Akurasi Metode Correlated Naive Bayes Classifier  dan Naive Bayes Classifier untuk Diagnosis Penyakit Diabetes",
        "authors": "Hairani Hairani, Gibran Satya Nugraha, Mokhammad Nurkholis Abdillah, Muhammad Innuddin",
        "published": "2018-9-13",
        "citations": 1,
        "abstract": "Penyakit diabetes merupakan salah satu penyakit paling banyak diderita oleh manusia seluruh dunia. Setiap tahun terjadi peningkatan kematian yang disebabkan oleh penyakit diabetes. Penyakit diabetes terjadi disebabkan oleh tubuh tidak menghasilkan insulin dalam jumlah yang cukup. Salah satu cara yang digunakan untuk mengurangi jumlah kematian yang disebabkan oleh penyakit diabetes adalah melakukan diagnosis secara dini. Salah satu teknik yang bisa digunakan adalah memanfaatkan teknik data mining. Untuk melakukan diagnosis penyakit diabetes dibutuhkan suatu metode yang memiliki akurasi terbaik. Pada penelitian ini melakukan komparasi metode Correlated-Naive Bayes Classifier dan Naive Bayes Classifier untuk mendapatkan akurasi terbaik sehingga dapat digunakan untuk diagnosis penyakit diabetes. Berdasarkan pengujian yang telah dilakukan menunjukkan bahwa metode Correlated Naive Bayes Classifier (CNBC) memperoleh akurasi terbaik dibandingkan dengan metode Naive Bayes Classifier (NBC) untuk Dataset Pima indian Diabetes. Tingkat akurasi metode Correlated Naive Bayes Classifier (CNBC) sebesar 67,15%, sedangkan metode Naive Bayes Classifier (NBC) sebesar 64,33%. Metode Correlated Naive Bayes Classifier (C-NBC) memiliki akurasi lebih tinggi dibandingkan metode Naïve Bayes Classifier (NBC) karena pada metode Correlated Naïve Bayes Classifier memperhitungkan nilai korelasi dari masing-masing atribut dataset terhadap Kelasnya. Dengan demikian penggunaan metode Correlated Naïve Bayes Classifier (C-NBC) dapat digunakan untuk melakukan diagnosis penyakit diabetes karena memiliki tingkat akurasi yang bagus dibandigkan metode Naive Bayes Classifier.",
        "link": "http://dx.doi.org/10.30743/infotekjar.v3i1.558"
    },
    {
        "id": 608,
        "title": "Understanding of the naive Bayes classifier in spam filtering",
        "authors": "Qijia Wei",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5038979"
    },
    {
        "id": 609,
        "title": "Naive Bayes Classifier as one way to filter spam mail",
        "authors": "O. O. Pidmohylʹnyy,  , O. M. Tkachenko, O. I. Holubenko, O. V. Drobyk",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31673/2412-9070.2019.065860"
    },
    {
        "id": 610,
        "title": "Sms Spam Classifier by Naive Bayes Classifier",
        "authors": "Pankaj Gupta, Ajay Sahu, Ashish Singh, Abhishek Awasthi, Rishu Singh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4386505"
    },
    {
        "id": 611,
        "title": "Naive Bayes Sınıflandırıcısı Kullanılarak YouTube Verileri Üzerinden Çok Dilli Duygu Analizi",
        "authors": "Önder ŞAHİNASLAN, Hüseyin DALYAN, Ender ŞAHİNASLAN",
        "published": "2022-4-30",
        "citations": 9,
        "abstract": "Bu çalışma, Naive Bayes sınıflandırma algoritması kullanılarak sosyal medya verileri üzerinden dünya dillerinde yapılan yorum ve paylaşımların anlaşılmasına katkıda bulunmayı amaçlamaktadır. Duygu analizi veya fikir madenciliği, doğal dil işleme konularının bir alt bölümünde yer alır ve sosyal medya üzerinde yer alan verilerin anlamlandırabilmesi sağlanır. Yapay zekâ ve makine öğrenmesi gibi konularla birlikte günümüzde son derece popüler bir alandır. Küresel bir köye dönüşen dünyada, insanlar sosyal medya araçları üzerinden görüş, düşünce ve o konu hakkında memnuniyet durumları gibi pek çok veriyi paylaşmaktadır. Anlamlandırılmayı bekleyen bu veriler üzerinden insanların duygu ve düşünceleri ortaya çıkartabilmek mümkündür. Son dönemlerde Türkçe dilinde bir takım duygu analizi çalışmalarının yapıldığı görülmektedir. Ancak dünyadaki farklı dil ve lehçelerde yapılan yorumlar üzerinden çok dilli duygu analiz çalışması sınırlıdır. Bu çalışmada, Türkçe, İngilizce, Almanca, Fransızca, Arapça, Rusça ve Korece gibi farklı dünya dillerinden YouTube yorum verileri kullanılmıştır. PHP ile elde edilen bu ham veriler üzerinden anlamsız veriler temizlenerek belirli bir kalitede veri seti elde edilmiştir. Bu yorum verilerini İngilizce'ye çevirmek için Google çeviri aracı API'sı kullanılmıştır. Duygular, PHP Niiknow kütüphanesi üzerinden Naive Bayes algoritması kullanılarak pozitif, negatif ve nötr olarak sınıflandırılır. WEKA ile yapılan veri analizinde doğru sınıflandırma oranı %65,56 olarak bulunmuştur. Bu çalışma, 15.082 veri seti ve Google Çeviri aracı tarafından desteklenen 108 dil sayısı ile sınırlıdır.",
        "link": "http://dx.doi.org/10.17671/gazibtd.999960"
    },
    {
        "id": 612,
        "title": "Exact Learning Augmented Naive Bayes Classifier",
        "authors": "Shouta Sugahara, Maomi Ueno",
        "published": "2021-12-20",
        "citations": 14,
        "abstract": "Earlier studies have shown that classification accuracies of Bayesian networks (BNs) obtained by maximizing the conditional log likelihood (CLL) of a class variable, given the feature variables, were higher than those obtained by maximizing the marginal likelihood (ML). However, differences between the performances of the two scores in the earlier studies may be attributed to the fact that they used approximate learning algorithms, not exact ones. This paper compares the classification accuracies of BNs with approximate learning using CLL to those with exact learning using ML. The results demonstrate that the classification accuracies of BNs obtained by maximizing the ML are higher than those obtained by maximizing the CLL for large data. However, the results also demonstrate that the classification accuracies of exact learning BNs using the ML are much worse than those of other methods when the sample size is small and the class variable has numerous parents. To resolve the problem, we propose an exact learning augmented naive Bayes classifier (ANB), which ensures a class variable with no parents. The proposed method is guaranteed to asymptotically estimate the identical class posterior to that of the exactly learned BN. Comparison experiments demonstrated the superior performance of the proposed method.",
        "link": "http://dx.doi.org/10.3390/e23121703"
    },
    {
        "id": 613,
        "title": "Sampling Audit Evidence Using a Naive Bayes Classifier",
        "authors": "Guang-Yih Sheu ---, Nai-Ru Liu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Taiwan’s auditors have suffered from processing excessive audit data, including drawing audit evidence. This study advances sampling techniques by integrating machine learning with sampling. This machine learning integration helps avoid sampling bias, keep randomness and variability, and target the risker samples. We first apply a Naive Bayes classifier to classify data into some classes. Next, a user-based, item-based, or hybrid approach is employed to draw audit evidence. The representativeness index is the primary metric for measuring the representativeness of audit evidence. The user-based approach denotes the selection of samples between two percentiles in a class as audit evidence. It may be equivalent to a combination of monetary and variable sampling methods. The item-based approach represents the choice of risky samples as audit evidence. It may be identical to a combination of non-statistical and monetary sampling methods. Auditors can hybridize those user-based and item-based approaches to balance representativeness and riskiness in selecting audit evidence. Three experiments show that sampling using machine learning integration has the benefits of drawing unbiased samples, handling complex patterns, correlations, and unstructured data, and improving efficiency in sampling big data. However, the limitations are the classification accuracy output by machine learning algorithms and the range of prior probabilities.",
        "link": "http://dx.doi.org/10.20944/preprints202403.1017.v1"
    },
    {
        "id": 614,
        "title": "An Implementation of Naive Bayes Classifier",
        "authors": "Feng-Jen Yang",
        "published": "2018-12",
        "citations": 92,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csci46756.2018.00065"
    },
    {
        "id": 615,
        "title": "A Novel Phishing Email Detection Algorithm based on Multinomial Naive Bayes Classifier and Natural Language Processing",
        "authors": "Omar Abdelaziz, Sahana Deb, Rania Hodhod, Lydia Ray",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010412600690073"
    },
    {
        "id": 616,
        "title": "A Naive Bayes Multi-class Weighted Classifier of Internet Packet flows over a MPLS Network",
        "authors": "",
        "published": "2022-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.55162/mcet.03.062"
    },
    {
        "id": 617,
        "title": "Multi-Event Naive Bayes Classifier for Activity Recognition in the UCAmI Cup",
        "authors": "Antonio Jiménez, Fernando Seco",
        "published": "2018-10-18",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/proceedings2191264"
    },
    {
        "id": 618,
        "title": "Comparative Study of Naive Bayes, Gaussian Naive Bayes Classifier and Decision Tree Algorithms for Prediction of Heart Diseases",
        "authors": "Sushma S A",
        "published": "2021-3-31",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.33228"
    },
    {
        "id": 619,
        "title": "Fake News Detection using Naive Bayes Classifier and Passive Aggressive Classifier",
        "authors": "Valdet Shabani, Abdullah Havolli, Arianit Maraj, Lorik Fetahu",
        "published": "2023-6-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/meco58584.2023.10155036"
    },
    {
        "id": 620,
        "title": "Safeguarding Job Seekers: Research Insights into Fake Job Detection with SGD Classifier and Naive Bayes",
        "authors": "DEVIKA S.Y, Dr. Ganesh D",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0761"
    },
    {
        "id": 621,
        "title": "Prediction of Tunnel Face Stability Using a Naive Bayes Classifier",
        "authors": " Li,  Li",
        "published": "2019-10-2",
        "citations": 6,
        "abstract": "This paper develops a convenient approach for facilitating the prediction of tunnel face stability in the framework of Bayesian theorem. First, a number of values of the features influencing the face-stability of tunnels are chosen according to the full factorial design. Secondly, the software OptumG2 is utilized to performed strength reduction analyses to obtain safety factors regarding tunnel face stability. Based on the simulated safety factors, the chosen samples are labeled as stable (Fs≥1) or unstable samples (Fs<1). Thirdly, the model parameters that characterize the distribution of the random variables are then estimated by maximizing the well-known likelihood function. After that, the probability density functions (PDF) of the features are identified, and a naive Bayes classifier is constructed with the prior probabilities of the stable and the unstable state. The so-called type І and type І І errors are estimated with stable and unstable samples, respectively. The model parameters are then calibrated with additional stable samples to obtain the second classifier. Finally, the two classifiers are evaluated using independent samples that have not been seen in the training dataset. The proposed method allows geotechnical engineers to predict the stability of tunnel faces with great efficiency. It is applicable for general cases of tunnels where the parameters are within the ranges bounded by the specified values.",
        "link": "http://dx.doi.org/10.3390/app9194139"
    },
    {
        "id": 622,
        "title": "KLASIFIKASI  RATING KEGIATAN KAMPUS DENGAN MENGGUNAKAN METODE NAIVE BAYES CLASSIFIER",
        "authors": "Guruh Ihda Alfi",
        "published": "2020-9-12",
        "citations": 0,
        "abstract": "Kegiatan adalah suatu aktivitas peristiwa atau kejadian pada umumnya tidak dilakukan secara terus menerus tetapi beberapa periode, Di Universitas Pembangunan Nasional “Veteran” Jawa Timur ada banyak kegiatan dari berbagai fakultas-fakultas yang ada. . Disetiap kegiatan mempunyai peserta baik dalam maupun dari luar Universitas, namun pihak di fakultas tidak memberikan klasifikasi pembeda manakah program studi yang memiliki banyak kegiatan dan memiliki jumlah peserta terbanyak. Berdasarkan penelitian ini dapat disimpulkan bahwa dengan penggunaan metode Naive Bayes pada kegiatan Mahasiswa dapat dibuat rating sebagai bahan untuk evaluasi kegiatan. Dengan adanya metode naive bayes dalam rating kegiatan Mahasiswa dapat mengetahui mana kegiatan yang baik, favorit, kurang baik, kurang menarik dengan tidak berpandangan pada satu aspek saja melainkan dengan beberapa aspek yang terkait",
        "link": "http://dx.doi.org/10.31090/narodroid.v6i1.1096"
    },
    {
        "id": 623,
        "title": "A Dependent Feature Weighting Filter for Naive Bayes Classifier",
        "authors": "Gieliz Chatip, Ferkan Yilmaz",
        "published": "2022-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu55565.2022.9864833"
    },
    {
        "id": 624,
        "title": "HoG based Naive Bayes classifier for glaucoma detection",
        "authors": "K Nirmala, N Venkateswaran, C Vinoth Kumar",
        "published": "2017-11",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tencon.2017.8228250"
    },
    {
        "id": 625,
        "title": "Fake news detection using naive Bayes classifier",
        "authors": "Mykhailo Granik, Volodymyr Mesyura",
        "published": "2017-5",
        "citations": 292,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ukrcon.2017.8100379"
    },
    {
        "id": 626,
        "title": "Replidec - Use naive Bayes classifier to identify virus lifecycle from metagenomics data",
        "authors": "Xue Peng, Jinlong Ru, Mohammadali Khan Mirzaei, Li Deng",
        "published": "No Date",
        "citations": 5,
        "abstract": "AbstractMotivationViruses are the most abundant biological entities on earth. The majority of these entities are bacterial viruses or phages which specifically infect bacteria. Phages can use different replication strategies to invade their hosts including lytic, lysogenic, chronic cycle and pseudolysogeny. While the determination of the replication strategy used by phages is important to explore the phage-bacteria relationships in different ecosystems there are not many tools that can predict this in metagenomic data. In addition, most of the tools available can only predict lytic and lysogenic cycles. To address this issue, we have developed a new software called Replidec to identify three most common phage replication cycles (virulent, temperate, chronic) in viral sequences.ResultsReplidec uses Naive Bayes classifier combined with alignment-based methods to improve the prediction accuracy in metagenomic data. We test Replidec on viral genomes with known replication cycle and simulated metagenomic sequences. Replidec perform relatively good both in isolated genomes (F1 score: 92.29% ± 0.81; mcc: 89.14% ± 1.22) and simulated metagenomic sequences(F1 score: 87.55% ± 2.12; mcc: 88.23% ± 2.55). Moreover, Replidec can also accurately predict the replication cycle in small viral fragments(∼3000bp). In conclusion, Replidec can achieve the best performance in simulated metagenomic data compared to most prediction softwares including BACPHLIP.",
        "link": "http://dx.doi.org/10.1101/2022.07.18.500415"
    },
    {
        "id": 627,
        "title": "PREDICTING THE NOVEL CORONAVIRUS USING THE NAIVE BAYES CLASSIFIER",
        "authors": "",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets33647"
    },
    {
        "id": 628,
        "title": "Comparative Analysis of Bayes Net Classifier, Naive Bayes Classifier and Combination of both Classifiers using WEKA",
        "authors": "Abhilasha Nakra,  , Manoj Duhan",
        "published": "2019-3-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5815/ijitcs.2019.03.04"
    },
    {
        "id": 629,
        "title": "Detecting Tourette’s Syndrome in Anatomical Regions of the Brain through MRI Analysis and Naive Bayes Classifier",
        "authors": "Murilo Costa De Barros, Kaue Duarte, Wang-Tso Lee, Chia-Jui Hsu, Marco Garcia De Carvalho",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011056800003209"
    },
    {
        "id": 630,
        "title": "Filtering Hoax Menggunakan  Naive Bayes Classifier",
        "authors": "Putri Dinda Utami, Risna Sari",
        "published": "2018-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32722/multinetics.vol4.no.1.2018.pp.57-61"
    },
    {
        "id": 631,
        "title": "Sistem Pakar Diagnosa Penyakit Pada Kucing Menggunakan Metode Naive Bayes Classifier",
        "authors": "Cerly Widiyawati, Mohammad Imron",
        "published": "2018-5-21",
        "citations": 1,
        "abstract": "Tujuan dari penelitian ini adalah membangun sebuah perangkat lunak untuk mendiagnosa penyakit pada kucing yang dilengkapi dengan solusi atau saran terhadap penyakit yang terindikasi, tujuan lain dari penelitian ini adalah untuk mengetahui kinerja metode naÃ¯ve bayes dengan mencari nilai akurasinya. Sistem pakar ini dibangun menggunakan metode naÃ¯ve bayes classifier sebagai pengambilan keputusannya. Sistem pakar ini dibuat menggunakan penerapan berbasis aturan (Rule-Based Reasoning), basis pengetahuan diperoleh dari dokter spesialis hewan dan literatur-literatur yang mendukung. Dataset yang digunakan terdiri dari 20 penyakit dan 73 gejala. Sistem pakar ini dirancang menggunakan bahasa pemrograman PHP. Hasil dari penelitian ini berupa nilai akurasi metode naÃ¯ve bayes classifier yaitu sebesar 85% dari 10 pasien, hasil ini diperoleh dengan uji coba perbandingan hasil hipotesis dokter hewan dengan perhitungan klasifikasi naÃ¯ve bayes classifier. Dengan hasil uji coba ini diperoleh tanggapan dari pakar bahwa sistem ini dapat membantu pekerjaannya untuk mendiagnosa penyakit kucing dengan cepat, dan untuk pemelihara hewan dapat menghemat waktu dan biaya, dari hasil UAT (User Acceptance Test) didapatkan 84 % dari 10 pemelihara kucing setuju bahwa menggunakan sistem pakar ini bermanfaat bagi mereka.",
        "link": "http://dx.doi.org/10.33633/tc.v17i2.1625"
    },
    {
        "id": 632,
        "title": "Naive Bayes classifier optimization for text classification on e-government using particle swarm optimization",
        "authors": "Kuncahyo Setyo Nugroho, Istiadi Istiadi, Fitri Marisa",
        "published": "2020-1-31",
        "citations": 3,
        "abstract": "One of the public e-government services is a web-based online complaints portal. Text of complaint needs to be classified so that it can be forwarded to the responsible office quickly and accurately. The standard classification approach commonly used is the Naive Bayes Classifier (NBC) and k-Nearest Neighbor (k-NN), which still classifies one label and needs to be optimized. This research aims to classify the complaint text of more than one label at the same time with NBC, which is optimized using Particle Swarm Optimization (PSO). The data source comes from the Sambat Online portal and is divided into 70 % as training data and 30 % as testing data to be classified into seven labels. NBC and k-NN algorithms are used as a comparison method to find out the performance of PSO optimization. The 10-fold cross-validation shows that NBC optimization using PSO achieves an accuracy of 87.44 % better than k-NN of 75 % and NBC of 64.38 %. The optimization model can be used to increase the effectiveness of services to e-government in society.",
        "link": "http://dx.doi.org/10.14710/jtsiskom.8.1.2020.21-26"
    },
    {
        "id": 633,
        "title": "Filtering Hoax Menggunakan  Naive Bayes Classifier",
        "authors": "Putri Dinda Utami, Risna Sari",
        "published": "2018-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32722/vol4.no1.2018.pp57-61"
    },
    {
        "id": 634,
        "title": "Data Mining using Naive Bayes classifier: an application in short news",
        "authors": "Thais Neubauer, Sarajane Peres",
        "published": "2017-5-17",
        "citations": 0,
        "abstract": "In the information age, a plethora of content is available on a wide range of subjects, requiring an organization capable of making that content more accessible and engaging. An interesting application of classification tasks was identified in the Index project, developed by the Amsterdam-based company The Next Web. To solve this classification task, the Naive Bayes (NB) technique was applied to classify short news in four topics. To evaluate the results produced by such a classifier, a series of tests using cross-validation were carried out. It was possible to conclude that the NB classifier had satisfactory performance, achieving about 70% of accuracy in the best cases. In this paper, we intend to present the context of the Index project and discuss the results obtained with the NB classifiers. Despite the good results, the project is still in progress, as it is necessary to test variations as classification techniques and text representation approaches.",
        "link": "http://dx.doi.org/10.5753/sbsi.2017.6096"
    },
    {
        "id": 635,
        "title": "Spam Detection using Naive Bayes Classifier",
        "authors": "Pooja ., Komal Kumar Bhatia",
        "published": "2018-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v6i7.934938"
    },
    {
        "id": 636,
        "title": "Feature Selection for Phishing Website by Using Naive Bayes Classifier",
        "authors": "Twana Mustafa, Murat Karabatak",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isdfs58141.2023.10131884"
    },
    {
        "id": 637,
        "title": "Sentimental Analysis using Naive Bayes Classifier",
        "authors": "Prabha PM Surya, B Subbulakshmi",
        "published": "2019-3",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vitecon.2019.8899618"
    },
    {
        "id": 638,
        "title": "Filtering Hoax Menggunakan  Naive Bayes Classifier",
        "authors": "Putri Dinda Utami, Risna Sari",
        "published": "2018-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32722/multinetics.v4i1.1179"
    },
    {
        "id": 639,
        "title": "Sentiment Analysis of Twitter Comments Using Naive Bayes Classifier",
        "authors": "Ziyao Zhang",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Social media has a significant role in how people express their emotions and elaborate on their opinions in today's culture. There are many new forms of social media, and Twitter is one of them. In this experiment, the sentiment of pre-processed Twitter comment data was examined using naive Bayes and logistic regression techniques. In order to categorise the emotional tendency of text for Twitter comments, a naive Bayesian classifier is created. In processing this material, the Naive Bayes and logistic regression models' benefits and drawbacks are compared and summarised. Naive Bayes can achieve good accuracy with binary emotion analysis. The accuracy of the naive Bayes model is 0.06 points higher than that of logic training under identical processing settings, and the recall rate is 0.05 points higher.",
        "link": "http://dx.doi.org/10.54254/2753-7064/10/20231338"
    },
    {
        "id": 640,
        "title": "Application of Trust in Recommender Systems—Utilizing Naive Bayes Classifier",
        "authors": "Korab Rrmoku, Besnik Selimi, Lule Ahmedi",
        "published": "2022-1-12",
        "citations": 17,
        "abstract": "Receiving a recommendation for a certain item or a place to visit is now a common experience. However, the issue of trustworthiness regarding the recommended items/places remains one of the main concerns. In this paper, we present an implementation of the Naive Bayes classifier, one of the most powerful classes of Machine Learning and Artificial Intelligence algorithms in existence, to improve the accuracy of the recommendation and raise the trustworthiness confidence of the users and items within a network. Our approach is proven as a feasible one, since it reached the prediction accuracy of 89%, with a confidence of approximately 0.89, when applied to an online dataset of a social network. Naive Bayes algorithms, in general, are widely used on recommender systems because they are fast and easy to implement. However, the requirement for predictors to be independent remains a challenge due to the fact that in real-life scenarios, the predictors are usually dependent. As such, in our approach we used a larger training dataset; hence, the response vector has a higher selection quantity, thus empowering a higher determining accuracy.",
        "link": "http://dx.doi.org/10.3390/computation10010006"
    },
    {
        "id": 641,
        "title": "Estimating a one-class naive Bayes text classifier",
        "authors": "Yihong Zhang, Adam Jatowt",
        "published": "2020-5-21",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/ida-194669"
    },
    {
        "id": 642,
        "title": "Data Mining: Document Classification using Naive Bayes Classifier",
        "authors": "Ekta Jadon, Roopesh Sharma",
        "published": "2017-6-15",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2017913925"
    },
    {
        "id": 643,
        "title": "Spam Detection using Naive Bayes Classifier",
        "authors": "Pooja ., Komal Kumar Bhatia",
        "published": "2018-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v6i7.712716"
    },
    {
        "id": 644,
        "title": "Detection of fake news using Naive Bayes and Passive Aggressive Classifier",
        "authors": "",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets40659"
    },
    {
        "id": 645,
        "title": "Text Classification for Student Data Set using Naive Bayes Classifier and KNN Classifier",
        "authors": "Rajeswari R.P, Kavitha Juliet, Arad hana",
        "published": "2017-1-25",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22312803/ijctt-v43p103"
    },
    {
        "id": 646,
        "title": "Perbaikan Algoritma Naive Bayes Classifier Menggunakan Teknik Laplacian Correction",
        "authors": "Muhammad Rizki, Muhammad Arhami, Huzeni Huzeni",
        "published": "2021-4-22",
        "citations": 0,
        "abstract": "Naïve Bayes Classifier is one of the classification algorithms in Data Mining with a good processing speed and a fairly high level of accuracy. In the classification process the Naïve Bayes Classifier adopts the Bayesian theorem to map a data against a class by taking into account the probability of the attribute data, but because the Naïve Bayes Classifier makes probability the basis for its calculations, it is certainly very risk if it is wrong. If one class that is contained in the attribute has a value of 0, this will reduce the level of accuracy of the classification process carried out by the Naïve Bayes Classifier algorithm itself, therefore in this study the Laplacian Correction technique is used as an alternative to fix the problems that are owned by the Naïve Bayes Classifier Algorithm. The result of this research is that the Laplace Correction technique has succeeded in improving the performance of the Naïve Bayes Classifier by fixing the 0 value for each attribute. The level of accuracy that is owned by the Naïve Bayes Classifier after experiencing improvements with the Laplacian correction technique is 94.44%.",
        "link": "http://dx.doi.org/10.30811/teknologi.v21i1.2209"
    },
    {
        "id": 647,
        "title": "Laplace Naive Bayes classifier in the classification of text in machine learning",
        "authors": "Neli Kalcheva, Nedyalko Nikolov",
        "published": "2020-9-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bia50171.2020.9244491"
    },
    {
        "id": 648,
        "title": "Implementasi Data Mining Menggunakan Algoritme Naive Bayes Classifier dan C4.5 untuk Memprediksi Kelulusan Mahasiswa",
        "authors": "",
        "published": "2020-2-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.35671/telematika.v13i1.881"
    },
    {
        "id": 649,
        "title": "Mining Social Media Data of Philippine Higher Education Institutions Using Naive Bayes Classifier Algorithm",
        "authors": "Joey Aviles, Rosanna Esquivel",
        "published": "No Date",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3379025"
    },
    {
        "id": 650,
        "title": "Application of the Naive Bayes Classifier Method and Fuzzy Analytical Hierarchy Process in Determining Books Eligible for Publishing",
        "authors": "Mochamad Denny Irwansyah, Teguh Puja Negara, Erniyati Erniyati, Puspa Citra",
        "published": "2024-1-29",
        "citations": 1,
        "abstract": "The manuscript selection process is the process of assessing manuscripts worthy of publication. The Editor's job is to provide an evaluation of each manuscript based on the assessment criteria and sub-criteria. By using a decision support system, it can make it easier for policymakers to determine the suitability of a manuscript. In this research, a decision support system is applied to select papers that are worthy of publication, namely the Fuzzy Analytical Hierarchy Process (F-AHP) method for selecting the suitability of manuscripts using subjective criteria and the Naïve Bayes method for classifying books based on their genre. The test results using the F-AHP method produced an accuracy rate of 83.33% using 30 books out of 150 books and using the Naïve Bayes method produced an accuracy rate of 80% using 30 books from the internet. This system uses the Visual Studi Code IDE, Firebase, and Pythonanywhere as its database with an Android display.",
        "link": "http://dx.doi.org/10.33751/komputasi.v21i1.6677"
    },
    {
        "id": 651,
        "title": "KLASIFIKASI ASPIRASI MAHASISWA DENGAN NAIVE BAYES CLASSIFIER",
        "authors": "Ifan Rizqa",
        "published": "2021-3-3",
        "citations": 0,
        "abstract": "<em>Aspirasi mahasiswa adalah berbagai tuntunan dari mahasiswa yang dikemas dalam ide kreatif  untuk mengusulkan proses perubahan atas suatu hal. Rata-rata aspirasi yang disampaikan berupa keluhan dan harapan. Aspirasi berguna sebagai bahan evaluasi dan deteksi dini terhadap kelemahan sistem kualitas perguruan tinggi menjadi lebih baik. kegiatan ini terjadi di UDINUS, DPM sebagai pihak yang mengelola aspirasi mahasiswa. Aspirasi didapatkan melalui sebuah mekanisme yang telah ditentukan seperti penyebaran kuisioner secara manual atau berbasis google form.  Kuisioner yang disediakan mengharuskan mahasiswa mengisi isi aspirasi sesuai katagori yang disediakan. Namun, permasalahan yang dihadapi terkadang mahasiswa salah memilih katagori sesuai isi aspirasi yang ditulis. Maka dari itu perlu dibuat sistem yang dapat mengkatagorisasikan aspirasi mahasiswa secara otomatis. Klasifikasi teks dokumen menjadi cara yang paling baik untuk menentukan katagori berdasarkan isi aspirasi mahasiswa. Metode Naïve Bayes Classifier digunakan karena mampu menghasilkan akurasi yang tinggi. Dengan 1000 dokumen data latih yang masing-masing 250 dokumen setiap katagori yaitu “Sarana dan Prasarana”, “Dosen”, “Kepegawaian dan Sistem Akademik”,”Saran dan Masukan” menghasilkan akurasi 90.20%. Dapat dikatakan metode ini layak implementasi dalam penelitian ini.      </em>",
        "link": "http://dx.doi.org/10.22303/csrid.11.1.2019.01-09"
    },
    {
        "id": 652,
        "title": "An Obstacle Avoidance Approach Based on Naive Bayes Classifier",
        "authors": "Peiqiao Shang, Wenqian Li",
        "published": "2020-9-8",
        "citations": 0,
        "abstract": "<p>Obstacle avoidance plays an important role in mobile robot. However, the traditional methods of obstacle avoidance have difficulty in distinguishing multiple obstacles by edge detection. In this paper, the traditional obstacle avoidance methods are improved to realize the function of multi-obstacle avoidance. Regarding the implementation process, the LiDAR is used instead of the camera, which reduces the difficulty of handling image noise and achieves reliable obstacle detection. It can accurately detect the borders of the nearest obstacle even in complex environments and perform obstacle avoidance. Regarding the obstacle avoidance prediction, the model training is performed through the Naive Bayes classifier based on the three attributes of the velocity of the robot, the left boundary of the obstacle and the right boundary of the obstacle. In the training process, dataset was expanded to enhance the accuracy of classifier model. When the robot goes forward, the improved method enables the robot to move at a higher velocity. The results show the feasibility of advanced obstacle avoidance method by simulation.</p>",
        "link": "http://dx.doi.org/10.32629/jai.v3i1.139"
    },
    {
        "id": 653,
        "title": "Penerapan Metode Naive Bayes Classifier (Nbc) Untuk Klasifikasi Kondisi Internal Program Studi",
        "authors": "Indhitya Padiku",
        "published": "2021-7-9",
        "citations": 0,
        "abstract": "The low interest of prospective students in study programs at universities could be influenced by internal factors within the study program. These factors become the main variables in assessing the condition of the study program. For this reason, it is necessary to classify the internal conditions of the study program. A good method is needed in terms of accuracy and minimal misclassification to obtain the final classification results of the assessment. The purpose of this research is to classify the internal conditions of the study program. Classification of the internal conditions of the study program was carried out using the Naive Bayes Classifier (NBC) method which is a simple form of Bayesian Network with the assumption that all features are independent of each other. The NBC method shows an overall superior performance in terms of accuracy and misclassification rate. The NBC method can be used to determine the internal conditions of the study program, which could help identify factors that need to be addressed to increase the interest of prospective students enrolling in the study program.",
        "link": "http://dx.doi.org/10.37031/jt.v19i1.118"
    },
    {
        "id": 654,
        "title": "Extracting Potential Innovators Using Innovator Scores and Naive Bayes Classifier",
        "authors": "Ryo Iwata, Kaoru Kuramoto, Satoshi Kumagai",
        "published": "2021-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gcce53005.2021.9621839"
    },
    {
        "id": 655,
        "title": "Analysis of diabetic retinopathy using naive  bayes classifier technique",
        "authors": "V Sudha, C Karthikeyan",
        "published": "2018-4-20",
        "citations": 3,
        "abstract": "The vital issues of diabetes are Diabetic retinopathy (DR) and Retinal Vascular Disease which leads to the blindness. The DR disease may be detected by the early regular screening. and the automatic detection of this disease is a great solution and which is more reliable to identify the normality level in Fundus images (FI). The FI contains the texture discrimination capacity to differentiate the healthy images. The Data mining technique are used for identifying the retinal features of DR disease. The Data mining technique contains two stages. In first stage the features of DR disease extract from the Retinal Images (RI). The highlights for DR disease determination incorporate blood vessels, optic nerve, neural tissue, neuroretinal edge, optic plate size, thickness and change and which are removed by applying Data mining strategy. The result of the different information mining arrangement systems was looked at utilizing quick excavator apparatus. Gullible bayes and Support Vector Machine classifiers are utilized to anticipate the early discovery of eye disease diabetic retinopathy and observed that Naive bayes technique to be enhance the exactness of 89% precise.  ",
        "link": "http://dx.doi.org/10.14419/ijet.v7i2.21.12462"
    },
    {
        "id": 656,
        "title": "Analisis Sentimen Terhadap Universitas Gunadarma Berdasarkan Opini Pengguna Twitter Menggunakan Metode Naive Bayes Classifier",
        "authors": "",
        "published": "2020-12-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32409/jikstik.19.4.354"
    },
    {
        "id": 657,
        "title": "ANALISIS SENTIMEN TOKO ONLINE MENGGUNAKAN ALGORITMA NAIVE BAYES CLASSIFIER",
        "authors": "Mukti Qamal",
        "published": "2021-11-1",
        "citations": 0,
        "abstract": "Belanja online merupakan salah satu kebiasaan masyarakat untuk mendapatkan barang atau jasa secara cepat dan mudah. Salah satu situs online yang paling banyak dikunjungi ialah Shopee yang mempunyai banyak fitur dan dapat digunakan oleh penggunanya untuk memberi ulasan (review) seperti memberikan bintang terhadap suatu produk atau juga dapat memberikan komentar terhadap suatu produk. Banyaknya komentar yang terdapat pada ulasan produk shopee membutuhkan pengklasifikasian untuk mengelompokkan suatu komentar termasuk sentimen positif atau sentimen negatif. Naive Bayes Classificier merupakan suatu algoritma yang dapat digunakan untuk mengklasifikasikan komentar – komentar tersebut, sehingga suatu produk dapat dinilai berdasarkan review sentimen positif. Pada penelitian ini digunakan 1000 data training, dimana 500 merupakan data training untuk sentimen positif dan 500 data training untuk sentimen negatif. Data uji dilakukan pada beberapa toko pakaian dengan mengambil 10 produk dan 10 komentar perproduknya, sehingga untuk data uji digunakan 100 data untuk sekali pengujian. Penelitian ini dapat di uji pada berbagai macam jenis toko pakaian, seperti toko pakaian wanita, toko pakaian pria dan toko pakaian anak –anak. Persentase sentimen positif yang paling tinggi diperoleh oleh toko pakaian anak – anak dari 100 komentar menghasilkan 90% sentimen positif. Persentase keakurasian pada toko online dengan algoritma naive bayes adalah 87 % akurat.Kata kunci : e-commerce, review, analisis, naive bayes",
        "link": "http://dx.doi.org/10.29103/tts.v2i3.6771"
    },
    {
        "id": 658,
        "title": "Classification of Graduate Profiles Based on Graduate Tracer Study  Using Algorithm Naive Bayes Classifier",
        "authors": "Junus Sinuraya,  Friendly",
        "published": "2020-10-1",
        "citations": 0,
        "abstract": "The graduate profile is the role of the graduate of the study program or field of expertise / field of work planned after completing education from the study program. The determination of the profile of study program graduates is generally carried out based on the results of the assessment of stakeholder needs. Based on data from the Ministry of Research, Technology and Higher Education, the IT study program is one of the most majors or study programs in Indonesian universities and the highest number of enthusiasts choose this study program each year. Each year, graduates of IT study programs have a large number of graduates, both vocational and non- vocational colleges. The number of IT graduates is large but they have low graduate competencies, even they do not have competencies in the IT field so that their work is not in accordance with the graduate profile that has been designed. Therefore, it is necessary to conduct research to classify the profile of graduates who have worked based on tracer study data using the Naïve Bayes Classifier method. This study uses attributes, namely study program, value criteria, gender and field of work and the labels used are status (Linear and Non-Linear). The results of the study on the classification of the profile of graduates using the Naïve Bayes Classfier method show that alumni work not according to the profile of graduates by 73% and according to the profile of graduates by 23%, with a data accuracy rate of 87% and are included in the good classification category.",
        "link": "http://dx.doi.org/10.55445/jt.v7i02.17"
    },
    {
        "id": 659,
        "title": "SISTEM REKOMENDASI PENERIMAAN MAHASISWA BARU MENGGUNAKAN NAIVE BAYES CLASSIFIER DI INSTITUT PENDIDIKAN INDONESIA",
        "authors": "Andri Suryadi, Erwin Harahap",
        "published": "2018-9-28",
        "citations": 3,
        "abstract": "The quality of a university in creating qualified graduates is determined by the prospective students who enter the college. One of the things that can determine the quality is how the selection process of candidates for good student acceptance. However, the selection process of admissions in every college of course is different. Often the input of prospective students who enter the university is not in accordance with the expected so that the impact of graduate results. Therefore it is necessary for a system that can support the decision in the selection of new student candidates in order to get a good student input. This research builds a Recommendation System that will assist in the selection process of universities for the selection team of new student candidates. This recommendation system uses the naïve Bayes classifier method where the test scores of incoming selection of students who have been accepted will be used as training data and then classified based on the value of ipk that has been obtained. The value of the ipk will be a benchmark for the formation of classes - classes that are recommendations to the selection team. The classes that are formed are classes whose ipk value is at the accepted point and the class whose ipk value is not accepted. Then given a new student data, if the prospective student enters the safe class then it will be recommended to be accepted but otherwise it will be recommended to be rejected",
        "link": "http://dx.doi.org/10.30736/jti.v3i2.231"
    },
    {
        "id": 660,
        "title": "Classification of Article Knowledge Field using Naive Bayes Classifier",
        "authors": "Aldy Rialdy Atmadja, Mohamad Irfan, Abdul Halim,  Sarbini",
        "published": "2020-9-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwt50448.2020.9243639"
    },
    {
        "id": 661,
        "title": "Detecting Background Dynamic Scenes using Naive Bayes Classifier Analysis Compared to CNN Analysis",
        "authors": "Asha Rani Borah",
        "published": "2023-9-20",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276062"
    },
    {
        "id": 662,
        "title": "A CAD Tool for Breast Cancer Prediction using Naive Bayes Classifier",
        "authors": "Tawseef Ayoub Shaikh, Rashid Ali",
        "published": "2020-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/esci48226.2020.9167568"
    },
    {
        "id": 663,
        "title": "The Naive Bayes Classifier",
        "authors": "Matthias Schonlau",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-33390-3_8"
    },
    {
        "id": 664,
        "title": "KLASIFIKASI DIABETES PADA WANITA MENGGUNAKAN METODE NAIVE BAYES CLASSIFIER",
        "authors": "Mohammad Faisal Fahrul, Wiwien Hadikurniawati",
        "published": "2022-3-1",
        "citations": 0,
        "abstract": "The report from Riskesdas shows that there is a 2x increase in diabetes every year in Indonesia. This is due to an increase in factors such as human population, age, obesity, irregular eating patterns and lack of physical activity. The increase in a factor that causes diabetes in Indonesia must be prevented. The first step in preventing diabetes is to detect the risk factors for diabetes that may occur. Influencing factors include behavioral factors and sociodemographic factors The increase in diabetes in a country is due to late identified factors. The number of factors that are collected in order to detect whether a person has diabetes or not requires a fairly large data processing system. The data used in this study are diabetes data obtained from the Pima Indian Diabetes Database with attributes of pregnant, glucose, diastolic, triceps, insulin, BMI, history of diabetes, age and 300 data output. The Naive Bayes Classifier method can be used to classify diabetes in women based on pregnant, glucose, diastolic, triceps, insulin, BMI, history of diabetes, age and output. The accuracy result of the Naive Bayes Classifier method in classifying diabetes in women is 84% ​​of 300 data which is divided into 2, namely 275 data as training data and 25 data as test data.",
        "link": "http://dx.doi.org/10.33884/jif.v10i01.4705"
    },
    {
        "id": 665,
        "title": "Analisis Sentimen Pindah Ibu Kota Berbasis Naive Bayes Classifier",
        "authors": "Primandani Arsi, Bagus Adhi Kusuma, Azizan Nurhakim",
        "published": "2021-6-9",
        "citations": 0,
        "abstract": "Perkembangan media sosial memudahkan pengguna dalam percepatan akses informasi di internet. Akses informasi yang awalnya sulit diperoleh begitu mudah sekarang ini. Media sosial memungkinkan penggunanya tidak hanya mengonsumsi tapi juga berpartisipasi, membuat, mengomentari dan menyebarkan beragam konten dalam berbagai format. Banyak media sosial yang berkembang di internet, salah satu yang banyak digemari adalah Twitter. Twitter merupakan media sosial yang memungkinkan para penggunanya untuk berinteraksi secara personal ataupun terbuka. Melalu fitur hashtag para pengguna Twitter dapat mengetahui topik yang sedang dibahas secara real-time. Selain itu kata kunci pada Twitter dapat pula menjadi sumber perbincangan oleh pengguna. Salah satu topik yang ramai diperbincangkan di Twitter adalah terkait issue pemindahan ibu kota Indonesia. Namun dibalik hal tersebut terdapat kontroversi dari  pihak yang merasa  pro dan kontra, masing-masing memiiki sudut pandang sendiri.  Hal ini menyebabkan munculnya fenomena perdebatan khususnya di Twitter yang sebenarnya menunjukkan perhatian kolektif mengenai wacana publik. Kecenderungan pengguna Twitter dalam memposting konten dapat diketahui dengan cara analisa sentiment. Pada penelitian ini diusulkan metode Naive Bayes Classifier (NBC) untuk menganalisa sentimen terhadap wacana pemerintah di media massa online Twitter pada topik pemindahan ibukota Indonesia dengan cara mengklasifikasikan menjadi positif, dan negatif. Hasil penelitian ini menunjukkan bahwa nilai akurasi yang diperoleh sebesar 94,33%. Dengan dilakukannya analisa sentimen ini diharapkan dapat diketahui permasalahan yang terdapat pada kontroversi topik pemindahan ibukota, sehingga dapat dijadikan sebagai bahan evaluasi untuk kepentingan lebih lanjut.",
        "link": "http://dx.doi.org/10.26877/jiu.v7i1.7636"
    },
    {
        "id": 666,
        "title": "Klasifikasi Penderita ISPA Menggunakan Metode Naive Bayes Classifier",
        "authors": "May Siti Syarah, Masna Wati, Novianti Puspitasari",
        "published": "2022-3-30",
        "citations": 0,
        "abstract": "Information related to the classification of ARI disease suffered by the community in a public health is essential. This is because the public health is one of the community health centers that is a reference for treatment for the community. Public health must identify the right type of ARI disease so that treatment for ARI sufferers can be given optimally. This study classified the data of patients with ARI in a public health based on the determining factors, namely the disease suffered, age, and period of stay. Classification is carried out using the Naive Bayes Classifier method with the Confusion Matrix testing method. The results of applying the Naive Bayes Classifier method to patient data resulted in three types of ARI, namely mild, moderate and severe. The highest number of ARI patients is severe ARI. The results of the Confusion Matrix test that have been carried out prove that this method has an accuracy of 93.33% so it is suitable for use to classify ARI diseases.",
        "link": "http://dx.doi.org/10.37058/innovatics.v4i1.4427"
    },
    {
        "id": 667,
        "title": "Analisis Sentimen Mahasiswa Terkait Pembelajaran Tatap Muka Menggunakan Metode Naive Bayes Classifier",
        "authors": "Heri Santoso, Armansyah Armansyah, Dita Desliani",
        "published": "2022-8-23",
        "citations": 0,
        "abstract": "Pemerintah Indonesia melalui 4 kementerian yaitu Menteri Kesehatan, Menteri Dalam Negeri, Menteri Agama serta Menteri Pendidikan dan Kebudayaan, menerbitkan surat keputusan bersama mangenai Panduan Penyelenggaraan Pembelajaran Di Masa Pandemi Coronavirus Disease 2019. Berdasarkan SKB, pemerintah memfasilitasi pelaksanaan pembelajaran jarak jauh dan pembelajaran tatap muka terbatas disemua tingkatan pendidikan. Keputusan pemerintah tersebut ditanggapi beragam oleh masyarakat, termasuk mahasiswa  yang terlibat langsung dalam penerapan kebijakan ini. Banyak mahasiswa yang menyampaikan pendapat terkait kebijakan ini, baik pendapat positif ataupun negatif. Pada penelitian ini, dilakukan analisis sentimen yang bertujuan untuk mengetahui sentimen yang diberikan mahasiswa terkait penerapan pembelajaran tatap muka tahun ajaran 2021/2022 diperoleh melalui kuisioner (angket) serta menerapkan metode Nave Bayes Classifier. Menggunakan dataset sebanyak 5350 opini yang berasal dari 1070 responden. Berdasarkan proses analisis sentimen yang dilakukan, dapat disimpulkan bahwa mahasiswa/i dari Universitas Islam Negeri Sumatera Utara Medan mendukung penerapan pembelajaran tatap muka (PTM) dilingkungan UIN-SU Medan pada semester genap tahun ajaran 2021/2022. Akurasi yang dihasilkan oleh metode Nave Bayes Classifier saat melakukan klasifikasi sentimen (opini) dapat dikatakan baik, yaitu sebesar 84%. Setelah melakukan proses validasi sistem dengan menerapkan K-Fold Cross Validation, nilai K=10 ternyata metode Nave Bayes Classifier berhasil memperoleh akurasi yang baik, dengan rata – rata akurasinya sebesar 83%. Kata kunci:  analisis sentimen, nave bayes classifier, k-fold cross validation, pembelajaran tatap muka",
        "link": "http://dx.doi.org/10.33633/tc.v21i3.6262"
    },
    {
        "id": 668,
        "title": "Mixture of latent multinomial naive Bayes classifier",
        "authors": "Nima Shiri Harzevili, Sasan H. Alizadeh",
        "published": "2018-8",
        "citations": 41,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2018.04.020"
    },
    {
        "id": 669,
        "title": "An Improved Naive Bayes Classifier on Imbalanced Attributes",
        "authors": "S Geetha, R Maniyosai",
        "published": "2019-4",
        "citations": 2,
        "abstract": "Data plays a major and prominent role in this modern information era. Classification is a data mining task to discover the hidden information from large amounts of data stored in the repository. This process becomes extremely challenging in case of highly imbalanced dataset. Prediction from imbalanced attributes cannot be done accurately in the following case: During the training phase, the categorical variable is not observed but the test phase encounters the categorical variable and hence it assigns zero probability which leads to false prediction. To overcome this scenario, this article proposes a novel smoothing technique called optimized laplace smoothing estimation. This technique adds a bias value function to improve the accuracy of imbalanced attributes. For example, a child dataset has more attributes and the classification model is used to predict the child weight. Some of the attribute values may not be present in the child dataset due to which Naive Bayes assigns a zero for incomplete and an empty attribute. This leads to inaccurate prediction. In such cases, Naive Bayes can be further tuned by adding some new parameters as well as altering the existing optimization method. Experimental analysis shows that this novel smoothing technique enhances the classification accuracy by means of accurate predictions for imbalanced attributes.",
        "link": "http://dx.doi.org/10.4018/ijoci.2019040101"
    },
    {
        "id": 670,
        "title": "SMART : Stock Market Analyst Rating Technique Using Naive Bayes Classifier",
        "authors": "Yash Bhandare, Sumit Bharsawade, Dhurv Nayyar, Omkar Phadtare, Deipali Gore",
        "published": "2020-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet49848.2020.9154002"
    },
    {
        "id": 671,
        "title": "Detection System Milkfish Formalin Android-Based Method Based on Image Eye Using Naive Bayes Classifier",
        "authors": "Fadhil Muhammad Hadini",
        "published": "2017-3-21",
        "citations": 0,
        "abstract": "In this study was researcher trying to make an android-based application that can identify fish with formalin. The method used in researcher methods naïve Bayes classifier as a detector (detector) with the object input in the form of fish eye image. The steps in the study include the training and testing process. In the training process used to build the model naïve classifier and estimation parameters. While testing process, implement the results of the model and parameter estimation have been built to detect fish formalin or not formalin. The trial results demonstrate the ability-based applications using the naïve Bayes 98.3% for object dimensions 10x10 image",
        "link": "http://dx.doi.org/10.18860/mat.v9i1.4054"
    },
    {
        "id": 672,
        "title": "Penerapan Data Mining Menggunakan Metode Algoritma Naive Bayes Classifier untuk Mendukung Strategi Promosi",
        "authors": "Aulia Yahyah Sari, Encep Supriatna",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "The purpose of this study is to make it easier to find out the prediction results with the classification method from PPDB data for 2021-2022 to support promotion strategies at the Skye Foundation with the Naive Bayes Classifier Algorithm and to find out the level of accuracy in classification in determining promotion strategies. In this study the authors used 210 data as training data and 53 data as testing data for manual testing in excel and for testing using RapidMiner tools. Based on the results of the analysis in the research conducted, the results of predicting registration and non-registration quickly and accurately from tests carried out by comparing training data with data testing using RapidMiner tools obtained an accuracy rate of 92.45%.",
        "link": "http://dx.doi.org/10.32627/dimamu.v3i1.837"
    },
    {
        "id": 673,
        "title": "KLASIFIKASI KASUS COVID-19 MENGGUNAKAN MODEL NAIVE BAYES CLASSIFIER",
        "authors": "Ahmad Firdaus, Miftahul Walid, Anwari Anwari",
        "published": "2022-8-20",
        "citations": 0,
        "abstract": "Covid-19 dengan berbagai macam penanganannya membuat banyak pertentangan menyertainya. Untuk mengetahui apakah benar kasus pasien terkonfirmasi positif covid-19 tinggi atau rendah.  Dalam penelitian ini, model Naive Bayes Classifier memprediksi bahwa kasus covid-19 di Pamekasan tinggi (>= 30 orang) dan model Gaussian Naive Bayes menunjukkan kinerja yang sangat baik dengan nilai akurasi model sebesar 0,9688 serta nilai precision (0,97), recall (1,00) dan f-1 score (0,98). menunjukkan bahwa data yang menyatakan kasus covid-19 di Kabupaten Pamekasan termasuk tinggi dengan pengambilan data dalam rentang waktu Bulan Januari 2021 sampai dengan Desember 2021. Diharapkan untuk penelitian selanjutnya sistem dapat dikembangkan lagi karena data yang didapat saat ini masih terbatas",
        "link": "http://dx.doi.org/10.36040/jati.v6i2.5333"
    },
    {
        "id": 674,
        "title": "Feature selection for chemical compound extraction using wrapper approach with Naive Bayes classifier",
        "authors": "Basel Alshaikhdeeb, Kamsuriah Ahmad",
        "published": "2017-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceei.2017.8312421"
    },
    {
        "id": 675,
        "title": "An Automatic Text Summarization on Naive Bayes Classifier Using Latent Semantic Analysis",
        "authors": "Chintan Shah, Anjali Jivani",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-13-6347-4_16"
    },
    {
        "id": 676,
        "title": "A Literature Review on Hierarchical Naive Bayes Classifier",
        "authors": "Ronak Chavan",
        "published": "2019-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2019.4032"
    },
    {
        "id": 677,
        "title": "Prediksi Kelancaran Pembayaran Sewa Rusunawa Menggunakan Metode Naive Bayes Classifier",
        "authors": "Mangapul Siahaan, Balinda Oca Rosalia",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk memprediksikan kelancaran Pembayaran Sewa Rusunawa sehingga dapat mempermudah petugas administrasi dalam menganalisis calon penghuni yang mendaftar. Dalam penetapan calon penghuni perlu dilakukannya analisa dengan tujuan agar nanti dalam proses penghunian sewa mengurangi dampak tunggakan. Dengan memanfaatkan data hunian pada beberapa tahun belakang untuk memprediksikan kelancaran pembayaran sewa Rusunawa dengan menggunakan metode data mining. Metode naive bayes dimanfaatkan dalam memprediksi suatu kelancaran dari calon penghuni dengan menentukan peluang berdasarkan data hunian pada beberapa tahun belakang dan hasilnya dapat membantu dalam pengambilan suatu keputusan. Adapun data penghuni yang digunakan berupa pekerjaan, status pekerjaan, penghasilan, harga sewa dan tanggal pembayaran sewa. Berdasarkan pengujian dengan metode naive bayes tersebut maka diperoleh hasil accuracy sebesar 86.4%.",
        "link": "http://dx.doi.org/10.52643/jti.v8i2.2603"
    },
    {
        "id": 678,
        "title": "NAIVE BAYES CLASSIFIER FOR WORD SENSE DISAMBIGUATION OF PUNJABI LANGUAGE",
        "authors": "Varinder pal Singh, Parteek Kumar",
        "published": "2018-7-30",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22452/mjcs.vol31no3.2"
    },
    {
        "id": 679,
        "title": "Klasifikasi Gender Berdasarkan Fingerprint Menggunakan Metode Naive Bayes Classifier",
        "authors": "Cindhy Herumawan, Efi Anisa",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No two fingerprints are identical, as everyone has their own characteristics. The most fundamental problem lies in the results of the fingerprint image, typically due to inconsistencies in the emphasis of the fingerprint and the position of the fingerprint, resulting in inconsistencies in the thickness of the black line and shifting positions, which negatively impact the overall performance of the system. To solve this issue, research is required on a classifier that assumes all attributes exist independently. The NBC (Naïve Bayes Classifier) is a classifier based on the assumption that all attributes are independent. The NBC method for gender classification based on fingerprints consists of three steps. The initial step is to evaluate the quality of the image to be processed. This is demonstrated by the consistency of the grayscale values, which are not skewed when converted to a binary image. The second is the selection of data that exhibits no data deviation, which also leads to errors in the classification procedure that follows. With the existence of machine learning, class-based measurement formulations can be acquired through training. Even with unbalanced data, it is preferable to use NBC for classification purposes.",
        "link": "http://dx.doi.org/10.35814/asiimetrik.v5i1.3801"
    },
    {
        "id": 680,
        "title": "Empirical Copula based Naive Bayes Classifier",
        "authors": "Tanishi Srivastava, Dristi De, Prerna Sharma, Debarka Sengupta",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10083573"
    },
    {
        "id": 681,
        "title": "Improving the Naive Bayes Classifier via a Quick Variable Selection Method Using Maximum of Entropy",
        "authors": "Joaquín Abellán, Javier Castellano",
        "published": "2017-5-25",
        "citations": 30,
        "abstract": "Variable selection methods play an important role in the field of attribute mining. The Naive Bayes (NB) classifier is a very simple and popular classification method that yields good results in a short processing time. Hence, it is a very appropriate classifier for very large datasets. The method has a high dependence on the relationships between the variables. The Info-Gain (IG) measure, which is based on general entropy, can be used as a quick variable selection method. This measure ranks the importance of the attribute variables on a variable under study via the information obtained from a dataset. The main drawback is that it is always non-negative and it requires setting the information threshold to select the set of most important variables for each dataset. We introduce here a new quick variable selection method that generalizes the method based on the Info-Gain measure. It uses imprecise probabilities and the maximum entropy measure to select the most informative variables without setting a threshold. This new variable selection method, combined with the Naive Bayes classifier, improves the original method and provides a valuable tool for handling datasets with a very large number of features and a huge amount of data, where more complex methods are not computationally feasible.",
        "link": "http://dx.doi.org/10.3390/e19060247"
    },
    {
        "id": 682,
        "title": "Examination of Diabetes Mellitus for Early Forecast Using Decision Tree Classifier and an Innovative Dependent Feature Vector Based Naive Bayes Classifier",
        "authors": "Aluru Pradeepika, Sabitha R",
        "published": "2022-4-24",
        "citations": 3,
        "abstract": "The proposed study aims to evaluate the accuracy and precision in earlier diabetes mellitus detection using Decision Tree and Naive Bayes classification algorithm. Materials and methods: Naive Bayes classifier is applied on a Pima Indian diabetes dataset that consist of 769 records. A machine learning technique for earlier prediction of diabetes disease which compares Decision Tree and Naive Bayes classification algorithms has been proposed and developed. The sample size was measured as 27 per group. The accuracy and precision of the classifiers was evaluated and recorded. Results: The accuracy was maximum in predicting diabetes using Naive Bayesian classifier (76.46%) with minimum mean error when compared with Decision Tree Classifier (70.09%). There is a significant difference of 0.006 between the groups. Hence, Naive Bayes appears to be better than Decision Tree Classifier. Conclusion: The study proves that Naive Bayesian Classifier exhibits better accuracy than Decision Tree Classifier in predicting diabetes.",
        "link": "http://dx.doi.org/10.1149/10701.12937ecst"
    },
    {
        "id": 683,
        "title": "Automated Approach for DDOS Attacks Detection Based on Naive Bayes Multinomial Classifier",
        "authors": "Shital K. Ajagekar, Vaishali Jadhav",
        "published": "2018-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoei.2018.8553848"
    },
    {
        "id": 684,
        "title": "Naive Bayes Classifier on Twitter Sentiment Analysis BPJS of HEALTH",
        "authors": "Sepyan Purnama Kristanto, Junaedi Adi Prasetyo, Edwin Pramana",
        "published": "2019-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic2ie47452.2019.8940900"
    },
    {
        "id": 685,
        "title": "ANALISIS SENTIMEN MASYARAKAT TERHADAP PAYLATER MENGGUNAKAN METODE NAIVE BAYES CLASSIFIER",
        "authors": " Alfandi Safira, Firman Noor Hasan",
        "published": "2023-1-28",
        "citations": 0,
        "abstract": "Online shopping is so popular with the public because it is easy and convenient to do. The convenience of online shopping is supported by the payment method via paylater. However, paylater also results in bad behavior such as impulse buying. Various responses from the community made researchers conduct research to find out the public's view of paylater. In this study, researchers tried to do sentiment analysis using the Naive Bayes Classifier and TextBlob methods from the TetxBlob library with the Python programming language. From the dataset collected via Twitter, it produces 405 data. Sentiment analysis using the Naive Bayes Classifier method produces a negative sentiment of 70.62% or 286 data, positive sentiment is 22.72% or 92 data, neutral sentiment is 6.67% or 27 data. Meanwhile, using the TextBlob method also produced more negative sentiment, namely 55.8% or 226 data, positive sentiment collected 33.09% or 134 data, neutral sentiment amounted to 11.11% or 45 data. Thus, it can be concluded that the community feels unfavorable towards the use of paylater. In testing the model with the confussion matrix, it can be seen that the Naive Bayes Classifier algorithm is more accurate by 91% compared to TextBlob which is only 61%.",
        "link": "http://dx.doi.org/10.31849/zn.v5i1.12856"
    },
    {
        "id": 686,
        "title": "Prediksi Kelancaran Pembayaran Angsuran Pada Koperasi Dengan Metode Naive Bayes Classifier",
        "authors": " Suwati, Rolly Yesputra, Andy Sapta",
        "published": "2022-8-30",
        "citations": 0,
        "abstract": "This study aims to predict the smoothness of installment  payments in cooperatives, making it easier for staff to analyze credit lending. Lack of prudence in analyzing credit results in customers who are in arrears in paying installments, resulting in bad credit. To minimize errors that exist, it is necessary to evaluate the provision of loans to prospective debtors. By utilizing past member criteria data in the past that will be used to predict smooth payments using data mining. The data mining technique used is the Naive Bayes classifier method. The prediction process uses the naive Bayes method, namely by determining the probability or opportunity based on the previous member's data, and the results are used to help make a decision. The criteria used are member data: employment, income, house status, number of credits, and type of credit. Based on the naive Bayes method, the results obtained are 90.00% accuracy, 0.880% AUC, 83,33% recall, and 100% precision.",
        "link": "http://dx.doi.org/10.33022/ijcs.v11i2.3080"
    },
    {
        "id": 687,
        "title": "Sistem Pakar Diagnosis Masalah Kulit Yang Berbasis Web Dengan Metode Naive Bayes Classifier",
        "authors": "Caesar Iskandar Mawikere",
        "published": "2021-11-30",
        "citations": 0,
        "abstract": "As we all know, the world of technology and information has become very advanced in recent years. This has led to numerous new ideas that make it easier for a person or organization to do their work and achieve their goals. Progress in technology and information greatly affects all areas, from culture and education to the economy, health, and even beauty. So, in this study, the researcher brought up a problem at a beauty clinic in Maguwoharjo, DIY, called Emila Aesthetic Solution. The problem is that consulting with patients is still done face-to-face. In other words, the clinic does not have a computerized system to help with consultations so that patients do not have to wait in line and can get treatment right away based on the results of their consultation. As a result, this study focused on developing an expert system to diagnose skin problems using the naïve Bayes classifier method.In this study, the system was made using the naïve Bayes classifier and the waterfall model for system development. The model was then coded into the system to be used. The goal of making this expert system was to make it easier for patients to get advice and for the clinic to handle patients.Based on the patient history data obtained, namely 20 patient data that experts have tested, this expert system, by implementing the naïve Bayes classifier method, yielded results indicating that the system's accuracy was 100 percent.",
        "link": "http://dx.doi.org/10.47233/jsit.v1i2.115"
    },
    {
        "id": 688,
        "title": "Comparative analysis of SVM and Naive Bayes classifier for the SEMG signal classification",
        "authors": "Yogendra Narayan",
        "published": "2021",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.matpr.2020.09.093"
    },
    {
        "id": 689,
        "title": "Naive Bayes Classifier Optimization on Sentiment Analysis  of Hotel Reviews",
        "authors": "Siti Khomsah",
        "published": "2020-12-28",
        "citations": 0,
        "abstract": "<p class=\"JGI-AbstractIsi\">Feature extraction plays an important role in the sentiment analysis process, especially of text data. The Naive Bayes Classifier performs well on low feature dimensions. However, the accuracy provided is not optimal. To acquire  optimal machine learning model,  information gain method, evolutionary algorithm, and swarm intelligent algorithm are applied. The objective of this study is to determine the performance of the Particle Swarm Optimization (PSO) to optimize the Naive Bayes Classifier. Vectorization of words is carried out using TF-IDF. In order to produce high PSO performance, the PSO-NBC model is tested with several parameters, namely the number of particles (k = 3), setting of the number of iterations and inertia weight, individual intelligence coefficient (c1 = 1), and social intelligence coefficient (c2 = 2). Inert weight is calculated using the formulation (w = 0.5+ Rand ([- 1,1])). In conclusion, PSO is able to solve the problem space of text-based sentiment analysis. PSO is able to optimize the accuracy of Naive Bayes at a value of 89% to 91.76%. PSO performance is determined by the parameters used, especially the number of particles, the number of iterations, and the weight of inertia. A large number of particles accompanied by an increase in inertia weight can increase accuracy. The number of particles 20-30 has reached the optimal accuracy.</p>",
        "link": "http://dx.doi.org/10.17933/jppi.2020.100206"
    },
    {
        "id": 690,
        "title": "Optimalisasi Metode Naive Bayes Classifier Untuk Prediksi Persetujuan Kredit",
        "authors": "Achmad Syakur, Rendri Purwandi Putra, Christina Juliane",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Kredit adalah bentuk pembiayaan yang banyak orang ajukan ke bank atau perusahaan penyedia kredit. Dalam proses pengajuan kredit, dilakukan analisis untuk menentukan apakah kredit yang diajukan layak atau tidak. Penelitian ini bertujuan untuk membantu bank atau perusahaan penyedia kredit dalam melakukan persetujuan kredit dengan efektif dan akurat dalam menentukan status pengajuan. Penelitian ini menggunakan teknik data mining dan kumpulan dataset yang berasal dari kaggle.com. Terdapat 12 atribut dan 2 kelas yang digunakan dalam penelitian ini. Dalam penelitian ini, metode klasifikasi Naive Bayes dan optimasi kelompok partikel (PSO) digunakan. Prediksi persetujuan kredit dengan metode naïve bayes classifier menghasilkan nilai akurasi sebesar 80,00% dengan nilai AUC 0,884. Sebaliknya, prediksi persetujuan kredit dengan metode particle swarm optimization (PSO) menghasilkan nilai akurasi sebesar 96,67% dengan nilai AUC 0,69.",
        "link": "http://dx.doi.org/10.33022/ijcs.v13i1.3622"
    },
    {
        "id": 691,
        "title": "Comparative performance analysis of Naive Bayes and SVM classifier for oral X-ray images",
        "authors": "G. Karthick, R. Harikumar",
        "published": "2017-2",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecs.2017.8067843"
    },
    {
        "id": 692,
        "title": "Naive Bayes Classifier for Prediction of Volcanic Status in Indonesia",
        "authors": "Firman Tempola, Miftah Muhammad, Amal Khairan",
        "published": "2018-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitacee.2018.8576966"
    },
    {
        "id": 693,
        "title": "Prediction of conotoxin superfamilies by the Naive Bayes classifier",
        "authors": "Haiyan Huo, Lei Yang",
        "published": "2017-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cisp-bmei.2017.8302275"
    },
    {
        "id": 694,
        "title": "Auto Malicious Websites Classification Based on Naive Bayes Classifier",
        "authors": "Shuai Wang, Yashi Wang, Minhan Tang",
        "published": "2020-9-27",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciscae51034.2020.9236912"
    },
    {
        "id": 695,
        "title": "A multinomial technique for detecting fake news using the Naive Bayes Classifier",
        "authors": "Ashwini Yerlekar, Nirmal Mungale, Sampada Wazalwar",
        "published": "2021-11-26",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccica52458.2021.9697244"
    },
    {
        "id": 696,
        "title": "Text Mining Algorithm Naive Bayes Classifier to Improve Quality Sentiment Analysis Passport Mobile Application",
        "authors": "M. Alvi Syahrin,  Wilonotomo, Budy Mulyawan, M Ryanindityo, Feni Yuli Triana",
        "published": "No Date",
        "citations": 0,
        "abstract": "Mobile Passport is an application that can be used as a digital service for people in Indonesia to apply for a new passport and an official online passport replacement from the Directorate General of Immigration replacing APAPO (Online Passport Service Application). User reviews of the Mobile Passport application are the output of big data generated as a result of the Internet of Things. The problem formulation in this research is how the implementation of the Naive Bayes text mining classifier algorithm can analyze the reviews contained in the Mobile Passport application as well as the accuracy, precision and recall values. This research uses the KDD (Knowledge Discovery and database) method which consists of data selection, data preprocessing, transformation, data mining, and evaluation using the R Studio tool. The resulting knowledge and information from this process is used as a useful knowledge base in decision making. The Naive Bayes classifier algorithm method in this research is used because of its reliability in handling data quickly and accurate predictions based on class probabilities, thus enabling research to obtain consistent and reliable results.",
        "link": "http://dx.doi.org/10.31219/osf.io/syxrf"
    },
    {
        "id": 697,
        "title": "KLASIFIKASI SENTIMEN PADA TWITTER DENGAN NAIVE BAYES CLASSIFIER",
        "authors": "Sigit Suryono, Ema Utami, Emha Taufiq Luthfi",
        "published": "2018-5-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.28989/angkasa.v10i1.218"
    },
    {
        "id": 698,
        "title": "Naive Bayes Classifier Algorithm for Spam Detection of Email to Improve Accuracy and in Comparison with Decision Tree Algorithm",
        "authors": "",
        "published": "2022-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47750/pnr.2022.13.s04.006"
    },
    {
        "id": 699,
        "title": "Opinion Mining using Naive Bayes Classifier",
        "authors": " Vrinda,  Dr. Komal Kumar Bhatia,  ",
        "published": "2017-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17577/ijertv6is040031"
    },
    {
        "id": 700,
        "title": "Information Gain Berbasis Algoritma Naive Bayes Classifier Pada Pemodelan Prediksi Kelulusan",
        "authors": "Avira Budianita",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Salah satu permasalahan yang dihadapi institusi perguruan tinggi adalah tidak tepatnya waktu kelulusan mahasiswa. Setiap tahunnya, jumlah mahasiswa yang mendaftar tidak sebanding dengan jumlah lulusannya. Hal tersebut yang menjadi tugas program studi dalam memantau akademik mahasiswanya. Program studi perlu memiliki acuan untuk mengantisipasi mahasiswa yang berpotensi tidak lulus tepat waktu. Dewasa ini, banyak sekali metode untuk menyelesaikan berbagai permasalahan teknologi informasi salah satunya dengan data mining. Salah satu teknik dalam data mining yang dapat digunakan untuk memprediksi waktu kelulusan adalah klasifikasi dan salah satu algoritma klasifikasi adalah Naive Bayes Classifier (NBC). Penelitian ini menggunakan algoritma NBC dengan memanfaatkan seleksi fitur Information Gain dalam memprediksi waktu kelulusan mahasiswa. Tujuan dari pemanfaatan seleksi fitur sendiri adalah untuk mengurangi tingkat kompleksitas dan meningkatkan akurasi serta mampu mengetahui fitur-fitur apa saja yang paling berkontribusi terhadap tingkat akurasi. Hasil pengolahan dataset pada RapidMiner dengan menerapkan algoritma NBC dengan seleksi fitur Information Gain menunjukkan peningkatan akurasi dibandingkan dengan menggunakan standar NBC.",
        "link": "http://dx.doi.org/10.46772/intech.v5i1.1116"
    }
]