[
    {
        "id": 8305,
        "title": "Combination of Optical Phase Conjugation and Advanced Pruning Techniques to reduce the Computational Complexity of Neural Network-Based Equalisers",
        "authors": "Diego Argüello Ron",
        "published": "2023",
        "citations": 0,
        "abstract": "Combining midlink optical phase conjugation and different pruning techniques is proposed to develop low complexity complex-valued neural networks based equalisers in a PDM 28 Gbaud 64 QAM transmission over 400km of SSMF.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/cleo_si.2023.sm3i.6"
    },
    {
        "id": 8306,
        "title": "Retracted: Application of Intelligent Fuzzy Decision Tree Algorithm in English Teaching Model Improvement",
        "authors": "",
        "published": "2023-8-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9824174"
    },
    {
        "id": 8307,
        "title": "Retracted: Analysis and Simulation of Multimedia English Auxiliary Handle Based on Decision Tree Algorithm",
        "authors": "",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9873246"
    },
    {
        "id": 8308,
        "title": "A Tree Pruning Technique for Decoding Complexity Reduction of Polar Codes and PAC Codes",
        "authors": "Mohsen Moradi, Amir Mozammel",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcomm.2023.3255254"
    },
    {
        "id": 8309,
        "title": "Retracted: Decision Tree Algorithm-Based Model and Computer Simulation for Evaluating the Effectiveness of Physical Education in Universities",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9815483"
    },
    {
        "id": 8310,
        "title": "A Novel Pessimistic Decision Tree Pruning Approach for Classification",
        "authors": "Al Maruf Hassan, Abir Hossain Amee, Md Iftekhar Hossain, Sara Ferdous Khan, Dewan Md. Farid",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eict61409.2023.10427593"
    },
    {
        "id": 8311,
        "title": "PENINGKATAN AKURASI PREDIKSI PEMILIHAN PROGRAM STUDI CALON MAHASISWA BARU MELALUI OPTIMASI ALGORITMA DECISION TREE DENGAN TEKNIK PRUNING DAN ENSEMBLE",
        "authors": "Harminto Mulyo, Nadia Annisa Maori",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "ENHACING PREDICTION ACCURACY OF NEW STUDENT PROGRAM SELECTION THROUGH DECISION TREE ALGORITHM OPTIMIZATION WITH PRUNING TECHNIQUE AND ENSEMBLEIn the current era of reform and globalization, the complexity of choosing the right study program is increasing with the many choices available. One of the challenges faced by the Nahdlatul Ulama Islamic University (UNISNU) Jepara is the increase in students with non-active status which can have an impact on the reputation of the university. One of the factors that can influence is the inaccuracy of students in choosing a study program, so that they are reluctant to continue because they are not enthusiastic about continuing their studies. The solution provided is to predict the selection of the right study program for prospective new students by utilizing the Decision Tree algorithm which is optimized with pruning and ensemble techniques with Random Forest which can help overcome overfitting in the decision tree. The data used is UNISNU student data from 2013 to 2023 with a total of 15,289 records and 52 attributes. The results showed that the Decision Tree and Random Forest models provided the highest accuracy, namely 0.88 with a max_depth value of 20 and succeeded in overcoming the problem of overfitting the decision tree. This model can then be used as a recommendation in predicting the selection of study programs for prospective new students at UNISNU Jepara.Dalam era reformasi dan globalisasi saat ini, kompleksitas dalam memilih program studi yang sesuai semakin meningkat dengan banyaknya pilihan yang tersedia. Salah satu tantangan yang dihadapi oleh Universitas Islam Nahdlatul Ulama (UNISNU) Jepara adalah meningkatnya mahasiswa dengan status non-aktif yang dapat berdampak pada reputasi universitas. Salah satu faktor yang dapat mempengaruhi adalah ketidaktepatan mahasiswa dalam memilih program studi, sehingga enggan untuk meneruskan karena tidak bersemangat dalam melanjutkan perkuliahan. Solusi yang diberikan adalah dengan melakukan prediksi pemilihan program studi bagi yang tepat bagi calon mahasiswa baru dengan memanfaatkan algoritma Decision Tree yang dioptimalkan dengan teknik pruning dan ensemble dengan Random Forest yang dapat membantu mengatasi overfitting pada decision tree. Data yang digunakan adalah data mahasiswa UNISNU dari tahun 2013 sampai dengan 2023 dengan jumlah 15.289 record dan 52 atribut. Hasil penelitian menunjukkan model Decision Tree dan Random Forest memberikan akurasi tertinggi, yaitu 0.88 dengan nilai max_depth sebesar 20 dan berhasil mengatasi masalah overfitting pada decision tree. Model ini selanjutnya dapat menjadi rekomendasi dalam prediksi pemilihan program studi bagi calon mahasiswa baru di UNISNU Jepara.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34001/jdpt.v15i1.5585"
    },
    {
        "id": 8312,
        "title": "Secure Two-Party Decision Tree Classification Based on Function Secret Sharing",
        "authors": "Kun Liu, Chunming Tang",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Decision tree models are widely used for classification tasks in data mining. However, privacy becomes a significant concern when training data contain sensitive information from different parties. This paper proposes a novel framework for secure two-party decision tree classification that enables collaborative training and evaluation without leaking sensitive data. The critical techniques employed include homomorphic encryption, function secret sharing (FSS), and a custom secure comparison protocol. Homomorphic encryption allows computations on ciphertexts, enabling parties to evaluate an encrypted decision tree model jointly. FSS splits functions into secret shares to hide sensitive intermediate values. The comparison protocol leverages FSS to securely compare attribute values to node thresholds for tree traversal, reducing overhead through efficient cryptographic techniques. Our framework divides computation between two servers holding private data. A privacy-preserving protocol lets them jointly construct a decision tree classifier without revealing their respective inputs. The servers encrypt their data and exchange function secret shares to traverse the tree and obtain the classification result. Rigorous security proofs demonstrate that the protocol protects data confidentiality in a semihonest model. Experiments on benchmark datasets confirm that the approach achieves high accuracy with reasonable computation and communication costs. The techniques minimize accuracy loss and latency compared to prior protocols. Overall, the paper delivers an efficient, modular framework for practical two-party secure decision tree evaluation that advances the capability of privacy-preserving machine learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/5302915"
    },
    {
        "id": 8313,
        "title": "4D Trajectory Conflict Detection and Resolution Using Decision Tree Pruning Method",
        "authors": "Lucas Borges Monteiro, Vitor Filincowsky Ribeiro, Cristiano Perez Garcia, Geraldo Pereira Rocha Filho, Li Weigang",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tla.2023.10015220"
    },
    {
        "id": 8314,
        "title": "Decision tree post-pruning without loss of accuracy using the SAT-PP algorithm with an empirical evaluation on clinical data",
        "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
        "published": "2023-5",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.datak.2023.102173"
    },
    {
        "id": 8315,
        "title": "Accelerating Decision-Tree-Based Inference Through Adaptive Parallelization",
        "authors": "Jan Van Lunteren",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pact58117.2023.00023"
    },
    {
        "id": 8316,
        "title": "Lookahead Search-Based Low-Complexity Multi-Type Tree Pruning Method for Versatile Video Coding (VVC) Intra Coding",
        "authors": "Qi TENG, Guowei TENG, Xiang LI, Ran MA, Ping AN, Zhenglong YANG",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1587/transfun.2022eap1022"
    },
    {
        "id": 8317,
        "title": "Classification of Natural Disasters Using Decision Tree Techniques",
        "authors": "B Senthilnayaki, N. Saraswathi, V. Sathiyavathi, M. Shanmuga Priya, L. SaiRamesh",
        "published": "2023-8-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoac59537.2023.10249871"
    },
    {
        "id": 8318,
        "title": "Privacy-Preserving Decision-Tree Evaluation with Low Complexity for Communication",
        "authors": "Yidi Hao, Baodong Qin, Yitian Sun",
        "published": "2023-2-27",
        "citations": 3,
        "abstract": "Due to the rapid development of machine-learning technology, companies can build complex models to provide prediction or classification services for customers without resources. A large number of related solutions exist to protect the privacy of models and user data. However, these efforts require costly communication and are not resistant to quantum attacks. To solve this problem, we designed a new secure integer-comparison protocol based on fully homomorphic encryption and proposed a client-server classification protocol for decision-tree evaluation based on the secure integer-comparison protocol. Compared to existing work, our classification protocol has a relatively low communication cost and requires only one round of communication with the user to complete the classification task. Moreover, the protocol was built on a fully homomorphic-scheme-based lattice that is resistant to quantum attacks, as opposed to conventional schemes. Finally, we conducted an experimental analysis comparing our protocol with the traditional approach on three datasets. The experimental results showed that the communication cost of our scheme was 20% of the cost of the traditional scheme.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23052624"
    },
    {
        "id": 8319,
        "title": "Brain Stroke Prediction using Decision Tree Algorithm",
        "authors": "Viswanatha V, Ramachandra A C, Parameshachari B.D, Aditya Kumar Sharma",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10392706"
    },
    {
        "id": 8320,
        "title": "Performance assessment and fitness analysis of athletes using decision tree and data mining techniques",
        "authors": "Qiuqi Yu",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09527-5"
    },
    {
        "id": 8321,
        "title": "Pruning revisited – effect of pruning season on wood discoloration and occlusion in four temperate broadleaved tree species",
        "authors": "Anna Lund, Anna Levinsson, Johan Östberg, Björn Wiström",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "Abstract\nPruning is a necessary part of tree management both in silvicultural systems and in urban forestry. For the wood industry’s production of high-quality timber, as well as for the urban forest’s risk reduction and ecosystem services enhancements, it is essential that the pruning is accurately implemented. This study aimed to determine the effect of pruning season on discoloration amount and occlusion rate in four broadleaved tree species. In 2014, 84 trees were pruned in January, May and September. Six years later, the 252 samples from the three pruning points per tree were collected and analysed. ‘Common oak (Quercus robur L.)’ and ‘small-leaved lime (Tilia cordata Mill.)’ showed least discoloration when pruned in January, ‘wild cherry (Prunus avium L.)’ showed least discoloration when pruned in September and ‘Norway maple (Acer platanoides L.)’ did not show any significant differences. All species occluded fastest when pruned in January, but at different rates. Common oak occluded 84 per cent of the samples, Norway maple 42 per cent, small-leaved lime 32 per cent and wild cherry 13 per cent. In summary, the pruning month affected discoloration amounts and occlusion rates of the tested tree species in varied ways. Our research suggests an important knowledge gap regarding optimal species-specific pruning times and underlying reasons for different reactions to pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/forestry/cpac065"
    },
    {
        "id": 8322,
        "title": "Pruning as a production factor of the cacao tree (Theobroma cacao l.)",
        "authors": "Gabriel Cubillos",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Pruning is one of the main tasks that must be taken into account in the management of a cacao plantation. Its proper application stimulates production, facilitates the harvest of ripe fruits and the removal of fruits and organs diseased by Cacao frosty pod rot and Witches´ Broom. Essentially, pruning consists of removing suckers, branches that grow downwards and to the sides, intertwined branches, twigs that form inside the crown, and the tipping of upper branches to preserve the proper height of the trees.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15406/hij.2023.07.00277"
    },
    {
        "id": 8323,
        "title": "Navigation of Apple Tree Pruning Robot Based on Improved RRT-Connect Algorithm",
        "authors": "Yechen Li, Shaochun Ma",
        "published": "2023-7-27",
        "citations": 2,
        "abstract": "Pruning branches of apple trees is a labor-intensive task. Pruning robots can save manpower and reduce costs. A full map of the apple orchard with collision-free paths, which is navigation planning, is essential. To improve the navigation efficiency of the apple tree pruning robot, an improved RRT-Connect algorithm was proposed. Firstly, to address the disadvantage of randomness in the expansion of the RRT-Connect algorithm, a goal-biased strategy was introduced. Secondly, to shorten the path length, the mechanism of the nearest node selection was optimized. Finally, the path was optimized where path redundancy nodes were removed, and Bezier curves were used to deal with path sharp nodes to further reduce the path length and improve the path smoothness. The experimental results of apple orchard navigation show that the improved algorithm proposed in this paper can cover the whole apple orchard, and the path length is 32% shorter than that of the RRT-Connect algorithm. The overall navigation time is 35% shorter than that of the RRT-Connect algorithm. This shows that the improved algorithm has better adaptability and planning efficiency in the apple orchard environment. This will contribute to the automation of orchard operations and provide valuable references for future research on orchard path planning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agriculture13081495"
    },
    {
        "id": 8324,
        "title": "Skeleton extraction and pruning point identification of jujube tree for dormant pruning using space colonization algorithm",
        "authors": "Yuxing Fu, Yuyang Xia, Huiming Zhang, Meng Fu, Yong Wang, Wei Fu, Congju Shen",
        "published": "2023-1-19",
        "citations": 6,
        "abstract": "The dormant pruning of jujube is a labor-intensive and time-consuming activity in the production and management of jujube orchards, which mainly depends on manual operation. Automatic pruning using robots could be a better way to solve the shortage of skilled labor and improve efficiency. In order to realize automatic pruning of jujube trees, a method of pruning point identification based on skeleton information is presented. This study used an RGB-D camera to collect multi-view information on jujube trees and built a complete point cloud information model of jujube trees. The space colonization algorithm acts on the global point cloud to generate the skeleton of jujube trees. The iterative relationship between skeleton points was represented by constructing a directed graph. The proposed skeleton analysis algorithm marked the skeleton as the trunk, the primary branches, and the lateral branches and identified the pruning points under the guidance of pruning rules. Finally, the visual model of the pruned jujube tree was established through the skeleton information. The results showed that the registration errors of individual jujube trees were less than 0.91 cm, and the average registration error was 0.66 cm, which provided a favorable database for skeleton extraction. The skeleton structure extracted by the space colonization algorithm had a high degree of coincidence with jujube trees, and the identified pruning points were all located on the primary branches of jujube trees. The study provides a method to identify the pruning points of jujube trees and successfully verifies the validity of the pruning points, which can provide a reference for the location of the pruning points and visual research basis for automatic pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpls.2022.1103794"
    },
    {
        "id": 8325,
        "title": "A transportation scheduling management system using decision tree and iterated local search techniques",
        "authors": "Thittaporn Ganokratanaa, Mahasak Ketcham",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "This paper aimed to develop a delivery truck scheduling management system using a decision tree to support decision-making in selecting a delivery truck. First-in-first-out (FIFO) and decision tree techniques were applied to prioritize loading doors for delivery trucks with the use of iterated local search (ILS) in recommending the route for the transport of goods. Besides, an arrangement of loading doors can be assigned to the door that meets the specified conditions. The experimental results showed that the system was able to assign the job to a delivery truck under the specified conditions that were close to the actual operation at a similarity of 0.80. In addition, the application of ILS suggested the route of the food delivery truck in planning the most effective transportation route with the best total distance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i3.pp2899-2907"
    },
    {
        "id": 8326,
        "title": "Sequential Acid/Alkali Pretreatment for an Olive Tree Pruning Biorefinery",
        "authors": "Manuel J. Díaz, Pedro M. Ferrero, Manuel Moya",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "Olive tree pruning is an abundant and renewable lignocellulosic residue, which is generally burned in the fields, causing economic costs and environmental problems. This lignocellulosic residue can be considered a suitable raw material for the production of a wide range of byproducts in a biorefinery context due to its high content of potentially fermentable carbohydrates. To take advantage of its sugar content, pretreatment is necessary to enhance the accessibility of the enzymes to the cellulosic fraction. The aim of this work is to obtain sugars contained in olive tree pruning as a substrate for the production of bioethanol by fermentation. Specifically, the production of fermentable sugars by sequential pretreatment with sulfuric acid and sodium hydroxide is studied. A two-factor rotatable composite central design temperature and catalyst concentration (H2SO4 and NaOH) has been generated, and response surface methodology has been used to discuss and optimize the responses. This work shows that under optimal pretreatment conditions (130 °C, 1.90% w/v H2SO4 and 130 °C, 1.49% w/v NaOH) of 1 kg of olive tree pruning, a solution rich in sugars (102 g of glucose and 61 g of xylose) and a solid residue generating 99 g of glucose by enzymatic hydrolysis is obtained. Moreover, applying the combined severity to the acid pretreatment, it has been determined that 20% of the olive tree pruning is fast solubilization, and it was also found that the apparent activation energy of the acid hydrolysis reaction is 85.07 kJ/mol.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agronomy13112682"
    },
    {
        "id": 8327,
        "title": "Energy and Exergy Analysis of Palm Tree Pruning Residues Gasification",
        "authors": "Birol KAYİŞOĞLU, Gülizar DEMİRTAŞ",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Gasification is the process of obtaining syngas containing combustible gases such as H2, CO and small amounts of CH4 from biomass by performing partial combustion with a limited oxygen supply or with the help of suitable oxidants such as CO2 and water vapor. The efficiency of the gasification process is the most important parameter that determines the success of the system. In this study, the performance of the system in the gasification of palm pruning residues was evaluated by energy and exergy analysis methods. The gasification process was carried out at 7.6 Nm3/h and 10.2 Nm3/h air flow rates in the laboratory type fixed bed downdraft gasification unit manufactured in the Biosystems Engineering Department. The lower heating value of the syngas obtained as a result of gasification was found to be 4.09 MJ/Nm3 at 7.6 Nm3/h air flow rate and 3.76 MJ/Nm3 at 10.2 Nm3/h air flow rate. It has been observed that the lower heating value of the syngas is lower at high air flow rate. Energy efficiencies of the gasification system at 7.6 and 10.2 Nm3/h air flow rate were calculated as 47.6% and 52.8%, and exergy efficiencies were calculated as 43.7% and 48.1%, respectively. Exergy efficiencies were found to be lower than energy efficiencies in both air flow rates. However, as the air flow rate increased, the energy and exergy efficiencies also increased. The results obtained are similar to the results of previous studies on gasification of biomass.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15832/ankutbd.818623"
    },
    {
        "id": 8328,
        "title": "10618 Surgical Based Decision Tree Analysis Modelling to Predict AAGL Endometriosis Surgical Complexity Levels",
        "authors": "J Mak, A Eathorne, P McClenahan, A Gil, G Condous",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmig.2023.08.431"
    },
    {
        "id": 8329,
        "title": "Ultrasound Based Decision Tree Analysis Modelling to Predict AAGL Endometriosis Surgical Complexity Levels",
        "authors": "J Mak, A Eathorne, P McClenahan, A Gil, G Condous",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmig.2023.08.027"
    },
    {
        "id": 8330,
        "title": "Retracted: Optimal Pricing Decision of Fashion Apparel considering Experiential Service and Design Enhancement",
        "authors": " Complexity",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9857974"
    },
    {
        "id": 8331,
        "title": "Syllogism of Li-FePO4 Battery Cell Voltage Parameter Guess Under Aperiodic Dynamic Current Profile by Some Data-Driven Techniques: A Error-Based Statistical Comparison Between Decision Tree, Support Vector, Bee Colony, and Neural Network",
        "authors": "Taner ÇARKIT, Sümeyye ÇARKIT",
        "published": "2023-7-1",
        "citations": 1,
        "abstract": "The various procedures are used in the literature for defining battery parameter change such as direct measurement methods, model-based methods, and data-driven methods, which contain the algorithms used in this paper also. The main aim of this study is to present a powerful and highly correct way of parameter forecasting of the A123 Systems 26650 cylindrical type Li-FePO4 battery cell. A few of the goal of this paper is to show the guessing performance of the artificial bee colony algorithm, which has a very limited number of applications on the battery parameter of literature, under the non-periodic dynamic charge/ discharge current profile. Then, a comparison has been made between artificial bee colony, artificial neural networks, support vector machine, and decision tree algorithms used in the paper. The load-connected terminal voltage is defined by considering the 100%-60% state of charge range in the primary usage areas of the batteries. A statistical comparison has been made by considering the absolute errors, squared errors, and the regression values information regarding the results presented by the methods. Consequently, the regression values that give information about the consistency of the confidence interval and results, of the bee colony, neural network, support vector, and decision tree methods have been determined as 99.92%, 99.75%, 96.00% and 95.79%, respectively. Moreover, mean squared errors of the methods has been calculated as 0.00202%, 0.00648%, 0.00998%, and 0.11%, respectively. As a new generation algorithm, artificial bee colony, which gave the most successful results according to the results obtained in the study, has been compared with two different methods selected from the existing literature, eXtreme Gradient Boosting and Smoothed eXtreme Gradient Boosting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34248/bsengineering.1240513"
    },
    {
        "id": 8332,
        "title": "Classification Tree Pruning Under Covariate Shift",
        "authors": "Nicholas R. Galbraith, Samory Kpotufe",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tit.2023.3308914"
    },
    {
        "id": 8333,
        "title": "Random Forest Pruning Techniques: A Recent Review",
        "authors": "Youness Manzali, Mohamed Elfar",
        "published": "2023-5-19",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s43069-023-00223-6"
    },
    {
        "id": 8334,
        "title": "Prediction of gross calorific value from coal analysis using decision tree-based bagging and boosting techniques",
        "authors": "Tanveer Alam Munshi, Labiba Nusrat Jahan, M. Farhad Howladar, Mahamudul Hashan",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e23395"
    },
    {
        "id": 8335,
        "title": "Retracted: English Phrase Speech Recognition Based on Continuous Speech Recognition Algorithm and Word Tree Constraints",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9892303"
    },
    {
        "id": 8336,
        "title": "Decision-Making Techniques Based on q-Rung Orthopair Probabilistic Hesitant Fuzzy Information: Application in Supply Chain Financing",
        "authors": "Shahzaib Ashraf, Noor Rehman, Muhammad Naeem, Sumayya Gul, Bushra Batool, Shamsullah Zaland",
        "published": "2023-6-29",
        "citations": 1,
        "abstract": "The influence of COVID-19 on individuals, businesses, and corporations is indisputable. Many markets, particularly financial markets, have been severely shaken and have suffered significant losses. Significant issues have arisen in supply chain networks, particularly in terms of financing. The COVID-19 consequences had a significant effect on supply chain financing (SCF), which is responsible for finance supply chain components and improved supply chain performance. The primary source of supply chain financing is financial providers. Among financial providers, the banking sector is referred to as the primary source of financing. Any hiccup in the banking operational systems can have a massive influence on the financing process. In this study, we attempted to comprehend the key consequences of the COVID-19 epidemic and how to mitigate COVID-19’s impact on Pakistan’s banking industry. For this, three extended hybrid approaches which consists of TOPSIS, VIKOR, and Grey are established to address the uncertainty in supply chain finance under q-rung orthopair probabilistic hesitant fuzzy environment with unknown weight information of decision-making experts as well as the criteria. The study is split into three parts. First, the novel q-rung orthopair probabilistic hesitant fuzzy (qROPHF) entropy measure is established using generalized distance measure under qROPHF information to determine the unknown weights information of the attributes. The second part consists of three decision-making techniques (TOPSIS, VIKOR, and GRA) in the form of algorithm to tackle the uncertain information under qROPHF settings. Last part consists of a real-life case study of supply chain finance in Pakistan to analyze the effects of emergency situation of COVID-19 on Pakistani banks. Therefore, to help the government, we chose the best alternative form list of consider five alternatives (investment, government support, propositions and brands, channels, and digital and markets segments) by using proposed algorithm that minimize the effect of COVID-19 on supply chain finance of Pakistani banks. The results indicate that the proposed techniques are applicable and effective to cope with ambiguous data in decision-making challenges.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/3587316"
    },
    {
        "id": 8337,
        "title": "Path planning of apple tree pruning robot based on improved RRT algorithm",
        "authors": "Yechen Li, Shaochun Ma, Lingfeng Li, Chenyang Su, Zhengliang Ding",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13031/aim.202300262"
    },
    {
        "id": 8338,
        "title": "Predicting Life Expectancy using Machine Learning Approach through Linear Regression and Decision Tree Classification Techniques",
        "authors": "Kanwarpartap Singh Gill, Vatsala Anand, Rahul Chauhan, Manish Sharma",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10441837"
    },
    {
        "id": 8339,
        "title": "Cutting systems evaluation for a tree-pruning robot",
        "authors": "Giovanni Carabin, Stefan Leitner, Fabrizio Mazzetto, Renato Vidoni, Marco Bietresato",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/metroagrifor58484.2023.10424067"
    },
    {
        "id": 8340,
        "title": "Change Point Analysis to Detect the Effect of Pruning Severity on Tree Growth",
        "authors": "Yutaka Iguchi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ojf.2024.141004"
    },
    {
        "id": 8341,
        "title": "Forecasting Pesticide Use on Golf Courses by Integration of Deep Learning and Decision Tree Techniques",
        "authors": "Guillaume Grégoire, Josée Fortin, Isa Ebtehaj, Hossein Bonakdari",
        "published": "2023-5-30",
        "citations": 4,
        "abstract": "In the current study, a new hybrid machine learning (ML)-based model was developed by integrating a convolution neural network (CNN) with a random forest (RF) to forecast pesticide use on golf courses in Québec, Canada. Three main groups of independent variables were used to estimate pesticide use on golf courses, expressed as actual active ingredient rate (AAIR): (i) coordinates (i.e., longitude and latitude of the golf course), (ii) characteristics of the golf courses (i.e., pesticide type and the number of holes), and (iii) meteorological variables (i.e., total precipitation, P, and average temperature, T). The meteorological variables were collected from the Google Earth Engine by developing a JavaScript-based Code. On the basis of the different periods of total precipitation and average temperature, four different scenarios were defined. A data bank with more than 40,000 samples was used to calibrate and validate the developed model such that 70% of all samples were randomly selected to calibrate the model, while the remainder of the samples (i.e., 30%) that did not have any role in calibration were employed to validate the model’s generalizability. A comparison of different scenarios indicated that the model that considered the longitude and latitude of the golf course, pesticide type, and the number of holes in golf courses as well as total precipitation and average temperature from May to November as inputs (R = 0.997; NSE = 0.997; RMSE = 0.046; MAE = 0.026; NRMSE = 0.454; and PBIAS (%) = −0.443) outperformed the other models. Moreover, the sensitivity analysis result indicated that the total precipitation was the most critical variable in AAIR forecasting, while the average temperature, pesticide types, and the number of holes were ranked second to fourth, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agriculture13061163"
    },
    {
        "id": 8342,
        "title": "Research on pruning optimization techniques for neural networks",
        "authors": "Jiajun Wang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Large deep neural networks have been deploying in more and more application scenarios due to their success in multiple application scenarios. However, deep neural networks are difficult to apply to devices with fewer resources, as the large models and huge demand for computing resources make this difficult. Pruning optimization, as a critical model compression method, has become an essential part of the deployment process of deep neural networks and has extreme significance. This article summarizes the methods of deep neural network pruning optimization technology, sorts out the current research status of pruning optimization technology, analyzes different fine-grained pruning optimization technologies based on the different fine-grained levels of pruning optimization technology, and comparing the characteristics of different fine-grained pruning optimization techniques. This article also introduces the development process and current development direction of different fine-grained pruning optimization technologies, compares the effectiveness differences between different fine-grained pruning optimization technologies and looks forward to the combination of pruning optimization technology and model quantification technology. The end of the paper summarizes pruning optimization techniques and provides prospects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/19/20231025"
    },
    {
        "id": 8343,
        "title": "Parameters of apple tree crowns depending on the crown shape and pruning time",
        "authors": "Andrii Chaploutskyi, Roman Yakovenko, Roman Butsyk, Oleksandra Polunina, Oleksandr Zabolotnyi",
        "published": "2023-4-10",
        "citations": 1,
        "abstract": "The apple tree is a leading fruit crop in Ukraine in terms of production volumes and planting areas and is a valuable food product with a high content of vitamins. In new modern plantings, fruit producers prefer intensive cultivation technologies that ensure the maximum amount of high-quality fruit yield per unit area. The main criterion for solving this problem is the design of plantings: a narrow-row scheme for planting trees and a low-volume crown shape. The purpose of the study was to establish the influence of the pruning period of different types of crown formations on the growth and productivity of apple trees of two varieties: Fuji and Honey Crisp. The study was conducted in the conditions of the central Forest-Steppe of Ukraine (Uman National University of Horticulture). The scheme of planting was 4x1 m, M.9 rootstock, chernozem sod-podzolic soil, drip irrigation. Field, statistical, and computational-analytical methods were used in the course of the study. It was identified that the growth pattern of the examined varieties differed substantially, and crown volume, projection area, and development of the feeding area prevailed in Honey Crisp trees. However, in terms of productivity, the plantings of the Fuji variety substantially exceeded the values of the Honey Crisp variety. Forming a ballerina crown with the removal of overgrown wood in a 25 cm zone on the central trunk above the lower tier of semi-cellular branches provided an increase in the growth activity of the examined trees by 3-5%. A substantial decrease in the values of crown parameters was provided by the formation of the French axis crown – there was a decrease in the crown diameter by 44%, the crown volume – by 67%, and the crown projection area and the development of the feeding area – by 69%. Performing additional summer pruning of trees also helped to reduce growth activity by 6-11%. However, the specific productivity of plantings doubled in plantings with the formation of the French axis and by 45-50% with the introduction of double pruning of trees. It is recommended that agricultural producers investigate the terms of pruning low-volume crown forms, considering varietal characteristics, to create compacted apple stands and increase the intensification of production",
        "keywords": "",
        "link": "http://dx.doi.org/10.48077/scihor4.2023.65"
    },
    {
        "id": 8344,
        "title": "Effort and Cost Estimation Using Decision Tree Techniques and Story Points in Agile Software Development",
        "authors": "Eduardo Rodríguez Sánchez, Eduardo Filemón Vázquez Santacruz, Humberto Cervantes Maceda",
        "published": "2023-3-17",
        "citations": 6,
        "abstract": "Early effort estimation is important for efficiently planning the use of resources in an Information Technology (IT) project. However, limited research has been conducted on the topic of effort estimation in agile software development using artificial intelligence. This research project contributes to strengthening the use of hybrid models composed of algorithmic models and learning oriented techniques as a project-level effort estimation method in agile frameworks. Effort estimation in agile methods such as Scrum uses a story point approach that measures, using an arithmetic scale, the effort required to complete a release of the system. This project relied on labeled historical data to estimate the completion time measured in days and the total cost of a project set in Pakistani rupees (PKR). using a decision tree, random forest and AdaBoost to improve the accuracy of predictions. Models were trained using 10-fold cross-validation and the relative error was used as a comparison with literature results. The bootstrap aggregation (bagging) ensemble made of the three techniques provides the highest accuracy, and project classification also improves the estimates.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11061477"
    },
    {
        "id": 8345,
        "title": "Business rule extraction using decision tree machine learning techniques: A case study into smart returnable transport items",
        "authors": "Rob Bemthuis, Wei Wang, Maria-Eugenia Iacob, Paul Havinga",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.03.057"
    },
    {
        "id": 8346,
        "title": "Detection of Malware Using Machine Learning techniques on Random Forest, Decision Tree, KNeighbour, AdaBoost, SGD, ExtraTrees and GaussianNB Classifier",
        "authors": "Kanwarpartap Singh Gill, Vatsala Anand, Rupesh Gupta, Pao-Ann Hsiung",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353495"
    },
    {
        "id": 8347,
        "title": "Pruning and Mixed Precision Techniques for Accelerating Neural Network",
        "authors": "Mahsa Zahedi, Mohammad.S Abazari, Abdorreza Savadi",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccke60553.2023.10326309"
    },
    {
        "id": 8348,
        "title": "Effects of Pruning Types on Tree Vigor of Bamboo-Leaf Oak Inferred from Allometric Analysis",
        "authors": "Hideyasu Shimada",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ajps.2023.1412096"
    },
    {
        "id": 8349,
        "title": "The impact of pruning and mortality on urban tree canopy volume",
        "authors": "Andrew Francis Speak, Fabio Salbitano",
        "published": "2023-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ufug.2022.127810"
    },
    {
        "id": 8350,
        "title": "Algorithm Analysis of Decision Tree, Gradient Boosting Decision Tree, and Random Forest for Classification (Case Study: West Java House of Representatives Election 2019)",
        "authors": "Irena Irmalasari, Latifa Dwiyanti",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceei59426.2023.10346727"
    },
    {
        "id": 8351,
        "title": "Reduced Complexity SCL Decoding of U-UV Codes Through List Pruning",
        "authors": "Wenhao Chen, Li Chen, Huazi Zhang",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccworkshops57813.2023.10233707"
    },
    {
        "id": 8352,
        "title": "Influence of rejuvenating pruning on the potential productivity of the apple tree ",
        "authors": "GULNAZ USHKEMPIROVA, MARINA URAZAYEVA, SAULE KAZYBAYEVA, YULIYA YEFREMOVA",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "The period of operation of intensive orchards is 15 years. At the age of 6-7 years, the quality of fruits decreases sharply and the frequency of fruiting increases. In order to extend the productive period of the orchard, an experiment was laid on the effect of rejuvenating pruning on the productivity of an apple tree, depending on the variety-rootstock combination. In the course of this scientific study, in the period from 2020 to 2022, results were obtained indicating the presence of the potential for productivity of apple varieties of the Kazakhstani selection Voskhod and Talgarskoe on the introduced forms B 7-35, Arm 18 and the rootstock of the Kazakhstani selection Zhetysu 5 in which the solar radiation transmittance was from 0.45% to 0.77%. On this basis, all the studied varieties are superior to the control variant. It also improved the light space inside the tree crown, which increased the number of young growth points and contributed to the awakening of reserve buds. Young growing fruits, located in the middle and central parts of the crown, are better supplied with nutrients after pruning than before pruning.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.31830/2348-7542.2023.roc-977"
    },
    {
        "id": 8353,
        "title": "Security Evaluation of Decision Tree Meets Data Anonymization",
        "authors": "Ryousuke Wakabayashi, Lihua Wang, Ryo Nojima, Atsushi Waseda",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012456600003648"
    },
    {
        "id": 8354,
        "title": "Retracted: Internet of Things Security Detection Technology Based on Grey Association Decision Algorithm",
        "authors": "",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9794650"
    },
    {
        "id": 8355,
        "title": "Operation features of the expert system for tree and shrub pruning",
        "authors": "Maxim Logachev, Leliya Krylova",
        "published": "2023",
        "citations": 0,
        "abstract": "The article defines the importance of tree and shrub pruning for the environment of settlements and farms engaged in the cultivation of fruit plants. Such a process requires taking into account many parameters of both the plant itself and external conditions. This justifies the need to develop and use a software product capable of tracking over time the activities associated with pruning a plant and making recommendations to specialists for effective branch removal depending on the parameters of the setting. The problem domain has been analysed with the allocation of key parameters to create a formal model and a set of rules suitable for the use of object-orientated programming techniques. A user interface was created with the description of functional capabilities of the users of the developed software products.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202346202041"
    },
    {
        "id": 8356,
        "title": "Optimization and Component Linking Through Dynamic Tree Identification (DSI)",
        "authors": "",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "In this research, we present an innovative approach to connecting components using a Dynamic Identification Tree. The algorithm is designed to efficiently label connected components of digital objects, providing an improvement over existing methods. The dynamic identification tree enables accurate and fast labeling, thus facilitating topology analysis of digital objects. This approach promises universal applicability and exceptional efficiency in various data processing contexts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jmtcm.03.02.02"
    },
    {
        "id": 8357,
        "title": "Applying Decision Tree Algorithm Classification and Regression Tree (CART) Algorithm to Gini Techniques Binary Splits",
        "authors": "Dr. Nirmla Sharma,  , Sameera Iqbal Muhmmad Iqbal,  ",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Decision tree study is a predictive modelling tool that is used over many grounds. It is constructed through an algorithmic technique that is divided the dataset in different methods created on varied conditions. Decisions trees are the extreme dominant algorithms that drop under the set of supervised algorithms. However, Decision Trees appearance modest and natural, there is nothing identical modest near how the algorithm drives nearby the procedure determining on splits and how tree snipping happens. The initial object to appreciate in Decision Trees is that it splits the analyst field, i.e., the objective parameter into diverse subsets which are comparatively more similar from the viewpoint of the objective parameter. Gini index is the name of the level task that has applied to assess the binary changes in the dataset and worked with the definite object variable “Success” or “Failure”. Split creation is basically covering the dataset values. Decision trees monitor a top-down, greedy method that has recognized as recursive binary splitting. It has statistics for 15 statistics facts of scholar statistics on pass or fails an online Machine Learning exam. Decision trees are in the class of supervised machine learning. It has been commonly applied as it has informal implement, interpreted certainly, derived to quantitative, qualitative, nonstop, and binary splits, and provided consistent outcomes. The CART tree has regression technique applied to expected standards of nonstop variables. CART regression trees are an actual informal technique of understanding outcomes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35940/ijeat.e4195.0612523"
    },
    {
        "id": 8358,
        "title": "Keynote Speech I: Representation and decomposition of functions in DAGDNNs and structural network pruning",
        "authors": "Wen-Liang Hwang",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icotl59758.2023.10435226"
    },
    {
        "id": 8359,
        "title": "Assessing tuberculosis in the skeleton with the use of decision tree analysis",
        "authors": "Deona Botha, Rethabile Masiu, Maryna Steyn",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1127/anthranz/2023/1737"
    },
    {
        "id": 8360,
        "title": "Improving the energy efficiency of a refrigerated warehouse through the use of palm tree pruning waste as thermal insulator",
        "authors": "Hicham LAKRAFLI, Soufiane TAHIRI, Mohamed SENNOUNE, Abdelmajid BOUARDI",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "This work investigates the effect of palm tree pruning waste (PTPW) on thermal insulation and energy consumption of a refrigerated warehouse (RW). The thermal properties of PTPW depend strongly on its compactness, i.e. how much it weighs divided by how much space it takes up. The thermal conductivity of PTPW measured using the box method is about 0.069 W/m °C for a mass/occupied volume ratio of 0.064 g/cm3. It is comparable or lower than that of other natural materials discussed in the literature. The dynamic thermal simulation tool “TRNSYS” was applied to predict the thermal behavior of RW. The thickness of PTPW material was considered as variant to choose the better condition allowing achieving results very close to those of polyurethane. Obtained results highlight that 30 cm thick PTPW can reduce temperature by 1 to 2°C compared to 10 cm thick polyurethane. An improvement in the energy efficiency of the refrigerated warehouse was also highlighted. So, because of its performance, low cost, and eco-friendly nature, PTPW can compete with conventional insulating materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18186/thermal.1283362"
    },
    {
        "id": 8361,
        "title": "Time and type of pruning affect tree growth and yield in high-density olive orchards",
        "authors": "E.M. Lodolini, S. Polverigiani, V. Giorgi, F. Famiani, D. Neri",
        "published": "2023-3",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.scienta.2023.111831"
    },
    {
        "id": 8362,
        "title": "Retracted: Emergency Optimization Decision-Making with Incomplete Probabilistic Information under the Background of COVID-19",
        "authors": "",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9767809"
    },
    {
        "id": 8363,
        "title": "Optimal Decision Tree Policies for Markov Decision Processes",
        "authors": "Daniël Vos, Sicco Verwer",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Interpretability of reinforcement learning policies is essential for many real-world tasks but learning such interpretable policies is a hard problem. Particularly, rule-based policies such as decision trees and rules lists are difficult to optimize due to their non-differentiability. While existing techniques can learn verifiable decision tree policies, there is no guarantee that the learners generate a policy that performs optimally. In this work, we study the optimization of size-limited decision trees for Markov Decision Processes (MPDs) and propose OMDTs: Optimal MDP Decision Trees. Given a user-defined size limit and MDP formulation, OMDT directly maximizes the expected discounted return for the decision tree using Mixed-Integer Linear Programming. By training optimal tree policies for different MDPs we empirically study the optimality gap for existing imitation learning techniques and find that they perform sub-optimally. We show that this is due to an inherent shortcoming of imitation learning, namely that complex policies cannot be represented using size-limited trees. In such cases, it is better to directly optimize the tree for expected return. While there is generally a trade-off between the performance and interpretability of machine learning models, we find that on small MDPs, depth 3 OMDTs often perform close to optimally.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/606"
    },
    {
        "id": 8364,
        "title": "An Assessment of Ensemble Voting Approaches, Random Forest, and Decision Tree Techniques in Detecting Distributed Denial of Service (DDoS) Attacks",
        "authors": "Mustafa Alsumaidaie, Khattab Alheeti, Abdul Alaloosy",
        "published": "2024-6-15",
        "citations": 0,
        "abstract": "The contemporary and escalating dependence on digital technologies has rendered networks and systems more susceptible to cyber assaults. Among the dominant and detrimental forms of such attacks lies the Distributed Denial-of-Service (DDoS) assault, a menace capable of inflicting substantial financial repercussions and tarnishing one’s reputation. To combat this predicament, implementing machine learning (ML) algorithms has gained widespread acceptance, facilitating the identification and mitigation of DDoS attacks. Within this study, a novel security mechanism has been proposed to preclude DDoS assaults. Employing an ensemble learning approach, the objective is to differentiate between conventional network traffic and the pernicious influx of DDoS attack traffic. Moreover, the study assesses and compares the efficacy of two prominent ML algorithms, namely the decision tree and random forest, in detecting DDoS attacks. We evaluate the models using a publicly available dataset named ”TIME SERIES DATASET FOR DDOS ATTACK DETECTION.” We compare the performance of the models using various evaluation metrics, including accuracy, precision, recall, training time (sec), and the F1 score. The model development process consists of data collection, pre-processing, splitting into training and testing sets, selecting prediction models, and evaluating their performance. Evaluated on a dataset of 11,423 instances, the proposed approach demonstrated promising results, with accuracy ranging from 92% to 100% for the time series dataset. In conclusion, the proposed approach effectively detects and mitigates DDoS attacks, offering a reliable solution to protect communication systems against this growing cybersecurity threat.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37917/ijeee.20.1.2"
    },
    {
        "id": 8365,
        "title": "Multilevel Coding for Complexity Reduction in Soft-Decision FEC",
        "authors": "Yohei Koganei",
        "published": "2023",
        "citations": 0,
        "abstract": "We review the effectiveness of multilevel coding for realizing power efficient FEC for optical communication with a detailed discussion about the complexity of soft-decision FEC by particularly illustrating the chip implementation of LDPC codes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/sppcom.2023.sptu2e.3"
    },
    {
        "id": 8366,
        "title": "Cache Classification Analysis Supported by Implicit Path Pruning Techniques",
        "authors": "Haifeng Xing, Biao Wang, Lin Liu, Daming Zhao",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/swc57546.2023.10448880"
    },
    {
        "id": 8367,
        "title": "A binary decision tree approach for pharmaceutical project portfolio management",
        "authors": "Mahboubeh Farid, Mikael Palmblad, Hampus Hallman, Johannes Vänngård",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100228"
    },
    {
        "id": 8368,
        "title": "Design of a Biogas Power Plant That Uses Olive Tree Pruning and Olive Kernels in Achaia, Western Greece",
        "authors": "Efstathios Papachristopoulos, Evangelos Tsiaras, Vagelis G. Papadakis, Frank A. Coutelieris",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "In Greece, agricultural residues form a significant part of available biomass resources. This study focuses on exploring energy production potential from olive tree pruning and kernels via anaerobic digestion in the Achaia region of Western Greece. It aims to address environmental challenges by analyzing anaerobic digestion of these residues. The study evaluates qualitative and quantitative attributes, including composition analysis and energy content assessment. Detailed design considerations for an anaerobic digestion system tailored for these residues are presented, laying the groundwork for practical implementation. By integrating scientific analysis with engineering principles, this research aims to optimize anaerobic digestion systems for a more sustainable agricultural landscape in Greece.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su16010187"
    },
    {
        "id": 8369,
        "title": "Retracted: Emergency Project Management Decision Support Algorithm for Network Public Opinion Emergencies Based on Time Series",
        "authors": "",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9801454"
    },
    {
        "id": 8370,
        "title": "Research on Decision Tree in Price Prediction of Low Priced Stocks",
        "authors": "Shipei Du, Jin Qiu, Wenhui Ding",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012284500003807"
    },
    {
        "id": 8371,
        "title": "The Recycling and Reuse of Natural Materials: Sound Absorbing Box Patterns That Use Waste from Olive Tree Pruning",
        "authors": "Rossella Cottone, Louena Shtrepi, Valentina Serra, Simonetta Lucia Pagliolico",
        "published": "2023-2-5",
        "citations": 1,
        "abstract": "The agricultural activity of pruning olive trees generates waste which, due to long-standing practices and unawareness of the consequences, are burned on site, thereby producing CO2 emissions in the atmosphere. Therefore, in order to prevent environmental pollution and a waste of resources, the aim of this research investigation was to highlight some alternative uses of the pruning of olive trees waste. This work focuses on recycled and reused by-products as a secondary raw material for the implementation of interior components that can be used for indoor acoustic correction purposes and evaluates their potential as absorbing materials, without overlooking the aesthetic dimension. In this paper, different configurations based on plywood frames with loose olive pruning chips used as a filler, namely, modules and sub-modules, were investigated. Moreover, other technological details, that is, the influence of a Tissue-Non-Tissue (TNT) layer and a spray film coating applied over the external surface of the loose material, were measured. Sound absorption measurements were conducted inside a small-scale reverberation room (SSRR) and the experimental results demonstrated that the samples, for the given thickness, have weighted sound absorption values (αw) of between 0.15 and 0.35 and single third-octave band values that can reach higher values than 0.50 above 500 Hz. The frequency curves and weighted values of the samples in which the influence of TNT and the spray film coating were tested remained unchanged. This is a design aspect that allows absorbing surfaces to be modeled and integrated with existing walls, while maintaining the acoustic performance and the specific aesthetic features of the loose material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/acoustics5010011"
    },
    {
        "id": 8372,
        "title": "Impact of tree pruning on water use in tree-coffee systems on smallholder farms in Eastern Uganda",
        "authors": "Joel Buyinza, Catherine W. Muthuri, Matthew D. Denton, Ian K. Nuberg",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10457-023-00842-2"
    },
    {
        "id": 8373,
        "title": "A New Double-flow Network via Decision Tree for Human Action Recognition",
        "authors": "Tao Feng",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsm59373.2023.00017"
    },
    {
        "id": 8374,
        "title": "Evaluation of Pruning Techniques",
        "authors": "Shvetha S Kumar, Reshma R Nayak, Jismi S Kannampuzha, Jeeho Ryoo, Sahil Rai, Lizy K John",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipccc59175.2023.10253877"
    },
    {
        "id": 8375,
        "title": "A spanning tree algorithm with adaptive pruning with low redundancy coverage rate",
        "authors": "Renjie Xu, Shouwen Yao, Weiqi Gouhe, Yinghua Zhao, Siqi Huang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cie.2023.109745"
    },
    {
        "id": 8376,
        "title": "Bioactive Absorbent Chitosan Aerogels Reinforced with Bay Tree Pruning Waste Nanocellulose with Antioxidant Properties for Burger Meat Preservation",
        "authors": "Esther Rincón, Eduardo Espinosa, María Pinillos, Luis Serrano",
        "published": "2023-2-9",
        "citations": 7,
        "abstract": "As a transition strategy towards sustainability, food packaging plays a crucial role in the current era. This, carried out in a biorefinery context of agricultural residues, involves not only obtaining desirable products but a comprehensive utilization of biomass that contributes to the circular bioeconomy. The present work proposes the preparation of bioactive absorbent food pads through a multi-product biorefinery approach from bay tree pruning waste (BTPW). In a first step, chitosan aerogels reinforced with lignocellulose and cellulose micro/nanofibers from BTPW were prepared, studying the effect of residual lignin on the material’s properties. The presence of micro/nanofibers improved the mechanical performance (up to 60%) in addition to increasing the water uptake (42%) when lignin was present. The second step was to make them bioactive by incorporating bay leaf extract. The residual lignin in the micro/nanofibers was decisive, since when present, the release profiles of the extract were faster, reaching an antioxidant power of more than 85% after only 30 min. Finally, these bioactive aerogels were used as absorbent pads for fresh meat. With the use of the bioactive aerogels (with ≥2% extract), the meat remained fresh for 10 days as a result of delayed oxidation of the food during storage (20% metmyoglobin proportion).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/polym15040866"
    },
    {
        "id": 8377,
        "title": "Power Quality Detection and Categorization Algorithm Actuated by Multiple Signal Processing Techniques and Rule-Based Decision Tree",
        "authors": "Surendra Singh, Avdhesh Sharma, Akhil Ranjan Garg, Om Prakash Mahela, Baseem Khan, Ilyes Boulkaibet, Bilel Neji, Ahmed Ali, Julien Brito Ballester",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "This paper introduces a power quality (PQ) detection and categorization algorithm actuated by multiple signal processing techniques and rule-based decision tree (RBDT). This is aimed to recognize PQ events of simple nature and higher order multiplicity with less computational time using hybridization of the signal processing techniques. A voltage waveform with a PQ event (PQE) is processed using the Stockwell transform (ST) to compute the Stockwell PQ detection index (SPDI). The voltage waveform is also processed using the Hilbert transform (HT) to compute the Hilbert PQ detection index (HPDI). A voltage waveform is also decomposed using the Discrete Wavelet transform (DWT) to compute the classification feature index (CFI) [CFI1 to CFI4]. A combined PQ detection index (CPDI) is computed by multiplication of the SPDI, the HPDI and CFI1 to CFI4. Incidence of a PQE on a voltage signal is located with the help of a location PQ disturbance index (LPDI) which is computed by differentiating the CPDI with respect to time. CFI5, CFI6 and CFI7 are computed from the SPDI, the HPDI and the CPDI, respectively. Categorization of PQ events is performed using CFI1 to CFI7 by the rule-based decision tree (RBDT) with the help of simple decision rules. We conclude that the proposed algorithm is effective to identify the PQE with an accuracy of 98.58% in a noise-free environment and 97.62% in the presence of 20 dB SNR (signal-to-noise ratio) noise. Ten simple nature PQEs and eight combined PQ events (CPQEs) with multiplicity of two, three and four are effectively detected and categorized using the algorithm. The algorithm is also tested to detect a sag PQ event due to a line-to-ground (LG) fault incident on a practical distribution utility network. The performance of the investigated method is compared with a DWT-based technique in terms of accuracy of classification with and without noise, maximum computational time of PQ detection and multiplicity of PQE which can be effectively detected. A simulation is performed using the MATLAB software. MATLAB codes are used for modelling the PQE disturbances and the proposed algorithm using mathematical formulations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15054317"
    },
    {
        "id": 8378,
        "title": "Research on Prediction of Decision Tree Algorithm on Different Types of Stocks",
        "authors": "Shipei Du, Xiao Li, Dongjie Yang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012277000003807"
    },
    {
        "id": 8379,
        "title": "Construction of Digital Financial Risk Early Warning Model Based on Decision Tree Algorithm",
        "authors": "Yaping Liu",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsm59373.2023.00038"
    },
    {
        "id": 8380,
        "title": "University Financial Management and Decision Analysis based on Decision Tree Algorithm",
        "authors": "He Jun'e",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdcece57866.2023.10151276"
    },
    {
        "id": 8381,
        "title": "Prohexadione calcium as a tool to reduce winter pruning in peach tree cultivar Eragil",
        "authors": "Vagner Brancalione Bolsatto, Wendel Silvestre, Carine Cocco",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "This work evaluated the efficiency and feasibility of applying calcium prohexadione (PCA) at different times to control the vegetative growth and qualitative aspects of the peach tree cultivar Eragil. The experiment was carried out in the 2021/2022 season in a commercial orchard in the municipality of Ipê, RS. Treatments consisted of applications of PCA at a fixed dose of 20 mL·100 L-1 at different stages of development, as shown: T1 – control (no application); T2 – application in petal fall; T3 – application at petal fall + application 30 DAA (days after the first application); T4 – application after green pruning; T5 – application after green pruning + application 30 DAA; T6 – application at petal fall + application 30 DAA + application 60 DAA. The experimental design was in randomized blocks, with six treatments and four replications. Each plot consisted of four plants; the two central plants were considered useful. Effective fruiting increased in T3. In the evaluations of the number of pruned branches, length of branches, and weight of branches per plant, all results were smaller in T2. In the assessments of number of buds, internode length, and pruning time per hectare, there was also a significant difference, and in the number of buds, T6 had the smallest number. The internode length was the greatest in T3, and the shortest pruning time stood out in T4. Calcium prohexadione effectively controlled the vegetative growth of Eragil peach and can be directed to large areas of the peach crop when labor for pruning is scarce.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21674/2448-0479.93.168-177"
    },
    {
        "id": 8382,
        "title": "Retracted: Decision Optimization of Low-Carbon Dual-Channel Supply Chain of Auto Parts Based on Smart City Architecture",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9845369"
    },
    {
        "id": 8383,
        "title": "Vermistabilization of mango tree pruning waste with five earthworm species: A biochemical and heavy metal assessment",
        "authors": "Bhavik Keniya, Hemant Patel, Ketan Patel, Shivam Bhatt, Tushar Patel",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e19908"
    },
    {
        "id": 8384,
        "title": "Research on Chinese Public Policy Decision Model Based on Decision Tree Algorithm",
        "authors": "Shenghao Fang",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "In this paper, the decision tree classification algorithm is used to establish the prediction model of Chinese public policy decision. This paper selects characteristic attributes based on the principle of policy making. Then, taking the result of public policy decision as the target label, this paper optimizes the model by adjusting the maximum depth of decision tree, the minimum number of leaf samples and the decision threshold. The test set verifies that the optimized decision tree model has a good predictive effect on the result prediction of the public policy decision model. The value of AUC was 0.848 and the model had strong generalization ability. The AUC difference between training set and test set is less than 0.04.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v56i.10592"
    },
    {
        "id": 8385,
        "title": "Analysis of the prediction performance of decision tree-based algorithms",
        "authors": "Fadwa AABOUB, Hasna CHAMLAL, Tayeb OUADERHMAN",
        "published": "2023-9-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasa59624.2023.10286809"
    },
    {
        "id": 8386,
        "title": "Acoustic Performance Assessment of Sustainable Acoustic Absorbers Made from Olive Tree Pruning and Pine Waste",
        "authors": "R. Cottone, L. Shtrepi, V. Serra, S.L. Pagliolico, A. Schiavi",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61782/fa.2023.1218"
    },
    {
        "id": 8387,
        "title": "Reducing Computation Complexity in Optimization of Nanophotonic Structures Using Pruning",
        "authors": "Mohammad Hadigheh Javani, Mohammadreza Zandehshahvar, Ali Adibi",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lpt.2023.3342631"
    },
    {
        "id": 8388,
        "title": "Retracted: A Dynamic Hierarchical Clustering Data Gathering Algorithm Based on Multiple Criteria Decision Making for 3D Underwater Sensor Networks",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9756038"
    },
    {
        "id": 8389,
        "title": "METHOD OF AUTOMATED DETECTION OF ARTICLE TERMS USING A DECISION TREE",
        "authors": "ANNA SYNKO, PAVLO ZHEZHNYCH,  ",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Every day, the number of users of virtual communities is increasing, and therefore the data that occurs during communication between them. The posted data can contain valuable information because they contain not only the manufacturer’s opinion, but also consumer experience about a certain product. But, due to the fact that virtual communities have a weak structure in terms of providing information, they are more focused on entertaining content – they may contain data that do not carry a meaningful load, and also, when placing data, not all users foresee techniques that will help increase the relevance of the search for this data. Therefore, the search for target data requires significant time costs. To improve the search for data in the article, a method is proposed that allows you to analyze the content of posted posts and identify keywords from a certain subject area. This method is automated and works on the basis of a previously developed dictionary of key phrases or regular expressions with weighting coefficients of belonging to one or another term. As a result, a decision-making tree is built for each term, which determines the weight of the term to the content of the post, article. At the same time, the level of location of the post in the discussion is taken into account, because the discussion contains a set of chronologically ordered posts. Posts placed at higher levels have a higher coefficient in the calculation. While posts are placed at lower levels – lower weighting factors. Identified key phrases before the specified term are ordered in descending order of weight. At each level of the tree, the total weight of key phrases must be equal to one. To process the data from the virtual communities, they were downloaded using the data consolidation technique. As a result, the concept of consolidated data storage was introduced, which allows collecting data from disparate sources. The paper presents the weight calculation for one term from part of the CodeProject community post.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31891/2307-5732-2023-319-1-338-343"
    },
    {
        "id": 8390,
        "title": "Complexity for complexity—How advanced modeling may limit its applicability for decision‐makers",
        "authors": "Ben J. M. Ale, David H. Slater",
        "published": "2023-12-3",
        "citations": 0,
        "abstract": "AbstractAs today's engineering systems have become increasingly sophisticated, assessing the efficacy of their safety‐critical systems has become much more challenging. The more classical methods of “failure” analysis by decomposition into components related by logic trees, such as fault and event trees, root cause analysis, and failure mode and effects analysis lead to models that do not necessarily behave like the real systems they are meant to represent. These models need to display similar emergent and unpredictable behaviors to sociotechnical systems in the real world. The question then arises as to whether a return to a simpler whole system model is necessary to understand better the behavior of real systems and to build confidence in the results. This question is more prescient when one considers that the causal chain in many serious accidents is not as deep‐rooted as is sometimes claimed. If these more obvious causes are not taken away, why would the more intricate scenarios that emanate from more sophisticated models be acted upon. The paper highlights the advantages of modeling and analyzing these “normal” deviations from ideality, so called weak signals, versus just system failures and near misses as well as catastrophes. In this paper we explore this question.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/risa.14261"
    },
    {
        "id": 8391,
        "title": "Retracted: Multiple-Attribute Decision-Making Method Based on Normalized Geometric Aggregation Operators of Single-Valued Neutrosophic Hesitant Fuzzy Information",
        "authors": "",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9874398"
    },
    {
        "id": 8392,
        "title": "Optimal Tree Depth in Decision Tree Classifiers for Predicting Heart Failure Mortality",
        "authors": "Tsehay Admassu Assegie, Ahmed Elaraby",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56578/hf010105"
    },
    {
        "id": 8393,
        "title": "Asset Management Decision Support Tools: Computational Complexity, Transparency, and Realism",
        "authors": "Babatunde Atolagbe, Sue McNeil",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023036005"
    },
    {
        "id": 8394,
        "title": "AutoFusion of feature pruning for decision making in operations research",
        "authors": "Pınar Karadayı Ataş, Süreyya Özöğür Akyüz",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10100-023-00901-0"
    },
    {
        "id": 8395,
        "title": "Lung Cancer Detection in CT Scans Employing Image Processing Techniques and Classification by Decision Tree(DT) and K-Nearest Neighbor(KNN)",
        "authors": "Lakshmi Hanisha Jyothula, Greeshma Eppa, Abhishikth Varma Indhukuri, Mohd. Javeed Mehdi",
        "published": "2023-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vitecon58111.2023.10157762"
    },
    {
        "id": 8396,
        "title": "Comparative Analysis of Decision Tree (DT) &amp; Deep Neural Network (DNN) Techniques to Diagnose the Stator Winding Fault in the Permanent Magnet Synchronous Motor (PMSM)",
        "authors": "Et al. Prakhar Singh Bhadoria",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "Every industry is moving towards automation, and Electrical motors like DC and AC play a significant role in the overall automation scheme. Electrical motors, however, are prone to multiple manufacturing defects, and untimed wear and tear. Automated detection of faults, while the motor is in operations, can prevent automation breakdowns, and unforeseen accidents. The majority of faults in electrical motors are because of overheating of windings, bearing misalignment, shaft mismatch, vibrations, noise, etc. A few hours of Electric Motor running can generate a lot of sensor data measuring temperature, torque etc.. Manual analysis of such data can be extremely time consuming. Machine Learning can be used to perform automated analysis of data and real-time fault detection as suggested by many experts. In this research, we have used a few machine learning techniques to train the model on top of sensor data and use the model to diagnose the electric motor faults, occurring because of heat in the stator winding part of the permanent magnet synchronous motor (pmsm). We have specifically compared Decision Tree (DT) and Deep Neural Network (DNN) techniques on real-life datasets, and compared their accuracy. As per the final results, Decision Tree (DT) and Deep Neural Network (DNN) have 93.82% & 97% accuracy respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.9200"
    },
    {
        "id": 8397,
        "title": "A DECISION TREE APPROACH TO TASK-INDEPENDENT SPEECH RECOGNITION",
        "authors": "S DOWNEY, M RUSSELL",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25144/20950"
    },
    {
        "id": 8398,
        "title": "The Complexity of \"Tree\" Imagery in Robert Frost's Poetry",
        "authors": "Tongjing Yi",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Robert Frost is often regarded as a highly esteemed poet within the realm of modern and current American literature. Frosts poem appears straightforward but is actually quite intricate. Furthermore, Frosts poetic works are characterised by a rich tapestry of imagery that adds to their overall intricacy. Moreover, Frosts poetry exhibits a substantial presence of tree imagery. A variety of trees exhibit distinct behaviours, like falling to the ground, emitting sounds, or remaining in a state of quiet. Furthermore, these trees manifest diverse forms and dimensions. This study focuses on three selected poems by Frost, namely The Sound of the Trees, On a Tree Fallen Across the Road, and Tree at My Window. The objective is to examine the intricate employment of tree imagery in Frosts poetry through the lens of analysing poetic imagery. Upon careful examination, it has been shown that the intricacy of the tree imagery in Frosts poems can be attributed to two distinct factors. Initially, Frost undertakes a division of the tree, a whole entity, into two distinct components, each symbolising distinct concepts of liberation and restriction. This deliberate act enhances the depth of the underlying symbolism. Another factor to consider is that the depiction of tree is not fixed, but rather undergoes transformations as time progresses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-7064/18/20231161"
    },
    {
        "id": 8399,
        "title": "A Combined Learning Based Classifier Using Decision Tree and Logistic Regression",
        "authors": "Seong-Jun Kim, Jihee Kim",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codit58514.2023.10284206"
    },
    {
        "id": 8400,
        "title": "A predictive analytics model for forecasting outcomes in the National Football League games using decision tree and logistic regression",
        "authors": "Matt Gifford, Tuncay Bayrak",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100296"
    },
    {
        "id": 8401,
        "title": "A genetic algorithm coupled with tree-based pruning for mining closed association rules",
        "authors": "Jashma Suresh Ponmudiyan Poovan, Dinesh Acharya Udupi, Nandanvana Veerappareddy Subba Reddy",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "Due to the voluminous amount of itemsets that are generated, the association rules extracted from these itemsets contain redundancy, and designing an effective approach to address this issue is of paramount importance. Although multiple algorithms were proposed in recent years for mining closed association rules most of them underperform in terms of run time or memory. Another issue that remains challenging is the nature of the dataset. While some of the existing algorithms perform well on dense datasets others perform well on sparse datasets. This paper aims to handle these drawbacks by using a genetic algorithm for mining closed association rules. Recent studies have shown that genetic algorithms perform better than conventional algorithms due to their bitwise operations of crossover and mutation. Bitwise operations are predominantly faster than conventional approaches and bits consume lesser memory thereby improving the overall performance of the algorithm. To address the redundancy in the mined association rules a tree-based pruning algorithm has been designed here. This works on the principle of minimal antecedent and maximal consequent. Experiments have shown that the proposed approach works well on both dense and sparse datasets while surpassing existing techniques with regard to run time and memory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i3.pp2876-2890"
    },
    {
        "id": 8402,
        "title": "Machine Translation Testing via Syntactic Tree Pruning",
        "authors": "Quanjun Zhang, Juan Zhai, Chunrong Fang, Jiawei Liu, Weisong Sun, Haichuan Hu, Qingyu Wang",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Machine translation systems have been widely adopted in our daily life, making life easier and more convenient. Unfortunately, erroneous translations may result in severe consequences, such as financial losses. This requires to improve the accuracy and the reliability of machine translation systems. However, it is challenging to test machine translation systems because of the complexity and intractability of the underlying neural models. To tackle these challenges, we propose a novel metamorphic testing approach by syntactic tree pruning (STP) to validate machine translation systems. Our key insight is that a pruned sentence should have similar crucial semantics compared with the original sentence. Specifically, STP (1) proposes a core semantics-preserving pruning strategy by basic sentence structures and dependency relations on the level of syntactic tree representation; (2) generates source sentence pairs based on the metamorphic relation; (3) reports suspicious issues whose translations break the consistency property by a bag-of-words model. We further evaluate STP on two state-of-the-art machine translation systems (i.e., Google Translate and Bing Microsoft Translator) with 1,200 source sentences as inputs. The results show that STP accurately finds 5,073 unique erroneous translations in Google Translate and 5,100 unique erroneous translations in Bing Microsoft Translator (400% more than state-of-the-art techniques), with 64.5% and 65.4% precision, respectively. The reported erroneous translations vary in types and more than 90% of them found by state-of-the-art techniques. There are 9,393 erroneous translations unique to STP, which is 711.9% more than state-of-the-art techniques. Moreover, STP is quite effective in detecting translation errors for the original sentences with a recall reaching 74.0%, improving state-of-the-art techniques by 55.1% on average.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640329"
    },
    {
        "id": 8403,
        "title": "How Complex Is It To Understand Complexity?",
        "authors": "Carolina Schneider Bender, Mauri Leodir Lobler",
        "published": "2023-1-2",
        "citations": 0,
        "abstract": "Humans face complexity in the most routine decisions, such as choosing the toppings of a pizza, and essential decisions in life, such as choosing the courses offered at graduate school and career decisions. This paper explores the interconnection between complexity and decision-making as scientific knowledge. The researchers used the technique of scientific mapping to achieve the research objective. The results show that research involving complexity and decision making are still necessary. The annual growth rate of scientific production related to these two topics is 12.12%. Career decision-making is a well-developed theme and essential in the research dynamics. Researchers can conduct more studies on the emerging theme of shared decision-making.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23925/2178-0080.2023v25i1.56458"
    },
    {
        "id": 8404,
        "title": "Financial Intelligence Decision Analysis System Based on Decision Tree Algorithm",
        "authors": "Tingting Li, Meiqi Liu, Ying Cao, Juanjuan An",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245435"
    },
    {
        "id": 8405,
        "title": "Estimating soil surface moisture by using landsat 8 and sentinel 2 satellites techniques depending on the stepwise decision tree",
        "authors": "Khalil Ghorbani, Parvin Zolfaghary, Mohammad Siahbalaei, Laleh Rezaei Ghaleh, Chooghi Bairam Komaki, Esmaeil Valizadeh",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12145-023-01203-4"
    },
    {
        "id": 8406,
        "title": "A comparative analysis of financial fraud detection in credit card by decision tree and random forest techniques",
        "authors": "Amrut Ranjan Jena, Santanu Kumar Sen, Madhusmita Mishra, Shrutarba Banerjee, Nupur Dey, Ipsita Saha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0166542"
    },
    {
        "id": 8407,
        "title": "A Decision Tree-based Monitoring and Recovery Framework for Autonomous Robots with Decision Uncertainties",
        "authors": "Rahul Peddi, Nicola Bezzo",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342207"
    },
    {
        "id": 8408,
        "title": "Delineating flood-prone areas using advanced integration of reduced-error pruning tree with different ensemble classifier algorithms",
        "authors": "Ebrahim Nohani, Solmaz Khazaei, Mohammad Dorjahangir, Haniyeh Asadi, Sahar Elkaee, Asad Mahdavi, Javad Hatamiafkoueieh, John P. Tiefenbacher",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11600-023-01238-7"
    },
    {
        "id": 8409,
        "title": "Penerapan Decision Tree Pada Penentuan Waralaba",
        "authors": "Evy Priyanti",
        "published": "2023-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31294/swabumi.v11i1.13911"
    },
    {
        "id": 8410,
        "title": "Autonomous Robot Motion Decision Algorithm Based on Decision Tree Algorithm and Deep Learning Technology",
        "authors": "Xun Li",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdiime59043.2023.00055"
    },
    {
        "id": 8411,
        "title": "Online Cascading Failure Searching Based on Gradient Boosting Decision Tree",
        "authors": "Tianhao Liu, Yutian Liu",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/powertech55446.2023.10202887"
    },
    {
        "id": 8412,
        "title": "Composite Tiles Produced from Granite Dust and Tree Pruning Using a Sandwiched Method",
        "authors": "Idehai Ohijeagbon, Olawale Aransiola, Adekunle Adeleke, Peter Omoniyi, Peter Ikubanni, Daniel Oguntayo",
        "published": "2023-8-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/rcma.330401"
    },
    {
        "id": 8413,
        "title": "Multi-Criteria Decision-Making RASS-RATSI Approaches to Rank Soils Olive Tree Growing",
        "authors": "Emna Zouaghi, Hela Moalla Frikha, Abir Ouhibi",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasa59624.2023.10286709"
    },
    {
        "id": 8414,
        "title": "Decision support system coffee pruning brigade based on Android using analytical hierarchy process method",
        "authors": " Amna, Yeni Rasmayanti, Anna Permatasari Kamarudin, Husna Gemasih",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0118746"
    },
    {
        "id": 8415,
        "title": "Impact of choice set complexity on decoy effects",
        "authors": "Jacob M. Stanley, Douglas H. Wedell",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractStudies of contextual choice typically use three option choice sets to evaluate how preference relations depend on the values of a third decoy option. However, often real‐world decisions are made using choice sets with many more than three alternatives, such as in online shopping. Three experiments tested for attraction and compromise decoy effects in choice sets that varied the number and ordering of alternatives using a within‐subjects preferential choice grocery shopping task. In Experiment 1, attraction and compromise effects were significantly reduced as alternatives increased from three to nine. Experiment 2 found significantly greater attraction effects in nine alternative choice sets ordered by attributes compared with a random ordering. Experiment 3 used eye tracking and found significant attraction effects in choice sets with 3, 9, and 15 alternatives, but the effect was reduced with increasing alternatives. Eye tracking revealed that participants engaged in more by‐dimension comparisons as the number of alternatives increased, but, contrary to previous research, the proportion of by‐alternative to by‐dimension transitions was not linearly predictive of decoy effects. With increased alternatives, the proportion of the total information attended to decreased, leading to worse choice outcomes, and participants were more likely to engage in a lexicographic decision‐making strategy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/bdm.2373"
    },
    {
        "id": 8416,
        "title": "Application of Decision Tree Algorithm in Educational Data Mining",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/curtm.2023.060818"
    },
    {
        "id": 8417,
        "title": "Decision making tree for determining risks in forest management",
        "authors": "Tjaša Šmidovnik, Petra Grošelj, Andrej Ficko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20315/silvaslovenica.0022.21"
    },
    {
        "id": 8418,
        "title": "Dynamic MAC Unit Pruning Techniques in Runtime RTL Simulation for Area-Accuracy Efficient Implementation of Neural Network Accelerator",
        "authors": "Jisu Kwon, Heuijee Yun, Daejin Park",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mwscas57524.2023.10406146"
    },
    {
        "id": 8419,
        "title": "Synthesis of a novel cellulose-based adsorbent from olive tree pruning waste for removal of boron from aqueous solution",
        "authors": "Bekir Fırat Altınbaş, Aslı Yüksel",
        "published": "2023-3-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13399-023-04147-3"
    },
    {
        "id": 8420,
        "title": "Kinetics of Thermal Decomposition of Egyptian Olive Tree Pruning Residues",
        "authors": "Fatma Abosamra, A. Radwan, Y. EL-Hadidi, M. Hamad, M. El kholy",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21608/jssae.2023.202291.1158"
    },
    {
        "id": 8421,
        "title": "Assessment of the Spatial Variability and Uncertainty of Shreddable Pruning Biomass in an Olive Grove Based on Canopy Volume and Tree Projected Area",
        "authors": "Antonio Rodríguez-Lizana, Alzira Ramos, María João Pereira, Amílcar Soares, Manuel Castro Ribeiro",
        "published": "2023-6-25",
        "citations": 2,
        "abstract": "Olive pruning residues are a by-product that can be applied to soil or used for energy production in a circular economy model. Its benefits depend on the amount of pruning, which varies greatly within farms. This study aimed to investigate the spatial variability of shreddable olive pruning in a traditional olive grove in Córdoba (Spain) with an area of 15 ha and trees distanced 12.5 m from each other. To model the spatial variability of shreddable olive pruning, geostatistical methods of stochastic simulation were applied to three correlated variables measured on sampled trees: the crown projected area (n = 928 trees), the crown volume (n = 167) and the amount of shreddable pruning (n = 59). Pearson’s correlation between pairs of variables varied from 0.71 to 0.76. The amount of pruning showed great variability, ranging from 7.6 to 76 kg tree−1, with a mean value of 37 kg tree−1. Using exponential and spherical variogram models, the spatial continuity of the variables under study was established. Shreddable dry pruning weight values showed spatial autocorrelation up to 180 m. The spatial uncertainty of the estimation was obtained using sequential simulation algorithms. Stochastic simulation algorithms provided 150 possible images of the amount of shreddable pruning on the farm, using tree projected area and crown volume as secondary information. The interquartile range and 90% prediction interval were used as indicators of the uncertainty around the mean value. Uncertainty validation was performed using accuracy plots and the associated G-statistic. Results indicate with high confidence (i.e., low uncertainty) that shreddable dry pruning weight in the mid-western area of the farm will be much lower than the rest of the farm. In the same way, results show with high confidence that dry pruning weight will be much higher in a small area in the middle east of the farm. The values of the G-statistic ranged between 0.89 and 0.90 in the tests performed. The joint use of crown volume and projected areas is valuable in estimating the spatial variability of the amount of pruning. The study shows that the use of prediction intervals enables the evaluation of farm areas and informed management decisions with a low level of risk. The methodology proposed in this work can be extrapolated to other 3D crops without requiring modifications. On a larger scale, it can be useful for predicting optimal locations for biomass plants, areas with high potential as carbon sinks or areas requiring special soil protection measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agronomy13071697"
    },
    {
        "id": 8422,
        "title": "Anomaly Sewing Pattern Detection for AIoT System using Deep Learning and Decision Tree",
        "authors": "Nguyen Quoc Toan, Seongwon Cho,  ",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Artificial Intelligence of Things (AIoT), which combines AI and the Internet of Things (IoT), has recently gained popularity. Deep neural networks (DNNs) have achieved great success in many applications. Deploying complex AI models on embedded boards, nevertheless, may be challenging due to computational limitations or intelligent model complexity. This paper focuses on an AIoT-based system for smart sewing automation using edge devices. Our technique included developing a detection model and a decision tree for a sufficient testing scenario. YOLOv5 set the stage for our defective sewing stitches detection model, to detect anomalies and classify the sewing patterns. According to the experimental testing, the proposed approach achieved a perfect score with accuracy and F1score of 1.0, False Positive Rate (FPR), False Negative Rate (FNR) of 0, and a speed of 0.07 seconds with file size 2.43MB.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30693/smj.2024.13.02.85"
    },
    {
        "id": 8423,
        "title": "Uncertainty guided pruning of classification model tree",
        "authors": "Xinlei Zhou, Sudong Chen, Nianjiao Peng, Xinpeng Zhou, Xizhao Wang",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2022.110067"
    },
    {
        "id": 8424,
        "title": "Construction and optimization of vending machine decision support system based on improved C4.5 decision tree",
        "authors": "Ping Li, Fang Xiong, Xibei Huang, Xiaojun Wen",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e25024"
    },
    {
        "id": 8425,
        "title": "Tree pruning improves tree form but not understory plant production in mixed stands of Sitka spruce and western hemlock, USA",
        "authors": "Kellen N Nelson, Jeffrey C Barnard, Preston M Massingham, Justin S Crotteau",
        "published": "2024-3-10",
        "citations": 1,
        "abstract": "Abstract\nPrecommercial thinning and tree pruning are frequently used together to improve timber quality and wildlife habitat in even-aged Sitka spruce (Picea sitchensis) and western hemlock (Tsuga heterophylla) stands. Thinning enhances crop tree growth and understory plant production; however, the benefits and drawbacks of tree pruning have received less attention. Tree pruning was investigated in two long-term experiments on the Tongass National Forest, Alaska, USA. Experiment 1 tracked four uniformly thinned sites for ~30 years that received 2.4, 3.6, and 5.2 m lift, and no pruning treatments. Experiment 2 tracked 11 sites for 16 years that received thinning/no pruning, thinning plus pruning (25% of trees), thinning plus pruning (50% of trees), and no thinning/no pruning treatments. We investigated (i) how pruning lift height affects tree form and understory production and (ii) how pruning density affects canopy closure and understory production. In Experiment 1, pruning reduced butt log taper and did not adversely affect diameter or height in either species. Pruning lift was visible in height-to-live crown measurements. Crown recession occurred first in low lift treatments and later in all treatments until crown form was similar after 28–31 years. Epicormic branching rates in Sitka spruce peaked 6–9 years after treatment before falling sharply. Deer forage declined through time and did not differ between lift treatments. In Experiment 2, canopy closure was lower shortly after thinning and pruning, but did not differ from the control after 16 years. Epicormic branching rates were greater shortly after thinning and pruning but did not differ from the control after 16 years. Deer forage declined with canopy closure and thinned and pruned treatments exhibited greater forage than the control. We conclude that pruning can improve log quality for timber applications but does not enhance understory plant biomass and deer forage over thinning treatment alone.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/forestry/cpad042"
    },
    {
        "id": 8426,
        "title": "An Improved Decision Tree Model for Forecasting Consumer Decision in a Medium Groceries Store",
        "authors": "Intan Rahmatillah, Eriana Astuty, Ivan Diryana Sudirman",
        "published": "2023-8-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciis58898.2023.10253592"
    },
    {
        "id": 8427,
        "title": "Prediction of Heart Disease Using Decision Tree in Comparison with Particle Swarm Optimization to Improve Accuracy",
        "authors": "Ina Maryani, . Rousyati, . Indriyanti, Dany Pratmanto, Yustina Kristania, Mawadatul Maulidah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012447300003848"
    },
    {
        "id": 8428,
        "title": "Classification of retail loans using decision tree",
        "authors": "Kitti Fodor",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "While there is extensive literature on the prediction of corporate bankruptcies, there is little literature on the classification of retail borrowers. There are several ways to analyse the data, which may yield different results. In this paper, my aim is to predict the default of household loans using decision tree.  I found one significant explanatory variable, which was the ratio of the repayment to the contract amount. For my analysis I used two samples with different compositions. Both have high classification accuracy. Overall, the second model is better, with a classification accuracy of 84,4%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35925/j.multi.2023.3.21"
    },
    {
        "id": 8429,
        "title": "A Personalized Tour Recommender in Python using Decision Tree",
        "authors": "Nayma Khan, Mohammad Haroon",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4493066"
    },
    {
        "id": 8430,
        "title": "SMART AGRICULTURE USING DECISION TREE IN IOT",
        "authors": "",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets35152"
    },
    {
        "id": 8431,
        "title": "FPGA-based automatic Pill Dispenser using Decision Tree Classifier",
        "authors": "",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47750/jptcp.2023.30.11.017"
    },
    {
        "id": 8432,
        "title": "On Complexity of Deterministic and Nondeterministic Decision Trees for Conventional Decision Tables from Closed Classes",
        "authors": "Azimkhon Ostonov, Mikhail Moshkov",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "In this paper, we consider classes of conventional decision tables closed relative to the removal of attributes (columns) and changing decisions assigned to rows. For tables from an arbitrary closed class, we study the dependence of the minimum complexity of deterministic and nondeterministic decision trees on the complexity of the set of attributes attached to columns. We also study the dependence of the minimum complexity of deterministic decision trees on the minimum complexity of nondeterministic decision trees. Note that a nondeterministic decision tree can be interpreted as a set of true decision rules that covers all rows of the table.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25101411"
    },
    {
        "id": 8433,
        "title": "Pruning terms and techniques affect vigour and flower formation of Ukrainian sweet cherry trees",
        "authors": "Pavlo Bondarenko, Olha Alekseeva, Volodymyr Senin, Petro Kondratenko",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "Excessive tree vigour and late entrance into full production, inherent to sweet cherry trees, are major challenges in the intensive cultivation of this crop. Possible ways to reduce the vigour and stimulate flower induction include shifting the term of pruning and reducing its severity. However, the reaction of the trees may differ depending on specific cultivar, soil and climatic conditions. Therefore, the aim of the study was to determine the effect of various techniques and terms of pruning on young sweet cherry trees in order to adapt the intensive cultivation technology to the arid conditions of southern Ukraine. The results showed a strong cultivar-specific reaction to various pruning treatments. Pruning young sweet cherry trees in late summer contributed to a reduction of trunk and canopy indices by 11-22% on one of the cultivars and an increase in the number of flowers per tree by 1.4-1.7 times on both cultivars, compared to dormant pruning. Low severity pruning reduced 1-year-old shoot length by 9-25% and increased the number of flowers by 1.5-2.5 times compared to more aggressive pruning. The effect of pruning treatments on tree vigour was more pronounced during the first and second year of their application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36253/ahsc-13827"
    },
    {
        "id": 8434,
        "title": "Techniques for Finding Analytical Solution of Generalized Fuzzy Differential Equations with Applications",
        "authors": "Mudassir Shams, Nasreen Kausar, Naveed Yaqoob, Nayyab Arif, Gezahagne Mulat Addis",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "Engineering and applied mathematics disciplines that involve differential equations include classical mechanics, thermodynamics, electrodynamics, and general relativity. Modelling a wide range of real-world situations sometimes comprises ambiguous, imprecise, or insufficient situational information, as well as multiindex, uncertainty, or restriction dynamics. As a result, intuitionistic fuzzy set models are significantly more useful and versatile in dealing with this type of data than fuzzy set models, triangular, or trapezoidal fuzzy set models. In this research, we looked at differential equations in a generalized intuitionistic fuzzy environment. We used the modified Adomian decomposition technique to solve generalized intuitionistic fuzzy initial value problems. The generalized modified Adomian decomposition technique is used to solve various higher-order generalized trapezoidal intuitionistic fuzzy initial value problems, circuit analysis problems, mass-spring systems, steam supply control sliding value problems, and some other problems in physical science. The outcomes of numerical test applications were compared to exact technique solutions, and it was shown that our generalized modified Adomian decomposition method is efficient, robotic, and reliable, as well as simple to implement.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/3000653"
    },
    {
        "id": 8435,
        "title": "Complexity-Bounded Relaxed Dynamic Programming",
        "authors": "R.M. Beumer, M.J.G. Van De Molengraft, D.J. Antunes",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cdc49753.2023.10383392"
    },
    {
        "id": 8436,
        "title": "Decision Tree Algorithm and Deep Learning Technology Based Motion Decision Algorithm for Autonomous Robots",
        "authors": "Chenxi Jiang, Yayan Lei",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3627341.3630395"
    },
    {
        "id": 8437,
        "title": "Optimization of Microwave-Assisted Organosolv Pretreatment for Enzymatic Hydrolysis of Cherry Tree Pruning and Pistachio Shells: a Step to Bioethanol Production",
        "authors": "Luca Corsi, Soledad Mateo, Francesco Spaccini, Cinzia Buratti, Alberto J. Moya",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "AbstractThe overall purpose of this research work was to apply a microwave-assisted digestion process combined with ethanol organosolv as pretreatment for pistachio shells (PS) and cherry tree pruning (CTP) biomasses for cellulose production. This process would reduce the technical and environmental disadvantages of the accumulation of these agricultural wastes. A central composite design based on the Response Surface Methodology was applied to check the effect of reaction time, temperature, and concentration of ethanol acid solution. Adequate models have been obtained for the contents of cellulose and lignin of the treated solids as well as for solubilized cellulose percentage. Best conditions implied 67% ethanol and 30 min at 150 $$~\\mathrm {^\\circ }$$\n\n\n\n\n∘\n\n\nC, involving the production of a cellulose-enriched material (81.1% and 90.1% for treated CTP and PS, respectively). Finally, enzymatic hydrolysis of these materials was carried out, reaching glucose concentrations of 70 and 100 kg/m$$^{3}$$\n\n\n3\n\n for CTP and PS, resulting in enzymatic hydrolysis yields at 12 h of 97.2% and 76.9%. These high values are one of the main novelties and strengths of this work, as show the ease of the process and can have a beneficial influence on its scale-up, reducing both costs and environmental impact.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12155-023-10647-x"
    },
    {
        "id": 8438,
        "title": "Influence of growing environment and pruning techniques on storage and quality traits of Vaccinium corymbosum L., cv ‘Duke’",
        "authors": "Alice Varaldo, Valentina Chiabrando, Giovanna Giacalone",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "BACKGROUND: Due to the increasing market demand for blueberries, the amount of land dedicated to their production is expanding. Therefore, cultivation techniques to ensure high quality and a longer shelf life have become key concerns for the blueberry industry and consumers. OBJECTIVE: This study investigated the impact of various growing environments and pruning techniques on the quality and shelf life of highbush blueberry (Vaccinium corymbosum L. cv. ‘Duke’) during cold storage. METHODS: In this study, six commercial orchards were selected based on the type of pruning (light or hard) and the plot’s altitude (lowland, hill, or mountain). After harvest, the blueberries were stored at 1°C and 90% RH for 21 days. Quality analyses were performed on days 0, 10, and 21 of storage. The data were processed with a factor-designed analysis of variance (one-way ANOVA). RESULTS: Blueberries from the lowland cultivation area with light pruning had a longer shelf life. At harvest, the lowland area had indeed produced firmer blueberries that were sweeter and less acidic, and cold storage positively preserved these characteristics compared to fruit grown at other altitudes. CONCLUSIONS: In summation, the lowland area produced firmer berries that retained their characteristics after 10 days of storage, especially those harvested from hard-pruned plants. Notably, the bioactive compounds were not affected by the pruning method. However, when combined with 10 days of storage, light pruning was associated with better preservation of the total phenol content.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jbr-220067"
    },
    {
        "id": 8439,
        "title": "Efficient Cultivation Techniques of Excellent Local Tree Species, Cyclobalanopsis Glauca",
        "authors": "Tan Ziyou, Xiang Xianjin",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.57237/j.jaf.2023.04.002"
    },
    {
        "id": 8440,
        "title": "Application of the Decision Tree Method to Decision Makin in Using Trucking Services at A Freight Forwarding Company",
        "authors": "Yusup Rachmat Hidayat, Siti Sya’aroh",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "PT. Ricakusuma Lestari Abadi is a company operating in the freight forwarder sector by providing transportation services. Non-optimality and limited fleet capacity causes delivery activities to be inefficient in terms of time and cost. This research aims to determine the application of the decision tree method and determine the correct choice of decision making when using trucking services.\r\nSelecting trucking services using the Decision Tree method is a decision tool that uses a tree-shaped decision model. Meanwhile, for data analysis using the Decision Analysis method and to make it more effective and efficient, Information Technology is used in the form of Quantitative Method (QM) For Windows 5 software.\r\nThe dependent variable in this research is the Decision Tree Method, and the independent variable is decision making. The data used in the research is field research and observation, direct observation at PT. Ricakusuma Lestari Abadi.\r\nThe results of this research produced a minimum yield for Colt Diesel Engkel (CDE) trucks of IDR 270,000 for the Jakarta Area in the AKU trucking category and IDR 382,500 for Bekasi destinations in the ATT trucking category. And the minimum yield on a Colt Diesel Double (CDD) truck is IDR 315,000 for the Jakarta Area with the AKU trucking category and IDR 472,500 for Bekasi with the ATT trucking category.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31334/logistik.v7i2.3243"
    },
    {
        "id": 8441,
        "title": "Exact and Cost-Effective Automated Transformation of Neural Network Controllers to Decision Tree Controllers",
        "authors": "Kevin Chang, Nathan Dahlin, Rahul Jain, Pierluigi Nuzzo",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cdc49753.2023.10383761"
    },
    {
        "id": 8442,
        "title": "Implementasi Algoritma Decision Tree dan Support Vector Machine untuk Klasifikasi Penyakit Kanker Paru",
        "authors": "Dhini Septhya, Kharisma Rahayu, Salsabila Rabbani, Vindi Fitria, Rahmaddeni Rahmaddeni, Yuda Irawan, Regiolina Hayami",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "Kanker paru merupakan satu dari banyaknya penyebab kematian di dunia dengan persentase 11.6%, dengan tingkat kematian hingga 18,4%. Kanker paru merupakan salah satu penyakit yang mematikan karena kanker ini sulit dideteksi sebelum berubah menjadi penyakit yang serius dan saat ini belum ada metode skrining yang efektif untuk deteksi dini kanker paru. Pada penelitian ini dilakukan teknik klasifikasi yang merupakan suatu metode pengelompokkan data yang memiliki karakter yang sama ke dalam beberapa kelompok. Teknik klasifikasi yang diteliti membandingkan 2 algoritma yaitu, algoritma Decision Tree dan Support Vector Machine (SVM) untuk mengetahui algoritma yang memberikan hasil terbaik. Dalam penelitian ini akan dilakukan seleksi fitur menggunakan forward selection yang bertujuan untuk menaikkan nilai akurasi. Berdasarkan penelitian yang telah dilakukan dapatkan hasil dari algoritma SVM menggunakan feature selection mempunyai nilai akurasi yang lebih unggul yaitu 62,3% menggunakan splitting data 80:20.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v3i1.591"
    },
    {
        "id": 8443,
        "title": "Decision-Tree-Computing-Based Usage Intention Prediction of School Social Media",
        "authors": "Huai-Te Huang, Hao-En Chueh",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023038016"
    },
    {
        "id": 8444,
        "title": "Research on classification prediction based on decision tree",
        "authors": "Tao Zhang, Rui Zhou",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00063"
    },
    {
        "id": 8445,
        "title": "On (simple) decision tree rank",
        "authors": "Yogesh Dahiya, Meena Mahajan",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tcs.2023.114177"
    },
    {
        "id": 8446,
        "title": "Decision Tree Ensembles for Automatic Identification of Lithology",
        "authors": "Mahmoud Desouky, Abdullah Alqubalee, Ahmed Gowida",
        "published": "2023-1-19",
        "citations": 0,
        "abstract": "Abstract\nLithology types identification is one of the processes geoscientists rely on to understand the subsurface formations and better evaluate the quality of reservoirs and aquifers. However, direct lithological identification processes usually require more effort and time. Therefore, researchers developed several machine learning models based on well-logging data to avoid challenges associated with direct lithological identification and increase identification accuracy. Nevertheless, high uncertainty and low accuracy are commonly encountered issues due to the heterogeneous nature of lithology types. This work aims to employ decision tree ensemble techniques to predict the lithologies more accurately in time saving and cost-efficient manner, accounting for the uncertainty.\nThis study investigated the real-world well logs dataset from the public Athabasca Oil Sands Database to identify and extract the relevant features. Then, we conducted a thorough training using grid search to optimize the hyperparameters of the ensemble decision tree models. This paper evaluated two ensemble techniques: random forest (RF) and extreme gradient boosting (XGB). We picked metrics such as accuracy, precision, and recall to assess the developed models' performance using 5-fold cross-validation. Finally, we performed a chi-squared test to test our hypothesis of the identical performance of the developed models.\nThe XGB and RF models have 94% and 93% accuracy, respectively. Also, the extreme gradient boost model's weighted average recall and precision of 93% and 93% are only 5% and 4% higher than the RF model. In addition, the chi-squared test resulted in a p-value as low as 0.013, suggesting a low probability of difference in both models' performance. Classification of sand and coal formations is more straightforward than sandy shale and cemented sand. The dataset's low representation of sandy shale and cemented sand can be the reason behind their prediction errors. The developed models can classify the studied field lithologies with an overall accuracy of 94%. In addition, there is no statistically significant evidence of a difference in prediction performance between extreme gradient boost and random forest.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/214460-ms"
    },
    {
        "id": 8447,
        "title": "Light Pollution Assessment Decision Model Based on Entropy Weight Topsis and Decision Tree",
        "authors": "Yuanyuan Deng, Dechen Xing, Ziqi Chen, Yangxi He, Jiabao Gong",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciics59993.2023.10421054"
    },
    {
        "id": 8448,
        "title": "Implementasi Algoritma Decision Tree untuk Rekomendasi Film dan Klasifikasi Rating pada Platform Netflix",
        "authors": "Dimas Aditya Mukhsinin, M Rafliansyah, Sang Adji Ibrahim, Rahmaddeni Rahmaddeni, Denok Wulandari",
        "published": "2024-3-17",
        "citations": 0,
        "abstract": "Sebagai salah satu platform video streaming terbesar di dunia, Netflix telah berkembang pesat sejak pendiriannya pada tahun 1997, awalnya berfokus pada penyewaan DVD, namun kemudian beralih ke layanan streaming online pada tahun 2007. Dengan jutaan pelanggan global, Netflix terus berinovasi dengan paket langganan, produksi konten eksklusif, dan teknologi analisis data serta machine learning untuk meningkatkan pengalaman pengguna. Penelitian ini menerapkan algoritma Decision Tree untuk meningkatkan sistem rekomendasi dan klasifikasi rating di Netflix. Menggunakan dua dataset utama, movies_df dan ratings_df, penelitian melibatkan langkah-langkah pengumpulan dan penggabungan data, penentuan fitur dan variabel target, pembagian data, pelatihan model, serta evaluasi. Hasilnya mencakup evaluasi model Decision Tree dengan metrik akurasi, precision, recall, dan F1-score untuk setiap kategori rating, serta visualisasi grafik batang tentang jumlah rating film dan presentase rating dari 1-5. Rekomendasi film berdasarkan model Decision Tree juga disajikan, memberikan wawasan tentang peningkatan sistem rekomendasi di Netflix. Kesimpulan menunjukkan bahwa implementasi algoritma Decision Tree dapat meningkatkan akurasi rekomendasi film dan klasifikasi rating di Netflix, berkontribusi pada pengalaman pengguna yang lebih personal di era layanan streaming online.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1255"
    },
    {
        "id": 8449,
        "title": "Optimization of Fuzzy Rule Induction Based on Decision Tree and Truth Table: A Case Study of Multi-Class Fault Diagnosis",
        "authors": "Abdelouadoud Kerarmi, Assia Kamal-Idrissi, Amal Seghrouchni",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012378900003636"
    },
    {
        "id": 8450,
        "title": "Optimal Decision Tree with Noisy Outcomes",
        "authors": "Su Jia, Fatemeh Navidi, Viswanath Nagarajan, R. Ravi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4599611"
    },
    {
        "id": 8451,
        "title": "Preparation and physicochemical properties of biochar from the pyrolysis of pruning waste of typical fruit tree in north China",
        "authors": "Xuelei Liu, Xueyong Ren, Jiangchuan Dong, Bowei Wang, Jianli Gao, Ruijiang Wang, Jingjing Yao, Wenbo Cao",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Routine maintenance of fruit trees generates a substantial quantity of pruning waste each year. This waste is potential feedstock for producing energy, materials, and other products. The feasibility of making biochar from the waste via pyrolysis was evaluated. The effects of seven tree species, different pruning sites, and temperature on the pyrolysis process, and the physicochemical properties of the biochar were studied. Pyrolysis of different tree species at 500 °C yielded 27.5 to 33.3% biochar, with a high calorific value (approximately 30 MJ/kg), low ash content (approximately 4%), and capturing up to 60% of the carbon element present. Simultaneously, when the temperature was increased from 400 to 700 °C, the yield of biochar decreased from 35.8% to 24.3%, but the properties improved with the higher heating value rising from 29.2 to 31.3 MJ/kg and the iodine value from 234 to 252 mg/g. The biochar has a good pore structure with a specific surface area of 237 m2/g, total pore volume of 0.175 cm3/g, and average pore size of 2.96 nm. In general, biochar from the pyrolysis of fruitwood pruning waste generated here could be an ideal feedstock to produce high-value-added products, such as solid fuels, activated carbon, and electrode materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15376/biores.18.4.8536-8556"
    },
    {
        "id": 8452,
        "title": "A Multiple Criteria Decision-Making Method Generated by the Space Colonization Algorithm for Automated Pruning Strategies of Trees",
        "authors": "Gang Zhao, Dian Wang",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "The rise of mechanical automation in orchards has sparked research interest in developing robots capable of autonomous tree pruning operations. To achieve accurate pruning outcomes, these robots require robust perception systems that can reconstruct three-dimensional tree characteristics and execute appropriate pruning strategies. Three-dimensional modeling plays a crucial role in enabling accurate pruning outcomes. This paper introduces a specialized tree modeling approach using the space colonization algorithm (SCA) tailored for pruning. The proposed method extends SCA to operate in three-dimensional space, generating comprehensive cherry tree models. The resulting models are exported as normalized point cloud data, serving as the input dataset. Multiple criteria decision analysis is utilized to guide pruning decisions, incorporating various factors such as tree species, tree life cycle stages, and pruning strategies during real-world implementation. The pruning task is transformed into a point cloud neural network segmentation task, identifying the trunks and branches to be pruned. This approach reduces the data acquisition time and labor costs during development. Meanwhile, pruning training in a virtual environment is an application of digital twin technology, which makes it possible to combine the meta-universe with the automated pruning of fruit trees. Experimental results demonstrate superior performance compared to other pruning systems. The overall accuracy is 85%, with mean accuracy and mean Intersection over Union (IoU) values of 0.83 and 0.75. Trunks and branches are successfully segmented with class accuracies of 0.89 and 0.81, respectively, and Intersection over Union (IoU) metrics of 0.79 and 0.72. Compared to using the open-source synthetic tree dataset, this dataset yields 80% of the overall accuracy under the same conditions, which is an improvement of 6%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agriengineering6010033"
    },
    {
        "id": 8453,
        "title": "Decision tree analysis for the management of vesiculobullous lesions",
        "authors": "Swathi K. V., Maragathavalli G.",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "A mucocutaneous condition known as a vesiculobullous lesion is characterized by the presence of fluid-filled vesicles and bullae. Bullae and vesicles typically have different sizes. Bullae have a diameter greater than 5–10 mm, whereas vesicles have a diameter of less than 5–10 mm. Infectious etiologies such herpes simplex, varicella zoster infection, hand, foot, and mouth disease, herpangina, and measles can cause vesiculobullous lesions. Additionally, immunobullous conditions including pemphigus vulgaris, pemphigoid, dermatitis herpetiformis, linear IgA disease, or inherited conditions like epidermolysis bullosa may be to blame. The management of common vesiculobullous disorders is reviewed using a decision tree analysis based on etiopathogenesis, clinical characteristics, and diagnostic criteria. A decision tree has been formulated based on predominantly vesicular and predominantly bullous lesions with specific lesions in each category based on recent scientific evidence. This decision tree will guide the clinicians for effective management of the vesiculobullous lesions in the dental office. The timely recognition and management of these lesions is very essential as they can compromise the quality of life due to their chronicity and frequent recurrence in nature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51248/.v43i4.3017"
    },
    {
        "id": 8454,
        "title": "Decision tree based classification of glass artefact types",
        "authors": "Hai Yu",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "This paper uses logistic regression, SVM, and decision trees in machine learning to analyse 67 data items from question C of the 2022 GCSE Cup National Student Mathematical Modelling Competition. The data were analysed using systematic clustering, the clustering coefficients were analysed, the number of clusters K was further determined by the \"elbow\" method, a clear classification pattern between the glasses was obtained, and a grid search method was used to classify the glasses. The results show that the new excavated glass artefacts have been classified using the \"elbow\" method. The results show that newly excavated glass artefacts are classified by varying PbO content. If the lead oxide (PbO) content is below 5.46%, they are considered high-potassium glasses and vice versa for lead-barium drinks. The content of silica was further used as a boundary to divide the high-potassium glass into two subclasses. Lead-barium glasses are divided into three subclasses using the lead oxide and silica content as the boundary. Using a series of models and algorithms, the classification patterns of different types of glass and their subclasses were clarified, and the results were tested for reasonableness and sensitivity. Such a model can be used to classify newly excavated glass artefacts and can also be modified based on this model for the identification and analysis of other ancient artefacts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v42i.7095"
    },
    {
        "id": 8455,
        "title": "Prediction of Anorexia Risk Based on Decision Tree",
        "authors": "Jinyu Xie",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Anorexia is a kind of eating disorder caused by the cognitive distortions of patients. Under the condition, patients' physical functions can be impaired by extreme weight control behaviors. The prediction of anorexia can help patients with early detection and prediction of the risk of disease, then decrease the damage to the body and the psychological burden. In recent years, machine learning models achieve promising performances in prediction problems. In this paper, after trying on the Adaboost model, Extratree model, and decision tree model, this research decides to use the decision tree model. It is suitable for Boolean-type data classification to do data analysis and hence achieves outstanding performances. By building a decision tree model and referring to the correlation between different features, this research concludes data training. People who have the problem with liver firm and spleen palpable are more likely to gain anorexia. Fatigue and malaise have little relationship with anorexia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jsd81a06"
    },
    {
        "id": 8456,
        "title": "TTTS: Tree Test Time Simulation for Enhancing Decision Tree Robustness against Adversarial Examples",
        "authors": "Seffi Cohen, Ofir Arbili, Yisroel Mirsky, Lior Rokach",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Decision trees are widely used for addressing learning tasks involving tabular data. Yet, they are susceptible to adversarial attacks. In this paper, we present Tree Test Time Simulation (TTTS), a novel inference-time methodology that incorporates Monte Carlo simulations into decision trees to enhance their robustness. TTTS introduces a probabilistic modification to the decision path, without altering the underlying tree structure. Our comprehensive empirical analysis of 50 datasets yields promising results. Without the presence of any attacks, TTTS has successfully improved model performance from an AUC of 0.714 to 0.773. Under the challenging conditions of white-box attacks, TTTS demonstrated its robustness by boosting performance from an AUC of 0.337 to 0.680. Even when subjected to black-box attacks, TTTS maintains high accuracy and enhances the model's performance from an AUC of 0.628 to 0.719. Compared to defenses such as Feature Squeezing, TTTS proves to be much more effective. We also found that TTTS exhibits similar robustness in decision forest settings across different attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i19.30090"
    },
    {
        "id": 8457,
        "title": "Research on the application of decision tree algorithm in private universities",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/jaip.2024.070120"
    },
    {
        "id": 8458,
        "title": "The Application of Improved Decision Tree Algorithm in College Employment Management",
        "authors": "Lin Yin",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asiancon58793.2023.10270643"
    },
    {
        "id": 8459,
        "title": "Lightweighted Shallow CTS Techniques for Checking Clock Tree Synthesizable Paths and Optimizing Clock Tree in RTL Design Time",
        "authors": "Nayoung Kwon, Daejin Park",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictc58733.2023.10393374"
    },
    {
        "id": 8460,
        "title": "Improving Decision Tree Privacy with Bloom Filters",
        "authors": "Sean Lalla, Rongxing Lu, Yunguo Guan, Songnian Zhang",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437649"
    },
    {
        "id": 8461,
        "title": "Systematic Analysis and Application Prospect of Decision Tree",
        "authors": "JunYi Xu",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "Decision making is common practice for everyone. One must make multiple decisions to move on during his/her lifetime. People are always eager to make the optimum decisions so that they could save energy and step in a right path. Although people try to avoid inferior options that comes with risk and danger, things happen from time to time. In this study, a powerful tool, decision tree, will be introduced to address this problem. With assistance of decision tree, one will make better choices more validly and more efficiently. Some concepts and algorithms of decision tree will be also included to understand examples from the application part. The purpose of this study is to introduce the concept of decision tree, analyze the advantages of decision tree and discuss its future. Although decision tree is widely utilized in many aspects in society, it still has shortcomings like overfitting and underfitting. Fortunately, there are methods such as pruning and random forest to solve these problems. The future of decision tree will be promising.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v71i.12687"
    },
    {
        "id": 8462,
        "title": "Analyzing the Impact of Breast Cancer Risk Factors Using Decision Tree Modeling",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/autml.2023.040305"
    },
    {
        "id": 8463,
        "title": "Locally interpretable tree boosting: An application to house price prediction",
        "authors": "Anders Hjort, Ida Scheel, Dag Einar Sommervoll, Johan Pensar",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dss.2023.114106"
    },
    {
        "id": 8464,
        "title": "Financial literacy decision tree game: A system development exposé",
        "authors": "Melany Lotter, Chioma Okoro",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Poor financial literacy has significant economic implications, with limited savings, insufficient retirement provisions and higher dependency on debt. Concerns about the level of financial literacy among the youth or young graduates motivated this study. The study describes the design of a game to educate young graduates while imbibing life-long personal financial management skills. A system development approach was used to present the information. Scenarios and decisions were developed to guide the student (player) in planning and making decisions about their budget with real-life events or cases. The study will be beneficial to university students to transition smoothly into the workforce and take control of their finances. University authorities and stakeholders can also implement the game design to assist students in gaining financial education before venturing into the working world. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4995/head23.2023.16306"
    },
    {
        "id": 8465,
        "title": "Sales Prediction Optimization via Gradient Boosting Decision Tree",
        "authors": "Yutian Shi",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "Sales prediction is always a top priority for brands, effectively reducing unnecessary waste under the essential circumstance that all customers’ needs have been met.  With an efficient prediction model, brands can make accurate inventory decisions and get a significant increase in profit. This paper provides an efficient sales prediction model for cross-border e-commerce companies with Gradient Boosting Decision Tree. We use the sales volume in the past months, their statistical characteristics, difference characteristics and month on month characteristics as the characteristics we choose. We use the Mean Absolute Percentage Error perimeter to compare the accuracy of our method with the Moving Average Method to assess the performance of our model. The results show that our iterative model has higher accuracy compared to the Moving Average Method. It also has a significant edge in both automation and analyzing big-scale data sets, which means that it solves the low feasibility of existing methods. On this basis, we finally conclude that our machine learning model can make great contributions to sales prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v44i.7274"
    },
    {
        "id": 8466,
        "title": "Traffic Accident Severity Prediction Method Based on Decision Tree and Support Vector Machine",
        "authors": "Mengjie Nie, Haipeng Shao",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484869.132"
    },
    {
        "id": 8467,
        "title": "A Decision Tree Based Recommendation System for Tourists",
        "authors": "Raviranjan Kumar Singh, Sushant Raj, Abhishek Bhatterjee",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4482656"
    },
    {
        "id": 8468,
        "title": "The Construction and Application of Library Intelligent Acquisition Decision Model Based on Decision Tree Algorithm",
        "authors": "Hong Pan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150116"
    },
    {
        "id": 8469,
        "title": "Multiagent Decision-Making of Enterprise Debt Restructuring Based on Fuzzy-Set Qualitative Comparative Analysis",
        "authors": "Danyu Zhao, Li Song, Liangliang Han",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "Debt restructuring is an effective means to solve the financial difficulties of enterprises. At present, the operation methods and means of enterprises with different characteristics to participate in debt restructuring are different, and no universal debt restructuring scheme has been formed. In order to solve this problem, this paper uses the method of fuzzy set qualitative comparative analysis. This paper discusses the influence mechanism of multiple concurrent factors on enterprise debt restructuring and summarizes the selection rules of debt restructuring strategies for enterprises with different characteristics of debt. The research shows that there are five kinds of allocation for enterprises to realize debt restructuring. According to the different core conditions, enterprise debt restructuring can be divided into high-quality operation and management mode, technology leading mode, and debt-to-equity mode. The research results reveal the mechanism behind enterprise debt restructuring and provide a reference basis for the government and creditors to make corresponding decisions in the debt restructuring process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/6722707"
    },
    {
        "id": 8470,
        "title": "Data Pruning for Efficient Model Pruning in Neural Machine Translation",
        "authors": "Abdul Azeemi, Ihsan Qazi, Agha Raza",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.18"
    },
    {
        "id": 8471,
        "title": "Comparing Different Sequences of Pruning Algorithms for Hybrid Pruning",
        "authors": "Thaker Pragnesh, Biju R. Mohan",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307846"
    },
    {
        "id": 8472,
        "title": "Citrus yield prediction using deep learning techniques: A combination of field and satellite data",
        "authors": "Abdellatif Moussaid, Sanaa El Fkihi, Yahya Zennayi, Ismail Kassou, François Bourzeix, Ouiam Lahlou, Loubna El Mansouri, Yasmina Imani",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.joitmc.2023.100075"
    },
    {
        "id": 8473,
        "title": "The role of earnings quality and future returns: An illustrative simulation of rational decision model",
        "authors": "Muljanto Siladjaja, Jasman Jasman",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.joitmc.2023.100191"
    },
    {
        "id": 8474,
        "title": "Evaluation of Sustainability for Coal Consumption Using a Multiattribute Decision-Making Model",
        "authors": "Guodang Zhao, Xuyang Guo, Xin Wang, Dezhi Zheng",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "The study of coal consumption has become a focus of academic attention due to ecological and environmental concerns. This study proposed a method to evaluate sustainability for coal consumption by using a multiple-attribute decision-making (MADM) model. The data used are from the China Statistical Yearbook and the China Energy Statistical Yearbook over the years. The MADM model consists of attributes (standards), their importance weights, and alternatives. The comprehensive evaluation system for the sustainability of coal consumption, which was composed of four first-grade indicators including coal strength (CS), energy dependency (ED), social development level (SL), and population size (PS) and their corresponding 20 second-grade indicators, was included in the MADM model as attributes (standards). The importance weight of the attributes was determined by the entropy weight method (EWM) and the analytic hierarchy process (AHP), while the comprehensive evaluation of the sustainability of coal consumption in China over the years was considered as an alternative. The evaluation indices of four first-grade indicators were obtained through multiobjective optimization, and then through the weights and evaluation indices of the four first-grade indicators, multiobjective optimization was carried out for the overall objective of the comprehensive evaluation of the sustainability of coal consumption over the years, and the comprehensive evaluation indices of the sustainable development of coal consumption over the years were obtained. The results show that China’s coal consumption is sustainable, with the composite assessment index rising from 0.058 in 2011 to 0.837 in 2021, an increase of 13.4 times.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/5595688"
    },
    {
        "id": 8475,
        "title": "Study on pruning optimization based on HRank pruning method",
        "authors": "Sheng Lu",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Convolutional neural network (CNN), as one of the most important pillars of deep learning technology, has been paid increased attention to by researchers. However, by the expansion of the application of convolutional neural network, it faces more and more complex problems and more and more diverse situations. In order to solve these problems more appropriately, the number of parameters of convolutional neural networks continuously increases. This limits its potential to be deployed to distal devices with relatively low computing power and memory space. To improve this situation, this paper studies the compression of convolutional neural network model with acceptable sacrifice of accuracy. Based on Pytorch, Resnet-56 on CIFAR-10 is pruned. By using HRank pruning method, convolution kernels of each convolution layers are ordered according to the size of their determinant rank. Through deleting low-rank, less importance convolution kernels and reserving high-rank, more important convolution kernels, the pruning purpose is achieved. By changing the default compression ratio of different convolution layer, more important ones are applied with lower compression rates and less important ones are applied with higher compression rates, the paper achieves higher compression rate with the acceptable loss of accuracy. At the same time, the paper tests the efficiency of pruning under different learning rates. Finally, the paper finds that when the preset compression rate of the intermediate convolutional layer is changed slightly, the accuracy maintains at the level of 92.720% but the compress rate of Params reaches to 44.7% with 0.47M left and the compress rate of Flops reaches 51.1% with 61.39M left. In addition, the paper finds that when the learning rate is 0.05, the learning efficiency reaches its optimum.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230600"
    },
    {
        "id": 8476,
        "title": "Thermal liquefaction of olive tree pruning waste into bio-oil in water and ethanol with NaOH catalyst",
        "authors": "Bulutcem Öcal, Yaşar Kemal Recepoğlu, Aslı Yüksel",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.joei.2024.101533"
    },
    {
        "id": 8477,
        "title": "Tree-Depth and the Formula Complexity of Subgraph Isomorphism",
        "authors": "Deepanshu Kush, Benjamin Rossman",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1137/20m1372925"
    },
    {
        "id": 8478,
        "title": "Effect of pruning and plant growth regulators on Physical development of Ber tree",
        "authors": "Sneha Singh, Bhanu Pratap, Alok Kumar Singh, Viveka Nand Singh, RK Yadav, BP Shahi",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33545/26174693.2024.v8.i3sj.888"
    },
    {
        "id": 8479,
        "title": "Application of ID3 Decision Tree Classification Algorithm in Mathematical data Analysis",
        "authors": "Ping Zang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciics59993.2023.10421137"
    },
    {
        "id": 8480,
        "title": "Application in college practice teaching based on decision tree algorithm",
        "authors": "Qun Liang",
        "published": "2023-2-9",
        "citations": 0,
        "abstract": "When Chinese colleges and universities use information technology to improve management level, the internal system will set a variety of databases, such as employment information, educational administration information and so on. Although the system accumulates a large amount of data and information when it runs for a long time, the lack of information awareness and science and technology leads to the fact that managers can only obtain the surface information through simple statistical operations and cannot dig the hidden value. This paper mainly discusses decision tree algorithm and association rules, clarifies the application demand and teaching evaluation system of university practice teaching in the new era, and finally studies the application effect of decision tree algorithm in university practice teaching combined with practical cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56028/aetr.3.1.1045"
    },
    {
        "id": 8481,
        "title": "Decision Tree Analysis on J48 Algorithm for Data Mining",
        "authors": "Dr.G.Manikanta Dr.G.Manikanta",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46243/jst.2022.v7.i05.pp200-205"
    },
    {
        "id": 8482,
        "title": "Mastering Curling with RL-revised Decision Tree",
        "authors": "Junjie Lin, Yuhao Gong, Jian Zhao, Wengang Zhou, Houqiang Li",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cog57401.2023.10333135"
    },
    {
        "id": 8483,
        "title": "Implementasi Algoritma Decision Tree dan Support Vector Machine (SVM) untuk Prediksi Risiko Stunting pada Keluarga",
        "authors": "Amanda Iksanul Putri, Yulia Syarif, Puguh Jayadi, Fadlan Arrazak, Febi Nur Salisah",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "Kondisi kekurangan gizi kronis yang disebabkan oleh asupan makanan yang tidak mencukupi sebagai akibat dari kebiasaan makan yang tidak tepat sesuai dengan gizi yang diperlukan disebut juga dengan stunting. Stunting dapat membuat fisik anak menjadi lebih pendek, selain itu dapat menghambat pertumbuhan dan perkembangan organ lain seperti ginjal, jantung, dan otak pada anak. Meningkatnya kasus stunting pada anak memerlukan upaya pencegahan secara dini. Pada penelitian ini menggunakan 18 atribut dan 5021 record data dari 10 kelurahan Kota Dumai dimana salah satu diantaranya dijadikan sebagai kelas. Pada penelitian ini menerapkan Algoritma Decision Tree dan Support Vactor Machine (SVM) untuk mengetahui algoritma mana yang tepat memproses data tersebut. Hasil prediksi dengan menggunakan Decision Tree pada penelitian ini mendapatkan nilai akurasi sebesar 96.15%, nilai recall Tidak sebesar  92.06% serta Ya sebesar 97.34% dan nilai presisi Tidak sebesar 90.99% serta Ya sebesar 97.68%. Sedangkan dengan menggunakan Algoritma SVM mendapatkan nilai akurasi sebesar 62.48%, nilai recall Tidak sebesar 99.12% serta Ya sebesar 51.80% dan nilai presisi Tidak sebesar 37.49% serta Ya sebesar 99.51%. Berdasarkan penelitian menggunakan data  tersebut dapat disimpulkan bahwa akurasai algoritma Decision Tree jauh lebih baik dibandingkan dengan algoritma SVM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v3i2.1228"
    },
    {
        "id": 8484,
        "title": "INDENTIFYING CREDIT RISKS IN BANKING DOMAIN USING DECISION TREE ALGORITHM",
        "authors": "",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets-ncascte202223"
    },
    {
        "id": 8485,
        "title": "Analysis and Prediction of College Students' Employment Based on Decision Tree Classification Algorithm",
        "authors": "Zenglu Meng",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10234985"
    },
    {
        "id": 8486,
        "title": "A Conversion Method from IDEF3 to Stochastic Behavior Tree",
        "authors": "Jinhui Huang, Junsong Yin, Shuangshuang Wang",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326659"
    },
    {
        "id": 8487,
        "title": "Dynamic spanning tree game with myopic players",
        "authors": "Zhao Guo, Huaijinhui Xu, Ying Liang, Yin Li",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326914"
    },
    {
        "id": 8488,
        "title": "Construction of Enterprise Marketing Decisions Model Based on Decision Tree Algorithm",
        "authors": "Ran Mei",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00050"
    },
    {
        "id": 8489,
        "title": "Simplifying Complexity: Scenario Reduction Techniques in Stochastic Programming",
        "authors": "Christian Sinaga, Tulus Tulus, Herman Mawengkang",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "Stochastic programming problems arise as mathematical models for optimizing problems under stochastic uncertainty. Computational approaches for solving these models often involve approximating the underlying probability distribution with a probability measure that has finite support. To mitigate the computational complexity associated with increasing the number of scenarios, it may be necessary to reduce their quantity. The scenario  is selected as the first element of supp , and the separable structure is used to determine the second element of supp  while keeping the first element fixed. The process is repeated to establish the remaining indices, and each subsequent scenario is reduced accordingly. This iterative process continues until scenario  is reduced",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i3.12753"
    },
    {
        "id": 8490,
        "title": "Renal failure as a complication of defunctioning ileostomy: more complexity to a complex decision-making process",
        "authors": "Hans Lederhuber",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bjsopen/zrad027"
    },
    {
        "id": 8491,
        "title": "AgreementLoss: A Data Pruning Metric For Stable Performance Over All Pruning Ratio",
        "authors": "Ryota Higashi, Toshikazu Wada",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394435"
    },
    {
        "id": 8492,
        "title": "A Low Complexity Decision Directed Adaptive Receiver for MIMO Communication Systems",
        "authors": "Charan Litchfield",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10252810"
    },
    {
        "id": 8493,
        "title": "Natural Forest Regeneration and Tree Planting Complexity: An Enigma of Climate Mitigation in the World of Technology",
        "authors": "Balongo Vincent",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "Given the severity and implication of prolonged palpability epitomized by Climate change, discussion and negotiation between parties and policy applications for mitigations employed is not 100% solution. The mitigation of carbon emission through tree planting alone is inadequate. There’s need for knowledge on the type of trees, where to plant them, and their impact on the biosphere. Previous study shows that uncensored tree planting programs causes riparian land to dry up. This study lingers on achieving climate change mitigation through afforestation, algae, and technology. It adopts three hypotheses; the first, there’s nothing like global warming or climate change occurring, Secondly, global warming and climate change occurs as natural and cyclic events not related to human activity, Thirdly, global warming and climate change are outcome of mans’ activities. This is a desk top study, the findings indicate that trees are important factors in conserving atmosphere with a balanced biosphere, but not solutions to climate crisis. Thus, certain types of trees cause problems for other plants and animals in their symbiotic nature. Scientists shows that Algae consumes 400x more CO2 hence, investing in them is efficient. Additionally, investing in technology like carbon engineering, direct air capture, and geological sequestration are effective in reducing greenhouse gas emissions from the atmosphere and revolutionize the energy sector. In conclusion, embracing technology and change of human consumer behavior should be the way to go in the contemporary world to mitigate climate issues. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.62049/jkncu.v4i1.53"
    },
    {
        "id": 8494,
        "title": "Penerapan Decision Tree Dengan Algoritma C4.5 Untuk Menentukan Rekomendasi Kenaikan Jabatan Karyawan",
        "authors": "Elmi Devia",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Dalam perencanaan dan usaha untuk memenuhi kebutuhan Sumber Daya Manusia (SDM) dilakukan kenaikan jabatan karyawan yang dikelola secara profesional sehingga dapat menentukan mutu dan kesuksesan perusahaan. Seleksi yang baik dan akurat dari kenaikan jabatan karyawan akan menghasilkan SDM yang berkualitas bagi perusahaan tersebut. Apabila karyawan memliki kemampuan dan kualitas yang baik maka karyawan diberikan nilai baik. Kesalahan dalam memberikan kenaikan jabatan karyawan sangat besar dampaknya bagi perusahaan karena berpengaruh langsung pada produktivitas dan kinerja finansial perusahaan. Tujuan penelitian ini dimana ingin mengetahui bagaimana pelaksanaan penilaian kenaikan jabatan karyawan dengan menggunakan metode Decision Tree algoritma C4.5. Masalah yang diselesaikan adalah cara penentuan rekomendasi kenaikan jabatan karyawan dengan menggunakan data karyawan dengan beberapa indikator kinerja karyawan, yaitu : Kedisiplinan, Kerjasama, Inisiatif, dan Kepemimpinan. Langkah awal penyelesaian masalah penilaian kenaikan jabatan karyawan dengan menggunakan metode decision tree algoritma C4.5 adalah tahap preprocessing data. Langkah kedua yaitu menentukan nilai atribut, dimana dalam data sampel tentukan dulu node terpilih, yaitu dengan menghitung nilai informasi gain masing-masing atribut untuk menentukan node terpilih, gunakan nilai informasi gain yang paling besar. Kemudian akan dilakukan perhitungan nilai entropy dan gain masing-masing atribut. Nilai gain yang tertinggi ada pada atribut Kepemimpinan dengan nilai 0.509185925 maka Kepemimpinan akan menjadi sebuah akar pertama, selanjutnya perhitungan node ke 2 dengan nilai gain tertinggi adalah pada atribut Kedisiplinan yaitu 0.566509507, maka Kedisiplinan akan menjadi akar selanjutnya. Karena  tidak ditemukan nilai tertinggi dari Gain pada atribut Kerjasama dan Inisiatif, sehingga klasifikasi akar terakhir dari pohon keputusan yaitu atribut Kedisiplinan. Langkah ketiga dilakukan pemrosesan decision tree dengan menggunakan software RapidMiner Studio 9.10 dengan metode decision tree. Selanjutnya terbentuk example set, dumana example set adalah data set yang sudah terupload di aplikasi RapidMiner Studio 9.10.  Setelah itu ditampilkan Graph view yang menunjukan hasil dari klasifikasi dengan percabangan yang dapat dihasilkan kesimpulan. Hasil akhir dari decision tree adalah didapatnya aturan-aturan (rules) yang didapat dari hasil pohon keputusan dan deskripsi tree, untuk menganalisa faktor rekomendasi jabatan berdasarkan atribut. Dari hasil percobaan diatas untuk menganalisa faktor rekomendasi kenaikan jabatan maka dapat disimpulkan faktor yang menjadi penyebab utama karyawan di rekomendasikan untuk kenaikan jabatan  adalah Kepemimpinan dan Kedisiplinan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61488/jis.v3i1.257"
    },
    {
        "id": 8495,
        "title": "A Decision Tree of Bioengineering Study and Career Path for Educational Guidance",
        "authors": "Wantana Areeprayolkij, Mengzhen Li",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apsec60848.2023.00066"
    },
    {
        "id": 8496,
        "title": "A combination of DenseNet-264 with alternating decision tree for detecting lung infection",
        "authors": "C. Narmatha",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08971-7"
    },
    {
        "id": 8497,
        "title": "Customer Churn Prediction Based on the Decision Tree and Random Forest Model",
        "authors": "Shiyunyang Zhao",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "The rate at which customers discontinue utilizing a company's services during a predetermined time period is known as the customer churn rate, also known as the attrition rate. Hence, developing a prediction model to predict the potential churn customers will generate an early alert for the company to provide them with better service. This study is divided into two main parts: dealing with a dataset about customer behaviors in a bank and building churn prediction models using machine learning algorithms. The data preprocessing part includes dataset description and some adjustments on original dataset to make it accessible for analysis, including deleting unimportant feature and adjusting feature names. Then the study apportions the modified dataset into train set and test set with an 80-20 split. Next, the study imports two kinds of machine learning algorithms, random forest classifier and decision tree classifier, to build churn prediction models. In each model, the study first performs feature selections and visualizes feature importance in bar graphs. Then the study tests each model on testing set and visualizes model performances using confusion matrices and accuracy scores. The results show that both models get most predictions correct while random forest model has a better performance due to its higher accuracy score of 91%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v44i.4840"
    },
    {
        "id": 8498,
        "title": "Klasifikasi Performa Akademik Siswa Menggunakan Metode Decision Tree dan Naive Bayes",
        "authors": "Abdul Rahman",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "Getting good academic performance is the goal of the learning process carried out by the education office under the auspices of the Ministry of Education and supervised by the government. Governments that want to be successful in educating students should pay attention to their new generation because they are the future successors of the nation. Students of all levels are the benchmark for a country's success.  Therefore, it is necessary to know the student's academic performance from an early age, in order to get special treatment related to the student's learning achievement.  In this study, the academic achievement of students from various levels of education such as elementary, middle, and high schools was tried to be determined by applying various data mining classification methods such as Decision Tree and Naive Bayes. This data grouping is open where the data can be accessed easily and can be used in future research.  The data grouping is divided into 3 categories, namely Low (L), Medium (M) and High (H). From the results of the dataset trial, it shows that the highest classification accuracy is Decision Tree of 83.89% and Naive Bayes of 85.97%. Thus the Naïve Bayes method is more accurate in grouping students' academic performance data.   The results of this study will be used to create a student grouping system based on student learning performance using the appropriate algorithm. So that his contribution later when creating the application system for the formation of study groups can use the Naïve Bayes method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33020/saintekom.v13i1.349"
    },
    {
        "id": 8499,
        "title": "Decision tree based prediction system for word difficulty classification",
        "authors": "Xinyi Jiang",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "In the era of information technology in education, personalised learning is becoming increasingly important, especially in the English learning process. An important aspect of facilitating personalised learning in English reading is the use of a reliable objective word difficulty classification system to quickly capture and understand reading difficulties and core concepts. The aim of this study was to use decision tree modelling to predict the general proficiency of the public in words with different attributes. In addition, a K-Means clustering algorithm was used to categorise words into five classes based on their level of difficulty. By adopting this approach, the prediction of word difficulty becomes both fast and objective, and by testing the accuracy of the model, it was found that our model achieved an accuracy of 0.95. Accurate classification of word difficulty will play an important role in facilitating personalised learning in English reading and improve the efficiency of English reading.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/54/20241498"
    },
    {
        "id": 8500,
        "title": "Forecasting Coal Prices Using Decision Tree Approach",
        "authors": "R. Murugesan, Umesh Shinde",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "Coal is an important fuel in the world's energy systems. Today's world depends heavily on coal. It contributes to 41% of the world's power and acts as a key ingredient in the production process of 90% of cement and 70% of the world's steel. An accurate prediction model for forecasting future coal prices would provide critical information and a timely caution to governments to ensure a steady energy supply. Studies on forecasting coal prices regarding related commodities such as crude oil, iron, natural gas, and paper are rare. Hence, this research aims to forecast coal prices using historical data for the 2013-2016 period. The study uses a decision tree model to anticipate the coal prices, and the impulse response function and variance decomposition are used to show the dynamic connections of coal prices with various variables. The model in predicting coal prices performs well with mean absolute percentage errors of around 5%. The study results will likely enable new insights in providing valuable inputs for all the stakeholders.Keywords: Coal price forecasting, decision tree, prediction",
        "keywords": "",
        "link": "http://dx.doi.org/10.61762/pjmhvol6iss2art25228"
    },
    {
        "id": 8501,
        "title": "Hybrid decision tree-based machine learning models for diabetes prediction",
        "authors": "Efijemue Oghenekome Paul",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54647/isss120327"
    },
    {
        "id": 8502,
        "title": "Comparative Analysis of Hepatitis C Using Decision Tree Classifier and Artificial Neural Network Classifier",
        "authors": "D. Sravanthi, D.J. Rani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The goal of this study is to compare the accuracy, sensitivity, and specificity of a Decision tree classifier and ANN classifier in detecting Innovative Hepatitis C Detection using modern methodologies. Materials and Methods: The data for this study was collected via the kaggle website. Samples were considered as (N=22) for Decision tree and (N=22) for ANN according to clinicalc.com, by keeping alpha error-threshold value 0.05, enrollment ratio as 0.1, 95% confidence interval,G power as 80%, total sample size calculated. The accuracy, sensitivity, and specificity were calculated using MATLAB and a standard data set. Results: Comparison of accuracy, sensitivity, and specificity is done by independent sample t-test SPSS software. There is a statistically insignificant difference between Decision Tree Classifier and Artificial Neural Network Classifiers. The Decision Tree with p=0.003, p<0.05-accuracy (0.41%), p=0.003, p<0.05-sensitivity (0.41%), p=0.570, p>0.05-specificity (0.42%) showed better results in comparison to ANN. Conclusion: Decision Tree showed better accuracy, sensitivity, and specificity than ANN to predict Innovative Hepatitis C Detection in a faster way.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.10171023"
    },
    {
        "id": 8503,
        "title": "Heart Disease Prediction Based on Age Detection using Novel Logistic Regression over Decision Tree",
        "authors": "C.B.M. Karthi, A. Kalaivani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To improve the accuracy in Heart Disease Prediction using Novel Logistic Regression and Decision tree Materials and Methods: This study contains 2 groups i.e Novel Logistic Regression and Decision tree Each group consists of a sample size of 10 and the study parameters include alpha value 0.01, beta value 0.2, and the Gpower value 0.8. Results: The Novel Logistic Regression (91.60) achieved improved accuracy than the Decision Tree (89.42) in Heart Disease Prediction. The statistical significance difference is 0.01 (p<0.05). Conclusion: The Novel Logistic Regression model is significantly better than the Decision Tree in Heart Disease Prediction. It can be also considered as a better option for Heart Disease Prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.17181724"
    },
    {
        "id": 8504,
        "title": "Predicting Heart Disease Risk Factors using Hawkins Dataset and Decision Tree Algorithms",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/6-3-674"
    }
]