[
    {
        "id": 9860,
        "title": "Text Genre Detection Using Doc2Vec Word-embedding Language Model",
        "authors": "Dongsung Kim",
        "published": "2019-7-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29403/li.23.2.2"
    },
    {
        "id": 9861,
        "title": "Research on Emotional Tendency of Microblog Comments Based on Doc2vec",
        "authors": "荟珍 李",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/aam.2022.111034"
    },
    {
        "id": 9862,
        "title": "Topic recommendation using Doc2Vec",
        "authors": "Petros Karvelis, Dimitris Gavrilis, George Georgoulas, Chrysostomos Stylios",
        "published": "2018-7",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489513"
    },
    {
        "id": 9863,
        "title": "Implementasi Doc2Vec untuk rekomendasi penginapan di Bali",
        "authors": "Nyoman Purnama",
        "published": "2021-11-15",
        "citations": 1,
        "abstract": "Dengan semakin menjamurnya hunian berupa villa di Bali, memberikan pilihan yang beragam bagi para wisatawan yang akan menginap di Bali. Berbagai macam pilihan yang ada seringkali membingungkan wisatawan untuk memilih penginapan sesuai dengan kriteria yang diinginkan. Informasi yang tersedia di internet pun sangat beragam dengan jumlah tak terbatas. Apalagi dengan layanan pemesanan online yang juga banyak bertebaran di internet, wisatawan seringkali harus mengunjungi situs-situs ini satu persatu. Rekomendasi penginapan secara otomatis sangat diperlukan untuk membantu wisatawan dalam mempersempit pilihannya dalam mencari penginapan. Maka pada penelitian ini dibangun sebuah system rekomendasi menggunakan algoritma doc2Vec. Doc2Vec merupakan algoritma pembelajaran tidak terawasi yang akan mengubah dokumen menjadi vektor. Sistem rekomendasi ini dikembangkan menggunakan Bahasa python. Dataset yang digunakan merupakan deskripsi kumpulan villa yang tersebar diseluruh Bali yang berasal dari salah satu agen penyewaaan villa. Dari hasil penelitian yang telah dilaksanakan terbukti algoritma doc2vec memberikan hasil rekomendasi terbaik berdasarkan kueri yang diminta oleh pengguna. Dimana metode PV-DM memberikan hasil yang lebih baik jika dibandingkan metode PV-DBOW dengan tingkat kemiripan rata-rata diatas 60%.",
        "link": "http://dx.doi.org/10.54367/jtiust.v6i2.1453"
    },
    {
        "id": 9864,
        "title": "Enhancing automatic plagiarism detection: Using Doc2vec model",
        "authors": "Imene Setha, Hassina Aliane",
        "published": "2022-9-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaase56196.2022.9931542"
    },
    {
        "id": 9865,
        "title": "Sentiment analysis on Twitter data with semi-supervised Doc2Vec",
        "authors": "Metin Bilgin, Izzet Fatih Senturk",
        "published": "2017-10",
        "citations": 36,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmk.2017.8093492"
    },
    {
        "id": 9866,
        "title": "Classification of Turkish E-Mails with Doc2Vec",
        "authors": "Emre Deniz, Hasan Erbay, Mustafa Cosar",
        "published": "2019-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmyk48245.2019.8965640"
    },
    {
        "id": 9867,
        "title": "Design Pattern Recommendation Using Doc2vec",
        "authors": "Nada Shorim, Mohammad El-Ramly, Hanaa Mobarz",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicis58388.2023.10391121"
    },
    {
        "id": 9868,
        "title": "Kötücül Web Sayfalarının Tespitinde Doc2Vec Modeli ve Makine Öğrenmesi Yaklaşımı",
        "authors": "Recep Sinan ARSLAN",
        "published": "2021-10-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31590/ejosat.981450"
    },
    {
        "id": 9869,
        "title": "Retro-Remote Sensing With Doc2Vec Encoding",
        "authors": "Mesay Belete Bejiga, Genc Hoxha, Farid Melgani",
        "published": "2020-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/m2garss47143.2020.9105139"
    },
    {
        "id": 9870,
        "title": "Sentiment analysis via Doc2Vec and Convolutional Neural Network hybrids",
        "authors": "Bhaskar Dhariyal, Vadlamani Ravi, Kumar Ravi",
        "published": "2018-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci.2018.8628833"
    },
    {
        "id": 9871,
        "title": "Poem Generation using Transformers and Doc2Vec Embeddings",
        "authors": "Marvin C. Santillan, Arnulfo P. Azcarraga",
        "published": "2020-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207442"
    },
    {
        "id": 9872,
        "title": "Chinese Text Keyword Extraction Based on Doc2vec And TextRank",
        "authors": "Wei Wang, Xiangshun Li, Sheng Yu",
        "published": "2020-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccdc49329.2020.9164788"
    },
    {
        "id": 9873,
        "title": "Classification of Customer Demands by Using Doc2Vec Feaure Extraction Method",
        "authors": "Halil Arslan, Oğuz Kaynar, Sümeyye Şahİn",
        "published": "2019-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu.2019.8806452"
    },
    {
        "id": 9874,
        "title": "Hoax Identification on Tweets in Indonesia Using Doc2Vec",
        "authors": "Titi Widaretna, Jimmy Tirtawangsa, Ade Romadhony",
        "published": "2021-8-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoict52021.2021.9527515"
    },
    {
        "id": 9875,
        "title": "An Attempt to Read Network Traffic with Doc2vec",
        "authors": "Mamoru Mimura",
        "published": "2019",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2197/ipsjjip.27.711"
    },
    {
        "id": 9876,
        "title": "Filtering Malicious JavaScript Code with Doc2Vec on an Imbalanced Dataset",
        "authors": "Mamoru Mimura, Yuya Suga",
        "published": "2019-8",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/asiajcis.2019.000-9"
    },
    {
        "id": 9877,
        "title": "Long-Term Performance of a Generic Intrusion Detection Method Using Doc2vec",
        "authors": "Mamoru Mimura, Hidema Tanaka",
        "published": "2017-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/candar.2017.109"
    },
    {
        "id": 9878,
        "title": "Multilingual Inappropriate Text Content Detection System Based on Doc2vec",
        "authors": "Kazuki Aikawa, Shin Kawai, Hajime Nobuhara",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gcce46687.2019.9015579"
    },
    {
        "id": 9879,
        "title": "Training Doc2Vec on a Corpus of Persian Poems to Answer Thematic Similarity Multiple-Choice Questions",
        "authors": "Soroosh Akef, Mohammad Hadi Bokaei, Hossein Sameti",
        "published": "2020-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ist50524.2020.9345918"
    },
    {
        "id": 9880,
        "title": "Vehicle Trajectory Clustering in Urban Road Network Environment Based on Doc2Vec Model",
        "authors": "Jun Kang, Haosen Ma, Zongtao Duan, Haojian He",
        "published": "2021-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534341"
    },
    {
        "id": 9881,
        "title": "A Method for Selecting Training Data Using Doc2Vec for Automatic Test Cases Generation",
        "authors": "Yuto Fujita, Kiyoshi Ueda",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444275"
    },
    {
        "id": 9882,
        "title": "Deep Learning Based Classification Using Academic Studies in Doc2Vec Model",
        "authors": "Yaşar Safali, Gözde Nergız, Erdinç Avaroğlu, Emre Doğan",
        "published": "2019-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/idap.2019.8875877"
    },
    {
        "id": 9883,
        "title": "Retrieval of Semantically Similar Philippine Supreme Court Case Decisions using Doc2Vec",
        "authors": "Lorenz Timothy Barco Ranera, Geoffrey A. Solano, Nathaniel Oco",
        "published": "2019-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ismac.2019.8836165"
    },
    {
        "id": 9884,
        "title": "Using Collaborative Filtering Algorithms Combined with Doc2Vec for Movie Recommendation",
        "authors": "Gaojun Liu, Xingyu Wu",
        "published": "2019-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itnec.2019.8729076"
    },
    {
        "id": 9885,
        "title": "Semi-supervised Turkish Text Categorization with Word2Vec, Doc2Vec and FastText Algorithms",
        "authors": "Hakkı Yağız Erdinҫ, Aysun Güran",
        "published": "2019-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu.2019.8806539"
    },
    {
        "id": 9886,
        "title": "Code clone detection based on Doc2vec model and Bagging",
        "authors": "Jun Huang",
        "published": "2022-6-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3548608.3559280"
    },
    {
        "id": 9887,
        "title": "Fake News Detection by Using Doc2Vec Representation Model and Various Classification Algorithms",
        "authors": "D. Janakieva, G. Mirceva, S. Gievska",
        "published": "2021-9-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/mipro52101.2021.9596928"
    },
    {
        "id": 9888,
        "title": "An approach for recommending relevant articles in news portal based on Doc2Vec",
        "authors": "Bogdan Walek, Patrik Muller",
        "published": "2022-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aike55402.2022.00010"
    },
    {
        "id": 9889,
        "title": "Processing-in-Memory Development Strategy for AI Computing Using Main-Path and Doc2Vec Analyses",
        "authors": "Euiyoung Chung, So Young Sohn",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "Processing-in-Memory (PiM), which combines a memory device with a Processing Unit (PU) into an integrated chip, has drawn special attention in the field of Artificial Intelligence semiconductors. Currently, in the development and commercialization of PiM’s technology, there are challenges in the hegemony competition between the PU and memory device industries. In addition, there are challenges in finding strategic partnerships rather than independent development due to the complexity of technological development caused by heterogeneous chips. In this study, patent Main Path Analysis (MPA) is used to identify the majority and complementary groups between PU and memory devices for PiM. Subsequently, Document-to-Vector (Doc2Vec) and similarity-scoring analyses are used to determine the potential partners for technical cooperation required for PiM technology development for the majority group identified. According to the empirical results, PiM core technology is evolving from PU to memory device with an ‘architecture-operation-architecture’ design pattern. The ten ASIC candidates are identified for strategic partnerships with memory device suppliers. Those partnership candidates include several mobile AP firms, implying PiM’s opportunities in the field of mobile applications. It suggests that memory device suppliers should prepare for different technology strategies for PiM technology development. This study contributes to the literature and high-tech industry via the proposed quantitative technology partnership model.",
        "link": "http://dx.doi.org/10.3390/su151612439"
    },
    {
        "id": 9890,
        "title": "Keyphrase Extraction on Covid-19 Tweets Based on Doc2Vec and YAKE",
        "authors": "Fahri Firdausillah, Erika Devi Udayanti",
        "published": "2021-5-10",
        "citations": 1,
        "abstract": "Keyword and keyphrase extraction are one of the initial foundations for performing several text processing operations such as summarization and document clustering. YAKE is one of the techniques used for unsupervised and independent keyphrase extraction, it does not require a corpus for linguistic tools such as NER and POS-tag. However, the use of YAKE in microblogging documents such as Twitter often results in a keyphrase that is less representative because of the lack of words used for ranking. This paper offers a solution to this problem by looking for similar tweets in the keyphrase extraction process using Doc2Vec so that the number of words used in the YAKE ranking process can be greater. Covid-19 tweets related are used as dataset as the topic is currently widely discussed on social media to prove that the proposed approach could improve keyphrase extraction performance",
        "link": "http://dx.doi.org/10.33633/jais.v6i1.4454"
    },
    {
        "id": 9891,
        "title": "TF-IDF ve Doc2Vec Tabanlı Türkçe Metin Sınıflandırma Sisteminin Başarım Değerinin Ardışık Kelime Grubu Tespiti ile Arttırılması",
        "authors": "Aysun GÜRAN, Doğancan KINIK",
        "published": "2021-1-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31590/ejosat.774144"
    },
    {
        "id": 9892,
        "title": "Similarity Judgment of Civil Aviation Regulations Based on Doc2Vec Deep Learning Algorithm",
        "authors": "Haoyang Zhang, Liang Zhou",
        "published": "2019-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cisp-bmei48845.2019.8965709"
    },
    {
        "id": 9893,
        "title": "Efficiency of SVM classifier with Word2Vec and Doc2Vec models",
        "authors": "Maria Mihaela Truşcă",
        "published": "2019-10-1",
        "citations": 6,
        "abstract": "Abstract\nSupport Vector Machine model is one of the most intensive used text data classifiers ever since the moment of its development. However, its performance depends not only on its features but also on data preprocessing and model tuning. The main purpose of this paper is to compare the efficiency of more Support Vector Machine models using both TF-IDF approach and Word2Vec and Doc2Vec neural networks for text data representation. Besides the data vectorization process, I try to enhance the models’ efficiency by identifying which kind of kernel fits better the data or if it is just better to opt for the linear case. My results prove that for the “Reuters 21578” dataset, nonlinear Support Vector Machine is more efficient when the conversion of text data into numerical attributes is realized using Word2Vec models instead of TF-IDF and Doc2Vec representations. When it is considered that data meet linear separability requirements, TF-IDF representation outperforms all other options. Surprisingly, Doc2Vec models have the lowest performance and only in terms of computational cost they provide satisfactory results. This paper proves that while Word2Vec models are truly efficient for text data representation, Doc2Vec neural networks are unable to exceed even TF-IDF index representation. This evidence contradicts the common idea according to which Doc2Vec models should provide a better insight into the training data domain than Word2Vec models and certainly than the TF-IDF index.",
        "link": "http://dx.doi.org/10.2478/icas-2019-0043"
    },
    {
        "id": 9894,
        "title": "Software Vulnerability Detection via Doc2vec with path representations",
        "authors": "Tong Wan, Lu Lu, Hao Xu, Quanyi Zou",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/qrs-c60940.2023.00078"
    },
    {
        "id": 9895,
        "title": "Automatic Text-to-sound Generation by Doc2Vec",
        "authors": "Kakeru Iwamoto, Hironori Uchida, Yujie Li, Yoshihisa Nakatoh",
        "published": "2023",
        "citations": 0,
        "abstract": "Nowadays, the market size for games and video viewing services has been\n                        expanding. The demand for sound effects to produce content using these\n                        services is also rising. However, sound-effect production often requires\n                        expensive software or hardware, exceptional equipment use, and experience.\n                        Therefore, this study aims to reduce the cost of sound effects production\n                        and enable the output of sound effects as imagined. It examines a method for\n                        automatically generating sound effects based on text input using Doc2Vec.\n                        The Natural Language Processing Model (NLP) calculates the similarity\n                        between the input text and the labels in the dataset. The Natural Language\n                        Processing Model (NLP) is created by Doc2Vec pre-loading sound-related\n                        language expressions (labels). The model is pre-trained using labels from\n                        VGG-Sound data. The calculated highly similar sounds are downloaded from\n                        VGG-Sound, a specified number of sound datasets. The data downloaded from\n                        highly similar data is synthesized in similarity order, and the audio is\n                        output.Furthermore, we verify the correlation between the sentences used in\n                        the proposed method and the generated sound effects. We conducted an\n                        experiment in which we presented the generated sounds and the sentences used\n                        to create them and had the participants rate them on a 5-point scale. The\n                        sentences used for a generation are those that live in the dataset, those\n                        that lived in a small number in the data set, those that did not exist in\n                        the data collection, those to which information such as location or scene\n                        has been added, and those that contain multiple events. The results show\n                        that the more speech in the dataset, the higher the rating and that\n                        sentences with added information or numerous events produce lower ratings.",
        "link": "http://dx.doi.org/10.54941/ahfe1004033"
    },
    {
        "id": 9896,
        "title": "CLASSIFICAÇÃO DE DOCUMENTOS DE PATENTES USANDO O DOC2VEC",
        "authors": "Tamara Aguiar Tavares Mascarenhas, Alberto Willian Mascarenhas, Andreia Gentil Bonfante",
        "published": "2021",
        "citations": 0,
        "abstract": "As patentes são consideradas fontes extremamente úteis para atividades relacionadas à busca e análise de informações e para a geração de novos conhecimentos. Neste artigo, usamos um algoritmo de vetor de parágrafo doc2vec, uma extensão do word2vec, que aprende representações de frases em um documento, em um esquema de aprendizagem profunda supervisionada para a classificação automática de patentes. A classificação foi realizada em documentos com resumos de patentes em inglês, em um processo hierárquico que compreende seções, classes, subclasses, de acordo com a Classificação Internacional de Patentes (IPC). Os testes foram desenvolvidos em quatro etapas, necessária, devido ao grande número de classes e subclasses, com o objetivo de identificar códigos IPC primário ou secundários, caso esteja associado a um conjunto de classificações relacionadas a outros aspectos expressos na patente. Os testes apresentaram resultados bastante promissores na classificação de patentes. Os próximos passos serão produzir avaliações qualitativas e compará-las com outros modelos de aprendizagem de máquina presentes na literatura.",
        "link": "http://dx.doi.org/10.37885/210404151"
    },
    {
        "id": 9897,
        "title": "Doc2Vec-based Approach for Extracting Diverse Evaluation Expressions from Online Review Data",
        "authors": "Kosuke Kurihara, Yoshiyuki Shoji, Sumio Fujita, Martin J. Durst",
        "published": "2022-11",
        "citations": 0,
        "abstract": "This paper proposes a method for extracting diverse expressions from online movie review texts for a given keyword query. When people watch a movie that makes them cry, they generally do not say ``I cried.'' Instead, they use such euphemistic language as ``I needed a handkerchief'' or ``My makeup was running.''To enable information retrieval based on audience reactions such as ``movies that make me cry'' using review texts, various paraphrased expressions must be collected for arbitrary queries. Our proposed method extracts such expressions from review datasets by applying two extensions to Doc2Vec: 1) it changes the granularity of the training sentences to mitigate a lack of context, and 2) it applies query expansion for similarity calculation in advance.We conducted a large-scale crowdsourcing experiment with 1.29 million actual sentences taken from Yahoo! Movies, Japan. The experimental result revealed that changing the training data granularity and adding the query expansion effectively collect more diverse expressions that have a meaning similar to the given query.",
        "link": "http://dx.doi.org/10.26421/jdi3.4-3"
    },
    {
        "id": 9898,
        "title": "Doc2vec-based link prediction approach using SAO structures: application to patent network",
        "authors": "Byungun Yoon, Songhee Kim, Sunhye Kim, Hyeonju Seol",
        "published": "2022-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11192-021-04187-4"
    },
    {
        "id": 9899,
        "title": "Identification of Cybersecurity Specific Content Using the Doc2Vec Language Model",
        "authors": "Otgonpurev Mendsaikhan, Hirokazu Hasegawa, Yukiko Yamaguchi, Hajime Shimada",
        "published": "2019-7",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/compsac.2019.00064"
    },
    {
        "id": 9900,
        "title": "Cyberbullying Detection on Indonesian Twitter using Doc2Vec and Convolutional Neural Network",
        "authors": "Shindy Trimaria Laxmi, Rita Rismala, Hani Nurrahmi",
        "published": "2021-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoict52021.2021.9527420"
    },
    {
        "id": 9901,
        "title": "Mining Stack Overflow for API class recommendation using DOC2VEC and LDA",
        "authors": "Wai Keat Lee, Moon Ting Su",
        "published": "2021-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/sfw2.12023"
    },
    {
        "id": 9902,
        "title": "Neural Network Doc2vec in Automated Sentiment Analysis for Short Informal Texts",
        "authors": "Natalia Maslova, Vsevolod Potapov",
        "published": "2017",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-66429-3_54"
    },
    {
        "id": 9903,
        "title": "Specialists, Scientists, and Sentiments: Word2Vec and Doc2Vec in Analysis of Scientific and Medical Texts",
        "authors": "Qufei Chen, Marina Sokolova",
        "published": "2021-9",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s42979-021-00807-1"
    },
    {
        "id": 9904,
        "title": "A Doc2Vec-Based Assessment of Comments and Its Application to Change-Prone Method Analysis",
        "authors": "Hirohisa Aman, Sousuke Amasaki, Tomoyuki Yokogawa, Minoru Kawahara",
        "published": "2018-12",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/apsec.2018.00082"
    },
    {
        "id": 9905,
        "title": "Sentiment Analysis on Chinese Hotel Reviews with Doc2Vec and Classifiers",
        "authors": "Qianjun Shuai, Yamei Huang, Libiao Jin, Long Pang",
        "published": "2018-10",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iaeac.2018.8577581"
    },
    {
        "id": 9906,
        "title": "A Link Prediction Strategy for Personalized Tweet Recommendation through Doc2Vec Approach",
        "authors": "Mojtaba Zahedi Amiri, Abdullah Shobi",
        "published": "2017-7-18",
        "citations": 3,
        "abstract": "<p><em>Nowadays with growth of using Internet as a principle way of communication, likes different social medias channels (Twitter,</em><em> </em><em>Facebook,</em><em> </em><em>etc</em><em>.</em><em>) and also access to huge amount of information like News, there appear a main research subject to help users to find his/her interests among vast amount of relevant and irrelevant information. Recommender systems are helped to handle information overload problem and in this paper we introduce our Tweet Recommendation System that implement user</em><em>’</em><em>s Twitter information (Tweets, Retweet, Like,...) as a source of user’s information. In this work the semantic of tweets that regard as a User’s Explicit Interests</em><em> </em><em>(e.g.</em><em>,</em><em> person, events, product mentioned in user’s tweets) are identified with the Doc2vec approach and recommend similar tweets through link-prediction strategy. The experiment results show that Doc2Vec approach is a</em><em> </em><em>better approach than the other previous approaches.</em></p>",
        "link": "http://dx.doi.org/10.22158/rem.v2n4p63"
    },
    {
        "id": 9907,
        "title": "Bangla News Recommendation Using doc2vec",
        "authors": "Rabindra Nath Nandi, M.M. Arefin Zaman, Tareq Al Muntasir, Sakhawat Hosain Sumit, Tanvir Sourov, Md. Jamil-Ur Rahman",
        "published": "2018-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbslp.2018.8554679"
    },
    {
        "id": 9908,
        "title": "Web services classification via combining Doc2Vec and LINE model",
        "authors": "Hongfan Ye, Buqing Cao, Jinkun Geng, Yiping Wen",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijcse.2020.111433"
    },
    {
        "id": 9909,
        "title": "Using K-Means Clustering Method with Doc2Vec to Understand the Twitter Users’ Opinions on COVID-19 Vaccination",
        "authors": "Guanjin Wang, Stephen Wai Hang Kwok",
        "published": "2021-7-27",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bhi50953.2021.9508578"
    },
    {
        "id": 9910,
        "title": "Comparison of Word2vec and Doc2vec Methods for Text Classification of Product Reviews",
        "authors": "Ivan Rifky Hendrawan, Ema Utami, Anggit Dwi Hartanto",
        "published": "2022-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitisee57756.2022.10057702"
    },
    {
        "id": 9911,
        "title": "Deep Learning-Based Classification of News Texts Using Doc2Vec Model",
        "authors": "Hasibe Busra Dogru, Sahra Tilki, Akhtar Jamil, Alaa Ali Hameed",
        "published": "2021-4-6",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/caida51941.2021.9425290"
    },
    {
        "id": 9912,
        "title": "Automated Functional Dependency Detection Between Test Cases Using Doc2Vec and Clustering",
        "authors": "Sahar Tahvili, Leo Hatvani, Michael Felderer, Wasif Afzal, Markus Bohlin",
        "published": "2019-4",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aitest.2019.00-13"
    },
    {
        "id": 9913,
        "title": "Web services classification via combining Doc2Vec and LINE model",
        "authors": "Yiping Wen, Hongfan Ye, Jinkun Geng, Buqing Cao",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijcse.2020.10033508"
    },
    {
        "id": 9914,
        "title": "An approach to estimating cited sentences in academic papers using Doc2vec",
        "authors": "Shunsuke Tanabe, Manabu Ohta, Atsuhiro Takasu, Jun Adachi",
        "published": "2018-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3281375.3281391"
    },
    {
        "id": 9915,
        "title": "The Impact of Applying Different Pre-Processing Techniques on Swahili Textual Data Using Doc2Vec",
        "authors": "Bernard Masua, Noel Masasi, Hellen Maziku, Betty Mbwilo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.55060/j.nlpre.230606.001"
    },
    {
        "id": 9916,
        "title": "Doc2Vec-based Approach for Extracting Diverse Evaluation Expressions from Online Review Data",
        "authors": "Kosuke Kurihara, Yoshiyuki Shoji, Sumio Fujita, Martin J. Dürst",
        "published": "2021-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3487664.3487773"
    },
    {
        "id": 9917,
        "title": "Multilabel Text Classification Menggunakan SVM dan Doc2Vec Classification Pada Dokumen Berita Bahasa Indonesia",
        "authors": "Kristian Indradiarta Gunawan, Joan Santoso",
        "published": "2021-4-7",
        "citations": 2,
        "abstract": "Seiring dengan berkembangnya informasi yang ada di sekitar dengan pesat, maka jenis informasi yang ada pun menjadi sangat bervariasi dan sangat banyak jumlahnya, dan akan semakin terus bertambah. Dengan kondisi tersebut, kita akan mengalami kesulitan untuk mengenali jenis dari informasi tersebut satu persatu. Oleh karena itu dengan adanya proses klasifikasi teks dan dokumen sangatlah membantu untuk memilah dan mengenali informasi-informasi apa saja yang ada, baik informasi yang lama maupun informasi yang baru dan belum pernah ditemui sebelumnya. Bertujuan untuk dapat mengidentifikasi dan mengklasifikasikan dokumen-dokumen berita dalam bahasa Indonesia ke dalam beberapa kategori sekaligus, maka dibuatlah sebuah penelitian berupa sistem untuk menangani klasifikasi dokumen teks dalam bahasa Indonesia. Sistem tersebut akan memproses berita-berita yang diberikan, dan kemudian akan memberikan 2 kategori yang paling mendekati terhadap isi dari berita tersebut. Sistem dibuat dengan menggunakan Python, memanfaatkan Doc2Vec untuk mengambil fitur dataset, dan SVM untuk melakukan klasifikasi terhadap banyak kelas. Dataset yang digunakan adalah kumpulan dokumen berupa berita-berita yang diperoleh dari CNN Indonesia tahun 2016-2017, dan terbagi dalam 5 kategori berita utama, yaitu: Politik, Ekonomi, Teknologi, Olahraga, dan Hiburan. Dikarenakan sedikitnya literatur untuk klasifikasi text dalam bahasa Indonesia, maka pada penelitian ini hanya menargetkan akurasi sebesar 70% saja. Namun dari hasil ujicoba, akurasi yang diperoleh melebihi 90%. Hasil prediksi untuk kelas dokumen pun memiliki tingkat keberhasilan yang tinggi. Dengan penggunaan dataset dan penanganan preprocessing yang tepat untuk dokumen bahasa Indonesia, maka hasil yang dicapai bisa lebih bagus dan akurat.",
        "link": "http://dx.doi.org/10.37823/insight.v3i01.126"
    },
    {
        "id": 9918,
        "title": "Unsupervised News Topic Modelling with Doc2Vec and Spherical Clustering",
        "authors": "Arif Budiarto, Reza Rahutomo, Hendra Novyantara Putra, Tjeng Wawan Cenggoro, Muhamad Fitra Kacamarga, Bens Pardamean",
        "published": "2021",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2020.12.007"
    },
    {
        "id": 9919,
        "title": "Automated approach to semantic search through software documentation based on Doc2Vec algorithm",
        "authors": "Artem Kovalev, Igor Nikiforov, Pavel Drobintsev",
        "published": "2021-3-3",
        "citations": 2,
        "abstract": "Introduction: An important stage in a software development life cycle is the support phase, when customers can contact the support service of the supplier company and request a solution to an issue encountered in the software. To solve the request, engineers often have to refer to the relevant documentation. In order to reduce the complexity of the maintenance phase, the search for the necessary documentation pages can be automated. Purpose: Development of an approach to semantic search through documentation using Doc2Vec machine learning algorithm in order to automate the solution of customer requests. Results: An approach is proposed to semantic search through text documentation files and wiki pages using Doc2Vec machine learning algorithm. The documentation pages with semantic similarities to the textual description of an unresolved customer request help the engineer to process the request more efficiently and rapidly. Based on the proposed approach, a software tool has been developed which provides the engineer with a report containing links to documentation pages semantically related to the unresolved request. During the configuration of this tool, the optimal parameters of the Doc2Vec algorithm were found, providing the necessary quality of the semantic search. The idea of the experiment was to apply the tool to unresolved requests and evaluate its effectiveness. The developed approach and software tool were successfully tested in an open source Apache Kafka project. In the course of the experiment, 100 requests from Jira bug tracking system were downloaded and analyzed. The experimental results show the advantage of using the tool in software product support. The average documentation analysis time has been reduced as compared to the traditional manual approach. Practical relevance: The research results were used to solve real customer requests. The developed approach and the software implemented on its basis can reduce the complexity of the maintenance phase.",
        "link": "http://dx.doi.org/10.31799/1684-8853-2021-1-17-27"
    },
    {
        "id": 9920,
        "title": "S-464 Automated Occupational Encoding to the Canadian National Occupation Classification using an Ensemble Classifier from TF-IDF and Doc2Vec Embeddings",
        "authors": "Cesar Augusto Suarez Garcia, Anil Adisesh, Christopher JO Baker",
        "published": "2021-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1136/oem-2021-epi.442"
    },
    {
        "id": 9921,
        "title": "A Detection Method for Phishing Web Page Using DOM-Based Doc2Vec Model",
        "authors": "Jian Feng, Ying Zhang, Yuqiang Qiao",
        "published": "2020-7-10",
        "citations": 3,
        "abstract": "Detecting phishing web pages is a challenging task. The existing detection method for phishing web page based on DOM (Document Object Model) is mainly aiming at obtaining structural characteristics but ignores the overall representation of web pages and the semantic information that HTML tags may have. This paper regards DOMs as a natural language with Doc2Vec model and learns the structural semantics automatically to detect phishing web pages. Firstly, the DOM structure of the obtained web page is parsed to construct the DOM tree, then the Doc2Vec model is used to vectorize the DOM tree, and to measure the semantic similarity in web pages by the distance between different DOM vectors. Finally, the hierarchical clustering method is used to implement clustering of web pages. Experiments show that the method proposed in the paper achieves higher recall and precision for phishing classification, compared to DOM-based structural clustering method and TF-IDF-based semantic clustering method. The result shows that using Paragraph Vector is effective on DOM in a linguistic approach.",
        "link": "http://dx.doi.org/10.20532/cit.2020.1004899"
    },
    {
        "id": 9922,
        "title": "Off-topic Detection Model based on Biterm-LDA and Doc2vec",
        "authors": "Pan Liu, Jie Liu, Xiaoli Ma, Jianshe Zhou",
        "published": "2019-6-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3341069.3342989"
    },
    {
        "id": 9923,
        "title": "CLASSIFICAÇÃO DE DOCUMENTOS DE PATENTES USANDO O DOC2VEC",
        "authors": " Tamara Aguiar Tavares Mascaremhas,  Andreia Gentil Bonfante,  Alberto Willian Mascarenhas",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20906/cps/cba2018-0986"
    },
    {
        "id": 9924,
        "title": "Corporate character and job satisfaction: Using Doc2Vec",
        "authors": "Byungdae An, Dongwon Shin, Hanjun Lee",
        "published": "2022-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7465/jkdi.2022.33.2.195"
    },
    {
        "id": 9925,
        "title": "Semantic Detection of Targeted Attacks Using DOC2VEC Embedding",
        "authors": "Mariam S. El-Rahmany, Ensaf Hussein Mohamed, Mohamed H. Haggag",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24138/jcomss-2021-0113"
    },
    {
        "id": 9926,
        "title": "Doc2Vec, SBERT, InferSent, and USE Which embedding technique for noun phrases?",
        "authors": "Lahbib Ajallouda, Kawtar Najmani, Ahmed Zellou, El habib Benlahmar",
        "published": "2022-3-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iraset52964.2022.9738300"
    },
    {
        "id": 9927,
        "title": "Who is the Ringleader? Modelling Influence in Discourse using Doc2Vec",
        "authors": "Priyank Vyas, Tony Smith, Philip Feldman, Aaron Dant, Andreea Calude, Panos Patros",
        "published": "2021-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/acsos-c52956.2021.00074"
    },
    {
        "id": 9928,
        "title": "News Classification from Social Media Using Twitter-based Doc2Vec Model and Automatic Query Expansion",
        "authors": "Lap Q. Trieu, Huy Q. Tran, Minh-Triet Tran",
        "published": "2017-12-7",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3155133.3155206"
    },
    {
        "id": 9929,
        "title": "Vertical intent prediction approach based on Doc2vec and convolutional neural networks for improving vertical selection in aggregated search",
        "authors": "Sanae Achsas, El Habib Nfaoui",
        "published": "2020-8-1",
        "citations": 1,
        "abstract": "Vertical selection is the task of selecting the most relevant verticals to a given query in order to improve the diversity and quality of web search results. This task requires not only predicting relevant verticals but also these verticals must be those the user expects to be relevant for his particular information need. Most existing works focused on using traditional machine learning techniques to combine multiple types of features for selecting several relevant verticals. Although these techniques are very efficient, handling vertical selection with high accuracy is still a challenging research task. In this paper, we propose an approach for improving vertical selection in order to satisfy the user vertical intent and reduce user’s browsing time and efforts. First, it generates query embeddings vectors using the doc2vec algorithm that preserves syntactic and semantic information within each query. Secondly, this vector will be used as input to a convolutional neural network model for increasing the representation of the query with multiple levels of abstraction including rich semantic information and then creating a global summarization of the query features. We demonstrate the effectiveness of our approach through comprehensive experimentation using various datasets.  Our experimental findings show that our system achieves significant accuracy. Further, it realizes accurate predictions on new unseen data.",
        "link": "http://dx.doi.org/10.11591/ijece.v10i4.pp3869-3882"
    },
    {
        "id": 9930,
        "title": "Engineering doc2vec for automatic classification of product descriptions on O2O applications",
        "authors": "Hana Lee, Young Yoon",
        "published": "2018-9",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10660-017-9268-5"
    },
    {
        "id": 9931,
        "title": "MLPV: Text Representation of Scientific Papers Based on Structural Information and Doc2vec",
        "authors": "Yonghe Lu, Yuanyuan Zhai, Jiayi Luo, Yongshan Chen",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11648/j.ajist.20190303.12"
    },
    {
        "id": 9932,
        "title": "Doc2Vec based Question and Answer Search System",
        "authors": "HeeSeok Cho, Yong Kim",
        "published": "2021-2-5",
        "citations": 0,
        "abstract": "E-learning interaction acts as a positive factor, such as improving learning commitment and learning effect and reducing the dropout rate. As an important function of e-learning interaction, if a learner queries a content that is difficult to understand during learning, a question-and-answer bulletin board that responds to the question is provided by a professor. In the way that the instructor directly answers the learner's questions, real-time feedback is difficult, and the instructor's fatigue increases. The purpose of this study is to achieve the goal of reducing answering time and reducing answering costs by developing a question-and-answer search system that automatically searches for and provides answers to questions created by learners during learning. To this end, this study designed and implemented a question-and-answer search system that provides the most similar query answers to learners by analyzing questions and answers based on Doc2Vec, one of the word embedding technologies, which is a natural language processing technology.   By applying the results of this study to the question-and-answer system, it is expected that the learning effect can be enhanced by providing an immediate answer to the learner's question. In addition, organizations that pay response fees through the national budget, such as the Korea Educational Broadcasting Corporation, will be able to focus more on investments such as improving content quality through budget reduction.",
        "link": "http://dx.doi.org/10.18517/ijaseit.11.1.14079"
    },
    {
        "id": 9933,
        "title": "Malicious Domain Name Detection Based on Doc2vec and Hybrid Network",
        "authors": "Donglin Ma, Shuhuan Zhang, Fanqi Kong, Zhaoyang Fu",
        "published": "2021-3-1",
        "citations": 2,
        "abstract": "Abstract\nIn traditional malicious domain name detection algorithms, machine learning detection methods take a long time to extract features and the extraction methods are more complex; deep learning detection methods are easy to lose the semantic features of the entire domain name, and the detection results of a single neural network for different sample data sets are unstable . In response to the above problems, a malicious domain name detection method based on Doc2vec and hybrid network was proposed, and a new DLR (Doc2vec-LSTM-RNN) detection model was constructed. The word vector is constructed using the Doc2vec algorithm optimized on the basis of the Word2vec algorithm, which retains the semantic information of the domain name as a whole; and mixes the bidirectional LSTM network and the bidirectional RNN network in series to carry out deep-level feature extraction and enhance the robustness of the detection model; finally the Softmax function is used to output the classification result. Experimental data shows that this method has excellent performance in malicious domain name detection. Compared with traditional machine learning and deep learning detection methods, it has higher detection accuracy.",
        "link": "http://dx.doi.org/10.1088/1755-1315/693/1/012089"
    },
    {
        "id": 9934,
        "title": "Detecting Semantic-based Similarity Between Verses of The Quran with Doc2vec",
        "authors": "Menwa Alshammeri, Eric Atwell, Mhd ammar Alsalka",
        "published": "2021",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2021.05.104"
    },
    {
        "id": 9935,
        "title": "Doc2Vec &amp;Naïve Bayes: Learners’ Cognitive Presence Assessment through Asynchronous Online Discussion TQ Transcripts",
        "authors": "Hind Hayati, Abdessamad Chanaa, Mohammed Khalidi Idrissi, Samir Bennani",
        "published": "2019-4-30",
        "citations": 13,
        "abstract": "Due to the lack of face to face interaction in online learning environment, this article aims essentially to give tutors the opportunity to understand and analyze learners’ cognitive behavior. In this perspective, we propose an automatic system to assess learners’ cognitive presence regarding their social interactions within synchronous online discussions. Combining Natural Language Preprocessing, Doc2Vec document embedding method and machine learning techniques; we first make some transformations and preprocessing to the given transcripts, then we apply Doc2Vec method to represent each message as a vector that will be concatenated with LIWC and context features. The vectors are input data of Naïve Bayes algorithm; a machine learning method; that aims to classify transcripts according to cognitive presence categories.",
        "link": "http://dx.doi.org/10.3991/ijet.v14i08.9964"
    },
    {
        "id": 9936,
        "title": "Scene classification based on the bag-of-visual-words and Doc2Vec models for high-spatial resolution remote-sensing imagery",
        "authors": "Wenqiang Li, Gui Jin",
        "published": "2019-5-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/1.jrs.13.026506"
    },
    {
        "id": 9937,
        "title": "Web Service Recommendation based on Knowledge Graph Convolutional Network and Doc2Vec",
        "authors": "Jinkun Geng, Buqing Cao, Hongfan Ye, Junjie Chen, Mi Peng, Jianxun Liu",
        "published": "2020-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/services48979.2020.00033"
    },
    {
        "id": 9938,
        "title": "Problem formulation in inventive design using Doc2vec and Cosine Similarity as Artificial Intelligence methods and Scientific Papers",
        "authors": "Masih Hanifi, Hicham Chibane, Remy Houssin, Denis Cavallucci",
        "published": "2022-3",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.engappai.2022.104661"
    },
    {
        "id": 9939,
        "title": "Using the Doc2Vec Algorithm to Detect Semantically Similar Jira Issues in the Process of Resolving Customer Requests",
        "authors": "Artem Kovalev, Nikita Voinov, Igor Nikiforov",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-32258-8_11"
    },
    {
        "id": 9940,
        "title": "SAO2Vec: Development of an algorithm for embedding the subject–action–object (SAO) structure using Doc2Vec",
        "authors": "Sunhye Kim, Inchae Park, Byungun Yoon",
        "published": "2020-2-5",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1371/journal.pone.0227930"
    },
    {
        "id": 9941,
        "title": "A Study of the Chinese spam Classification with Doc2vec and CNN",
        "authors": "Hechen Gong, Fucheng You, Shaomei Wang",
        "published": "2019-7-1",
        "citations": 1,
        "abstract": "Abstract\nConvolution neural network is a kind of neural network, which has been proved to be very effective in image recognition and classification. In recent years, convolution neural networks have gradually shifted to the field of natural language processing and become one of the research hotspots. For the construction of word vector text using convolution neural network, only considering the relationship between word granularity level, not considering the relationship between words, nor considering the relationship between semantics, affecting the classification results. In this paper, a method based on Doc2vec and CNN is proposed to classify spam. Firstly, the spam is preprocessed, then the sentence vectors and word vectors of Chinese text are trained by Doc2vec, and finally the trained text vectors are classified by convolution neural network.",
        "link": "http://dx.doi.org/10.1088/1757-899x/563/4/042026"
    },
    {
        "id": 9942,
        "title": "Key word extraction for short text via word2vec, doc2vec, and textrank",
        "authors": "Jun LI, Guimin HUANG, Chunli FAN, Zhenglin SUN, Hongtao ZHU",
        "published": "2019-5-15",
        "citations": 34,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3906/elk-1806-38"
    },
    {
        "id": 9943,
        "title": "Categorization of Korean News Articles Based on Convolutional Neural Network Using Doc2Vec and Word2Vec",
        "authors": "Dowoo Kim, Myoung-Wan Koo",
        "published": "2017-7-31",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5626/jok.2017.44.7.742"
    },
    {
        "id": 9944,
        "title": "Compressed Firmware Classification Based on Extra Trees and Doc2Vec",
        "authors": "Jing Qiu, Xiaoxu Geng, Guanglu Sun",
        "published": "2021-12-22",
        "citations": 0,
        "abstract": "Firmware formats vary from vendor to vendor, making it difficult to track which vendor or device the firmware belongs to, or to identify the firmware used in an embedded device. Current firmware analysis tools mainly distinguish firmware by static signatures in the firmware binary code. However, the extraction of a signature often requires careful analysis by professionals to obtain it and requires a significant investment of time and effort. In this paper, we use Doc2Vec to extract and process the character information in firmware, combine the file size, file entropy, and the arithmetic mean of bytes as firmware features, and implement the firmware classifier by combining the Extra Trees model. The evaluation is performed on 1,190 firmware files from 5 router vendors. The accuracy of the classifier is 97.18%, which is higher than that of current approaches. The results show that the proposed approach is feasible and effective.",
        "link": "http://dx.doi.org/10.1155/2021/2666153"
    },
    {
        "id": 9945,
        "title": "Analyzing Performance of Different Machine Learning Approaches With Doc2vec for Classifying Sentiment of Bengali Natural Language",
        "authors": "Md. Tazimul Hoque, Ashraful Islam, Eshtiak Ahmed, Khondaker A. Mamun, Mohammad Nurul Huda",
        "published": "2019-2",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecace.2019.8679272"
    },
    {
        "id": 9946,
        "title": "Target-Topic Aware Doc2Vec for Short Sentence Retrieval from User Generated Content",
        "authors": "Kosuke Kurihara, Yoshiyuki Shoji, Sumio Fujita, Martin J. Dürst",
        "published": "2019-12-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3366030.3366126"
    },
    {
        "id": 9947,
        "title": "Deep Guessing: Generating Meaningful Personalized Quizzes on Historical Topics by Introducing Wikicategories in Doc2Vec",
        "authors": "Borja Varela-Brea, Martin Lopez-Nores, Yolanda Blanco-Fernandez, Jose Juan Pazos-Arias, Alberto Gil-Solla, Manuel Ramos-Cabrer",
        "published": "2018-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smap.2018.8501891"
    },
    {
        "id": 9948,
        "title": "Recommendation method for academic journal submission based on doc2vec and XGBoost",
        "authors": "Huang ZhengWei, Min JinTao, Yang YanNi, Huang Jin, Tian Ye",
        "published": "2022-5",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11192-022-04354-1"
    },
    {
        "id": 9949,
        "title": "Text Vectorization Techniques for Trending Topic Clustering on Twitter: A Comparative Evaluation of TF-IDF, Doc2Vec, and Sentence-BERT",
        "authors": "Alvian Daniel Susanto, Steven Andrian Pradita, Caroline Stryadhi, Karli Eka Setiawan, Muhammad Fikri Hasani",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoris60118.2023.10352228"
    },
    {
        "id": 9950,
        "title": "Doc2vec-Based Insider Threat Detection through Behaviour Analysis of Multi-source Security Logs",
        "authors": "Liu Liu, Chao Chen, Jun Zhang, Olivier De Vel, Yang Xiang",
        "published": "2020-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/trustcom50675.2020.00050"
    },
    {
        "id": 9951,
        "title": "Bug Prediction Using Source Code Embedding Based on Doc2Vec",
        "authors": "Tamás Aladics, Judit Jász, Rudolf Ferenc",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-87007-2_27"
    },
    {
        "id": 9952,
        "title": "Micro‐blog sentiment classification using Doc2vec + SVM model with data purification",
        "authors": "Yinghong Liang, Haitao Liu, Su Zhang",
        "published": "2020-7",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/joe.2019.1159"
    },
    {
        "id": 9953,
        "title": "Research on Chinese Audio and Text Alignment Algorithm Based on AIC-FCM and Doc2Vec",
        "authors": "Keliang Chen, Jianming Huang, Yansong Cui, Weizheng Ren",
        "published": "2023-3-31",
        "citations": 2,
        "abstract": "‘‘Audiobook” is a multimedia-based reading technology that has emerged in recent years. Realizing the alignment of e-book text and book audio is the most important part of its processing. This article describes an audio and text alignment algorithm using deep learning and neural network technology to improve the efficiency and quality of audiobook production. The algorithm first uses dual-threshold endpoint detection technology to segment long audio into short audio with sentence dimensions and recognizes it as short text. The threshold is calculated by AIC-FCM optimized based on simulated annealing genetic algorithm. Then the algorithm uses Doc2vec optimized by the threshold prediction method based on the average length of the short text to calculate the text similarity. Finally, proofread and output the text sequence and audio segment aligned in the time dimension to meet the needs of audiobook production. Experiments show that compared to traditional audio and text alignment algorithms, the proposed algorithm is closer to the ideal segmentation result in long audio segmentation, and the alignment effect is basically the same as Doc2vec and the time complexity is reduced by about 35%.",
        "link": "http://dx.doi.org/10.1145/3532852"
    },
    {
        "id": 9954,
        "title": "Text Semantic Analysis Algorithm Based on LDA Model and Doc2vec",
        "authors": "Weiwei Zhang, Guangyu Zhai, Binbin Zhong, Xiaoyi Kong",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "With the rapid development of the Internet, massive messy text data is distributed in all walks of life, how to quickly and effectively mine meaningful semantic information from these complex and messy texts has become an important task in the field of natural language. First, texts such as Weibo comments lack contextual semantics due to sparse data, which in turn affects the effect of text semantic mining. Second, existing topic model use semantic representations in different vector spaces, resulting in low accuracy. Therefore, this paper proposes a new text semantic analysis model: DBOW-LDA model, which integrates the LDA topic model (Latent Dirichlet Allocation) and the sentence vector model (Doc2vec), so that the output contains the given topic semantic information. Sentence vector representation of text. The accuracy of the algorithm is further improved. In the experiment, the crawled Weibo comment text is used as the data set, and the K-Means clustering algorithm is used to compare the effects of each model. The experimental results show that the clustering effect based on DBOW-LDA model is better than Word2vec, WT-LDA, LDA+Word2vec model.",
        "link": "http://dx.doi.org/10.3233/atde231269"
    },
    {
        "id": 9955,
        "title": "Thematic Similarity Multiple-Choice Question Answering with Doc2Vec: A Step Toward Metaphorical Language Processing",
        "authors": "Soroosh Akef, Mohammad Hadi Bokaei, Hossein Sameti,  ,  ,  ",
        "published": "2020-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52547/ijict.12.2.46"
    },
    {
        "id": 9956,
        "title": "Sentiment analysis of twitter data related to Rinca Island development using Doc2Vec and SVM and logistic regression as classifier",
        "authors": "Tirta Hema Jaya Hidayat, Yova Ruldeviyani, Achmad Rizki Aditama, Gusti Raditia Madya, Ade Wija Nugraha, Muhammad Wijaya Adisaputra",
        "published": "2022",
        "citations": 39,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2021.12.187"
    },
    {
        "id": 9957,
        "title": "Exploiting Patent Documents for Cross-Domain Knowledge Transfer in Innovative Engineering Design: A Doc2Vec-GAT-Based Approach",
        "authors": "Mingrui Li, Zuoxu Wang, Zhijie Yan, Jihong Liu",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/case56687.2023.10260662"
    },
    {
        "id": 9958,
        "title": "Development of a middle school science Q&amp;A chatbot using Doc2Vec and analysis of student’s queries",
        "authors": "Gyeongmo Min, Junehee Yoo,  ",
        "published": "2022-9-30",
        "citations": 0,
        "abstract": "In this study, a method of constructing a science Q&A chatbot developed by a teacher for students at a specific middle school was introduced, and implications were obtained by analyzing student's queries. The chatbot built its own server using a Korean morpheme analyzer and a document classification model based on Doc2Vec.\r\nAs a result of operating the chatbot service for three semesters, half of the queries were related to the subject, and the other half were non-curricular, such as small talk. The students used the chatbot a lot to prepare for the test, and they used it more after school by taking advantage of the merit of all day operation. In order to increase the usage of educational chatbots, it is necessary to build a dataset based on students' actual queries and improve the search algorithm to increase the probability of getting appropriate answers that match the students' intentions. Even if a chatbot is created for the purpose of Q&A in science subjects, it should be able to cover both subject and non-curricular areas according to the needs of students.",
        "link": "http://dx.doi.org/10.54346/sjer.2022.31.3.115"
    },
    {
        "id": 9959,
        "title": "A doc2vec and local outlier factor approach to measuring the novelty of patents",
        "authors": "Daeseong Jeon, Joon Mo Ahn, Juram Kim, Changyong Lee",
        "published": "2022-1",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.techfore.2021.121294"
    }
]