[
    {
        "id": 4905,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/resmil.v10i1.13"
    },
    {
        "id": 4906,
        "title": "Multiclass Texture Synthesis Using Generative Adversarial Networks",
        "authors": "Maroš Kollár, Lukas Hudec, Wanda Benesova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011657500003417"
    },
    {
        "id": 4907,
        "title": "NATURE-INSPIRED DESIGN IDEA GENERATION WITH GENERATIVE ADVERSARIAL NETWORKS",
        "authors": "Nurullah YÜKSEL, Hüseyin Rıza BÖRKLÜ",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "Generating new, creative, and innovative ideas in the early stages of the design process is crucial for developing better and original products. Human designers may become too attached to specific design ideas, preventing them from generating new concepts and achieving ideal designs. To come up with original design ideas, a designer needs to have a creative mind, as well as knowledge, experience, and talent. Verbal, written, and visual sources of inspiration can also be valuable for generating ideas and concepts. This study presents a visual integration model that uses a data-supported Artificial Intelligence (AI) method to generate creative design ideas. The proposed model is based on a generative adversarial network (GAN) that combines target object and biological object images to produce new creative product images inspired by nature. The model was successfully applied to an aircraft design problem and the resulting sketches inspired designers to generate new and creative design ideas and variants in a case study. It was seen that this approach improved the quality of the ideas produced and simplified the idea and concept generation process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46519/ij3dptdi.1239487"
    },
    {
        "id": 4908,
        "title": "Privacy Protection of Synthetic Smart Grid Data Simulated via Generative Adversarial Networks",
        "authors": "Kayode Adewole, Vicenç Torra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011956800003555"
    },
    {
        "id": 4909,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS (2019)",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/jcr.06.07.109"
    },
    {
        "id": 4910,
        "title": "MAGAN: A Meta-Analysis for Generative Adversarial Networks’ Latent Space",
        "authors": "Frederic Rizk, Rodrigue Rizk, Dominick Rizk, Chee-Hung Chu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011771900003411"
    },
    {
        "id": 4911,
        "title": "Multi-View Inversion for 3D-aware Generative Adversarial Networks",
        "authors": "Florian Barthel, Anna Hilsmann, Peter Eisert",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012371000003660"
    },
    {
        "id": 4912,
        "title": "Unpaired Bone Marrow Smears Virtual Staining Using Content and Attention-Guided Generative Adversarial Networks: UBMSVStain Using Content and Attention-Guided Generative Adversarial Networks",
        "authors": "Aman Wang, Ruijie Zhu",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3644116.3644228"
    },
    {
        "id": 4913,
        "title": "Adversarial Attacks on Deep Neural Networks using Generative Perturbation Networks",
        "authors": "Sudharman K. Jayaweera",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10201189"
    },
    {
        "id": 4914,
        "title": "BSDGAN: Balancing Sensor Data Generative Adversarial Networks for Human Activity Recognition",
        "authors": "Yifan Hu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191928"
    },
    {
        "id": 4915,
        "title": "Quality-Aware Conditional Generative Adversarial Networks for Precipitation Nowcasting",
        "authors": "Jahnavi Jonnalagadda, Mahdi Hashemi",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039011"
    },
    {
        "id": 4916,
        "title": "Data Generation with Variational Autoencoders and Generative Adversarial Networks",
        "authors": "Daniil Devyatkin, Ivan Trenev",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023033037"
    },
    {
        "id": 4917,
        "title": "Generative Adversarial Networks",
        "authors": "Moez Krichen",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306417"
    },
    {
        "id": 4918,
        "title": "Leveraging Dual-Generative Adversarial Networks for Adversarial Malware Detection via Ensemble Learning",
        "authors": "Lucas Gordon",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nIn the expanding realm of cybersecurity, machine learning-based malware detection has emerged as a vital line of defense. However, the growing sophistication of malware attacks poses formidable challenges to conventional detection systems. To address this, this paper uses a Generative Adversarial Network that utilizes dual generators for adversarial learning on malware, designed to enhance the detection of harmful Portable Executable (PE) files. Our model employs a two-tiered generator system within the GAN architecture, where the secondary generator intervenes when the primary generator yields a malware PE executable dismissed by the detector.\r\nThe detection unit leverages ensemble learning techniques to analyze the PE software feature vector, capitalizing on the synergy of multiple learning models for improved performance and generalization. This setup empowers the system to generate a broader range of adversarial examples and respond to them effectively, enhancing the robustness of the detector against previously unseen or variable malware types.\r\n\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.24908/iqurcp16688"
    },
    {
        "id": 4919,
        "title": "STE-GAN: Speech-to-Electromyography Signal Conversion using Generative Adversarial Networks",
        "authors": "Kevin Scheck, Tanja Schultz",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-174"
    },
    {
        "id": 4920,
        "title": "Biologically Informed Generative Adversarial Networks for Modeling and Prediction",
        "authors": "Anagha Savit",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/isal_a_00589"
    },
    {
        "id": 4921,
        "title": "Diverse Level Generation for Tile-Based Video Game using Generative Adversarial Networks from Few Samples",
        "authors": "Soichiro Takata, Yuichi Sei, Yasuyuki Tahara, Akihiko Ohsuga",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011666200003393"
    },
    {
        "id": 4922,
        "title": "Wearable Data Generation Using Time-Series Generative Adversarial Networks for Hydration Monitoring",
        "authors": "Farida Sabry, Wadha Labda, Tamer Eltaras, Fatima Hamza, Khawla Alzoubi, Qutaibah Malluhi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011757200003414"
    },
    {
        "id": 4923,
        "title": "Generating Realistic Aircraft Trajectories Using Generative Adversarial Networks",
        "authors": "Petr Lukeš, Pavel Kulmon",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/irs57608.2023.10172407"
    },
    {
        "id": 4924,
        "title": "Similarity-Based Gossip Learning for Generative Adversarial Networks",
        "authors": "Jiaxin Zhang, Liang Zhao, Na Lin",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsn57992.2023.10297386"
    },
    {
        "id": 4925,
        "title": "Retracted: Cryptospace Invertible Steganography with Conditional Generative Adversarial Networks",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9764791"
    },
    {
        "id": 4926,
        "title": "Application of a Deep Generative Model for Diversified Video Subtitles Based on Generative Adversarial Networks",
        "authors": "Lingzhi Shen",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acctcs58815.2023.00080"
    },
    {
        "id": 4927,
        "title": "Recent Advances in Generative Adversarial Networks for Gene Expression Data: A Comprehensive Review",
        "authors": "Minhyeok Lee",
        "published": "2023-7-10",
        "citations": 7,
        "abstract": "The evolving field of generative artificial intelligence (GenAI), particularly generative deep learning, is revolutionizing a host of scientific and technological sectors. One of the pivotal innovations within this domain is the emergence of generative adversarial networks (GANs). These unique models have shown remarkable capabilities in crafting synthetic data, closely emulating real-world distributions. Notably, their application to gene expression data systems is a fascinating and rapidly growing focus area. Restrictions related to ethical and logistical issues often limit the size, diversity, and data-gathering speed of gene expression data. Herein lies the potential of GANs, as they are capable of producing synthetic gene expression data, offering a potential solution to these limitations. This review provides a thorough analysis of the most recent advancements at this innovative crossroads of GANs and gene expression data, specifically during the period from 2019 to 2023. In the context of the fast-paced progress in deep learning technologies, accurate and inclusive reviews of current practices are critical to guiding subsequent research efforts, sharing knowledge, and catalyzing continual growth in the discipline. This review, through highlighting recent studies and seminal works, serves as a key resource for academics and professionals alike, aiding their journey through the compelling confluence of GANs and gene expression data systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11143055"
    },
    {
        "id": 4928,
        "title": "Training generative adversarial networks by auxiliary adversarial example regulator",
        "authors": "Yan Gan, Mao Ye, Dan Liu, Yiguang Liu",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110086"
    },
    {
        "id": 4929,
        "title": "Virtual Wearable Sensor Data Generation with Generative Adversarial Networks",
        "authors": "Yining Huang, Hong Wan, Xi Chen",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wsc60868.2023.10407328"
    },
    {
        "id": 4930,
        "title": "Human Body Security Screening Image Data Augmentation Using Generative Adversarial Networks",
        "authors": "Kasai Abdulmajid",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4730822"
    },
    {
        "id": 4931,
        "title": "Evaluating Generative Adversarial Networks: A Topological Approach",
        "authors": "Narges Alipourjeddi, Ali Miri",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074146"
    },
    {
        "id": 4932,
        "title": "Generative Adversarial Networks to Secure Vehicle-to-Microgrid Services",
        "authors": "Ahmed Omara, Burak Kantarci",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vcc60689.2023.10475111"
    },
    {
        "id": 4933,
        "title": "Regularizing Label-Augmented Generative Adversarial Networks Under Limited Data",
        "authors": "Liang Hou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3259066"
    },
    {
        "id": 4934,
        "title": "Supervised Contrastive Generative Adversarial Networks",
        "authors": "Honglei Gu",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Generative Adversarial Networks (GANs) is becoming more and more popular, artists use them to find their own inspirations, computer scientists use it for data synthesis, workers use it for machine fault diagnosis and so on. However, GANs are flawed despite its popularity: they are unstable. GANs are based on game theory. In a typical GAN model, the generator and the discriminator are both improved by competing with each other. Therefore, in this highly competitive training process, GANs can easily run into trouble while they move towards the optimal solution. In most cases, the case of such instability arises from the loss function, or in other words, the gradient of the loss function. This research proposed a new set of GAN that replaces its objective function with supcon, or the supervised contrastive loss to solve gradient-related problems. We have also proved that under our model, the GANs are less likely to suffer from these two factors of instability. Finally, we have compared our model and the traditional generative adversarial nets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/5/20230428"
    },
    {
        "id": 4935,
        "title": "A Review on Drawbacks and Limitations of Generative Adversarial Networks",
        "authors": "Amitesh Kumar Singam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4739618"
    },
    {
        "id": 4936,
        "title": "Clustering Using Conditional Generative Adversarial Networks (cGANs)",
        "authors": "Marek Ružička, Matúš Dopiriak",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/radioelektronika57919.2023.10109069"
    },
    {
        "id": 4937,
        "title": "Improved Two Stage Generative Adversarial Networks for Adversarial\nExample Generation with Real Exposure",
        "authors": "Priyanka Goyal, Deepesh Singh",
        "published": "2023-9",
        "citations": 0,
        "abstract": "\nIntroduction:\nDeep neural networks due to their linear nature are sensitive to adversarial examples. They can easily be broken just by a small disturbance to the input data. Some of the existing methods to perform these kinds of attacks are pixel-level perturbation and spatial transformation of images.\n\n\nMethod:\nThese methods generate adversarial examples that can be fed to the network for wrong predictions. The drawback that comes with these methods is that they are really slow and computationally expensive. This research work performed a black box attack on the target model classifier by using the generative adversarial networks (GAN) to generate adversarial examples that can fool a classifier model to classify the images as wrong classes. The proposed method used a biased dataset that does not contain any data of the target label to train the first generator Gnorm of the first stage GAN, and after the first training has finished, the second stage generator Gadv, which is a new generator model that does not take random noise as input but the output of the first generator Gnorm.\n\n\nResult:\nThe generated examples have been superimposed with the Gnorm output with a small constant, and then the superimposed data have been fed to the target model classifier to calculate the loss. Some additional losses have been included to constrain the generation from generating target examples.\n\n\nConclusion:\nThe proposed model has shown a better fidelity score, as evaluated using Fretchet inception distance score (FID), which was up to 42.43 in the first stage and up to 105.65 in the second stage with the attack success rate of up to 99.13%.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/2666255816666230608104148"
    },
    {
        "id": 4938,
        "title": "Single-Channel Speech Quality Enhancement in Mobile Networks Based on Generative Adversarial Networks",
        "authors": "Guifen Wu, Norbert Herencsar",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11036-024-02300-4"
    },
    {
        "id": 4939,
        "title": "TCGAN: Convolutional Generative Adversarial Network for time series classification and clustering",
        "authors": "Fanling Huang, Yangdong Deng",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.033"
    },
    {
        "id": 4940,
        "title": "Generative Adversarial Networks: A Brief History and Overview",
        "authors": "Akhil Gunasekaran",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Over the past decade, research in the field of Deep Learning has brought about novel improvements in image generation and feature learning; one such example being a Generative Adversarial Network. However, these improvements have been coupled with an increasing demand on mathematical literacy and previous knowledge in the field. Therefore, in this literature review, I seek to introduce Generative Adversarial Networks (GANs) to a broader audience by explaining their background and intuition at a more foundational level. I begin by discussing the mathematical background of this architecture, specifically topics in linear algebra and probability theory. I then proceed to introduce GANs in a more theoretical framework, along with some of the literature on GANs, including their architectural improvements and image-generation capabilities. Finally, I cover state-of-the-art image generation through style-based methods, as well as their implications on society.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsr.v12i1.1848"
    },
    {
        "id": 4941,
        "title": "Improved Method for Pedestrian Recognition Based on Generative Adversarial Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/jaip.2023.060204"
    },
    {
        "id": 4942,
        "title": "An Efficient Method for Facial Sketches Synthesization Using Generative Adversarial Networks",
        "authors": "Dr Prakash Bethapudi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4793181"
    },
    {
        "id": 4943,
        "title": "Performance Analysis of Convolutional Neural Networks and Multilayer Perceptron in Generative Adversarial Networks",
        "authors": "Siyuan Guan",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10076041"
    },
    {
        "id": 4944,
        "title": "A Taxonomy for Generative Adversarial Networks in Dynamic Adaptive Streaming Over HTTP",
        "authors": "Koffka Khan,  ",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Generative Adversarial Networks (GANs) have emerged as a powerful tool in the field of Dynamic Adaptive Streaming over HTTP (DASH) to enhance various aspects of video streaming. This paper presents a taxonomy that categorizes the applications and techniques of GANs in the context of DASH. The taxonomy covers several key dimensions, including video generation, compression, quality enhancement, bandwidth adaptation, dynamic bitrate streaming, and cross-modal applications. Within each dimension, specific subcategories are identified to capture the diverse applications of GANs in DASH. Additionally, evaluation metrics for assessing the quality and effectiveness of GAN-based approaches are discussed. The taxonomy serves as a comprehensive framework to understand and organize the different ways in which GANs can be utilized to improve the streaming experience in DASH. By providing an organized structure, this taxonomy facilitates better understanding, comparison, and exploration of GAN-based approaches in DASH and enables researchers and practitioners to identify areas for further research and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijmra/v6-i6-45"
    },
    {
        "id": 4945,
        "title": "On Generating Synthetic Histopathology Images Using Generative Adversarial Networks",
        "authors": "Seán Carmody, Deepu John",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/issc59246.2023.10162094"
    },
    {
        "id": 4946,
        "title": "On the Use of Generative Adversarial Networks to Predict Health Status Among Chronic Patients",
        "authors": "María Jurado-Camino, David Chushig-Muzo, Cristina Soguero-Ruiz, Pablo Bohoyo, Inmaculada Mora-Jiménez",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011690500003414"
    },
    {
        "id": 4947,
        "title": "Camera Tripod Removal Model in Panoramic Images Based on Generative Adversarial Networks",
        "authors": "Jian Wu Jian Wu, Honghui Deng Jian Wu, Fei Cheng Honghui Deng, Hongjun Wang Fei Cheng",
        "published": "2023-6",
        "citations": 0,
        "abstract": "\n                        <p>There are often residual images of the camera tripod in panoramic images, which may reduce the image quality and deteriorate the post-processing speed. To address this problem, a camera tripod removal network (TRNet) based on generative adversarial network&nbsp;is proposed. As an end-to-end model, the generator is designed to include recognition and reconstruction branches, which reduce the number of parameters and improve the training efficiency by sharing the encoder&nbsp;and correspond to scaffold recognition and texture reconstruction respectively. The recognition branch based on the U-Net structure can effectively identify the tripod area, while the reconstruction branch can brilliantly reconstruct the texture details through an intermediate layer formed by stacking dilated convolution residual blocks.  Furthermore, spectral normalized Markov discriminator and multiple combined loss function&nbsp;are adopted to promote global texture consistency and thus result in a better texture filling effect. Finally, a data set of 400 panoramic images is constructed and experimental results on this data set demonstrate the better repair ability&nbsp;of TRNet against other state-of-the-art methods.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/199115992023063403002"
    },
    {
        "id": 4948,
        "title": "Image Matting Algorithm Using Deep Generative Adversarial Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2023.061109"
    },
    {
        "id": 4949,
        "title": "Image flare removal using Deep Convolutional Generative Adversarial Networks",
        "authors": "Ishan Prakash,  Aryan, S. Indu, Mini Sreejeth",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116874"
    },
    {
        "id": 4950,
        "title": "The Deep Learning Generative Adversarial Random Neural Network in data marketplaces: The digital creative",
        "authors": "Will Serrano",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.028"
    },
    {
        "id": 4951,
        "title": "Context-based Image Inpainting with Improved Generative Adversarial Networks",
        "authors": "Minqian Qian, Bo Chen, Weiqin Chen",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105714"
    },
    {
        "id": 4952,
        "title": "Training Generative Adversarial Networks with Adaptive Composite\n                    Gradient",
        "authors": "Huiqing Qi, Fang Li, Shengli Tan, Xiangyun Zhang",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "ABSTRACT\nThe wide applications of Generative adversarial networks benefit from the successful training methods, guaranteeing that an object function converges to the local minimum. Nevertheless, designing an efficient and competitive training method is still a challenging task due to the cyclic behaviors of some gradient-based ways and the expensive computational cost of acquiring the Hessian matrix. To address this problem, we proposed the Adaptive Composite Gradients(ACG) method, linearly convergent in bilinear games under suitable settings. Theory analysis and toy-function experiments both suggest that our approach alleviates the cyclic behaviors and converges faster than recently proposed SOTA algorithms. The convergence speed of the ACG is improved by 33% than other methods. Our ACG method is a novel Semi-Gradient-Free algorithm that can reduce the computational cost of gradient and Hessian by utilizing the predictive information in future iterations. The mixture of Gaussians experiments and real-world digital image generative experiments show that our ACG method outperforms several existing technologies, illustrating the superiority and efficacy of our method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/dint_a_00246"
    },
    {
        "id": 4953,
        "title": "Optimization Strategy for Generative Adversarial Networks Design",
        "authors": "Oleksandr Striuk, Yuriy Kondratenko",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "Generative Adversarial Networks (GANs) are a powerful class of deep learning models that can generate realistic synthetic data. However, designing and optimizing GANs can be a difficult task due to various technical challenges. The article provides a comprehensive analysis of solution methods for GAN performance optimization. The research covers a range of GAN design components, including loss functions, activation functions, batch normalization, weight clipping, gradient penalty, stability problems, performance evaluation, mini-batch discrimination, and other aspects. The article reviews various techniques used to address these challenges and highlights the advancements in the field. The article offers an up-to-date overview of the state-of-the-art methods for structuring, designing, and optimizing GANs, which will be valuable for researchers and practitioners. The implementation of the optimization strategy for the design of standard and deep convolutional GANs (handwritten digits and fingerprints) developed by the authors is discussed in detail, the obtained results confirm the effectiveness of the proposed optimization approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47839/ijc.22.3.3223"
    },
    {
        "id": 4954,
        "title": "Predicting Ground Surface Deformation Induced by Pressurized Fractures Using Conditional Generative Adversarial Networks",
        "authors": "S. Salimzadeh, D. Kasperczyk, T. Kadeethum",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "\nABSTRACT\nHydraulic fracturing has been widely applied in subsurface to facilitate hydrocarbon flow or as a preconditioning method to promote normal caving behavior in mining operations. The success of the method prominently relies on the geometry of the induced fractures in the host rock. An array of high-resolution tiltmeters is commonly used to measure the displacement gradient (tilt angle) of ground surface during hydraulic fracturing operation, and to infer the geometry of the induced fractures. In this work, we present a machine-learned model that is capable of predicting the surface tilt resulting from a pressurized fracture, using Conditional Generative Adversarial Networks (cGAN). Fracture apertures along horizontal and vertical planes are given as input while surface tilt vectors are provided as output for the forward model. A 3D finite element model with discrete fractures is utilized as the Full Order Model (FOM) to create training data. The fractures are pressurized uniformly to induce a displacement at the ground surface. Images of the fracture aperture in XY and XZ planes, and surface tilt vector components (tilt X and tilt Y) are used for the training process. Three different loss functions are used, and the predicted tilts are compared to the real (FOM) tilts. The results show that the trained cGAN with Wasserstein loss and gradient penalty (W-model) can predict the ground surface tilt due to the pressurized fractures at variable dip angles.\n\n\nINTRODUCTION\nHydraulic fracturing has been frequently applied as a preconditioning method to promote normal caving behavior in mining operations. The success of the method prominently relies on the geometry of the induced fractures in the stiff overburden layer. An array of high-resolution tiltmeters is commonly used to measure the displacement gradient (tilt angle) of ground surface during hydraulic fracturing operation, and to infer the geometry of the induced fractures or pressure plumes using simplified models (Lecampion et al., 2005; Salimzadeh et al., 2022).\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.56952/arma-2023-0218"
    },
    {
        "id": 4955,
        "title": "Zero-Inflated Text Data Analysis using Generative Adversarial Networks and Statistical Modeling",
        "authors": "Sunghae Jun",
        "published": "2023-12-10",
        "citations": 1,
        "abstract": "In big data analysis, various zero-inflated problems are occurring. In particular, the problem of inflated zeros has a great influence on text big data analysis. In general, the preprocessed data from text documents are a matrix consisting of the documents and terms for row and column, respectively. Each element of this matrix is an occurred frequency of term in a document. Most elements of the matrix are zeros, because the number of columns is much larger than the rows. This problem is a cause of decreasing model performance in text data analysis. To overcome this problem, we propose a method of zero-inflated text data analysis using generative adversarial networks (GAN) and statistical modeling. In this paper, we solve the zero-inflated problem using synthetic data generated from the original data with zero inflation. The main finding of our study is how to change zero values to the very small numeric values with random noise through the GAN. The generator and discriminator of the GAN learned the zero-inflated text data together and built a model that generates synthetic data that can replace the zero-inflated data. We conducted experiments and showed the results, using real and simulation data sets to verify the improved performance of our proposed method. In our experiments, we used five quantitative measures, prediction sum of squares, R-squared, log-likelihood, Akaike information criterion and Bayesian information criterion to evaluate the model’s performance between original and synthetic data sets. We found that all performances of our proposed method are better than the traditional methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12120258"
    },
    {
        "id": 4956,
        "title": "Application of Knowledge Distillation in Generative Adversarial Networks",
        "authors": "Xu Zhang",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acctcs58815.2023.00014"
    },
    {
        "id": 4957,
        "title": "Uncover This Tech Term: Generative Adversarial Networks",
        "authors": "H Shafeeq Ahmed",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3348/kjr.2023.1306"
    },
    {
        "id": 4958,
        "title": "Performance Comparison of Generative Adversarial Networks and Neural Networks on Cancers Detection",
        "authors": "Amit Kumar Bishnoi,  Manivasagam, Rakhi Gupta",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470909"
    },
    {
        "id": 4959,
        "title": "Prediction of Time Series Using Generative Adversarial Networks",
        "authors": "Ao Di Ding",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isctis58954.2023.10213145"
    },
    {
        "id": 4960,
        "title": "Review of Speech Enhancement Methods using Generative Adversarial Networks",
        "authors": "Didin Skariah, Joshua Thomas",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57789.2023.10164848"
    },
    {
        "id": 4961,
        "title": "A Generative Adversarial Networks Based Approach for Literary Translation",
        "authors": "",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17559/tv-20221222092039"
    },
    {
        "id": 4962,
        "title": "IPattern: Islamic-Inspired Pattern Generation Using Generative Adversarial Networks",
        "authors": "Moutaz Saleh, Roudha Al-Rumaihi, Slafa Al-Dulaimi, Alaa Abashar",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323993"
    },
    {
        "id": 4963,
        "title": "Synthetic Electricity Consumption Data Generation Using Tabular Generative Adversarial Networks",
        "authors": "Thet Paing Tun, Ioana Pisica",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/upec57427.2023.10294666"
    },
    {
        "id": 4964,
        "title": "Generative Adversarial Networks for the Inverse Design of 2D Spinodoid Metamaterials",
        "authors": "Sheng Liu, Pinar Acar",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-0037"
    },
    {
        "id": 4965,
        "title": "An Enhanced Network Intrusion Detection Method Using Auxiliary Classifier Generative Adversarial Networks",
        "authors": "Yawei Tian, Yusun Fu, Zhenyuan Ji",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451618"
    },
    {
        "id": 4966,
        "title": "Gait Recognition using Deep Residual Networks and Conditional Generative Adversarial Networks",
        "authors": "Entesar B. Talal, Zakariya A. Oraibi, Ali Wali",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00178"
    },
    {
        "id": 4967,
        "title": "Historic Image Colorization with Generative Adversarial Networks",
        "authors": "Md. Rezowan Talukder, A N Tanvir, Taslima Akbar Keya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4413265"
    },
    {
        "id": 4968,
        "title": "Challenges, Corresponding Solutions, and Applications of Generative Adversarial Networks",
        "authors": "Hongbo Zhong",
        "published": "2023-7-11",
        "citations": 0,
        "abstract": "Generative adversarial networks (GANs) have become a popular deep learning framework in the field of artificial intelligence. Researchers have developed various types of GANs, such as Conditional GANs (CGANs), Mode Dropping GANs (MDGANs), and Wasserstein GANs (WGANs), which have been applied to many different fields. Despite the success of GANs in various tasks, there are still some challenges that need to be addressed. For example, model collapse, non-convergence, and diminished gradient could hinder the training of GANs. In this paper, the authors first introduce the basics of GANs before highlighting a few common problems associated with GANs and their corresponding solutions. For instance, they discuss techniques such as mini-batch discrimination and batch normalization that can help mitigate model collapse and diminish gradient problems. Additionally, they cover methods that can improve the convergence rate and stability of GANs, such as using alternative loss functions and incorporating regularization algorithms. Finally, this paper briefly introduces some recent applications of GANs in image generation, video prediction, and other areas. Despite the challenges that still exist, GANs have shown great promise in various fields, and with further research, GANs have the potential to become more robust and efficient models for generating high-quality synthetic data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v57i.9991"
    },
    {
        "id": 4969,
        "title": "Improving satellite pose estimation across domain gap with generative adversarial networks",
        "authors": "A. Lotti",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Abstract. Pose estimation from a monocular camera is a critical technology for in-orbit servicing missions. However, collecting large image datasets in space for training neural networks is impractical, resulting in the use of synthetic images. Unfortunately, these often fail to accurately replicate real image features, leading to a significant domain gap. This work explores the use of generative adversarial networks as a solution for bridging this gap from the data level by making synthetic images more closely resemble real ones. A generative model is trained on a small subset of unpaired synthetic and real pictures from the SPEED+ dataset. The entire synthetic dataset is then augmented using the generator, and employed to train a regression model, based on the MetaFormer architecture, which locates a set of landmarks. By comparing the model's pose estimation accuracy on real images with and without generator preprocessing, it is observed that the augmentation effectively reduces the median pose estimation error by a factor 1.4 to 5. This compelling result validates the efficacy of these tools and justifies further research in their utilization. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21741/9781644902677-55"
    },
    {
        "id": 4970,
        "title": "Deep Convolutional Generative Adversarial Networks for Crime Scene Object Detection",
        "authors": "Uma N",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250517"
    },
    {
        "id": 4971,
        "title": "RegraphGAN: A graph generative adversarial network model for dynamic network anomaly detection",
        "authors": "Dezhi Guo, Zhaowei Liu, Ranran Li",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.026"
    },
    {
        "id": 4972,
        "title": "Enhanced damage classification accuracy on a transmission by extending existing datasets with generative adversarial networks",
        "authors": "Timo König, Fabian Wagner, Markus Kley, Marcus Liebschner",
        "published": "2023-6",
        "citations": 1,
        "abstract": "AbstractIn many areas of drive technology, condition monitoring of transmissions and drive systems is becoming an increasingly important discipline. Condition monitoring systems are used in many cases in combination with machine learning algorithms. The generation of a sufficient amount of data per condition class is relevant to ensure training stability and accuracy of the applied algorithms. Especially in early development phases a sufficient data generation is not often given. In the scope of this paper, a Generative Adversarial Network is applied to generate synthetic data and therefore extend existing measurement data sets. Acceleration data in three different condition classes is used, that has been collected on a gearbox as part of the PHM Data Challenge 2009. In order to highlight relevant features and reduce the number of data points, data is pre-processed via appropriate signal analysis techniques, in this case with the spectral kurtosis. It is shown, that in this use case the synthetically generated data via a Generative Adversarial Network has the same feature characteristics as the real measured data sets. The augmentation of the existing data set also improves the detection accuracy with artificial neural networks for the classification of different system states.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10010-023-00668-5"
    },
    {
        "id": 4973,
        "title": "Offline handwritten signature recognition based on generative adversarial networks",
        "authors": "Xiaoguang Jiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbm.2024.10059894"
    },
    {
        "id": 4974,
        "title": "Temporally Conditioning of Generative Adversarial Networks with LSTM for Music Generation",
        "authors": "Romit Mohanty, Pranjal Pratap Dubey, Tushar Sandhan",
        "published": "2023-3-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10117324"
    },
    {
        "id": 4975,
        "title": "Limit Order Book Simulation with Generative Adversarial Networks",
        "authors": "Rama Cont, Mihai Cucuringu, Jonathan Kochems, Felix Prenzel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4512356"
    },
    {
        "id": 4976,
        "title": "Generating Synthetic Text using Generative Adversarial Networks",
        "authors": "Nisha Sahal, Ramkumar Krishnamoorthy, Navjot Singh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470722"
    },
    {
        "id": 4977,
        "title": "Synthesizing credit data using autoencoders and generative adversarial networks",
        "authors": "Goran Oreski",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110646"
    },
    {
        "id": 4978,
        "title": "A generative model for Chinese character style fusion based on generative adversarial networks",
        "authors": "Lvqing Zhou, Zhiqiang Dong, Xiongkai Chen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004721"
    },
    {
        "id": 4979,
        "title": "An Overview of Generative Adversarial Networks",
        "authors": "Xinyue Long, Mingchuan Zhang",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "Generative adversarial network (GAN), put forward by two-person zero-sum game theory, is one of the most important research hotspots in the field of artificial intelligence. With a generator network and a discriminator network, GAN is trained by adversarial learning. In this paper, we aim to discusses the development status of GAN. We first introduce the basic idea and training process of GAN in detail, and summarize the structure and structure of GAN derivative models, including conditional GAN, deep convolution DCGAN, WGAN based on Wasserstein distance and WGAN-GP based on gradient strategy. We also introduce the specific applications of GAN in the fields of information security, face recognition, 3D and video technology, and summarize the shortcomings of GAN. Finally, we look forward to the development trend of GAN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jceim.v10i3.8677"
    },
    {
        "id": 4980,
        "title": "Pretraining technology of adversarial generative networks based data selection",
        "authors": "Ziyi Zhao",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "The effectiveness of adversarial generative networks (GANs) has been shown in many works. However, the convergence of the GANs should be granted mathematically with proper hyperparameters and some network structures. Considering the difficulties of constructing a large and clean dataset, GANs are required in many cases to extract enough information from a relatively small dataset. This could result in bad coverage performance of GANs, and one way to tackle this problem is pretraining. Since this method relies on importing external information from the pretraining dataset, this paper does a necessary discussion on the effect that the pretraining dataset has on the model and makes a simple assumption on the standard of choosing a pretraining dataset. Specifically, this paper focuses on the case where the target is to generate animation-style characters, and it has been proven that when providing a pretraining dataset with higher diversity, the performance of the GAN is better. The result of this paper should reveal the possibility that using a specially chosen pretraining dataset can improve the result of GAN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/5/20230608"
    },
    {
        "id": 4981,
        "title": "Self-Attention Based Generative Adversarial Networks For Unsupervised Video Summarization",
        "authors": "Maria Nektaria Minaidi, Charilaos Papaioannou, Alexandros Potamianos",
        "published": "2023-9-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289808"
    },
    {
        "id": 4982,
        "title": "MIMO Radar Waveform Synthesis Using Generative Adversarial Networks",
        "authors": "Vesa Saarinen, Visa Koivunen",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285933"
    },
    {
        "id": 4983,
        "title": "Generating Fashion Sketches Using Generative Adversarial Networks",
        "authors": "Amira Al-Samawi, Shatha Mallak, Rehab Duwairi",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icics60529.2023.10330453"
    },
    {
        "id": 4984,
        "title": "Generative Adversarial Networks for Generating Synthetic Medical Images",
        "authors": "Sunil Kumar, Ramkumar Krishnamoorthy, Rajesh Guputa",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470861"
    },
    {
        "id": 4985,
        "title": "Effects of Different Generative Adversarial Networks on the Face Generation Task",
        "authors": "Tianxiao Dong",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257729"
    },
    {
        "id": 4986,
        "title": "Autoencoders and Generative Adversarial Networks for Imbalanced Sequence Classification",
        "authors": "Stephanie Ger, Yegna Subramanian Jambunath, Diego Klabjan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386960"
    },
    {
        "id": 4987,
        "title": "A scenario framework for electricity grid using Generative Adversarial Networks",
        "authors": "Bilgi Yilmaz",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.segan.2023.101157"
    },
    {
        "id": 4988,
        "title": "Retracted: Anticoncept Drift Method for Malware Detector Based on Generative Adversarial Network",
        "authors": "",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9890472"
    },
    {
        "id": 4989,
        "title": "Document Binarization with Multi-Branch Gated Convolutional Generative Adversarial Networks",
        "authors": "Zongyuan Yang, Yongping Xiong, Guibin Wu",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222024"
    },
    {
        "id": 4990,
        "title": "Semantic Segmentation of Urban Area using Pix2Pix Generative Adversarial Networks",
        "authors": "Khyat Patel, Pratham Shah, Ruchi Gajjar",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icort56052.2023.10249202"
    },
    {
        "id": 4991,
        "title": "3D Clothing Design Modeling Based on 3D Measurement and Generative Adversarial Networks",
        "authors": "Jiayi Zhou",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00023"
    },
    {
        "id": 4992,
        "title": "Indoor Localization Advancement Using Wasserstein Generative Adversarial Networks",
        "authors": "Shivam Kumar, Saikat Majumder, Sumit Chakravarty",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126229"
    },
    {
        "id": 4993,
        "title": "Face Restoration Via Generative Adversarial Networks",
        "authors": "Sonu Kumar, Soham Bhardwaj, Dinesh Kumar Vishwakarma",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176746"
    },
    {
        "id": 4994,
        "title": "Advancing Recurrent Neural Networks and Generative Adversarial Networks: A Technical Framework for Enhanced Effectiveness Evaluation",
        "authors": "Xia Yu",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciscae59047.2023.10393296"
    },
    {
        "id": 4995,
        "title": "Intrusion Detection Classification Method based on Generative Adversarial Networks",
        "authors": "Yan Lu",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icfeict59519.2023.00064"
    },
    {
        "id": 4996,
        "title": "A Novel Approach to Credit Card Security with Generative Adversarial Networks and Security Assessment",
        "authors": "",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53469/wjimt.2024.07(02).03"
    },
    {
        "id": 4997,
        "title": "Generative Adversarial Networks for Synthesizing High-Quality Medical Images",
        "authors": "Shri Bhagwan,  Manivasagam, Anubhav Sony",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470656"
    },
    {
        "id": 4998,
        "title": "Generative Adversarial Networks Assist Missing Data Imputation: A Comprehensive Survey and Evaluation",
        "authors": "Reza Shahbazian, Sergio Greco",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3306721"
    },
    {
        "id": 4999,
        "title": "MLGAN: Addressing Imbalance in Multilabel Learning Using Generative Adversarial Networks",
        "authors": "Aatif Nisar Dar, Reshma Rastogi",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci58599.2023.10331105"
    },
    {
        "id": 5000,
        "title": "IoT Attack Classification Based on Generative Adversarial Networks",
        "authors": "Hung-Chi Chu, Yu-Jhe Lin",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ickii58656.2023.10332560"
    },
    {
        "id": 5001,
        "title": "Modeling Neuronal Activity with Quantum Generative Adversarial Networks",
        "authors": "Vinicius Hernandes, Eliska Greplova",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10267"
    },
    {
        "id": 5002,
        "title": "A New Paradigm for Generative Adversarial Networks Based on Randomized Decision Rules",
        "authors": "Sehwan Kim, Qifan Song, Faming Liang",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0404"
    },
    {
        "id": 5003,
        "title": "Enhancing Gappy Speech Audio Signals with Generative Adversarial Networks",
        "authors": "Deniss Strods, Alan F. Smeaton",
        "published": "2023-6-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/issc59246.2023.10161997"
    },
    {
        "id": 5004,
        "title": "Alapana Generation using Finite State Machines and Generative Adversarial Networks",
        "authors": "Vithushigan Jayatharan, Dileeka Alwis",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scse59836.2023.10215001"
    },
    {
        "id": 5005,
        "title": "Adaptive LPD Radar Waveform Design with Generative Adversarial Neural Networks",
        "authors": "Matthew R. Ziemann, Christopher A. Metzler",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf59524.2023.10476876"
    },
    {
        "id": 5006,
        "title": "Implementation of Generative Adversarial Networks in Mobile Applications for Image Data Enhancement",
        "authors": "Oleksandr Striuk, Yuriy Kondratenko",
        "published": "2023-2-15",
        "citations": 3,
        "abstract": "This article aims to explore and research GANs as a tool for mobile devices that can generate high-resolution images from low-resolution samples and reduce blurring. In addition, the authors also analyse the specifics of GAN, SRGAN, and ESRGAN loss functions and their features. GANs are widely used for a vast range of applied tasks for image manipulations. They’re able to synthesize, combine, and restore graphical samples of high quality that are almost indistinguishable from real data. The main scope of the research is to study the possibility to use GANs for the said tasks, and their potential implementation in mobile applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/jmm1550-4646.1938"
    },
    {
        "id": 5007,
        "title": "Physics-Informed Super-Resolution of Turbulent Channel Flows via Three-Dimensional Generative Adversarial Networks",
        "authors": "Nicholas J. Ward",
        "published": "2023-6-29",
        "citations": 1,
        "abstract": "For a few decades, machine learning has been extensively utilized for turbulence research. The goal of this work is to investigate the reconstruction of turbulence from minimal or lower-resolution datasets as inputs using reduced-order models. This work seeks to effectively reconstruct high-resolution 3D turbulent flow fields using unsupervised physics-informed deep learning. The first objective of this study is to reconstruct turbulent channel flow fields and verify these with respect to the statistics. The second objective is to compare the turbulent flow structures generated from a GAN with a DNS. The proposed deep learning algorithm effectively replicated the first- and second-order statistics of turbulent channel flows of Reτ= 180 within a 2% and 5% error, respectively. Additionally, by incorporating physics-based corrections to the loss functions, the proposed algorithm was also able to reconstruct λ2 structures. The results suggest that the proposed algorithm can be useful for reconstructing a range of 3D turbulent flows given computational and experimental efforts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/fluids8070195"
    },
    {
        "id": 5008,
        "title": "Fin-GAN: Forecasting and Classifying Financial Time Series via Generative Adversarial Networks",
        "authors": "Milena Vuletić, Felix Prenzel, Mihai Cucuringu",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4328302"
    },
    {
        "id": 5009,
        "title": "CCFD-GAN: Credit Card Fraud Detection Based on Generative Adversarial Networks Enhanced by Penalty Mechanism",
        "authors": "Wenbo Zhang, Shuo Zhang, Jinyi Chen, Hejiao Huang",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191810"
    },
    {
        "id": 5010,
        "title": "Digital Economy Risk Prevention and Control System with Generative Adversarial Networks",
        "authors": "Zhaohui Li",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10389914"
    },
    {
        "id": 5011,
        "title": "Generative Adversarial Networks for Cybersecurity Threat",
        "authors": "Anatha Charan Ojha, Ankita Agarwal, G Swetha",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraset59632.2023.10419878"
    },
    {
        "id": 5012,
        "title": "3D Image Generation from X-Ray Projections Using Generative Adversarial Networks",
        "authors": "Mohammad AlShurbaji, Salam Dhou",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibe60311.2023.00015"
    },
    {
        "id": 5013,
        "title": "Dynamic Image Representations for Crowd Anomaly Detection using Generative Adversarial Networks",
        "authors": "Samar Mahmoud, Yasmine Arafa, Maha Abdelmohsen",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca59364.2023.10401681"
    },
    {
        "id": 5014,
        "title": "Generative Adversarial Networks for Self-Supervised Transfer Learning in Medical Image Classification",
        "authors": "Mahesh T R, Meena Krishna",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425480"
    },
    {
        "id": 5015,
        "title": "Optimal Tilt-Wing eVTOL Takeoff Trajectory Prediction Using Regression Generative Adversarial Networks",
        "authors": "Shuan-Tai Yeh, Xiaosong Du",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "Electric vertical takeoff and landing (eVTOL) aircraft have attracted tremendous attention nowadays due to their flexible maneuverability, precise control, cost efficiency, and low noise. The optimal takeoff trajectory design is a key component of cost-effective and passenger-friendly eVTOL systems. However, conventional design optimization is typically computationally prohibitive due to the adoption of high-fidelity simulation models in an iterative manner. Machine learning (ML) allows rapid decision making; however, new ML surrogate modeling architectures and strategies are still desired to address large-scale problems. Therefore, we showcase a novel regression generative adversarial network (regGAN) surrogate for fast interactive optimal takeoff trajectory predictions of eVTOL aircraft. The regGAN leverages generative adversarial network architectures for regression tasks with a combined loss function of a mean squared error (MSE) loss and an adversarial binary cross-entropy (BC) loss. Moreover, we introduce a surrogate-based inverse mapping concept into eVTOL optimal trajectory designs for the first time. In particular, an inverse-mapping surrogate takes design requirements (including design constraints and flight condition parameters) as input and directly predicts optimal trajectory designs, with no need to run design optimizations once trained. We demonstrated the regGAN on optimal takeoff trajectory designs for the Airbus A3 Vahana. The results revealed that regGAN outperformed reference surrogate strategies, including multi-output Gaussian processes and conditional generative adversarial network surrogates, by matching simulation-based ground truth with 99.6% relative testing accuracy using 1000 training samples. A parametric study showed that a regGAN surrogate with an MSE weight of one and a BC weight of 0.01 consistently achieved over 99.5% accuracy (denoting negligible predictive errors) using 400 training samples, while other regGAN models require at least 800 samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12010026"
    },
    {
        "id": 5016,
        "title": "Taillight Shape Creative Design based on Generative Adversarial Networks",
        "authors": "Huan Lin, Xiaolei Deng, Dongsong Zhang",
        "published": "2023-3-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.1043-1060"
    },
    {
        "id": 5017,
        "title": "Anomaly Detection in Power Generation Plants with Generative Adversarial Networks",
        "authors": "Marcellin Atemkeng, Toheeb A. Jimoh",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecet58911.2023.10389251"
    },
    {
        "id": 5018,
        "title": "Interpreting generative adversarial networks to infer natural selection from genetic data",
        "authors": "Rebecca Riley, Iain Mathieson, Sara Mathieson",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "Abstract\nUnderstanding natural selection and other forms of non-neutrality is a major focus for the use of machine learning in population genetics. Existing methods rely on computationally intensive simulated training data. Unlike efficient neutral coalescent simulations for demographic inference, realistic simulations of selection typically require slow forward simulations. Because there are many possible modes of selection, a high dimensional parameter space must be explored, with no guarantee that the simulated models are close to the real processes. Finally, it is difficult to interpret trained neural networks, leading to a lack of understanding about what features contribute to classification. Here we develop a new approach to detect selection and other local evolutionary processes that requires relatively few selection simulations during training. We build upon a generative adversarial network trained to simulate realistic neutral data. This consists of a generator (fitted demographic model), and a discriminator (convolutional neural network) that predicts whether a genomic region is real or fake. As the generator can only generate data under neutral demographic processes, regions of real data that the discriminator recognizes as having a high probability of being “real” do not fit the neutral demographic model and are therefore candidates for targets of selection. To incentivize identification of a specific mode of selection, we fine-tune the discriminator with a small number of custom non-neutral simulations. We show that this approach has high power to detect various forms of selection in simulations, and that it finds regions under positive selection identified by state-of-the-art population genetic methods in three human populations. Finally, we show how to interpret the trained networks by clustering hidden units of the discriminator based on their correlation patterns with known summary statistics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/genetics/iyae024"
    },
    {
        "id": 5019,
        "title": "Reimagining Benin Bronzes using generative adversarial networks",
        "authors": "Minne Atairu",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00146-023-01761-7"
    },
    {
        "id": 5020,
        "title": "The performance analysis of generative adversarial networks",
        "authors": "Yi Shi, Yihang Zhou",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2656002"
    },
    {
        "id": 5021,
        "title": "PTcomp: Post-Training Compression Technique for Generative Adversarial Networks",
        "authors": "Dina Tantawy, Mohamed Zahran, Amr G. Wassal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3239786"
    },
    {
        "id": 5022,
        "title": "Generating synthetic electronic health record data using generative adversarial networks: A tutorial (Preprint)",
        "authors": "Chao Yan, Ziqi Zhang, Steve Nyemba, Zhuohang Li",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/52615"
    },
    {
        "id": 5023,
        "title": "PPGANet: Removal of Motion Artifacts from the PPG Signal Using Generative Adversarial Networks",
        "authors": "Phattarapong Sawangjai, Theerawit Wilaiprasitporn",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/biocas58349.2023.10388620"
    },
    {
        "id": 5024,
        "title": "Generating Socially Acceptable Robot Poses for Approaching Conversational Groups with Generative Adversarial Networks",
        "authors": "Kunxu Zhao, Zhengxi Hu, Jingtai Liu",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10240460"
    },
    {
        "id": 5025,
        "title": "Reviewing Fid and Sid Metrics on Generative Adversarial Networks",
        "authors": "Ricardo de Deijn, Aishwarya Batra, Brandon Koch, Naseef Mansoor, Hema Makkena",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "The growth of generative adversarial network (GAN) models has increased the ability of image processing and provides numerous industries with the technology to produce realistic image transformations. However, with the field being recently established there are new evaluation metrics that can further this research. Previous research has shown the Fréchet Inception Distance (FID) to be an effective metric when testing these image-to-image GANs in real-world applications. Signed Inception Distance (SID), a founded metric in 2023, expands on FID by allowing unsigned distances. This paper usespublic datasetsthat consist of façades, cityscapes, and maps within Pix2Pix and CycleGAN models. After trainin , these models are evaluated on both inception distance metrics which measure the generating performance of the trained models. Our findings indicate that usage of the metric SID incorporates an efficient and effective metric to complement, or even exceed the ability shown using the FID for the image-to-image GANs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140208"
    },
    {
        "id": 5026,
        "title": "Conditional Generative Adversarial Network with Optimal Machine Learning Based Intrusion Detection System",
        "authors": "K. Hemavathi, R. Latha",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370325"
    },
    {
        "id": 5027,
        "title": "COMPARING THE PERFORMANCE OF DIFFERENT GENERATIVE ADVERSARIAL NETWORKS ON REALISTIC AND ART IMAGES",
        "authors": "",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49432"
    },
    {
        "id": 5028,
        "title": "Beautification of images by generative adversarial networks",
        "authors": "Amar Music, Anne-Sofie Maerten, Johan Wagemans",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1167/jov.23.10.14"
    },
    {
        "id": 5029,
        "title": "Generative Adversarial Networks for Secure Data Transmission in Wireless Network",
        "authors": "E. Jayabalan, R. Pugazendi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.031200"
    },
    {
        "id": 5030,
        "title": "Exposure on Semi-Supervised Regression with Generative Adversarial Networks",
        "authors": "M. Rajeswari, P Shyamala, P. Chitra",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452577"
    },
    {
        "id": 5031,
        "title": "Improving Medical Image Synthesis using Generative Adversarial Networks",
        "authors": "Soumya K, Sunil Kumar Jakhar, Dinesh Kumar Yadav",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470903"
    },
    {
        "id": 5032,
        "title": "APIB-GAN: A generative adversarial networks based approach for anomaly prediction of internet behavior",
        "authors": "Yetong Fang",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.phycom.2024.102315"
    },
    {
        "id": 5033,
        "title": "Artificial expansion of power quality datasets using generative adversarial networks",
        "authors": "M. Stroot, K. Alefs, Ö. Sen, A. Ulbig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.0820"
    },
    {
        "id": 5034,
        "title": "CA-GAN: the synthesis of Chinese art paintings using generative adversarial networks",
        "authors": "Zihan Chen, Yi Zhang",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00371-023-03115-2"
    },
    {
        "id": 5035,
        "title": "Generative Adversarial Networks for Down Syndrome Face Generation",
        "authors": "Reda Baka, Hazem Zein, Amine Nait-Ali",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/biosmart58455.2023.10162087"
    },
    {
        "id": 5036,
        "title": "Generative Adversarial Networks as Weight Generators in Ensemble Classification",
        "authors": "Asmaa Yehia, Sherif Fahmy, Ahmed Fahmy",
        "published": "2023-5-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/airc57904.2023.10303257"
    },
    {
        "id": 5037,
        "title": "Generative Adversarial Networks in Healthcare: A Case Study on MRI Image Generation",
        "authors": "Beatriz Cepa, Cláudia Brito, António Sousa",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/enbeng58165.2023.10175330"
    },
    {
        "id": 5038,
        "title": "Zero-Shot Learning with Joint Generative Adversarial Networks",
        "authors": "Minwan Zhang, Xiaohua Wang, Yueting Shi, Shiwei Ren, Weijiang Wang",
        "published": "2023-5-19",
        "citations": 1,
        "abstract": "Zero-shot learning (ZSL) is implemented by transferring knowledge from seen classes to unseen classes through embedding space or feature generation. However, the embedding-based method has a hubness problem, and the generation-based method may contain considerable bias. To solve these problems, a joint model with multiple generative adversarial networks (JG-ZSL) is proposed in this paper. Firstly, we combined the generation-based model and the embedding-based model to build a hybrid ZSL framework by mapping the real samples and the synthetic samples into the embedding space for classification, which alleviates the problem of data imbalance effectively. Secondly, based on the original generation-method model, a coupled GAN is introduced to generate semantic embeddings, which can generate semantic vectors for unseen classes in embedded space to alleviate the bias of mapping results. Finally, semantic-relevant self-adaptive margin center loss was used, which can explicitly encourage intra-class compactness and inter-class separability, and it can also guide coupled GAN to generate discriminative and representative semantic features. All the experiments on the four standard datasets (CUB, AWA1, AWA2, SUN) show that the proposed method is effective.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12102308"
    },
    {
        "id": 5039,
        "title": "Using Reinforcement Learning to Train Generative Adversarial Networks for Image Generation",
        "authors": "Austin Nguyen, Rong Jin",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc57344.2023.10099199"
    },
    {
        "id": 5040,
        "title": "Computer-Aided Brand Logo Design Based on Generative Adversarial Networks",
        "authors": "Man Ma, Wen Zhao",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s25.60-75"
    },
    {
        "id": 5041,
        "title": "Multiclass Skin Disease Classification using Generative Adversarial Networks and Neural Network Models",
        "authors": "Karan S, Suja Palaniswamy",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276149"
    },
    {
        "id": 5042,
        "title": "Transfer Learning-Based Classification of Maxillary Sinus Using Generative Adversarial Networks",
        "authors": "Mohammad Alhumaid, Ayman G. Fayoumi",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "Paranasal sinus pathologies, particularly those affecting the maxillary sinuses, pose significant challenges in diagnosis and treatment due to the complex anatomical structures and diverse disease manifestations. The aim of this study is to investigate the use of deep learning techniques, particularly generative adversarial networks (GANs), in combination with convolutional neural networks (CNNs), for the classification of sinus pathologies in medical imaging data. The dataset is composed of images obtained through computed tomography (CT) scans, covering cases classified into “Moderate”, “Severe”, and “Normal” classes. The lightweight GAN is applied to augment a dataset by creating synthetic images, which are then used to train and test the ResNet-50 and ResNeXt-50 models. The model performance is optimized using random search to perform hyperparameter tuning, and the evaluation is conducted extensively for various metrics like accuracy, precision, recall, and the F1-score. The results demonstrate the effectiveness of the proposed approach in accurately classifying sinus pathologies, with the ResNeXt-50 model achieving superior performance with accuracy: 91.154, precision: 0.917, recall: 0.912, and F1-score: 0.913 compared to ResNet-50. This study highlights the potential of GAN-based data augmentation and deep learning techniques in enhancing the diagnosis of maxillary sinus diseases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14073083"
    },
    {
        "id": 5043,
        "title": "Control for Intelligent Connected Vehicles Platoon Based on Deep Convolutional Generative Adversarial Networks",
        "authors": "Zirui Ding, Xianghui Song, Junping Xiang, Taotao Zhang",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484869.023"
    },
    {
        "id": 5044,
        "title": "Brain Tumour Segmentation Using Wasserstein Generative Adversarial Networks(WGANs)",
        "authors": "S. Nyamathulla, Ch.Sai Meghana, K. Yasaswi",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoei56765.2023.10125776"
    },
    {
        "id": 5045,
        "title": "Postprocessing Ensemble Forecasts with Generative Adversarial Networks for Daily Precipitation",
        "authors": "Huidong Jin, Yaozhong Liu, Quanxi Shao, Ming Li",
        "published": "2023-12-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ickg59574.2023.00024"
    },
    {
        "id": 5046,
        "title": "Image Enhancement Utilizing Generative Adversarial Networks for Improving the Accuracy of Pest Insect Classification",
        "authors": "Shivam Khurana",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245901"
    },
    {
        "id": 5047,
        "title": "Super Resolution Generative Adversarial Networks for Multi-Fidelity Pressure Distribution Prediction",
        "authors": "Xiaosong Du, Joaquim R. Martins",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-0533"
    },
    {
        "id": 5048,
        "title": "Leveraging Ensemble Learning with Generative Adversarial Networks for Imbalanced Software Defects Prediction",
        "authors": "Amani Alqarni, Hamoud Aljamaan",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "Software defect prediction is an active research area. Researchers have proposed many approaches to overcome the imbalanced defect problem and build highly effective machine learning models that are not biased towards the majority class. Generative adversarial networks (GAN) are one of the state-of-the-art techniques that can be used to generate synthetic samples of the minority class and produce a balanced dataset. However, it was not investigated thoroughly in the area of imbalanced defect prediction. In this paper, we proposed to combine GAN-based methods with boosting ensembles to yield robust defect prediction models. GAN-based methods were used to balance the defect datasets, and the AdaBoost ensemble was employed to classify the modules into defective and non-defective modules. Our proposed approach was investigated within the context of 10 software defect datasets with different imbalance ratios. Wilcoxon effect size and Scott–Knott effect size difference tests were used as statistical tests to quantify the model’s performance differences statistically. Empirical results indicated that GAN-based methods need hyperparameter optimization when used for imbalanced software defect prediction. In comparison to the traditional sampling techniques, GAN methods outperformed all traditional techniques when used for imbalanced defect prediction. Lastly, results demonstrated that GAN-based methods should not be combined with undersampling to handle imbalance problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132413319"
    },
    {
        "id": 5049,
        "title": "Carbon Price Prediction for the European Carbon Market Using Generative Adversarial Networks",
        "authors": "Yuzhi Chen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/me.2024.153011"
    },
    {
        "id": 5050,
        "title": "Generative Adversarial Networks for the Synthesis of Chest X-ray Images",
        "authors": "Mai Feng Ng, Carol Anne Hargreaves",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/asec2022-13954"
    },
    {
        "id": 5051,
        "title": "Researches Advanced in Finance based on Generative Adversarial Networks",
        "authors": "Zihan Chen, Yifei Wang, Shuchen Zhang",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Topics about how to apply Generative Adversarial Networks (GANs) to finance industry and research to promote financial market prosperity and progress with deep learning technology never fail to arouse public attention. For instance, financial academic realm such as portfolio optimization, trade execution strategies and financial information progressing have made use of machine learning. After a large number of literature retrieval and attempts to classify from different aspects, we ultimately find out that GAN is one of the most famous and appropriate technologies widely adopted in academic research and commercial applications. Aiming at assisting reader with having insight into how GAN improved financial work’s efficiency, in this paper, we propose three research perspectives of GAN in financial work: Stock Market Prediction, Fault Detection, and Time Series. By organizing from an innovative and macro perspective, we present and classify the application methods of GAN and the improvement of the basic model of GAN in order to adapt to the corresponding fields under the corresponding research directions. In general, the following improved models based on the basic GAN model for the corresponding financial perspective are involved: GAN of three-layer dense network, GAN with the MLP and LSTM separately as the discriminator and the generator, GAN-FD stock projection model, BERT and GAN in Stock Prediction; SSGANs, DAEGAN in Fault Detection; SeqGAN, Quant GAN, RNN-GAN, PSA-GAN in Time Series.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v39i.6568"
    },
    {
        "id": 5052,
        "title": "Reconstructing Static Memories from the Brain with EEG Feature Extraction and Generative Adversarial Networks",
        "authors": "Jeremy Lu, Matthew Zhang, Hisam Masoom",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4400662"
    },
    {
        "id": 5053,
        "title": "Research on Data Augmentation of Dynamic Object Detection Based on Generative Adversarial Networks",
        "authors": "Yizhou Song",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci57876.2023.10176878"
    },
    {
        "id": 5054,
        "title": "Ultrasonic imaging using conditional generative adversarial networks",
        "authors": "Nathan Molinier, Guillaume Painchaud-April, Alain Le Duff, Matthew Toews, Pierre Bélanger",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ultras.2023.107015"
    },
    {
        "id": 5055,
        "title": "Generative Adversarial Networks-based solution for improving medical data quality and insufficiency",
        "authors": "Chenxi Gao",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "As big data brings intelligent solutions and innovations to various fields, the goal of this research is to solve the problem of poor-quality and insufficient datasets in the medical field, to help poor areas can access to high quality and rich medical datasets as well. This study focuses on solving the current problem by utilizing variants of generative adversarial network, Super Resolution Generative Adversarial Network (SRGAN) and Deep Convolutional Generative Adversarial Network (DCGAN). In this study, OpenCV is employed to introduce fuzziness to the Brain Tumor MRI Dataset, resulting in a blurred dataset. Subsequently, the research utilizes both the unaltered and blurred datasets to train the SRGAN model, which is then applied to enhance the low-quality dataset through inpainting. Moving forward, the original dataset, low-quality dataset, and the improved dataset are each used independently to train the DCGAN model.  In order to compare the difference between the produced image datasets and the real dataset, the FID Score is separately computed. The results of the study found that by training DCGAN with SRGAN repaired medical dataset, the naked eye can observe that the medical image dataset is significantly clearer and there is a reduction in Frchet Inception Distance (FID) Score. Therefore, by using SRGAN and DCGAN the current problem of low quality and small quantity of datasets in the medical field can be solved, which increase the potential possibilities of big data in artificial intelligence filed of medicine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/49/20241086"
    },
    {
        "id": 5056,
        "title": "Generative Multi-Physics Models for System Power and Thermal Analysis Using Conditional Generative Adversarial Networks",
        "authors": "Priyank Kashyap, Chris Cheng, Yongjin Choi, Paul Franzon",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/epeps58208.2023.10314864"
    },
    {
        "id": 5057,
        "title": "Study of the effectiveness of Generative Adversarial Networks towards Music Generation",
        "authors": "Megh Singhal, Bhawna Saxena, Abhishek Pratap Singh, Anurag Baranwal",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ici60088.2023.10421735"
    },
    {
        "id": 5058,
        "title": "Online Power System Event Detection via Bidirectional Generative Adversarial Networks",
        "authors": "Yuanbin Cheng, Nanpeng Yu, Brandon Foggo, Koji Yamashita",
        "published": "2023-7-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pesgm52003.2023.10253344"
    },
    {
        "id": 5059,
        "title": "Generative Adversarial Networks (GAN) and HDFS-Based Realtime Traffic Forecasting System Using CCTV Surveillance",
        "authors": "Praveen Devadhas Sujakumari, Paulraj Dassan",
        "published": "2023-3-23",
        "citations": 7,
        "abstract": "The most crucial component of any smart city traffic management system is traffic flow prediction. It can assist a driver in selecting the most efficient route to their destination. The digitalization of closed-circuit television (CCTV) systems has resulted in more effective and capable surveillance imaging systems for security applications. The number of automobiles on the world’s highways has steadily increased in recent decades. However, road capacity has not developed at the same rate, resulting in significantly increasing congestion. The model learning mechanism cannot be guided or improved by prior domain knowledge of real-world problems. In reality, symmetrical features are common in many real-world research objects. To mitigate this severe situation, the researchers chose adaptive traffic management to make intelligent and efficient use of the current infrastructure. Data grow exponentially and become a complex item that must be managed. Unstructured data are a subset of big data that are difficult to process and have volatile properties. CCTV cameras are used in traffic management to monitor a specific point on the roadway. CCTV generates unstructured data in the form of images and videos. Because of the data’s intricacy, these data are challenging to process. This study proposes using big data analytics to transform real-time unstructured data from CCTV into information that can be shown on a web dashboard. As a Hadoop-based architectural stack that can serve as the ICT backbone for managing unstructured data efficiently, the Hadoop Distributed File System (HDFS) stores several sorts of data using the Hadoop file storage system, a high-performance integrated virtual environment (HIVE) tables, and non-relational storage. Traditional computer vision algorithms are incapable of processing such massive amounts of visual data collected in real-time. However, the inferiority of traffic data and the quality of unit information are always symmetrical phenomena. As a result, there is a need for big data analytics with machine learning, which entails processing and analyzing vast amounts of visual data, such as photographs or videos, to uncover semantic patterns that may be interpreted. As a result, smart cities require a more accurate traffic flow prediction system. In comparison to other recent methods applied to the dataset, the proposed method achieved the highest accuracy of 98.21%. In this study, we look at the construction of a secure CCTV strategy that predicts traffic from CCTV surveillance using real-time traffic prediction analysis with generative adversarial networks (GAN) and HDFS.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sym15040779"
    },
    {
        "id": 5060,
        "title": "Unsupervised anomaly detection with generative adversarial networks in mammography",
        "authors": "Seungju Park, Kyung Hwa Lee, Beomseok Ko, Namkug Kim",
        "published": "2023-2-20",
        "citations": 6,
        "abstract": "AbstractBreast cancer is a common cancer among women, and screening mammography is the primary tool for diagnosing this condition. Recent advancements in deep-learning technologies have triggered the implementation of research studies via mammography. Semi-supervised or unsupervised methods are often used to overcome the limitations of supervised learning, such as manpower and time, for labeling in clinical situations where abnormal data are significantly lacking. Accordingly, we proposed a generative model that uses a state-of-the-art generative network (StyleGAN2) to create high-quality synthetic mammographic images and an anomaly detection method to detect breast cancer on mammograms in unsupervised methods. The generation model was trained via only normal mammograms and breast cancer classification was performed via anomaly detection using 50 breast cancer and 50 normal mammograms that did not overlap with the dataset for generative model learning. Our generative model has shown comparable fidelity to real images, and the anomaly detection method via this generative model showed high sensitivity, demonstrating its potential for breast cancer screening. This method could differentiate between normal and cancer-positive mammogram and help overcome the weakness of current supervised methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-29521-z"
    },
    {
        "id": 5061,
        "title": "Auto-Encoding Generative Adversarial Networks towards Mode Collapse Reduction and Feature Representation Enhancement",
        "authors": "Yang Zou, Yuxuan Wang, Xiaoxiang Lu",
        "published": "2023-12-13",
        "citations": 2,
        "abstract": "Generative Adversarial Nets (GANs) are a kind of transformative deep learning framework that has been frequently applied to a large variety of applications related to the processing of images, video, speech, and text. However, GANs still suffer from drawbacks such as mode collapse and training instability. To address these challenges, this paper proposes an Auto-Encoding GAN, which is composed of a set of generators, a discriminator, an encoder, and a decoder. The set of generators is responsible for learning diverse modes, and the discriminator is used to distinguish between real samples and generated ones. The encoder maps generated and real samples to the embedding space to encode distinguishable features, and the decoder determines from which generator the generated samples come and from which mode the real samples come. They are jointly optimized in training to enhance the feature representation. Moreover, a clustering algorithm is employed to perceive the distribution of real and generated samples, and an algorithm for cluster center matching is accordingly constructed to maintain the consistency of the distribution, thus preventing multiple generators from covering a certain mode. Extensive experiments are conducted on two classes of datasets, and the results visually and quantitatively demonstrate the preferable capability of the proposed model for reducing mode collapse and enhancing feature representation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25121657"
    },
    {
        "id": 5062,
        "title": "Augmenting RetinaFace Model with Conditional Generative Adversarial Networks for Hair Segmentation",
        "authors": "Zhuojun Yu, Ka-Cheng Choi",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaibd57115.2023.10206258"
    },
    {
        "id": 5063,
        "title": "A Fuzzing Data Generation Method Based on Conditional Generative Adversarial Networks",
        "authors": "Zizheng Zhong, Haihang Wang",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsess58500.2023.10293074"
    },
    {
        "id": 5064,
        "title": "Reviving Black and White Images: Enhancing Colorization with Generative Adversarial Networks (GANs)",
        "authors": "Rahul Rahul, Devanshu Walecha",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306534"
    },
    {
        "id": 5065,
        "title": "Generative adversarial networks for real-time realistic physics simulations",
        "authors": "Mark Harlow, Matthew Martinez, Xiaoyan Han, Stoian Borissov, Jason Hill",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663951"
    },
    {
        "id": 5066,
        "title": "Reconstructing Static Memories from the Brain with EEG Feature Extraction and Generative Adversarial Networks",
        "authors": "Matthew Zhang",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Forensic tools and facial recognition techniques have implemented state memory reconstruction in the court of law. Recent research has incorporated machine learning into this field in order to fulfill the rising demand for this service. However, the suggested solutions require expensive cutting-edge equipment such as fMRI and CT scanners. The goal of the present study is to recreate images using user electroencephalography (EEG) input patterns. We combined a discriminator and generator network in order to decrease blur, face distortion, and erroneous features in the ImageNet dataset. An EEG feature matrix was produced using a convolutional neural network (CNN) encoder from spectrogram inputs, which are visual representations of the spectrum of electrical frequencies observed at each electrode. The encoder produced an 85% accuracy when linking spectrograms to the labels of the relevant images. The feature matrix was passed into the GAN during training. The viability of image reconstruction and coherent image representation from the brain were both proved feasible to a dependable degree due to our GAN output images’ resemblance to the original dataset. The present work could find applications in future studies as a non-invasive, more affordable option to recreate memories from brain signals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsrhs.v12i1.4178"
    },
    {
        "id": 5067,
        "title": "Enhancing Image Captioning Using Deep Convolutional Generative Adversarial Networks",
        "authors": "Tarun Jaiswal, Manju Pandey, Priyanka Tripathi",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "\nIntroduction:\nIntroduction: Image caption generation has long been a fundamental challenge in the\narea of computer vision (CV) and natural language processing (NLP). In this research, we present\nan innovative approach that harnesses the power of Deep Convolutional Generative Adversarial\nNetworks (DCGAN) and adversarial training to revolutionize the generation of natural\nand contextually relevant image captions.\n\n\nMethod:\nOur method significantly improves the\nfluency, coherence, and contextual relevance of generated captions and showcases the effectiveness\nof RL reward-based fine-tuning. Through a comprehensive evaluation of COCO datasets,\nour model demonstrates superior performance over baseline and state-of-the-art methods.\nOn the COCO dataset, our model outperforms current state-of-the-art (SOTA) models\nacross all metrics, achieving BLEU-4 (0.327), METEOR (0.249), Rough (0.525) and CIDEr\n(1.155) scores.\n\n\nResult:\nThe integration of DCGAN and adversarial training opens new possibilities\nin image captioning, with applications spanning from automated content generation to enhanced\naccessibility solutions.\n\n\nConclusion:\nThis research paves the way for more intelligent\nand context-aware image understanding systems, promising exciting future exploration and innovation\nprospects.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/0126662558282389231229063607"
    },
    {
        "id": 5068,
        "title": "ReverseGAN: An intelligent reverse generative adversarial networks system for complex image captioning generation",
        "authors": "Guoxiang Tong, Wei Shao, Yueyang Li",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.displa.2024.102653"
    },
    {
        "id": 5069,
        "title": "Self-Supervised Dusty Image Enhancement Using Generative Adversarial Networks",
        "authors": "Mahsa Mohamadi, Ako Bartani, Fardin Akhlaghian Tab",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipria59240.2023.10147177"
    },
    {
        "id": 5070,
        "title": "An analysis of DOOM level generation using Generative Adversarial Networks",
        "authors": "Edoardo Giacomello, Pier Luca Lanzi, Daniele Loiacono",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.entcom.2023.100549"
    },
    {
        "id": 5071,
        "title": "Histopathological Image Synthesis with Generative Adversarial Networks for Nuclei Segmentation",
        "authors": "Mahesh Gour, Reenu Rajpoot, Sweta Jain",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-02440-6"
    },
    {
        "id": 5072,
        "title": "A REVIEW ON REAL WORLD IMAGE INTO CARTOON STYLE IMAGE  USING GENERATIVE ADVERSARIAL NETWORKS",
        "authors": "",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets34585"
    },
    {
        "id": 5073,
        "title": "Structural Plan Schema Generation Through Generative Adversarial Networks",
        "authors": "Kamile Öztürk Kösenciğ, Elif Bahar Okuyucu, Özgün Balaban",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00004-024-00766-z"
    },
    {
        "id": 5074,
        "title": "Researches Advanced in Generative Adversarial Networks and Their Applications for Image-Generating NFT",
        "authors": "Xiaolin Guo",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "A generative adversarial network is a deep learning model, an unsupervised learning method. In computer vision, the generative adversarial network is a research direction with rapid development in recent years; Similarly, the rise of cryptocurrency Non-Fungible Tokens (NFT) in recent years has also attracted much attention to the field of art. As an \"irreplaceable currency\" NFT provides a more novel and convenient way for content creators and artists to create and increases the continuous income of original creators. At the same time, it has also attracted widespread attention to the financial field. Therefore, this paper is determined to combine the generative adversarial network of the production of NFT and discuss and analyze the autonomous computer generation of artworks. Firstly, this paper starts with the model's structure, the design of the objective function, Block chain technology, and Irreplaceable tokens encrypted using blockchain technology. Then, the image generated by the whole generative adversarial network and transformed into NFT works are described in detail. In addition, this paper briefly discusses the development ethics of human art and machine art and the prospects for its development trend.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v39i.6562"
    },
    {
        "id": 5075,
        "title": "Research on Ethnic Pattern Generation Based on Generative Adversarial Networks",
        "authors": "Hao Wu, Wenze He, Xiongfei Li, Yanchun Liang",
        "published": "2023-5-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaci58115.2023.10146174"
    },
    {
        "id": 5076,
        "title": "Lifespan Face Age Progression using 3D-Aware Generative Adversarial Networks",
        "authors": "Eric Kastl Jensen, Morten Bjerre, Marcel Grimmer, Christoph Busch",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcb57857.2023.10448629"
    },
    {
        "id": 5077,
        "title": "Multi-Objective Optimized Generative Adversarial Networks For Video Anomaly Detection",
        "authors": "Zhexiao Cao, Yao Fu, Tian Wang, Deyuan Liu, Jian Wang, Hichem Snoussi",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451201"
    },
    {
        "id": 5078,
        "title": "Airborne Radar Forward-Looking Imaging Algorithm Based on Generative Adversarial Networks",
        "authors": "Fangning Li, Di Wu, Baomin Gu, Jinke Dai, Wei Li",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/irs57608.2023.10172417"
    },
    {
        "id": 5079,
        "title": "(Retracted) Super-resolution generative adversarial networks using autoencoder reduce dimension",
        "authors": "Qian Xiang, Guohua Zhao, Huabing Cheng",
        "published": "2023-1-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.6.062504"
    },
    {
        "id": 5080,
        "title": "Medical image super-resolution reconstruction: A comprehensive investigation of Generative Adversarial Networks",
        "authors": "Yuntian Bao",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "Medical images play a crucial role in modern healthcare diagnostics and treatment. However, many medical images suffer from limitations in resolution, potentially impeding a comprehensive understanding of a patient's condition by healthcare professionals. This comprehensive review delves into the applications of Generative Adversarial Networks (GANs) in medical image super-resolution reconstruction to address this challenge. In the Methods section, this paper first focused on the direction of medical image classification, including cell classification of histopathological images and synthetic data enhancement using GANs to improve liver lesion classification. Subsequently, this paper focused on the direction of medical image segmentation, looking into the use of Structure-Corrected Adversarial Networks (SCAN) for organ segmentation in chest radiographs and Deep Adversarial Networks for biomedical image segmentation using unannotated images. In the Applications and Discussion section, this paper thoroughly examined the current progress of GANs in telemedicine diagnosis and disease state generation and prediction. This paper emphasized the significant potential of GAN technology in telemedicine while outlining the current constraints and challenges. Furthermore, this paper highlighted the prospects of GANs in medical image super-resolution reconstruction and how they affect the discipline of medical imaging. This comprehensive review consolidates the latest research findings on GANs in medical image super-resolution reconstruction, underscoring their importance in the realm of healthcare. By critically analysing existing literature, this paper provides valuable insights for medical image analysts are researchers while inspiring future research directions and innovations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/51/20241148"
    },
    {
        "id": 5081,
        "title": "Facial Image Restoration Algorithm Based on Generative Adversarial Networks",
        "authors": "Jia Yuan, Yujun Liu, Dongbo Zhang",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca60615.2024.10470952"
    },
    {
        "id": 5082,
        "title": "ViT-R50 GAN: Vision Transformers Hybrid Model based Generative Adversarial Networks for Image Generation",
        "authors": "Yang Huang",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccece58074.2023.10135253"
    },
    {
        "id": 5083,
        "title": "MotGen: a closed-loop bacterial motility control framework using generative adversarial networks",
        "authors": "BoGeum Seo, DoHee Lee, Heungjin Jeon, Junhyoung Ha, SeungBeum Suh",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "Abstract\n\nMotivation\nMany organisms’ survival and behavior hinge on their responses to environmental signals. While research on bacteria-directed therapeutic agents has increased, systematic exploration of real-time modulation of bacterial motility remains limited. Current studies often focus on permanent motility changes through genetic alterations, restricting the ability to modulate bacterial motility dynamically on a large scale. To address this gap, we propose a novel real-time control framework for systematically modulating bacterial motility dynamics.\n\n\nResults\nWe introduce MotGen, a deep learning approach leveraging Generative Adversarial Networks (GANs) to analyze swimming performance statistics of motile bacteria based on live cell imaging data. By tracking objects and optimizing cell trajectory mapping under environmentally altered conditions, we trained MotGen on a comprehensive statistical dataset derived from real image data. Our experimental results demonstrate MotGen’s ability to capture motility dynamics from real bacterial populations with low mean absolute error in both simulated and real datasets. MotGen allows us to approach optimal swimming conditions for desired motility statistics in real-time. MotGen’s potential extends to practical biomedical applications, including immune response prediction, by providing imputation of bacterial motility patterns based on external environmental conditions. Our short-term, in-situ interventions for controlling motility behavior offer a promising foundation for the development of bacteria-based biomedical applications.\n\n\nAvailability\nMotGen is presented as a combination of Matlab image analysis code and a machine learning workflow in Python. Codes are available at https://github.com/bgmseo/MotGen, for cell tracking and implementation of trained models to generate bacterial motility statistics.\n\n\nSupplementary information\nSupplementary data are available at Bioinformatics online.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioinformatics/btae170"
    },
    {
        "id": 5084,
        "title": "Leak detection and localization in water distribution networks using conditional deep convolutional generative adversarial networks",
        "authors": "Mohammad Mahdi Rajabi, Pooya Komeilian, Xi Wan, Raziyeh Farmani",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.watres.2023.120012"
    },
    {
        "id": 5085,
        "title": "Generative adversarial networks: Core principles, cutting-edge models, broad applications, and contemporary challenges",
        "authors": "Xiangzhong Ye",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "Generative adversarial networks stand out as one of the most notable innovations in the field of artificial intelligence. Often lauded for their capacity to emulate specific data distributions, their primary function is to discern the underlying characteristics of these distributions and subsequently generate data that mirrors them. In the realm of computer vision, GANs have showcased remarkable prowess by producing high-quality, realistic content. This capability has not only bolstered their reputation but also expanded their applicability across a multitude of tasks. However, the ascendancy of GANs isnt without its set of challenges. Training them can often be a delicate balancing act, as they require careful tuning to ensure stability. Issues like mode collapse, where the generator produces limited varieties of outputs, or training instabilities are not uncommon. Nonetheless, the inherent scalability and versatility of GANs continue to captivate researchers, making them a hotspot for innovation. As we delve deeper into the AI epoch, the potential of GANs remains vast, presenting both unprecedented opportunities and challenges.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/53/20241139"
    },
    {
        "id": 5086,
        "title": "Exploring How Generative Adversarial Networks Learn Phonological Representations",
        "authors": "Jingyi Chen, Micha Elsner",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.175"
    },
    {
        "id": 5087,
        "title": "Image-Based Optimization of Electrical Machines Using Generative Adversarial Networks",
        "authors": "Michael Heroth, Helmut C. Schmid, Rainer Herrler, Wilfried Hofmann",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iemdc55163.2023.10239041"
    },
    {
        "id": 5088,
        "title": "Neural Audio Decorrelation Using Generative Adversarial Networks",
        "authors": "Carlotta Anemüller, Oliver Thiergart, Emanuël A. P. Habets",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/waspaa58266.2023.10248167"
    },
    {
        "id": 5089,
        "title": "Optimal Design of Color Laparoscopic Super-Resolution Image Quality Based on Generative Adversarial Networks",
        "authors": "Norifumi Kawabata, Toshiya Nakaguchi",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cgip58526.2023.00009"
    },
    {
        "id": 5090,
        "title": "Conditional Facies Simulations in Fluvial Environments: Appraisal of Self-Attention Generative Adversarial Networks (SAGAN)",
        "authors": "V. Goldité, A. Bouziat, J. Lecomte, T. Faney",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202439042"
    },
    {
        "id": 5091,
        "title": "Assessing Risk Factors with Generative Adversarial Networks for Cardiac Arrest Detection",
        "authors": "Sunil Kumar Gaur, Preethi D, Monika Abrol",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470506"
    },
    {
        "id": 5092,
        "title": "Robustness of Image-Based Malware Classification Models trained with Generative Adversarial Networks",
        "authors": "Ciaran Reilly, Stephen O Shaughnessy, Christina Thorpe",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590777.3590792"
    },
    {
        "id": 5093,
        "title": "Airfoil shape parameterization using reconstruction-error-minimizing generative adversarial networks",
        "authors": "Marius L. Ruh, Xiangbei Liu, Rose Yu, John T. Hwang",
        "published": "2023-6-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-3722"
    },
    {
        "id": 5094,
        "title": "A Consideration on Ternary Adversarial Generative Networks",
        "authors": "Kennichi Nakamura, Hiroki Nakahara",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ismvl57333.2023.00012"
    },
    {
        "id": 5095,
        "title": "Image inpainting based on double joint predictive filtering and Wasserstein generative adversarial networks",
        "authors": "Yuanchen Liu, Zhongliang Pan",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.6.063008"
    },
    {
        "id": 5096,
        "title": "Generative Adversarial Networks (GANs) in the Wild: Applications, Challenges, and Future Prospects",
        "authors": "Rakesh Kumar, Pooja Chaudhary, Shilpi Gupta, Manoj Singhal",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489538"
    },
    {
        "id": 5097,
        "title": "HSGAN-IoT: A hierarchical semi-supervised generative adversarial networks for IoT device classification",
        "authors": "Yanliang Jin, Jiahao Zhou, Yuan Gao",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2024.110299"
    },
    {
        "id": 5098,
        "title": "Enhancement Method of Reservoir Numerical Simulation Based on Generative Adversarial Networks",
        "authors": "Shuopeng Yang",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbaie59714.2023.10281235"
    },
    {
        "id": 5099,
        "title": "Deep Learning Reconstruction for Single Pixel Imaging with Generative Adversarial Networks",
        "authors": "Baturalp Güven, Alper Güngör, M. Umut Bahçeci, Tolga Çukur",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223149"
    },
    {
        "id": 5100,
        "title": "A Simulation &amp; Technical Feasibility Study for Removing Blur Artefacts from Emission Tomography Images Using Generative Adversarial Networks",
        "authors": "Ahmet Emin Yetkin, Albert Güveniş",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tiptekno59875.2023.10359231"
    },
    {
        "id": 5101,
        "title": "Sparse Self-Attention Guided Generative Adversarial Networks for Time-Series Generation",
        "authors": "Nourhan Ahmed, Lars Schmidt-Thieme",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsaa60987.2023.10302513"
    },
    {
        "id": 5102,
        "title": "Unveining the Mask: Strategies for Detecting DeepFake Face Swapping Using Generative Adversarial Networks",
        "authors": "Shachi Mall, Ayush Mall",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486289"
    },
    {
        "id": 5103,
        "title": "Evaluating generation of chaotic time series by convolutional generative adversarial networks",
        "authors": "Yuki Tanaka, Yutaka Yamaguti",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14495/jsiaml.15.117"
    },
    {
        "id": 5104,
        "title": "Application and Simulation of Animation Scene Construction and Rendering Based on Generative Adversarial Networks",
        "authors": "Jiangtin Yan, Pengju Pu",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s12.66-81"
    }
]