[
    {
        "id": 17905,
        "title": "Surpassing early stopping: A novel correlation-based stopping criterion for neural networks",
        "authors": "Tamás Miseta, Attila Fodor, Ágnes Vathy-Fogarassy",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.127028"
    },
    {
        "id": 17906,
        "title": "Influence of Learning Rate Hyper-Parameter and Early Stopping Training Technique in Training Vanilla Neural Network Model for Effective Signal Power Loss Prediction",
        "authors": "Virginia Chika Ebhota, Thokozani Shongwe",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15866/irecap.v13i5.23606"
    },
    {
        "id": 17907,
        "title": "Gravity inversion method using <i>L</i><sub>0</sub>-norm constraint with auto-adaptive regularization and combined stopping criteria",
        "authors": "Mesay Geletu Gebre, Elias Lewi",
        "published": "2023-2-3",
        "citations": 4,
        "abstract": "Abstract. We present a gravity inversion method that can produce compact and sharp images\nto assist the modeling of non-smooth geologic features.\nThe proposed iterative inversion approach makes use of L0-norm-stabilizing functional,\nhard and physical parameter inequality constraints and a depth-weighting function.\nThe method incorporates an auto-adaptive regularization technique, which automatically\ndetermines a suitable regularization parameter and error-weighting function that helps to\nimprove both the stability and convergence of the method.\nThe auto-adaptive regularization and error-weighting matrix are not dependent on the known noise level.\nBecause of that, the method yields reasonable results even if the noise level of the data is\nnot known properly. The utilization of an effectively combined stopping rule to terminate the inversion process is another\nimprovement that is introduced in this work. The capacity and the efficiency of the new inversion method were\ntested by inverting randomly chosen synthetic and measured data. The synthetic test models consist of multiple\ncausative blocky bodies, with different geometries and density distributions that are vertically and horizontally\ndistributed adjacent to each other. Inversion results of the synthetic data show that the developed method can\nrecover models that adequately match the real geometry, location and densities of the synthetic causative bodies.\nFurthermore, the testing of the improved approach using published real gravity data confirmed the potential and\npracticality of the method in producing compact and sharp inverse images of the subsurface.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/se-14-101-2023"
    },
    {
        "id": 17908,
        "title": "An Adaptive Early Stopping Technique for DenseNet169-Based Knee Osteoarthritis Detection Model",
        "authors": "Bander Ali Saleh Al-rimy, Faisal Saeed, Mohammed Al-Sarem, Abdullah M. Albarrak, Sultan Noman Qasem",
        "published": "2023-5-29",
        "citations": 2,
        "abstract": "Knee osteoarthritis (OA) detection is an important area of research in health informatics that aims to improve the accuracy of diagnosing this debilitating condition. In this paper, we investigate the ability of DenseNet169, a deep convolutional neural network architecture, for knee osteoarthritis detection using X-ray images. We focus on the use of the DenseNet169 architecture and propose an adaptive early stopping technique that utilizes gradual cross-entropy loss estimation. The proposed approach allows for the efficient selection of the optimal number of training epochs, thus preventing overfitting. To achieve the goal of this study, the adaptive early stopping mechanism that observes the validation accuracy as a threshold was designed. Then, the gradual cross-entropy (GCE) loss estimation technique was developed and integrated to the epoch training mechanism. Both adaptive early stopping and GCE were incorporated into the DenseNet169 for the OA detection model. The performance of the model was measured using several metrics including accuracy, precision, and recall. The obtained results were compared with those obtained from the existing works. The comparison shows that the proposed model outperformed the existing solutions in terms of accuracy, precision, recall, and loss performance, which indicates that the adaptive early stopping coupled with GCE improved the ability of DenseNet169 to accurately detect knee OA.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13111903"
    },
    {
        "id": 17909,
        "title": "Correction to: Posterior alternatives with informative early stopping",
        "authors": "Nancy Flournoy, Sergey Tarima",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00362-023-01450-z"
    },
    {
        "id": 17910,
        "title": "Speeding Up Unsupervised Learning Through Early Stopping",
        "authors": "Andris Docaj, Yu Zhuang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386405"
    },
    {
        "id": 17911,
        "title": "The Weights Reset Technique for Deep Neural Networks Implicit Regularization",
        "authors": "Grigoriy Plusch, Sergey Arsenyev-Obraztsov, Olga Kochueva",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "We present a new regularization method called Weights Reset, which includes periodically resetting a random portion of layer weights during the training process using predefined probability distributions. This technique was applied and tested on several popular classification datasets, Caltech-101, CIFAR-100 and Imagenette. We compare these results with other traditional regularization methods. The subsequent test results demonstrate that the Weights Reset method is competitive, achieving the best performance on Imagenette dataset and the challenging and unbalanced Caltech-101 dataset. This method also has sufficient potential to prevent vanishing and exploding gradients. However, this analysis is of a brief nature. Further comprehensive studies are needed in order to gain a deep understanding of the computing potential and limitations of the Weights Reset method. The observed results show that the Weights Reset method can be estimated as an effective extension of the traditional regularization methods and can help to improve model performance and generalization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computation11080148"
    },
    {
        "id": 17912,
        "title": "Posterior alternatives with informative early stopping",
        "authors": "Nancy Flournoy, Sergey Tarima",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00362-023-01429-w"
    },
    {
        "id": 17913,
        "title": "Stopping by Woods in Mashpee Territory: Belonging in William Apess's Indian Nullification",
        "authors": "Lloyd Alimboyao Sy",
        "published": "2023",
        "citations": 0,
        "abstract": " Abstract: This essay analyzes how William Apess's Indian Nullification (1835) articulates a form of belonging that emphasizes inclusivity and communality (affiliative belonging) against settler colonialism's insistence that belonging is anchored in possession and property (proprietary belonging). It draws on recent critical appraisals of Indigenous kinship and community that emphasize the commingling of Native and white practices, but it centers tangible environmental markers—specifically the cutting and carting away of wood as presented in Apess's text—as the loci for a more general argument over how people should live with each other. I draw much from Apess's depiction of the Mashpee Meeting-house, a religious structure made of wood whose retrieval by the Mashpee concurrently pushes to establish their conception of communal belonging with nature and with each other. The Mashpee form of belonging is also incarnate in two other ways in Indian Nullification : in Apess's discussion of his adoption into the Mashpee tribe and in the very structure of the book. By contrasting how the Mashpee treat the management of wood and wooden creations with settler colonial impositions, Apess conceptualizes how Indigenous peoples could create communities and express an alternative idea of belonging in the antebellum United States.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1353/eal.2023.a909703"
    },
    {
        "id": 17914,
        "title": "A hybrid multimedia image encryption technique using singular value decomposition-linear sparsity regularization (SVD-LSR)",
        "authors": "M. Hema, S. Prayla Shyry",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-07937-z"
    },
    {
        "id": 17915,
        "title": "Mu2e stopping target monitor data flow",
        "authors": "Pawel Plesniak",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1988463"
    },
    {
        "id": 17916,
        "title": "Progressive Forest: An Early Stopping Criteria For Building Ensembles",
        "authors": "Nayma Cepero Pérez, Mailyn Moreno Espino, Eduardo F. Morales, Milton García Borroto",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13053/cys-27-1-4224"
    },
    {
        "id": 17917,
        "title": "DL-Reg: A deep learning regularization technique using linear regression",
        "authors": "Maryam Dialameh, Ali Hamzeh, Hossein Rahmani, Safoura Dialameh, Hyock Ju Kwon",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123182"
    },
    {
        "id": 17918,
        "title": "Quantification of Individual Gas Components for Gas Sensor Array using Neural Networks with Levenberg–Marquardt (LM) and Bayesian Regularization (BR) Technique",
        "authors": "Ghazala Ansari, Rupali Singh",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306658"
    },
    {
        "id": 17919,
        "title": "Supplemental Material for Adverse Impact Reduction and Job Performance Optimization via Pareto-Optimal Weighting: A Shrinkage Formula and Regularization Technique Using Machine Learning",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/apl0001085.supp"
    },
    {
        "id": 17920,
        "title": "Generalized Early Stopping in Evolutionary Direct Policy Search",
        "authors": "Etor Arza, Léni K. Le Goff, Emma Hart",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "\n            Lengthy evaluation times are common in many optimization problems such as direct policy search tasks, especially when they involve conducting evaluations in the physical world, e.g. in robotics applications. Often when evaluating solution over a fixed time period it becomes clear that the objective value will not increase with additional computation time (for example when a two wheeled robot continuously spins on the spot). In such cases, it makes sense to stop the evaluation early to save computation time. However, most approaches to stop the evaluation are problem specific and need to be specifically designed for the task at hand. Therefore, we propose an early stopping method for direct policy search. The proposed method only looks at the objective value at each time step and requires no problem specific knowledge. We test the introduced stopping criterion in five direct policy search environments drawn from games, robotics and classic control domains, and show that it can save up to\n            \n\\(75\\%\\)\n\n            of the computation time. We also compare it with problem specific stopping criteria and show that it performs comparably, while being more generally applicable.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3653024"
    },
    {
        "id": 17921,
        "title": "Early stopping by correlating online indicators in neural networks",
        "authors": "Manuel Vilares Ferro, Yerai Doval Mosquera, Francisco J. Ribadas Pena, Víctor M. Darriba Bilbao",
        "published": "2023-2",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.035"
    },
    {
        "id": 17922,
        "title": "The Regularization Technique in Modeling of the Plane E-Polarized EM Wave Scattering by Coplanar System of Electrically Conducting Flat Strips",
        "authors": "George I. Koshovy, Andrii G. Koshovy",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "The integral equations technique has been successfully modified for studying the plane E-polarized electromagnetic wave scattering by multilevel coplanar systems of zero-thickness impedance strips. Reformulation of the scattering problem in the form of the second-kind regular integral equations has been realized on the base of the Carleman regularization technique. Two novel and original classes of specific Cantor functions have been presented and analyzed. Using new Cantor functions, it is easy to create a lot of non-classical orderings for specific multilevel coplanar strips systems. That sort of system can be useful for modeling irregular natural processes and zones in the future. Considerable attention was focused on the plane E-polarized electromagnetic wave scattering by sparsely filled coplanar systems of electrically narrow impedance strips. An explicit solution of the scattering problem has been obtained for such case of strips system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13095488"
    },
    {
        "id": 17923,
        "title": "Early Stopping of Non-productive Performance Testing Experiments Using Measurement Mutations",
        "authors": "Milad Abdullah, Lubomír Bulej, Tomáš Bureš, Vojtěch Horký, Petr Tůma",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/seaa60479.2023.00022"
    },
    {
        "id": 17924,
        "title": "PADDLES: Phase-Amplitude Spectrum Disentangled Early Stopping for Learning with Noisy Labels",
        "authors": "Huaxi Huang, Hui Kang, Sheng Liu, Olivier Salvado, Thierry Rakotoarivelo, Dadong Wang, Tongliang Liu",
        "published": "2023-10-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01533"
    },
    {
        "id": 17925,
        "title": "Integrating Dropout Regularization Technique at Different Layers to Improve the Performance of Neural Networks",
        "authors": "B. H. Pansambal, A. B. Nandgaokar",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140478"
    },
    {
        "id": 17926,
        "title": "What is stopping Early Career Psychiatrists (ECPs) from doing research in Sri Lanka?",
        "authors": "Yasodha Maheshi Rohanachandra, Dulangi Maneksha Amarasinghe Dahanayake, Miyuru Chandradasa",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ajp.2023.103466"
    },
    {
        "id": 17927,
        "title": "Efficient DP-FL: Efficient Differential Privacy Federated Learning Based on Early Stopping Mechanism",
        "authors": "Sanxiu Jiao, Lecai Cai, Jintao Meng, Yue Zhao, Kui Cheng",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.040194"
    },
    {
        "id": 17928,
        "title": "Integration of Time-Frequency Analysis and Regularization Technique for Improved Identification of Fetal Electrocardiogram",
        "authors": "Said Ziani, Mohamed El Ghmary,  Achmad Rizal",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "This research article presents a novel methodology for effectively extracting the fetal electrocardiogram (FECG) from a single-channel signal acquired on the maternal abdomen. The signal comprises a mixture of the FECG, maternal electrocardiogram (MECG), and ambient noise. The central concept involves projecting the signal into higher-dimensional spaces and leveraging the assumption of statistical independence among the constituent components to achieve their separation from the mixture. To accomplish this, singular value decomposition (SVD) is initially applied to the spectrogram, followed by an iterative application of independent component analysis (ICA) on the principal components. The SVD technique contributes to the enhanced separability of each individual component, while ICA facilitates the promotion of statistical independence between the fetal and maternal ECGs. Furthermore, we refine and customize the aforementioned approach specifically for ECG signals by incorporating knowledge of the frequency distribution of the MECG and other inherent ECG characteristics. The effectiveness of the proposed methodology is validated through comprehensive experimental studies, demonstrating its superior accuracy and performance compared to existing techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3991/ijoe.v19i17.42141"
    },
    {
        "id": 17929,
        "title": "Improved area regularization technique for penalty-method-based node-to-segment contact analysis",
        "authors": "Seung-Hoon Kang, Seok-Min Lee, SangJoon Shin",
        "published": "2023-4",
        "citations": 1,
        "abstract": "AbstractAmong numerous approaches that have been presented for computational contact analysis, the node-to-segment (NTS) approach is widely adopted in industrial applications, particularly with the penalty method. However, the pure penalty-method-based NTS approach fails the patch test even with the area regularization (AR) technique. There have been relatively few solutions for this problem compared to those for Lagrange-multiplier-method-based NTS approaches. This paper presents an improved AR technique and attempts to make the penalty-method-based NTS approach pass the patch test. The proposed approach improves the accuracy without the need to introduce additional geometry to the conventional penalty-method-based NTS approach. The entire competence area of a slave node is not directly utilized as a penalty weighting factor. Instead, a part of the competence area is extracted in accordance with the projection from a master node to a slave segment. In a complementary manner, a two-pass algorithm is used for the selected master nodes to achieve segment-wise force/moment equivalence. The results obtained using the proposed approach are introduced in a two-dimensional frictionless context. It is observed that the proposed approach passes the patch test. Furthermore, a significant improvement in accuracy compared to the conventional NTS and NTS-AR approaches is observed. We aim to extend the approach to three-dimensional applications in the future work.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00466-023-02269-z"
    },
    {
        "id": 17930,
        "title": "Subspace learning using structure learning and non-convex regularization: Hybrid technique with mushroom reproduction optimization in gene selection",
        "authors": "Amir Moslemi, Mahdi Bidar, Arash Ahmadian",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.107309"
    },
    {
        "id": 17931,
        "title": "Xception transfer learning with early stopping for facial age estimation",
        "authors": "Marina V. Polyakova, Vladyslav V. Rogachko, Oleksandr H. Nesteriuk, Natalia A. Huliaieva",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "The rapid development of deep learning attracts more attention to the analysis of person's face images. Deep learning methodsof  facial  age  estimation  are  more  effective  compared  to  methods  based  on  anthropometric  models, models  of  active  appearance, texture models, subspace of aging patterns. However, deep learning networks require more computing power to process images. Pre-trained models do not need a large training set and their training time is less. However, the parameters obtained as a result of transfer learning  of  the  pre-training  network significantly  affect  its efficiency.  It  is also  necessary  to  take into account  the  properties  of  the processed images, in particular, the conditions under which they were obtained.Recently, the facial age estimation is implemented in applications in devices with limited resources of computing, for example, in smartphones. The memory size and power consumption of such applications are limited by the computing power of mobile devices. In addition, when photographing a person's face with a smartphone  camera,  it  is  very  difficult  to  ensure  the  uniform  lighting.  The  aim  of  the  research  is  reducing  the  error  of  facial  age estimation from uneven illuminated images by applying an early stopping of transfer learning of the Xception network. The proposed technique of transfer learning includes an early stopping of training, if the improvement of the results is not observed within a certain number  of epochs.  Then the  network  weights  from the epoch  with the lowest  validation  loss are  saved.  As a  result  of the proposed technique  applying,  the  average  absolute  error  of  age  estimation  was  about  five  years  from  unevenly  illuminated  test  images. A number of parameters of the used in this case Xceptionnetwork is less than that of other deep learning neural networks which solved the  age  estimation  problem.  Then  applying  of  the  Xception  network  reduces  the  resource  consumption  of  devices  with  limited computing  power.  Prospects  for  further  research  are  reducing  the  unevenness  of  facial  image  lighting  to  decrease  the  error  of  age estimation. Also, to reduce the computing resources, it is promising to use fast transforms in the Xception convolutional layers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15276/aait.07.2024.6"
    },
    {
        "id": 17932,
        "title": "ZeroLess-DARTS: Improved Differentiable Architecture Search with Refined Search Operation and Early Stopping",
        "authors": "Najmeh Fayyazifar, Selam Ahderom, Najmeh Samadiani, Andrew Maiorana, Girish Dwivedi",
        "published": "2023-2-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587716.3587725"
    },
    {
        "id": 17933,
        "title": "Complexity Is an Effective Observable to Tune Early Stopping in Scenario Optimization",
        "authors": "Simone Garatti, Algo Care, Marco Claudio Campi",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tac.2022.3153888"
    },
    {
        "id": 17934,
        "title": "Being Patient and Persistent: Optimizing an Early Stopping Strategy for Deep Learning in Profiled Attacks",
        "authors": "Servio Paguada, Lejla Batina, Ileana Buhan, Igor Armendariz",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tc.2023.3234205"
    },
    {
        "id": 17935,
        "title": "Good-case early-stopping latency of synchronous byzantine reliable broadcast: the deterministic case",
        "authors": "Timothé Albouy, Davide Frey, Michel Raynal, François Taïani",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00446-024-00464-6"
    },
    {
        "id": 17936,
        "title": "A fast continuous time approach for non-smooth convex optimization using Tikhonov regularization technique",
        "authors": "Mikhail A. Karapetyants",
        "published": "2024-3",
        "citations": 1,
        "abstract": "AbstractIn this paper we would like to address the classical optimization problem of minimizing a proper, convex and lower semicontinuous function via the second order in time dynamics, combining viscous and Hessian-driven damping with a Tikhonov regularization term. In our analysis we heavily exploit the Moreau envelope of the objective function and its properties as well as Tikhonov regularization properties, which we extend to a nonsmooth case. We introduce the setting, which at the same time guarantees the fast convergence of the function (and Moreau envelope) values and strong convergence of the trajectories of the system to a minimal norm solution—the element of the minimal norm of all the minimizers of the objective. Moreover, we deduce the precise rates of convergence of the values for the particular choice of parameters. Various numerical examples are also included as an illustration of the theoretical results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10589-023-00536-6"
    },
    {
        "id": 17937,
        "title": "Proactively Adjusting Stopping: Response Inhibition is Faster when Stopping Occurs Frequently",
        "authors": "Roos A. Doekemeijer, Anneleen Dewulf, Frederick Verbruggen, C. Nico Boehler",
        "published": "2023-5-4",
        "citations": 3,
        "abstract": "People are able to stop actions before they are executed, and proactively slow down the speed of going in line with their expectations of needing to stop. Such slowing generally increases the probability that stopping will be successful. Surprisingly though, no study has clearly demonstrated that the speed of stopping (measured as the stop-signal reaction time, SSRT) is reduced by such proactive adjustments. In addition to a number of studies showing non-significant effects, the only study that initially had observed a clear effect in this direction found that it was artifactually driven by a confounding variable (specifically, by context-independence violations, which jeopardize the validity of the SSRT estimation). Here, we tested in two well-powered and well-controlled experiments whether the SSRT is shorter when stopping is anticipated. In each experiment, we used a Stop-Signal Task, in which the stop-trial frequency was either high (50%) or low (20%). Our results robustly show that the SSRT was shorter when stop signals were more anticipated (i.e., in the high-frequent condition) while carefully controlling for context-independence violations. Hence, our study is first to demonstrate a clear proactive benefit on the speed of stopping, in line with an ability to emphasize going or stopping, by trading off the speed of both.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5334/joc.264"
    },
    {
        "id": 17938,
        "title": "Regularization operators versus regularization strategies",
        "authors": "Thi-An Nguyen, Chun-Kong Law",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nIn this note, we shall compare two important concepts of “regularization operators” and “regularization strategies” that appear in different classical monographs. The definition of a regularization operator is related to the Moore–Penrose inverse of the operator. In general, a regularization operator is a regularization strategy. We shall show that the converse is also true under some conditions. It is interesting to note that these two systems share analogous properties.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jiip-2022-0073"
    },
    {
        "id": 17939,
        "title": "Reducing Complexity of SC-Based Flip Decoding of Polar Codes by Early-Stopping",
        "authors": "Yansong Li, Rongke Liu",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcomm.2024.3365617"
    },
    {
        "id": 17940,
        "title": "Nonparametric Early Stopping Detection for c-VEP-based Brain-Computer Interfaces: A Pilot Study",
        "authors": "Víctor Martínez-Cagigal, Eduardo Santamaría-Vázquez, Sergio Pérez-Velasco, Diego Marcos-Martínez, Selene Moreno-Calderón, Roberto Hornero",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/embc40787.2023.10341024"
    },
    {
        "id": 17941,
        "title": "Adverse impact reduction and job performance optimization via pareto-optimal weighting: A shrinkage formula and regularization technique using machine learning.",
        "authors": "Q. Chelsea Song, Chen Tang, Daniel A. Newman, Serena Wee",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/apl0001085"
    },
    {
        "id": 17942,
        "title": "Apical Control Technique with Traditional Growing Rods Improves Outcomes in Congenital Early-Onset Scoliosis",
        "authors": "Charles E. Johnston",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2106/jbjs.23.01239"
    },
    {
        "id": 17943,
        "title": "Exploiting All Samples in Low-Resource Sentence Classification: Early Stopping and Initialization Parameters",
        "authors": "Hongseok Choi, Hyunju Lee",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3261884"
    },
    {
        "id": 17944,
        "title": "Transformative Breast Cancer Diagnosis using CNNs with Optimized ReduceLROnPlateau and Early Stopping Enhancements",
        "authors": "Mahesh T R, Arastu Thakur, Muskan Gupta, Deepak Kumar Sinha, Kritika Kumari Mishra, Vinoth Kumar Venkatesan, Suresh Guluwadi",
        "published": "2024-1-22",
        "citations": 2,
        "abstract": "AbstractBreast cancer stands as a paramount public health concern worldwide, underscoring an imperative necessity within the research sphere for precision-driven and efficacious methodologies facilitating accurate detection. The existing diagnostic approaches in breast cancer often suffer from limitations in accuracy and efficiency, leading to delayed detection and subsequent challenges in personalized treatment planning. The primary focus of this research is to overcome these shortcomings by harnessing the power of advanced deep learning techniques, thereby revolutionizing the precision and reliability of breast cancer classification. This research addresses the critical need for improved breast cancer diagnostics by introducing a novel Convolutional Neural Network (CNN) model integrated with an Early Stopping callback and ReduceLROnPlateau callback. By enhancing the precision and reliability of breast cancer classification, the study aims to overcome the limitations of existing diagnostic methods, ultimately leading to better patient outcomes and reduced mortality rates. The comprehensive methodology includes diverse datasets, meticulous image preprocessing, robust model training, and validation strategies, emphasizing the model's adaptability and reliability in varied clinical contexts. The findings showcase the CNN model's exceptional performance, achieving a 95.2% accuracy rate in distinguishing cancerous and non-cancerous breast tissue in the integrated dataset, thereby demonstrating its potential for enhancing clinical decision-making and fostering the development of AI-driven diagnostic solutions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s44196-023-00397-1"
    },
    {
        "id": 17945,
        "title": "Utilization of Encoding, Early Stopping, Hyper Parameter Tuning, and Machine Learning Models for Bank Fraud Detection",
        "authors": "Md Aminul Islam, Anindya Nag, Saumik Chowdhury, SM Firoz Ahmed Fahim, Arjan Ghosh, Nahi Mumtaj",
        "published": "2023-11-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wiecon-ece60392.2023.10456503"
    },
    {
        "id": 17946,
        "title": "How to Limit Label Dissipation in Neural-network Validation: Exploring Label-free Early-stopping Heuristics",
        "authors": "Mahya Ameryan, Lambert Schomaker",
        "published": "2023-3-31",
        "citations": 1,
        "abstract": "\n            In recent years,\n            deep learning (DL)\n            has achieved impressive successes in many application domains, including Handwritten-Text Recognition. However, DL methods demand a long training process and a huge amount of human-based labeled data. To address these issues, we explore several label-free heuristics for detecting the early-stopping point in training convolutional-neural networks: (1) Cumulative Distribution of the\n            standard deviation of kernel weights (SKW)\n            ; (2) the moving standard deviation of SKW, and (3) the standard deviation of the sum of weights over a window in the epoch series. We applied the proposed methods to the common RIMES and Bentham data sets as well as another highly challenging historical data set. In comparison with the usual stopping criterion which uses labels for validation, the label-free heuristics are at least 10 times faster per epoch when the same training set is used. The use of alternative stopping heuristics may require additional epochs, however, they never require the original computing time. The character error rate (%) on the test set of the label-free heuristics is about a percentage point less in comparison to the usual stopping criterion. The label-free early-stopping methods have two benefits: They do not require a computationally intensive evaluation of a validation set per epoch and all labels can be used for training, specifically benefitting the underrepresented word or letter classes.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587168"
    },
    {
        "id": 17947,
        "title": "Unsupervised deep learning seismic data random noise attenuation with early stopping",
        "authors": "Zitai Xu, Bangyu Wu",
        "published": "2023-2-28",
        "citations": 2,
        "abstract": "AbstractSuppression of seismic random noise is one critical step in seismic data processing. In recent years, the outstanding ability of deep learning to denoise seismic data is impressive. The unsupervised deep image prior (DIP) model has achieved promising denoising results without training labels. However, during training, these models first learn the effective seismic events in the noisy data, and then pick up the random noise afterwards, i.e. overfitting. Thus, the practicability of DIP hinges on good early stopping (ES) that catches the potentially noise-free seismic data. In this respect, most DIP studies only demonstrate potential of the models by showing the peak performance accessing the ground truth as reference, but provide no clue about how to operationally catch near-peak output without the ground truth. In this paper, we investigate the ES strategy in seismic data denoising using DIP method, which consistently detects the performance of reconstruction sequence by observing its running variance (VAR). The adopted ES method incurs low computational overhead. Numerical tests on 2D/3D synthetic and field data demonstrate that compared with other stopping criteria, the ES method exhibits superiority in suppressing random noise and preserves the effective signals better.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jge/gxad005"
    },
    {
        "id": 17948,
        "title": "Early Detection of lung Cancer Using Machine Learning Technique",
        "authors": "B.Devananda Rao, Mahammad Arshad",
        "published": "2023-1-23",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128389"
    },
    {
        "id": 17949,
        "title": "An Incremental Mutual Information-Selection Technique for Early Ransomware Detection",
        "authors": "Mazen Gazzan, Frederick T. Sheldon",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Ransomware attacks have emerged as a significant threat to critical data and systems, extending beyond traditional computers to mobile and IoT/Cyber–Physical Systems. This study addresses the need to detect early ransomware behavior when only limited data are available. A major step for training such a detection model is choosing a set of relevant and non-redundant features, which is challenging when data are scarce. Therefore, this paper proposes an incremental mutual information-selection technique as a method for selecting the relevant features at the early stages of ransomware attacks. It introduces an adaptive feature-selection technique that processes data in smaller, manageable batches. This approach lessens the computational load and enhances the system’s ability to quickly adapt to new data arrival, making it particularly suitable for ongoing attacks during the initial phases of the attack. The experimental results emphasize the importance of the proposed technique in estimating feature significance in limited data scenarios. Such results underscore the significance of the incremental approach as a proactive measure in addressing the escalating challenges posed by ransomware.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info15040194"
    },
    {
        "id": 17950,
        "title": "Diminishing Combustible-Rock Mass: A Technique Utilizing Fluid-powered Demolishing and Fragmenting",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/intjecse/v14i9.13"
    },
    {
        "id": 17951,
        "title": "Eliciting Stopping Times",
        "authors": "Sebastian Ebert, Maximilian Voigt",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4526931"
    },
    {
        "id": 17952,
        "title": "Data Interpretation and Early Stroke Prediction using Ensemble Technique",
        "authors": "T Divya, R Ramadevi",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacrs58579.2023.10404208"
    },
    {
        "id": 17953,
        "title": "A Comparison of the State-of-the-Art Evolutionary Algorithms with Different Stopping Conditions",
        "authors": "Jana Herzog, Janez Brest, Borko Bošković",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012182200003595"
    },
    {
        "id": 17954,
        "title": "A Deep Learning Technique for early diagnosis of Skin Cancer disease using Biomedical data",
        "authors": "Mohamed Shehab, Sally Elghamrawy",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itc-egypt58155.2023.10206301"
    },
    {
        "id": 17955,
        "title": "Recovery in Function in Olfactory Escheating Cell Transplanted Rat Spinal Cord After Stopping the Injection of Cyclosporine",
        "authors": "",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "The study aimed to check whether animals can retain directed forepaw reaching (DFR) function after stopping cyclosporine which is used to prevent immunorejection in xenotransplant of Olfactory Encheating cells (OECs) in Albino Swiss Strain (AS) rat corticospinal tract lesion. The Hematoxylin & Eosin (H&E) staining and immunohistochemistry techniques have been performed on the cryostat sections of corticospinal tract (CST) lesion post-surgery to check the immunorejection and the existence of OEC transplanted tissue before and after injection of cyclosporine. The DFR function have been checked after each stage to see whether animals retain the DFR tasks after stopping cyclosporine . The results show that the daily injection of 100ml diluted cyclosporine avoids immune attack and reduces inflammatory cells infiltrate in delayed CST ipsilateral rat model and also our study proved that stop of cyclosporine injection would not prevent DFR function and the regenerated fibres can still be visualised after 6 months post-operation period.Despite the fact that so many methods such as animal genetic engineering is used to avoid imminuregection after xenotrasplantation in animal model, daily cyclosporine injection for some period after surgery seems to be effective and effortless method to not only deter immunorejection in host animal but it also preserve function such as DFR for a long period post-surgery",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/iimj.01.01.07"
    },
    {
        "id": 17956,
        "title": "A roadmap to stopping an incurable lung disease",
        "authors": "Alane Lim",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "More complex in vitro models are needed to advance treatments of pulmonary fibrosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/10.0019364"
    },
    {
        "id": 17957,
        "title": "Dynamical analysis of nonlinear combined drug therapy model for HIV infection: Bayesian regularization technique intelligent networks",
        "authors": "Muhammad Bilal, Muhammad Asif Zahoor Raja, Iftikhar Ahmad, Rizwan Khan, Muhammad Shoaib",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2023.105629"
    },
    {
        "id": 17958,
        "title": "Total‐body low‐dose CT image denoising using a prior knowledge transfer technique with a contrastive regularization mechanism",
        "authors": "Minghan Fu, Yanhua Duan, Zhaoping Cheng, Wenjian Qin, Ying Wang, Dong Liang, Zhanli Hu",
        "published": "2023-5",
        "citations": 0,
        "abstract": "AbstractPurposeReducing the radiation exposure experienced by patients in total‐body computed tomography (CT) imaging has attracted extensive attention in the medical imaging community. A low radiation dose may result in increased noise and artifacts that greatly affect the subsequent clinical diagnosis. To obtain high‐quality total‐body low‐dose CT (LDCT) images, previous deep learning‐based research works developed various network architectures. However, most of these methods only employ normal‐dose CT (NDCT) images as ground truths to guide the training process of the constructed denoising network. As a result of this simple restriction, the reconstructed images tend to lose favorable image details and easily generate oversmoothed textures. This study explores how to better utilize the information contained in the feature spaces of NDCT images to guide the LDCT image reconstruction process and achieve high‐quality results.MethodsWe propose a novel intratask knowledge transfer (KT) method that leverages the knowledge distilled from NDCT images as an auxiliary component of the LDCT image reconstruction process. Our proposed architecture is named the teacher–student consistency network (TSC‐Net), which consists of teacher and student networks with identical architectures. By employing the designed KT loss, the student network is encouraged to emulate the teacher network in the representation space and gain robust prior content. In addition, to further exploit the information contained in CT scans, a contrastive regularization mechanism (CRM) built upon contrastive learning is introduced. The CRM aims to minimize and maximize the L2 distances from the predicted CT images to the NDCT samples and to the LDCT samples in the latent space, respectively. Moreover, based on attention and the deformable convolution approach, we design a dynamic enhancement module (DEM) to improve the network capability to transform input information flows.ResultsBy conducting ablation studies, we prove the effectiveness of the proposed KT loss, CRM, and DEM. Extensive experimental results demonstrate that the TSC‐Net outperforms the state‐of‐the‐art methods in both quantitative and qualitative evaluations. Additionally, the excellent results obtained for clinical readings also prove that our proposed method can reconstruct high‐quality CT images for clinical applications.ConclusionsBased on the experimental results and clinical readings, the TSC‐Net has better performance than other approaches. In our future work, we may explore the reconstruction of LDCT images by fusing the positron emission tomography (PET) and CT modalities to further improve the visual quality of the reconstructed CT images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mp.16163"
    },
    {
        "id": 17959,
        "title": "Silver-modified atraumatic restorative technique (SMART) in early childhood caries",
        "authors": "Montserrat Montecino, Cristóbal García, Graciela Melo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20960/odontolpediatr.00005"
    },
    {
        "id": 17960,
        "title": "Developing a rainfall-runoff model with simple routing technique for early warning system.",
        "authors": "",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46773"
    },
    {
        "id": 17961,
        "title": "Comparison of early clinical outcome in carpal tunnel release - mini-open technique with palmar incision vs. endoscopic technique with wrist crease incision-",
        "authors": "Ryo Nakamichi, Taichi Saito, Yasunori Shimamura, Masanori Hamada, Keiichiro Nishida, Toshifumi Ozaki",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Abstract\nBackground\nThe purpose of this study was to examine two techniques for Carpal Tunnel Syndrome, mini-Open Carpal Tunnel Release (mini-OCTR) and Endoscopic Carpal Tunnel Release (ECTR), to compare their therapeutic efficacy.\n\nMethods\nSixteen patients who underwent mini-OCTR in palmar incision and 17 patients who underwent ECTR in the wrist crease incision were included in the study. All patients presented preoperatively and at 1, 3, and 6 months postoperatively and were assessed with the Visual Analogue Scale (VAS) and the Disabilities of Arm, Shoulder and Hand Score (DASH). We also assessed the pain and cosmetic VAS of the entire affected hand or surgical wound, and the patient’s satisfaction with the surgery.\n\nResults\nIn the objective evaluation, both surgical techniques showed improvement at 6 months postoperatively. The DASH score was significantly lower in the ECTR group (average = 3 months: 13.6, 6 months: 11.9) than in the mini-OCTR group (average = 3 months: 27.3, 6 months: 20.6) at 3 and 6 months postoperatively. Also, the pain VAS score was significantly lower in the ECTR group (average = 17.1) than in the mini-OCTR group (average = 36.6) at 3 months postoperatively. The cosmetic VAS was significantly lower in the ECTR group (average = 1 month: 15.3, 3 months: 12.2, 6 months: 5.41) than in the mini-OCTR group (average = 1 month: 33.3, 3 months: 31.2, 6 months: 24.8) at all time points postoperatively. Patient satisfaction scores tended to be higher in the ECTR group (average = 3.3) compared to the mini-OCTR group (average = 2.7).\n\nConclusions\nECTR in wrist increase incision resulted in better pain and cosmetic recovery in an early postoperative phase compared with mini-OCTR in palmar incision. Our findings suggest that ECTR is an effective technique for patient satisfaction.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12891-023-07151-w"
    },
    {
        "id": 17962,
        "title": "A Predictive Model for Early Detection of Oral Cancer via Adaboost Classification Technique",
        "authors": "K Padmavathi -, C Deepa -",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "Oral cancer is a serious and potentially life-threatening disease that affects millions of people around the world. Early detection is critical for improving treatment outcomes and reducing mortality rates. This study aims to develop a predictive model for early detection of oral cancer using the AdaBoost classification technique. A dataset containing various risk factors associated with oral cancer was used to train and test the model. The results show that the AdaBoost algorithm was able to accurately classify oral cancer patients and non-cancer patients with high precision and recall rates. The developed predictive model could be used as a tool for early detection of oral cancer, thus improving patient outcomes and reducing mortality rates. The significance of oral cancer prediction and classification by improvised AdaBoost proposed technique produce potential to improve patient outcomes, facilitate early detection and treatment of oral cancer, and increase the efficiency and accuracy of the diagnostic process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i04.5909"
    },
    {
        "id": 17963,
        "title": "Endoscopic transorbital approach in children: surgical technique and early results",
        "authors": "Chiman Jeon, Kyuha Chong, Hyung Jin Shin, Doo-Sik Kong",
        "published": "2024-4",
        "citations": 0,
        "abstract": "\nOBJECTIVE \nIn this study, the authors aimed to describe the endoscopic transorbital approach (ETOA) in children.\n\n\nMETHODS\nSix pediatric patients (2 girls and 4 boys) underwent the ETOA for paramedian skull base lesions at a single institution between September 2016 and February 2023.\n\n\nRESULTS\nThe median age at the time of surgery was 7.5 (range 4–18) years. The median follow-up period was 33 (range 9–60) months. In this series, the ETOA level of difficulty included stage 1 (n = 2, 33.3%), stage 3 (n = 3, 50%), and stage 5 (n = 1, 16.7%). The ETOA was performed for tumor resection in 4 cases; the final pathology consisted of fibrous dysplasia, pilocytic astrocytoma, metastatic neuroblastoma, and choroid plexus papilloma. The procedure was also performed for repair of a petrous apex meningocele and for lateral orbital wall decompression of traumatic lateral rectus muscle entrapment. One patient experienced a transient cranial nerve III palsy after the procedure. There were no operative deaths in this series.\n\n\nCONCLUSIONS\nIn select cases, the ETOA can be considered a minimally invasive alternative for conventional skull base approaches in the armamentarium of pediatric skull base surgery. Further investigation and the accumulation of experience are warranted in the future to enhance the efficacy and applicability of the ETOA in pediatric patients.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.3171/2024.1.focus23858"
    },
    {
        "id": 17964,
        "title": "The Subspace Regularization Method Improves ErrP Detection by EEGNET in BCI Experiments",
        "authors": "Andrea Farabbi, Luca Mainardi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011682400003414"
    },
    {
        "id": 17965,
        "title": "MLPCC-MLMAE-Based Early Stopping Strategy for Unsupervised 3-D Seismic Data Reconstruction",
        "authors": "Wei Cao, Feng Tian, Zongbao Liu, Fang Liu, Yang Zhao, Ying Shi, Weihong Wang, Xuebao Guo",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lgrs.2023.3323649"
    },
    {
        "id": 17966,
        "title": "Meta-Analysis: Cardiovascular Risks Rose After Stopping Aspirin",
        "authors": "Emily Harris",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1001/jama.2024.2091"
    },
    {
        "id": 17967,
        "title": "Parity-check and G-matrix based intelligent early stopping criterion for belief propagation decoder for polar codes",
        "authors": "Qasim Jan, Shahid Hussain, Zhiwen Pan, Nan Liu, Zakir Ali, Zechen Liu, Xiaohu You",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2022.12.011"
    },
    {
        "id": 17968,
        "title": "Early Endoscopic Interventions for Pancreatic Necrosis: Indications, Technique, and Outcomes",
        "authors": "Pardhu Neelam Bharath, Surinder Singh Rana",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10620-024-08347-3"
    },
    {
        "id": 17969,
        "title": "Early results of direct true lumen cannulation (samurai technique) in aortic dissection surgery",
        "authors": "cem atik",
        "published": "2023",
        "citations": 0,
        "abstract": "Aim: The aim of this study was to evaluate and compare the clinical outcomes of Direct True Lumen Cannulation (Samurai Technique), axillary artery cannulation and femoral artery cannulation techniques used in aortic dissection surgery. \nMaterials and methods: The data of 124 patients who underwent surgical treatment for acute aortic dissection between February 2018 and December 2022 were analyzed rectospectively. Patients were divided into Group 1 (samurai technique cannulation group) and Group 2 (axillary and femoral cannulation group). \nResults: When the results were analyzed, preoperative personal and clinical characteristics were found to be similar between the groups. In the inoperative period, the time from skin incision to CPB, hypothermic circulatory arrest time, and time for cooling were shorter in group 1. While there were no cannulation-related complications in group 1, axillary artery dissection developed in two patients in group 2. No significant difference was observed between the groups in postoperative results. \nConclusion: Although there were similar results in the groups in the preoperative and postoperative periods, the more positive results in the surgery show that cannulation with the samurai technique is a preferable method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5455/annalsmedres.2023.08.216"
    },
    {
        "id": 17970,
        "title": "Retracted: Diagnostic Value of Endoscopic Narrow-Band Imaging Technique in Early Gastric Cancer and Precancerous Lesions",
        "authors": "",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9894170"
    },
    {
        "id": 17971,
        "title": "Bayesian stopping",
        "authors": "Igor Douven",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmp.2023.102794"
    },
    {
        "id": 17972,
        "title": "Scientific Analysis on the Manufacturing Technique of Early Historic Pottery of Bangladesh: Application of Experimental Archaeology",
        "authors": "Dilruba Sharmin -",
        "published": "2023-2-16",
        "citations": 0,
        "abstract": "The present study wants to identify the making technique of an early historic pottery type of Bangladesh and for this research potshard samples were collected from archaeological excavated site with documented stratigraphic data. The used method for analysis is known as ‘Polished thin-section’ which is now commonly using for petrographic analysis in modern world. Another important aspect for this archaeological analysis is experiment to reproduction of the same quality object, and present research did successful replication of an early historic pottery of Bangladesh known as ‘Northern Black Polished ware’ or NBPW. Archaeological pottery analysis with modern scientific method is still faces challenges in Bangladesh because lack of proper knowledge and absence of modern equipped laboratory. Prepared Thin-section petrography from collected samples shows that NBPW of Bangladesh has possess thin polished surface of multi-layered coating. The practical experiments were successful by achieving the reproduction of a black colored surface which is almost resembled with original potsherd of Northern Black Polished Ware.  This research tells us a story of vigorous cultural aesthetic behavior as well as provides information on scientific sustainable technique of pottery decoration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i01.1505"
    },
    {
        "id": 17973,
        "title": "Optimizing time prediction and error classification in early melanoma detection using a hybrid <scp>RCNN‐LSTM</scp> model",
        "authors": "K. P. Arjun, K. Sampath Kumar, Rajesh Kumar Dhanaraj, Vinayakumar Ravi, T. Ganesh Kumar",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "AbstractSkin cancer is a terrifying disorder that affects all individuals. Due to the significant increase in the rate of melanoma skin cancer, early detection of skin cancer is now more critical than ever before. Malignant melanoma is one of the most serious forms of skin cancer, and it is caused by abnormal melanocyte cell growth. In recent years, skin cancer predictive categorization has become more accurate and predictive due to multiple deep learning algorithms. Malignant melanoma is diagnosed using the Recurrent Convolution Neural Network‐Long Short‐Term Memory (RCNN‐LSTM), which is one of the deep learning classification approaches. Using the International Skin Image Collection and the RCNN‐LSTM, the data are categorized and analyzed to gain a better understanding of skin cancer. The method begins with data preprocessing, which prepares the dataset for classification. Additionally, the RCNN is employed to extract the features that are vital to the prediction process. The LSTM is accountable for the final step, classification. There are further factors to examine, such as the precision of 94.60%, the sensitivity of 95.67%, and the F1‐score of 95.13%. Other benefits of the suggested study include shorter prediction durations of 95.314, 122.530, and 131.205 s and lower model loss of 0.25%, 0.19%, and 0.15% for input sizes 10, 15, and 20, respectively. Three datasets had a reduced categorization error of 5.11% and an accuracy of 95.42%. In comparison to previous approaches, the work discussed here produces superior outcomes.Research Highlights\nRecurrent convolutional neural network (RCNN) deep learning approach for optimizing time prediction and error classification in early melanoma detection. It extracts a high number of specific features from the skin disease image, making the classification process easier and more accurate.\nTo reduce classification errors in accurately detecting melanoma, context dependency is considered in this work. By accounting for context dependency, the deprivation state is avoided, preventing performance degradation in the model.\nTo minimize melanoma detection model loss, a skin disease image augmentation or regularization process is performed in this work. This strategy improves the accuracy of the model when applied to fresh, previously unobserved data.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jemt.24559"
    },
    {
        "id": 17974,
        "title": "Selecting stopping muons with KM3NeT/ORCA",
        "authors": "Louis Bailly-Salins",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22323/1.444.0203"
    },
    {
        "id": 17975,
        "title": "A hybrid intelligent model for early validation of infectious diseases: An explorative study of machine learning approaches",
        "authors": "Saeed Ali Bahaj",
        "published": "2023-5",
        "citations": 1,
        "abstract": "AbstractLiterature reports several infectious diseases news validation approaches, but none is economically effective for collecting and classifying information on different infectious diseases. This work presents a hybrid machine‐learning model that could predict the validity of the infectious disease's news spread on the media. The proposed hybrid machine learning (ML) model uses the Dynamic Classifier Selection (DCS) process to validate news. Several machine learning models, such as K‐Neighbors‐Neighbor (KNN), AdaBoost (AB), Decision Tree (DT), Random Forest (RF), SVC, Gaussian Naïve Base (GNB), and Logistic Regression (LR) are tested in the simulation process on benchmark dataset. The simulation employs three DCS process methods: overall Local Accuracy (OLA), Meta Dynamic ensemble selection (META‐DES), and Bagging. From seven ML classifiers, the AdaBoost with Bagging DCS method got a 97.45% high accuracy rate for training samples and a 97.56% high accuracy rate for testing samples. The second high accuracy was obtained at 96.12% for training and 96.45% for testing samples from AdaBoost with the Meta‐DES method. Overall, the AdaBoost with Bagging model obtained higher accuracy, AUC, sensitivity, and specificity rate with minimum FPR and FNR for validation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jemt.24290"
    },
    {
        "id": 17976,
        "title": "Group Regularization Learning with Dynamic Regularization Factor Based on BN Layer Scaling Factor",
        "authors": "Bo Li, Zongzeng Li, Feng Li",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ntci60157.2023.10403747"
    },
    {
        "id": 17977,
        "title": "CHC and surgery: when is stopping safe?",
        "authors": "Sam Schulman",
        "published": "2024-1-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1182/blood.2023022619"
    },
    {
        "id": 17978,
        "title": "Intelligent Early Warning Technique for Transient Recognition at Nuclear Power Plants",
        "authors": "Seo Koo, Jaekwan Park",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13182/npichmit23-41484"
    },
    {
        "id": 17979,
        "title": "Effectiveness of early cancer detection method: magnetic  resonance imaging and X-ray technique",
        "authors": "Cynthia Yueqiao Zhang",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "Cancer is a major problem plaguing human society today. With the research and development of nano-drug delivery technology and new non-surgical treatment methods, many types of early cancers can be cured or effectively controlled. However, the current treatment methods for advanced cancer are still limited, and efficient early cancer identification is crucial for enhancing patients prognosis and survival rates. Magnetic resonance imaging (MRI)  and X-ray technologies are currently the mainstream and generally applicable means of early cancer detection. However, there is a lack of unified comparison and interpretation for their respective applicable cancer detection types. Herein, the paper first provides a comprehensive comparison and explanation of the working principles of the two technologies, as well as their advantages and disadvantages. Further, this article introduces the application of MRI and X-ray technology in the early detection of different common cancer types, including lung, breast, and brain cancers. The paper found that MRI is crucial in the early detection of brain cancer, and X-ray is a common method for lung cancer screening. With further advances in technology, cancer-related deaths can be further curbed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/6/20230279"
    },
    {
        "id": 17980,
        "title": "The Unilateral Biportal Endoscopic Technique for Treatment of Lumbar Spinal Stenosis: Early Surgical Results",
        "authors": "Joonseo Kang, Young-Joon Kwon",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Objective: Minimally invasive (MI) surgery for the treatment of spinal stenosis is currently a topic of substantial interest. One such technique is the unilateral biportal endoscopic (UBE) method, becoming popular among spine surgeons as a MI alternative to decompressive lumbar laminectomy without fusion. The purpose of this study was to present a description of the surgical technique and early clinical and radiological outcomes following the author's adoption of the UBE surgical technique for decompression of spinal stenosis.Methods: Between 2019 and 2021, surgery was performed on 47 patients with lumbar spinal stenosis. Clinical and radiological data were retrospectively analyzed through electronic medical records and imaging software reviews. Questionnaires and radiologic images were prospectively collected at scheduled times. The surgical technique used two corridors: one for endoscopic viewing and the other for handling surgical instruments during the procedure. Clinical outcomes were measured using the visual analogue scale (VAS) and the Oswestry Disability Index (ODI), while radiological outcomes were evaluated using X-rays to assess instability. Outcomes after UBE surgery were evaluated in terms of changes in clinical and radiological parameters from the baseline. A mixed-effects model with random effects for patients and surgical levels was used to test for differences in repeatedly measured clinical and radiological parameters.Results: During the early postoperative period, there were few complications, and all patients had a smooth recovery. Patients reported minimal postoperative wound discomfort. Back and leg VAS scores improved significantly in the early postoperative period (at 3, 6, and 12 months) compared to the baseline preoperative scores (p<0.001). The ODI also showed significant improvement post-operatively (p<0.001). The X-ray parameters were well maintained and did not show any progression of instability during the follow-up period.Conclusion: UBE surgery is a safe and effective MI technique for treating lumbar stenosis, with good early results and few complications during the early learning curve period.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21129/nerve.2023.00388"
    },
    {
        "id": 17981,
        "title": "Feasible Joint Distributions over Actions and Stopping Times",
        "authors": "Andrew Koh, Sivakorn Sanguanmoo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4595819"
    },
    {
        "id": 17982,
        "title": "Stopping Microfluidic Flow",
        "authors": "Mehmet Akif Sahin, Muhammad Shehzad, Ghulam Destgeer",
        "published": "2023-12-24",
        "citations": 2,
        "abstract": "AbstractA cross‐comparison of three stop‐flow configurations—such as low‐pressure (LSF), high‐pressure open‐circuit (OC‐HSF), and high‐pressure short‐circuit (SC‐HSF) stop‐flow—is presented to rapidly bring a high velocity flow O(m s−1) within a microchannel to a standstill O(µm s−1). The performance of three stop‐flow configurations is assessed by measuring residual flow velocities within microchannels having three orders of magnitude different flow resistances. The LSF configuration outperforms the OC‐HSF and SC‐HSF configurations within a high flow resistance microchannel and results in a residual velocity of <10 µm s−1. The OC‐HSF configuration results in a residual velocity of <150 µm s−1 within a low flow resistance microchannel. The SC‐HSF configuration results in a residual velocity of <200 µm s−1 across the three orders‐of‐magnitude different flow resistance microchannels, and <100 µm s−1 for the low flow resistance channel. It is hypothesized that residual velocity results from compliance in fluidic circuits, which is further investigated by varying the elasticity of microchannel walls and connecting tubing. A numerical model is developed to estimate the expanded volumes of the compliant microchannel and connecting tubings under a pressure gradient and to calculate the distance traveled by the sample fluid. A comparison of the numerically and experimentally obtained traveling distances confirms the hypothesis that the residual velocities are an outcome of the compliance in the fluidic circuit.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/smll.202307956"
    },
    {
        "id": 17983,
        "title": "A Unique Treatment Approach to Stopping KRAS Mutations",
        "authors": "Warren Froelich",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.cot.0000995196.89782.8f"
    },
    {
        "id": 17984,
        "title": "Transvaginal cervical tumor-concealing no-look no-touch technique in minimally invasive radical hysterectomy for early-stage cervical cancer: a novel operation technique",
        "authors": "Hiroyuki Kanao, Atsushi Fusegi, Makiko Omi, Ariane C. Youssefzadeh, Hidetaka Nomura, Koji Matsuo",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3802/jgo.2023.34.e27"
    },
    {
        "id": 17985,
        "title": "SOM-based Classification and a Novel Stopping Criterion for Astroparticle Applications",
        "authors": "Luis Sanchez, Erzsébet Merényi, Christopher Tunnell",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-177"
    },
    {
        "id": 17986,
        "title": "The Inganno Technique in Ostinato Forms of the Early Renaissance",
        "authors": "Л.И. Сундукова",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "В отечественных и зарубежных исследованиях техника инганно, как правило, ассоциируется с итальянской музыкой позднего Ренессанса (с 50-х го­дов XVI века) и раннего барокко, часто — с имитационными формами. Фокус настоящего исследования смещен на более ранний период: конец XV — первую половину XVI века. В качестве анализируемого материала избраны остинатные формы, которые за счет повторности тематизма представляются благодатной почвой для инганных преобразований soggetto. Географическая принадлежность рассмотренных сочинений также разнится: помимо итальянской, изучены образцы нидерландской и французской музыкальных культур. Отдельное внимание уделяется традиции формирования тематизма методом soggetto cavato. В Приложении публикуется транскрипция Agnus Dei I из мессы «La sol mi fa re» Робера де Февена, где инганно существует лишь номинально, представляя оригинальный образец «музыки для глаз».\nIn domestic and foreign studies, the inganno technique is usually associated with Italian music of the late Renaissance (from the 50s of the 16th century) and early Baroque; often with imitation forms. The focus of this study is shifted to an earlier period: the end of the 15th—the first half of the 16th century. The analyzed material is ostinato forms, which, due to the repetition of theme, are fruitful for inganno transformations of soggetto. The geographical affiliation of the considered works also varies; in addition to the Italian one, samples of the Dutch and French musical cultures were studied. Special attention is paid to the tradition of soggetto cavato. The transcription of Agnus Dei I from the mass “La sol mi fa re” by Robert de Fevin is published as an Appendix, where the inganno exists only nominally, representing the original sample of “music for the eyes”.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34690/310"
    },
    {
        "id": 17987,
        "title": "Predicting Life Style of Early Diabetes Mellitus using Machine Learning Technique",
        "authors": "Salliah Shafi Bhat, Venkatesan Selvam, Gufran Ahmad Ansari",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "A branch of artificial intelligence called Machine Learning (ML) enables machines to learn without having to be emphatically instructed. Machine Learning Techniques (MLT) have been used to forecast a variety of chronic diseases in the healthcare sector. Improvement in clinical approaches is necessary for early diabetes prediction to prevent complications and prolong the diagnosis of diabetes. Diabetes is growing fast in this world. In this paper MLT based Framework is recommended for early prediction of Diabetes Mellitus (DM). In this Paper the authors make use of PIDD data set. Different MLTs are used including Support Vector Classification (SVC), Logistic Regression (LR), K Nearest Neighbor (KNN) and Random Forest (RF). Data analysis is the first step in our method after which the information is transferred for data pre-processing and feature selection methods. RF performed better than other models with a 92.85 % accuracy rate followed by SVC (91.5%), LR (83.11) and KNN (89.6). K-fold cross-validation technique is utilized to verify the outcomes. The contribution of lifestyle characteristics is calculated using a feature engineering process. As a result, comprehensive overall comparative assessments of all the algorithms are performed taking into account variables such as accuracy, precision, sensitivity, recall, F1 score and ROC-AUC. The medical field can use the proposed framework to make early diabetes predictions. Additionally, it can be applied to other datasets that have data in common with diabetes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47839/ijc.22.3.3230"
    },
    {
        "id": 17988,
        "title": "“Stopping the start”—new tobacco control measures for England",
        "authors": "Sanjay Agrawal, John Britton",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/bmj.p2358"
    },
    {
        "id": 17989,
        "title": "Draft NICE quality standard says adults stopping antidepressants should be supported to taper the dose slowly",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1211/pj.2023.1.172337"
    },
    {
        "id": 17990,
        "title": "Improving the Early Assessment of Child Neglect Signs—A New Technique for Professionals",
        "authors": "Giovanni Valtolina, Concetta Polizzi, Giovanna Perricone",
        "published": "2023-6-19",
        "citations": 1,
        "abstract": "This paper grants some considerations on a critical phenomenon for child health: child neglect. It is an omission-type form of childhood maltreatment, which is widespread but very hard to intercept. For the assessment of child neglect, the Italian Society of Pediatric Psychology (S.I.P.Ped.) has developed and validated a specific assessment technique (the C.N.A. technique). It is supposed to be for parents of children between 3 and 9 years old. It is based on a paradigm that identifies the dysregulation of parental competence as the cause of neglect. It can occur in hypo- or hyperactivation of three fundamental factors (recognition, stimulation, and care). The child neglect assessment technique (C.N.A.) differs from the retrospective tools available in the literature since it allows for interception of the “signs” of possible child neglect when negligence occurs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/pediatric15020035"
    },
    {
        "id": 17991,
        "title": "#489 Single port access (SPA) Robot assisted radical trachelectomy for patients with early stage uterine cervical stumpcancer: farfgaly’s technique",
        "authors": "Samir Farghaly",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/ijgc-2023-esgo.151"
    },
    {
        "id": 17992,
        "title": "Mental Health Monitoring Using Deep Learning Technique for Early-Stage Depression Detection",
        "authors": "Khushboo Singh, Mitul Kumar Ahirwal, Manish Pandey",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-02113-4"
    },
    {
        "id": 17993,
        "title": "Emergency Endoscopic Hemostasis Using the Endoscopic Mucosal Resection Technique for Severe Bleeding From Early Gastric Cancer: A Case Report",
        "authors": "Kimitoshi Kubo, Xinhan Zhang, Ikko Tanaka, Noriko Kimura",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.54429"
    },
    {
        "id": 17994,
        "title": "Complications of growing rod technique for early onset scoliosis",
        "authors": "Anuj Gupta, Abhishek Srivastava, Vikas Hanasoge, Arvind Jayaswal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/isj.isj_73_22"
    },
    {
        "id": 17995,
        "title": "Comment on: Surgical technique, perioperative management and early outcome data of the PAUL glaucoma drainage device, dated September 2021",
        "authors": "Michelle Dinsdale, Leon Au",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41433-024-03054-9"
    },
    {
        "id": 17996,
        "title": "Pathogen Stopping and Metabolism Modulation Are Key Points to Linum usitatissimum L. Early Response against Fusarium oxysporum",
        "authors": "Yannis Maillot, Gaëlle Mongelard, Anthony Quéro, Hervé Demailly, Stéphanie Guénin, Laurent Gutierrez, Christophe Pineau, Sylvain Lecomte, David Mathiron, Redouan Elboutachfaiti, Jean-Xavier Fontaine, Roland Molinié, Emmanuel Petit",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "Fusarium oxysporum is the one of the most common and impactful pathogens of flax. Cultivars of flax that show resistance to this pathogen have previously been identified. To better understand the mechanisms that are responsible for this resistance, we conducted time-lapse analysis of one susceptible and one resistant cultivar over a two-week period following infection. We also monitored changes in some metabolites. The susceptible cultivar showed a strong onset of symptoms from 6 to 8 days after inoculation, which at this time point, was associated with changes in metabolites in both cultivars. The resistant cultivar maintained its height and normal photosynthetic capacity but showed a reduced growth of its secondary stems. This resistance was correlated with the containment of the pathogen at the root level, and an increase in some metabolites related to the phenylpropanoid pathway.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/plants12101963"
    },
    {
        "id": 17997,
        "title": "Implementation of Local Wisdom in Stopping Prosecutions Based on Restorative Justice",
        "authors": "Nurcahyo Jungkung Madyo",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "The Constitution of the Republic of Indonesia guarantees certainty, order, and legal protection for every citizen. Crime Statistics in 2021 showed that the number of criminal incidents in 2020 was 247,218 incidents. During the period from 2011 to 2018, theft was the most common crime in villages/the rural community in Indonesia, reaching more than 36-45% of all crimes. The term ”law blunts upwards, sharply downwards” is still often heard as a criticism of the government from justice seekers, especially regarding law enforcement against crimes of a minor or minor nature, such as theft in rural communities. The research method used is normative juridical with a historical approach, a case approach, and a conceptual approach, with a qualitative juridical analysis of legal materials. The results of this study argue that the adoption of the value of local wisdom can be beneficial for the renewal of Indonesian criminal law. The form of renewal is the formation of criminal procedural law to stop the prosecution of light cases. The basis for its implementation can use the theoretical basis of restorative justice, the principle of ultimum remedium, and the principle of fast, simple, and low-cost justice. The form of implementation of local wisdom in the termination of prosecutions is community reparation boards and citizen panels.\r\nKeywords: restorative justice, local wisdom, criminal",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/kss.v8i3.12843"
    },
    {
        "id": 17998,
        "title": "Gambler’s ruin with random stopping",
        "authors": "Gregory J. Morrow",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15326349.2023.2241066"
    },
    {
        "id": 17999,
        "title": "Adaptive Kalman filter and self-designed early stopping strategy optimized convolutional neural network for state of energy estimation of lithium-ion battery in complex temperature environment",
        "authors": "Jin Li, Shunli Wang, Lei Chen, Yangtao Wang, Heng Zhou, Josep M. Guerrero",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.est.2024.110750"
    },
    {
        "id": 18000,
        "title": "Sharp Equilibria for Time-Inconsistent Mean-Field Stopping Games",
        "authors": "Ziyuan Wang, Zhou Zhou",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4669019"
    },
    {
        "id": 18001,
        "title": "Stream regularization index. A morphometric approach to quantify the longitudinal profile regularization stage",
        "authors": "Francisco Abel Jiménez-Cantizano, Loreto Antón",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geomorph.2022.108580"
    },
    {
        "id": 18002,
        "title": "Neurovascular Structure-Adjacent Frozen-Section Examination (NeuroSAFE) Technique of Nerve-Sparing Robot-Assisted Radical Prostatectomy (RARP) in Indian Scenario: Technique, Feasibility, and Early Outcomes",
        "authors": "Ravi Taori, Gowtham Penmetsa, Kinju Adhikari, Tejus Chiranjeevi, Anil Kumar, S. K. Raghunath",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13193-024-01885-2"
    },
    {
        "id": 18003,
        "title": "Regularization of the RLS algorithm for adaptive digital predistortion",
        "authors": "I.E. Kashchenko, A.P. Pavlov",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Problem statement. Modern digital pre-image input systems, as a rule, involve the use of adaptation algorithms to correct their parameters. Adaptation algorithms are solutions based on LMS and RLS methods. At the same time, the efficiency, in terms of the convergence rate and the accuracy of the solution, of RLS methods is significantly higher. This is due to the presence of a covariance matrix as part of the solution based on the RLS method. However, when using RLS algorithms (an adaptation algorithm using the RLS method), problems may arise related to poor conditionality of the covariance matrix resulting from signal noise, high inertia of the nonlinear properties of the power amplifier, limited accuracy of parameter calculation, etc. To solve this problem, it is advisable to use the regularization procedure of the RLS algorithm, taking into account the specifics of the digital predistortion systems.  Objective. Creation and analysis of the regularization procedure of the RLS algorithm for adaptive input systems of digital presets.  Results. The paper presents the implementation of the regularization procedure of the RLS algorithm for adaptive input systems of digital presets. Using the regularization procedure of the RLS algorithm avoids the state of poor conditionality of the covariance matrix, thereby ensuring stable operation of the digital pre-order input system. The state of the covariance matrix is monitored at each iteration of the RLS algorithm by evaluating the trace of the matrix.  Practical importance. The proposed solution can be used to stabilize the parameters of adaptive systems for entering pre-orders based on RLS algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18127/j00338486-202401-13"
    },
    {
        "id": 18004,
        "title": "Optimal stopping with expectation constraints",
        "authors": "Erhan Bayraktar, Song Yao",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aap1980"
    },
    {
        "id": 18005,
        "title": "Machine Learning Based Optimal Feature Selection Technique for Early Stage Prediction of Alzheimer's Disease",
        "authors": "Kavita Bhatt, N. Jayanthi, Manjeet Kumar",
        "published": "2023-5-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176873"
    },
    {
        "id": 18006,
        "title": "A Modified Reverse Planning Method for Correction of Distal Femoral Valgus Deformity: Surgical Technique and Early Results",
        "authors": "Christopher A. Iobst, Anirejuoritse Bafor",
        "published": "2023-9",
        "citations": 0,
        "abstract": "\nBackground:\nA reverse planning method is an option for distal femur deformity correction. However, the accuracy of the technique hinges on the precision of the initial guidewire placement. This study describes a modification to the reverse planning method designed to simplify the surgical procedure for retrograde femoral nailing to correct valgus deformities. The steps of the surgical technique and the early results are presented.\n\n\nMaterials and Methods:\nAfter IRB approval, patients with distal femoral valgus deformity treated with retrograde nails using the modified reverse planning method were identified. Data obtained retrospectively included basic demographics, pre and postsurgery mechanical lateral distal femoral angle, the magnitude of limb length discrepancy if present, the duration of surgery, and the occurrence of any complications.\n\n\nResults:\nWe analyzed 17 limbs in 15 patients (10 females). The mean age at surgery was 18 years. Four patients had an additional limb length discrepancy (mean value of 2.8 ± 0.9 cm). The mean pre and postoperative mechanical lateral distal femoral angle was 83 degrees and 90 degrees, respectively (P < 0.0001). The mean duration of surgery was 90 minutes.\n\n\nConclusions:\nThis study demonstrates that the modified reverse planning concept can be applied successfully to achieve accurate correction and healing of distal femoral valgus deformities. Furthermore, by adjusting the level of the osteotomy, this modified approach simplifies the surgical technique in several ways: (1) it creates a reproducible visual cue for the surgeon, (2) it decreases the surgical time by eliminating the need for fixator assistance, and (3) it reduces the need for multiple coronal planes blocking screws.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/bto.0000000000000621"
    },
    {
        "id": 18007,
        "title": "Deep Learning-based Early Lung Cancer Detection using Multi-Model Image Fusion Technique",
        "authors": "Monita Wahengbam, M. Sriram, Tonjam Gunendra Singh",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacrs58579.2023.10405217"
    },
    {
        "id": 18008,
        "title": "Recurrence of acute chest syndrome post stopping Crizanlizumab, the dilemma of stopping vs continuation in patient with sickle cell disease: case report",
        "authors": "Mohammad S. Afana, Mohammad Abu-Tineh, Awni Alshurafa, Ahmed K. Yasin, Khalid Ahmed, Mohammed Abdulgayoom, Mohamed A. Yassin",
        "published": "2023-12-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/16078454.2023.2229115"
    },
    {
        "id": 18009,
        "title": "DREaD: Decision Tree-Aided Random Early Detection - An Intelligent Active Queue Management Technique",
        "authors": "Kevikhietuo Kesiezie, Lithungo K Murry",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442782"
    },
    {
        "id": 18010,
        "title": "Stopping the Spying: US Labor Unions’ Responses to Electronic Surveillance at Work",
        "authors": "Miranda Cross",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4784029"
    },
    {
        "id": 18011,
        "title": "Outcomes of Early Weight Bearing in Displaced Intra-articular Calcaneus Fractures Treated with Screws-Only Fixation Technique",
        "authors": "Adisorn Chongmuenwai, Tharit Thitirangsi",
        "published": "2023-1-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s43465-023-00823-8"
    },
    {
        "id": 18012,
        "title": "PENDEKATAN TEKNIK THOUGHT STOPPING DENGAN KONSELING INDIVIDUAL UNTUK MENGATASI KECEMASAN BERSOSIALISASI PADA WARGA BINAAN BARU DI LAPAS PEREMPUAN PALEMBANG",
        "authors": " Widya Asmara, Sihabudin M. Amin, Noviza Neni",
        "published": "2023-5-13",
        "citations": 0,
        "abstract": "The background of this study is that individuals who have high self-confidence can be said to be someone who respects himself. Every individual who has courage is able to make himself a person who can develop, be able to live life in the future, establish good relationships with other people without feeling afraid. This research uses a type of Field Research research, a qualitative approach, and uses a descriptive method. Aims to help with social anxiety by using thought-stopping techniques. This study uses data analysis techniques, namely data reduction, data presentation and drawing conclusions. Data collection techniques used are observation, interviews, and documentation. The results of the study obtained social anxiety from several subjects, namely having fear of the new environment, lack of confidence, and not being able to accept oneself. after the counseling process results, the client is able to control his social anxiety, the client has the courage to live a new life and is excited to live the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30739/jbkid.v3i1.2058"
    },
    {
        "id": 18013,
        "title": "AAV vector immunotoxicity: Stopping the domino effect",
        "authors": "Aravind Asokan",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ymthe.2023.11.016"
    },
    {
        "id": 18014,
        "title": "Study Validates Stopping Immune Therapy for NSCLC at 2 Years",
        "authors": "Chuck Holt",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.cot.0000947636.19018.f7"
    },
    {
        "id": 18015,
        "title": "Who is accountable for stopping racism in our children’s hospitals?",
        "authors": "Michael DeBaun",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41390-024-03089-4"
    },
    {
        "id": 18016,
        "title": "A local hemostatic agent in the form of a chitosan-based gel is a promising technique for stopping ongoing intra-abdominal bleeding: an experimental study",
        "authors": "Konstantin P. Golovko, Artem M. Nosov, Andrey B. Yudin, Igor M. Samokhvalov, Konstantin N. Demchenko, Artem A. Pichugin, Arkady Ya. Kovalevskiy",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "Bleeding is one of the most common causes of death in armed conflicts. Moreover, many medical devices have been developed to stop ongoing external bleeding, including local hemostatic agents, turnstiles, and compressors. Stopping ongoing internal bleeding remains an urgent problem in military medicine. Before the current era wherein qualified medical care is provided, internal bleeding is impossible to stop. Thus, new methods and techniques are being developed to stop (control) intracavitary bleeding at the prehospital stage. In this study, a chitosan-based agent was developed in the form of a gel to stop internal bleeding. In an experiment of large laboratory animals as models of ongoing intra-abdominal bleeding, the effectiveness of the developed drug was evaluated, and it demonstrated high hemostatic efficiency. The developed local hemostatic agent, administered by laparocentesis, could stop grade 3 bleeding according to the validated intraoperative bleeding scale from the liver wound without causing inflammatory changes in the surrounding organs and tissues. The local hemostatic agent helped avoid fatal outcomes in the experimental group compared with the control group (one fatal outcome in three animals). Changes in the hemoglobin level and erythrocyte count indicated that hemostasis occurred almost immediately after the administration of the local hemostatic agent in the experimental group, whereas in the control group, hemostasis remained unstable throughout the observation period. The histological examination of liver preparations confirmed stable hemostasis without the development of a local inflammatory reaction or necrosis when a local biocompatible hemostatic agent was used. The developed technology can be used starting from the stage of first aid, helping stop intracavitary bleeding at the prehospital stage and improving the treatment outcomes of wounded individuals and those with abdominal injuries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17816/brmma562796"
    },
    {
        "id": 18017,
        "title": "On an Extension of a Spare Regularization Model",
        "authors": "Abdellatif Moudafi",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "In this paper, we would first like to promote an interesting idea for identifying the local minimizer of a non-convex optimization problem with the global minimizer of a convex optimization one. Secondly, to give an extension of their sparse regularization model for inverting incomplete Fourier transforms introduced. Thirdly, following the same lines, to develop convergence guaranteed efficient iteration algorithm for solving the resulting nonsmooth and nonconvex optimization problem but here using applied nonlinear analysis tools. These both lead to a simplification of the proofs and to make a connection with classical works in this filed through a startling comment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11204285"
    },
    {
        "id": 18018,
        "title": "Ligon–Schaaf regularization map revisited",
        "authors": "Guowu Meng",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "The phase space of the classical Kepler problem is incomplete, as certain Kepler motions do not continue indefinitely in time. To address this issue, a method called “regularization” was introduced in the 1960s and 1970s. While there are several versions of this scheme, the one developed by Ligon and Schaaf [Rep. Math. Phys. 9, 281–300 (1976)] is often preferred due to its global nature and lack of time reparameterization requirement. In this article, we present a new regularization method that is both global and requires no time reparameterization, while also exhibiting a higher degree of symmetry. Our method emphasizes symmetries over spaces and exhibits a duality similar to the compact-noncompact duality observed in symmetric spaces.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0163676"
    },
    {
        "id": 18019,
        "title": "Image Registration with Learned Regularization",
        "authors": "Xinjie Lai, Wan Yang, Lvda Wang, Shihui Ying",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450865"
    },
    {
        "id": 18020,
        "title": "Advancing Early Detection of Cervical Cancer Through Multi-Model Intelligent Classifiers and Computational Technique",
        "authors": "Sumantra Chaudhuri, K Suneetha, Kalyan Acharjya",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10455756"
    },
    {
        "id": 18021,
        "title": "Optimal Stopping and Loading Rules Considering Multiple Attempts and Task Success Criteria",
        "authors": "Yaguang Wu",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "Numerous engineering systems gradually deteriorate due to internal stress caused by the working load. The system deterioration process is directly related to the workload, providing opportunities for decision-makers to manage system deterioration by modifying the workload. As one of the most effective ways to control system malfunction risk, mission stopping has been extensively studied. Most existing research on mission stopping ignores the effect of working loads on the internal deterioration of safety-critical systems. The purpose of this work is to examine the optimal joint loading and stopping rules for systems subject to internal degradation under two types of mission success requirements (MSR). The problem is formulated using the recursive algorithm to minimize the expected cost over the mission. Mission reliability and system safety are assessed, and the optimal loading and stopping rules are investigated. The established models are illustrated by practical examples, and comprehensive policy comparison and parameter sensitivity analysis on the allowable mission time, mission duration and the number of mission tries are conducted. Our findings indicate that dynamic load level modification has a substantial effect on system deterioration and predicted long-term costs. For the purpose of decision-making, several managerial implications for the joint development of load adjustment and abort implementation are obtained.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11041065"
    },
    {
        "id": 18022,
        "title": "A Comprehensive Study on the Digestive Endoscopic Technique and Narrow-Band Imaging for Early Gastric Cancer Screening",
        "authors": "Jing Ma",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "Objective: To explore the implementation of gastrointestinal endoscopy technology and endoscopic narrow-band imaging (NBI) in the early screening of gastric cancer and to observe and study their application effects. Methods: During the period from March 2023 to August 2023, 312 patients who received gastroscopy in the Kunming Guandu District People’s Hospital were selected, and they underwent both conventional gastroscopy and endoscopic NBI, with clinicopathological tissue biopsy serving as the gold standard. The application value for early screening of gastric cancer was observed and analyzed. Results: The scoring data showed that the clarity of gastric mucosal glandular tube structure, microvascular structure clarity, and lesion contour scoring data of conventional gastroscopy were lower than those of the NBI technology (P < 0.05). The screening rate of pathological biopsy in 312 patients was 18.59% (58 cases). Conventional gastroscopy showed a screening rate of 11.53% (36 cases), while NBI technology examined a screening rate of 17.63% (55 cases), and the two-by-two comparison of the screening rate data of the three groups was not statistically significant (P > 0.05). The sensitivity, specificity, accuracy, positive predictive value, and negative predictive value of conventional gastroscopy appeared to be lower than those of NBI technology (P < 0.05). Conclusion: In the early screening of gastric cancer, endoscopic NBI technology can be applied to patients. Compared with conventional gastroscopy, it provides a clearer visualization of the structure of the gastric mucosal glandular structure and microvascular structure, with a certain screening rate. Additionally, its sensitivity, specificity, accuracy, positive predictive value, and negative predictive value are higher, demonstrating outstanding effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26689/par.v8i1.5909"
    },
    {
        "id": 18023,
        "title": "Decomposing Duration Dependence in a Stopping Time Model",
        "authors": "Fernando Alvarez, Katarína Borovičková, Robert Shimer",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "Abstract\nWe develop an economic model of transitions in and out of employment. Heterogeneous workers switch employment status when the net benefit from working, a Brownian motion with drift, hits optimally chosen barriers. This implies that the duration of jobless spells for each worker has an inverse Gaussian distribution. We allow for arbitrary heterogeneity across workers and prove that the distribution of inverse Gaussian distributions is partially identified from the duration of two non-employment spells for each worker. We estimate the model using Austrian social security data and find that dynamic selection is a critical source of duration dependence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/restud/rdad109"
    },
    {
        "id": 18024,
        "title": "A Technique for Early Identification of Network Separation to Enhance Frequency Resilience",
        "authors": "Md. Fatin Ishraq Faruqui, Kazi Ishrak Ahmed, Atik Jawad,  Nahid-Al-Masood",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080441"
    },
    {
        "id": 18025,
        "title": "A New Rfid Anti-Collision Technique Based On Time-Hopping Sub Slots Early Estimation",
        "authors": "Frahtia Abderrahmene, Benssalah Mustapha, Kifouche Abdenour",
        "published": "2023-3-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeccs56710.2023.10105020"
    },
    {
        "id": 18026,
        "title": "Exploring Hessian Regularization in Mixup",
        "authors": "Kosuke Sugiyama, Masato Uchida",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00276"
    },
    {
        "id": 18027,
        "title": "Discrete stopping times in the lattice of continuous functions",
        "authors": "Achintya Raya Polavarapu",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11117-024-01044-5"
    },
    {
        "id": 18028,
        "title": "Heart-Stopping Rollercoaster",
        "authors": "Zachary Schafer",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/19434871.2023.12290280"
    },
    {
        "id": 18029,
        "title": "EARLY SURGICAL RESULTS OF SUTURE ANCHOR TENDON REPAIR COMBINED WITH BONE DRILLING TECHNIQUE FOR RECALCITRANT LATERAL EPICONDYLITIS",
        "authors": "Hakan Cici, Hakan Zeybek, Ali c",
        "published": "2023",
        "citations": 0,
        "abstract": "Objectives: The aim of this study was to report the early results of patients who underwent surgical treatment with suture anchor tendon repair combined with the bone drilling technique for a diagnosis of recalcitrant lateral epicondylitis.\nMethods: A retrospective analysis was made of 11 patients (2 males, 9 females; mean age: 38.3 years) who underwent surgery with suture anchor tendon repair and the bone drilling technique for a diagnosis of recalcitrant lateral epicondylitis between September 2019 and January 2022. The demographic data of the patients, the Disabilities of the Arm, Shoulder, and Hand (DASH) questionnaire score, Visual Analog Scale (VAS) value, joint Range of Motion (ROM) values, and the wrist extension, pinch and grip muscle strength measurements at the final follow-up examination were recorded.\nResults: The mean follow-up period was 18 months (range, 12-26 months), and the time to return to pre-injury activity in 10 patients was determined to be mean 7.3 months (range, 6-9 months). No significant loss of ROM was observed in any patient. The postoperative DASH score was calculated as mean 8.3 (range, 0 -43.5). A decrease of 84% was determined in the VAS scores postoperatively. Wrist extension strength was evaluated as grade 5 in 10 patients and grade 4 in one. The mean pinch strength was +102% of the non-operated extremity, and the mean grip strength was +101% of the non-operated extremity.\nConclusion: The suture anchor tendon repair combined with the bone drilling technique can be an effective method in the surgical treatment of recalcitrant lateral epicondylitis, providing an early return to pre-injury activity, pain reduction and maintaining muscle strength",
        "keywords": "",
        "link": "http://dx.doi.org/10.5455/handmicrosurg.154991"
    },
    {
        "id": 18030,
        "title": "Early stage HIV diagnosis using optimized ensemble learning technique",
        "authors": "Ramesh Saha, Lokesh Malviya, Akshay Jadhav, Ramraj Dangi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2023.105787"
    },
    {
        "id": 18031,
        "title": "Predicting the Early Risk of Heart Disease using MABC with Self-Adaptive Bayesian Technique based on Lifestyle Factors",
        "authors": "K. Sudhakar, Mahaveerakannan R",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceca58529.2023.10395330"
    },
    {
        "id": 18032,
        "title": "Role of Hybrid Treatment Technique in Radiotherapy Planning for Early Stage Left Breast Cancer",
        "authors": "Nural Öztürk, Nurdan Özbek",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4274/meandros.galenos.2023.44452"
    },
    {
        "id": 18033,
        "title": "Musculofascial Z-Lengthening for the Management of Chronic Medial Epicondylitis: Technique and Early Results",
        "authors": "Sailesh V. Tummala, Eugenia Lin, Vikram Gill, Kevin J. Renfree",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "Medial epicondylitis is a common elbow pathology secondary to flexor-pronator tendinosis associated with repetitive wrist flexion activities. Though often responsive to nonoperative management, recalcitrant symptomatology is not uncommon. Surgical intervention for chronic medial epicondylitis most commonly involves open debridement of degenerative tendon which can be difficulty to identify and with a notably risk of iatrogenic complication. We present a reproducible musculofascial z-lengthening of the flexor-pronator mass for management of chronic medial epicondylitis and report the mid-term results of this intervention.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/bth.0000000000000464"
    },
    {
        "id": 18034,
        "title": "Retrospective evaluation the results of the repair of flexor tendon injuries in the hand using  a  combination  of  epitenon  first  suture  technique  and  controlled  early  active mobilization",
        "authors": "Saad Mohamed Saad Ibrahiem,  ",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52845/ijmhs/2021/11-01-10"
    },
    {
        "id": 18035,
        "title": "REGULARIZATION OF WAKEFIELD IN A WEAKLY NONLINEAR REGIME",
        "authors": "I.V. Demydenko",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "In blowout regime of wakefield excitation, strong chaotization of wake occurs. However, for electron-positron colliders and X-ray microscopes, a weakly nonlinear regime is proposed with the formation of a regular short chain of bubbles. To increase the efficiency of the wakefield accelerator, it is necessary that not separate bunches participate. In this paper in 2D plane geometry, the dependence of the number of formed bubbles and their regularization on the degree of wake non-linearity and parameters: driver current, ion mobility, transverse plasma size and profile is studied. We will show that in a weakly nonlinear regime the regular chain of bubbles becomes longer.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46813/2023-148-080"
    },
    {
        "id": 18036,
        "title": "Supplemental Material for Bayesian Regularization in Multiple-Indicators Multiple-Causes Models",
        "authors": "",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/met0000594.supp"
    },
    {
        "id": 18037,
        "title": "Regularization Trade-offs with Fake Features",
        "authors": "Martin Hellkvist, Avça Özçelikkale, Anders Ahlén",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289928"
    },
    {
        "id": 18038,
        "title": "Complementary Data Regularization for Nonlinear Matrix-Valued Image Denoising",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55463/issn.1674-2974.50.10.8"
    },
    {
        "id": 18039,
        "title": "Semi-NMF Regularization-Based Autoencoder Training for Hyperspectral Unmixing",
        "authors": "Divyam Goel, Saurabh Khanna",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ncc60321.2024.10485752"
    },
    {
        "id": 18040,
        "title": "Gradient Maximization Regularization for Signed Adversarial Attacks",
        "authors": "Deniz Sen",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eleco60389.2023.10415930"
    },
    {
        "id": 18041,
        "title": "There's no (bus) stopping us!",
        "authors": "Preetee Hylton",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": " Preetee Hylton tells Dental Nursing about her trip out as an oral health educator with Driving For Change. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.12968/denn.2024.20.1.13"
    },
    {
        "id": 18042,
        "title": "Residual norm behavior for Hybrid LSQR regularization",
        "authors": "Eva Havelková, Iveta Hnětynková",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "Hybrid LSQR represents a powerful method for regularization of large-scale discrete inverse problems, where ill-conditioning of the model matrix and ill-posedness of the problem make the solutions seriously sensitive to the unknown noise in the data. Hybrid LSQR combines the iterative Golub-Kahan bidiagonalization with the Tikhonov regularization of the projected problem. While the behavior of the residual norm for the pure LSQR is well understood and can be used to construct a stopping criterion, this is not the case for the hybrid method. Here we analyze the behavior of norms of approximate solutions and the corresponding residuals in Hybrid LSQR with respect to the Tikhonov regularization parameter. This helps to understand convergence properties of the hybrid approach. Numerical experiments demonstrate the results in finite precision arithmetic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21136/panm.2022.07"
    },
    {
        "id": 18043,
        "title": "Entropy Based Regularization Improves Performance in the Forward-Forward Algorithm",
        "authors": "Matteo Pardi, Domenico Tortorella, Alessio Micheli",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-79"
    },
    {
        "id": 18044,
        "title": "Mentor mothers stopping vertical transmission in Kenya",
        "authors": "Christabel Ligami",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s2352-3018(23)00148-0"
    },
    {
        "id": 18045,
        "title": "Cluster Regularization via a Hierarchical Feature Regression",
        "authors": "Johann Pfitzinger",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecosta.2024.01.003"
    },
    {
        "id": 18046,
        "title": "Cahn–Hilliard equation with regularization term",
        "authors": "Rim Mheich",
        "published": "2023-7-12",
        "citations": 1,
        "abstract": "We will study in this article the nonlinear Cahn–Hilliard equation with proliferation and regularization terms with regular and logarithmic potentials. First, we consider the regular potential case, we show that the solutions blow up in finite time or exist globally in time. Furthermore, we prove that the model possess a global attractor. In addition, we construct a robust family of exponential attractors, i.e. attractors which are continuous with respect to the perturbation parameter. In the second part, we consider the logarithmic potential case and show the existence of a global solution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/asy-221821"
    },
    {
        "id": 18047,
        "title": "Error and optimism bias regularization",
        "authors": "Nassim Sohaee",
        "published": "2023-1-28",
        "citations": 1,
        "abstract": "AbstractIn Machine Learning, prediction quality is usually measured using different techniques and evaluation methods. In the regression models, the goal is to minimize the distance between the actual and predicted value. This error evaluation technique lacks a detailed evaluation of the type of errors that occur on specific data. This paper will introduce a simple regularization term to manage the number of over-predicted/under-predicted instances in a regression model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40537-023-00685-9"
    },
    {
        "id": 18048,
        "title": "Regularization of distributions",
        "authors": "Aleksandr Leonidovich Pavlov",
        "published": "2023",
        "citations": 0,
        "abstract": "Sufficient conditions are presented for the construction of a regularization of a distribution in the form $a(\\sigma)f$, where $f$ is a distribution and $a(\\sigma)$ is an infinitely differentiable function outside a closed set $N$ which has power-like singularities of derivatives on $N$. Applications of such regularizations to an effective construction of solutions of the equation $Pu=f$, where $P(\\sigma)$ is a polynomial, are considered.\nBibliography: 14 titles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4213/sm9803e"
    },
    {
        "id": 18049,
        "title": "Hybrid technique versus traditional dual growing rod technique to treat congenital early-onset scoliosis: a comparative study with more than 3 years of follow-up",
        "authors": "Shengru Wang, Yiwei Zhao, Yang Yang, Guanfeng Lin, Jianxiong Shen, Yu Zhao, Nan Wu, Qianyu Zhuang, You Du, Jianguo Zhang",
        "published": "2023-2-1",
        "citations": 5,
        "abstract": "\nOBJECTIVE\nThe authors’ objective was to compare the intermediate outcomes of patients with severe congenital early-onset scoliosis (CEOS) treated with posterior vertebrectomy/hemivertebrectomy with short fusion and dual growing rods (hybrid technique [HT]) and those treated with traditional dual growing rods (TDGRs).\n\n\nMETHODS\nA retrospective study of patients who underwent the HT and TDGR technique for CEOS was conducted. The inclusion criteria were CEOS (age < 10 years), Risser stage 0, treatment with HT or TDGR, index surgery performed between 2004 and 2017, and minimum follow-up of 3 years. For patients who completed lengthening procedures, the last lengthening procedure was considered the latest follow-up. Demographic, radiographic, clinical, and patient-reported outcomes and revisions were compared between groups.\n\n\nRESULTS\nSixty-one patients with CEOS were included in this study, with 16 treated with HT and 45 with TDGR technique. There were no differences in age at index surgery, duration of treatment, or number of lengthening procedures. The lengthening interval was longer in the HT group. The preoperative mean ± SD main curve was 81.8° ± 17.1° for the HT group and 63.3° ± 16.9° for the TDGR group (p < 0.05). However, main curve correction was better in the HT group, and no differences in residual curve were found between groups. Although the preoperative apex vertebral translation (AVT) of the HT group was greater, the correction of AVT was better in the HT group (p < 0.05). No differences in T1–S1 and T1–12 height were found between groups at the latest follow-up. The growth of T1–S1 height was less in the HT group (p < 0.05), whereas the growth of T1–12 height was similar between groups. Patients in the HT group had a lower risk of mechanical complications but higher risks of dural tears and neurological complications.\n\n\nCONCLUSIONS\nHT may provide better correction and apex control ability than TDGR for EOS patients with severe and rigid deformity at the apex level, and it significantly decreased the risk of mechanical complications with little influence on growth of the thoracic spine. HT may be an option for patients with severe CEOS with large asymmetrical growth potential around the apex of the curve.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.3171/2022.8.spine22618"
    },
    {
        "id": 18050,
        "title": "Factors of Competency for Pre-service Early Childhood Teachers in Early Childhood Mathematics Subjects Using the Delphi Technique",
        "authors": "Soon Bok Lee, A Reum Jung",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25020/je.2023.43.1.237"
    },
    {
        "id": 18051,
        "title": "Constructing brain functional networks with adaptive manifold regularization for early mild cognitive impairment",
        "authors": "Xidong Fu, Shengchang Shan, Chun Liu, Yu Lu, Zhuqing Jiao",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractBrain functional network (BFN) has emerged as a practical path to explore biomarkers for early mild cognitive impairment (eMCI). Currently, most of BFNs only considered the topology structure between two brain regions and ignored the high‐order information among multiple brain regions. We proposed an adaptive manifold regularization method to construct a new BFN. Firstly, a traditional hypergraph was constructed through a low‐order BFN. Then, an adaptive hypergraph was obtained by updating the traditional hypergraph weight and structure through adaptive hypergraph learning. An adaptive hypergraph manifold regularization term was constructed by the Laplacian matrix of the adaptive hypergraph. Finally, the low‐order BFN was optimized through the adaptive hypergraph manifold regularization and  sparse regularization. The experimental results confirmed that the proposed method outperformed other state‐of‐the‐art methods in classification performance and stability. This study revealed the causes of changes in topological properties and provided a reference for the clinical diagnosis of eMCI.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ima.23053"
    },
    {
        "id": 18052,
        "title": "Comparative analysis of early functional outcomes following the hood technique vs. standard nerve sparing technique during RARP",
        "authors": "N. Khanmammadova, A.D. Cumpanas, D. Jiang, R. Gevorkyan, M. Epino, T. Chu, A. Gao, A.S. Afyouni, M. O’leary, T.T. Nguyen, C. Fung, C. Nguyen, S.N. Ali, M. Shahait, D.I. Lee",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0302-2838(24)00593-1"
    },
    {
        "id": 18053,
        "title": "Analysis Method of Operating Freeway Speed Limit Value Optimization Based on Stopping Sight Distance",
        "authors": "Bin Ai, Mingjun Deng",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485040.010"
    },
    {
        "id": 18054,
        "title": "Almost Strong Equilibria for Time-Inconsistent Stopping Problems Under Finite Horizon in Continuous Time",
        "authors": "Zhou Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4431616"
    },
    {
        "id": 18055,
        "title": "Optimal stopping algorithm and its application under the condition of fuzzy asset information",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61784/wmsv2n185"
    },
    {
        "id": 18056,
        "title": "SFAO: Sign-Flipping-Aware Optimization for Early-Stopping of Binarized Neural Networks",
        "authors": "Ju Yeon Kang, Chang Ho Ryu, Suk Bong Kang, Tae Hee Han",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3332472"
    },
    {
        "id": 18057,
        "title": "Balancing Learning Model Privacy, Fairness, and Accuracy With Early Stopping Criteria",
        "authors": "Tao Zhang, Tianqing Zhu, Kun Gao, Wanlei Zhou, Philip S. Yu",
        "published": "2023-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3129592"
    },
    {
        "id": 18058,
        "title": "Closed-chest robotic repair of mitral prolapse. Surgical technique and early results",
        "authors": "Elena Sandoval, Ignacio Morales-Rey, Luis Bartolozzi, Daniel Pereda",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "BackgroundRobotic mitral repair is generally performed with four intercostal trocars and a minithoracotomy. We describe our technique and results with a totally-thoracoscopic closed chest approach using a 12 mm valveless trocar as “working port”, without a minithoracotomy. We compared our results with this technique with a control group of robotic mitral repairs performed earlier with a minithoracotomy.MethodsReview of all patients with degenerative mitral valve disease who underwent robotic mitral valve repair surgery since December 2019 (n = 110). Patients with concomitant procedures (n = 8) were excluded. The remaining 102 patients were divided in two groups, depending on the approach used, minithoracotomy (n = 63) and totally thoracoscopic (n = 39).ResultsThere were no significant differences between groups regarding preoperative characteristics. All procedures were completed robotically as planned, and repair rate was 100%. The minithoracotomy group showed a higher percentage of leaflet resections (17.9% vs. 38.7%; p = 0.03). All surgical times were significatively reduced in the totally thoracoscopic group: Cardiopulmonary bypass (97 vs. 115 min, p = 0.0008), ischemic time (67 vs. 80 min, p = 0.0013) and total surgical time (185 vs. 225 min; p &lt; 0.00001). There were no differences in ICU length of stay (1 day, p = 0.07) but hospital length of stay was shorter in the totally thoracoscopic group (4 days; p = 0.0001). Postoperative complications were similar between groups. MR at discharge was mild or less in all cases.ConclusionsRobotic mitral repair for degenerative disease can be safely performed as a closed-chest procedure, using a 12 mm trocar as “working port” and avoiding the need for a minithoracotomy. This approach does not seem to negatively affect the quality of the procedure by any measure, providing similar excellent clinical outcomes and repair rate. All surgical times were shorter in the closed-chest group.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fcvm.2023.1237151"
    },
    {
        "id": 18059,
        "title": "Early Detection of Alzheimer’s Disease: An Extensive Review of Advancements in Machine Learning Mechanisms Using an Ensemble and Deep Learning Technique",
        "authors": "Renjith Prabhavathi Neelakandan, Ramesh Kandasamy, Balasubramani Subbiyan, Mariya Anto Bennet",
        "published": "2023-12-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059010"
    },
    {
        "id": 18060,
        "title": "A study on improvising early detection of dot hemorrhages in the retina through dynamic image comparison technique",
        "authors": "C. Aravindan, R. Vasuki",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2021.04.268"
    },
    {
        "id": 18061,
        "title": "Cleaning Up the Chimney: Early Renal Stent Graft Thrombosis Following Endovascular Treatment of a Juxtarenal Aortic Aneurysm With the Chimney Technique",
        "authors": "Ioakeim Giagtzidis, Marios Theologou, Ioakeim Papoutsis, Christos Karkos, Konstantinos Papazoglou",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.54669"
    },
    {
        "id": 18062,
        "title": "Efficient prediction of early-stage diabetes using XGBoost classifier with random forest feature selection technique",
        "authors": "Serdar Gündoğdu",
        "published": "2023-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15165-8"
    },
    {
        "id": 18063,
        "title": "Early Flood Monitoring and Detection System with a Machine Learning’s Neural Network Technique and IoT Platform",
        "authors": "Harinidevi Nadarajan, Nagesparan Ainarappan, Farah Adilah Binti Jamaludin",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/e-tems57541.2023.10424472"
    },
    {
        "id": 18064,
        "title": "Diastolic compression device aimed at stopping refluxing flow",
        "authors": "Cestmir Recek",
        "published": "2023",
        "citations": 0,
        "abstract": "\n\t\t\t\t\t\t\nTheoretical concept of a diastolic compression device is presented. The device could have a form of a pneumatic cuff or a rubber sleeve. Its objective is to exert external pressure below the knee, which would compress the great saphenous vein during the diastolic phase of the calf pump activity, and hinder thereby the saphenous reflux and the occurrence of ambulatory venous hypertension. Based on the results of venous pressure measurements, it is supposed that pressure of about 35 mm Hg would be able to fulfill this therapeutic aim. If tolerated and accepted by the patients, the device could offer, in addition to the current invasive methods and compression stocking therapy, a simple conservative, nonetheless effective treatment of primary varicose veins. It would keep the dividing line of the ambulatory pressure gradient below the knee, as is the case with healthy people, and prevent thereby the progression of the disease. In addition, this conservative method would preserve the great saphenous vein for possible use as a bypass graft in the future.\n\n\t\t\t\t\t",
        "keywords": "",
        "link": "http://dx.doi.org/10.24019/jtavr.139"
    },
    {
        "id": 18065,
        "title": "Stopping the fat: Repurposing an antidepressant for cancer treatment",
        "authors": "Deepika Bhullar, Cosimo Commisso",
        "published": "2023-3-6",
        "citations": 1,
        "abstract": "In this issue of JEM, Chu and An et al. (2022. J. Exp. Med.https://doi.org/10.1084/jem.20221316) describe the role of the tricyclic antidepressant nortriptyline in inhibition of fatty acid uptake. Nortriptyline promotes cell acidification and suppresses macropinocytosis, providing a link between fatty acid uptake and tumor progression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1084/jem.20222097"
    },
    {
        "id": 18066,
        "title": "Hardy function modeling elevation anomaly based Tikhonov regularization",
        "authors": "Xiannan Han",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13168/agg.2024.0008"
    },
    {
        "id": 18067,
        "title": "Calculation of the Vacuum Energy Density Using Zeta Function Regularization",
        "authors": "Siamak Tafazoli",
        "published": "2023-2-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ecu2023-14053"
    },
    {
        "id": 18068,
        "title": "New regularization methods for convolutional kernel tensors",
        "authors": "Pei-Chang Guo",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>Convolution is a very basic and important operation for convolutional neural networks. For neural network training, how to bound the convolutional layers is a currently popular research topic. Each convolutional layer is represented by a tensor, which corresponds to a structured transformation matrix. The objective is to ensure that the singular values of each transformation matrix are bounded around 1 by changing the entries of the tensor. We propose three new regularization terms for a convolutional kernel tensor and derive the gradient descent algorithm for each penalty function. Numerical examples are presented to demonstrate the effectiveness of the algorithms.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.20231335"
    },
    {
        "id": 18069,
        "title": "Monopsony, Efficiency, and the Regularization of Undocumented Immigrants",
        "authors": "George J. Borjas, Anthony Edo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4519218"
    },
    {
        "id": 18070,
        "title": "Regularization of the Hypersonic Heat Flux",
        "authors": "Nhat Nguyen, Luca Massa",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-1728"
    },
    {
        "id": 18071,
        "title": "Monopsony, Efficiency, and the Regularization of Undocumented Immigrants",
        "authors": "George J. Borjas, Anthony Edo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4516249"
    },
    {
        "id": 18072,
        "title": "Monopsony, Efficiency, and the Regularization of Undocumented Immigrants",
        "authors": "George J. Borjas, Anthony Edo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4512491"
    },
    {
        "id": 18073,
        "title": "Non-linear Dynkin games over split stopping times",
        "authors": "Mohamed Marzougue",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.spl.2022.109721"
    },
    {
        "id": 18074,
        "title": "Asymptotic Duration for Optimal Multiple Stopping Problems",
        "authors": "Hugh N. Entwistle, Christopher J. Lustri, Georgy Yu. Sofronov",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "We study the asymptotic duration of optimal stopping problems involving a sequence of independent random variables that are drawn from a known continuous distribution. These variables are observed as a sequence, where no recall of previous observations is permitted, and the objective is to form an optimal strategy to maximise the expected reward. In our previous work, we presented a methodology, borrowing techniques from applied mathematics, for obtaining asymptotic expressions for the expectation duration of the optimal stopping time where one stop is permitted. In this study, we generalise further to the case where more than one stop is permitted, with an updated objective function of maximising the expected sum of the variables chosen. We formulate a complete generalisation for an exponential family as well as the uniform distribution by utilising an inductive approach in the formulation of the stopping rule. Explicit examples are shown for common probability functions as well as simulations to verify the asymptotic calculations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12050652"
    },
    {
        "id": 18075,
        "title": "A lift stopping mechanism controlled by a special rope fastening",
        "authors": "Jingrui Li",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "The lift leveling mechanism provided in this paper is controlled by the special rope fastening. By using the lift leveling mode controlled by the rope fastening, the leveling mode of the lifting system can be changed to the braking stop of the drive system after the platform is lowered and placed on the bracket. The problem of anchorage precision and the vibration caused by elastic expansion of the rope during platform loading and unloading are effectively solved by using the supporting function of the piers. In the process of studying this problem, we simplified a heavy-duty elevator system to form a simplified model that can be used for simulation research. The device provided in this article provides a new solution for the leveling of the heavy-duty lifting system, which not only ensures the leveling accuracy of the lifting platform during loading and unloading, but also effectively reduces the impact during leveling, which has a beneficial guiding effect on this type of equipment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/vp.2023.23762"
    },
    {
        "id": 18076,
        "title": "Transductive Feature Space Regularization for Few-shot Bioacoustic Event Detection",
        "authors": "Yizhou Tan, Haojun Ai, Shengchen Li, Feng Zhang",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-579"
    },
    {
        "id": 18077,
        "title": "Stochastic Adaptive Regularization Method with Cubics: a High Probability Complexity Bound",
        "authors": "Katya Scheinberg, Miaolan Xie",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wsc60868.2023.10408598"
    },
    {
        "id": 18078,
        "title": "Adaptive L0 Regularization for Sparse Support Vector Regression",
        "authors": "Antonis Christou, Andreas Artemiou",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "In this work, we proposed a sparse version of the Support Vector Regression (SVR) algorithm that uses regularization to achieve sparsity in function estimation. To achieve this, we used an adaptive L0 penalty that has a ridge structure and, therefore, does not introduce additional computational complexity to the algorithm. In addition to this, we used an alternative approach based on a similar proposal in the Support Vector Machine (SVM) literature. Through numerical studies, we demonstrated the effectiveness of our proposals. We believe that this is the first time someone discussed a sparse version of Support Vector Regression (in terms of variable selection and not in terms of support vector selection).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11132808"
    },
    {
        "id": 18079,
        "title": "Streaming Audio-Visual Speech Recognition with Alignment Regularization",
        "authors": "Pingchuan Ma, Niko Moritz, Stavros Petridis, Christian Fuegen, Maja Pantic",
        "published": "2023-8-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-487"
    },
    {
        "id": 18080,
        "title": "Monopsony, Efficiency, and the Regularization of Undocumented Immigrants",
        "authors": "George J. Borjas, Anthony Edo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4508241"
    },
    {
        "id": 18081,
        "title": "A Unified Early Termination Technique for Primal-Dual Algorithms in Mixed Integer Conic Programming",
        "authors": "Yuwen Chen, Catherine Ning, Paul Goulart",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcsys.2023.3289062"
    },
    {
        "id": 18082,
        "title": "The adjustable artificial urinary sphincter (VICTO): Early prospective results and surgical technique in a high-risk cohort",
        "authors": "G. Ameli, P. Weibl, M. Rutkowski, W.A. Hübner",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0302-2838(23)01467-7"
    },
    {
        "id": 18083,
        "title": "Description of novel robotic early post prostatectomy anastomotic repair technique and institutional outcomes",
        "authors": "David Strauss, Eric Cho, Matthew Loecher, Matthew Lee, Daniel Eun",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ajur.2023.12.001"
    },
    {
        "id": 18084,
        "title": "Early Results of the Sandwich Technique Using Cyanoacrylate Glue and Polidocanol Foam Sclerotherapy for the Treatment of Varicose Veins",
        "authors": "Marian Simka, Marcin Skuła",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Background: This is a retrospective analysis of the results of treatment for varicose veins using the sandwich technique with cyanoacrylate glue and foam sclerotherapy. This novel method allows for a substantial reduction in the amount of glue needed for vein closure, and minimizes the risk of granuloma formation and allergic reaction related to the epifascial administration of cyanoacrylate. Methods: This technique was used in 60 patients, 77 intrafascial veins were managed. Vein closures were performed with Venex cyanoacrylate glue and 1–3% polidocanol foam. All procedures were performed under ultrasonographic control, through direct percutaneous punctures of target veins. Follow-ups were scheduled 1–3 weeks after the procedure. If revealed, unclosed segments of the target veins were obliterated at these follow-up visits, with glue and/or sclerotherapy. Results: There were no serious adverse events intra- or postprocedurally. The technical success rate was 100%. The primary success rate at 1–3 weeks follow-up was 84.4%. The primary assisted success rate, after additional closures, was 100%. Conclusions: We demonstrated that the treatment for varicose veins, using a sandwich technique, which combines cyanoacrylate glue and foam sclerotherapy, can be safe and efficient.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jvd3020011"
    },
    {
        "id": 18085,
        "title": "Stopping problems with an unknown state",
        "authors": "Erik Ekström, Yuqiong Wang",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "Abstract\nWe extend the classical setting of an optimal stopping problem under full information to include problems with an unknown state. The framework allows the unknown state to influence (i) the drift of the underlying process, (ii) the payoff functions, and (iii) the distribution of the time horizon. Since the stopper is assumed to observe the underlying process and the random horizon, this is a two-source learning problem. Assigning a prior distribution for the unknown state, standard filtering theory can be employed to embed the problem in a Markovian framework with one additional state variable representing the posterior of the unknown state. We provide a convenient formulation of this Markovian problem, based on a measure change technique that decouples the underlying process from the new state variable. Moreover, we show by means of several novel examples that this reduced formulation can be used to solve problems explicitly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/jpr.2023.52"
    },
    {
        "id": 18086,
        "title": "Hybrid Endoscopic Submucosal Dissection for Early Gastric Neoplasms: An Ideal Technique?",
        "authors": "Xiu-He Lv, Qing Lu, Jin-Lin Yang",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cgh.2022.11.009"
    },
    {
        "id": 18087,
        "title": "Early Prediction of Heart Diseases using Naive Bayes Classification Algorithm and Laplace Smoothing Technique",
        "authors": "Subhashini Narayan,  Sathiyamoorthy E.",
        "published": "2023-1-13",
        "citations": 1,
        "abstract": "Nowadays, medical diseases are one of the primary causes of death, and it is one the major concerns of developed countries. So, the disease identification process needs a lot of attention since if the diseases are idenfied at the early stage, the rate of death can be decreased. Machine learning techniques is one of the popular approaches that is used for identifying the diseases at the early stage. In this paper, two machine learning techniques, namely Naive Bayes classification algorithm and Laplace smoothing technique are used to predict the heart disease. Here, many medical details are used, such as gender, age, fasting blood sugar, blood pressure, cholesterol, etc. to predict the hearth disease of a patient. The proposed decision system supports avoiding unnecessary diagnosis test, which can be highly beneficial to start the treatment quickly. Thus, both time and money can be saved. Both the performance analysis and the experimental results show the efficiency of the proposed scheme over the existing schemes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijghpc.316157"
    },
    {
        "id": 18088,
        "title": "210. BIORESORBABLE SYNTHETIC MESHES IN LARGE PARAESOPHAGEAL HERNIAS. TECHNIQUE OF APLICATION AND EARLY RESULTS",
        "authors": "Andre Brandalise, Nilton Cesar Aranha, Claudia Lorenzetti, Nelson Ary Brandalise",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nLarge paraesophageal hernias (LPEH) are still a challenge faced by foregut surgeons. Surgical options are highly debated among specialists; esophageal lengthening procedures, diaphragmatic relaxing incisions, gastropexy and—mesh reinforcement. Severe complications related to synthetic meshes has led many surgeons to avoid this type of reinforcement.\nHowever, newly developed synthetic bioresorbable meshes have been used as an alternative for hiatal reinforcement, lowering the rates of recurrence without the drawbacks of synthetic materials.\n\n\nMethods\nFrom April 2018 to February 2023, 65 patients underwent LPEH repair with hiatal augmentation with an inverted C-shape bioresorbable mesh. All surgeries were performed by two surgeons (AB and NCA). The meshes (Bio-A®—Gore® and Phasix ST®—BARD) were applied over crurorrhaphy, covering the anterior and posterior aspects of the hiatus and secured in place with sutures and cyanoacrylate. The choice of mesh was determined by the surgeon’s preference. Follow up visits were at 1, 6 and 12 months and yearly after that.\n\n\nResults\nThere were 34 patients where Bio-A was used and 31 with Phasix. Median age (55,5 vs 54,8 years) didn’t differ between groups. LPEH were primary (PS) in 39 patients and recurrence from prior interventions (RS) in 26. Median age was higher in PS (58,6 vs 49,6 years). There were no intraoperative complications related to the use of mesh. The patients were discharged after 24–48 hours.\nThe average follow-up period was similar between PS and RS (10,1 vs 9,6 months).\nThere were three recurrences (2 Bio-A, 1 Phasix) in PS (7,6%) and seven (26,9%) in RS (2 Bio-A, 5 Phasix).\nThere weren’t complaints of prolonged dysphagia or need for dilatation.\nNine out of 10 recurrences are small. One large recurrence, required reintervention for acute volvulus after 1 year (RS group with Phasix).\n\n\nConclusion\nbioresorbable meshes are safe to use as a reinforcement of hiatoplasty in LPEH. They can reduce recurrence and reoperation rates in PS at a short term follow-up. Large recurrent hiatal hernias still present as a major challenge and adjuvant techniques should be employed to further reduce recurrences.\n\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/dote/doad052.067"
    },
    {
        "id": 18089,
        "title": "Detection of early stages of canker on apple tree using hyperspectral imaging technique to thwart canker spread",
        "authors": "A. Moran, R. Goyal, K. Ashutosh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1811"
    },
    {
        "id": 18090,
        "title": "Hybrid thulium laser incision in bladder neck contracture: Surgical technique and early outcomes",
        "authors": "C.M. Rosenbaum, C. Netsch, B. Becker, S. Filmar, A.J. Gross, A. Bruchbacher",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0302-2838(23)01463-x"
    },
    {
        "id": 18091,
        "title": "FORCED OSCILLATION TECHNIQUE (FOT) – A NOVEL METHOD FOR THE DETECTION OF EARLY AIRWAY CHANGES",
        "authors": "Plamena Stoimenova, Stoilka Mandadzhieva, Blagoi Marinov",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "According to the World Health Organization in 2019 chronic obstructive pulmonary disease (COPD) was the third leading cause of death worldwide, causing more than 3 million deaths whereas bronchial asthma affected more than 250 million people and caused 455 000 deaths. Both diseases are chronic obstructive conditions which need to be diagnosed early in order to prevent or slow down the complications. Consequently the world requires new effortless methods for diagnosis of airway obstructions, especially for small children and people who cannot perform the spirometry maneuver. The purpose of this report is to describe the objectives of the forced oscillation technique (FOT) and to establish its applications in the clinical practice. Studies and clinical cases regarding pulmonary function testing are summarized and analyzed. They are found in the following databases - PubMed, Google Scholar and Science Direct. Spirometry is the ‘gold standard’ for the diagnosis of airflow obstruction but it requires effort and can be difficult for patients to perform. Forced oscillation technique (FOT) on the other hand is a relatively new method that may hold the key to identifying smoking-related respiratory early alterations and childhood asthma. FOT requires tidal breathing while applying external, small amplitude oscillations in order to determine the response of the respiratory system. Therefore, it is easy for pre-school children to perform. The benefit of FOT should be taken into account for patients who cannot perform spirometry or other pulmonary function ttests. The minimal cooperation of the patient and the easy tidal breathing maneuvers make this method a great option for every pulmonologist. Compared to spirometry this technique may be more sensitive in the detection of disturbances of the peripheral airways and may be effective for the control of therapy at a long term. The Forced oscillation technique has been successfully applied in many pediatric respiratory disorders, such as asthma, cystic fibrosis, and chronic lung disease. Considering these qualities FOT may be used as an alternative of spirometry in heterogenous ventilatory disturbances of the small airways.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35120/medisij030141s"
    },
    {
        "id": 18092,
        "title": "Early Melanoma Detection Based on a Hybrid YOLOv5 and ResNet Technique",
        "authors": "Manar Elshahawy, Ahmed Elnemr, Mihai Oproescu, Adriana-Gabriela Schiopu, Ahmed Elgarayhi, Mohammed M. Elmogy, Mohammed Sallah",
        "published": "2023-8-30",
        "citations": 2,
        "abstract": "Skin cancer, specifically melanoma, is a serious health issue that arises from the melanocytes, the cells that produce melanin, the pigment responsible for skin color. With skin cancer on the rise, the timely identification of skin lesions is crucial for effective treatment. However, the similarity between some skin lesions can result in misclassification, which is a significant problem. It is important to note that benign skin lesions are more prevalent than malignant ones, which can lead to overly cautious algorithms and incorrect results. As a solution, researchers are developing computer-assisted diagnostic tools to detect malignant tumors early. First, a new model based on the combination of “you only look once” (YOLOv5) and “ResNet50” is proposed for melanoma detection with its degree using humans against a machine with 10,000 training images (HAM10000). Second, feature maps integrate gradient change, which allows rapid inference, boosts precision, and reduces the number of hyperparameters in the model, making it smaller. Finally, the current YOLOv5 model is changed to obtain the desired outcomes by adding new classes for dermatoscopic images of typical lesions with pigmented skin. The proposed approach improves melanoma detection with a real-time speed of 0.4 MS of non-maximum suppression (NMS) per image. The performance metrics average is 99.0%, 98.6%, 98.8%, 99.5, 98.3%, and 98.7% for the precision, recall, dice similarity coefficient (DSC), accuracy, mean average precision (MAP) from 0.0 to 0.5, and MAP from 0.5 to 0.95, respectively. Compared to current melanoma detection approaches, the provided approach is more efficient in using deep features.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13172804"
    },
    {
        "id": 18093,
        "title": "Voluntary Stopping of Eating or Drinking: Is it Suicide?",
        "authors": "",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.carage.2023.08.006"
    },
    {
        "id": 18094,
        "title": "Arresting Chest Pains: A Heart-Stopping Journey of VF and Vasospastic Angina",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32873/unmc.dc.gmerj.5.1.065"
    },
    {
        "id": 18095,
        "title": "OPTIMAL STOPPING IN A DYNAMIC SALIENCE MODEL",
        "authors": "Markus Dertwinkel‐Kalt, Jonas Frey",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "AbstractWe study dynamic choice under risk through the lens of salience theory. We derive predictions on salient thinkers' gambling decisions and strategy choices. We test our model experimentally and find support for all of our predictions. We also detect a strong correlation between static and dynamic choices, suggesting that salience theory can coherently explain risky choice in both static and dynamic contexts. Our results help to understand when people sell assets, stop gambling, enter the job market, or retire.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/iere.12681"
    },
    {
        "id": 18096,
        "title": "Secure Migration in NGN: An Optimal Stopping Problem Approach with Partial Observability",
        "authors": "Yahuza Bello, Ahmed Refaey, Abdallah Shami",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437408"
    },
    {
        "id": 18097,
        "title": "Pengaruh Thought Stopping Terhadap Penurunan Tingkat Kecemasan Masyarakat Penerima Vaksinasi Covid-19 di Wilayah Kerja Puskesmas Terminal Banjarmasin",
        "authors": "Tya Ayu Widyasari, Subhannur Rahman, Desilestia Dwi Salmarini",
        "published": "2023-8-27",
        "citations": 0,
        "abstract": "The COVID-19 pandemic has caused various impacts that have been experienced by Indonesian people. The government has provided a breakthrough to reduce the number of Covid-19 in Indonesia, namely the Covid-19 vaccination. The hope of the Covid-19 vaccination is to create herd immunity for the people of Indonesia, but there are still many people who experience anxiety during the process of receiving the Covid-19 vaccination. A preliminary study conducted in the working area of ​​the Banjarmasin Terminal Health Center showed that 5 out of 10 people experienced anxiety. The anxiety experienced by the community can be reduced in various ways, one of which is the provision of thought stopping therapy interventions. This study aims to determine whether there is an effect of thought stopping on reducing the anxiety level of the people who receive the COVID-19 vaccination in the working area of ​​the Banjarmasin Terminal Health Center.This research uses quantitative methods. The population taken is the community receiving the covid-19 vaccination in the working area of ​​the Banjarmasin Terminal Health Center. The number of samples is 30 people with purposive sampling technique. The results of the Paired T-Test statistic test showed that the significance value (2-tailed) was 0.000 <0.05, indicating a difference between anxiety before and after the intervention. There is an effect of thought stopping on reducing the level of anxiety of the people receiving the covid-19 vaccination in the working area of ​​the Banjarmasin Terminal Health Center",
        "keywords": "",
        "link": "http://dx.doi.org/10.33084/jsm.v9i2.5665"
    },
    {
        "id": 18098,
        "title": "Stopping a parasite in its tracks",
        "authors": "Andrea Du Toit",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41579-023-00915-0"
    },
    {
        "id": 18099,
        "title": "Stopping the Revolving Door: MDP-Based Decision Support for Community Corrections Placement",
        "authors": "Xiaoquan Gao, Pengyi Shi, Nan Kong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4672337"
    },
    {
        "id": 18100,
        "title": "Optimal stopping with signatures",
        "authors": "Christian Bayer, Paul P. Hager, Sebastian Riedel, John Schoenmakers",
        "published": "2023-2-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/22-aap1814"
    },
    {
        "id": 18101,
        "title": "What is stopping Agriculture 4.0?---Examples from China",
        "authors": "Yue Wu, Katalin Takács-György",
        "published": "2023-5-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/saci58269.2023.10158595"
    },
    {
        "id": 18102,
        "title": "Spoken Digit Classification through Neural Networks with Combined Regularization",
        "authors": "Lizhi Jiang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icfsp59764.2023.10372943"
    },
    {
        "id": 18103,
        "title": "Exploring the Impact of Regularization to Improve Bankruptcy Prediction for Corporations",
        "authors": "Shaun Almeida",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235083"
    },
    {
        "id": 18104,
        "title": "Full Waveform Inversion by Adaptive Tikhonov-Total Variation Regularization",
        "authors": "K. Aghazade, A. Gholami, H. S.Aghamiry",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310431"
    }
]