[
    {
        "id": 19071,
        "title": "Genetic algorithms",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315219219-4"
    },
    {
        "id": 19072,
        "title": "Methods for controller design using genetic algorithms*",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315219219-6"
    },
    {
        "id": 19073,
        "title": "Genetic Algorithms for Chemical Engineering Optimization Problems",
        "authors": "Thi Anh-Nga Nguyen, Tuan-Anh Nguyen",
        "published": "2022-10-12",
        "citations": 0,
        "abstract": "Chemical engineering processes are frequently composed of multiple complex phenomena. These systems can be represented by a set of several equations, which are referred to as mathematical model of the process. Optimization in chemical engineering utilizes specialized techniques to determine the values of the decision variables at which the performance of the process, measured as the objective function(s), is minimum or maximum. The profitability of the process improves remarkably as a result of this selection. This benefit has encouraged the broad application of optimization for important industrial challenges. However, many problems in chemical engineering processes are hard to find the optimum using gradient-based algorithms. For example, the cases when the objective functions of the processes are multimodal, discontinuous, or implicit. Genetic algorithms (GAs) are a kind of metaheuristic searching optimization methods, which are inspired by nature, the mechanics of natural evolution and genetics. Genetic algorithms have received significant attention due to their remarkable advantages over classical algorithms. Compared with traditional optimization approaches, GAs are straightforward, robust, capable of handling the non-differentiable, discontinuous, or multimodal problems. The purpose of this paper is to give several case studies using genetic algorithms in chemical engineering optimization problems.",
        "link": "http://dx.doi.org/10.5772/intechopen.104884"
    },
    {
        "id": 19074,
        "title": "Introduction to Evolutionary Algorithms",
        "authors": "S. Tamilselvi",
        "published": "2022-10-12",
        "citations": 2,
        "abstract": "Real-world has many optimization scenarios with multiple constraints and objective functions that are discontinuous, nonlinear, non-convex, and multi-modal in nature. Also, the optimization problems are multi-dimensional with mixed types of variables like integer, real, discrete, binary, and having a different range of values which demands normalization. Hence, the search space of the problem cannot be smooth. Evolutionary algorithms have started gaining attention and have been employed for computational processes to solve complex engineering problems. Because it has become an instrument for research scientists and engineers who need to apply the supremacy of the theory of evolution to shape any optimization-based research problems and articles. In this chapter, there is a comprehensive introduction to the optimization field with the state-of-the-art in evolutionary computation. Though many books have described such areas of optimization in any form as evolution strategies, genetic programming, genetic algorithms, and evolutionary programming, evolutionary algorithms, that is, evolutionary computation is remarkable for considering it to discuss in detail as a general class.",
        "link": "http://dx.doi.org/10.5772/intechopen.104198"
    },
    {
        "id": 19075,
        "title": "Adaptation in Genetic Algorithms",
        "authors": "Lalit M. Patnaik, Srinivas Mandavilli",
        "published": "2017-11-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-3"
    },
    {
        "id": 19076,
        "title": "Genetic Algorithms and Recognition Problems",
        "authors": "Hove Hugo Van, Verschoren Alain",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-7"
    },
    {
        "id": 19077,
        "title": "A Lamarckian Evolution Strategy for Genetic Algorithms",
        "authors": "Brian J. Ross",
        "published": "2019-9-17",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128356-1"
    },
    {
        "id": 19078,
        "title": "Genetic Algorithms",
        "authors": "Alexandre Bergel",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5384-7_8"
    },
    {
        "id": 19079,
        "title": "Implementing Fast and Flexible Parallel Genetic Algorithms",
        "authors": "Erick Cantu-Paz",
        "published": "2019-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128356-3"
    },
    {
        "id": 19080,
        "title": "Vehicle Routin1 with Time Windows usin1 Genetic Algorithms",
        "authors": "Sam R. Thangiah",
        "published": "2019-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332-12"
    },
    {
        "id": 19081,
        "title": "Application of Genetic Algorithms in Health Sciences",
        "authors": "Rohollah Fallah Madvari",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "In this section, we introduce genetic algorithm (GA) and some of its applications in various health fields. Although GA and some other meta-heuristics are inspired by biology, they are more familiar to experts in other sciences, and these methods are often used to solve complex problems. The use of GAs has promising implications in various health specialities, including occupational health, environmental health, HSE, occupational medicine, industrial safety, ergonomics, toxicology, health care management, etc. This section of the book presents applications of GAs in disease screening, diagnosis, prognosis and health care management, and enables professionals to envision possible applications of this meta-heuristic method in their health professions. In the following, we discuss some applications of GAs in predicting, measuring and controlling factors that affect health.",
        "link": "http://dx.doi.org/10.5772/intechopen.112653"
    },
    {
        "id": 19082,
        "title": "Genetic Algorithms",
        "authors": "Xin-She Yang",
        "published": "2021",
        "citations": 61,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-821986-7.00013-5"
    },
    {
        "id": 19083,
        "title": "Hybrid Genetic Algorithms",
        "authors": "Leila Gharsalli",
        "published": "2022-11-2",
        "citations": 1,
        "abstract": "Hybrid optimization methods have known significant interest in recent years and are being growingly used to solve complex problems in science and engineering. For instance, the famous evolutionary Genetic Algorithm can integrate other techniques within its framework to produce a hybrid global algorithm that takes advantages of that combination and overcomes the disadvantages. Several forms of integration between Genetic Algorithms and other search and optimization techniques exist. This chapter aims to review that and present the design of a hybrid Genetic Algorithm incorporating another local optimization technique while recalling the main local search methods and emphasizing the different approaches for employing their information. A test case from the aerospace field is presented where a hybrid genetic algorithm is proposed for the mechanical sizing of a composite structure located in the upper part of a launcher.",
        "link": "http://dx.doi.org/10.5772/intechopen.104735"
    },
    {
        "id": 19084,
        "title": "Genetic algorithms",
        "authors": "",
        "published": "2018-10-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781482268713-15"
    },
    {
        "id": 19085,
        "title": "Genetic Algorithms in Action",
        "authors": "Alexandre Bergel",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5384-7_9"
    },
    {
        "id": 19086,
        "title": "Fitness Evaluation in Genetic Algorithms with Ancestors’ Influence",
        "authors": "Susmita De, Ashish Ghosh, Sankar K. Pal",
        "published": "2017-11-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-1"
    },
    {
        "id": 19087,
        "title": "Genetic Algorithms",
        "authors": "Jennifer Arthur",
        "published": "2017-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1375151"
    },
    {
        "id": 19088,
        "title": "Application of Genetic Algorithm in Numerous Scientific Fields",
        "authors": "Gautam Garai",
        "published": "2022-10-12",
        "citations": 1,
        "abstract": "The genetic algorithm (GA) and its variants have been used in a wide variety of fields by the scientists efficiently for solving problems. From the pool of evolutionary algorithms, the GA is chosen by the researchers and has been popular as a useful and effective optimizer. It has several advantages and disadvantages. However, it provides solutions for various kinds of problems such as space research, economics, market study, geography, remote sensing, agriculture, data mining, cancer detection, and many more. This chapter discusses the utilization of the GA in some of these fields with a few experimental results such as data clustering, pattern identification and matching, and shape detection. The results are illustrated and explained with reasons for better understanding of the GA application in the scientific fields. Other than these, the GA in bioinformatics for biological sequence alignment is discussed with examples.",
        "link": "http://dx.doi.org/10.5772/intechopen.105740"
    },
    {
        "id": 19089,
        "title": "Exposing Genetic Algorithms: A Tool for Designers to Curate Bespoke Genetic Algorithms for Generative Design Methodologies",
        "authors": "Tony Le",
        "published": "2022-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47330/dcio.2021.jgrn4011"
    },
    {
        "id": 19090,
        "title": "A Genetic-Algorithms-Based Technique for Detecting Distributed Predicates",
        "authors": "Eslam Al Maghayreh",
        "published": "2021",
        "citations": 0,
        "abstract": "One of the techniques that have been used in the literature to enhance the dependability of distributed applications is the detection of distributed predicates techniques (also referred to as runtime verification). These techniques are used to verify that a given run of a distributed application satisfies certain properties (specified as predicates). Due to the existence of multiple processes running concurrently, the detection of a distributed predicate can incur significant overhead. Several researchers have worked on the development of techniques to reduce the cost of detecting distributed predicates. However, most of the techniques presented in the literature work efficiently for specific classes of predicates, like conjunctive predicates. This chapter presents a technique based on genetic algorithms to efficiently detect distributed predicates under the possibly modality. Several experiments have been conducted to demonstrate the effectiveness of the proposed technique. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch025"
    },
    {
        "id": 19091,
        "title": "Optimization Using Genetic Algorithms – Methodology with Examples from Seismic Waveform Inversion",
        "authors": "Subhashis Mallick",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "Genetic algorithms use the survival of the fittest analogy from evolution theory to make random walks in the multiparameter model-space and find the model or the suite of models that best-fit the observation. Due to nonlinear nature, runtimes of genetic algorithms exponentially increase with increasing model-space size. A diversity-preserved genetic algorithm where each member of the population is given a measure of diversity and the models are selected in preference to both their objective and diversity values, and scaling the objectives using a suitably chosen scaling function can expedite computation and reduce runtimes. Starting from an initial model and the model-space defined as search intervals around it and using a new sampling strategy of generating smoothly varying initial set of random models within the specified search intervals; the proposed diversity-preserved method converges rapidly and estimates reliable models. The methodology and implementation of this new genetic algorithm optimization is described using examples from the prestack seismic waveform inversion problems. In geophysics, this new method can be useful for subsurface characterization where well-control is sparse.",
        "link": "http://dx.doi.org/10.5772/intechopen.113897"
    },
    {
        "id": 19092,
        "title": "Genetic Algorithms",
        "authors": "Leonardo Azevedo Scardua",
        "published": "2021-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429298028-8"
    },
    {
        "id": 19093,
        "title": "Genetic Programming Hyper-heuristic for the Automated Synthesis of Selection Operators in Genetic Algorithms",
        "authors": "Evgenii Sopov",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006497002310238"
    },
    {
        "id": 19094,
        "title": "An Empirical Evaluation of Genetic Algorithms on Noisy Objective Functions",
        "authors": "Keith Mathias, Darrell Whitley, Anthony Kusuma, Christof Stork",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-4"
    },
    {
        "id": 19095,
        "title": "Optimal Designs by Means of Genetic Algorithms",
        "authors": "Lata Nautiyal, Preeti Shivach, Mangey Ram",
        "published": "2021",
        "citations": 1,
        "abstract": "With the advancement in contemporary computational and modeling skills, engineering design completely depends upon on variety of computer modeling and simulation tools to hasten the design cycles and decrease the overall budget. The most difficult design problem will include various design parameters along with the tables. Finding out the design space and ultimate solutions to those problems are still biggest challenges for the area of complex systems. This chapter is all about suggesting the use of Genetic Algorithms to enhance maximum engineering design problems. The chapter recommended that Genetic Algorithms are highly useful to increase the High-Performance Areas for Engineering Design. This chapter is established to use Genetic Algorithms to large number of design areas and delivered a comprehensive conversation on the use, scope and its applications in mechanical engineering. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch018"
    },
    {
        "id": 19096,
        "title": "Principles of Genetic Algorithms",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "This chapter aims to review the fundamentals of genetic algorithms. Consequently, the chapter correspondingly lectures on the dissimilarities between the alteration genetic and evolutionary algorithms. The decision mathematical rules based on the Pareto algorithm are similarly deliberated. The Pareto optimization rule can have a significant role in the examination of the precise position of MH370 vanishing. In this circumstance, the majority of multi-objective optimization algorithms exercise this principle to acquire the non-dominated set of solutions, as a result of the Pareto-front to investigate how MH370 ended up in the Indian Ocean. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-1920-2.ch004"
    },
    {
        "id": 19097,
        "title": "Binary Genetic Algorithms",
        "authors": "Krishn Kumar Mishra",
        "published": "2022-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003313649-2"
    },
    {
        "id": 19098,
        "title": "Genetic Algorithms (GAs) and Stock Trading Systems",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "Recent advances and improvements in hardware and software technology have benefitted research in the field of finance. It has made research even more interesting. A large amount of data can be processed with lightning speed. Investors are now eagerly looking for small models and algorithms of a lucrative value and with better accuracy. Earlier, the decision to enter the market or to exit is taken emotionally with fear then by any rational thinking. Due to this, a lot of bad decisions were taken, and a huge amount of capital was lost. With the help of this computational system, a computer program will decide when to enter and when to exit the market without any human intervention. The decision here will be taken by testing a large amount of permutation and combination of various parameters associated with the system. This chapter briefly explains the scope and agenda of various algorithms for computation research in finance. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch009"
    },
    {
        "id": 19099,
        "title": "Some Other Applications of Genetic Algorithms (GAs)",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "As we had already seen that genetic algorithms (GAs) are smart in their working. Here, the authors explore the rich working of genetic algorithms (GAs) in various diversified fields. Until now, they had discussed the historical nature of genetic algorithms (GAs). They have also discussed the programming code to run simple genetic algorithms (SGA). Lastly, they are going to take an overview of the application of genetic algorithms (GAs) in various fields (i.e., from business to non-business). Already, they have discussed the robust working of genetic algorithms (GAs) in various adverse conditions. Here, they discuss the application of genetic algorithms (GAs) in various other diversified fields. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch013"
    },
    {
        "id": 19100,
        "title": "Genetic Algorithms: Brief review on Genetic Algorithms for Global Optimization Problems",
        "authors": "Aliza Anwaar, Adnan Ashraf, Waqas Haider Khan Bangyal, Muddesar Iqbal",
        "published": "2022-12-17",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/hccs55241.2022.10090327"
    },
    {
        "id": 19101,
        "title": "Using Genetic Algorithms to Develop Investment Strategies",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "Genetic algorithms (GAs) are a powerful search technique. The use of genetic algorithms (GAs) will help in the development of better trading systems. The genetic algorithms (GAs) help the researcher to explore various combinations of trading rules or their parameters, which the human mind is unable to find. This chapter explains genetic algorithms (GAs) in brief and gives insight on how they find better trading strategies. Some of the manual trading strategies are good in nature. Genetic algorithms (GAs) only addition to them. Interfacing genetic algorithms (GAs) with stock trading systems or developing a combined model requires a large degree of imagination and creativity. It is an art not a scientific invention. Genetic algorithms (GAs) make use of computers to find various interesting trading systems. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch011"
    },
    {
        "id": 19102,
        "title": "Construction of Fuzzy Classification Systems with Linguistic If-Then Rules Using Genetic Algorithms",
        "authors": "Hisao Ishibuchi, Tadahiko Murata, Hideo Tanaka",
        "published": "2017-11-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-11"
    },
    {
        "id": 19103,
        "title": "Genetic Algorithms (GAs) and Their Mathematical Foundations",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "In this chapter, the authors back GA procedures using old mathematical facts. More rigorous working of mathematical facts about GAs are raised in this chapter. In fact, there are a large number of similarities in the population of strings. The authors see how GA exploits these similarities to generate good solutions. So, in this whole procedure they show which schema or pattern will grow and which pattern will die or be lost as generation passes by due to the effect of selection, crossover, and mutation operator. The study of this building block hypothesis, leads to better understanding of GA. It will also help us to reach optimal solutions in much less time. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch004"
    },
    {
        "id": 19104,
        "title": "GASP: Genetic Algorithms for Service Placement in Fog Computing Systems",
        "authors": "Claudia Canali, Riccardo Lancellotti",
        "published": "2019-9-21",
        "citations": 46,
        "abstract": "Fog computing is becoming popular as a solution to support applications based on geographically distributed sensors that produce huge volumes of data to be processed and filtered with response time constraints. In this scenario, typical of a smart city environment, the traditional cloud paradigm with few powerful data centers located far away from the sources of data becomes inadequate. The fog computing paradigm, which provides a distributed infrastructure of nodes placed close to the data sources, represents a better solution to perform filtering, aggregation, and preprocessing of incoming data streams reducing the experienced latency and increasing the overall scalability. However, many issues still exist regarding the efficient management of a fog computing architecture, such as the distribution of data streams coming from sensors over the fog nodes to minimize the experienced latency. The contribution of this paper is two-fold. First, we present an optimization model for the problem of mapping data streams over fog nodes, considering not only the current load of the fog nodes, but also the communication latency between sensors and fog nodes. Second, to address the complexity of the problem, we present a scalable heuristic based on genetic algorithms. We carried out a set of experiments based on a realistic smart city scenario: the results show how the performance of the proposed heuristic is comparable with the one achieved through the solution of the optimization problem. Then, we carried out a comparison among different genetic evolution strategies and operators that identify the uniform crossover as the best option. Finally, we perform a wide sensitivity analysis to show the stability of the heuristic performance with respect to its main parameters.",
        "link": "http://dx.doi.org/10.3390/a12100201"
    },
    {
        "id": 19105,
        "title": "Introduction to Genetic Algorithms in Search and Optimization",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "This chapter is all about introducing genetic algorithms in the search process, which are based on the theory of natural selection, genetics, and survival of fittest. By detailed understanding of the algorithm, one would be able to apply it in your respective field for optimization. At the end of this chapter, the reader will have acquired basic theory and working of these algorithms. Since genetic algorithms are used in diverse fields, the tone and language of this chapter is kept simple and casual for better understanding. Genetic algorithms in this chapter are applied through a hand calculation example. Genetic algorithms are basically mathematical calculations based on Darwin's theory of survival of fittest. This chapter gives a detailed understanding of the theory and working of genetic algorithms based on hand calculation examples. Comparison of genetic algorithms with other search procedures is also done. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch003"
    },
    {
        "id": 19106,
        "title": "Application of Genetic Algorithms in Telecommunication System Design",
        "authors": "V. Sinkovic, I. Lovrek, B. Mikac",
        "published": "2020-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367811464-12"
    },
    {
        "id": 19107,
        "title": "Introduction to Neural Networks, Fuzzy Systems, Genetic Algorithms, and their Fusion",
        "authors": "N.M. Martin, L.C. Jain",
        "published": "2020-1-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367811464-1"
    },
    {
        "id": 19108,
        "title": "Autonomous robot navigation through fuzzy-genetic programming",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315219219-11"
    },
    {
        "id": 19109,
        "title": "A Hybrid Approach for Shape Retrieval Using Genetic Algorithms and Approximate Distance",
        "authors": "Saliha Mezzoudj, Kamal Eddine Melkemi",
        "published": "2021",
        "citations": 0,
        "abstract": "This article describes how the classical algorithm of shape context (SC) is still unable to capture the part structure of some complex shapes. To overcome this insufficiency, the authors propose a novel shape-based retrieval approach that is called HybMAS-GA using a multi-agent system (MAS) and a genetic algorithm (GA). They define a new distance called approximate distance (AD) to define a SC method by AD, which called approximate distance shape context (ADSC) descriptor. Furthermore, the authors' proposed HybMAS-GA is a star architecture where all shape context agents, N, are directly linked to a coordinator agent. Each retrieval agent must perform either a SC or an ADSC method to obtain a similar shape, started from its own initial configuration of sample points. This combination increases the efficiency of the proposed HybMAS-GA algorithm and ensures its convergence to an optimal images retrieval as it is shown through experimental results. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch011"
    },
    {
        "id": 19110,
        "title": "Best Feature Selection for Horizontally Distributed Private Biomedical Data Based on Genetic Algorithms",
        "authors": "Boudheb Tarik, Elberrichi Zakaria",
        "published": "2021",
        "citations": 0,
        "abstract": "Due to the growing success of machine learning in the healthcare domain, medical institutions are striving to share their patients' data in the intention to build more accurate models which will be used to make better decisions. However, due to the privacy of the data, they are reluctant. To build the best models, they have to make the best feature selection for horizontally distributed private biomedical data. The previous proposed solutions are based on data perturbation techniques with the loss of performance. In this article, the researchers propose an original solution without perturbation. This is so the data utility is preserved and therefore the performance. The proposed solution uses a genetic algorithm, a distributed Naïve Bayes classifier, and a trusted third-party. The results obtained by the proposed approach surpass those obtained by other researchers, for the same problem. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch029"
    },
    {
        "id": 19111,
        "title": "Operator Control Parameters and Fine Tuning of Genetic Algorithms (GAs)",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "Genetic algorithms (GAs) are heuristic, blind (i.e., black box-based) search techniques. The internal working of GAs is complex and is opaque for the general practitioner. GAs are a set of interconnected procedures that consist of complex interconnected activity among parameters. When a naive GA practitioner tries to implement GA code, the first question that comes into the mind is what are the value of GA control parameters (i.e., various operators such as crossover probability, mutation probability, population size, number of generations, etc. will be set to run a GA code)? This chapter clears all the complexities about the internal interconnected working of GA control parameters. GA can have many variations in its implementation (i.e., mutation alone-based GA, crossover alone-based GA, GA with combination of mutation and crossover, etc.). In this chapter, the authors discuss how variation in GA control parameter settings affects the solution quality. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4105-0.ch007"
    },
    {
        "id": 19112,
        "title": "Parallel Cooperating Genetic Algorithms: An Application to Robot Motion Planning",
        "authors": "",
        "published": "2019-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332-5"
    },
    {
        "id": 19113,
        "title": "Algorithms to Improve the Convergence of a Genetic Algorithm with a Finite State Machine Genome",
        "authors": "Natalie Hammerman, Robert Goldberg",
        "published": "2019-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128356-6"
    },
    {
        "id": 19114,
        "title": "Comparing Small Population Genetic Algorithms over Changing Landscapes",
        "authors": "Michael Curley, Seamus Hill",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006497802390246"
    },
    {
        "id": 19115,
        "title": "T-Spanner Problem",
        "authors": "Riham Moharam, Ehab Morsy, Ismail A. Ismail",
        "published": "2021",
        "citations": 0,
        "abstract": "The t-spanner problem is a popular combinatorial optimization problem and has different applications in communication networks and distributed systems. This chapter considers the problem of constructing a t-spanner subgraph H in a given undirected edge-weighted graph G in the sense that the distance between every pair of vertices in H is at most t times the shortest distance between the two vertices in G. The value of t, called the stretch factor, quantifies the quality of the distance approximation of the corresponding t-spanner subgraph. This chapter studies two variations of the problem, the Minimum t-Spanner Subgraph (MtSS) and the Minimum Maximum Stretch Spanning Tree(MMST). Given a value for the stretch factor t, the MtSS problem asks to find the t-spanner subgraph of the minimum total weight in G. The MMST problem looks for a tree T in G that minimizes the maximum distance between all pairs of vertices in V (i.e., minimizing the stretch factor of the constructed tree). It is easy to conclude from the literatures that the above problems are NP-hard. This chapter presents genetic algorithms that returns a high quality solution for those two problems. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch019"
    },
    {
        "id": 19116,
        "title": "Automated Feature Engineering for AutoML Using Genetic Algorithms",
        "authors": "Kevin Shi, Sherif Saad",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012090400003555"
    },
    {
        "id": 19117,
        "title": "Evolutionary Algorithms and Dialogue",
        "authors": "",
        "published": "2019-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332-13"
    },
    {
        "id": 19118,
        "title": "Selection Methods for Evolutionary Algorithms",
        "authors": "",
        "published": "2019-9-17",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332-4"
    },
    {
        "id": 19119,
        "title": "Cryptographic Key Generation by Genetic Algorithms",
        "authors": "Michal Turčaník, Martin Javurek",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11610/isij.4305"
    },
    {
        "id": 19120,
        "title": "Tracking Patterns with Particle Swarm Optimization and Genetic Algorithms",
        "authors": "Yuri Marchetti Tavares, Nadia Nedjah, Luiza de Macedo Mourelle",
        "published": "2021",
        "citations": 0,
        "abstract": "The template matching is an important technique used in pattern recognition. The goal is to find a given pattern, of a prescribed model, in a frame sequence. In order to evaluate the similarity of two images, the Pearson's Correlation Coefficient (PCC) is used. This coefficient is calculated for each of the image pixels, which entails an operation that is computationally very expensive. In order to improve the processing time, this paper proposes two implementations for template matching: one using Genetic Algorithms (GA) and the other using Particle Swarm Optimization (PSO) considering two different topologies. The results obtained by the proposed methodologies are compared to those obtained by the exhaustive search in each pixel. The comparison indicates that PSO is up to 236x faster than the brute force exhausted search while GA is only 44x faster, for the same image. Also, PSO based methodology is 5x faster than the one based on GA. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch027"
    },
    {
        "id": 19121,
        "title": "Recipe reconstruction with genetic algorithms",
        "authors": "R.J. Vlek, D.J.M. Willems",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18174/540621"
    },
    {
        "id": 19122,
        "title": "A Novel Approach for Business Process Model Matching Using Genetic Algorithms",
        "authors": "Mostefai Abdelkader, Ignacio García Rodríguez de Guzmán",
        "published": "2021",
        "citations": 0,
        "abstract": "This paper formulates the process model matching problem as an optimization problem and presents a heuristic approach based on genetic algorithms for computing a good enough alignment. An alignment is a set of not overlapping correspondences (i.e., pairs) between two process models(i.e., BP) and each correspondence is a pair of two sets of activities that represent the same behavior. The first set belongs to a source BP and the second set to a target BP. The proposed approach computes the solution by searching, over all possible alignments, the one that maximizes the intra-pairs cohesion while minimizing inter-pairs coupling. Cohesion of pairs and coupling between them is assessed using a proposed heuristic that combines syntactic and semantic similarity metrics. The proposed approach was evaluated on three well-known datasets. The results of the experiment showed that the approach has the potential to match business process models effectively. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch052"
    },
    {
        "id": 19123,
        "title": "Optical Satellite Multiobjective Genetic Algorithms for Investigation of MH370 Debris",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "At present, there is no precise method that can inform where the lost flight MH370 is. This chapter proposes a new approach to search for the missing flight MH370. To this end, multiobjective genetic algorithms are implemented. In this regard, a genetic algorithm is taken into consideration to optimize the MH370 debris that is notably based on the geometrical shapes and spectral signatures. Currently, there may be three limitations to optical remote sensing technique: (1) strength constraints of the spacecraft permit about two hours of scanning consistently within the day, (2) cloud cover prevents unique observations, and (3) moderate information from close to the ocean surface is sensed through the scanner. Needless to say that the objects that are spotted by different satellite data do not scientifically belong to the MH370 debris and could be just man-made without accurate identifications. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-1920-2.ch009"
    },
    {
        "id": 19124,
        "title": "Genetic Search Algorithms",
        "authors": "Andre A. Keller",
        "published": "2019-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2174/9781681087054119010006"
    },
    {
        "id": 19125,
        "title": "GENETIC ALGORITHMS",
        "authors": "",
        "published": "2019-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119516057.ch13"
    },
    {
        "id": 19126,
        "title": "Genetic Programming of Logic-Based Neural Networks",
        "authors": "Vincent Charles Gaudet",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-10"
    },
    {
        "id": 19127,
        "title": "Genetic Algorithms for Rapid Molecular Materials Screening",
        "authors": "Geoffrey Hutchison",
        "published": "2018-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/2246918"
    },
    {
        "id": 19128,
        "title": "Mechatronic system parameter identification via genetic algorithms",
        "authors": "Mathew I. Adamson",
        "published": "No Date",
        "citations": 0,
        "abstract": "This thesis develops a novel way to identify both the joint friction parameters and a built in torque sensor gain and offset. The identification method is based on a genetic algorithm (GA). A model based friction compensation method and a real coded GA are selected from a variety of methods available. A model of a single degree of freedom mechatronic joint with a link is presented. Numerical simulations are run to determine the optimum configuration of the GA with respect to the population size and maximum number of generations necessary to identify the parameters to within 5% of their actual value.  The GA identification technique is then used on an experimental mechatronic joint with a harmonic drive and built-in torque sensor. The friction parameters as well as the sensor gain and offset are identified in the experimental system and the position tracking error is reduced. Based on the experimental results, the method is found to be an effective way of identifying system parameters in a mechatronic joint.",
        "link": "http://dx.doi.org/10.32920/ryerson.14660874.v1"
    },
    {
        "id": 19129,
        "title": "Privacy Preserving Feature Selection for Vertically Distributed Medical Data Based on Genetic Algorithms and Naïve Bayes",
        "authors": "Boudheb Tarik, Elberrichi Zakaria",
        "published": "2021",
        "citations": 0,
        "abstract": "Machine learning is a powerful tool to mine useful knowledge from vast databases. Many establishments in the medical area such as hospitals, laboratories want to join their efforts with the ambition to extract models that are more accurate. However, this approach faces problems. Due to the laws protecting patient privacy or other similar concerns, parties are reluctant to share their data. In vast amounts of data, which are useful and pertinent in constructing accurate data mining models? In this article, the researchers deal with these challenges for vertically distributed medical data. They propose an original secure wrapper solution to perform feature selection based on genetic algorithms and distributed Naïve Bayes. Contrary to the previous solutions, the original data is not perturbed. Therefore, the data utility and performance are preserved. They prove that the proposed solution selects relevant attributes to increase performance, preserving patient privacy. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch064"
    },
    {
        "id": 19130,
        "title": "Practical Handbook of Genetic Algorithms",
        "authors": "",
        "published": "2019-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332"
    },
    {
        "id": 19131,
        "title": "Genetic Algorithms",
        "authors": "Paul Roberts",
        "published": "2022-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003305835-9"
    },
    {
        "id": 19132,
        "title": "Genetic Programming",
        "authors": "A Vasuki",
        "published": "2020-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429289071-5"
    },
    {
        "id": 19133,
        "title": "Research on an Improved Coordinating Method Based on Genetic Algorithms and Particle Swarm Optimization",
        "authors": "Rongrong Li, Linrun Qiu, Dongbo Zhang",
        "published": "2021",
        "citations": 0,
        "abstract": "In this article, a hierarchical cooperative algorithm based on the genetic algorithm and the particle swarm optimization is proposed that the paper should utilize the global searching ability of genetic algorithm and the fast convergence speed of particle swarm optimization. The proposed algorithm starts from Individual organizational structure of subgroups and takes full advantage of the merits of the particle swarm optimization algorithm and the genetic algorithm (HCGA-PSO). The algorithm uses a layered structure with two layers. The bottom layer is composed of a series of genetic algorithm by subgroup that contributes to the global searching ability of the algorithm. The upper layer is an elite group consisting of the best individuals of each subgroup and the particle swarm algorithm is used to perform precise local search. The experimental results demonstrate that the HCGA-PSO algorithm has better convergence and stronger continuous search capability, which makes it suitable for solving complex optimization problems. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8048-6.ch010"
    },
    {
        "id": 19134,
        "title": "Genetic Algorithm",
        "authors": "A Vasuki",
        "published": "2020-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429289071-4"
    },
    {
        "id": 19135,
        "title": "Mechatronic system parameter identification via genetic algorithms",
        "authors": "Mathew I. Adamson",
        "published": "No Date",
        "citations": 0,
        "abstract": "This thesis develops a novel way to identify both the joint friction parameters and a built in torque sensor gain and offset. The identification method is based on a genetic algorithm (GA). A model based friction compensation method and a real coded GA are selected from a variety of methods available. A model of a single degree of freedom mechatronic joint with a link is presented. Numerical simulations are run to determine the optimum configuration of the GA with respect to the population size and maximum number of generations necessary to identify the parameters to within 5% of their actual value.  The GA identification technique is then used on an experimental mechatronic joint with a harmonic drive and built-in torque sensor. The friction parameters as well as the sensor gain and offset are identified in the experimental system and the position tracking error is reduced. Based on the experimental results, the method is found to be an effective way of identifying system parameters in a mechatronic joint.",
        "link": "http://dx.doi.org/10.32920/ryerson.14660874"
    },
    {
        "id": 19136,
        "title": "Hidden Genes Genetic Algorithms",
        "authors": "Ossama Abdelkhalik",
        "published": "2021-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351119108-9"
    },
    {
        "id": 19137,
        "title": "Structured Chromosome Genetic Algorithms",
        "authors": "Ossama Abdelkhalik",
        "published": "2021-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351119108-10"
    },
    {
        "id": 19138,
        "title": "Investigating Shared Genetic Bases between Psychiatric Disorders, Cardiometabolic and Sleep Traits Using K-Means Clustering and Local Genetic Correlation Analysis",
        "authors": "Gianpaolo Zammarchi, Claudio Conversano, Claudia Pisanu",
        "published": "2022-11-3",
        "citations": 0,
        "abstract": "Psychiatric disorders are among the top leading causes of the global health-related burden. Comorbidity with cardiometabolic and sleep disorders contribute substantially to this burden. While both genetic and environmental factors have been suggested to underlie these comorbidities, the specific molecular underpinnings are not well understood. In this study, we leveraged large datasets from genome-wide association studies (GWAS) on psychiatric disorders, cardiometabolic and sleep-related traits. We computed genetic correlations between pairs of traits using cross-trait linkage disequilibrium (LD) score regression and identified clusters of genetically correlated traits using k-means clustering. We further investigated the identified associations using two-sample mendelian randomization (MR) and tested the local genetic correlation at the identified loci. In the 7-cluster optimal solution, we identified a cluster including insomnia and the psychiatric disorders major depressive disorder (MDD), post-traumatic stress disorder (PTSD), and attention-deficit/hyperactivity disorder (ADHD). MR analysis supported the existence of a bidirectional association between MDD and insomnia and the genetic variants driving this association were found to affect gene expression in different brain regions. Some of the identified loci were further supported by results of local genetic correlation analysis, with body mass index (BMI) and C-reactive protein (CRP) levels suggested to explain part of the observed effects. We discuss how the investigation of the genetic relationships between psychiatric disorders and comorbid conditions might help us to improve our understanding of their pathogenesis and develop improved treatment strategies.",
        "link": "http://dx.doi.org/10.3390/a15110409"
    },
    {
        "id": 19139,
        "title": "Highway Alignment Optimization with Genetic Algorithms",
        "authors": "",
        "published": "2020-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789813272811_others01"
    },
    {
        "id": 19140,
        "title": "Audio Circuits Evolution through Genetic Algorithms",
        "authors": "P. Coelho, J. M. do Amaral, E. N. Da Rocha, M. Bentes",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011062500003179"
    },
    {
        "id": 19141,
        "title": "Pyramid-Z: Evolving Hierarchical Specialists in Genetic Algorithms",
        "authors": "Atif Rafiq, Enrique Naredo, Meghana Kshirsagar, Conor Ryan",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010657400003063"
    },
    {
        "id": 19142,
        "title": "Genetic Design of Fuzzy Controllers",
        "authors": "Cooper Mark G., Vidal Jacques J.",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203713402-13"
    },
    {
        "id": 19143,
        "title": "Design Optimization of Steering Mechanisms for Articulated Off-Road Vehicles Based on Genetic Algorithms",
        "authors": "Chen Zhou, Xinhui Liu, Feixiang Xu",
        "published": "2018-2-13",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/a11020022"
    },
    {
        "id": 19144,
        "title": "Evolutionary Strategies/Genetic Algorithms",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-0716-1006-0_300212"
    },
    {
        "id": 19145,
        "title": "Genetic Algorithm",
        "authors": "Altaf Q. H. Badar",
        "published": "2021-8-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003206477-3"
    },
    {
        "id": 19146,
        "title": "Genetic Algorithms in Chemistry",
        "authors": "Riccardo Leardi",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-409547-2.14867-x"
    },
    {
        "id": 19147,
        "title": "Scheduling Courses using Genetic Algorithms",
        "authors": "Andysah Putera Utama Siahaan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Preparation of courses at every university is done by hand. This method has limitations that often cause collisions schedule. In lectures and lab scheduling frequent collision against the faculty member teaching schedule, collisions on the class schedule and student, college collision course with lab time, the allocation of the use of the rooms were not optimal. Heuristic method of genetic algorithm based on the mechanism of natural selection; it is a process of biological evolution. Genetic algorithms are used to obtain optimal schedule that consists of the initialization process of the population, fitness evaluation, selection, crossover, and mutation. Data used include the teaching of data, the data subjects, the room data and time data retrieved from the database of the Faculty of Computer Science, Universitas Pembangunan Panca Budi. The data in advance through the stages of the process of genetic algorithms to get optimal results The results of this study in the form of a schedule of courses has been optimized so that no error occurred and gaps.",
        "link": "http://dx.doi.org/10.31227/osf.io/zvung"
    },
    {
        "id": 19148,
        "title": "Multi-objective Genetic Algorithms",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-0716-1006-0_300392"
    },
    {
        "id": 19149,
        "title": "A Hybrid Approach Using Neural Networks. Simulation. Genetic Algorithms, and Machine Learning for Real-Time Sequencing and Scheduling Problems",
        "authors": "Luis Rabelo, Albert Jones, Yuehwern Yih",
        "published": "2019-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128332-10"
    },
    {
        "id": 19150,
        "title": "Next generation genetic algorithms",
        "authors": "Darrell Whitley",
        "published": "2017-7-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3067695.3067703"
    },
    {
        "id": 19151,
        "title": "Genetic Algorithm Model Fitting",
        "authors": "Matthew Lybanon, Kenneth C. Messa",
        "published": "2019-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128356-8"
    },
    {
        "id": 19152,
        "title": "Genetic Algorithms",
        "authors": "Oliver Kramer",
        "published": "2017",
        "citations": 90,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-52156-5_2"
    },
    {
        "id": 19153,
        "title": "Dynamic-Size Multiple Population Genetic Algorithms",
        "authors": "Ossama Abdelkhalik",
        "published": "2021-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351119108-11"
    },
    {
        "id": 19154,
        "title": "Genetic algorithms: theory, genetic operators, solutions, and applications",
        "authors": "Bushra Alhijawi, Arafat Awajan",
        "published": "2023-2-3",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12065-023-00822-6"
    },
    {
        "id": 19155,
        "title": "Graybox optimization and next generation genetic algorithms",
        "authors": "Darrell Whitley",
        "published": "2022-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3520304.3533639"
    },
    {
        "id": 19156,
        "title": "Using Genetic Algorithm to Optimize Controllers of Thermal Load System in Thermal Power Plant",
        "authors": "PhamThi Ly, Bui Quoc Khanh",
        "published": "2022-10-12",
        "citations": 1,
        "abstract": "This chapter presents the sequence of implementing the genetic algorithms using the programming language in the Mfile application of MATLAB Simulink software to optimize the two controller parameters of the coordinated control system structure of the thermal load system in coal-fired thermal power plants: electric power controller and steam pressure controller. Optimal standards are determined to be fast-tracking and fuel-saving. Operational data at a thermal power plant in Vietnam have been used to simulate the operation of a thermal load control system with a coordinated control structure in a thermal power plant to test controller parameters found from the genetic solution. To clarify the superiority of the genetic algorithm method in control of the thermal load system of a thermal power plant, the authors give an evaluation of the original control system compared to the control system using the parameters found from the genetic algorithm method. The results show that the thermal load control system in the thermal power plant using controller parameters found from the genetic algorithm method is much more optimal in terms of fuel consumption and the ability to follow the set amount.",
        "link": "http://dx.doi.org/10.5772/intechopen.103915"
    },
    {
        "id": 19157,
        "title": "Practical Handbook of Genetic Algorithms",
        "authors": "",
        "published": "2019-9-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429128356"
    },
    {
        "id": 19158,
        "title": "Analysis of Genetic Algorithms in Natural Language Processing",
        "authors": "Ekagrata Bahadur",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nNatural language processing (NLP) has  increased the interest in genetic algorithm (GA) due to  their skills in solving complex optimization problems  with extensive research on the use of genetic algorithms  in NLP projects has been presented in this paper. First,  we present the basic concepts behind genetic algorithms  and their relevance to natural language processing.  Then, we explore various applications of natural  language processing (NLP) that use genetic algorithms,  including text classification, sentiment analysis, machine  translation, summarization, and question-answering  systems. We examine the advantages and disadvantages  of genetic algorithm applications in natural language  processing by comparing their performance with  traditional and modern approaches and discuss the  factors influencing their effectiveness. Furthermore, we  explore recent advancements, modifications, and  hybridizations of Genetic Algorithms tailored to NLP  tasks. Finally, we discuss the challenges and future  directions in leveraging Genetic Algorithms for  enhancing NLP technologies.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3969717/v1"
    },
    {
        "id": 19159,
        "title": "Genetic Algorithms",
        "authors": "Colin R. Reeves",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-8265-9_562"
    },
    {
        "id": 19160,
        "title": "Minimum variance tuning of PI controllers using hybrid genetic algorithms",
        "authors": "Joseph Hanna",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>One of the main confronts in control engineering is the assessment of close loop performance. Harris ascertains a performance index where the best performance is assumed to be attained by a minimum variance controller.</p>\n<p>This research spotlights on the tuning of the illustrious and most frequently used PI controller to achieve minimum variance conditions. The optimization problem is embrarked upon two different approached. The first approach uses enumerative search optimization for its simplicity. The second approach applies an exploited hybrid genetic algorithm that is developed to generate vigorous and premium results. The algorithm amalgamates the genetic operations of selection, crossover, and mutation with Newton's search inside successively expanding and contracting parameter domains using alternating logarithmic and linear mappings. Finally, the obtained PI parameters and tested and simulated with data from three control loops at Falconbridge Smelter in Sudbury and compared with the existing tuning parameters. The new parameters yield optimal results.</p>",
        "link": "http://dx.doi.org/10.32920/ryerson.14664141"
    },
    {
        "id": 19161,
        "title": "Nonparametric Methods and Evolutionary Algorithms in Genetic Epidemiology",
        "authors": "Colleen Molloy Farrelly",
        "published": "No Date",
        "citations": 0,
        "abstract": "Paper overviews variable selection problem in high dimensionality, particularly focused on genetic psychiatry and genetic epidemiology in general. Genetic and quantum evolutionary algorithms, tree-based classification/regression models, random forest, and other approaches are detailed. Paper concludes with a roadmap for new algorithm and two-stage selection methodology.",
        "link": "http://dx.doi.org/10.31234/osf.io/s85ad"
    },
    {
        "id": 19162,
        "title": "Minimum variance tuning of PI controllers using hybrid genetic algorithms",
        "authors": "Joseph Hanna",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>One of the main confronts in control engineering is the assessment of close loop performance. Harris ascertains a performance index where the best performance is assumed to be attained by a minimum variance controller.</p>\n<p>This research spotlights on the tuning of the illustrious and most frequently used PI controller to achieve minimum variance conditions. The optimization problem is embrarked upon two different approached. The first approach uses enumerative search optimization for its simplicity. The second approach applies an exploited hybrid genetic algorithm that is developed to generate vigorous and premium results. The algorithm amalgamates the genetic operations of selection, crossover, and mutation with Newton's search inside successively expanding and contracting parameter domains using alternating logarithmic and linear mappings. Finally, the obtained PI parameters and tested and simulated with data from three control loops at Falconbridge Smelter in Sudbury and compared with the existing tuning parameters. The new parameters yield optimal results.</p>",
        "link": "http://dx.doi.org/10.32920/ryerson.14664141.v1"
    },
    {
        "id": 19163,
        "title": "Pu EXAFS Fitting Using Genetic Algorithms (Yearly Highlight) [Slides]",
        "authors": "Daniel Olive",
        "published": "2022-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1872331"
    },
    {
        "id": 19164,
        "title": "Genetic Algorithms and Evolutionary Computing in Python",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48047/resmil.v9i1.23"
    },
    {
        "id": 19165,
        "title": "Optimal robust control",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315219219-5"
    },
    {
        "id": 19166,
        "title": "Genetic Algorithms",
        "authors": "",
        "published": "2022-10-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.94664"
    },
    {
        "id": 19167,
        "title": "Generating Loop Patterns with a Genetic Algorithm and a Probabilistic Cellular Automata Rule",
        "authors": "Rolf Hoffmann",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "The objective is to find a Cellular Automata (CA) rule that can generate “loop patterns”. A loop pattern is given by ones on a zero background showing loops. In order to find out how loop patterns can be locally defined, tentative loop patterns are generated by a genetic algorithm in a preliminary stage. A set of local matching tiles is designed and checked whether they can produce the aimed loop patterns by the genetic algorithm. After having approved a certain set of tiles, a probabilistic CA rule is designed in a methodical way. Templates are derived from the tiles, which then are used in the CA rule for matching. In order to drive the evolution to the desired patterns, noise is injected if the templates do not match or other constraints are not fulfilled. Simulations illustrate that loops and connected loops can be evolved by the CA rule.",
        "link": "http://dx.doi.org/10.3390/a16070352"
    },
    {
        "id": 19168,
        "title": "Vehicle layout optimization using multi-objective genetic algorithms",
        "authors": "Siddhant Phadte",
        "published": "2017-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icammaet.2017.8186624"
    },
    {
        "id": 19169,
        "title": "A Reward Population-Based Differential Genetic Harmony Search Algorithm",
        "authors": "Yang Zhang, Jiacheng Li, Lei Li",
        "published": "2022-1-14",
        "citations": 6,
        "abstract": "To overcome the shortcomings of the harmony search algorithm, such as its slow convergence rate and poor global search ability, a reward population-based differential genetic harmony search algorithm is proposed. In this algorithm, a population is divided into four ordinary sub-populations and one reward sub-population, for each of which the evolution strategy of the differential genetic harmony search is used. After the evolution, the population with the optimal average fitness is combined with the reward population to produce a new reward population. During an experiment, tests were conducted first on determining the value of the harmony memory size (HMS) and the harmony memory consideration rate (HMCR), followed by an analysis of the effect of their values on the performance of the proposed algorithm. Then, six benchmark functions were selected for the experiment, and a comparison was made on the calculation results of the standard harmony memory search algorithm, reward population harmony search algorithm, differential genetic harmony algorithm, and reward population-based differential genetic harmony search algorithm. The result suggests that the reward population-based differential genetic harmony search algorithm has the merits of a strong global search ability, high solving accuracy, and satisfactory stability.",
        "link": "http://dx.doi.org/10.3390/a15010023"
    },
    {
        "id": 19170,
        "title": "Application of Genetic Algorithms and Partial Swarm Optimization in Cloud Computing",
        "authors": "Krishn Kumar Mishra",
        "published": "2022-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003313649-11"
    }
]