[
    {
        "id": 16705,
        "title": "Enhancing Diabetic Retinopathy Detection Using CNNs with Dimensionality Reduction Techniques and K-Nearest Neighbors Ensembles",
        "authors": "Chaymaa Lahmar, Ali Idri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012191900003598"
    },
    {
        "id": 16706,
        "title": "Evaluation of Dimensionality Reduction Techniques: A Simulation Study (Poster 4)",
        "authors": "Yuting Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2041384"
    },
    {
        "id": 16707,
        "title": "Non-linear Dimensionality Reduction Techniques for Model Order Reduction of Aviation Noise Metrics",
        "authors": "Jirat Bhanpato, Ameya Behere, Dimitri N. Mavris",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-4061"
    },
    {
        "id": 16708,
        "title": "Dimensionality reduction techniques and computational intelligence models used to discriminate different petrogenetic models through lithogeochemical data",
        "authors": "Guilherm Potratz, Mauro Geraldes",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7185/gold2023.19842"
    },
    {
        "id": 16709,
        "title": "Visualizing Teams Performance in National Kabaddi\nLeague through Dimensionality Reduction\nTechniques",
        "authors": "M. Gayathri, V. Kavitha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.178"
    },
    {
        "id": 16710,
        "title": "Performance Analysis of Dimensionality Reduction Techniques for Datasets using Deep Learning",
        "authors": "Priya Vij, Dalip Dalip",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10308003"
    },
    {
        "id": 16711,
        "title": "Dimensionality reduction techniques for high dimensional data: State of the art",
        "authors": "Suixin Jiang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "In the past decades, tons of data have been generated every single day as people increasingly rely on electronic products and networks in their lives. The developments in techniques and storage capabilities provide a fundamental condition for analyzing those huge-volumed data. Each captured feature represents a dimension of the data. So far, high dimensional data analysis has become a challenging task in various study fields. Redundant and irrelevant features can be removed by using different dimensionality reduction techniques. Effective information extraction can be achieved by using the proper method. This paper reviews the most widely used dimensionality reduction techniques and their application fields. It can be found that though DRTs have been successfully applied to many areas (i.e., image, audio/video data, biomedical), DRTs still need to be improved and developed to achieve better classification and prediction accuracy. Inter-method combinations will remain the focus of research in the future. Computation time and cost may not be a limitation anymore as the computation power of the computer is still developing. So, the development of the algorithm is becoming particularly important. This study provides a brief introduction to widely used DRTs and their variants, it will be helpful for understanding HDD analysis, and more DRTs will be researched in future work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/13/20230707"
    },
    {
        "id": 16712,
        "title": "Dimensionality reduction techniques in structural and earthquake engineering",
        "authors": "P. Hajibabaee, F. Pourkamali-Anaraki, M.A. Hariri-Ardebili",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2022.115485"
    },
    {
        "id": 16713,
        "title": "Impact of Dimensionality Reduction Techniques on Classification of Hyperspectral Images",
        "authors": "Vamshi Krishna Munipalle, Usha Rani Nelakuditi, Rama Rao Nidamanuri",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205828"
    },
    {
        "id": 16714,
        "title": "Fusion of linear and non-linear dimensionality reduction techniques for feature reduction in LSTM-based Intrusion Detection System",
        "authors": "Ankit Thakkar, Nandish Kikani, Rebakah Geddam",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2024.111378"
    },
    {
        "id": 16715,
        "title": "Identification of duplicate parts of hyper spectral images based on fuzzy by dimensionality reduction techniques",
        "authors": "Sampurnima Pattem, Satish Thatavarti",
        "published": "2023-6-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08574-2"
    },
    {
        "id": 16716,
        "title": "Visualizing insomnia phenotypes using dimensionality reduction techniques",
        "authors": "P. Bouchequet, T. Andrillon, G. Solelhac, A. Rouen, F. Sauvet, D. Léger",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sleep.2023.11.548"
    },
    {
        "id": 16717,
        "title": "0424 Visualizing insomnia phenotypes using dimensionality reduction techniques",
        "authors": "Paul Bouchequet, Thomas Andrillon, Geoffroy Solelhac, Alexandre Rouen, Fabien Sauvet, Damien Léger",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "Abstract\n\nIntroduction\nA large number of features can be extracted from a single hypnogram, such as stages durations, onsets, or transitions probabilities. Those numerous indicators can turn a collection of sleep records into a high dimension space. Dimensionality reduction techniques are then useful to reveal patterns in data. We used 3 dimensionality reduction techniques to visualize insomnia phenotypes from a dataset of insomnia and control sleep records: principal component analysis (PCA), t-distributed stochastic neighbor embedding (t-SNE) and uniform manifold approximation and projection (UMAP).\n\n\nMethods\n519 sleep records have been included with the following diagnoses: 46 sleep onset insomnia, 83 sleep state misperception, 223 sleep maintenance insomnia, 117 sleep onset and maintenance insomnia and 50 controls (good sleep). We limited the feature extraction to the hypnogram as macrostructure constitute the primary source of information used for diagnosis in polysomnography. We used common macrostructure indicators such as wake after sleep onset (WASO), as well as more intricate features such as stages transitions probabilities. A first set of 54 features per hypnogram was computed. Those features were then projected in a 2 dimensional space using PCA, t-SNE and UMAP.\n\n\nResults\nCo-ranking matrix of the projections was computed for the 3 techniques (PCA: Kmax=103, Qlocal=0.38; tSNE: Kmax=20, Qlocal=0.44; UMAP: Kmax=160, Qlocal=0.44). UMAP was the technique that projected the hypnograms feature sets in the most meaningful way, by reflecting the individual diagnoses. Interestingly in the UMAP representation, group outliers, such as controls having nevertheless experienced nocturnal awakenings were projected next to similar insomnia subjects, which indicate a fine-grained capture of sleep quality at the individual level.\n\n\nConclusion\nDimensionality reduction and unsupervised techniques are promising methods when approaching high dimensionality spaces. A fine analysis of projected clusters could show subgroups in already known phenotypes. As literature showed robustness and applicability of those methods to larger datasets, dimensionality reduction of insomnia records could be improved by the addition of new features computed from hypnodensities generated by machine learning algorithms, or by spectral features extracted from polysomnographic signals.\n\n\nSupport (if any)\nNone\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/sleep/zsad077.0424"
    },
    {
        "id": 16718,
        "title": "Reducing Complexity: A Comparative Analysis of Dimensionality-Reduction Techniques",
        "authors": "Raji Ramachandran,  Yamunakrishnan, G Govind, M K Devkrishna, Abhiram A Anil",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353315"
    },
    {
        "id": 16719,
        "title": "Performance evaluation of dimensionality reduction techniques on hyperspectral data for mineral exploration",
        "authors": "Deepa C, Amba Shetty, Narasimhadhan A V",
        "published": "2023-2-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12145-023-00956-2"
    },
    {
        "id": 16720,
        "title": "Performance Evaluation Of Machine Learning Algorithms For Rainfall Prediction Using Dimensionality Reduction Techniques",
        "authors": "Sapna Kumari, Muhammad Owais Raza, Arsha Kumari",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icomet57998.2023.10109001"
    },
    {
        "id": 16721,
        "title": "Multiclass Brain Tumor Classification of MR-Images Using ResNet-50 and Dimensionality Reduction Techniques",
        "authors": "Anjana M Nair, Lakshmi S Kumar, Vimina E R",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205710"
    },
    {
        "id": 16722,
        "title": "Integration of ML Techniques for Early Detection of Breast Cancer: Dimensionality Reduction Approach",
        "authors": "Wial Hanon, Mahdi Abed Salman",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/isi.290134"
    },
    {
        "id": 16723,
        "title": "Comparison of Feature Selection and Feature Extraction Role in Dimensionality Reduction of Big Data",
        "authors": " Haidar Khalid Malik,  Nashaat Jasim Al-Anber",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "Recently, researchers intensified their efforts on a dataset with a large number of features named Big Data because of the technological revolution and the development in the data science sector. Dimensionality reduction technology has efficient, effective, and influential methods for analyzing this data, which contains many variables. The importance of Dimensionality Reduction technology lies in several fields, including “data processing, patterns recognition, machine learning, and data mining”. This paper compares two essential methods of dimensionality reduction, Feature Extraction and Feature Selection Which Machine Learning models frequently employ. We applied many classifiers like (Support vector machines, k-nearest neighbors, Decision tree, and Naive Bayes ) to the data of the anthropometric survey of US Army personnel (ANSUR 2) to classify the data and test the relevance of features by predicting a specific feature in USA Army personnel results showing that (k-nearest neighbors) achieved high accuracy (83%) in prediction, then reducing the dimensions by several techniques like (Highly Correlated Filter, Recursive  Feature Elimination, and principal components Analysis) results showing that (Recursive  Feature Elimination) have the best accuracy by (66%), From these results, it is clear that the efficiency of dimension reduction techniques varies according to the nature of the data. Some techniques are more efficient than others in text data and others are more efficient in dealing with images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51173/jt.v5i1.1027"
    },
    {
        "id": 16724,
        "title": "Improving scalability of recommendation system using ontology and dimensionality reduction techniques",
        "authors": "Sajida Mhammedi, Hakim El Massari, Noreddine Gherabi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0149217"
    },
    {
        "id": 16725,
        "title": "Advances in Dimensionality Reduction Techniques for Face Recognition: A Comparative Analysis",
        "authors": "G Yashwanth Kiran, Gautam Kumpatla, Annam Sai Kiran, Iqbal Mohammad, Garigipati Rahul",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425300"
    },
    {
        "id": 16726,
        "title": "Modeling dissolved oxygen concentration using machine learning techniques with dimensionality reduction approach",
        "authors": "Farid Hassanbaki Garabaghi, Semra Benzer, Recep Benzer",
        "published": "2023-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10661-023-11492-3"
    },
    {
        "id": 16727,
        "title": "Comparative analysis of dimensionality reduction techniques for cybersecurity in the SWaT dataset",
        "authors": "Mehmet Bozdal, Kadir Ileri, Ali Ozkahraman",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05511-w"
    },
    {
        "id": 16728,
        "title": "Enhancing intrusion detection systems through dimensionality reduction: A comparative study of machine learning techniques for cyber security",
        "authors": "Faisal Nabi, Xujuan Zhou",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csa.2023.100033"
    },
    {
        "id": 16729,
        "title": "Analysis of laser ablation spectral data using dimensionality reduction techniques: PCA, t-SNE and UMAP",
        "authors": "M.S. Rabasovic, D.M. Pavlovic, D. Sevic",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31577/caosp.2023.53.3.51"
    },
    {
        "id": 16730,
        "title": "Dimensionality Reduction using Feature Selection Techniques on EDM for Student Academic Performance Prediction",
        "authors": "Et al. Kajal Mahawar",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "The aim of this study is to perform dimensionality reduction on student datasets using different feature selection strategies in order to better forecast students' academic progress and minimize high-dimensionality concerns. The effectiveness of models built utilizing classification algorithms and pertinent features chosen using different feature selection strategies has been experimentally evaluated in this study. Nine feature selection methods, including Chi-Square, Pearson Correlation, Variance Threshold, Feature Importance, Recursive Feature Elimination (RFE), Lasso, Ridge, Random Forest, and XGBoost, as well as one classification method, logistic regression, were applied to the student dataset to determine the results of the analysis.  In this experiment, dimensionality reduction techniques were used to reduce the number of features from 70 to the optimal 21 feature subsets for analysis of student academic performance prediction. Five measures were used to assess the effectiveness of the techniques: r2, precision, recall, f-score, and accuracy. With the logistic regression classifier, the feature subset chosen by the chi-square had the highest accuracy of 72.4%, precision of 71.4%, recall of 72.4%, f-score of 70%, and r-square of -0.221%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i10.8961"
    },
    {
        "id": 16731,
        "title": "A Comprehensive Review of Dimensionality Reduction Techniques for Real time Network Intrusion Detection with Applications in Cybersecurity",
        "authors": "Rohan Gondhalekar, Rajan Chattamvelli",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "This paper reviews popular signature and anomaly-based intrusion detection systems (IDS). Dimensionality reduction techniques (DRT) are used to increase the efficiency of such systems for real-time operation. Autoencoder-based IDS is rapidly gaining in popularity, primarily due to its inherent ability to denoise data and reduce dimensionality. In addition to the efficiency, we also look at the classification techniques used by various authors, and the overall impact of a model in terms of performance metrics. This article is written for novices in cybersecurityto get a jumpstart on the latest IDS algorithms. The purpose is to give useful insights into the broad and progressive view of various techniques in wide use, expose high-impact future research areas and to summarize classic IDS methods and feature selection techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14429/dsj.74.18953"
    },
    {
        "id": 16732,
        "title": "Exploring the Effectiveness of Dimensionality Reduction Techniques for Stock Price Prediction",
        "authors": "Dongyu Zhuo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.1-9-2023.2338744"
    },
    {
        "id": 16733,
        "title": "Charactering Human-Caused Fires Using GIS-Based Dimensionality Reduction Techniques in Keelung City, Taiwan",
        "authors": "Cheng-Yu Ku, Hsueh-Chuan Lu, Yi-Tse Tu, Chih-Yu Liu",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "Fires resulting from human activities, encompassing arson, electrical problems, smoking, cooking mishaps, and industrial accidents, necessitate understanding to facilitate effective prevention. This study investigates human-caused fires in Keelung City, Taiwan, employing geographic information system (GIS)-based dimensionality reduction techniques. By analyzing eleven diverse factors, including fire incident density, population-related, building-related and economic-related features, valuable insights are gained for enhancing fire prevention. Utilizing principal component analysis (PCA), factor analysis (FA), and out-of-bag (OOB) predictor importance, our algorithm identifies key factors explaining dataset variance. Results from three approaches reveal a significant link between fire incidents and the elderly population, buildings over 40 years old, and the tertiary sector in the economy, contributing to developing effective measures for mitigating and managing fire occurrences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14051930"
    },
    {
        "id": 16734,
        "title": "Multivariate and Dimensionality-Reduction-Based Machine Learning Techniques for Tumor Classification of RNA-Seq Data",
        "authors": "Mahmood Al-khassaweneh, Mark Bronakowski, Esraa Al-Sharoa",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Cancer, a genetic disease, is considered one of the leading causes of death globally and affects people of all ages. Ribonucleic acid sequencing (RNA-Seq) is a technique used to quantify the expression of genes of interest and can be used to classify cancer tumor types. This paper describes a machine learning technique to classify cancer tissue samples by tumor type, such as breast cancer, lung cancer, colon cancer, and others. More than 60,000 RNA-Seq features were analyzed using six different machine learning classification algorithms, both individually and as an ensemble. Numerous dimensionality reduction techniques addressed the challenges of working with enormous amounts of genetic data. In particular, we were able to reduce the number of features from over 60,000 to 660 in the random forest feature selection and to 68 factor features using factor analysis with an accuracy of 99% in classifying tumor types.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132312801"
    },
    {
        "id": 16735,
        "title": "\"Why Here and not There?\": Diverse Contrasting Explanations of Dimensionality Reduction",
        "authors": "André Artelt, Alexander Schulz, Barbara Hammer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011618300003411"
    },
    {
        "id": 16736,
        "title": "Design optimisation of separate-jet exhausts with CFD in-the-loop and dimensionality reduction techniques",
        "authors": "Josep Hueso-Rebassa, David G. MacManus, Fernando Tejero, Ioannis Goulos, Chawki Abdessemed, Christopher Sheaf",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-1616"
    },
    {
        "id": 16737,
        "title": "Discrimination on potential adulteration of extra virgin olive oils consumed in China by differential scanning calorimeter combined with dimensionality reduction classification techniques",
        "authors": "Kaiyuan Huang, Peihao Zhong, Baojun Xu",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.foodchem.2022.134996"
    },
    {
        "id": 16738,
        "title": "Development of A Multi-Level Data Security System for Internet of Things using Dimensionality Reduction Techniques and Machine Learning",
        "authors": "Agajo James, Thomas Sadiq, Fatima Ajiya Umar",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.9728/jcc.2023.12.5.2.699"
    },
    {
        "id": 16739,
        "title": "A Survey on Dimensionality Reduction Techniques for Time-Series Data",
        "authors": "Mohsena Ashraf, Farzana Anowar, Jahanggir H. Setu, Atiqul I. Chowdhury, Eshtiak Ahmed, Ashraful Islam, Abdullah Al-Mamun",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3269693"
    },
    {
        "id": 16740,
        "title": "Hyperspectral estimation of chlorophyll content in jujube leaves: integration of derivative processing techniques and dimensionality reduction algorithms",
        "authors": "Nigela Tuerxun, Jianghua Zheng, Renjun Wang, Lei Wang, Liang Liu",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "The leaf chlorophyll content (LCC) of vegetation is closely related to photosynthetic efficiency and biological activity. Jujube (Ziziphus jujuba Mill.) is a traditional economic forest tree species. Non-destructive monitoring of LCC of jujube is of great significance for guiding agroforestry production and promoting ecological environment protection in arid and semi-arid lands. Hyperspectral data is an important data source for LCC detection. However, hyperspectral data consists of a multitude of bands and contains extensive information. As a result, certain bands may exhibit high correlation, leading to redundant spectral information. This redundancy can distort LCC prediction results and reduce accuracy. Therefore, it is crucial to select appropriate preprocessing methods and employ effective data mining techniques when analyzing hyperspectral data. This study aims to evaluate the performance of hyperspectral data for estimating LCC of jujube trees by integrating different derivative processing techniques with different dimensionality reduction algorithms. Hyperspectral reflectance data were obtained through simulations using an invertible forest reflectance model (INFORM) and measurements from jujube tree canopies. The least absolute shrinkage and selection operator (LASSO) and elastic net (EN) were employed to identify the important bands in the original spectra (OS), first derivative spectra (FD), and second derivative spectra (SD). Support vector regression (SVR) was used to establish the estimation model. The results show that compared with full-spectrum modeling, LASSO and EN algorithms are effective methods for preventing overfitting in LCC machine learning estimation models for different spectral derivatives. The LASSO/EN-based estimation models constructed using FD and SD exhibited superior R2 compared to the OS. The important band of SD can best reveal the relevant information of jujube LCC, and SD-EN-SVR is the most ideal model in both the simulated dataset (R2 = 0.99, RMSE=0.61) and measured dataset (R2 = 0.89, RMSE=0.91). Our results provided a reference for rapid and non-destructive estimation of the LCC of agroforestry vegetation using canopy hyperspectral data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpls.2023.1260772"
    },
    {
        "id": 16741,
        "title": "A Comparative Analysis of various Dimensionality Reduction Techniques on N-BaIoT Dataset for IoT Botnet Detection",
        "authors": "N Sakthipriya, V. Govindasamy, V. Akila",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pcems58491.2023.10136065"
    },
    {
        "id": 16742,
        "title": "Ship Engine Model Selection by Applying Machine Learning Classification Techniques Using Imputation and Dimensionality Reduction",
        "authors": "Kyriakos Skarlatos, Grigorios Papageorgiou, Panagiotis Biris, Ekaterini Skamnia, Polychronis Economou, Sotirios Bersimis",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "The maritime is facing a gradual proliferation of data, which is frequently coupled with the presence of subpar information that contains missing and duplicate data, erroneous records, and flawed entries as a result of human intervention or a lack of access to sensitive and important collaborative information. Data limitations and restrictions have a crucial impact on inefficient data-driven decisions, leading to decreased productivity, augmented operating expenses, and the consequent substantial decline in a competitive edge. The missing or inadequate presentation of significant information, such as the vessel’s primary engine model, critically affects its capabilities and operating expenses as well as its environmental impact. In this study, a comprehensive study was employed, using and comparing several machine learning classification techniques to classify a ship’s main engine model, along with different imputation methods for handling the missing values and dimensionality reduction methods. The classification is based on the technical and operational characteristics of the vessel, including the physical dimensions, various capacities, speeds and consumption. Briefly, three dimensionality reduction methods (Principal Component Analysis, Uniform Manifold Approximation and Projection, and t-Distributed Stochastic Neighbor Embedding) were considered and combined with a variety of classifiers and the appropriate parameters of the dimensionality reduction methods. According to the classification results, the ExtraTreeClassifier with PCA with 4 components, the ExtraTreeClassifier with t-SNE with perplexity equal to 10 and 3 components, and the same classifier with UMAP with 10 neighbors and 3 components outperformed the rest of the combinations. This classification could provide significant information for shipowners to enhance the vessel’s operation by optimizing it.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse12010097"
    },
    {
        "id": 16743,
        "title": "Demystifying dimensionality reduction techniques in the ‘omics’ era: A practical approach for biological science students",
        "authors": "Leonardo D. Garma, Nuno S. Osório",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractDimensionality reduction techniques are essential in analyzing large ‘omics’ datasets in biochemistry and molecular biology. Principal component analysis, t‐distributed stochastic neighbor embedding, and uniform manifold approximation and projection are commonly used for data visualization. However, these methods can be challenging for students without a strong mathematical background. In this study, intuitive examples were created using COVID‐19 data to help students understand the core concepts behind these techniques. In a 4‐h practical session, we used these examples to demonstrate dimensionality reduction techniques to 15 postgraduate students from biomedical backgrounds. Using Python and Jupyter notebooks, our goal was to demystify these methods, typically treated as “black boxes”, and empower students to generate and interpret their own results. To assess the impact of our approach, we conducted an anonymous survey. The majority of the students agreed that using computers enriched their learning experience (67%) and that Jupyter notebooks were a valuable part of the class (66%). Additionally, 60% of the students reported increased interest in Python, and 40% gained both interest and a better understanding of dimensionality reduction methods. Despite the short duration of the course, 40% of the students reported acquiring research skills necessary in the field. While further analysis of the learning impacts of this approach is needed, we believe that sharing the examples we generated can provide valuable resources for others to use in interactive teaching environments. These examples highlight advantages and limitations of the major dimensionality reduction methods used in modern bioinformatics analysis in an easy‐to‐understand way.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/bmb.21800"
    },
    {
        "id": 16744,
        "title": "Impact of dimensionality reduction techniques on student performance prediction using machine learning",
        "authors": "Koushik Roy, Huu-Hoa Nguyen, Dewan Md. Farid",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "This study addresses the crucial issue of predicting student performance in educational data mining (EDM) by proposing an Adaptive Dimensionality Reduction Algorithm (ADRA). ADRA efficiently reduces the dimensionality of student data, encompassing various academic, demographic, behavioral, social, and health-related features. It achieves this by iteratively selecting the most relevant features based on a combined normalized mean rank of five feature ranking methods. This reduction in dimensionality enhances the performance of predictive models and provides valuable insights into the key factors influencing student performance. The study evaluates ADRA using four different student performance datasets and six machine learning algorithms, comparing it to three existing dimensionality reduction methods. The results show that ADRA achieves an average dimensionality reduction factor of 6.2 while maintaing comprable accuracy with other mehtods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22144/ctujoisd.2023.039"
    },
    {
        "id": 16745,
        "title": "Combating Financial Crimes with Unsupervised Learning Techniques: Clustering and Dimensionality Reduction for Anti-Money Laundering",
        "authors": "Ahmed N. Bakry, Almohammady S. Alsharkawy, Mohamed S. Farag, Kamal R. Raslan",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58675/2636-3305.1664"
    },
    {
        "id": 16746,
        "title": "Fairness-Aware Dimensionality Reduction",
        "authors": "O. Deniz Kose, Yanning Shen",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289717"
    },
    {
        "id": 16747,
        "title": "Toward computing attributions for dimensionality reduction techniques",
        "authors": "Matthew Scicluna, Jean-Christophe Grenier, Raphaël Poujol, Sébastien Lemieux, Julie G Hussin",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "Abstract\n\nSummary\nWe describe the problem of computing local feature attributions for dimensionality reduction methods. We use one such method that is well established within the context of supervised classification—using the gradients of target outputs with respect to the inputs—on the popular dimensionality reduction technique t-SNE, widely used in analyses of biological data. We provide an efficient implementation for the gradient computation for this dimensionality reduction technique. We show that our explanations identify significant features using novel validation methodology; using synthetic datasets and the popular MNIST benchmark dataset. We then demonstrate the practical utility of our algorithm by showing that it can produce explanations that agree with domain knowledge on a SARS-CoV-2 sequence dataset. Throughout, we provide a road map so that similar explanation methods could be applied to other dimensionality reduction techniques to rigorously analyze biological datasets.\n\n\nAvailability and implementation\nWe have created a Python package that can be installed using the following command: pip install interpretable_tsne. All code used can be found at github.com/MattScicluna/interpretable_tsne.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioadv/vbad097"
    },
    {
        "id": 16748,
        "title": "NETWORK TRAFFIC ANOMALY DETECTION BY DIMENSIONALITY REDUCTION METHODS",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Anomaly in network traffic can arise from various cyberattacks, malfunction network devices or software flaws. Therefore traffic anomaly detection is an important practical problem especially in the issue of cybersecurity. Many recent anomaly detection techniques are based on machine learning methods. Unsupervised machine learning algorithms generally are more preferable than supervised learning because they can be trained on raw undimensioned data that greatly reduce training expenses. Dimensionality reduction methods are unsupervised learning algorithms that can be used for traffic anomaly detection. This work presents an application of such traffic anomaly detection methods, when faults are caused by some network attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18469/ikt.2022.20.4.05"
    },
    {
        "id": 16749,
        "title": "A biological model of nonlinear dimensionality reduction",
        "authors": "Kensuke Yoshida, Taro Toyoizumi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1117-0"
    },
    {
        "id": 16750,
        "title": "Comparative Analysis of Dimensionality Reduction Techniques for Advanced Ransomware Detection with Machine Learning",
        "authors": "Han Seok Kim,  , Soo Jin Lee",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33778/kcsa.2023.23.1.117"
    },
    {
        "id": 16751,
        "title": "Comparison of dimensionality reduction techniques for the visualisation of chemical space in organometallic catalysis",
        "authors": "Mario Villares, Carla M. Saunders, Natalie Fey",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aichem.2024.100055"
    },
    {
        "id": 16752,
        "title": "Predictive Modeling of Delay in an LTE Network by Optimizing the Number of Predictors Using Dimensionality Reduction Techniques",
        "authors": "Mirko Stojčić, Milorad K. Banjanin, Milan Vasiljević, Dragana Nedić, Aleksandar Stjepanović, Dejan Danilović, Goran Puzić",
        "published": "2023-7-23",
        "citations": 0,
        "abstract": "Delay in data transmission is one of the key performance indicators (KPIs) of a network. The planning and design value of delay in network management is of crucial importance for the optimal allocation of network resources and their performance focuses. To create optimal solutions, predictive models, which are currently most often based on machine learning (ML), are used. This paper aims to investigate the training, testing and selection of the best predictive delay model for a VoIP service in a Long Term Evolution (LTE) network using three ML techniques: Multilayer Perceptron (MLP), Support Vector Machines (SVM) and k-Nearest Neighbors (k-NN). The space of model input variables is optimized by dimensionality reduction techniques: RReliefF algorithm, Backward selection via the recursive feature elimination algorithm and the Pareto 80/20 rule. A three-segment road in the geo-space between the cities of Banja Luka (BL) and Doboj (Db) in the Republic of Srpska (RS), Bosnia and Herzegovina (BiH), covered by the cellular network (LTE) of the M:tel BL operator was chosen for the case study. The results show that the k-NN model has been selected as the best solution in all three optimization approaches. For the RReliefF optimization algorithm, the best model has six inputs and the minimum relative error (RE) RE = 0.109. For the Backward selection via the recursive feature elimination algorithm, the best model has four inputs and RE = 0.041. Finally, for the Pareto 80/20 rule, the best model has 11 inputs and RE = 0.049. The comparative analysis of the results concludes that, according to observed criteria for the selection of the final model, the best solution is an approach to optimizing the number of predictors based on the Backward selection via the recursive feature elimination algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13148511"
    },
    {
        "id": 16753,
        "title": "Comparative assessment of advanced machine learning techniques for simulation of lake water level fluctuations based on different dimensionality reduction methods",
        "authors": "Mostafa Riazi, Maryam Karimi, Saeid Eslamian, Majid Riahi Samani",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12145-023-00951-7"
    },
    {
        "id": 16754,
        "title": "Heart Disease Prediction Using Stacking Model With Balancing Techniques and Dimensionality Reduction",
        "authors": "Ayesha Noor, Nadeem Javaid, Nabil Alrajeh, Babar Mansoor, Ali Khaqan, Safdar Hussain Bouk",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3325681"
    },
    {
        "id": 16755,
        "title": "Evaluating Differences in Insights from Interactive Dimensionality Reduction Visualizations Through Complexity and Vocabulary",
        "authors": "Mia Taylor, Lata Kodali, Leanna House, Chris North",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011663500003417"
    },
    {
        "id": 16756,
        "title": "Combining Machine Learning and Dimensionality Reduction Techniques to Provide an Efficient Customer Segmentation: A Case of CAS Tecnologia Smart Grid Power System in Brazil",
        "authors": "Andre Fonseca, Carla O. Santos, Wagner Nakasuga, Juliano Abreu, Danilo Ribera, Welson Jacometti",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/induscon58041.2023.10375059"
    },
    {
        "id": 16757,
        "title": "Wind turbine fault detection: a semi-supervised learning approach with two different dimensionality reduction techniques",
        "authors": "Rodrigo F. Toso, Eduardo Ogasawara, Fernando P.G. De Sá, Rafaelli De C. Coutinho, Diego Brand�ão",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijica.2023.10054513"
    },
    {
        "id": 16758,
        "title": "Dimensionality Reduction for Machine Learning-based Argument Mining",
        "authors": "Andrés Segura-Tinoco, Iván Cantador",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.argmining-1.9"
    },
    {
        "id": 16759,
        "title": "Complexity analysis of VMAT prostate plans: insights from dimensionality reduction and information theory techniques",
        "authors": "Efstathios Kamperis, Chionia Kodona, Apostolia Papalexandrou, Georgios Arsos, Anna-Bettina Heidich, Konstantinos Hatziioannou, Vasileios Giannouzakos, Emmanouil Papanastasiou",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Abstract\n\nIntroduction: Volumetric Modulated Arc Therapy (VMAT) is a state-of-the-art prostate cancer treatment, defined by high dose gradients around targets. Its unique dose shaping incurs hidden complexity, impacting treatment deliverability, carcinogenesis, and machine strain. This study compares various aperture-based VMAT complexity indices in prostate cases using principal component and mutual information analyses. It suggests essential properties for an ideal complexity index from an information-theoretic viewpoint.\n\nMaterial and methods: The following ten complexity indices were calculated in 217 VMAT prostate plans: circumference over area (CoA), edge metric (EM), equivalent square field (ESF), leaf travel (LT), leaf travel modulation complexity score for VMAT (LTMCSV), mean-field area (MFA), modulation complexity score (standard MCS and VMAT variant MCSV), plan irregularity (PI), and small aperture score (SAS5mm). Principal component analysis (PCA) was applied to explore the correlations between the metrics. The differential entropy of all metrics was also calculated, along with the mutual information for all 45 metric pairs.\n\nResults: Whole-pelvis plans had greater complexity across all indices. The first three principal components explained 96.2% of the total variance. The complexity metrics formed three groups with similar conceptual characteristics, particularly ESF, LT, MFA, PI, and EM, SAS5mm. The differential entropy varied across the complexity metrics (PI having the smallest vs. EM the largest). Mutual information analysis (MIA) confirmed some metrics’ interdependence, although other pairs, such as LTMCSV/SAS5mm, LT/MCSV, and EM/SAS5mm, were found to share minimal MI.\n\nConclusions: There are many complexity indices for VMAT described in the literature. PCA and MIA analyses can uncover significant overlap among them. However, this is not entirely reducible through dimensionality reduction techniques, suggesting that there also exists some reciprocity. When designing predictive models of quality assurance metrics, PCA and MIA may prove useful for feature engineering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/pjmpe-2023-0015"
    },
    {
        "id": 16760,
        "title": "Enhancing Cardiac Arrhythmia Detection in WBAN Sensors Through Supervised Machine Learning and Data Dimensionality Reduction Techniques",
        "authors": "Safa Saad Hussein, C. B. M. Rashidi, S. A. Aljunid, Muataz H. Salih, Mohammed Sabri Abuali, Arshad M. Khaleel",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/mmep.100615"
    },
    {
        "id": 16761,
        "title": "Contrastive Learning Dimensionality Reduction Method Based on Manifold Learning",
        "authors": "Jinghao Situ",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": " With the development of the times, more and more high-dimensional datasets come into people's view. In order to reduce the time complexity and space complexity of downstream tasks, data dimensionality reduction becomes the primary choice. Classical dimensionality reduction algorithms are mainly divided into linear dimensionality reduction algorithms and nonlinear dimensionality reduction algorithms. Some of the traditional dimensionality reduction methods have the problems of not considering the nonlinear structure of the original dataset and the existence of weak generalisation, which makes the dimensionality reduction effect not good or model need to be recalculated because of the addition of new samples. In order to solve these problems, the research in this paper is a comparative learning dimensionality reduction method based on manifold learning. The idea of manifold learning using geodesic distance can fully consider the nonlinear structure of the original dataset. In this paper, comparative learning is the main framework. When the neural network completes the training, it only need to take the new data as input to calculate, the result can be obtained, no need to reconstruct the model which means the generality is high. Starting from the related work, this paper briefly introduces manifold learning, comparative learning and neural network algorithms. Subsequently, an innovative model is proposed, including three modules, Isomap to extract nonlinear structure, expanding neighbourhood to make pseudo-labels, and comparative learning training. Detailed analyses are carried out through experiments, comparing with PCA and LLE algorithms with the geodetic distance retention rate as an indicator, which proves that the data dimensionality reduction method of this model is more effective and ubiquitous.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56028/aetr.9.1.522.2024"
    },
    {
        "id": 16762,
        "title": "Dimensionality Reduction Algorithms in Machine Learning: A Theoretical and Experimental Comparison",
        "authors": "Ashish Kumar Rastogi, Swapnesh Taterh, Billakurthi Suresh Kumar",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059082"
    },
    {
        "id": 16763,
        "title": "Efficient breast cancer classification using LS-SVM and dimensionality reduction",
        "authors": "Amin Salih Mohammed",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09258-7"
    },
    {
        "id": 16764,
        "title": "Convolutional neural networks based dimensionality reduction for hyperspectral images",
        "authors": "Vladimir Zeljković, Branka Stojanović, Malte Jaschik, Aleksandar Nešković",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/telfor59449.2023.10372740"
    },
    {
        "id": 16765,
        "title": "Kinodynamic FMT* with Dimensionality Reduction Heuristics and Neural Network Controllers",
        "authors": "Dongliang Zheng, Panagiotis Tsiotras",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-0711"
    },
    {
        "id": 16766,
        "title": "Comparison and Evaluation of Classical Dimensionality Reduction Methods",
        "authors": "Zilin Shen",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "As one of the tasks of unsupervised learning, data dimensionality reduction is faced with the problem of a lack of evaluation methods. Based on this, three classical dimensionality reduction methods such as PCA, t-SNE and UMAP were selected as the research object in this paper. This article selected 5 three-classification datasets and used the three methods mentioned above to perform dimensionality reduction. This paper plotted 3D scatter graphs after dimensionality reduction to analyze the differentiation effect of the data on different categories of the target variable. Then the data after dimensionality reduction was classified using random forest model and the classification accuracy was obtained. According to the 3D scatter plots and the accuracy of random forest, it is found that PCA has a good dimensionality reduction effect on most of the selected datasets, and t-SNE has a relatively stable dimensionality reduction effect. In contrast, UMAP has good dimensionality reduction performance in some individual datasets but lacks stability. Overall, this paper proposes a dimensionality reduction evaluation method that combines scatter-plot visualization results and classification models, which can effectively predict the performances of the dimensionality reduction methods for a variety of datasets, thereby promoting the comparison and selection of dimensionality reduction methods in the field of unsupervised learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v70i.13890"
    },
    {
        "id": 16767,
        "title": "NMPC in active subspaces: Dimensionality reduction with recursive feasibility guarantees",
        "authors": "Guanru Pan, Timm Faulwasser",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.automatica.2022.110708"
    },
    {
        "id": 16768,
        "title": "High-Dimensional Smoothed Entropy Estimation via Dimensionality Reduction",
        "authors": "Kristjan Greenewald, Brian Kingsbury, Yuancheng Yu",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isit54713.2023.10206641"
    },
    {
        "id": 16769,
        "title": "Multispectral Image Segmentation With Dimensionality Reduction Using Autoencoders",
        "authors": "Eliton Albuquerque, Claudio R. Jung",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sibgrapi59091.2023.10347038"
    },
    {
        "id": 16770,
        "title": "Semanformer: Semantics-aware Embedding Dimensionality Reduction Using Transformer-Based Models",
        "authors": "Mallika Boyapati, Ramazan Aygun",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc59802.2024.00027"
    },
    {
        "id": 16771,
        "title": "Wind turbine fault detection: a semi-supervised learning approach with two different dimensionality reduction techniques",
        "authors": "Fernando P.G. d, e Sá, Rafaelli d, e C. Coutinho, Eduardo Ogasawara, Diego Brand�ã, N.A. o, Rodrigo F. Toso",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijica.2023.129359"
    },
    {
        "id": 16772,
        "title": "Comparison of dimensionality reduction techniques for multi-variable spatiotemporal flow fields",
        "authors": "Zihao Wang, Guiyong Zhang, Xiuqing Xing, Xiangguo Xu, Tiezhi Sun",
        "published": "2024-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.116421"
    },
    {
        "id": 16773,
        "title": "Supervised dimensionality reduction for multi-dimensional classification",
        "authors": "BinBin JIA, MinLing ZHANG",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1360/ssi-2022-0363"
    },
    {
        "id": 16774,
        "title": "Efficient Dimensionality Reduction Strategies for Quantum Reinforcement Learning",
        "authors": "Eva Andrés, M. P. Cuéllar, G. Navarro",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3318173"
    },
    {
        "id": 16775,
        "title": "Experiments with Dimensionality Reduction on Chest X-Ray Images",
        "authors": "Anca Ignat",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.10.336"
    },
    {
        "id": 16776,
        "title": "Timely detection of DDoS attacks in IoT with dimensionality reduction",
        "authors": "Pooja Kumari, Ankit Kumar Jain",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10586-024-04392-9"
    },
    {
        "id": 16777,
        "title": "Dimensionality reduction methods for SAR target recognition",
        "authors": "Benjamin P. Lewis, Matthew Scherreik",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2661102"
    },
    {
        "id": 16778,
        "title": "Exploring Dimensionality Reduction Techniques for Deep Learning Driven QSAR Models of Mutagenicity",
        "authors": "Alexander D. Kalian, Emilio Benfenati, Olivia J. Osborne, David Gott, Claire Potter, Jean-Lou C. M. Dorne, Miao Guo, Christer Hogstrand",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "Dimensionality reduction techniques are crucial for enabling deep learning driven quantitative structure-activity relationship (QSAR) models to navigate higher dimensional toxicological spaces, however the use of specific techniques is often arbitrary and poorly explored. Six dimensionality techniques (both linear and non-linear) were hence applied to a higher dimensionality mutagenicity dataset and compared in their ability to power a simple deep learning driven QSAR model, following grid searches for optimal hyperparameter values. It was found that comparatively simpler linear techniques, such as principal component analysis (PCA), were sufficient for enabling optimal QSAR model performances, which indicated that the original dataset was at least approximately linearly separable (in accordance with Cover’s theorem). However certain non-linear techniques such as kernel PCA and autoencoders performed at closely comparable levels, while (especially in the case of autoencoders) being more widely applicable to potentially non-linearly separable datasets. Analysis of the chemical space, in terms of XLogP and molecular weight, uncovered that the vast majority of testing data occurred within the defined applicability domain, as well as that certain regions were measurably more problematic and antagonised performances. It was however indicated that certain dimensionality reduction techniques were able to facilitate uniquely beneficial navigations of the chemical space.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/toxics11070572"
    },
    {
        "id": 16779,
        "title": "Investigating the Performance Impact of Dimensionality Reduction on Word Vectors",
        "authors": "Didier Gohourou, Kazuhiro Kuwabara",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iiai-aai59060.2023.00070"
    },
    {
        "id": 16780,
        "title": "nPCA: a linear dimensionality reduction method using a multilayer perceptron",
        "authors": "Juzeng Li, Yi Wang",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "Background: Linear dimensionality reduction techniques are widely used in many applications. The goal of dimensionality reduction is to eliminate the noise of data and extract the main features of data. Several dimension reduction methods have been developed, such as linear-based principal component analysis (PCA), nonlinear-based t-distributed stochastic neighbor embedding (t-SNE), and deep-learning-based autoencoder (AE). However, PCA only determines the projection direction with the highest variance, t-SNE is sometimes only suitable for visualization, and AE and nonlinear methods discard the linear projection.Results: To retain the linear projection of raw data and generate a better result of dimension reduction either for visualization or downstream analysis, we present neural principal component analysis (nPCA), an unsupervised deep learning approach capable of retaining richer information of raw data as a promising improvement to PCA. To evaluate the performance of the nPCA algorithm, we compare the performance of 10 public datasets and 6 single-cell RNA sequencing (scRNA-seq) datasets of the pancreas, benchmarking our method with other classic linear dimensionality reduction methods.Conclusion: We concluded that the nPCA method is a competitive alternative method for dimensionality reduction tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fgene.2023.1290447"
    },
    {
        "id": 16781,
        "title": "Analyzing Feature Selection and Dimensionality Reduction for Big Data",
        "authors": "Ashish Bishnoi, Feon Jaison, Durgesh Wadhwa",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470927"
    },
    {
        "id": 16782,
        "title": "Data Driven Dimensionality Reduction to Improve Modeling Performance",
        "authors": "Joshua Chung, Marcos López de Prado, Horst Simon, Kesheng Wu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4485887"
    },
    {
        "id": 16783,
        "title": "Efficient Aerodynamic Topology Optimization for Supersonic Airfoil using Dimensionality Reduction Methods",
        "authors": "Kenya Hirose, Kohei Suzuki, Wataru Yamazaki",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-1406"
    },
    {
        "id": 16784,
        "title": "Performance-Guaranteed Dimensionality Reduction of Large-Scale Data for Adaptive Filtering",
        "authors": "Sang Mok Jung",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iecon51785.2023.10311625"
    },
    {
        "id": 16785,
        "title": "Effect of Dimensionality Reduction on Uncertainty Quantification in Trustworthy Machine Learning",
        "authors": "Yen-Chen Li, Justin Zhan",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlc58545.2023.10327953"
    },
    {
        "id": 16786,
        "title": "Principal Component Analysis of Aviation Noise Grids for Dimensionality Reduction",
        "authors": "Ameya Behere, Dimitri N. Mavris",
        "published": "2023-1-23",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-0794"
    },
    {
        "id": 16787,
        "title": "Comparison of Data Visualization, Outlier Detection and Data Dimensionality Reduction Methods",
        "authors": "Xingyu Zhao",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "With the deepening of the digital age of information, people's daily data is getting larger and larger, and it is more and more difficult to quantify and process. At this time, the data processing means becomes particularly important. This paper compares and analyzes some methods from data visualization to data dimensionality reduction to outlier detection. In this paper, two different types of datasets, ModelNet40, and red wine quality, are used to introduce the visualization method of the Farthest Point Sampling (FPS). This method can have a clear visual effect on the data dimension and scale, and allow users to observe the structure, type, and scale of the data. In data dimensionality reduction, the study uses Principal Component Analysis (PCA), T-Distributed Stochastic Neighbor Embedding (t-SNE), Triplets Manifold Approximation and Projection (TriMAP), Uniform Manifold Approximation and Projection (UMAP), Pairwise Controlled Manifold Approximation Projection (PaCMAP), and Autoencoder to compare their dimensionality reduction effects. Through these methods, this paper finds that different methods have different effects on different datasets. Therefore, in data dimensionality reduction, it can get twice the result with half the effort by choosing the appropriate method. Finally, this paper also detects outliers. Outliers in datasets will make it difficult for people to process data and make subsequent results inaccurate, so it is necessary to identify outliers. This paper involves methods such as isolation forest and Density-Based Spatial Clustering of Applications with Noise (DBSCAN). Through this paper, the methods of different datasets are analyzed and summarized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/wgchmc87"
    },
    {
        "id": 16788,
        "title": "Dimensionality Reduction Methods Using VAE for Deep Reinforcement Learning of Autonomous Driving",
        "authors": "Yuta Uehara, Susumu Matumae",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/candarw60564.2023.00064"
    },
    {
        "id": 16789,
        "title": "Manifold Learning of Nonlinear Airfoil Aerodynamics with Dimensionality Reduction",
        "authors": "Srikanth Vasudevan, Roeland De Breuker, Xuerui Wang",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-1199"
    },
    {
        "id": 16790,
        "title": "Fitness Landscape Approximation with Dimensionality Reduction Using Multi-dimensional Scaling",
        "authors": "Ying Zhao, Jun Yu, Yan Pei",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394604"
    },
    {
        "id": 16791,
        "title": "On varimax asymptotics in network models and spectral methods for dimensionality reduction",
        "authors": "J Cape",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "Abstract\nVarimax factor rotations, while popular among practitioners in psychology and statistics since being introduced by Kaiser (1958), have historically been viewed with skepticism and suspicion by some theoreticians and mathematical statisticians. Now, work by Rohe & Zeng (2023) provides new, fundamental insight: varimax rotations provably perform statistical estimation in certain classes of latent variable models when paired with spectral-based matrix truncations for dimensionality reduction. We build on this new-found understanding of varimax rotations by developing further connections to network analysis and spectral methods rooted in entrywise matrix perturbation analysis. Concretely, this paper establishes the asymptotic multivariate normality of vectors in varimax-transformed Euclidean point clouds that represent low-dimensional node embeddings in certain latent space random graph models. We address related concepts including network sparsity, data denoising and the role of matrix rank in latent variable parameterizations. Collectively, these findings, at the confluence of classical and contemporary multivariate analysis, reinforce methodology and inference procedures grounded in matrix factorization-based techniques. Numerical examples illustrate our findings and supplement our discussion.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/biomet/asad061"
    },
    {
        "id": 16792,
        "title": "Feature dimensionality reduction via homological properties of observability",
        "authors": "Marcello Trovati, Eslam Farsimadan",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractFeature selection and its subsequent dimensionality reduction are significant problems in machine learning and it is at the core of several data science techniques. The ‘shape’ of data, or in other words its related topological properties, can provide crucial insights into the corresponding data types and sources and it enables the identification of general properties that facilitate its analysis and assessment. In this article, we discuss an information theoretic approach combined with data homological properties to assess dimensionality reduction, which can be applied to semantic feature selection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12530-023-09535-8"
    },
    {
        "id": 16793,
        "title": "Dimensionality reduction for images of IoT using machine learning",
        "authors": "Ibrahim Ali, Khaled Wassif, Hanaa Bayomi",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "AbstractSensors, wearables, mobile devices, and other Internet of Things (IoT) devices are becoming increasingly integrated into all aspects of our lives. They are capable of gathering enormous amounts of data, such as image data, which can then be sent to the cloud for processing. However, this results in an increase in network traffic and latency. To overcome these difficulties, edge computing has been proposed as a paradigm for computing that brings processing closer to the location where data is produced. This paper explores the merging of cloud and edge computing for IoT and investigates approaches using machine learning for dimensionality reduction of images on the edge, employing the autoencoder deep learning-based approach and principal component analysis (PCA). The encoded data is then sent to the cloud server, where it is used directly for any machine learning task without significantly impacting the accuracy of the data processed in the cloud. The proposed approach has been evaluated on an object detection task using a set of 4000 images randomly chosen from three datasets: COCO, human detection, and HDA datasets. Results show that a 77% reduction in data did not have a significant impact on the object detection task’s accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-57385-4"
    },
    {
        "id": 16794,
        "title": "Analyzing Quality Measurements for Dimensionality Reduction",
        "authors": "Michael C. Thrun, Julian Märte, Quirin Stier",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "Dimensionality reduction methods can be used to project high-dimensional data into low-dimensional space. If the output space is restricted to two dimensions, the result is a scatter plot whose goal is to present insightful visualizations of distance- and density-based structures. The topological invariance of dimension indicates that the two-dimensional similarities in the scatter plot cannot coercively represent high-dimensional distances. In praxis, projections of several datasets with distance- and density-based structures show a misleading interpretation of the underlying structures. The examples outline that the evaluation of projections remains essential. Here, 19 unsupervised quality measurements (QM) are grouped into semantic classes with the aid of graph theory. We use three representative benchmark datasets to show that QMs fail to evaluate the projections of straightforward structures when common methods such as Principal Component Analysis (PCA), Uniform Manifold Approximation projection, or t-distributed stochastic neighbor embedding (t-SNE) are applied. This work shows that unsupervised QMs are biased towards assumed underlying structures. Based on insights gained from graph theory, we propose a new quality measurement called the Gabriel Classification Error (GCE). This work demonstrates that GCE can make an unbiased evaluation of projections. The GCE is accessible within the R package DR quality available on CRAN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5030056"
    },
    {
        "id": 16795,
        "title": "Optimal Dimensionality Reduction Method Based on Dynamic Equivalence",
        "authors": "Wei Shen, Jiaxin Tang, Hao Tang, Yuxiang Yuan, Yingxin Deng",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pandafpe57779.2023.10140528"
    },
    {
        "id": 16796,
        "title": "Compatibility of Clique Clustering Algorithm with Dimensionality Reduction",
        "authors": "",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18576/amis/170510"
    },
    {
        "id": 16797,
        "title": "Complex Data Prediction and Classification Methods based on Feature Selection and Data Dimensionality Reduction",
        "authors": "Niqin Jing, Jiaxin Wang",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170742"
    },
    {
        "id": 16798,
        "title": "A comparative analysis of dimensionality reduction surrogate modeling techniques for full human body finite element impact simulations",
        "authors": "Lance Frazer, Vivek Kote, Zachary Hostetler, Matthew Davis, Daniel P. Nicolella",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10255842.2023.2236747"
    },
    {
        "id": 16799,
        "title": "IMPROVING THE DIMENSIONALITY REDUCTION OF PCA USING BIVARIATE COPULAS",
        "authors": "Karima Femmam, Smain Femmam",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17654/0972361723015"
    },
    {
        "id": 16800,
        "title": "Pareto-Based Dimensionality Reduction of Parameters in DC/DC Converters",
        "authors": "Ryunosuke Numata, Toshimichi Saito",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itc-cscc58803.2023.10212700"
    },
    {
        "id": 16801,
        "title": "Enhancement of PCA-Based Dimensionality Reduction Using BB-BC Optimization Algorithm",
        "authors": "Supreet Kaur, C. Rama Krishna, Shakti Kumar, Jasmeet Singh",
        "published": "2023-5-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iiphdw54739.2023.10124414"
    },
    {
        "id": 16802,
        "title": "Adaptive Nonlinear Dimensionality Reduction with a Local Metric",
        "authors": "Jun Yao, Huanhuan Chen",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3628797.3628866"
    },
    {
        "id": 16803,
        "title": "Real-Time Human Activity Recognition Using Dimensionality Reduction in Wireless Multimedia Sensor Networks",
        "authors": "Adnan Yazici, Serik Almakhan, Enver Ever",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437979"
    },
    {
        "id": 16804,
        "title": "Comparing dimensionality reduction techniques for visual analysis of the LSTM hidden activity on multi-dimensional time series modeling",
        "authors": "Lianen Ji, Shirong Qiu, Zhi Xu, Yue Liu, Guang Yang",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00371-023-03235-9"
    },
    {
        "id": 16805,
        "title": "Design-Space Dimensionality Reduction in Structural Optimization via Parametric Model Embedding",
        "authors": "M. Diez, A. Serani, F. Stern, R. Pellegrini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/marine.2023.054"
    },
    {
        "id": 16806,
        "title": "Improving Classification Performance with Statistically Weighted Dimensions and Dimensionality Reduction",
        "authors": "Uraiwan Buatoom, Muhammad Usman Jamil",
        "published": "2023-2-3",
        "citations": 4,
        "abstract": "In image classification, various techniques have been developed to enhance the performance of principal component analysis (PCA) dimension reduction techniques with guiding weighting features to remove redundant and irrelevant features. This study proposes the statistically weighted dimension technique based on three distribution-related class behaviors; collection-class, inter-class, and intra-class to enhance the feature-extraction ability before using PCA for feature selection. The data from the statistics-weighted dimension spaces is utilized to reduce dimensionality by reducing the large index data into smaller index data using PCA. The new principal component from the weighted training part by an unlabeled dataset is constructed and then the image is classified efficiently. Additionally, the weighting direction investigates the pros and cons of promoting and demoting to determine the worst or best option utilizing the exponents of three proposed weighted scheme. The experiment is conducted using three datasets, MNIST, E-MNIST, and F-MNIST, along with three image classification algorithms, logistic Regression, KNN, and SVM (RBF). The results clearly demonstrate that the statistically weighted dimension feature can improve the conventional classification accuracy in lower dimensions with an appropriate combination of weighting nearly 3% for the best solution on dimensionality reduction by more than 50%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13032005"
    },
    {
        "id": 16807,
        "title": "Application research of SGD algorithm based on PCA dimensionality reduction technique for stock price prediction",
        "authors": "Shutong Ji",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00054"
    },
    {
        "id": 16808,
        "title": "Interpretation and Hierarchical methods for Dimensionality Reduction",
        "authors": "Wilson E. Marcílio-Jr, Danilo M. Eler",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "High-dimensional data analysis is a ubiquitous task in practical and research activities. Dimensionality Reduction (DR) techniques are usually employed as they map highdimensional data to lower spaces and allow for knowledge discovery. This thesis focuses on the interpretability and representation aspects of non-linear DR approaches’ output, such as t-SNE and UMAP. That is, we propose methods for interpreting and hierarchically learning embeddings. To accomplish these goals, the following main research activities were carried out, representing separate but interconnected works: (1) a sampling method in visual space (R2) that can preserve class boundary structures while keeping outliers visible; (2) a technique for understanding cluster formation by leveraging statistical tests on the feature values after dimensionality reduction; (3) we advance the state-of-the-art by adapting SHAP to explain cluster formation after dimensionality reduction; (4) a novel hierarchical DR technique that employs an adaptive kernel for global/local neighborhood learning while preserving context across embeddings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5753/sibgrapi.est.2023.27456"
    },
    {
        "id": 16809,
        "title": "Dimensionality reduction of chaos by feedbacks and periodic forcing is a source of natural climate change",
        "authors": "Phil Salmon",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00382-024-07191-5"
    },
    {
        "id": 16810,
        "title": "Design Thinking Approach for Dimensionality Reduction using Ensemble Gradient Boosting Algorithm",
        "authors": "N. Selva Kumar, D. Kalaivani",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220873"
    },
    {
        "id": 16811,
        "title": "Intrinsic-Dimension Analysis for Guiding Dimensionality Reduction in Multi-Omics Data",
        "authors": "Valentina Guarino, Jessica Gliozzo, Ferdinando Clarelli, Béatrice Pignolet, Kaalindi Misra, Elisabetta Mascia, Giordano Antonino, Silvia Santoro, Laura Ferré, Miryam Cannizzaro, Melissa Sorosina, Roland Liblau, Massimo Filippi, Ettore Mosca, Federica Esposito, Giorgio Valentini, Elena Casiraghi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011775200003414"
    },
    {
        "id": 16812,
        "title": "Improve the efficiency of network traffic in IoT using dimensionality reduction",
        "authors": "Ibrahim Ali Mohamed, Khaled Wassif, Hanaa Bayomi",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icci61671.2024.10485077"
    },
    {
        "id": 16813,
        "title": "A Hybrid Dimensionality Reduction for Network Intrusion Detection",
        "authors": "Humera Ghani, Shahram Salekzamankhani, Bal Virdee",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "Due to the wide variety of network services, many different types of protocols exist, producing various packet features. Some features contain irrelevant and redundant information. The presence of such features increases computational complexity and decreases accuracy. Therefore, this research is designed to reduce the data dimensionality and improve the classification accuracy in the UNSW-NB15 dataset. It proposes a hybrid dimensionality reduction system that does feature selection (FS) and feature extraction (FE). FS was performed using the Recursive Feature Elimination (RFE) technique, while FE was accomplished by transforming the features into principal components. This combined scheme reduced a total of 41 input features into 15 components. The proposed systems’ classification performance was determined using an ensemble of Support Vector Classifier (SVC), K-nearest Neighbor classifier (KNC), and Deep Neural Network classifier (DNN). The system was evaluated using accuracy, detection rate, false positive rate, f1-score, and area under the curve metrics. Comparing the voting ensemble results of the full feature set against the 15 principal components confirms that reduced and transformed features did not significantly decrease the classifier’s performance. We achieved 94.34% accuracy, a 93.92% detection rate, a 5.23% false positive rate, a 94.32% f1-score, and a 94.34% area under the curve when 15 components were input to the voting ensemble classifier.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jcp3040037"
    },
    {
        "id": 16814,
        "title": "Selective HybridNET: Spectral-Spatial Dimensionality Reduction for HSI Classification",
        "authors": "Md. Rashedul Islam, Md. Touhid Islam, Md. Sohrawordi",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecce57851.2023.10101534"
    },
    {
        "id": 16815,
        "title": "Labelled Feature Dimensionality Reduction for Liver Disorder Classification in CT Liver Images",
        "authors": "Venkateswarlu Gavini, G.R. Jothi Lakshmi",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssit55814.2023.10060921"
    },
    {
        "id": 16816,
        "title": "Factor Graph Dimensionality Reduction using Lateral Motion Constraints for Aided Dead Reckoning Navigation",
        "authors": "Adam Rutkowski, Yetong Zhang, Frank Dellaert",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/plans53410.2023.10140049"
    },
    {
        "id": 16817,
        "title": "Dimensionality Reduction of Multivariate Images Using the Linear &amp; Nonlinear Approach",
        "authors": "Amit R. Pathare, Atul S. Joshi",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicct56244.2023.10110258"
    },
    {
        "id": 16818,
        "title": "Dimensionality Reduction on Fish Dataset with Different Machine Learning Algorithms Comparison",
        "authors": "Sugunadevi C, Roshni M Balakrishnan",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10389924"
    },
    {
        "id": 16819,
        "title": "Denoising and Dimensionality Reduction for Improving Constrained Energy Minimization in Hyperspectral Imagery Analysis",
        "authors": "Shen-En Qian, Guang Yi Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "A new hyperspectral objects detection method is presented. It adaptively reduces noises of a hyperspectral image followed by dimensionality reduction before generating a Constrained Energy Minimization (CEM) map for detection. Experimental results show that the method improves CEM detection accuracy significantly for tested hyperspectral images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/hmise.2023.hw5c.2"
    },
    {
        "id": 16820,
        "title": "Enhancing Texture Classification through GLCM and LBP Feature Extraction with Modified PCA Dimensionality Reduction",
        "authors": "Supriya Bagewadi, Sachinkumar Veerashetty",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353480"
    },
    {
        "id": 16821,
        "title": "Gradient-Based Dimensionality Reduction for Speech Emotion Recognition Using Deep Networks",
        "authors": "Hongxuan Wang, Prahlad Vadakkepat",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447616"
    },
    {
        "id": 16822,
        "title": "Power Theory Based Dimensionality Reduction for Fault Detection and Identification in Power Electronics",
        "authors": "Daniel Vahle, Christian Vorobev, Volker Staudt",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eurocon56442.2023.10198993"
    },
    {
        "id": 16823,
        "title": "Research on Computational Methods and Algorithms for  Dimensionality Reduction and Feature Selection in High-Dimensional Data",
        "authors": "",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33168/jliss.2023.0301"
    },
    {
        "id": 16824,
        "title": "Word Embedding of Dimensionality Reduction for Document Clustering",
        "authors": "Pengyu Zhu, Qi Lang, Xiaodong Liu",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10327354"
    },
    {
        "id": 16825,
        "title": "Dimensionality Reduction Using Optimized Self-Organized Map Technique for Hyperspectral Image Classification",
        "authors": "S. Srinivasan, K. Rajakumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.040817"
    },
    {
        "id": 16826,
        "title": "Fuzzy-rough hybrid dimensionality reduction",
        "authors": "Zhihong Wang, Hongmei Chen, Zhong Yuan, Tianrui Li",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.fss.2022.08.004"
    },
    {
        "id": 16827,
        "title": "Specific Emitter Identification with Principal Component Analysis (PCA) Dimensionality Reduction and Convolutional Neural Network",
        "authors": "Gianmarco Baldini, Fausto Bonavitacola",
        "published": "2023-7-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10215809"
    },
    {
        "id": 16828,
        "title": "Semi-Supervised Graph Learning Meets Dimensionality Reduction",
        "authors": "Alex Morehead, Watchanan Chantapakul, Jianlin Cheng",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00303"
    },
    {
        "id": 16829,
        "title": "Dimensionality Reduction Technique for Hyperspectral Remote Sensing Image Classification",
        "authors": "Golla Aishwarya, B.L.N Phaneendra Kumar, Dokku Syamala, Nagubandi Sai Sreya",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192744"
    },
    {
        "id": 16830,
        "title": "Hensel’s Compression-Based Dimensionality Reduction Approach for Privacy Protection in Federated Learning",
        "authors": "Ahmed El Ouadrhiri, Ahmed Abdelhadi, Phu H. Phung",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074197"
    },
    {
        "id": 16831,
        "title": "Dimensionality reduction for regional flood frequency analysis: Linear versus nonlinear methods",
        "authors": "K. Haddad, A. Rahman",
        "published": "2023-4",
        "citations": 2,
        "abstract": "AbstractRegional flood frequency analysis is still an important area of hydrology research as there are many ungauged catchments. The majority of hydrological methods in regional flood frequency analysis involve complex non‐linear relationships between predictor variables and flood characteristics. In the past, dimensionality reduction techniques based on linear methods such as canonical correlation analysis (CCA) were used in regional flood frequency analysis to delineate hydrological clusters. Non‐linear dimensionality reduction techniques, such as KCCA and multidimensional scaling (MDS), have been used in several fields of science, but not explicitly in regional flood frequency analysis. To determine hydrologically similar clusters, the approaches considered in this article use CCA, KCCA, and MDS as dimensionality reduction techniques in conjunction with Gaussian mixture models (GMM). Log‐linear regression and generalized additive models are then applied to the hydrological clusters to evaluate regional flood frequency analysis. A comparison of linear and non‐linear (NL) methods is performed using data from Victoria, Australia, to demonstrate the benefit of these methods. It has been found that the non‐linear frameworks of multi‐dimensional scaling with Gaussian mixture model‐non‐linear (MDSGMM‐NL) and KCCA with Gaussian mixture model‐non‐linear (KCCAGMM‐NL), as well as the mixed frameworks (i.e. KCCA and Gaussian mixture model‐non‐linear [CCAGMM‐NL]), can be used to represent the non‐linear complexities of hydrological processes in regional flood frequency analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/hyp.14864"
    },
    {
        "id": 16832,
        "title": "Linear and nonlinear dimensionality reduction from fluid mechanics to machine learning",
        "authors": "Miguel A Mendez",
        "published": "2023-4-1",
        "citations": 7,
        "abstract": "Abstract\nDimensionality reduction is the essence of many data processing problems, including filtering, data compression, reduced-order modeling and pattern analysis. While traditionally tackled using linear tools in the fluid dynamics community, nonlinear tools from machine learning are becoming increasingly popular. This article, halfway between a review and a tutorial, introduces a general framework for linear and nonlinear dimensionality reduction techniques. Differences and links between autoencoders and manifold learning methods are highlighted, and popular nonlinear techniques such as kernel principal component analysis, isometric feature learning and locally linear embedding are placed in this framework. These algorithms are benchmarked in three classic problems: (a) filtering, (b) identification of oscillatory patterns, and (c) data compression. Their performances are compared against the traditional proper orthogonal decomposition to provide a perspective on their diffusion in fluid dynamics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6501/acaffe"
    },
    {
        "id": 16833,
        "title": "Towards an Improved High-Throughput Phenotyping Approach: Utilizing MLRA and Dimensionality Reduction Techniques for Transferring Hyperspectral Proximal-Based Model to Airborne Images",
        "authors": "Ramin Heidarian Dehkordi, Gabriele Candiani, Francesco Nutini, Federico Carotenuto, Beniamino Gioli, Carla Cesaraccio, Mirco Boschetti",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "At present, it is critical to accurately monitor wheat crops to help decision-making processes in precision agriculture. This research aims to retrieve various wheat crop traits from hyperspectral data using machine learning regression algorithms (MLRAs) and dimensionality reduction (DR) techniques. This experiment was conducted in an agricultural field in Arborea, Oristano-Sardinia, Italy, with different factors such as cultivars, N-treatments, and soil ploughing conditions. Hyperspectral data were acquired on the ground using a full-range Spectral Evolution spectrometer (350–2500 nm). Four DR techniques, including (i) variable influence on projection (VIP), (ii) principal component analysis (PCA), (iii) vegetation indices (VIs), and (iv) spectroscopic feature (SF) calculation, were undertaken to reduce the dimension of the hyperspectral data while maintaining the information content. We used five MLRA models, including (i) partial least squares regression (PLSR), (ii) random forest (RF), (iii) support vector regression (SVR), (iv) Gaussian process regression (GPR), and (v) neural network (NN), to retrieve wheat traits at either leaf and canopy levels. The studied traits were leaf area index (LAI), leaf and canopy water content (LWC and CWC), leaf and canopy chlorophyll content (LCC and CCC), and leaf and canopy nitrogen content (LNC and CNC). MLRA models were able to accurately retrieve wheat traits at the canopy level with PLSR and NN indicating the highest modelling performance. On the contrary, MLRA models indicated less accurate retrievals of the leaf-level traits. DR techniques were found to notably improve the retrieval accuracy of crop traits. Furthermore, the generated models were re-calibrated using soil spectra and then transferred to an airborne dataset collected using a CASI-SASI hyperspectral sensor, allowing the estimation of wheat traits across the entire field. The predicted crop trait maps illustrated consistent patterns while also preserving the real-field characteristics well. Lastly, a statistical paired t-test was undertaken to conduct a proof of concept of wheat phenotyping analysis considering the different agricultural variables across the study site. N-treatment caused significant differences in wheat crop traits in many instances, whereas the observed differences were less pronounced between the cultivars. No particular impact of soil ploughing conditions on wheat crop characteristics was found. Using such combinations of MLRA and DR techniques based on hyperspectral data can help to effectively monitor crop traits throughout the cropping seasons and can also be readily applied to other agricultural settings to help both precision farming applications and the implementation of high-throughput phenotyping solutions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs16030492"
    },
    {
        "id": 16834,
        "title": "direpack: A Python 3 package for state-of-the-art statistical dimensionality reduction methods",
        "authors": "Emmanuel Jordy Menvouta, Sven Serneels, Tim Verdonck",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.softx.2022.101282"
    },
    {
        "id": 16835,
        "title": "Transfomer Based Hyperspectral Dimensionality Reduction with Gabor Kernel CNN for Feature Extraction",
        "authors": "Harshula Tulapurkar, B Krishna Mohan, Biplab Banerjee",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282316"
    },
    {
        "id": 16836,
        "title": "Dimensionality reduction strategy for Multi-Target Regression paradigm",
        "authors": "D. Senthilkumar, A.K. Reshmy, S. Paulraj",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "Multi-Target Regression (MTR) is used to study the relationship between the same set of input variables and multiple continuous target variables simultaneously. A dataset with many input and output variables is the prime issue to address in the MTR, which is computationally complex to build a prediction model. Also, dimensionality reduction from multiple target variables is a challenging and essential task that aims to reduce the size of the dataset to optimize the time complexity of analysis and remove the redundant and irrelevant variables. This paper proposes an efficient feature selection strategy, Multi-Target Feature Subset Selection (MTFSS), for MTR that constructs a unique subset of features by considering multiple targets. On the other hand, two feature evaluators, correlation and ReliefF, support the MTR dataset without discretization. Furthermore, two new score functions, weighted mean aggregation strategy and threshold function, are introduced to identify the significant features. To evaluate the effectiveness of the proposed MTFSS, experiments were carried out on a benchmark dataset. The experimental results demonstrate that the proposed MTFSS can select fewer features and perform better than the original dataset results. Also, the correlation-based feature evaluator performs better than ReliefF with better performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-220412"
    },
    {
        "id": 16837,
        "title": "Dimensionality reduction using elastic measures",
        "authors": "J. Derek Tucker, Matthew T. Martinez, Jose M. Laborde",
        "published": "2023-1",
        "citations": 0,
        "abstract": "With the recent surge in big data analytics for hyperdimensional data, there is a renewed interest in dimensionality reduction techniques. In order for these methods to improve performance gains and understanding of the underlying data, a proper metric needs to be identified. This step is often overlooked, and metrics are typically chosen without consideration of the underlying geometry of the data. In this paper, we present a method for incorporating elastic metrics into the t‐distributed stochastic neighbour embedding (t‐SNE) and Uniform Manifold Approximation and Projection (UMAP). We apply our method to functional data, which is uniquely characterized by rotations, parameterization and scale. If these properties are ignored, they can lead to incorrect analysis and poor classification performance. Through our method, we demonstrate improved performance on shape identification tasks for three benchmark data sets (MPEG‐7, Car data set and Plane data set of Thankoor), where we achieve 0.77, 0.95 and 1.00 F1 score, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/sta4.551"
    },
    {
        "id": 16838,
        "title": "DREiMac: Dimensionality Reduction with\nEilenberg-MacLane Coordinates",
        "authors": "Jose A. Perea, Luis Scoccola, Christopher J. Tralie",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21105/joss.05791"
    },
    {
        "id": 16839,
        "title": "Ensemble based Dimensionality Reduction for Intrusion Detection using Random Forest in Wireless Networks",
        "authors": "S. Suhana, S. Karthic, N. Yuvaraj",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssit55814.2023.10060929"
    },
    {
        "id": 16840,
        "title": "Comparison of dimensionality reduction methods and evaluation of prediction effect based on cardiovascular disease data",
        "authors": "Shuyue Jing",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "Cardiovascular diseases have become the leading cause of death in the world, and the mortality rate caused by them is still on the rise, which is a major challenge facing the world. In the study of cardiovascular diseases, there are many kinds and quantities of factors leading to the disease, so how to screen more effective factors for research and accurate prediction is an important problem. The aim of this study is to conduct an in-depth comparative analysis of multiple dimensionality reduction methods for cardiovascular disease data. This paper evaluates the results produced by various dimensionality reduction methods and models, and uses Accuracy Rate, Confusion Matrix and Area Under Curve (AUC) and other indicators to evaluate their prediction effects. The study finds that the decision tree model has the best performance and is superior to LDA linear discriminant analysis in terms of accuracy and data dimension. The principal component analysis method is relatively complex, although it can effectively reduce the data dimension, its accuracy in forecasting decreases, and this method is not conducive to horizontal and vertical comparison and the accumulation of statistical data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/27/20240731"
    },
    {
        "id": 16841,
        "title": "A Modified LSTM Neural Network Based on Boosting and Sufficient Dimensionality Reduction",
        "authors": "Zhikun Chen, Shixuan Lin, Xinrui Kou",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "Stock price prediction is a common scenario in time series data forecasting, providing effective guidance for investment decisions. Long Short-Term Memory (LSTM) is a widely used model for stock price prediction, yet the selection of its hyperparameters remains an unresolved issue. In this paper, we address this challenge by employing model averaging instead of model selection. Specifically, we adaptively solve the hyperparameter selection problem by utilizing a distance covariance-weighted method, effectively balancing the bias and variance of the predictive model. Additionally, we propose an enhanced model that employs a boosting approach based on sufficiently reducing dimensionality through a multifactor model. This approach captures stock price sequence information beyond volatility. Practical data analysis demonstrates that the proposed method exhibits significant advantages over the original LSTM model in terms of mean square error or absolute error. Furthermore, the proposed framework can be applied to hyperparameter selection in other time series prediction models, such as autoregressive integrated moving averages (ARIMA), including the selection of autoregressive and partial autocorrelation orders.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/n5msag36"
    },
    {
        "id": 16842,
        "title": "Dimensionality reduction of large datasets with explicit feature maps",
        "authors": "Deena P. Francis, Kumudha Raimond, G. Jaspher W. Kathrine",
        "published": "2023-5-15",
        "citations": 1,
        "abstract": "Learning algorithms are often equipped with kernels that enable them to deal with non-linearities in the data, which ensures increased performance in practice. However, traditional kernel based methods suffer from the problem of scalability. As a workaround, explicit kernel maps have been proposed in the past. Previously for the task of streaming Kernel Principal Component Analysis (KPCA), an explicit kernel map has been combined with a matrix sketching technique to obtain scalable dimensionality reduction (DR) algorithm. This algorithm is limited by two issues, both pertaining to the explicit kernel map and the matrix sketching algorithms respectively. As a solution, two new scalable DR algorithms called ECM-SKPCA and Euler-SKPCA are proposed. The efficacy of the proposed algorithms as scalable DR algorithms is demonstrated via the task of classification with many publicly available datasets. The results indicate that the proposed algorithms produce more effective features than the previous algorithm for the classification task. Furthermore, ECM-SKPCA is also demonstrated to be much faster than all other algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/idt-220182"
    },
    {
        "id": 16843,
        "title": "High-Dimensional Expensive Optimization by Classification-based Multiobjective Evolutionary Algorithm with Dimensionality Reduction",
        "authors": "Yuma Horaguchi, Masaya Nakata",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/sice59929.2023.10354103"
    },
    {
        "id": 16844,
        "title": "Nonlinear dimensionality reduction with q-Gaussian distribution",
        "authors": "Motoshi Abe, Yuichiro Nomura, Takio Kurita",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractIn recent years, the dimensionality reduction has become more important as the number of dimensions of data used in various tasks such as regression and classification has increased. As popular nonlinear dimensionality reduction methods, t-distributed stochastic neighbor embedding (t-SNE) and uniform manifold approximation and projection (UMAP) have been proposed. However, the former outputs only one low-dimensional space determined by the t-distribution and the latter is difficult to control the distribution of distance between each pair of samples in low-dimensional space. To tackle these issues, we propose novel t-SNE and UMAP extended by q-Gaussian distribution, called q-Gaussian-distributed stochastic neighbor embedding (q-SNE) and q-Gaussian-distributed uniform manifold approximation and projection (q-UMAP). The q-Gaussian distribution is a probability distribution derived by maximizing the tsallis entropy by escort distribution with mean and variance, and a generalized version of Gaussian distribution with a hyperparameter q. Since the shape of the q-Gaussian distribution can be tuned smoothly by the hyperparameter q, q-SNE and q-UMAP can in- tuitively derive different embedding spaces. To show the quality of the proposed method, we compared the visualization of the low-dimensional embedding space and the classification accuracy by k-NN in the low-dimensional space. Empirical results on MNIST, COIL-20, OliverttiFaces and FashionMNIST demonstrate that the q-SNE and q-UMAP can derive better embedding spaces than t-SNE and UMAP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-024-01210-1"
    },
    {
        "id": 16845,
        "title": "A Novel Crop Yield Prediction Using Deep Learning and Dimensionality Reduction",
        "authors": "Kandasamy Subramaniam Leelavathi, Marimuthu Rajasenathipathi",
        "published": "2024",
        "citations": 0,
        "abstract": "Crop yield prediction (CYP) at the field level is crucial in quantitative and economic assessment for creating agricultural commodities plans for import-export strategies and enhancing farmer incomes. Crop breeding has always required a significant amount of time and money. CYP is developed to forecast higher crop production. This paper proposes an efficient deep learning (DL) and dimensionality reduction (DR) approaches for CYP for Indian regional crops. This paper comprised ‘3’ phases: preprocessing, DR, and classification. Initially, the agricultural data of the south Indian region are collected from the dataset. Then preprocessing is applied to the collected dataset by performing data cleaning and normalization. After that, the DR is performed using squared exponential kernel-based principal component analysis (SEKPCA). Finally, CYP is based on a weight-tuned deep convolutional neural network (WTDCNN), which predicts the high crop yield profit. The simulation outcomes shows that the proposed method attains superior performance for CYP compared to exiting schemes with an improved accuracy of 98.96%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47857/irjms.2024.v05i01.0158"
    },
    {
        "id": 16846,
        "title": "Enhancing Extractive Text Summarization of Long Documents Using Features Dimensionality Reduction",
        "authors": "Amany A. Abdelrahman, Wafaa S. El-Kassas, Hoda K. Mohamed",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/miucc58832.2023.10278356"
    },
    {
        "id": 16847,
        "title": "Visualizing Feasible Regions for Optimization Problems on High-Dimensional Permutations using Dimensionality Reduction Methods",
        "authors": "Igor Grebennik, Olga Chorna, Inna Urniaieva",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acit58437.2023.10275497"
    },
    {
        "id": 16848,
        "title": "Unsupervised Acoustic Scene Mapping Based on Acoustic Features and Dimensionality Reduction",
        "authors": "Idan Cohen, Sharon Gannot, Ofir Lindenbaum",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447788"
    },
    {
        "id": 16849,
        "title": "Low-rank constraint based dual projections learning for dimensionality reduction",
        "authors": "Lin Jiang, Xiaozhao Fang, Weijun Sun, Na Han, Shaohua Teng",
        "published": "2023-3",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2022.108817"
    },
    {
        "id": 16850,
        "title": "Crossover Dimensionality Reduction and Multi-Branch Deep Learning for Enhanced Hyperspectral Image Classification",
        "authors": "Md. Touhid Islam, Md. Rashedul Islam",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eict61409.2023.10427647"
    },
    {
        "id": 16851,
        "title": "Machine learning approach for intrusion detection system using dimensionality reduction",
        "authors": "Deepa Manikandan, Jayaseelan Dhilipan",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "As cyberspace has emerged, security in all the domains like networks, cloud, and databases has become a greater concern in real-time distributed systems. Existing systems for detecting intrusions (IDS) are having challenges coping with constantly changing threats. The proposed model, DR-DBMS (dimensionality reduction in database management systems), creates a unique strategy that combines supervised machine learning algorithms, dimensionality reduction approaches and advanced rule-based classifiers to improve intrusion detection accuracy in terms of different types of attacks. According to simulation results, the DR-DBMS system detected the intrusion attack in 0.07 seconds and with a smaller number of features using the dimensionality reduction and feature selection techniques efficiently.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v34.i1.pp430-440"
    },
    {
        "id": 16852,
        "title": "Dimensionality Reduction and Visualization in Public Management Research from the Perspective of Algorithm Recommendation",
        "authors": "Jun Yu, Yichen Liu",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "With the development of computer technology, algorithm recommendation systems have been widely used in intelligent transportation, urban planning, and other fields. Aiming at the current problems in public management in China, this paper proposes a dimensionality reduction calculation method, and uses the improved particle swarm optimization algorithm to analyze and evaluate the dimensionality reduction process. With the expectation of providing some reference value and ideas for solving practical application problems, a corresponding relationship equation is established with the minimum expected value as the objective function to solve the corresponding optimal solution, the evaluation results of system performance indicators and comprehensive scoring criteria under relevant parameters and constraints are given. The test results show that the visualization effect of the dimensionality reduction visualization model for public management research based on the algorithm recommendation perspective is over 90%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v35i.7047"
    },
    {
        "id": 16853,
        "title": "Polyphonic Instrument Emotion Recognition using Stacked Auto Encoders: A Dimensionality Reduction Approach",
        "authors": "Sangeetha Rajesh, N J Nalini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.167"
    },
    {
        "id": 16854,
        "title": "Unlocking pyrite LA-ICP-MS trace elements: the power of dimensionality reduction using synergy between UMAP, PCA and k-Means clustering",
        "authors": "Yann mpaka Waku, Bjorn von der Heyden",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7185/gold2023.18873"
    },
    {
        "id": 16855,
        "title": "Dimensionality reduction as a non-cooperative game",
        "authors": "Hirotada Honda, Phuong Dinh, Pham Thu Thao, Yuho Tabata, Bui Duc Anh",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiic57133.2023.10067075"
    },
    {
        "id": 16856,
        "title": "MultiBEATS: Blocks of eigenvalues algorithm for multivariate time series dimensionality reduction",
        "authors": "Aurora González-Vidal, Antonio Martinez-Ibarra, Antonio F. Skarmeta",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2023.102159"
    },
    {
        "id": 16857,
        "title": "A Novel CNN Model with Dimensionality Reduction for WSN Intrusion Detection",
        "authors": "Ruqaya Abed Alhasan, Ekhlas Kadhum Hamza",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ria.370504"
    },
    {
        "id": 16858,
        "title": "Feature Selection and Dimensionality Reduction for Unbalanced Liver Disease Classification with Optimized Machine Learning Algorithms",
        "authors": "Abd Allah Aouragh, Mohamed Bahaj",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cist56084.2023.10409967"
    },
    {
        "id": 16859,
        "title": "Dimensionality Reduction on IoT Monitoring Data of Smart Building for Energy Consumption Forecasting",
        "authors": "Konstantinos Koutras, Agorakis Bompotas, Constantinos Halkiopoulos, Athanasios Kalogeras, Christos Alexakos",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isc257844.2023.10293689"
    },
    {
        "id": 16860,
        "title": "Two-Stage Dimensionality Reduction for Social Media Engagement Classification",
        "authors": "Jose Luis Vieira Sobrinho, Flavio Henrique Teles Vieira, Alisson Assis Cardoso",
        "published": "2024-2-3",
        "citations": 0,
        "abstract": "The high dimensionality of real-life datasets is one of the biggest challenges in the machine learning field. Due to the increased need for computational resources, the higher the dimension of the input data is, the more difficult the learning task will be—a phenomenon commonly referred to as the curse of dimensionality. Laying the paper’s foundation based on this premise, we propose a two-stage dimensionality reduction (TSDR) method for data classification. The first stage extracts high-quality features to a new subset by maximizing the pairwise separation probability, with the aim of avoiding overlap between individuals from different classes that are close to one another, also known as the class masking problem. The second stage takes the previous resulting subset and transforms it into a reduced final space in a way that maximizes the distance between the cluster centers of different classes while also minimizing the dispersion of instances within the same class. Hence, the second stage aims to improve the accuracy of the succeeding classifier by lowering its sensitivity to an imbalanced distribution of instances between different classes. Experiments on benchmark and social media datasets show how promising the proposed method is over some well-established algorithms, especially regarding social media engagement classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14031269"
    },
    {
        "id": 16861,
        "title": "Research on Intelligent Recognition Model of English Translation Based on Nonlinear Dimensionality Reduction IC Features",
        "authors": "Shanshan You",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper first aligns English translations with other language texts to build an English translation corpus, then trains the model for the pending translations to obtain the final target model, then enumerates all possible combinations of source language phrases and target language phrases, and filters out unsatisfied phrase translation pairs to achieve phrase extraction. And the translation model is non-linearly dimensionalized to reduce the complexity of the operation process. Finally, the dimensionality reduction effect of the data and the effect of the model translation are analyzed. The results show that the cumulative contribution rate of the t-SNE algorithm is over 95%, which can guarantee no loss of translation information. The translation accuracy of this paper’s algorithm on each language block is basically 85%-90%, the recall rate is above 85%, and the F-value is above 82%. It indicates that the method in this paper can be well adapted to the requirements of intelligent recognition of English translation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00663"
    },
    {
        "id": 16862,
        "title": "Exploring Non-Linear Dimensionality Reduction Methodology for Enhanced Target Identification from Hyper Spectral Data",
        "authors": "Poonam Gupta, Ankit Varshney, K. Suneetha",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470745"
    },
    {
        "id": 16863,
        "title": "Generative models for anomaly detection and design-space dimensionality reduction in shape optimization",
        "authors": "Danny D’Agostino",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.107566"
    },
    {
        "id": 16864,
        "title": "Applying dimensionality reduction methods to extract physiological and diagnostic features for clinical Hyperspectral Images",
        "authors": "V. Lalitha, B. Latha",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "The most valuable information of Hyperspectral Image (HSI) should be processed properly. Using dimensionality reduction techniques in two distinct approaches, we created a structure for HSI to collect physiological and diagnostic information. The tissue Oxygen Saturation Level (StO2) was extracted using the HSI approach as a physiological characteristic for stress detection. Our research findings suggest that this unique characteristic may not be affected by humidity or temperature in the environment. Comparing the standard StO2 reference and pressure concentrations, the social stress assessments showed a substantial variance and considerable practical differentiation. The proposed system has already been evaluated on tumor images from rats with head and neck cancers using a spectrum from 450 to 900 nm wavelength. The Fourier transformation was developed to improve precision, and normalize the brightness and mean spectrum components. The analysis of results showed that in a difficult situation where awareness could be inexpensive due to feature possibilities for rapid classification tasks and significant in measuring the structure of HSI analysis for cancer detection throughout the surgical resection of wildlife. Our proposed model improves performance measures such as reliability at 89.62% and accuracy at 95.26% when compared with existing systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-236935"
    },
    {
        "id": 16865,
        "title": "Utilizing Heterogeneous Feature Dimensionality Reduction and Stacking Model for Hematoma Expansion Diagnosis",
        "authors": "Qianqi Lu, Yuxiang Xie, Qiuhong Zhang, Yunjv Zeng",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdia60676.2023.10429228"
    },
    {
        "id": 16866,
        "title": "Is Unsupervised Dimensionality Reduction Sufficient to Decode the Complexities of Electrochemical Impedance Spectra?",
        "authors": "Aleksei Makogon, Frederic Kanoufi, Viacheslav Shkirskiy",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "AbstractAs electrochemical research undergoes rapid technological progression, the acquisition of substantial amounts of electrochemical impedance spectra (EIS) becomes increasingly feasible. Yet, this advancement introduces intricate challenges in data processing, automation, and interpretation. This paper delves into the sufficiency of unsupervised machine learning (ML) and in particular dimensionality reduction methods in decoding EIS complexities, examining its strengths, limitations, and potential pathways for optimization. As we navigated the intricacies of non‐linear dimensionality reduction, spotlighting t‐distributed stochastic neighbor embedding (t‐SNE) and uniform manifold approximation and projection (UMAP) algorithms, a pattern emerged: these techniques excel at categorizing divergent impedance spectra but show limitations when faced with analogous circuit configurations, especially those substituting a capacitor with a constant phase element. This observation not only underscores a limitation but also accentuates that unsupervised ML approaches, alone, may not fully unravel the nuances of EIS spectra. In the concluding section of our manuscript, we discuss the implications of this finding from a practical standpoint, particularly for electrochemists seeking to apply these methods in their work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/celc.202300738"
    },
    {
        "id": 16867,
        "title": "LoRA-NCL: Neighborhood-Enriched Contrastive Learning with Low-Rank Dimensionality Reduction for Graph Collaborative Filtering",
        "authors": "Tianruo Cao, Honghui Chen, Zepeng Hao, Tao Hu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "Graph Collaborative Filtering (GCF) methods have emerged as an effective recommendation approach, capturing users’ preferences over items by modeling user–item interaction graphs. However, these methods suffer from data sparsity in real scenarios, and their performance can be improved using contrastive learning. In this paper, we propose an optimized method, named LoRA-NCL, for GCF based on Neighborhood-enriched Contrastive Learning (NCL) and low-rank dimensionality reduction. We incorporate low-rank features obtained through matrix factorization into the NCL framework and employ LightGCN to extract high-dimensional representations. Extensive experiments on five public datasets demonstrate that the proposed method outperforms a competitive graph collaborative filtering base model, achieving 4.6% performance gains on the MovieLens dataset, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11163577"
    },
    {
        "id": 16868,
        "title": "A Novel Dimensionality Reduction-based Software Bug Prediction using a Bat-Inspired Algorithm",
        "authors": "Anurag Gupta, Mayank Sharma, Amit Srivastava",
        "published": "2023-1-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/confluence56041.2023.10048829"
    },
    {
        "id": 16869,
        "title": "A dimensionality reduction approach in helicopter level flight performance testing",
        "authors": "I. Arush, M.D. Pavel, M. Mulder",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractEvaluation of the power required in level flight is essential to any new or modified helicopter performance flight-testing effort. The conventional flight-test method is based on an overly simplification of the induced and profile power components required for a helicopter in level flight. This simplistic approach incorporates several drawbacks that not only make execution of flight sorties inefficient and time consuming, but also compromise the level of accuracy achieved. This paper proposes an alternative flight-test method for evaluating the level-flight performance of a conventional helicopter while addressing and rectifying all identified deficiencies of the conventional method. The proposed method, referred to as the corrected-variables screening using dimensionality reduction (CVSDR), uses an original list of 36 corrected variables derived from basic dimensional analysis principles. This list of 36 corrected variables is reduced using tools of dimensionality reduction to keep only the most effective level-flight predictors. The CVSDR method is demonstrated and tested in this paper using flight-test data from a MBB BO-105 helicopter. It is shown that the CVSDR method predicts the power required for level flight about 21% more accurately than the conventional method while reducing the required flight time by an estimate of at least 60%. Unlike the conventional method, the CVSDR is not bounded by the high-speed approximation associated with the induced power estimation, therefore it is also relevant to the low airspeed regime. This low-airspeed relevancy allows the CVSDR method to bridge between the level-flight regime and the hover. Although demonstrated in this paper for a specific type of helicopter, the CVSDR method is applicable for level-flight performance flight testing of any type of conventional helicopter.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/aer.2023.57"
    },
    {
        "id": 16870,
        "title": "Seeing is Learning in High Dimensions: The Synergy Between Dimensionality Reduction and Machine Learning",
        "authors": "Alexandru Telea, Alister Machado, Yu Wang",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "AbstractHigh-dimensional data are a key study object for both machine learning (ML) and information visualization. On the visualization side, dimensionality reduction (DR) methods, also called projections, are the most suited techniques for visual exploration of large and high-dimensional datasets. On the ML side, high-dimensional data are generated and processed by classifiers and regressors, and these techniques increasingly require visualization for explanation and exploration. In this paper, we explore how both fields can help each other in achieving their respective aims. In more detail, we present both examples that show how DR can be used to understand and engineer better ML models (seeing helps learning) and also applications of DL for improving the computation of direct and inverse projections (learning helps seeing). We also identify existing limitations of DR methods used to assist ML and of ML techniques applied to improve DR. Based on the above, we propose several high-impact directions for future work that exploit the analyzed ML-DR synergy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-024-02604-y"
    },
    {
        "id": 16871,
        "title": "Mining the High Dimensional Biological Dataset Using Optimized Colossal Pattern with Dimensionality Reduction",
        "authors": "T. Sreenivasula Reddy, R. Sathya, Mallikhanjuna Rao Nuka",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "Recent years have seen a lot of attention paid to the mining of enormous item sets from high-dimensional databases. Small and mid-sized data sets take a long time to mine with traditional algorithms since they don’t include the complete and relevant info needed for decision making. Many applications, particularly in bioinformatics, benefit greatly from the extraction of (FCCI) Frequent Colossal Closed Itemsets from a large dataset. In order to extract FCCI from a dataset, present preprocessing strategies fail to remove all extraneous characteristics and rows from the data set completely. In addition, the most current algorithms for this kind are sequential and computationally expensive. A high-dimensional dataset is pruned of all extraneous characteristics and rows using two alternative dimensionality reduction strategies presented in this paper. Then, an optimal feature value is identified by using Equilibrium Optimizer (EO) to identify the threshold value for reduced features. It is designed to discover common items and build association rules if the feature value is smaller than the frequency mining algorithm (IFRS) in conjunction with the Fruit fly Algorithm (FFA). If the feature value exceeds the optimal threshold, then optimized Length restrictions can be used to solve the CP mining problem (LC). Random search is utilized to identify the optimal threshold values of the restrictions and extract the enormous pattern using the Differential Evolutionary Arithmetic Optimization Algorithm. The experiments are carried on twenty biological datasets that us extracted from UCI websites and validated the proposed models in terms of various metrics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37256/cm.5120242460"
    },
    {
        "id": 16872,
        "title": "Time Estimation Algorithm of Single-Phase-to-Ground Fault Based on Two-Step Dimensionality Reduction",
        "authors": "Xin Lin, Haoran Chen, Kai Xu, Jianyuan Xu",
        "published": "2023-6-24",
        "citations": 1,
        "abstract": "The fault detection time identified by relying on the over-voltage criterion of zero-sequence voltage often lags behind the actual occurrence time of ground faults, which may cause fault protection methods based on transient quantity principles to miss fault characteristics and lose their protection capability. To accurately estimate the time of occurrence of a single-phase-to-ground fault, this paper proposes a two-step dimensionality reduction algorithm for estimating the time of occurrence of a single-phase-to-ground fault in a distribution network. This algorithm constructs a filter based on Empirical Mode Decomposition (EMD) to establish a high-dimensional feature dataset based on the zero-sequence current of all feeders. After Principal Component Analysis and Hilbert Mapping Algorithm, the high-dimensional data are reduced to two dimensions to construct a two-dimensional feature dataset. The density-based clustering method is used to adaptively divide the data into two categories, fault data and non-fault data, so as to estimate the time of occurrence of the fault. The paper designs 11 sets of experiments including 7 common high-resistance grounding mediums to verify the accuracy of the fault time recognition of this algorithm. The accuracy of this algorithm is within 7.3 ms and it exhibits better detection performance compared to the threshold detection method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16134921"
    },
    {
        "id": 16873,
        "title": "Dimensionality Reduction for Smart Meter Data Using Variational Autoencoders",
        "authors": "Aviral Kandel, Dimitrios Charalampidis",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/honet59747.2023.10374936"
    },
    {
        "id": 16874,
        "title": "EPCA—Enhanced Principal Component Analysis for Medical Data Dimensionality Reduction",
        "authors": "M. R. Vinutha, J. Chandrika, Balachandran Krishnan, Sujatha Arun Kokatnoor",
        "published": "2023-3-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01677-5"
    },
    {
        "id": 16875,
        "title": "Universal feature selection tool (UniFeat): An open-source tool for dimensionality reduction",
        "authors": "Sina Tabakhi, Parham Moradi",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.03.037"
    },
    {
        "id": 16876,
        "title": "An application of the dimensionality reduction methods for contrast target detection in microwave imaging",
        "authors": "Pravin Mali, Vineet Singh, Shailza Gotra, Prabhat Sharma, Dharmendra Singh",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wams57261.2023.10242863"
    },
    {
        "id": 16877,
        "title": "Nonlinear dimensionality reduction based visualization of single-cell RNA sequencing data",
        "authors": "Mohamed Yousuff, Rajasekhara Babu, Anand Rathinam",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "AbstractSingle-cell multi-omics technology has catalyzed a transformative shift in contemporary cell biology, illuminating the nuanced relationship between genotype and phenotype. This paradigm shift hinges on the understanding that while genomic structures remain uniform across cells within an organism, the expression patterns dictate physiological traits. Leveraging high throughput sequencing, single-cell RNA sequencing (scRNA-seq) has emerged as a powerful tool, enabling comprehensive transcriptomic analysis at unprecedented resolution. This paper navigates through a landscape of dimensionality reduction techniques essential for distilling meaningful insights from the scRNA-seq datasets. Notably, while foundational, Principal Component Analysis may fall short of capturing the intricacies of diverse cell types. In response, nonlinear techniques have garnered traction, offering a more nuanced portrayal of cellular relationships. Among these, Pairwise Controlled Manifold Approximation Projection (PaCMAP) stands out for its capacity to preserve local and global structures. We present an augmented iteration, Compactness Preservation Pairwise Controlled Manifold Approximation Projection (CP-PaCMAP), a novel advancement for scRNA-seq data visualization. Employing benchmark datasets from critical human organs, we demonstrate the superior efficacy of CP-PaCMAP in preserving compactness, offering a pivotal breakthrough for enhanced classification and clustering in scRNA-seq analysis. A comprehensive suite of metrics, including Trustworthiness, Continuity, Mathew Correlation Coefficient, and Mantel test, collectively validate the fidelity and utility of proposed and existing techniques. These metrics provide a multi-dimensional evaluation, elucidating the performance of CP-PaCMAP compared to other dimensionality reduction techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40543-023-00414-0"
    },
    {
        "id": 16878,
        "title": "Exploring the Role of Dimensionality Reduction in Enhancing Machine Learning Algorithm Performance",
        "authors": "John Kamwele Mutinda, Amos Kipkorir Langat",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "In this study, we delve into the pivotal role of dimension reduction techniques in influencing the performance of machine learning algorithms for heart disease prediction. Through a comprehensive exploration of a dataset encompassing crucial features such as age, sex, chest pain type, blood pressure, cholesterol levels, and more, we investigate the impact of different techniques—namely, Principal Component Analysis (PCA), Kernel Principal Component Analysis (KPCA), and Linear Discriminant Analysis (LDA) on classification algorithm effectiveness. The classification algorithms considered were Logistic Regression, Support Vector Machine (SVM), k-Nearest Neighbors (KNN), Naive Bayes, and Deep Neural Network (DNN). We used K-fold cross validation to train and validate the classification algorithms. The performance of these algorithms was assessed using a range of key metrics including accuracy, F1-score, precision, recall, and specificity. The results reveals that Linear Discriminant Analysis consistently emerged as a potent method, remarkably enhancing algorithm performance across all assessed metrics. We also identified Naive Bayes and Logistic Regression as standout algorithms, demonstrating remarkable resilience and reliability across diverse scenarios. These findings collectively shed light on the intricate interplay between dimension reduction techniques and algorithm selection, offering critical insights for crafting more accurate and robust strategies in the prediction of heart disease.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ajrcos/2024/v17i5445"
    },
    {
        "id": 16879,
        "title": "A co-kurtosis based dimensionality reduction method for combustion datasets",
        "authors": "Anirudh Jonnalagadda, Shubham Kulkarni, Akash Rodhiya, Hemanth Kolla, Konduri Aditya",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.combustflame.2023.112635"
    },
    {
        "id": 16880,
        "title": "Data-Driven Modeling of Oil Saturation from Dielectric Logs Using Ensemble Regression, Dimensionality Reduction and Anomaly Detection Machine Learning Algorithms",
        "authors": "M. A. Alghazal, D. Krinis",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "Abstract\nDielectric is a specialized logging tool employed to measure the oil saturation independently of water salinity, enabled by the convoluted multi-frequency measurements of the formation's dielectric properties. Conventional resistivity and salinity-dependent tools are more commonly used but with high measurement uncertainty in variable salinity environments. In this paper, we developed a unique data-driven model encapsulating several supervised and unsupervised machine learning algorithms to predict the dielectric-based saturation using readily available reservoir and well data.\nMore than 20 features were extracted from a common reservoir, well and petrophysical data such as: fluid densities, porosity, free water level, rock type, caliper and resistivity-based oil saturation. We also handcrafted features relating the sample's depth to the nearest injector and reservoir structure. The dataset, with 4000 samples, was randomly split into 80% training and 20% testing. Training was performed using cross-validation technique to benchmark and tune various machine learning regression models including: ensemble methods, neural network and support vector machines. The performance of regression models were further optimized via integrating dimensionality reduction and anomaly detection machine learning models.\nEnsemble methods, particularly random forest, produced the best cross-validation score compared to other regression models. When tested on unseen samples, the random forest model predicted the dielectric oil saturation with 68% correlation coefficient. Two features dimensionality reduction techniques were evaluated to improve prediction using principal component analysis (PCA) and recursive feature elimination (RFE). PCA screen-plot analysis was performed to reduce the features dimensionality to five principle components accounting for more than 80% of data variability. The RFE model was used to select seven optimal features from the total original features. The refitted random forest model, based on the reduced features from both techniques, resulted in a better prediction with the RFE model by 4%. To further improve results, the Density-Based Spatial Clustering of Applications with Noise (DBSCAN) unsupervised model was used to detect anomalies across high dimensional features. The parameters from the DBSCAN model identified more than 400 outliers mostly located at the reservoir's top invaded and lower quality production zones. By removing these outliers, the predicted dielectric oil saturation on test samples from random forest have improved to 76% correlation coefficient.\nCompared to conventional logs, the dielectric tool provides salinity-independent measurement of oil saturation, but it is more expensive with elaborate physical models. In this paper, we demonstrate the unique development of fully-integrated supervised and unsupervised machine learning models for predicting the dielectric oil saturation based on the soft-computation of readily available features extracted from conventional reservoir and well sources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/216430-ms"
    },
    {
        "id": 16881,
        "title": "A journey from mechanistic to data-driven models in process engineering: dimensionality reduction, surrogate and hybrid approaches, and digital twins",
        "authors": "Katarzyna Bizon",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/cpe.2023.146726"
    },
    {
        "id": 16882,
        "title": "Theory-based Model Validation in the Generalized Multifactor Dimensionality Reduction Algorithm for Ordinal Phenotypes  ",
        "authors": "Mohammed Othman, Zaid Al-Khaledi",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33899/iqjoss.2023.181255"
    },
    {
        "id": 16883,
        "title": "Optimal Power Flow Dimensionality Reduction Method with Transient Stability Constraints Based on Dynamic Partitioning",
        "authors": "Wei Shen, Qian Yu, Xun Ye, Tao Fan, Biao Liang",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pandafpe57779.2023.10141029"
    },
    {
        "id": 16884,
        "title": "Dimensionality reduction and physics-based manifold learning for parametric models in biomechanics and tissue engineering",
        "authors": "A. Muixí, A. García-González, S. Zlotnik, P. Díez",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/admos.2023.037"
    },
    {
        "id": 16885,
        "title": "Anomaly Detection in Rails Using Dimensionality Reduction",
        "authors": "Shingo Mitsui, Toshihiko Sasaki, Masayoshi Shinya, Yasuo Arai, Ryutaro Nishimura",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2355/isijinternational.isijint-2022-279"
    },
    {
        "id": 16886,
        "title": "Bi-Orthogonal Projection Learning for Dimensionality Reduction",
        "authors": "Yingyi Liang, Junjun Fan, Chunsheng Li, Jiajun Wen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icips59254.2023.10404800"
    },
    {
        "id": 16887,
        "title": "Dimensionality Reduction and Classification of Hyperspectral Images by Spatial-Spectral Similarity Measure Using Distance Correlation Coefficient",
        "authors": "Peilin Sun, Xu Qin",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aicit59054.2023.10278006"
    },
    {
        "id": 16888,
        "title": "Intrinsic statistical separation of subpopulations in heterogeneous collective motion via dimensionality reduction",
        "authors": "Pei Tan, Christopher E. Miles",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physreve.109.014403"
    },
    {
        "id": 16889,
        "title": "A Comparative Study of Different Dimensionality Reduction Techniques for Arabic Machine Translation",
        "authors": "Nouhaila Bensalah, Habib Ayad, Abdellah Adib, Abdelhamid Ibn El Farouk",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Word embeddings are widely deployed in a tremendous range of fundamental natural language processing applications and are also useful for generating representations of paragraphs, sentences, and documents. In some contexts involving constrained memory, it may be beneficial to reduce the size of word embeddings since they represent a core component of several natural language processing tasks. By reducing the dimensionality of word embeddings, their usefulness in memory-limited devices can be significantly improved, yielding gains in many real-world applications. This article aims to provide a comparative study of different dimensionality reduction techniques to generate efficient lower-dimensional word vectors. Based on empirical experiments carried out on the Arabic machine translation task, we found that the post-processing algorithm combined with independent component analysis provides optimal performance over the considered dimensionality reduction techniques. Therefore, we arrive at a new combination of the post-processing algorithm and dimensionality reduction (independent component analysis) techniques, which has not been investigated before. The latter was applied to both contextual and non-contextual word embeddings to reduce the size of the vectors while achieving a better translation quality than the original ones.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3634681"
    },
    {
        "id": 16890,
        "title": "Evaluation of dimensionality reduction and unsupervised clustering methods in breast datasets",
        "authors": "JunFan Liu, Weide He, YuXin Wang, BoYi Zhang",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "This paper delves into the issues related to handling high-dimensional data in massive datasets, such as computational challenges and uneven data distribution owing to diminished data point density. Various dimensionality reduction techniques such as Principal Component Analysis (PCA), Kernel Principal Component Analysis (KPCA), and Diffusion Maps are discussed and evaluated for their efficiency in extracting crucial data features. This aids in gaining a comprehensive understanding of the data. The study also examines unsupervised clustering methods like K-means, DBSCAN, and spectral clustering. By integrating these clustering methods with dimensionality reduction techniques, we aim to uncover potential synergies. The principles and methodology behind spectral clustering and unsupervised nonlinear diffusion learning are further dissected. Various datasets are employed to evaluate the efficiency of these techniques empirically. The final section of the paper comprises an evaluation of the clustering results and a discussion on potential avenues for future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/31/20230153"
    },
    {
        "id": 16891,
        "title": "Prescriptive PCA: Dimensionality Reduction for Two-stage Stochastic Optimization",
        "authors": "Long He, Ho-Yin Mak",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3580305.3599474"
    },
    {
        "id": 16892,
        "title": "Dimensionality Reduction-Integrated Analog-to-Digital Converters for Efficient Data Acquisition in High-Dimensional Signal Processing",
        "authors": "R. Kiruthika, H. Umamaheswari, A. Karthikeyan",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370143"
    },
    {
        "id": 16893,
        "title": "Toward Grassmannian Dimensionality Reduction in MPC",
        "authors": "Roland Schurig, Andreas Himmel, Rolf Findeisen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcsys.2023.3291229"
    },
    {
        "id": 16894,
        "title": "Data Driven Dimensionality Reduction to Improve Modeling Performance✱",
        "authors": "Joshua Chung, Marcos Lopez De Prado, Horst Simon, Kesheng Wu",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3603719.3603744"
    },
    {
        "id": 16895,
        "title": "Horticulture image based weed detection in feature extraction with dimensionality reduction using deep learning architecture",
        "authors": "Divya A, Sungeetha D, Ramesh S",
        "published": "2023-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp57993.2023.10135028"
    },
    {
        "id": 16896,
        "title": "Dimensionality reduction through convolutional autoencoders for fracture patterns prediction",
        "authors": "Krushna Shinde, Vincent Itier, José Mennesson, Dmytro Vasiukov, Modesar Shakoor",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apm.2022.09.034"
    },
    {
        "id": 16897,
        "title": "Theory-based Model Validation in the Generalized Multifactor Dimensionality Reduction Algorithm for Ordinal Phenotypes  ",
        "authors": "Mohammed Othman, Zaid Al-Khaledi",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33899/iqjoss.2023.0181255"
    },
    {
        "id": 16898,
        "title": "Machine learning methods for nonlinear dimensionality reduction of the thermospheric density field",
        "authors": "Vahid Nateghi, Matteo Manzi",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asr.2023.08.010"
    },
    {
        "id": 16899,
        "title": "Application of Constrain Autoencoder Linear Dimensionality Reduction of Dummy Curve Data",
        "authors": "Zhiping Hou, Zhigang Huang, Cancan Liu, Haiming Gu",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlbdbi60823.2023.10481934"
    },
    {
        "id": 16900,
        "title": "Dimensionality Reduction for Hierarchical Multi-Label Classification: A Systematic Mapping Study",
        "authors": "Raimundo Osvaldo Vieira, Helyane Bronoski Borges",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "Hierarchical multi-label classification problems typically deal with datasets with many attributes and labels, which can negatively impact the classifier performance. The application of dimensionality reduction methods can significantly improve the performance of classifiers. Dimensionality reduction can be performed by feature extraction or feature selection, according to the problem domain and datasets characteristics. This work carried out a systematic literature mapping to identify the approaches and techniques of dimensionality reduction that have been used in hierarchical multi-label classification tasks. Searches were performed on 7 important databases for the Computer Science field. From a list of 184 retrieved papers, 12 were selected for analysis, from which it was possible to determine a general overview of studies conducted from 2010 to 2022. It was identified that feature selection was the most frequent reduction method, with filter approach standing out. In addition, it was detected that most of the works used tree hierarchical structure. As its main outcome, this paper presents the state of the art of dimensionality reduction problem for hierarchical multi-label classification, indicating trends and research issues in the field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3897/jucs.91309"
    },
    {
        "id": 16901,
        "title": "A performance analysis of dimensionality reduction algorithms in machine learning models for cancer prediction",
        "authors": "Md Faisal Kabir, Tianjie Chen, Simone A. Ludwig",
        "published": "2023-11",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2022.100125"
    },
    {
        "id": 16902,
        "title": "Spectral Correction and Dimensionality Reduction of Hyperspectral Images for Plant Water Stress Assessment",
        "authors": "Lin Jian Wen, Mohd Shahrimie Mohd Asaari, Stijn Dhondt",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Hyperspectral Imaging (HSI) is one of the emerging techniques used in plant phenotyping as it carries abundant information and is non-invasive to plants. However, factors like illumination effect and high-dimensional spectral features need to be solved to attain higher accuracy of plant trait analysis. This research explored and analysed spectral normalisation and dimensionality reduction methods. The focus of this paper is twofold; the first objective was to explore the Standard Normal Variate (SNV), Least Absolute Deviations (L1) and Least Squares (L2) normalisation for spectral correction. The second objective was to explore the feasibility of Principal Component Analysis (PCA) and Analysis of Variance Fisher’s Test (ANOVA F-test) for spectral dimensionality reduction in spectral discriminative modelling. The analysis techniques were validated with HSI data of maise plants for early detection of water deficit stress response. Results showed that SNV performed the best among the three normalisation methods. Besides, ANOVA F-test outperformed PCA for the band selection method as it improved the trait assessment on the water deficit response of maise plants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47836/pjst.31.4.13"
    },
    {
        "id": 16903,
        "title": "Segmentation-based Dimensionality Reduction for Hyperspectral Image Classification",
        "authors": "Tazbiul Hasan, Md. Liakot Ali Liton, Habibur Rahman, Md Touhid Islam, Md Rashedul Islam",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eict61409.2023.10427661"
    },
    {
        "id": 16904,
        "title": "Machine Learning for Soil Attribute Prediction: An Effectiveness and Dimensionality Reduction Analysis",
        "authors": "José Solenir L. Figuerêdo, Marcos Eduardo de C. Ferreira, Rodrigo T. Calumby",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "Traditional soil fertility analyzes are laborious, expensive, timeconsuming and produce hazardous waste. Although many works using machine learning (ML) has been done to address these issues, some algorithms and dimensionality reduction strategies require further investigation. Therefore, in this study we evaluated the potential of Support Vector Regression and Ridge regression in determining soil attributes, and compared principal components regression and partial least squares regression (PLSR). The results showed that Ridge was the most effective model. In addition, our experiments revealed that PLSR was able to achieve statistically equivalent results, and in some cases superior to the baseline, but using a much smaller average number of components.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5753/sbiagro.2023.26572"
    }
]