[
    {
        "id": 34105,
        "title": "Parallel Ant Colony Optimization Algorithm for Finding the Shortest Path for Mountain Climbing",
        "authors": "Esra'a Alhenawi, Ruba Abu Khurma, Ahmad A. Sharieh, Omar Al-Adwan, Areej Al Shorman, Fatima Shannaq",
        "published": "2023",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2022.3233786"
    },
    {
        "id": 34106,
        "title": "Path optimization problem analysis based on improved ant colony algorithm",
        "authors": "J. Fang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.2935"
    },
    {
        "id": 34107,
        "title": "Ant Colony Based Approach for Finding Cost-Optimal Path",
        "authors": "Andrey Sergeevich Rychkov, Majid Elkhan Ogly Abbasov",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pci60110.2023.10325925"
    },
    {
        "id": 34108,
        "title": "Tourism Planning Path Based on Ant Colony Optimization Algorithm",
        "authors": "Shuang Che, Yan Chen",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cisce58541.2023.10142368"
    },
    {
        "id": 34109,
        "title": "Research on Mobile Robot Path Planning in Angle-Guided Ant Colony Optimization Algorithm",
        "authors": "Shuai Wu, Qingxia Li, Wenhong Wei, Zijing Ye",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450803"
    },
    {
        "id": 34110,
        "title": "Improved ant colony optimization for safe path planning of AUV",
        "authors": "Meng Ronghua, Cheng Xinhao, Wu Zhengjia,  Du xuan",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e27753"
    },
    {
        "id": 34111,
        "title": "Application study of ant colony algorithm for network data transmission path scheduling optimization",
        "authors": "Peng Xiao",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "Abstract\nWith the rapid development of the information age, the traditional data center network management can no longer meet the rapid expansion of network data traffic needs. Therefore, the research uses the biological ant colony foraging behavior to find the optimal path of network traffic scheduling, and introduces pheromone and heuristic functions to improve the convergence and stability of the algorithm. In order to find the light load path more accurately, the strategy redefines the heuristic function according to the number of large streams on the link and the real-time load. At the same time, in order to reduce the delay, the strategy defines the optimal path determination rule according to the path delay and real-time load. The experiments show that under the link load balancing strategy based on ant colony algorithm, the link utilization ratio is 4.6% higher than that of ECMP, while the traffic delay is reduced, and the delay deviation fluctuates within ±2 ms. The proposed network data transmission scheduling strategy can better solve the problems in traffic scheduling, and effectively improve network throughput and traffic transmission quality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jisys-2022-0277"
    },
    {
        "id": 34112,
        "title": "Learning path planning methods based on learning path variability and ant colony optimization",
        "authors": "Jing Zhao, Haitao Mao, Panpan Mao, Junyong Hao",
        "published": "2024-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sasc.2024.200091"
    },
    {
        "id": 34113,
        "title": "Pareto Front Approximation by Ant Colony Optimization",
        "authors": "Jaroslav Janáček, Marek Kvet",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012262900003639"
    },
    {
        "id": 34114,
        "title": "A novel parallel ant colony optimization algorithm for mobile robot path planning",
        "authors": "Jian Si, Xiaoguang Bao",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract><p>With the continuous development of mobile robot technology, its application fields are becoming increasingly widespread, and path planning is one of the most important topics in the field of mobile robot research. This paper focused on the study of the path planning problem for mobile robots in a complex environment based on the ant colony optimization (ACO) algorithm. In order to solve the problems of local optimum, susceptibility to deadlocks, and low search efficiency in the traditional ACO algorithm, a novel parallel ACO (PACO) algorithm was proposed. The algorithm constructed a rank-based pheromone updating method to balance exploration space and convergence speed and introduced a hybrid strategy of continuing to work and killing directly to address the problem of deadlocks. Furthermore, in order to efficiently realize the path planning in complex environments, the algorithm first found a better location for decomposing the original problem into two subproblems and then solved them using a parallel programming method-single program multiple data (SPMD)-in MATLAB. In different grid map environments, simulation experiments were carried out. The experimental results showed that on grid maps with scales of 20 $ \\times $ 20, 30 $ \\times $ 30, and 40 $ \\times $ 40 compared to nonparallel ACO algorithms, the proposed PACO algorithm had less loss of solution accuracy but reduced the average total time by 50.71, 46.83 and 46.03%, respectively, demonstrating good solution performance.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2024113"
    },
    {
        "id": 34115,
        "title": "Research on cold chain logistics distribution path optimization based on improved ant colony algorithm",
        "authors": "Ran Wang",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10075989"
    },
    {
        "id": 34116,
        "title": "The Enhanced Optimal Path Selection for WSN using Hybrid Ant Colony Optimization Technique",
        "authors": "Vipin Mittal, Meena Desai",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indiscon58499.2023.10270075"
    },
    {
        "id": 34117,
        "title": "Optimal Mobile Node Path Optimization Based on Ant Colony Algorithm",
        "authors": "Qian Zhao, Mingyu Ma, Ke Han, Zuoqiang Du",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartiot58732.2023.00051"
    },
    {
        "id": 34118,
        "title": "A study on path optimization of construction machinery by fusing ant colony optimization and artificial potential field",
        "authors": "Gaomei Luo, Yang Shen",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "AbstractWith the progress of manufacturing capability and the requirements of modern project construction clustering and safety, unmanned technology has become a major development direction for construction machinery. The study analyzes the defects of the ACO applied to path planning, uses the basic ant colony method combined with the APF algorithm to construct comprehensive heuristic information to improve the efficiency of the initial iteration, and adds a pseudo‐random proportional transfer rule to improve its transfer rule, in addition to proposing an optimal ant pheromone release rule to ensure that the pheromone update can effectively improve the effect of the later iteration. In the 20 × 20 raster map, the optimal path of both the basic and potential field ant colony algorithms is 31.52, while the basic ant colony algorithm does not converge to the optimal path after 200 iterations in the 30 × 30 raster map, and the comparison algorithm converges to the optimal path after 156 iterations, while the potential field ant colony algorithm converges to the optimal path after 25 iterations at 47.52. And the potential field ant colony The potential field ant colony algorithm converges to the optimal path of 47.52 after 25 iterations, and the number of turns in both raster maps of different sizes is only about 50% of the basic ant colony algorithm, which is also better than that of the comparison algorithm. The proposed algorithm improves the ability of the ant colony algorithm to explore and exploit raster maps, enhances its path planning capability, and improves the construction efficiency well in practical applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/adc2.125"
    },
    {
        "id": 34119,
        "title": "Image-based extension to ant colony algorithm for path finding in gird-based environments",
        "authors": "Aaron Rasheed Rababaah",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13198-024-02281-3"
    },
    {
        "id": 34120,
        "title": "RETRACTION NOTICE: Path planning for unmanned wheeled robot based on improved ant colony optimization",
        "authors": "",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00202940231152150"
    },
    {
        "id": 34121,
        "title": "Ant Colony Optimization for Cooperative Inspection Path Planning Using Multiple Unmanned Aerial Vehicles",
        "authors": "Duy Nam Bui, Thuy Ngan Duong, Manh Duong Phung",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sii58957.2024.10417512"
    },
    {
        "id": 34122,
        "title": "Retracted: Path Optimization Model of Rural Red Tourist Attractions Based on Ant Colony Algorithm",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9860157"
    },
    {
        "id": 34123,
        "title": "An improved ant colony optimization for UAV minimum time search path planning",
        "authors": "Zhenglin Geng, Yisong Sun",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3586185.3586191"
    },
    {
        "id": 34124,
        "title": "Enhanced ant colony algorithm with obstacle avoidance strategy for multi-objective path planning of mobile robots",
        "authors": "Ke Zhang, Bin Chai, Minghu Tan, Ye Zhang, Jingyu Wang",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0305215x.2023.2269844"
    },
    {
        "id": 34125,
        "title": "Path Planning Method in Taigu County Based on the Hybrid Ant Colony Optimization-Genetic Algorithm in the Context of COVID-19",
        "authors": "Ling-Qing Feng Ling-Qing Feng, Yi Shao Ling-Qing Feng, Xue-Feng Deng Yi Shao, Yu-Jing Liu Xue-Feng Deng",
        "published": "2023-12",
        "citations": 0,
        "abstract": "\n                        <p>During the period of COVID-19, there is a mixture of areas that are susceptible to COVID-19 infection and areas that are not susceptible to COVID-19 infection in cities. Blind wandering is often accompanied by the risk of infection. Hence, in order to improve the safety of people&rsquo;s travel, this paper uses the hybrid Ant Colony Optimization-Genetic Algorithm (ACO-GA) to plan the central path of Taigu County. The volatilization coefficient of pheromone in Ant Colony Optimization (ACO) is changed dynamically. Pheromones in high-risk areas that are susceptible to epidemic infection are more volatile, while pheromones in low-risk areas that are less suscep-tible to epidemic infection are less volatile. Adjust the selection of &ldquo;gene&rdquo; mutation in Genetic Algorithm (GA). Vulner-able areas should be closed off to cut off the source of infection. As long as the shortest route which is of lower risk is formulated, people should stay away from high-risk areas that are susceptible to infection as much as possible to reduce the spread of COVID-19 and ensure the safety of people&rsquo;s lives. The path under the influence of the COVID-19 is predicted and analyzed in the form of a simulation. The experimental results show that the algorithm can help to effectively avoid areas susceptible to the COVID-19 and reduce the risk of people getting sick.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/199115992023123406003"
    },
    {
        "id": 34126,
        "title": "Mobile robot path planning based on hybrid ant colony optimization",
        "authors": "Zhaojun Zhang, Jiawei Lu, Zhaoxiong Xu, Tao Xu",
        "published": "2023-8-1",
        "citations": 2,
        "abstract": "To solve the problems of the ant colony optimization (ACO), such as slow convergence speed, easy to fall into local extremum and deadlock in path planning, this paper proposed an improved ACO, which was hybridized by PSO based on logistic chaotic mapping, called hybrid ant colony optimization (HACO). According to the number of obstacles around the next feasible node, HACO distributes the initial pheromones unevenly to avoid the ant getting stuck in deadlock. According to the orientation of the next node selected by the ant, the heuristic information is adaptively adjusted to guide the ant to the direction of the target position. When updating the pheromone, the local and global search mechanism of the particle swarm optimization is used to improve the pheromone update rule and accelerate convergence speed. Finally, the grid method is used to construct the environment map, and simulation experiments are conducted in different environments. The experimental results verify the effectiveness and feasibility of the improved algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-231280"
    },
    {
        "id": 34127,
        "title": "UAV path planning based on a dual-strategy ant colony optimization algorithm",
        "authors": "Xiaoming Mai, Na Dong, Shuai Liu, Hao Chen",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "With the rapid development of modern communication and automatic control technologies, unmanned aerial vehicles (UAVs) have increasingly gained importance in both military and civilian domains. Path planning, a critical aspect for achieving autonomous aerial navigation, has consistently been a focal point in UAV research. However, traditional ant colony algorithms need to be improved for the drawbacks of susceptibility to local optima and weak convergence capabilities. Consequently, a novel path planning methodology is proposed based on a dual-strategy ant colony algorithm. In detail, an improved state transition probability rule is introduced, redefining ant movement rules by integrating the state transition strategy of deterministic selection during the iterative process. Additionally, heuristic information on adjacent node distance and mountain height is added to further improve the search efficiency of the algorithm. Then, a new dynamically adjusted pheromone update strategy is proposed. The update strategy is continuously adjusted during the iteration process, which is beneficial to the algorithm’s global search in the early stage and accelerated convergence in the later stage, preventing the algorithm from falling into local optimality and improving its convergence. Based on the above improvements, a new variation of ant colony optimization (ACO) called dual-strategy ACO algorithm is formed. Experimental results prove that dual-strategy ACO has superior global search capabilities and convergence characteristics from four key aspects: path length, fitness values, iteration number, and running time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20517/ir.2023.37"
    },
    {
        "id": 34128,
        "title": "Cloud Computing With Resource Allocation Based on Ant Colony Optimization",
        "authors": "Taras Kniazhyk,  , Oleksandr Muliarevych",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "In this study, we explore the intricacies of cloud computing technologies, with an emphasis on the challenges and concerns pertinent to resource allocation. Three opti- mization techniques—Particle Swarm Optimization (PSO), Ant Colony Optimization (ACO), and Genetic Algorithm (GA) — have been meticulously analyzed concerning their applications, objectives, and operational  methodologies. The study underscores these algorithms' pivotal role in enhancing cloud resource optimization, while also elucidat- ing their respective merits and limitations.  As the complexity of cloud computing escalates, devising efficacious strategies for resource management and alloca- tion becomes imperative. Such strategies are paramount in aiding organizations in cost containment and performance amplification. The ensuing comparative analysis has been crafted to offer a holistic insight into the three algorithms, thus empowering cloud providers to judiciously select an optimization technique that aligns with the unique de- mands and challenges of their cloud computing infrastructure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23939/acps2023.02.104"
    },
    {
        "id": 34129,
        "title": "Multiple travelling salesman problem with fuzzy c-means and  ant colony optimization algorithms",
        "authors": "Derya DİKBIYIK, Selçuk ALP",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "Sezgisel algoritmalar, kabul edilebilir sürede optimuma yakın çözümler verebilen ve çok büyük boyutlu optimizasyon problemleri için kullanılabilen algoritmalardır. En iyi çözümün bulunacağı garanti edilememekle beraber, bulunan çözümün kabul edilebilir düzeyde olması, çözüme kolay ve hızlı ulaşılabilmesi açısından kullanımı oldukça yaygın olan yöntemlerdir. Sezgisel yöntemlerde problemin çözümüne yönelik yaklaşımlar; karar verme, optimizasyon, bulanık mantık, yapay zeka, makine öğrenmesi, derin öğrenme şeklinde karşımıza çıkar. Bu çalışmada; pek çok alanda uygulaması olan Gezgin Satıcı Problemi (GSP) için optimuma en yakın çözümü hızlı bir şekilde bulabilmek amacıyla Karınca Kolonisi Optimizasyonu (KKO) yöntemi seçilmiştir. Rastgele seçilen verileri gruplandırmak amacıyla da Bulanık C-Ortalamalı Kümeleme (BCO) Algoritması kullanılmıştır. Çalışmada kullanılan veriler BCO algoritması kullanılarak ayrı ayrı 3, 4 ve 5 kümeye ayrılmış; elde edilen veri setleri Çoklu KKO ile değerlendirilmiş ve sonuçlar karşılaştırılmıştır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31795/baunsobed.1005070"
    },
    {
        "id": 34130,
        "title": "Finding the Link Between Iranian EFL Teacher Motivation and Engagement via Ant Colony Optimization Algorithm and Fuzzy Decision Mode",
        "authors": "Zahra Pourtousi, Meisam Babanezhad, Afsaneh Ghanizadeh",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12124-024-09818-y"
    },
    {
        "id": 34131,
        "title": "Retracted: Simulation of Film and Television Transmission Path Based on Ant Colony Optimization Algorithm",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9871428"
    },
    {
        "id": 34132,
        "title": "Development of an modified Ant Colony Optimization algorithm for solving path planning problems of a robot system",
        "authors": "Sudeep Sharan, Juan José Domínguez-Jiménez, Peter Nauth",
        "published": "2023-3-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116860"
    },
    {
        "id": 34133,
        "title": "Research on the planning method of moving robotic path planning of ant colony optimization algorithms",
        "authors": "Ridong Jin, Hongjian Wang, Yanbin Zhang, Hongzhi Liu, Mengwei Zhangsun, Aodi You",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icma57826.2023.10216050"
    },
    {
        "id": 34134,
        "title": "Optimization of Low Carbon Medicine Cold Chain Delivery Path Based on Adaptive Improved Ant Colony Algorithm",
        "authors": "Zhang Wenyu, Li Xinru, Ye Yunrui",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc-fskd59587.2023.10281058"
    },
    {
        "id": 34135,
        "title": "SparkACO: A Spark-Based Ant Colony Optimization for Path Planning of Large-Scale Complex Road Networks",
        "authors": "Qibu Xiang, Shuxiang Xu, Yushun Fan, Jia Zhang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdataservice58306.2023.00038"
    },
    {
        "id": 34136,
        "title": "Author Correction: 3D smooth path planning of AUV based on improved ant colony optimization considering heading switching pressure",
        "authors": "Ronghua Meng, Aiwen Sun, Zhengjia Wu, Xuan Du, Yongdong Meng",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-41140-2"
    },
    {
        "id": 34137,
        "title": "UAV Path Planning Based on Ant Colony Algorithm",
        "authors": "Luoyang Luo",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10258014"
    },
    {
        "id": 34138,
        "title": "Otonom mobil robotların Voronoi diyagramı ve karınca kolonisi optimizasyonuna dayalı yol planlaması",
        "authors": "Adem TUNCER",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "Path planning aims to enable autonomous robots to navigate safely and efficiently from a starting point to a target point in challenging and dynamic environments. Path planning in robotics is highly significant and still an ongoing subject of research. The increasing use of robots in various applications such as industrial automation, service robotics, and autonomous vehicles has brought forth the need for reliable and efficient path planning algorithms. The inherent capability of Voronoi diagrams to partition space based on proximity makes them an effective framework for research in path planning. Ant colony optimization, a bio-inspired optimization technique, is based on the foraging behavior of ants and is commonly employed to address the traveling salesman problem and various other combinatorial optimization problems. A hybrid method was adopted in this study by combining a Voronoi diagram and an ant colony algorithm. To create paths for the robot where it can stay as far away from obstacles as possible, a Voronoi diagram was utilized. Additionally, to find the shortest path from the starting point to the destination among these paths, ant colony optimization was employed. The main contribution of the study lies in the combination of the Voronoi diagram for obstacle avoidance and ant colony optimization for finding the optimal path. The combination of these techniques makes an effective contribution to robotic path planning by focusing on ensuring safety by avoiding obstacles while optimizing the shortest path. Experimental studies show that the hybrid method produces successful results for the desired purpose.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61112/jiens.1365282"
    },
    {
        "id": 34139,
        "title": "Role of ant colony optimization in path planning of the robot: A review",
        "authors": "B. K. Patle, Manas Wakchaure, Tanmay Thorat, Nitin Gudadhe",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0183506"
    },
    {
        "id": 34140,
        "title": "Research on E-commerce Logistics Distribution Path Optimization Based on Ant Colony Algorithm",
        "authors": "Shouwei Hou,  ",
        "published": "2024-3-10",
        "citations": 0,
        "abstract": "With the rapid development of e-commerce industry, the efficiency of logistics and distribution has become a key constraint to its further development. In this paper, we explore the optimization of e-commerce logistics and distribution paths through the ant colony algorithm, aiming to improve the distribution efficiency and reduce the cost. The study firstly analyzes the core elements and challenges of e-commerce logistics and distribution paths, and then describes in details about the ant colony algorithm and its application to path optimization. By constructing a model adapted to the characteristics of e-commerce distribution, we use the ant colony algorithm to optimize a variety of different sizes and complexities of distribution paths. By constructing a model adapted to the characteristics of e-commerce distribution, we use the ant colony algorithm to optimize a variety of distribution paths with different sizes and complexities, and the experimental results show that the algorithm can effectively reduce the total distribution distance and cost. In the test cases, we observe that the distribution paths are shortened by 15\\% on average, and the distribution cost is reduced by about 20\\%. These results prove the effectiveness and feasibility of the ant colony algorithm in the optimization of e-commerce logistics distribution paths. This study provides a new idea for e-commerce logistics distribution path optimization, which is of great significance for improving logistics efficiency and reducing operation cost.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62227/as/74117"
    },
    {
        "id": 34141,
        "title": "ANT COLONY OPTIMIZATION: AN ECONOMIC TRANSPOSITION",
        "authors": "VLAD POPESCU",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "The paper tackles recent developments in the field of social behaviours of insects and swarm intelligence – “stigmergy”. Specifically, this paper aims to explore the paradigm of ant colony optimization from two main perspectives – economic and biological – so that we can attain a clear view of the genomic bases that allow ants to function as complex biological navigation systems. Such systems translate nowadays into metaheuristic algorithms whose purpose is to solve extremely difficult combinatorial optimization problems. The design of these algorithms draws inspiration from the foraging behaviour of real ants. In the case study, an example of using an ant colony optimization algorithm in order to solve a routing problem shows us how only two iterations and two ants were enough to reveal the shortest path, taking into consideration the amount of pheromones emitted.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24818/oec/2021/30/4.02"
    },
    {
        "id": 34142,
        "title": "Ant Colony Optimization-Based Path Planning for UAV Navigation in Dynamic Environments",
        "authors": "Badar Al Baroomi, Thirein Myo, Muhammad R Ahmed, Abdullah Al Shibli, Mohammed H Marhaban, M Shamim Kaiser",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacr59381.2023.10314603"
    },
    {
        "id": 34143,
        "title": "Dynamic Path Optimization Based on Improved Ant Colony Algorithm",
        "authors": "Juan Cheng",
        "published": "2023-4-17",
        "citations": 8,
        "abstract": "Dynamic path optimization is an important part of intelligent transportation systems (ITSs). Aiming at the shortcomings of the current dynamic path optimization method, the improved ant colony algorithm was used to optimize the dynamic path. Through the actual investigation and analysis, the influencing factors of the multiobjective planning model were determined. The ant colony algorithm was improved by using the analytic hierarchy process (AHP) to transform path length, travel time, and traffic flow into the comprehensive weight-influencing factor. Meanwhile, directional guidance and dynamic optimization were introduced to the improved ant colony algorithm. In the simulated road network, the length of the optimal path obtained by the improved ant colony algorithm in the simulation road network is 3.015, which is longer than the length of the optimal path obtained by the basic ant colony algorithm (2.902). The travel time of the optimal path obtained by the improved ant colony algorithm (376 s) is significantly shorter than that of the basic ant colony algorithm (416.3 s). The number of iterations of the improved ant colony algorithm (45) is less than that of the basic ant colony algorithm (58). In the instance network, the number of iterations of the improved ant colony algorithm (18) is less than that of the basic ant colony algorithm (26). The travel time of the optimal path obtained by the improved ant colony algorithm (377.1 s) is significantly shorter than that of the basic ant colony algorithm (426 s) and the spatial shortest distance algorithm (424 s). Compared with the basic ant colony algorithm and the spatial shortest distance algorithm, the results of the optimal path obtained by the improved ant colony algorithm were more accurate, and the effectiveness of the improved ant colony algorithm was verified.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/7651100"
    },
    {
        "id": 34144,
        "title": "Research on optimization and Simulation of Fire Emergency Evacuation Path Based on Improved Ant Colony Algorithm for Large Public Buildings",
        "authors": "Shilong Jia, Lei Zhao, Dong Yang, Lei Sun, Bo Liang",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccia59741.2023.00024"
    },
    {
        "id": 34145,
        "title": "Modified adaptive ant colony optimization algorithm and its application for solving path planning of mobile robot",
        "authors": "Lei Wu, Xiaodong Huang, Junguo Cui, Chao Liu, Wensheng Xiao",
        "published": "2023-4",
        "citations": 65,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.119410"
    },
    {
        "id": 34146,
        "title": "A study of cart path planning based on the improvement of the elephant colony-ant colony algorithm",
        "authors": "Wenjing Jiang",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccasit58768.2023.10351646"
    },
    {
        "id": 34147,
        "title": "Ant Colony Algorithm for Distributed Constrained Optimization",
        "authors": "Fengxi Zhang",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inocon57975.2023.10101321"
    },
    {
        "id": 34148,
        "title": "Three-dimensional continuous picking path planning based on ant colony optimization algorithm",
        "authors": "Chuang Zhang, He Wang, Li-Hua Fu, Yue-Han Pei, Chun-Yang Lan, Hong-Yu Hou, Hua Song",
        "published": "2023-2-27",
        "citations": 3,
        "abstract": "Fruit-picking robots are one of the important means to promote agricultural modernization and improve agricultural efficiency. With the development of artificial intelligence technology, people are demanding higher picking efficiency from fruit-picking robots. And a good fruit-picking path determines the efficiency of fruit-picking. Currently, most picking path planning is a point-to-point approach, which means that the path needs to be re-planned after each completed path planning. If the picking path planning method of the fruit-picking robot is changed from a point-to-point approach to a continuous picking method, it will significantly improve its picking efficiency. The optimal sequential ant colony optimization algorithm(OSACO) is proposed for the path planning problem of continuous fruit-picking. The algorithm adopts a new pheromone update method. It introduces a reward and punishment mechanism and a pheromone volatility factor adaptive adjustment mechanism to ensure the global search capability of the algorithm, while solving the premature and local convergence problems in the solution process. And the multi-variable bit adaptive genetic algorithm is used to optimize its initial parameters so that the parameter selection does not depend on empirical and the combination of parameters can be intelligently adjusted according to different scales, thus bringing out the best performance of the ant colony algorithm. The results show that OSACO algorithms have better global search capability, higher quality of convergence to the optimal solution, shorter generated path lengths, and greater robustness than other variants of the ant colony algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0282334"
    },
    {
        "id": 34149,
        "title": "The Optimization of path Planning for a Picking Robot Based on an Improved Ant Colony Algorithm",
        "authors": "Bowen Tang, Qiu Fang, Jianbin Yu, Guanhong Chen",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scset58950.2023.00065"
    },
    {
        "id": 34150,
        "title": "An Effective Path Convergence Approach Founded on Recurrent Ant Colony Optimization (RECACO) in Mobile Ad Hoc Networks",
        "authors": "M. Vishnuvardhan Reddy, K. V Shahnaz, Potu Narayana, Sanjay Kumar Suman, A. Asha, Arvind Balamurali",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc60394.2023.10441147"
    },
    {
        "id": 34151,
        "title": "Online Personalized Learning Path Recommendation Based on Saltatory Evolution Ant Colony Optimization Algorithm",
        "authors": "Shugang Li, Hui Chen, Xin Liu, Jiayi Li, Kexin Peng, Ziming Wang",
        "published": "2023-6-21",
        "citations": 1,
        "abstract": "To solve the problems of slow convergence and low accuracy when the traditional ant colony optimization (ACO) algorithm is applied to online learning path recommendation problems, this study proposes an online personalized learning path recommendation model (OPLPRM) based on the saltatory evolution ant colony optimization (SEACO) algorithm to achieve fast, accurate, real-time interactive and high-quality learning path recommendations. Consequently, an online personalized learning path optimization model with a time window was constructed first. This model not only considers the learning order of the recommended learning resources, but also further takes the review behavior pattern of learners into consideration, which improves the quality of the learning path recommendation. Then, this study constructed a SEACO algorithm suitable for online personalized learning path recommendation, from the perspective of optimal learning path prediction, which predicts path pheromone evolution by mining historical data, injecting the domain knowledge of learning path prediction that can achieve best learning effects extracted from domain experts and reducing invalid search, thus improving the speed and accuracy of learning path optimization. A simulation experiment was carried out on the proposed online personalized learning path recommendation model by using the real leaner learning behavior data set from the British “Open University” platform. The results illustrate that the performance of the proposed online personalized learning path recommendation model, based on the SEACO algorithm for improving the optimization speed and accuracy of the learning path, is better than traditional ACO algorithm, and it can quickly and accurately recommend the most suitable learning path according to the changing needs of learners in a limited time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11132792"
    },
    {
        "id": 34152,
        "title": "Multi-Node Path Planning of Electric Tractor Based on Improved Whale Optimization Algorithm and Ant Colony Algorithm",
        "authors": "Chuandong Liang, Kui Pan, Mi Zhao, Min Lu",
        "published": "2023-2-28",
        "citations": 5,
        "abstract": "Under the “Double Carbon” background, the development of green agricultural machinery is very fast. An important factor that determines the performance of electric farm machinery is the endurance capacity, which is directly related to the running path of farm machinery. The optimized driving path can reduce the operating loss and extend the mileage of agricultural machinery, then multi-node path planning helps to improve the working efficiency of electric tractors. Ant Colony Optimization (ACO) is often used to solve multi-node path planning problems. However, ACO has some problems, such as poor global search ability, few initial pheromones, poor convergence, and weak optimization ability, which is not conducive to obtaining the optimal path. This paper proposes a multi-node path planning algorithm based on Improved Whale Optimized ACO, named IWOA-ACO. The algorithm first introduces reverse learning strategy, nonlinear convergence factor, and adaptive inertia weight factor to improve the global and local convergence ability. Then, an appropriate evaluation function is designed to evaluate the solving process and obtain the best fitting parameters of ACO. Finally, the optimal objective function, fast convergence, and stable operation requirements are achieved through the best fitting parameters to obtain the global path optimization. The simulation results show that in flat environment, the length and energy consumption of IWOA-ACO planned path are the same as those of PSO-ACO, and are 0.61% less than those of WOA-ACO. In addition, in bump environment, the length and energy consumption of IWOA-ACO planned path are 1.91% and 4.32% less than those of PSO-ACO, and are 1.95% and 1.25% less than those of WOA-ACO. Therefore, it is helpful to improve the operating efficiency along with the endurance of electric tractors, which has practical application value.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agriculture13030586"
    },
    {
        "id": 34153,
        "title": "Load Balancing of Nodes in Cloud Using Ant Colony Optimization",
        "authors": "Aditya Kapoor",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4430821"
    },
    {
        "id": 34154,
        "title": "Ant Colony Optimization Algorithm Enhancement for Better Performance",
        "authors": "Mohammed Faisal, Fahad Albogamy",
        "published": "2023-6-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174442"
    },
    {
        "id": 34155,
        "title": "A Step-by-Step Mathematical Derivation of Ant Colony Optimization for Solving Subset Selection Problems",
        "authors": "Akshaya Kumar Mandal",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.1223.123541"
    },
    {
        "id": 34156,
        "title": "Mobile Robot Path Planning Based on Improved Ant Colony Algorithm",
        "authors": "Yimin Xiao",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435611"
    },
    {
        "id": 34157,
        "title": "Ant Colony Optimization for the Sensor Deployment Problem",
        "authors": "Dindar Öz",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ubmk59864.2023.10286661"
    },
    {
        "id": 34158,
        "title": "Protein tertiary structure prediction by integrating ant colony optimization with path relinking and structure knowledge",
        "authors": "Sivagnanam Rajamanickam Mani Sekhar, Siddesh Gaddadevara Matt, Vasantha Kumara Mahadevachar",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41870-023-01198-7"
    },
    {
        "id": 34159,
        "title": "Mobile Robot Path Planning Based on Triangular Clip Ant Colony Algorithm",
        "authors": "Zizhe Xu",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10076068"
    },
    {
        "id": 34160,
        "title": "Construction Time-Cost Optimization Modeling Using Ant Colony Optimization",
        "authors": "Mohammed Nooruldeen Azeez, Angham Alsaffar",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "In the field of construction project management, time and cost are the most important factors to be considered in planning every project, and their relationship is complex. The total cost for each project is the sum of the direct and indirect cost. Direct cost commonly represents labor, materials, equipment, etc.Indirect cost generally represents overhead cost such as supervision, administration, consultants, and interests. Direct cost grows at an increasing rate as the project time is reduced from its original planned time. However, indirect cost continues for the life of the project and any reduction in project time means a reduction in indirect cost. Therefore, there is a trade-off between the time and cost for completing construction activities.In this research, modeling of time-cost optimization, generating global optimum solution for time and cost problem, and lowering construction time and cost using ant colony optimization algorithm",
        "keywords": "",
        "link": "http://dx.doi.org/10.31026/j.eng.2014.01.09"
    },
    {
        "id": 34161,
        "title": "Path Planning of Mobile Robot Based on Improved Ant Colony Algorithm",
        "authors": "Li Sun",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itaic58329.2023.10409046"
    },
    {
        "id": 34162,
        "title": "Mobile Robot Path Planning Based on Improved Ant Colony Algorithm",
        "authors": "Lin Lu, Xinxin Jiang",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105742"
    },
    {
        "id": 34163,
        "title": "A NEW TECHNIQUE BASED ON ANT COLONY OPTIMIZATION FOR DESIGNING MINING PUSHBACKS IN THE PRESENCE OF GEOLOGICAL UNCERTAINTY",
        "authors": "Seyyed-Omid Gilani, Sayfoddin Moosazadeh, Rashed Poormirzaee",
        "published": "2023",
        "citations": 0,
        "abstract": "An essential task in the open-pit mine optimizing process is determining the extraction time of material located in the ultimate pit, considering some operational and economic constraints. The proper design of pushbacks has a significant impact on the optimum production planning. On the other hand, some uncertainty sources such as in-situ grade cause both deviations from production and financial goals. This paper presents an extension of a multi-stage formulation for risk-based pushback designing that utilizes the ant colony optimization (ACO) algorithm to solve it. For more detailed studies, two different strategies were developed according to statistical and probabilistic issues. The data of Songun copper mine located in NW Iran was used to evaluate the ability of the proposed approach in controlling the risk of deviation from production targets and increasing the project value. The results indicated the effectiveness of the proposed approach in pushback designing based on geological uncertainty. Examining different strategies showed that the technique based on multiple probability produces better solutions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17794/rgn.2023.1.10"
    },
    {
        "id": 34164,
        "title": "Study on Optimization of Vehicle Routing Problem by Improved Ant Colony Algorithm",
        "authors": "Huixin Deng, Junli Wu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450625"
    },
    {
        "id": 34165,
        "title": "Metaheuristic approach to optimal power flow using mixed integer distributed ant colony optimization",
        "authors": "",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aee.2020.133029"
    },
    {
        "id": 34166,
        "title": "Path-Planning Strategy: Adaptive Ant Colony Optimization Combined with an Enhanced Dynamic Window Approach",
        "authors": "Dongri Shan, Shuaishuai Zhang, Xiaofang Wang, Peng Zhang",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "Aiming to resolve the problems of slow convergence speed and inability to plan in real time when ant colony optimization (ACO) performs global path planning, we propose a path-planning method that improves adaptive ant colony optimization (IAACO) with the dynamic window approach (DWA). Firstly, the heuristic information function is modified, and the adaptive adjustment factor is added to speed up the algorithm’s convergence rate; secondly, elite ants and max–min ants systems are implemented to enhance the global pheromone updating process, and an adaptive pheromone volatilization factor is aimed at preventing the algorithm from enhancing its global search capabilities; then, the path optimization and withdrawal mechanism is utilized to enable smoother functioning and to avoid the deadlocks; finally, a new distance function is introduced in the evaluation function of DWA to the enhance real-time obstacle-avoidance ability. The simulation experiment results reveal that the path length of the IAACO can be shortened by 10.1% and 13.7% in contrast to the ACO. The iteration count can be decreased by 63.3% and 63.0%, respectively, leading to an enhanced optimization performance in global path planning and achieving dynamic real-time obstacle avoidance for local path planning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13050825"
    },
    {
        "id": 34167,
        "title": "Punching path optimization method for warp-knitted vamp based on machine vision and improved ant colony algorithm",
        "authors": "Xinfu Chi, Qiyang Li, Xiaowei Zhang, Hongxia Yan",
        "published": "2023-1",
        "citations": 0,
        "abstract": " Aiming at the current problems of duplicated paths and low work efficiency in machine punching of warp knitted vamp marker points, this paper proposes a punching path planning method of machine vision combined with intelligent algorithms. The method can improve the timeliness of visual recognition of punching location by limiting the search area and similarity function threshold, and improve the ability of global search and adaptive adjustment in punching path planning by combining with the improved ant colony algorithm to calculate a more accurate and optimized path more efficiently. Through the visual recognition test and the simulation test of the improved ant colony algorithm, the results show that the template matching can correctly identify the positioning hole marker points for different styles, rotation directions and lighting conditions, and the recognition accuracy is 0.43 mm and the repeat positioning accuracy is 0.09 mm; meanwhile, the improved ant colony algorithm can effectively avoid the local optimal solution, which can improve the optimal rate of the result by about 38% and the algorithm can reduce the number of iterations of the optimal solution within 60 times, which greatly saves the calculation time of path planning. The method can be used to improve the efficiency of punching in the actual warp knit vamp punching. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/15589250221138909"
    },
    {
        "id": 34168,
        "title": "Design of Available Land Space Optimization Model Based on Ant Colony Optimization Algorithm",
        "authors": "Zhaolei Xu, Changjian Feng",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicacs57338.2023.10099535"
    },
    {
        "id": 34169,
        "title": "Hybrid genetic ant colony optimization algorithm for full-coverage path planning of gardening pruning robots",
        "authors": "Xiaolin Xie, Zixiang Yan, Zhihong Zhang, Yibo Qin, Hang Jin, Man Xu",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11370-024-00525-6"
    },
    {
        "id": 34170,
        "title": "Ant Colony Algorithm Path Planning Based on Genetic Algorithm Fusion in 2D Grid Maps",
        "authors": "Yilin Zhang, Qiang Zhao",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccr60000.2023.10444842"
    },
    {
        "id": 34171,
        "title": "Research on Path Planning Based on Fusion of Yen’s Algorithm and Ant Colony Algorithm",
        "authors": "Lu Guo, Qian Chen, Yu Zhang, Fei Ma",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484869.198"
    },
    {
        "id": 34172,
        "title": "Dynamic Energy-Efficient Path Planning for Electric Vehicles Using an Enhanced Ant Colony Algorithm",
        "authors": "",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17559/tv-20230510000618"
    },
    {
        "id": 34173,
        "title": "Hybrid-Computing for Finding Solutions to NP-Complete Problems in Graphs Using Ant Colony Optimization",
        "authors": "Valery A. Villarruel-Mosquera, María Gabriela Zumárraga, Alejandra Ospina, Daniel Riofrío, Diego Benítez, Noel Pérez, Felipe Grijalva, Ricardo Flores Moyano, Maria Baldeon-Calisto",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ropec58757.2023.10409466"
    },
    {
        "id": 34174,
        "title": "Intelligent Optimization of CMOS Operational Amplifier Using 3D Ant Colony Optimization",
        "authors": "Samir Barra,  ",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "This paper presents the use of an artificial intelligence (AI) tool based on ant colony behavior to design an operational amplifier circuit. The ant colony optimization (ACO) is implemented in a hybrid evolutionary sizing method to automate analog circuit design. This new meta-heuristic approach that combines the artificial intelligence of an ant colony and the 3D matrix method is developed to determine the optimal dimensions and the main influencing performances of fundamental analog circuits and, including operational amplifiers (op-amps). The proposed methodology uses ACO and Cadence Spectre as dimensioning techniques and implementation platform, respectively. The Three Dimensions (3D) ACO algorithm is successfully used for analog circuit sizing, and the obtained results demonstrate its effectiveness in sizing basic and more complicated analog circuits.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53314/els2327035b"
    },
    {
        "id": 34175,
        "title": "Path Planning of Manipulator Based on Improved Ant Colony Algorithm in 3D space",
        "authors": "Long Ma, Changyong Li",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsp58490.2023.10248517"
    },
    {
        "id": 34176,
        "title": "Ant colony optimization for parallel test assembly",
        "authors": "Luc Zimny, Ulrich Schroeders, Oliver Wilhelm",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "AbstractAnt colony optimization (ACO) algorithms have previously been used to compile single short scales of psychological constructs. In the present article, we showcase the versatility of the ACO to construct multiple parallel short scales that adhere to several competing and interacting criteria simultaneously. Based on an initial pool of 120 knowledge items, we assembled three 12-item tests that (a) adequately cover the construct at the domain level, (b) follow a unidimensional measurement model, (c) allow reliable and (d) precise measurement of factual knowledge, and (e) are gender-fair. Moreover, we aligned the test characteristic and test information functions of the three tests to establish the equivalence of the tests. We cross-validated the assembled short scales and investigated their association with the full scale and covariates that were not included in the optimization procedure. Finally, we discuss potential extensions to metaheuristic test assembly and the equivalence of parallel knowledge tests in general.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3758/s13428-023-02319-7"
    },
    {
        "id": 34177,
        "title": "Continual Learning of LSTM Using Ant Colony Optimization",
        "authors": "Rikitaka Kinoyama, Nagar Anthel Venkatesh Suryanarayanan, Hitoshi Iba",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cec53210.2023.10253990"
    },
    {
        "id": 34178,
        "title": "Mobile Robot Path Planning Based on Improved Ant Colony Algorithm and DWA",
        "authors": "Rui Guo, Hongyang Shi",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435416"
    },
    {
        "id": 34179,
        "title": "Analysis of The Ant Number Effects on Ant Colony Optimization for Solving Russia-20-Nodes-SDVRP Instance",
        "authors": "Ekra Sanggala, Muhammad Ardhya Bisma",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "SDVRP is a variation of the CVRP that allows different vehicles to visit the same node. ACO performance is influenced by it’s parameter value. The number of ants parameter has a strong influence on ACO Performance, because it influences directly on solution quality and computation time. It is too hard to find the parameter value that can make ACO performance being the best performance. Because of this, what can be done is to test several parameter values, then compare the ACO performance of each parameter value. Russia-20-Nodes-SDVRP Instance is attractive to be solved because it’s number of nodes are not too many, only 20 nodes. Based on that number of nodes, the computation time of this instance is relatively fast and it has a lot of solution candidate. This research focus on the ant number effects on ACO for Solving Russia-20-Nodes-SDVRP Instance. Five ant numbers will be tested, they are 5, 10, 15, 20 and 25 ants, each ant number will be tested 10 times, so there will be 50 tests. These tests show that more ants used, greater possibility of getting a better route, but longer calculation time needed. The decrease in average of length of route is 1,1521% while the increase in average of calculation time is 42.5525%.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.37577/sainteks.v5i2.608"
    },
    {
        "id": 34180,
        "title": "ANT COLONY OPTIMIZATION TECHNIQUE FOR EDGE DETECTION OF AN IMAGE",
        "authors": "",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets37700"
    },
    {
        "id": 34181,
        "title": "Ant Colony Optimization based Array Design of Wave Energy Converters",
        "authors": "Junzheng Wang, Xi Wang",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aeees56888.2023.10114112"
    },
    {
        "id": 34182,
        "title": "Cloud workflow scheduling optimization research based on ant colony algorithm",
        "authors": "",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2023.060502"
    },
    {
        "id": 34183,
        "title": "Optimal Path Planning Based on Improved Ant Colony Algorithm",
        "authors": "Guangya Zhang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435412"
    },
    {
        "id": 34184,
        "title": "Research on Patrol Path Planning Based on Ant Colony Optimization for Unmanned Surface Vessels",
        "authors": "Yuan Lin, Naimeng Cang, Guixian Qu, Li Chen, Dongsheng Guo",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218938"
    },
    {
        "id": 34185,
        "title": "Optimization of Association Rule Using Ant Colony Optimization (ACO) Approach",
        "authors": " Roni La’biran,  Muhammad Kristiawan",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "The Apriori algorithm creates all possible association rules between items in the database using the Association Rule Mining and Apriori Algorithm. Using Ant Colony Optimization, a new algorithm is proposed for improving association rule mining results. Using ant colony behaviour as a starting point, an optimization of ant colonies (ACO) is developed. The Apriori algorithm creates association rules. Determine the weakest rule set and reduce the association rules to find rules of higher quality than apriori based on the Ant Colony algorithm's threshold value. Through optimization and improvement of rules generated for ACO, the proposed research work aims to reduce the scanning of datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31185/wjcms.190"
    },
    {
        "id": 34186,
        "title": "Monte Carlo-based improved ant colony optimization for path planning of welding robot",
        "authors": "Tiancheng Wang, Lei Wang, Dongdong Li, Jingcao Cai, Yixuan Wang",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jksuci.2023.101603"
    },
    {
        "id": 34187,
        "title": "Multipath Energy Optimization Broadcast Routing Protocol for Wireless Sensor Network Using Genetic Algorithm and Ant Colony Optimization",
        "authors": "Isaac Homeda Osei, Eric  Opoku Osei",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4358067"
    },
    {
        "id": 34188,
        "title": "A New Ant Colony Optimization Algorithm for Optimization of Software Reliability",
        "authors": " Narender, Sona Malhotra, Sanjeev Dhawan",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaect60202.2024.10469079"
    },
    {
        "id": 34189,
        "title": "Research on Subway Fire Evacuation Path Planning Based on Improved Ant Colony Algorithm",
        "authors": "Ganglong Duan, Meng Liu, Weiwei Kong, Bowen Cui",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326893"
    },
    {
        "id": 34190,
        "title": "Survey on Task Scheduling with Ant Colony Optimization",
        "authors": "Surikha Bhetiwal, Santanu Kr. Misra",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176927"
    },
    {
        "id": 34191,
        "title": "Research on path planning based on improved ant colony algorithm",
        "authors": "Shicheng Wang, Zhian Zhang, Xuegong Huang",
        "published": "2023-4-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671075"
    },
    {
        "id": 34192,
        "title": "UAV path planning based on improved ant colony algorithm",
        "authors": "Guangxing Li, Yuan Li",
        "published": "2023-5-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2678893"
    },
    {
        "id": 34193,
        "title": "Optimal Placement of Distribution Substation Using Multi-Objective Ant Colony Optimization",
        "authors": "Abel Airoboman, Shefiu O. Ibrahim, Braide S. Lucky",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/powerafrica57932.2023.10363239"
    },
    {
        "id": 34194,
        "title": "Optimisation method of regional logistics delivery path based on ant colony algorithm",
        "authors": "Yanhua Huang, Liying Su",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsd.2024.10062704"
    },
    {
        "id": 34195,
        "title": "Ant colony optimization for packing process optimization in multi-head weigher machines",
        "authors": "Teddy Nurcahyadi, Christian Blum",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0150450"
    },
    {
        "id": 34196,
        "title": "Intelligent Course Scheduling System for College Nursing Teaching Based on Ant Colony Optimization Algorithms",
        "authors": "Jie Wang",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asiancon58793.2023.10269835"
    },
    {
        "id": 34197,
        "title": "Path Planning: An Analytical Comparison of A* Algorithm Fusion DWA and Ant Colony Algorithm Fusion DWA",
        "authors": "Ernuo Zhang",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "In recent decades, the robotics sector has grown significantly, and the automation of industrial production and daily life has become a shared objective. In recent years, self-driving cars have emerged around the globe, but the majority are still in the research phase and very few are in use in developed regions, not only because of their cost, but also because of their safety and efficiency for path planning and the speed of avoidance in the face of dynamic obstacles, which has been a concern. In this work, multiple path planning algorithms, including the A* method, the dynamic window technique, and the ant colony optimization (ACO) algorithm, will be empirically explored. Initially, the fundamental algorithm will be enhanced, and then the enhanced algorithms will be fused, resulting in a considerable increase in responsiveness and computing efficiency. The study will then attempt to combine the A* algorithm and the ACO algorithm with the dynamic window method and analyse the pros and cons of the two fusion algorithms for path planning in various situations. The A* algorithm fused with the dynamic window method is, on average, more suited for complex situations than the ACO algorithm fused with the dynamic window technique.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v63i.10882"
    },
    {
        "id": 34198,
        "title": "An Improved A-star Algorithm for Path Planning Based on Ant Colony Optimization",
        "authors": "Yingbo Luo, Meibao Yao, Xueming Xiao, Bo Zheng",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oncon60463.2023.10430982"
    },
    {
        "id": 34199,
        "title": "Spiral Search Ant Colony Optimization Based AlexNet Model for Emotion Recognition",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0630.03"
    },
    {
        "id": 34200,
        "title": "Research on path planning of mobile robot based on improved ant colony algorithm",
        "authors": "Chenglong Xue, Jian Wu",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2674663"
    },
    {
        "id": 34201,
        "title": "Research on the planning of an ant colony algorithm in the planning of unmanned vehicle delivery path",
        "authors": "Wusheng Li",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaica58456.2023.10405590"
    },
    {
        "id": 34202,
        "title": "Study on the Use of the Ant Colony Algorithm and Genetic Algorithm for Travelling Salesman Problem Path Planning",
        "authors": "Yizhe Xia",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsi60108.2023.00021"
    },
    {
        "id": 34203,
        "title": "Improve the Application of Ant Colony Optimization Algorithm in Distribution Network Planning",
        "authors": "Jie Wang, Ludong Chen, Xuefeng Bai, Yan Zhang, Pengcheng Zhang",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470925"
    },
    {
        "id": 34204,
        "title": "Evaluation of Bridge Wind Barrier Parameter Optimization System Based on Ant Colony Algorithm",
        "authors": "Shiwen Wang",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245115"
    },
    {
        "id": 34205,
        "title": "Optimizing Pathfinding: A Confluence of Ant Colony Optimization and GBFS",
        "authors": "Anirudh Sowrirajan, Muhamed Harish",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452461"
    },
    {
        "id": 34206,
        "title": "Data Center Traffic Rescheduling Algorithm Based on Ant Colony Optimization Algorithm",
        "authors": "ShiBin Li, ZhaoHua Long",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictech58362.2023.00030"
    },
    {
        "id": 34207,
        "title": "Research on Path Planning Based on Improved Ant Colony Algorithm",
        "authors": "Wenliang Peng, Lili Wang, Huizhan Yang, Guiping Lu",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda60612.2024.10485871"
    },
    {
        "id": 34208,
        "title": "Characteristics and Optimization Strategies of A* Algorithm and Ant Colony Optimization in Global Path Planning Algorithm",
        "authors": "Yun Ni, Qinghua Zhuo, Ning Li, Kaihuan Yu, Miao He, Xinlong Gao",
        "published": "2023-3-15",
        "citations": 6,
        "abstract": " A* algorithm and ant colony optimization (ACO) are more widely used in path planning among global path planning algorithms. The optimization process is analyzed and summarized from the principles and characteristics of the two algorithms, A* algorithm is mainly optimized in terms of point selection and improvement of heuristic function; and ACO is mainly investigated in terms of transfer probability and pheromone positive feedback for improvement and optimization. Taking a single algorithm solving complex optimization problems difficulties into consideration, a splitting strategy can be used. So that local path or intelligent path optimization algorithms are incorporated in global path planning to improve search efficiency and optimization quality. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0218001423510060"
    },
    {
        "id": 34209,
        "title": "Phase Transition in Ant Colony Optimization",
        "authors": "Shintaro Mori, Shogo Nakamura, Kazuaki Nakayama, Masato Hisakado",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "Ant colony optimization (ACO) is a stochastic optimization algorithm inspired by the foraging behavior of ants. We investigate a simplified computational model of ACO, wherein ants sequentially engage in binary decision-making tasks, leaving pheromone trails contingent upon their choices. The quantity of pheromone left is the number of correct answers. We scrutinize the impact of a salient parameter in the ACO algorithm, specifically, the exponent α, which governs the pheromone levels in the stochastic choice function. In the absence of pheromone evaporation, the system is accurately modeled as a multivariate nonlinear Pólya urn, undergoing phase transition as α varies. The probability of selecting the correct answer for each question asymptotically approaches the stable fixed point of the nonlinear Pólya urn. The system exhibits dual stable fixed points for α≥αc and a singular stable fixed point for α<αc where αc is the critical value. When pheromone evaporates over a time scale τ, the phase transition does not occur and leads to a bimodal stationary distribution of probabilities for α≥αc and a monomodal distribution for α<αc.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/physics6010009"
    },
    {
        "id": 34210,
        "title": "Optimal Sizing of CMOS Operational Amplifier by an Improved Ant Colony Optimization Technique",
        "authors": "Bachir Benhala",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssd58187.2023.10411317"
    },
    {
        "id": 34211,
        "title": "UAV 3D path planning based on improved ant colony algorithm",
        "authors": "Sheng Ding, zhihong Liang, Bo Liu",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675274"
    },
    {
        "id": 34212,
        "title": "Geo-Economic Analysis Based on an Improved Ant Colony Optimization",
        "authors": "Wenshuang Zhao, Nan Jiang, Yuanyuan Wei, Xinke Zhao",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "This paper addresses the optimal path selection problem for economic corridors, which is a significant issue in the field of geo-economics. The paper has utilized the spatiotemporal characteristics of geo-economics and identified the development needs in this field to propose an improved ant colony optimization (ACO) strategy. The proposed strategy focuses on enhancing the heuristic function, functional area setting, and pheromone updating strategy. The heuristic factors and transfer probabilities have been improved to couple the path nature, which were based on an analysis of the factors that influence geo-economics. This improvement enhances the applicability of the ACO to path selection problems in macrospace. Additionally, the paper has differentiated the priority of path nodes by setting functional areas, which adds directionality to path selection. The improved ACO has been applied to analyze the optimal path in macroscopic economic space. The experimental validation was conducted in the Indo-Pacific region and economic corridors in China within this region, and corresponding potential geo-economic hubs were analyzed. The experimental results were validated using the Mann−Whitney U test and an evaluation method based on path effectiveness. The feasibility and objectivity of the proposed method were verified. This research provides a valuable exploration of the problem of path selection in macrospace and time and provides decision aid for the construction and adjustment development of a country’s geo-economic relations in a given region. It is a technical reference for establishing sustainable development strategies and national and regional economic planning. Overall, this work contributes significantly to the field of geo-economics and demonstrates the effectiveness of the proposed method through experimental validation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15064758"
    },
    {
        "id": 34213,
        "title": "Ant Colony Optimization Algorithm for the Hybrid Flow Shop Scheduling Problem with Integrated Consideration of Fixture Resources",
        "authors": "Longlong Xu, Jian Guo, Lixia Zhu",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023045037"
    },
    {
        "id": 34214,
        "title": "A hierarchical heterogeneous ant colony optimization based fingerprint recognition system",
        "authors": "N.K. Sreeja",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2023.200180"
    },
    {
        "id": 34215,
        "title": "Retraction Note: Gauss interference ant colony algorithm-based optimization of UAV mission planning",
        "authors": "Fanlei Yan",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-024-05982-5"
    },
    {
        "id": 34216,
        "title": "Research on path planning of tea picking robot based on ant colony algorithm",
        "authors": "Minghui Wu, Bo Gao, Heping Hu, Konglin Hong",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": " Robot tea picking is an inevitable trend to solve the problem of tea picking, and the picking path planning is directly related to the robot picking efficiency. An Improved Ant Colony Algorithm (IACA) is proposed, which firstly introduces the adaptive adjustment mechanism into the pheromone volatilization factor of the ant colony algorithm, and then sets the pheromone volatilization factor with a high initial value to improve the searching speed, and then adjusts the size of its value within a certain range in real time according to the iterative results, and finally solves the problem that the searching of the ant colony algorithm is prone to fall into the local optimal solution. On the basis of visual recognition of tea leaves and obtaining coordinate information, the improved ant colony algorithm is used to enter the path planning simulation experiments, and the planning results of the other six algorithms are compared with the similar algorithms and dissimilar algorithms, and the experimental results indicate that the IACA method has improved the shortest path index by 5% compared to the basic ant colony algorithm, and by an average of 4% compared to similar improved ant colony algorithms. In comparison to different optimization algorithms, the enhancement has an average increase of 6%; Furthermore, the convergence speed has been improved by 60% compared to six other methods. The standard deviation of repeated experimental results is 50% lower than the other six methods. The gap between the results of multiple repeated experiments is small, the degree of fluctuation is low, and the calculation results are more stable, which verifies the superiority of IACA method. Therefore, the improvement of the ant colony algorithm makes the pheromone concentration value with adaptive adjustment ability, which reflects good effects in path optimization, convergence speed improvement, stability of results, etc., and has good application value for the path planning problems such as tea picking, which has complex paths and large computational volume. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00202940241228996"
    },
    {
        "id": 34217,
        "title": "Determining the Number of Ants in Ant Colony Optimization",
        "authors": "Cristina Arranz",
        "published": "2023-1-5",
        "citations": 1,
        "abstract": "The goal of this contribution article is to investigate the effect of the numbers of ants on the Ant Colony Optimization (ACO) metaheuristic's obtained solution while addressing the Traveling Salesman Problem. Within a restricted number of iterations, the purpose was to see how the duration of the calculated tours varied for various numbers of ants. Three well-known ACO algorithms: Elitist Ant System (EAS), Ranked Ant System (RAS), and Min-Max Ant System (MMAS), were developed and tested in this paper. The findings revealed comparable patterns across several test instances. EAS and RAS, both of which use specialized ants, demonstrated that the number of specialists had a significant impact on the duration of solutions. Normal ants, on the other hand, had no effect on the solutions. The response differed somewhat between EAS and MMAS, with a smaller number of ants being more preferred. When working with five specialists and ants, which are the same to the smart cities, however, RAS outperformed by a considerable margin.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/0088/jbsha202303008"
    },
    {
        "id": 34218,
        "title": "Ant Colony Optimization Based Routing Strategies for Internet of Things",
        "authors": "Anukriti Sharma, Sharad Sharma, Dushyant Gupta",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5109/6793654"
    },
    {
        "id": 34219,
        "title": "Research on Logistics Distribution Route Optimization Based on Ant Colony Algorithm",
        "authors": "Siyuan Guo",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda56825.2023.10090583"
    },
    {
        "id": 34220,
        "title": "A novel travel route planning method based on an ant colony optimization algorithm",
        "authors": "Shan He",
        "published": "2023-10-20",
        "citations": 3,
        "abstract": "Abstract\nAs people’s living standards improve, tourism has become an important way for people to spend their time on leisure and entertainment. The growing number of tourists in recent years has given rise to the creation of tourism-related ancillary services. Travelers need to choose a travel route that suits their needs and expectations and do it in a way that does not cause a waste of time, whether it is an emerging self-driving tour or a traditional tour group. Therefore, the optimization of tourist routes is of great significance to the majority of tourists. Given the planning requirements of tourist attractions in the post-epidemic era, an ant colony-based optimization algorithm is proposed to resolve the planning problem of optimal tourist routes. An optimized pheromone update strategy is also proposed based on the basic ant colony optimization algorithm. The optimized ant colony algorithm tries to balance two conflicting concepts, namely, flows into tourist attractions and the carrying capacity of destinations. To analyze the performance of the proposed optimization algorithm, the effects of different optimization algorithms on the route planning of tourist attractions were compared in the experiment, and the acceleration ratio of the optimized ant colony algorithm was tested using the graphics processing unit parallel computing program. The results show that the proposed algorithm provides certain advantages and has certain potential in parallel computing. To sum up, this study provides a better scientific basis for optimal tourist route planning and has a good reference value.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/geo-2022-0541"
    },
    {
        "id": 34221,
        "title": "Hybrid Parallel Ant Colony Optimization for Application to Quantum Computing to Solve Large-Scale Combinatorial Optimization Problems",
        "authors": "Bishad Ghimire, Ausif Mahmood, Khaled Elleithy",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Quantum computing is a promising technology that may provide breakthrough solutions to today’s difficult problems such as breaking encryption and solving large-scale combinatorial optimization problems. An algorithm referred to as Quantum Approximate Optimization Algorithm (QAOA) has been recently proposed to approximately solve hard problems using a protocol know as bang–bang. The technique is based on unitary evolution using a Hamiltonian encoding of the objective function of the combinatorial optimization problem. The QAOA was explored in the context of several optimization problems such as the Max-Cut problem and the Traveling Salesman Problem (TSP). Due to the relatively small node-size solution capability of the available quantum computers and simulators, we developed a hybrid approach where sub-graphs of a TSP tour can be executed on a quantum computer, and the results from the quantum optimization are combined for a further optimization of the whole tour. Since the local optimization of a sub-graph is prone to becoming trapped in a local minimum, we overcame this problem by using a parallel Ant Colony Optimization (ACO) algorithm with periodic pheromone exchange between colonies. Our method exceeds existing approaches which have attempted partitioning a graph for small problems (less than 48 nodes) with sub-optimal results. We obtained optimum results for benchmarks with less than 150 nodes and results usually within 1% of the known optimal solution for benchmarks with around 2000 nodes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132111817"
    },
    {
        "id": 34222,
        "title": "Route Optimization in the Inbound Logistics Based on Ant Colony Algorithm",
        "authors": "Jiashan Zhang, Xiaoqun Lin",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccnea60107.2023.00101"
    },
    {
        "id": 34223,
        "title": "Retracted: Optimization Simulation of English Speech Recognition Accuracy Based on Improved Ant Colony Algorithm",
        "authors": "",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9807614"
    },
    {
        "id": 34224,
        "title": "Research on collision avoidance simulation for autonomous underwater vehicles using ant colony optimization algorithm",
        "authors": "",
        "published": "2023-11",
        "citations": 0,
        "abstract": "Autonomous Underwater Vehicles (AUVs) are increasingly crucial in exploiting and exploring marine resources. Route building and obstacle avoidance are the core technologies that help this device perform aquatic processes. Collision avoidance methods use acoustic sensors and sonar systems to help detect targets, but these devices have difficulty seeing at short distances. This article proposes a method to simulate the autonomous process of a Remotely Operated Vehicle (ROV) or AUV in a virtual environment based on several path planning and obstacle avoidance algorithms. At the same time, the author used sonar data and optimization algorithms in the route construction process to address the limitations of AUVs and ROVs and the influence of the marine environment. Finally, through Unity 3D software, simulate the underwater operation of the AUV and check the algorithm results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55228/jtst.12(6).28-37"
    },
    {
        "id": 34225,
        "title": "Optimization Design and Application of Training Evaluation Model for Power Enterprises based on Ant Colony Algorithm",
        "authors": "Yuanzhong Wu",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235188"
    },
    {
        "id": 34226,
        "title": "Applying ant colony optimization algorithm to solve flying probe inspection problem",
        "authors": "Chih-Yung Chen, Yu-Ming Chang",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226723"
    },
    {
        "id": 34227,
        "title": "Optimization of express route planning based on ant colony algorithm",
        "authors": "Yichen Li, Hongyan Chen, Kaibin Yuan",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsm59373.2023.00024"
    },
    {
        "id": 34228,
        "title": "Fair Path Generation for Multiple Agents Using Ant Colony Optimization in Consecutive Pattern Formations",
        "authors": "Yoshie Suzuki, Stephen Raharja, Toshiharu Sugawara",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "This study proposes a method to automatically generate paths for multiple autonomous agents to collectively form a sequence of consecutive patterns. Several studies have considered minimizing the total travel distances of all agents for formation transitions in applications with multiple self-driving robots, such as unmanned aerial vehicle shows by drones or group actions in which self-propelled robots synchronously move together, consecutively transforming the patterns without collisions. However, few studies consider fairness in travel distance between agents, which can lead to battery exhaustion for certain agents and thereafter reduced operating time. Furthermore, because these group actions are usually performed with a large number of agents, they can have only small batteries to reduce cost and weight, but their performance time depends on the battery duration. The proposed method, which is based on ant colony optimization (ACO), considers the fairness in distances traveled by agents as well as the less total traveling distances, and can achieve long transitions in both three- and two-dimensional spaces. Our experiments demonstrate that the proposed method based on ACO allows agents to execute more formation patterns without collisions than the conventional method, which is also based on ACO.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20965/jaciii.2024.p0159"
    },
    {
        "id": 34229,
        "title": "A Fixed-wing UAV Swarm Coverage Search Path Planning Method Based on Adaptive Evolutionary Ant Colony Algorithm",
        "authors": "Wenbin Xu, Shuoyu Wang, Haocheng Du, Xuefei Mao, Songtao Chen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451642"
    },
    {
        "id": 34230,
        "title": "Adaptive Ant Colony Optimization with Sub-Population and Fuzzy Logic for 3D Laser Scanning Path Planning",
        "authors": "Junfang Song, Yuanyuan Pu, Xiaoyu Xu",
        "published": "2024-2-8",
        "citations": 1,
        "abstract": "For the precise measurement of complex surfaces, determining the position, direction, and path of a laser sensor probe is crucial before obtaining exact measurements. Accurate surface measurement hinges on modifying the overtures of a laser sensor and planning the scan path of the point laser displacement sensor probe to optimize the alignment of its measurement velocity and accuracy. This manuscript proposes a 3D surface laser scanning path planning technique that utilizes adaptive ant colony optimization with sub-population and fuzzy logic (SFACO), which involves the consideration of the measurement point layout, probe attitude, and path planning. Firstly, this study is based on a four-coordinate measuring machine paired with a point laser displacement sensor probe. The laser scanning four-coordinate measuring instrument is used to establish a coordinate system, and the relationship between them is transformed. The readings of each axis of the object being measured under the normal measuring attitude are then reversed through the coordinate system transformation, thus resulting in the optimal measuring attitude. The nominal distance matrix, which demonstrates the significance of the optimal measuring attitude, is then created based on the readings of all the points to be measured. Subsequently, a fuzzy ACO algorithm that integrates multiple swarm adaptive and dynamic domain structures is suggested to enhance the algorithm’s performance by refining and utilizing multiple swarm adaptive and fuzzy operators. The efficacy of the algorithm is verified through experiments with 13 popular TSP benchmark datasets, thereby demonstrating the complexity of the SFACO approach. Ultimately, the path planning problem of surface 3D laser scanning measurement is addressed by employing the proposed SFACO algorithm in conjunction with a nominal distance matrix.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24041098"
    },
    {
        "id": 34231,
        "title": "Path Planning for an Autonomous Vehicle based on the Ant Colony Algorithm: A Review",
        "authors": "Desi Windi Sari, Suci Dwijayanti, Bhakti Yudho Suprapto",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwaiip58158.2023.10462744"
    },
    {
        "id": 34232,
        "title": "Retracted: Path Planning of Energy Robot Based on Improved Ant Colony Algorithm",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9845028"
    },
    {
        "id": 34233,
        "title": "Improvement of Ant Mill in Ant Colony Topology Optimization",
        "authors": "Hiroshi HASEGAWA, Sou OKIYAMA",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1299/jsmemecj.2023.j122p-05"
    },
    {
        "id": 34234,
        "title": "Empirical Mode Decomposition with Imf Using Ant Colony Optimization",
        "authors": " G. Anandharaj, R. Angelin Preethi",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "The serial remote sensing images allow us to view how a certain area has changed and grown across period. Even though these raw images have fewer opportunities to generate information and additional insight, serial remote sensing images (SRSI) offer a significant opportunity to generate clusters and patterns. The implementation of SRSI aggregation is supported by the developments of patterns in a variety of circumstances, which include urbanization, the spread of native vegetation, and farming. We propose a novel outlook to mining sequence patterns that makes use of Ant Colony Optimization and Empirical Mode Decomposition. The newly created Empirical Mode Decomposition (EMD) and Ant Colony Optimization (ACO) approach is integrated to extract the most important characteristics features of significantly accurate performance from serial remote sensing images based on distinct criteria. The outcomes demonstrate that the accuracy of projected sequence patterns can be greatly improved by combining a new hybrid method with EMD and ACO feature selection. Because of this, the method is appealing for employing a farmland dataset based on serial remote sensing images to create ground-based stream-flow for strategically extracting spatially sequential patterns despite requesting less computational mining time and cost.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/tjjpt.v44.i5.2523"
    },
    {
        "id": 34235,
        "title": "Multi-Objective Optimization Model of Green Building Construction Process Based on Ant Colony Algorithm",
        "authors": "Juan Pan",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indiscon58499.2023.10269958"
    },
    {
        "id": 34236,
        "title": "Design and optimization of logistics distribution route based on improved ant colony algorithm",
        "authors": "Dan Liu, Xiulian Hu, Qi Jiang",
        "published": "2023-2",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijleo.2022.170405"
    },
    {
        "id": 34237,
        "title": "A Novel Modified Ant Colony Optimization for Solving Multi-Skill Resource-Constrained Project Scheduling Problem",
        "authors": "Chiabwoot Ratanavilisagul",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccia59741.2023.00020"
    },
    {
        "id": 34238,
        "title": "An Efficient Allocation for Lung Transplantation Using Ant Colony Optimization",
        "authors": "Lina M. K. Al-Ebbini",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.030100"
    },
    {
        "id": 34239,
        "title": "An Effective Hybrid Ant Colony Optimization for the Knapsack Problem Using Multi-Directional Search",
        "authors": "Imen BenMansour",
        "published": "2023-1-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-022-01564-5"
    },
    {
        "id": 34240,
        "title": "Development study on artificial intelligence target detection technology with ant colony optimization",
        "authors": "K. Zhang, Y. Zhu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.2908"
    },
    {
        "id": 34241,
        "title": "Emergency Automobile Data Transmission with Ant Colony Optimization (ACO)",
        "authors": "Chetana Hemant Nemade, Uma Pujeri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.5.1003-1011"
    },
    {
        "id": 34242,
        "title": "Simulation of Computer Communication Network Flow Distribution Model Based on Improved Ant Colony Optimization",
        "authors": "Huaping Zhu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257708"
    },
    {
        "id": 34243,
        "title": "Research on Control Model Optimization of Mechanical Design System Based on Ant Colony Algorithm",
        "authors": "Xiangmei Li",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipec57296.2023.00057"
    },
    {
        "id": 34244,
        "title": "A Dynamic Ant Colony Optimization for Solving the Static Frequency Assignment Problem",
        "authors": "Khaled Alrajhi",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "This study proposes a dynamic ant colony optimization algorithm to solve the static frequency assignment problem. This approach solves the static problem by modeling it as a dynamic problem through dividing this static problem into smaller sub-problems, which are then solved in turn in a dynamic process. Several novel and existing techniques are used to improve the performance of this algorithm. One of these techniques is applying the concept of a well-known graph colouring algorithm, namely recursive largest first for each sub-problem. Furthermore, this study compares this algorithm using two visibility definitions. The first definition is based on the number of feasible frequencies and the second one is based on the degree. Additionally, we compare this algorithm using two trail definitions. The first one is between requests and frequencies. The second is between requests and requests. This study considers real and randomly generated benchmark datasets of the static problem and our algorithm achieved competitive results comparing with other ant colony optimization algorithms in the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/232029.2023.2.18"
    },
    {
        "id": 34245,
        "title": "AntNetAlign: Ant Colony Optimization for Network Alignment",
        "authors": "Guillem Rodríguez Corominas, Maria J. Blesa, Christian Blum",
        "published": "2023-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2022.109832"
    },
    {
        "id": 34246,
        "title": "A dimensionless model and ant colony optimization fusion temperature prediction in tunnel fires",
        "authors": "Bin Sun",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110564"
    },
    {
        "id": 34247,
        "title": "Ant Colony Optimization Algorithm for Feature Selection in Suspicious Transaction Detection System",
        "authors": "Karina Niyazova, Assel Mukasheva, Gani Balbayev, Teodor Iliev, Nazym Mirambayeva, Mukhamedali Uzakbayev",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2024060018"
    },
    {
        "id": 34248,
        "title": "Optimization study of bus route based on improved ant colony algorithm",
        "authors": "Jie Zou, Haoran Li",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3024018"
    },
    {
        "id": 34249,
        "title": "Energy Efficient Networks Using Ant Colony Optimization with Game Theory Clustering",
        "authors": "Harish Gunigari, S. Chitra",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.029155"
    },
    {
        "id": 34250,
        "title": "A new routing method based on ant colony optimization in vehicular ad-hoc network",
        "authors": "Oussama Sbayti, Khalid Housni",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "Vehicular Ad hoc Networks (VANETs) face significant challenges in providing high-quality service. These networks enable vehicles to exchange critical information, such as road obstacles and accidents, and support various communication modes known as Vehicle-to-Everything (V2X). This research paper proposes an intelligent method to improve the quality of service by optimizing path selection between vehicles, aiming to minimize network overhead and enhance routing efficiency. The proposed approach integrates Ant Colony Optimization (ACO) into the Optimized Link State Routing (OLSR) protocol. The effectiveness of this method is validated through implementation and simulation experiments conducted using the Simulation of Urban Mobility (SUMO) and the network simulator (NS3). Simulation results demonstrate that the proposed method outperforms the traditional OLSR algorithm in terms of throughput, average packet delivery rate (PDR), end-to-end delay (E2ED), and average routing overhead.",
        "keywords": "",
        "link": "http://dx.doi.org/10.19139/soic-2310-5070-1766"
    },
    {
        "id": 34251,
        "title": "An enhanced ant colony optimization algorithm for global path planning of deep-sea mining vehicles",
        "authors": "Weixing Liang, Min Lou, Zhangxing Chen, Huiyang Qin, Chen Zhang, Chengwei Cui, Yangyang Wang",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2024.117415"
    },
    {
        "id": 34252,
        "title": "Optimization of the Ant Colony System Algorithm to Search for Distance and Shortest Routes on Travel Salesman Problems",
        "authors": " Paryati",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46253/j.mr.v6i3.a3"
    },
    {
        "id": 34253,
        "title": "Feature Selection using Ant Colony Optimization for Microarray Data Classification",
        "authors": "Sanjay Prajapati, Himansu Das, Mahendra Kumar Gourisaria",
        "published": "2023-3-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112054"
    },
    {
        "id": 34254,
        "title": "Dynamic Route Optimization for Chinese E-Commerce Logistics Based on Ant Colony Algorithm",
        "authors": "Ximin Zhou",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThe limited nature of logistics and distribution vehicles and the variability of customer acceptance service time limit the service efficiency and quality of logistics and distribution. To optimize a logistics distribution path under capacity and time window constraints, a mathematical model of the problem is first developed in this study, with the lowest cost as the model’s objective function. The logistics distribution issue with soft time windows is then addressed using an ant colony algorithm, and a logistics path optimization strategy based on the maximum minimal ant colony system is suggested. Then, the heuristic function is rebuilt to improve the ant colony algorithm’s solution speed, and the pheromone update approach is included. Finally, experimental approaches are used to test the model’s and optimization algorithm’s efficacy for customer sizes of 30, 50, and 100. The experimental results show that the optimized ant colony algorithm has the best value of 2 for α and 3 for β, which can converge earlier. The improved ant colony algorithm also finds the best solution faster than the conventional ant colony method in just 23 rounds. In the mathematical model of the logistics distribution path optimization issue, this study suggests that the optimized ant colony method has the optimization algorithm’s rationality, efficacy, and stability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00325"
    },
    {
        "id": 34255,
        "title": "Extend the Ant Colony Optimization Algorithm for virtualization Technologies to improve the Resources utilization in On-Premises Datacenters",
        "authors": "",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53819/81018102t7000"
    },
    {
        "id": 34256,
        "title": "A Novel Ant Colony-inspired Coverage Path Planning for Internet of Drones",
        "authors": "Lailla M.S. Bine, Azzedine Boukerche, Linnyer B. Ruiz, Antonio A.F. Loureiro",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109963"
    },
    {
        "id": 34257,
        "title": "Optimal Allocation of Energy Storage Systems Considering Demand Response: An Improved Ant Colony Optimization Approach",
        "authors": "Rui Ma",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eeps58791.2023.10257010"
    },
    {
        "id": 34258,
        "title": "Traffic Congestion Prevention Using Ant Colony Optimization",
        "authors": "Aiman AbuSamra, Abeer Ashour, Mai Ghazal, Jehad Aldahdooh, Raghad Abuarja",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iecres57315.2023.10209508"
    },
    {
        "id": 34259,
        "title": "UAV Mission Planning Based on Fish Swarm-ant Colony Optimization",
        "authors": "Wenbiao He, Wenguang Li, Yongjiang Hu",
        "published": "2023-5-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmsp58539.2023.10170791"
    },
    {
        "id": 34260,
        "title": "Improved Ant Colony Optimization and Machine Learning Based Ensemble Intrusion Detection Model",
        "authors": "S. Vanitha, P. Balasubramanie",
        "published": "2023",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.032324"
    },
    {
        "id": 34261,
        "title": "An Adapted Ant Colony Optimization for Feature Selection",
        "authors": "Duygu Yilmaz Eroglu, Umut Akcan",
        "published": "2024-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/08839514.2024.2335098"
    },
    {
        "id": 34262,
        "title": "Research on Optimization Design of RBF Neural Network Based on Ant Colony Algorithm",
        "authors": "Lixia Liu",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdiime59043.2023.00008"
    },
    {
        "id": 34263,
        "title": "Effective Feature Selection Using Multi-Objective Improved Ant Colony Optimization for Breast Cancer Classification",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0630.48"
    },
    {
        "id": 34264,
        "title": "Finger vein recognition method based on ant colony optimization and improved EfficientNetV2",
        "authors": "Xiao Ma, Xuemei Luo",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>Deep learning is an important technology in the field of image recognition. Finger vein recognition based on deep learning is one of the research hotspots in the field of image recognition and has attracted a lot of attention. Among them, CNN is the most core part, which can be trained to get a model that can extract finger vein image features. In the existing research, some studies have used methods such as combination of multiple CNN models and joint loss function to improve the accuracy and robustness of finger vein recognition. However, in practical applications, finger vein recognition still faces some challenges, such as how to solve the interference and noise in finger vein images, how to improve the robustness of the model, and how to solve the cross-domain problem. In this paper, we propose a finger vein recognition method based on ant colony optimization and improved EfficientNetV2, using ACO to participate in ROI extraction, fusing dual attention fusion network (DANet) with EfficientNetV2, and conducting experiments on two publicly available databases, and the results show that the recognition rate using the proposed method on the FV-USM dataset reaches The results show that the proposed method achieves a recognition rate of 98.96% on the FV-USM dataset, which is better than other algorithmic models, proving that the method has good recognition rate and application prospects for finger vein recognition.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023490"
    },
    {
        "id": 34265,
        "title": "Optimization simulation of sports stadium training based on Ant colony algorithm and sensor network",
        "authors": "Guangya Chen, Huifang Wu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2024.101100"
    },
    {
        "id": 34266,
        "title": "A Quantum-Inspired Ant Colony Optimization Algorithm for Parking Lot Rental to Shared E-Scooter Services",
        "authors": "Antonella Nardin, Fabio D’Andreagiovanni",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Electric scooter sharing mobility services have recently spread in major cities all around the world. However, the bad parking behavior of users has become a major source of issues, provoking accidents and compromising urban decorum of public areas. Reducing wild parking habits can be pursued by setting reserved parking spaces. In this work, we consider the problem faced by a municipality that hosts e-scooter sharing services and must choose which locations in its territory may be rented as reserved parking lots to sharing companies, with the aim of maximizing a return on renting and while taking into account spatial consideration and parking needs of local residents. Since this problem may result difficult to solve even for a state-of-the-art optimization software, we propose a hybrid metaheuristic solution algorithm combining a quantum-inspired ant colony optimization algorithm with an exact large neighborhood search. Results of computational tests considering realistic instances referring to the Italian capital city of Rome show the superior performance of the proposed hybrid metaheuristic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a17020080"
    },
    {
        "id": 34267,
        "title": "Improved ant colony algorithm for path planning of mobile robots based on compound prediction mechanism",
        "authors": "Zhongpu Liu, Jianjuan Liu",
        "published": "2023-1-30",
        "citations": 2,
        "abstract": "For the issues of the ant colony algorithm (ACO) to solving the problems in mobile robot path planning, such as the slow optimization speed and the redundant paths in planning results, a high-precision improved ant colony algorithm (IPACO) with fast optimization and compound prediction mechanism is proposed. Firstly, aiming at maximizing the possibility of optimal node selection in the process of path planning, a composite optimal node prediction model is introduced to improve the state transition function. Secondly, a pheromone model with initialize the distribution and “reward or punishment” update mechanism is used to updates the global pheromone concentration directionally, which increases the pheromone concentration of excellent path nodes and the heuristic effect; Finally, a prediction-backward mechanism to deal with the “deadlock” problem in the ant colony search process is adopted in the IPACO algorithm, which enhance the success rate in the ACO algorithm path planning. Five groups of different environments are selected to compare and verify the performance of IPACO algorithm, ACO algorithm and three typical path planning algorithms. The experimental simulation results show that, compared with the ACO algorithm, the convergence speed and the planning path accuracy of the IPACO algorithm are improved by 57.69% and 12.86% respectively, and the convergence speed and the planning path accuracy are significantly improved; the optimal path length, optimization speed and stability of the IPACO algorithm are improved. Which verifies that the IPACO algorithm can effectively improve the environmental compatibility and stability of the ant colony algorithm path planning, and the effect is significantly improved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-222211"
    },
    {
        "id": 34268,
        "title": "Review on Ant Colony Optimization and Partial Swarm Optimization Based Harmonic Elimination Method in Multilevel Inverters for EV Applications",
        "authors": "J. A NishaliniDelcy, F.T Josh, R. Uthirasamy",
        "published": "2023-9-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276152"
    },
    {
        "id": 34269,
        "title": "Hybrid optimization based on heuristic ant colony optimization and modified particle swarm optimization for designing multipath routing protocol in VANETs",
        "authors": "Ahmed Jamal Ahmed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0188883"
    },
    {
        "id": 34270,
        "title": "A Hybrid Algorithm Based on Ant Colony and Genetic Algorithm for AUV Path Planning",
        "authors": "Jihong Hu, Meng Joo Er, Tianhe Liu, Siqi Wang",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cfasta57821.2023.10243252"
    },
    {
        "id": 34271,
        "title": "On the basis of A<sup>*</sup> Algorithm and improved ant colony algorithm for intelligent robot path planning",
        "authors": "Lingxiao Gao, Shuhan Yin, Yuzhe Shao",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10327434"
    },
    {
        "id": 34272,
        "title": "UAV formation optimization model based on ant colony algorithm and particle swarm optimization algorithm",
        "authors": "Yulong Yang, Yujie Zhang, Qi Feng, Linhe Yang, Hongyu Zhang",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10075717"
    },
    {
        "id": 34273,
        "title": "Research on path planning of unmanned vessel based on ant colony algorithm",
        "authors": "Wen-bin Gong, Xia-fu Lv",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2674653"
    },
    {
        "id": 34274,
        "title": "Optimizing Strategy Games: Ant Colony Optimization vs. Minimax Algorithm",
        "authors": "Yoqsan Angeles-García, Valeria Karina Legaria-Santiago, Álvaro Azueto-Ríos, Hiram Calvo",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10371917"
    },
    {
        "id": 34275,
        "title": "Recommending Public Transit Route: Ant-Colony Optimization or Dijkstra?",
        "authors": "Abdul Jabbar, Aryo Pinandito",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmeralda60125.2023.10458207"
    },
    {
        "id": 34276,
        "title": "A new approach based on hybrid ant colony optimization-artificial bee colony algorithm for multi-objective electric vehicle routing problems",
        "authors": "Serap Ercan Comert, Harun Resit Yazgan",
        "published": "2023-8",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106375"
    },
    {
        "id": 34277,
        "title": "EVACUATION ROUTE PLANNING MODEL BASED ON THE FUZZY ANT COLONY OPTIMIZATION ALGORITHM",
        "authors": "O Tymchuk, E Midoian",
        "published": "2023",
        "citations": 0,
        "abstract": "The construction of evacuation routes from urban areas has become an urgent task in the modern world, as the number of emergencies is constantly increasing.  Standard route planning algorithms do not meet the requirements of fast and efficient evacuation because they do not fully consider the environmental parameters and have a high computational complexity, and erroneous results can have critical consequences, including loss of life. The paper proposes a model of finding an optimal evacuation route in emergencies in urban areas based on a modified ant colony optimization algorithm: an ant (a person or a vehicle) is allowed to start moving from several possible vertices of the graph, as well as to end the route at several available vertices. It is connected with the fact that there are usually multiple evacuation start points and destinations. The transitions matrix is built using additional parameters, the uncertainty of which is taken into account using the methods of computing with words and the theory of type-2 fuzzy sets and systems. For modeling, in the paper such additional parameters as the quality of the road surface, the number of road lanes, the level of traffic jams, and the distance to the epicenter of the emergency were used. The proposed model was implemented and applied in one of the quarter of Kyiv.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31548/energiya3(67).2023.132"
    },
    {
        "id": 34278,
        "title": "Computer Network Communication Security Encryption System Based on Ant Colony Optimization Algorithm",
        "authors": "Chunrong Zhou, Zhenghong Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.11.006"
    },
    {
        "id": 34279,
        "title": "Satellite-ground Station Routing Algorithm Based on Improved Ant Colony Optimization-Tabu Search",
        "authors": "Xueying Zhang, Huibin Zhang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435621"
    },
    {
        "id": 34280,
        "title": "ANALYSIS ON PATH OPTIMIZATION OF AGRICULTURAL HANDLING ROBOTS BASED ON ANT COLONY-IMPROVED ARTIFICIAL POTENTIAL FIELD METHOD",
        "authors": "Hexia CHU",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Aiming at the problems of low efficiency and slow function convergence of the ant colony algorithm in path planning of agricultural transport robots, a fusion algorithm combined with the artificial potential field method was proposed. Firstly, the function of each parameter was analyzed according to the mathematical model of the traditional ant colony algorithm, followed by the simulation analysis of the optimal parameters through grid map modeling in MATLAB and data recording. Secondly, the deficiency of the classical artificial potential field method in agriculture, i.e., it could not arrive at the endpoint or realize local locking, was improved by introducing the intermediate point and the relative distance of the target. Finally, the features of the two algorithms were combined and the improved artificial potential field method was integrated with the traditional ant colony algorithm so that the improved artificial potential field method could play a dominant role in the initial path planning stage of agricultural transport robots while the ant colony algorithm exerted the main effect in the later stage with the increase in the pheromone concentration. It was verified through simulation analysis, it was verified that the fusion algorithm of ant colony algorithm and improved artificial potential field method outperforms traditional ant colony algorithm in terms of farthest path, optimal path, running time, and iteration number.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35633/inmateh-71-47"
    },
    {
        "id": 34281,
        "title": "Application of Ant Colony Optimization Algorithm Based on Triangle Inequality Principle and Partition Method Strategy in Robot Path Planning",
        "authors": "Shuai Wu, Qingxia Li, Wenhong Wei",
        "published": "2023-5-27",
        "citations": 4,
        "abstract": "Path planning is an important area of mobile robot research, and the ant colony optimization algorithm is essential for analyzing path planning. However, the current ant colony optimization algorithm applied to the path planning of mobile robots still has some limitations, including early blind search, slow convergence speed, and more turns. To overcome these problems, an improved ant colony optimization algorithm is proposed in this paper. In the improved algorithm, we introduce the idea of triangle inequality and a pseudo-random state transfer strategy to enhance the guidance of target points and improve the search efficiency and quality of the algorithm. In addition, we propose a pheromone update strategy based on the partition method with upper and lower limits on the pheromone concentration. This can not only improve the global search capability and convergence speed of the algorithm but also avoid the premature and stagnation phenomenon of the algorithm during the search. To prevent the ants from getting into a deadlock state, we introduce a backtracking mechanism to enable the ants to explore the solution space better. Finally, to verify the effectiveness of the proposed algorithm, the algorithm is compared with 11 existing methods for solving the robot path planning problem, including several ACO variants and two commonly used algorithms (A* algorithm and Dijkstra algorithm), and the experimental results show that the improved ACO algorithm can plan paths with faster convergence, shorter path lengths, and higher smoothness. Specifically, the algorithm produces the shortest path length with a standard deviation of zero while ensuring the most rapid convergence and the highest smoothness in the case of the shortest path in four different grid environments. These experimental results demonstrate the effectiveness of the proposed algorithm in path planning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12060525"
    },
    {
        "id": 34282,
        "title": "Task Scheduling in Cloud Computing using Mean Ant Colony Optimization",
        "authors": "Aditi S. Kansara, Bhavesh N. Gohil, Nisha Verma",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112102"
    },
    {
        "id": 34283,
        "title": "Multi-Objective Ant Colony Optimization (MOACO) Approach for Multi-Document Text Summarization",
        "authors": "Murali Krishna Muddada, Jayavani Vankara, Sekharamahanti S. Nandini, Girija Rani Karetla, Kaparapu Sowjanya Naidu",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059218"
    },
    {
        "id": 34284,
        "title": "Design of Rural Ambient Intelligence Monitoring System Based on Ant Colony Optimization Algorithm",
        "authors": "Shuai Li, Jingyu Ye",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390270"
    },
    {
        "id": 34285,
        "title": "Optimizing School Bus Routes With Ant Colony Optimization: A Dynamic Approach To Sustainable Transportation Logistics",
        "authors": "Aditya Kumar Sharma -",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "In response to the escalating demands of modern transportation and logistics within the educational sector, this paper presents a novel exploration of Ant Colony Optimization (ACO) applied to school bus routing, a complex subset of the Vehicle Routing Problem (VRP). Traditional methods of addressing VRPs have proven insufficient in navigating the intricate requirements and dynamic nature of routing challenges, necessitating the adoption of more sophisticated heuristic and metaheuristic strategies. By harnessing ACO, inspired by the path-finding capabilities of ants via pheromone trails, this study introduces an innovative approach to dynamically optimize school bus routes. This optimization not only aims for efficiency in routing but also emphasizes environmental considerations and cost reduction. This research extends beyond the theoretical framework of ACO, incorporating practical applications and simulations that reflect real-world conditions such as fluctuating student attendance and varying traffic patterns. Through a comprehensive analysis that includes the development of a Python-based ACO model, calculation of transition probabilities, and a simulation of routing strategies, we demonstrate the algorithm's robustness and versatility. Additionally, we address critical factors such as time windows and bus capacity constraints, underscoring the model's adaptability to the multifaceted dimensions of school bus routing. The findings from this study highlight the significant advantages of applying ACO to VRPs, showcasing notable improvements in route efficiency, fuel consumption, and overall logistical execution compared to conventional routing methods. This research not only contributes to the existing body of knowledge on VRPs and ACO but also sets the stage for future explorations into dynamic routing optimization. It opens avenues for integrating advanced predictive models and real-time data analysis, promising further enhancements in transportation logistics and the potential for broad application across various sectors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62127/aijmr.2024.v02i02.1021"
    },
    {
        "id": 34286,
        "title": "Toward support-vector machine-based ant colony optimization algorithms for intrusion detection",
        "authors": "Ahmed Abdullah Alqarni",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-07906-6"
    },
    {
        "id": 34287,
        "title": "Time-Dependent Multi-Objective Trip Planning by Ant Colony Optimization with Route API",
        "authors": "Etsushi Saeki, Siya Bao, Toshinori Takayama, Nozomu Togawa",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444500"
    },
    {
        "id": 34288,
        "title": "Oilfield Intelligent Production Optimization and System Simulation Based on Ant Colony Algorithm",
        "authors": "Haochen Wang, Kai Zhang, Chengcheng Liu",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acedpi58926.2023.00050"
    },
    {
        "id": 34289,
        "title": "Research on data center load balancing based on particle swarm optimization fusion ant colony optimization algorithm",
        "authors": "Shiyu Song, Jun Wang",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2685899"
    },
    {
        "id": 34290,
        "title": "QoS Improvement using Enhanced Manhattan Mobility Model on Proposed Ant Colony Optimization Technique in MANETs",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56042/jsir.v82i06.1827"
    },
    {
        "id": 34291,
        "title": "Load Balancing in Multi Depot Pickup and Delivery Problem with Ant Colony Optimization",
        "authors": "Teerawat Indravattana, Teerapol Silawan",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbir57571.2023.10147562"
    },
    {
        "id": 34292,
        "title": "A Step-by-Step Mathematical Derivation of Ant Colony Optimization Algorithm for solving 01 Knapsack Problem",
        "authors": "",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets47614"
    },
    {
        "id": 34293,
        "title": "Robot path planning using fusion algorithm of ant colony optimization and genetic algorithm",
        "authors": "Kangkang Ma, Lei Wang, Jingcao Cai, Dongdong Li, Anheng Wang, Tielong Tan",
        "published": "2023-12",
        "citations": 2,
        "abstract": " Aiming at the shortcomings of single ant colony optimization such as many redundant nodes, slow convergence and low efficiency, based on the idea of “selection-crossover” of genetic algorithm, an improved fusion algorithm of ant colony optimization and genetic algorithm is proposed. In this paper, the fusion algorithm includes “optimal strategy” and “genetic region strategy”. The optimal strategy is that high-quality parents are selected by roulette in the first [Formula: see text] paths of each generation; genetic region strategy is that according to the path information of the parents, the grid map is divided into genetic area and nongenetic area. Genetic area refers to the area where the offspring ants can pass, and nongenetic area refers to the area where the offspring ants can’t pass; finally, the offspring ant searches the path in the genetic region to reduce the search range of the offspring ant and improve the convergence speed. Simulation results show that the fusion algorithm has faster searching speed and more stable convergence than the basic ant colony optimization and other improved ant colony optimization. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1793962323410325"
    },
    {
        "id": 34294,
        "title": "Path Planning Algorithm of Unmanned Ship Based on Improved Ant Colony",
        "authors": "Mujie Zhao, Tao Zhang, Di Wang",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cait59945.2023.10468836"
    },
    {
        "id": 34295,
        "title": "A Monte Carlo Tree Search with Ant Colony Optimization for Inter-domain Path Computation Problem",
        "authors": "Do Tuan Anh, Phung Bao Ha, Nguyen Thai Ha, Do Tien Dzung, Ban Ha Bang, Pham Dang Hai",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3628797.3628972"
    },
    {
        "id": 34296,
        "title": "Ant Colony Optimization for Efficient Distance and Time Optimization in Swarm Drone Formation",
        "authors": "Ronny Mardiyanto, Andri Suhartono, Devy Kuswidiastuti, Heri Suryoatmojo",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "One of the challenges in swarm drone formation is achieving fast and effective formation with optimal distances. In this paper, we propose a swarm drone formation approach utilizing Ant Colony Optimization (ACO) for achieving it. We conducted simulations involving the formation of three or more drones, aiming to identify the best formation based on distance, acceleration, and time criteria. Simulation results demonstrate that formation time is significantly reduced when employing ACO optimization compared to non-optimized methods. Additionally, the optimized formations exhibit shorter inter-drone distances compared to non-optimized formations. By implementing this approach, swarm drone formations can be rapidly established with minimized distances, resulting in substantial battery savings. The simulation encompassed various patterns formed by 3, 5, 10, 15, 20, and 25 drones. The findings indicate that the approach can reduce formation time by varying degrees, ranging from 12% to 51%, across 66% of the conducted experiments, notably for patterns created with a substantial drone count. The degree of diversity observed among the proposed solutions reached 60%, with minimal variances of less than 1% for each.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22219/kinetik.v9i1.1859"
    },
    {
        "id": 34297,
        "title": "ANALYSIS ON HANDLING PATH OPTIMIZATION OF AGRICULTURAL ROBOTS BASED ON IMPROVED ANT COLONY ALGORITHM",
        "authors": "Zhen WANG, Keqing QIAN, Xiaoli ZHU, Xinyu HU, Xinran LI",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "With the rapid development of agricultural machinery intelligence and informatization, agricultural robots are becoming the protagonist, promoting standardized production in agriculture, improving efficiency, and reducing labor costs. However, how to quickly plan an efficient and safe path for agricultural transport robots is currently a hot topic in path planning research. In this study, the path optimization problem of agricultural\nrobots handling agricultural products (such as Edible Fungi) in and out of warehouses, which served as the study object, was solved. First, the number of agricultural handling robots was initialized based on the scanning method, and the geometric center of sub-path nodes was set as the virtual node. Secondly, the optimal path of the virtual node was solved using the improved ant colony algorithm embedded with a genetic operator, and the optimal result of sub-paths was acquired. Thirdly, the optimal solution meeting constraint conditions was obtained with the launch cost, transportation cost, and time cost of agricultural robots as objective functions. Lastly, the effectiveness of the optimization model and the improved ant colony algorithm was verified through the instance analysis. This study is of certain significance to the exwarehousing path optimization of agricultural robots under the sustainable development concept of\nagricultural automation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35633/inmateh-70-44"
    },
    {
        "id": 34298,
        "title": "Optimal path selection using reinforcement learning based ant colony optimization algorithm in IoT-Based wireless sensor networks with 5G technology",
        "authors": "Ghanshyam Prasad Dubey, Shalini Stalin, Omar Alqahtani, Areej Alasiry, Madhu Sharma, Aliya Aleryani, Piyush Kumar Shukla, M. Turki-Hadj Alouane",
        "published": "2023-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comcom.2023.09.015"
    },
    {
        "id": 34299,
        "title": "Path Planning of an Inchworm-like Robot in 3D Environment Based on Improved Ant Colony Algorithm",
        "authors": "Zhaohua Sun, Jianping Tan, Pengfei Wang, Kuangxi Li",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oncon60463.2023.10430813"
    },
    {
        "id": 34300,
        "title": "Hybrid Ant Lion Mutated Ant Colony Optimizer Technique With Particle Swarm Optimization for Leukemia Prediction Using Microarray Gene Data",
        "authors": "T. R. Mahesh, D. Santhakumar, A. Balajee, H. S. Shreenidhi, V. Vinoth Kumar, Jonnakuti Rajkumar Annand",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3351871"
    },
    {
        "id": 34301,
        "title": "The Multi-Strategy based Ant Colony Algorithm for the Path Planning of Mobile Robots",
        "authors": "Xiyue Sun, Wenxia Xu, Yanlie Zheng, Jian Huang, Bing Du, Baocheng Yu",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218751"
    },
    {
        "id": 34302,
        "title": "Application of Improved Ant Colony Algorithm Integrating Adaptive Parameter Configuration in Robot Mobile Path Design",
        "authors": "Jinli Han",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140844"
    },
    {
        "id": 34303,
        "title": "Path Planning Based on Ant Colony Algorithm with Artificial Potential Field",
        "authors": "Yuehai Wang, Wenjie Yin, Na Xing, Keqing Ning, Haotian Di, Haiwen Xie",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccet59170.2023.10335153"
    },
    {
        "id": 34304,
        "title": "APPLICATION OF ANT COLONY ALGORITHM IN LASER CUTTING PATH OPTIMISATION OF SHEET METAL PARTS, 159-165.",
        "authors": "Banggui Guan, Minglei Guo, Yanfu Qin, Chunjian Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2316/j.2023.201-0382"
    }
]