[
    {
        "id": 20871,
        "title": "Bayesian Models in Cognitive Neuroscience",
        "authors": "Gabriel Kabanda",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003328414-15"
    },
    {
        "id": 20872,
        "title": "Principled Decision-Making Workflow with Hierarchical Bayesian Models of High-Throughput Dose-Response Measurements",
        "authors": "Eric J. Ma, Arkadij Kummer",
        "published": "2021-6-8",
        "citations": 1,
        "abstract": "We present a case study applying hierarchical Bayesian estimation on high-throughput protein melting-point data measured across the tree of life. We show that the model is able to impute reasonable melting temperatures even in the face of unreasonably noisy data. Additionally, we demonstrate how to use the variance in melting-temperature posterior-distribution estimates to enable principled decision-making in common high-throughput measurement tasks, and contrast the decision-making workflow against simple maximum-likelihood curve-fitting. We conclude with a discussion of the relative merits of each workflow.",
        "link": "http://dx.doi.org/10.3390/e23060727"
    },
    {
        "id": 20873,
        "title": "Principled decision-making workflow with hierarchical Bayesian models of high throughput dose-response measurements",
        "authors": "Eric J. Ma, Arkadij Kummer",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractWe present a case study applying hierarchical Bayesian estimation on high throughput protein melting point data measured across the tree of life. We show that the model is able to impute reasonable melting temperatures even in the face of unreasonably noisy data. Additionally, we demonstrate how to use the variance in melting temperature posterior distribution estimates to enable principled decision-making in common high throughput measurement tasks, and contrast the decision-making workflow against simple maximum-likelihood curve fitting. We conclude with a discussion of the relative merits of each workflow.",
        "link": "http://dx.doi.org/10.1101/2021.05.02.442325"
    },
    {
        "id": 20874,
        "title": "Bayesian Analyses of Political Decision Making",
        "authors": "Kumail Wasif, Jeff Gill",
        "published": "2020-10-27",
        "citations": 0,
        "abstract": "Bayes’ theorem is a relatively simple equation but one of the most important mathematical principles discovered. It is a formalization of a basic cognitive process: updating expectations as new information is obtained. It was derived from the laws of conditional probability by Reverend Thomas Bayes and published posthumously in 1763. In the 21st century, it is used in academic fields ranging from computer science to social science.\nThe theorem’s most prominent use is in statistical inference. In this regard, there are three essential tenets of Bayesian thought that distinguish it from standard approaches. First, any quantity that is not known as an absolute fact is treated probabilistically, meaning that a numerical probability or a probability distribution is assigned. Second, research questions and designs are based on prior knowledge and expressed as prior distributions. Finally, these prior distributions are updated by conditioning on new data through the use of Bayes’ theorem to create a posterior distribution that is a compromise between prior and data knowledge.\nThis approach has a number of advantages, especially in social science. First, it gives researchers the probability of observing the parameter given the data, which is the inverse of the results from frequentist inference and more appropriate for social scientific data and parameters. Second, Bayesian approaches excel at estimating parameters for complex data structures and functional forms, and provide more information about these parameters compared to standard approaches. This is possible due to stochastic simulation techniques called Markov Chain Monte Carlo. Third, Bayesian approaches allow for the explicit incorporation of previous estimates through the use of the prior distribution. This provides a formal mechanism for incorporating previous estimates and a means of comparing potential results.\nBayes’ theorem is also used in machine learning, which is a subset of computer science that focuses on algorithms that learn from data to make predictions. One such algorithm is the Naive Bayes Classifier, which uses Bayes’ theorem to classify objects such as documents based on prior relationships. Bayesian networks can be seen as a complicated version of the Naive Classifier that maps, estimates, and predicts relationships in a network. It is useful for more complicated prediction problems. Lastly, the theorem has even been used by qualitative social scientists as a formal mechanism for stating and evaluating beliefs and updating knowledge.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190228637.013.1002"
    },
    {
        "id": 20875,
        "title": "Bayesian methods for analyzing true-and-error models",
        "authors": "Michael D. Lee",
        "published": "2018-11",
        "citations": 9,
        "abstract": "AbstractBirnbaum and Quispe-Torreblanca (2018) evaluated a set of six models developed under true-and-error theory against data in which people made choices in repeated gambles. They concluded the three models based on expected utility theory were inadequate accounts of the behavioral data, and argued in favor of the simplest of the remaining three more general models. To reach these conclusions, they used non-Bayesian statistical methods: frequentist point estimation of parameters, bootstrapped confidence intervals of parameters, and null hypothesis significance testing of models. We address the same research goals, based on the same models and the same data, using Bayesian methods. We implement the models as graphical models in JAGS to allow for computational Bayesian analysis. Our results are based on posterior distribution of parameters, posterior predictive checks of descriptive adequacy, and Bayes factors for model comparison. We compare the Bayesian results with those of Birnbaum and Quispe-Torreblanca (2018). We conclude that, while the very general conclusions of the two approaches agree, the Bayesian approach offers better detailed answers, especially for the key question of the evidence the data provide for and against the competing models. Finally, we discuss the conceptual and practical advantages of using Bayesian methods in judgment and decision making research highlighted by this case study.",
        "link": "http://dx.doi.org/10.1017/s193029750000663x"
    },
    {
        "id": 20876,
        "title": "Bayesian Decision Analysis",
        "authors": "Mats Danielson, Love Ekenberg",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003406709-3"
    },
    {
        "id": 20877,
        "title": "Bayesian Tail Probabilities for Decision Making",
        "authors": "Leonhard Held",
        "published": "2020-4-15",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315180212-3"
    },
    {
        "id": 20878,
        "title": "Bayesian and frequentist analysis of True and Error models",
        "authors": "Michael H. Birnbaum",
        "published": "2019-9",
        "citations": 3,
        "abstract": "AbstractBirnbaum and Quispe-Torreblanca (2018) presented a frequentist analysis of a family of six True and Error (TE) models for the analysis of two choice problems presented twice to each participant. Lee (2018) performed a Bayesian analysis of the same models, and found very similar parameter estimates and conclusions for the same data. He also discussed some potential differences between Bayesian and frequentist analyses and interpretations for model comparisons. This paper responds to certain points of possible controversy regarding model selection that attempt to take into account the concept of flexibility or complexity of a model. Reasons to question the use of Bayes factors to decide among models differing in fit and complexity are presented. The partially nested inter-relations among the six TE models are represented in a Venn diagram. Another view of model complexity is presented in terms of possible sets of data that could fit a model rather than in terms of possible sets of parameters that do or do not fit a given set of data. It is argued that less complex theories are not necessarily more likely to be true, and when the space of all possible theories is not well-defined, one should be cautious in interpreting calculated posterior probabilities that appear to prove a theory to be true.",
        "link": "http://dx.doi.org/10.1017/s1930297500004903"
    },
    {
        "id": 20879,
        "title": "Bayesian Probability of Success for Go/No-Go Decision Making",
        "authors": "Qi Tang",
        "published": "2019-11-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315099798-11"
    },
    {
        "id": 20880,
        "title": "Decision Models in Clinical Recommendations",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315274300-16"
    },
    {
        "id": 20881,
        "title": "Aeronautical Decision Making: Metaphors, Models, and Methods",
        "authors": "David O’Hare",
        "published": "2017-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315095080-3"
    },
    {
        "id": 20882,
        "title": "Bayesian Models with Spatial Correlation Improve the Precision of EQ-5D-5L Value Sets",
        "authors": "Menglu Che, Feng Xie, Stephanie Thomas, Eleanor Pullenayegum",
        "published": "2023-7",
        "citations": 0,
        "abstract": "Background Health utilities from value sets for the EQ-5D-5L are commonly used in economic evaluations. We examined whether modeling spatial correlation among health states could improve the precision of the value sets. Methods Using data from 7 EQ-5D-5L valuation studies, we compared the predictive precision of the published linear model, a recently proposed cross-attribute level effects (CALE) model, and 2 Bayesian models with spatial correlation. Predictive precision was quantified through the root mean squared error (RMSE) for out-of-sample predictions of state-level mean utilities on omitting individual states, as well as omitting blocks of states. Results In all 7 countries, on omitting single health states, Bayesian models with spatial correlation improved upon the published linear model: the RMSEs for the originally published models, 0.050, 0.051, 0.060, 0.061, 0.039, 0.050, and 0.087 for Canada, China, Germany, Indonesia, Japan, Korea, and the Netherlands, respectively, could be reduced to 0.043, 0.042, 0.051, 0.054, 0.037, 0.037, and 0.085, respectively. On omitting blocks of health states, Bayesian models with spatial correlation led to smaller RMSEs in 3 countries, while the CALE model led to smaller RMSEs in the remaining 4 countries. Discussion: Bayesian models incorporating spatial correlation and CALE models are promising for improving the precision of value sets for the EQ-5D-5L. The differential performance of the Bayesian models on omitting single states versus blocks of states suggests that designing valuation studies to capture more health states may further improve precision. We suggest that Bayesian and CALE models be considered as candidates when creating value sets and that alternative designs be explored; this is vital as the prediction errors in value sets need to be smaller than the minimal important difference of the instrument. Highlights The accuracy of value sets of multi-attribute utility instruments is typically of the same order of magnitude as the instrument’s minimal important difference and would benefit from improvement. Bayesian models with spatial correlation have been shown to improve value set accuracy in isolated cases. We showed that Bayesian approaches with spatial correlation improved predictive precision in 7 EQ-5D-5L valuation studies. We recommend that Bayesian models incorporating spatial correlation be considered when creating value sets and have provided code for fitting them. ",
        "link": "http://dx.doi.org/10.1177/0272989x231173699"
    },
    {
        "id": 20883,
        "title": "Integration of the Bayesian Network Approach and Interval Type-2 Fuzzy Sets for Developing Sustainable Hydrogen Storage Technology in Large Metropolitan Areas",
        "authors": "He Li, Mohammad Yazdi",
        "published": "2022",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-07430-1_5"
    },
    {
        "id": 20884,
        "title": "Bayesian versus Empirical Calibration of Microsimulation Models: A Comparative Analysis",
        "authors": "Stavroula A. Chrysanthopoulou, Carolyn M. Rutter, Constantine A. Gatsonis",
        "published": "2021-8",
        "citations": 3,
        "abstract": " Calibration of a microsimulation model (MSM) is a challenging but crucial step for the development of a valid model. Numerous calibration methods for MSMs have been suggested in the literature, most of which are usually adjusted to the specific needs of the model and based on subjective criteria for the selection of optimal parameter values. This article compares 2 general approaches for calibrating MSMs used in medical decision making, a Bayesian and an empirical approach. We use as a tool the MIcrosimulation Lung Cancer (MILC) model, a streamlined, continuous-time, dynamic MSM that describes the natural history of lung cancer and predicts individual trajectories accounting for age, sex, and smoking habits. We apply both methods to calibrate MILC to observed lung cancer incidence rates from the Surveillance, Epidemiology and End Results (SEER) database. We compare the results from the 2 methods in terms of the resulting parameter distributions, model predictions, and efficiency. Although the empirical method proves more practical, producing similar results with smaller computational effort, the Bayesian method resulted in a calibrated model that produced more accurate outputs for rare events and is based on a well-defined theoretical framework for the evaluation and interpretation of the calibration outcomes. A combination of the 2 approaches is an alternative worth considering for calibrating complex predictive models, such as microsimulation models. ",
        "link": "http://dx.doi.org/10.1177/0272989x211009161"
    },
    {
        "id": 20885,
        "title": "Comparison of Behavior Rate Models Based on Bayesian Belief Network",
        "authors": "Aleksandra Toropova, Tatiana Tulupyeva",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-65283-8_42"
    },
    {
        "id": 20886,
        "title": "Discussion of ‘Environmental decision‐making using Bayesian networks: creating an environmental report card’",
        "authors": "Annukka Lehikoinen",
        "published": "2017-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/asmb.2234"
    },
    {
        "id": 20887,
        "title": "Discussion of ‘Environmental decision‐making using bayesian networks: Creating an environmental report card’",
        "authors": "Antonella Bodini",
        "published": "2017-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/asmb.2236"
    },
    {
        "id": 20888,
        "title": "Computational Models of Political Decision Making",
        "authors": "Sung-youn Kim",
        "published": "2020-9-28",
        "citations": 0,
        "abstract": "A growing body of research uses computational models to study political decision making and behavior such as voter turnout, vote choice, party competition, social networks, and cooperation in social dilemmas. Advances in the computational modeling of political decision making are closely related to the idea of bounded rationality. In effect, models of full rationality can usually be analyzed by hand, but models of bounded rationality are complex and require computer-assisted analysis. Most computational models used in the literature are agent based, that is, they specify how decisions are made by autonomous, interacting computational objects called “agents.” However, an important distinction can be made between two classes of models based on the approaches they take: behavioral and information processing. Behavioral models specify relatively simple behavioral rules to relax the standard rationality assumption and investigate the system-level consequences of these rules in conjunction with deductive, game-theoretic analysis. In contrast, information-processing models specify the underlying information processes of decision making—the way political actors receive, store, retrieve, and use information to make judgment and choice—within the structural constraints on human cognition, and examine whether and how these processes produce the observed behavior in question at the individual or aggregate level. Compared to behavioral models, information-processing computational models are relatively rare, new to political scientists, and underexplored. However, focusing on the underlying mental processes of decision making that must occur within the structural constraints on human cognition, they have the potential to provide a more general, psychologically realistic account for political decision making and behavior.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190228637.013.881"
    },
    {
        "id": 20889,
        "title": "Cultural Variations in Mental Models of Collaborative Decision Making",
        "authors": "",
        "published": "2017-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315597584-10"
    },
    {
        "id": 20890,
        "title": "Bayesian Belief Models in Simulation-Based Decision-Making",
        "authors": "Ilya O. Ryzhov, Ye Chen",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-64182-9_10"
    },
    {
        "id": 20891,
        "title": "Models of Decision-Making Over Time",
        "authors": "Paul Cisek, David Thura",
        "published": "2022-5-18",
        "citations": 0,
        "abstract": "Making a good decision often takes time, and in general, taking more time improves the chances of making the right choice. During the past several decades, the process of making decisions in time has been described through a class of models in which sensory evidence about choices is accumulated until the total evidence for one of the choices reaches some threshold, at which point commitment is made and movement initiated. Thus, if sensory evidence is weak (and noise in the signal increases the probability of an error), then it takes longer to reach that threshold than if sensory evidence is strong (thus helping filter out the noise). Crucially, the setting of the threshold can be increased to emphasize accuracy or lowered to emphasize speed. Such accumulation-to-bound models have been highly successful in explaining behavior in a very wide range of tasks, from perceptual discrimination to deliberative thinking, and in providing a mechanistic explanation for the observation that neural activity during decision-making tends to build up over time. However, like any model, they have limitations, and recent studies have motivated several important modifications to their basic assumptions. In particular, recent theoretical and experimental work suggests that the process of accumulation favors novel evidence, that the threshold decrease over time, and that the result yields improved decision-making in real, natural situations.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190264086.013.346"
    },
    {
        "id": 20892,
        "title": "Reliability Analysis of Correlated Failure Modes by Transforming Fault Tree Model to Bayesian Network: A Case Study of the MDS of a CNC Machine Tool",
        "authors": "He Li, Mohammad Yazdi",
        "published": "2022",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-07430-1_2"
    },
    {
        "id": 20893,
        "title": "Rejoinder to ‘Environmental Decision‐making using Bayesian Networks: Creating an Environmental Report Card’",
        "authors": "Kerrie Mengersen, Sandra Johnson",
        "published": "2017-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/asmb.2263"
    },
    {
        "id": 20894,
        "title": "Bayesian Approaches to Learning and Decision-Making",
        "authors": "Quentin J.M. Huys",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809825-7.00010-9"
    },
    {
        "id": 20895,
        "title": "Decision-making on sustainable port management using inference of Bayesian Networks",
        "authors": "Beatriz Molina Serrano, Nicoletta González-Cancelas, Francisco Soler-Flores",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18638/quaesti.2017.5.1.311"
    },
    {
        "id": 20896,
        "title": "Bayesian Analysis of Processed Information in Decision Making Experiments",
        "authors": "Tillmann Nett, Nadine Nett, Andreas Glöckner",
        "published": "No Date",
        "citations": 0,
        "abstract": "In research on decision making, experiments are often analyzed in terms of decision strategies. These decision strategies define both which information is used as well as how it is used. However, often it is desirable to identify the used information without any further assumptions about how it is used. We provide a mathematical framework that allows analyzing which information is used by identifying consistent patterns on the choice probabilities. This framework makes it possible to generate the most general model consistent with an information usage hypothesis and then to test this model against others. We test our approach in a recovery simulation to show thatthe used information may be reliably identified AUC&gt;= .90. In addition, to further verify the correctness we compare our approach with other approaches based on strategy fitting to show that both produce similar results.",
        "link": "http://dx.doi.org/10.31234/osf.io/pxwq7"
    },
    {
        "id": 20897,
        "title": "Frameworks and Models in Decision-Making and Judgment in Child Welfare and Protection",
        "authors": "Rami Benbenishty, John D. Fluke",
        "published": "2020-9-11",
        "citations": 2,
        "abstract": "This chapter presents the basic concepts, theoretical perspectives, and areas of scholarship that bear on decisions in child welfare—making choices in decision environments characterized by high levels of uncertainty. The authors distinguish between normative models that predict what decision-makers ought to choose when faced with alternatives and descriptive models that describe how they tend to make these choices in real life. The chapter reviews those challenges that may be especially relevant in the complex context of child welfare and protection. One way in which decision-makers overcome task complexities and limitations in human information processing (bounded rationality) is by using heuristics to navigate complex tasks. The chapter reviews strategies to correct some limitations in judgment. The authors examine the relationships between workers’ predictions of what would be the outcomes of the case and the actual outcomes and describe two types of error (false positive and false negative) and the related concepts of specificity and sensitivity. These issues are followed by a description of the Lens Model and some of its implications for child welfare decision-making, including predictive risk modeling and studies on information processing models. The final section presents current theoretical models in child welfare decision-making and describes Decision-Making Ecology (DME) and Judgments and Decision Processes in Context (JUDPiC). The chapter concludes with suggestions for future research on child welfare decision-making that could contribute to our conceptual understanding and have practical utility as well.",
        "link": "http://dx.doi.org/10.1093/oso/9780190059538.003.0001"
    },
    {
        "id": 20898,
        "title": "Models of Transformative Decision-Making",
        "authors": "Samuel Zimmerman, Tomer Ullman",
        "published": "2020-7-16",
        "citations": 1,
        "abstract": "Deciding to undergo a transformative experience present unique challenges for a reasonable decision-maker, and for any attempt to give a formal account of how people can make such decisions. This chapter focuses on the challenges of novelty and change. It develops a normative hierarchical model for decision-making over novel objects, and show how it captures the commonsense intuition that we can rationally decide to try a new experience, but also that such decisions can be graded in difficulty. It then presents a framework for how people can think about big decisions that will affect their core beliefs, desires, and ultimately themselves, by modeling this as a decision process of choosing between different selves. Empirical evidence is used to refine different sub-models of this meta-reasoning process, including the asymmetric treatment of current and future utilities, the difference between future utilities and future beliefs, and a distance function between selves that is separate from considerations of future happiness.",
        "link": "http://dx.doi.org/10.1093/oso/9780198823735.003.0005"
    },
    {
        "id": 20899,
        "title": "Single Criterion Decision Making",
        "authors": "Maria Isabel Gomes, Nelson Chibeles Martins",
        "published": "2022-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003015154-1"
    },
    {
        "id": 20900,
        "title": "Normative Ethical Decision‐Making Models",
        "authors": "",
        "published": "2017-4-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781118393390.app3"
    },
    {
        "id": 20901,
        "title": "Effectuation and Business Models:",
        "authors": "Hiroyuki Miyai",
        "published": "2022-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7222/marketing.2022.020"
    },
    {
        "id": 20902,
        "title": "Descriptive Ethical Decision‐Making Models",
        "authors": "",
        "published": "2017-4-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781118393390.app2"
    },
    {
        "id": 20903,
        "title": "Temporal Stability of Bayesian Belief Updating in Perceptual Decision Making",
        "authors": "Isabella Goodwin, Robert Hester, Marta Garrido",
        "published": "No Date",
        "citations": 0,
        "abstract": "Bayesian inference suggests that perception is inferred from a weighted integration of prior contextual beliefs with current sensory evidence (likelihood) about the world around us. The perceived precision or uncertainty associated with prior and likelihood information is used to guide perceptual decision making, such that more weight is placed on the source of information with greater precision. This provides a framework for understanding a spectrum of clinical transdiagnostic symptoms associated with aberrant perception, as well as individual differences in the general population. Whilst behavioural paradigms are commonly used to characterise individual differences in perception as a trait-like characteristic, measurement reliability in these behavioural tasks is rarely assessed. To remedy this gap, we empirically evaluate the reliability of a perceptual decision-making task that quantifies individual differences in Bayesian belief updating in terms of the relative precision weighting afforded to prior and likelihood information (i.e., sensory weight). We analysed data from participants (n = 37) who performed this task twice. We found that the precision afforded to prior and likelihood information showed high internal consistency and good test re-test reliability (ICC = 0.86, 95%CI[0.72, 0.93]) when averaged across participants, as well as at the individual level using hierarchical modelling. Our results provide support for the assumption that Bayesian belief updating operates as a stable, trait-like characteristic in perceptual decision making. We discuss the utility and applicability of reliable perceptual decision-making paradigms as a measure of individual differences in the general population, as well as a diagnostic tool in psychiatric research.",
        "link": "http://dx.doi.org/10.31234/osf.io/wj8xh"
    },
    {
        "id": 20904,
        "title": "Foreign Policy Decision Making: Evolution, Models, and Methods",
        "authors": "David Brulé, Alex Mintz",
        "published": "2017-12-22",
        "citations": 0,
        "abstract": "Choices made by individuals, small groups, or coalitions representing nation-states result in policies or strategies with international outcomes. Foreign policy decision-making, an approach to international relations, is aimed at studying such decisions. The rational choice model is widely considered to be the paradigmatic approach to the study of international relations and foreign policy. The evolution of the decision-making approach to foreign policy analysis has been punctuated by challenges to rational choice from cognitive psychology and organizational theory. In the late 1950s and early 1960s, scholars began to ponder the deterrence puzzle as they sought to find solutions to the problem of credibility. During this period, cross-disciplinary research on organizational behavior began to specify a model of decision making that contrasted with the rational model. Among these models were the bounded rationality/cybernetic model, organizational politics model, bureaucratic politics model, prospect theory, and poliheuristic theory. Despite these and other advances, the gulf between the rational choice approaches and cognitive psychological approaches appears to have stymied progress in the field of foreign policy decision-making. Scholars working within the cognitivist school should develop theories of decision making that incorporate many of the cognitive conceptual inputs in a logical and coherent framework. They should also pursue a multi-method approach to theory testing using experimental, statistical, and case study methods.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190846626.013.185"
    },
    {
        "id": 20905,
        "title": "Decision letter for \"Bayesian models for spatially explicit interactions between neighbouring plants\"",
        "authors": "",
        "published": "2022-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.13998/v3/decision1"
    },
    {
        "id": 20906,
        "title": "Decision letter for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2022-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v2/decision1"
    },
    {
        "id": 20907,
        "title": "Decision letter for \"Bayesian models for spatially explicit interactions between neighbouring plants\"",
        "authors": "",
        "published": "2022-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.13998/v2/decision1"
    },
    {
        "id": 20908,
        "title": "Decision letter for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2021-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v1/decision1"
    },
    {
        "id": 20909,
        "title": "Dual-Process Models of Criminal Decision Making",
        "authors": "Jean-Louis van Gelder",
        "published": "2017-6-6",
        "citations": 1,
        "abstract": "This chapter discusses the application of dual-process and dual-system models to offender decision making. It is argued that these models offer a more accurate account of the decision process than the traditional choice models in criminology, such as rational choice and deterrence models, and can overcome their various limitations. Specific attention is devoted to the hot/cool perspective of criminal decision making, which takes the dual-process hypothesis as a point of departure. This model is rooted in the idea that both “cool” cognition and “hot” affect, or thinking and feeling, guide behavior and that understanding their interaction is fundamental for understanding how people make criminal choices.",
        "link": "http://dx.doi.org/10.1093/oxfordhb/9780199338801.013.8"
    },
    {
        "id": 20910,
        "title": "Experiences in applying Bayesian network models in interdisciplinary water quality decision analysis",
        "authors": "Sakari Kuikka",
        "published": "No Date",
        "citations": 0,
        "abstract": "\n        &lt;p&gt;I review the experience obtained in using integrative Bayesian models in interdisciplinary analysis focusing on oil spill risk analysis and water quality in the Baltic Sea. We have applied BBN especially to interdisciplinary analysis, which is easily needed in decision analysis. In the environmental risk analysis, we have mainly focused on the oil spills, where the data sets are poor and also the published papers are scarce. More importantly, the aim of the decision analysis here is to avoid seeing the data, i.e. to avoid accidents. Therefore, some of our applications are based mainly on the use of expert knowledge, especially when we consider decision options that have not been applied before.&lt;/p&gt;&lt;p&gt;&amp;#160; In the oil spill risk analysis, we have chosen the state of the threatened species as the decision criteria, as they have a status in other parts of Finnish legislation. There is no single clear objective in oil spill legislation which could be used as a utility function, and our analysis have shown, that the legislation should be updated to include well defined objectives. One of the scientific quality criteria for using the Bayesian decision analysis for management is that the uncertainty estimates are scientifically justified. Especially in cases where society is assumed to be highly risk averse, the uncertainty estimates related to alternative management options may have a crucial role.&lt;/p&gt;&lt;p&gt;&amp;#160;&amp;#160; Biology, sociology and environmental economics have their own scientific traditions. Bayesian models are becoming traditional tools in fisheries biology, where uncertainty estimates of management options are frequently required. In sociology, the traditions allow the subjective treatment of the information, which supports the use of prior probability distributions. &amp;#160;Many of the environmental risks have also economic components, or at least actions have a price, which favors the use of quantitative risk analysis. However, the traditions and quality criteria of these three scientific fields are in many respects different. This creates both technical and human challenges to the modeling tasks.&lt;/p&gt;&lt;p&gt;&amp;#160;&lt;/p&gt;&lt;p&gt;Keywords: Bayesian networks, fisheries management, environmental management, interdisciplinary risk and decision analysis&lt;/p&gt;&lt;p&gt;&amp;#160;&lt;/p&gt;\n        ",
        "link": "http://dx.doi.org/10.5194/egusphere-egu2020-7270"
    },
    {
        "id": 20911,
        "title": "Decision letter for \"Bayesian models for spatially explicit interactions between neighbouring plants\"",
        "authors": "",
        "published": "2021-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.13998/v1/decision1"
    },
    {
        "id": 20912,
        "title": "Biosocial Criminology and Models of Criminal Decision Making",
        "authors": "Kyle Treiber",
        "published": "2017-6-6",
        "citations": 3,
        "abstract": "This chapter explores how integrating the science of criminal decision making and contemporary biosocial criminology can benefit our understanding of why people make criminal action decisions and the role of biological factors. It reviews relevant biosocial findings but argues that efforts to link them to criminal decision making are limited by the lack of a strong model of the action process. It then compares how key components of this process—motivation, perception, and choice—are portrayed in models of criminal decision making with what is currently known about their biomechanics. It concludes that models of criminal decision making would benefit from the integration of evidence from the biological sciences and that some common assumptions may need to be reconsidered. It argues that biosocial criminology would benefit from a stronger, more biologically informed model of criminal decision making, which could better explain the role of biological factors in crime causation.",
        "link": "http://dx.doi.org/10.1093/oxfordhb/9780199338801.013.4"
    },
    {
        "id": 20913,
        "title": "Decision letter for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v3/decision1"
    },
    {
        "id": 20914,
        "title": "Decision-Making Models in Systems Engineering",
        "authors": "",
        "published": "2018-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315273860-11"
    },
    {
        "id": 20915,
        "title": "On the Bayesian Geometric Model: Decision Making Using Multiple (&gt;2) States",
        "authors": "Ed Gerck",
        "published": "No Date",
        "citations": 0,
        "abstract": "We find at least 4 quantum properties that are indeed universal in some number systems; and we can use them for quantum consciousness. Using the sets B={0,1}, N, Z, or Q has the +4 quantum properties that one can trust, as archetypes of easy communication to friends and foes, to ignoranti or cognoscenti, and for quantum computing. This paper proposes the use of Bayesian geometry to reduce the space of possible results, reducing or increasing initial beliefs by successive experimentation. This is exemplified in biology and mathematics, and can be applied to physics and other sciences. The conclusion is that an experimental fact can be absolutely verified. Any mathematical choice (as verified by computers) militating against R=Q, is under an absolutely low chance to succeed. Infinitesimals are denied based on 3^16 independent factors. This is not a probabilistic result, but based on reduction of the Bayes geometry for updating beliefs. This work applies to non-probabilistic and unknown phenomena, such as those found in oscillations (neutrino, health), evolution, and quantum computing, denies G&ouml;del's uncertainty, and solves the liar's paradox by reflection. This connects different scientific fields with one another, in an internet, i.e., in a network of connections of multiple open networks, using the set Q, resembling a hologram, and includes entanglement.",
        "link": "http://dx.doi.org/10.20944/preprints202304.0178.v2"
    },
    {
        "id": 20916,
        "title": "Decision-Making Support Software Tools Based on Original Authoring Bayesian Probabilistic Models",
        "authors": "G I Kozhomberdieva, D P Burakov, G A Khamchichev",
        "published": "2022-4-1",
        "citations": 0,
        "abstract": "Abstract\nThe article presents programs that implement original approaches to group expert rating estimation and fuzzy inference. They implement probabilistic models based on Bayes’ Formula, previously proposed and published in the works of the authors. In these models, the estimated input data are interpreted as evidence in favor of one or another hypothesis from the set of possible ones, determined by the specifics of the model. All the evidence obtained is, in one way or another, transformed into a set of Bayesian conditional probabilities calculated under the assumption that the corresponding hypothesis is true, and the posterior probability distribution on the set of these hypotheses is used as the output. This distribution is used either directly as a result for decision making, or as a basis for calculating the final result. The features of the software implementation of models on the Java platform are discussed, the advantages of the models, confirmed or identified in the process of software implementation, are noted. The developed programs have a convenient graphical user interface and can be used as decision-making support tools to solve applied problems in the field of expert rating estimation and fuzzy inference.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2224/1/012116"
    },
    {
        "id": 20917,
        "title": "Judgment and Decision Making by Individuals and Teams: Issues, Models, and Applications",
        "authors": "Kathleen L. Mosier, Ute M. Fischer",
        "published": "2017-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315095080-7"
    },
    {
        "id": 20918,
        "title": "1. Prescriptive Models in Organizational Decision Making",
        "authors": "Zur Shapira",
        "published": "2018-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7591/9781501725470-004"
    },
    {
        "id": 20919,
        "title": "Additive Multicriteria Decision Analysis Models Are Not Misleading Aids for Life-Critical Shared Decision Making",
        "authors": "James G. Dolan",
        "published": "2019-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/0272989x19870162"
    },
    {
        "id": 20920,
        "title": "Preventing Disparities: Bayesian and Frequentist Methods for Assessing Fairness in Machine-Learning Decision-Support Models",
        "authors": "Douglas S. McNair",
        "published": "2018-5-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.73176"
    },
    {
        "id": 20921,
        "title": "On the Bayesian Geometric Model: Decision Making Using Mul-Tiple (&gt;2) States",
        "authors": "Ed Gerck",
        "published": "No Date",
        "citations": 0,
        "abstract": "We find at least 4 quantum properties that are indeed universal in some number systems; and we can use them for quantum consciousness. Using the sets N, Z, or Q has the +4 quantum properties that one can trust, as archetypes of easy communication to friends and foes, to ignoranti or cognoscenti, and for quantum computing. This paper proposes the use of Bayesian geometry to reduce the space of possible results, reducing or increasing initial beliefs by successive experimentation. This is exemplified in biology and mathematics, and can be applied to physics and other sciences. The conclusion is that an experimental fact can be absolutely verified. Any mathematical choice (as verified by computers) militating against R=Q, is under an absolutely low chance to succeed. Infinitesimals are denied based on 3^16 independent factors. This is not a probabilistic result, but based on reduction of the Bayes geometry for updating beliefs. This work applies to non-probabilistic and unknown phenomena, such as those found in oscillations (neutrino, health), evolution, and quantum computing, denies G&ouml;del's uncertainty, and solves the liar's paradox by reflection. This connects different scientific fields with one another, in an internet, i.e., in a network of connections of multiple open networks, using the set Q, resembling a hologram, and includes entanglement.",
        "link": "http://dx.doi.org/10.20944/preprints202304.0178.v1"
    },
    {
        "id": 20922,
        "title": "Decision-Making Framework for Sustainability Assessment of Manufacturing",
        "authors": "Brajesh K. Dwivedi, Ashutosh K. Srivastava",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003394723-8"
    },
    {
        "id": 20923,
        "title": "Additive Multicriteria Decision Analysis Models: Misleading Aids for Life-Critical Shared Decision Making",
        "authors": "Edouard Kujawski, Evangelos Triantaphyllou, Juri Yanase",
        "published": "2019-5",
        "citations": 9,
        "abstract": " Background. There is growing interest in multicriteria decision analysis (MCDA) for shared decision making (SDM). A distinguishing feature is that a preferred treatment should extend years of life and/or improve health-related quality of life (HRQL). Additive MCDA models are inadequate for the task. A plethora of MCDA models exist, each claiming that it can correctly solve real-world problems. However, most were developed in nonhealth fields and rely on additive models. This makes the problem of choosing an MCDA model as an aid for SDM a challenging and urgent one. Methods. A published 2017 MCDA of a hypothetical prostate cancer patient is used as a case in point of how not to do and how to do MCDA for SDM. We critically review it and analyze it using several additive linear MCDA models with years of life and HRQL as attributes and the linear quality-adjusted life-year (QALY) model. The following simple reasonableness test is presented for applicability of a method as an aid for SDM: Can a treatment that causes premature death trump a treatment that causes acceptable adverse effects? Results. Additive MCDA models and the linear QALY recommend significantly different alternatives. Additive MCDA models fail the proposed reasonableness test; the linear QALY model passes. Conclusions. MCDA possesses a strong craft element in addition to its technical aspects. MCDA practitioners and clinicians need to understand model limitations to choose models appropriate to the context. Additive MCDA models are inadequate for life-critical SDM. We advocate QALY models with additional research for increased realism as a tool for SDM. ",
        "link": "http://dx.doi.org/10.1177/0272989x19844740"
    },
    {
        "id": 20924,
        "title": "A Bayesian decision-making framework for replication",
        "authors": "Tom Elis Hardwicke, Michael Henry Tessler, Ben Peloquin, Michael C. Frank",
        "published": "No Date",
        "citations": 0,
        "abstract": "Replication is the cornerstone of science – but when and why? Not all studies need replication, especially when resources are limited. We propose that a decision-making framework based on Bayesian philosophy of science provides a basis for choosing which studies to replicate.",
        "link": "http://dx.doi.org/10.31234/osf.io/n3yah"
    },
    {
        "id": 20925,
        "title": "2. Models of Juror and Jury Decision Making",
        "authors": "",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18574/nyu/9780814704981.003.0007"
    },
    {
        "id": 20926,
        "title": "Decision letter for \"Bayesian models of human navigation behavior in an augmented reality audiomaze\"",
        "authors": "",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ejn.15061/v1/decision1"
    },
    {
        "id": 20927,
        "title": "Decision letter for \"Bayesian models of human navigation behavior in an augmented reality audiomaze\"",
        "authors": "",
        "published": "2020-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ejn.15061/v2/decision1"
    },
    {
        "id": 20928,
        "title": "Decision letter for \"Bayesian models of human navigation behavior in an augmented reality audiomaze\"",
        "authors": "",
        "published": "2020-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ejn.15061/v3/decision1"
    },
    {
        "id": 20929,
        "title": "Supplemental Material for Formal Models of Differential Framing Effects in Decision Making Under Risk",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1037/dec0000201.supp"
    },
    {
        "id": 20930,
        "title": "Advanced Decision-Making Methods and Applications in System Safety and Reliability Problems",
        "authors": "He Li, Mohammad Yazdi",
        "published": "2022",
        "citations": 38,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-07430-1"
    },
    {
        "id": 20931,
        "title": "Realigning Models of Habitual and Goal-Directed Decision-Making",
        "authors": "Kevin J. Miller, Elliot A. Ludvig, Giovanni Pezzulo, Amitai Shenhav",
        "published": "2018",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812098-9.00018-8"
    },
    {
        "id": 20932,
        "title": "Interpretation of Multicriteria Decision Making Models with Interacting Criteria",
        "authors": "Michel Grabisch, Christophe Labreuche",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-11482-4_6"
    },
    {
        "id": 20933,
        "title": "Modelling Decision Support Systems using Conceptual Constraints - Linking Process Systems Engineering and Decision Making Models",
        "authors": "Canan Dombayci, Antonio Espuña",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006485201470154"
    },
    {
        "id": 20934,
        "title": "Behavioral decision theory in spatial decision-making models",
        "authors": "Piotr Jankowski",
        "published": "2018-4-27",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4337/9781784717544.00009"
    },
    {
        "id": 20935,
        "title": "The Application of Simple Additive Bayesian Allocation Network Process in System Obsolescence",
        "authors": "Oluwatomi Adetunji",
        "published": "2022-7-27",
        "citations": 0,
        "abstract": "In designing a system, multi-dimensional obsolescence design criteria such as Scheduling; Reliability, Availability, Maintainability; Performance and Functionality; and Costs affect its overall lifespan. This work examines the impacts of these factors on systems during the design phase using a new application called the Simple Additive Bayesian Allocation Network Process (SABANP). The application uses a combination of Multi-Criteria Decision Making (MCDM) methodology and a Bayesian Belief Network to address the impact of obsolescence on a system. Unlike the requirement of weights that are prevalent in the analysis of MCDM, this application does not require weights. Moreover, this application accounts for functional dependencies of criteria, which is not possible with the MCDM methodologies. A case study was conducted using military and civilian experts. Data were collected on systems’ obsolescence criteria and analyzed using the application to make trade-off decisions. The results show that the application can address complex obsolescence decisions that are both quantitative and qualitative. Expert validation showed that SABANP successfully identified the best system for mitigating obsolescence.",
        "link": "http://dx.doi.org/10.5772/intechopen.98530"
    },
    {
        "id": 20936,
        "title": "Decision letter for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v4/decision1"
    },
    {
        "id": 20937,
        "title": "Decision letter for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v2/decision1"
    },
    {
        "id": 20938,
        "title": "Decision-Making, Models",
        "authors": "Paul Miller",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-0716-1006-0_312"
    },
    {
        "id": 20939,
        "title": "CHILD WELFARE PREDICTIVE RISK MODELS AND LEGAL DECISION MAKING",
        "authors": "Matthew Trail",
        "published": "No Date",
        "citations": 0,
        "abstract": "Child welfare agencies around the world have experimented with algorithmic predictive modeling as a method to assist in decision making regarding foster child risk, removal and placement. These models have attracted a great deal of controversy about the methods used to create them and the biases inherit in the data they drawn from. However proponents see them as a tool for improving decision making and ultimately the safety of children at risk. Thus far, all of the predictive risk models have been confined to the employees of the various child welfare agencies at the early removal stages and none have been used by attorneys in legal arguments or by judges in approving or denying removal decisions. Predictive models though are regularly used in other courtroom settings and have been studied for how they affect decision making in general. This is the first study to examine the effects of a child welfare predictive risk model on child welfare attorney and judge legal decision making. Using vignettes based on actual disputed removal cases with the inclusion of a low, medium or high child welfare predictive risk score, attorney and judge legal decision making can be changed by the inclusion of a predictive model risk score in ways that are important for the legal community to understand prior to the widespread use of any of these models in the courtroom.",
        "link": "http://dx.doi.org/10.31235/osf.io/mzxba"
    },
    {
        "id": 20940,
        "title": "Improved decision-making in geochemical sampling based on both frequency and Bayesian frameworks",
        "authors": "Behnam Sadeghi, David Cohen, Dietmar Müller",
        "published": "No Date",
        "citations": 1,
        "abstract": "&lt;p&gt;A common problem in geochemical exploration projects is the limited number of collected samples due to budgetary, time, and other constraints. Therefore, to study spatial mineralisation patterns using available samples in both sampled and unsampled areas, the interpolation of the available data is essential to assign estimates to unsampled areas. Because interpolation estimates are based on the data available only within the search window, in continuous field geochemical modelling such interpolations using any single method are often the main source of uncertainty. Error propagation analysis needs to be considered to evaluate interpolation errors&amp;#8217; effects in geochemical anomaly detection. One method for analysing the propagation of errors in models and evaluating their stability is Monte Carlo Simulation (MCSIM). In this method, the P50 (median) value (called &amp;#8216;return&amp;#8217;) and the uncertainty value (called &amp;#8216;risk&amp;#8217;) are calculated. Here the uncertainty is calculated as 1/(P90-P10) for which P10 (lower decile) and P90 (upper decile) are the average 10th and 90th percentiles of the multiple simulated values, correspond to each element. We have applied this method to Swedish till data, collected throughout the country by the Geological Survey of Sweden. The main concern is whether to evaluate if the samples are sufficient and representative of the target elements concentrations for geochemical studies. To address this concern, the sampling uncertainty in a statistical sense (not geochemical) per element was studied using the return-risk matrix. This matrix was applied to volcanogenic massive sulfide (VMS) target elements, then subsequently to the samples per bedrock. Therefore, a large number of simulated values (e.g., 5,000, which is higher than the number of the samples, i.e., 2,578) was generated using MCSIM. Where the quantified return is low or negative, and the quantified uncertainty is high, particularly higher than its relevant return, additional sampling is required to achieve the minimum required spatial continuity in the data or the stability of the later applied classification models. This affects the certainty of the models generated in the study area. In the Sweden data, all the elements assessed have relatively high returns and low uncertainty, demonstrating the stability of the parameters. The process was subsequently applied to samples separated into the main lithological categories or geological domains to determine if the stability in the patterns is affected by rock type (and associate natural variability in the background). In Swedish till samples, the statistical sampling quality is acceptable in the bedrocks of Exotic Terranes, Archean, Baltoscandian, and Idefjorden. However, it is not acceptable in the Palaeoproterozoic units and the Eastern Segment, due to the risks being higher than the returns, which may increase the error propagation effect on the interpolated map and efficiency of the classes obtained by different classification models.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu22-14"
    },
    {
        "id": 20941,
        "title": "Confidence reports in decision-making with multiple alternatives violate the Bayesian confidence hypothesis",
        "authors": "Hsin-Hung Li, Wei Ji Ma",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractDecision confidence reflects our ability to evaluate the quality of decisions and guides subsequent behaviors. Experiments on confidence reports have almost exclusively focused on two-alternative decision-making. In this realm, the leading theory is that confidence reflects the probability that a decision is correct (the posterior probability of the chosen option). There is, however, another possibility, namely that people are less confident if thebest twooptions are closer to each other in posterior probability, regardless of how probable they are inabsoluteterms. This possibility has not previously been considered because in two-alternative decisions, it reduces to the leading theory. Here, we test this alternative theory in a three alternative visual categorization task. We found that confidence reports are best explained by the difference between the posterior probabilities of the best and the next-best options, rather than by the posterior probability of the chosen (best) option alone, or by the overall uncertainty (entropy) of the posterior distribution. Our results upend the leading notion of decision confidence and instead suggest that confidence reflects the observer’s subjective probability that they made the best possible decision.",
        "link": "http://dx.doi.org/10.1101/583963"
    },
    {
        "id": 20942,
        "title": "Review for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2022-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v2/review1"
    },
    {
        "id": 20943,
        "title": "Decision letter for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v3/decision1"
    },
    {
        "id": 20944,
        "title": "Review for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2021-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v1/review2"
    },
    {
        "id": 20945,
        "title": "Markov models",
        "authors": "",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119627876.ch12"
    },
    {
        "id": 20946,
        "title": "Review for \"Predictive models for human–AI nexus in group decision making\"",
        "authors": "",
        "published": "2021-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/nyas.14783/v1/review1"
    },
    {
        "id": 20947,
        "title": "Models for Decision Making",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4337/9781789903058.00018"
    },
    {
        "id": 20948,
        "title": "Decision letter for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-5-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v1/decision1"
    },
    {
        "id": 20949,
        "title": "Advanced Decision-Making Neutrosophic Fuzzy Evidence-Based Best–Worst Method",
        "authors": "He Li, Mohammad Yazdi",
        "published": "2022",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-07430-1_9"
    },
    {
        "id": 20950,
        "title": "An Integrated Multicriteria Decision-Making Model for New Product Portfolio Management",
        "authors": "Pulipaka Kiranmayi, Muthu Mathirajan",
        "published": "2017-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315152653-13"
    },
    {
        "id": 20951,
        "title": "Dynamic Decision-Making Trial and Evaluation Laboratory (DEMATEL): Improving Safety Management System",
        "authors": "He Li, Mohammad Yazdi",
        "published": "2022",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-07430-1_1"
    },
    {
        "id": 20952,
        "title": "Evidence-Based Medicine, Best Practices, Transductive Models, and Naturalistic Decision Making: Commentary on Paul R. Falzer, Naturalistic Decision Making and the Practice of Health Care",
        "authors": "Robert Brian Haynes",
        "published": "2018-9",
        "citations": 2,
        "abstract": " Expert and informed decision making is an essential process in all of health care. Evidence-Based Medicine (EBM) purports to support and enhance this process by the timely infusion of high-quality, pertinent evidence from health research, tailored as closely as possible to the individual and their health problem. Doing so is not an easy task for many reasons, beginning with imperfections and incompleteness in the evidence and ending with the complexities of the dual decision making required by individuals and their care providers. EBM needs a lot of help supporting decision-making processes and welcomes further interdisciplinary collaboration. The “conformist principle,” “best practice regimens,” and “transductive models” should not be considered as barriers to such collaboration: These are not part of EBM. Rather, EBM has always seen evidence from health research as but one of many inputs to decision making by providers and patients. An overarching problem for collaboration to address is understanding the decision-making process well enough to develop effective means to bolster it, so that people are consistently offered the current best options for their problems in a way that fits their circumstances and that they can understand and judge. ",
        "link": "http://dx.doi.org/10.1177/1555343418789831"
    },
    {
        "id": 20953,
        "title": "Bayesian Decision Models: A Primer",
        "authors": "Wei Ji Ma",
        "published": "2019-10",
        "citations": 57,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neuron.2019.09.037"
    },
    {
        "id": 20954,
        "title": "Decision-making and optimization models of the water–energy–food system",
        "authors": "Brenda Cansino-Loeza, José Maria Ponce-Ortega",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-443-13571-2.00003-5"
    },
    {
        "id": 20955,
        "title": "Decision letter for \"Scale-dependent complexity in administrative units and implications for data-driven decision-making models\"",
        "authors": "",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/14730952231203151/v2/decision1"
    },
    {
        "id": 20956,
        "title": "Multi-Criteria Decision-Making Incorporating Bayesian Network and Sentiment Analysis: A Case Study on Online Reviews",
        "authors": "Sedef Çalı, Adil Baykasoğlu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4634071"
    },
    {
        "id": 20957,
        "title": "Call for Papers on the Interface between Human Users and Machine Learning Models in Medical Decision Making",
        "authors": "",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/0272989x221145012"
    },
    {
        "id": 20958,
        "title": "Cognitive models of decision-making with identifiable parameters: Diffusion Decision Models with within-trial noise",
        "authors": "Michael D. Nunez, Anna-Lena Schubert, Gidon T. Frischkorn, Klaus Oberauer",
        "published": "No Date",
        "citations": 0,
        "abstract": "Diffusion Decision Models (DDMs) are a widely used class of models that assume an accumulation of evidence during a quick decision. These models are often used as measurement models to assess individual differences in cognitive processes such as evidence accumulation rate and response caution. An underlying assumption of these models is that there is internal noise in the evidence accumulation process. We argue that this internal noise is a relevant psychological construct that is likely to vary over participants and explain differences in cognitive ability. In some cases a change in noise is a more parsimonious explanation of joint changes in speed-accuracy tradeoffs and ability. However, fitting traditional DDMs to behavioral data cannot yield estimates of an individual's evidence accumulation rate, caution, and internal noise at the same time. This is due to an intrinsic unidentifiability of these parameters in DDMs. We explored the practical consequences of this unidentifiability, and the Bayesian joint posterior distributions of parameters (and thus joint uncertainty) for simulated data from various scenarios. We introduce methods of estimating these parameters. Fundamentally, these parameters can be identified in two ways: (1) We can assume that one of the three parameters is fixed to a constant. We show that fixing one parameter, as is typical in fitting DDMs, results in parameter estimates that are ratios of true cognitive parameters including the parameter that is fixed. By fixing another parameter instead of noise, different ratios are estimated, which may be useful for measuring individual differences. (2) We could instead use additional observed variables that we can reasonably assume to be related to model parameters. Electroencephalographic (EEG) data or single-unit activity from animals can yield candidate measures. We show parameter recovery for models with true (simulated) connections to such additional covariates, as well as some recovery in misspecified models. We show this with both single-trial and participant-level additional observed variables. Thus some inference can be made about the individual differences in all the parameters with the help of additional data. We show why these models are useful without making strong assumptions. Future decision-making researchers will be able to use the deeper theoretical understanding of sequential sampling models and the new modeling methods to measure individual differences in internal noise during decision-making.",
        "link": "http://dx.doi.org/10.31234/osf.io/h4fde"
    },
    {
        "id": 20959,
        "title": "Decision letter for \"Scale-dependent complexity in administrative units and implications for data-driven decision-making models\"",
        "authors": "",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/14730952231203151/v1/decision1"
    },
    {
        "id": 20960,
        "title": "A tiered, Bayesian approach to estimating population variability for regulatory decision-making",
        "authors": "Weihsueh Chiu",
        "published": "2017",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14573/altex.1608251"
    },
    {
        "id": 20961,
        "title": "Decision-Making Models",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781483381503.n303"
    },
    {
        "id": 20962,
        "title": "Advancing Methods and Mathematical Models of Perceptual Decision Making",
        "authors": "Gabriel Tillman",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this thesis I argue that cognitive psychologists can use the combination of sequential sampling models, Bayesian estimation methods, and model comparison via predictive accuracy to investigate underlying cognitive processes of perceptual decision-making. I show that sequential sampling models of simple and choice response time allow for researchers to analyze behavioral data and translate them into the constitute components of processing, such as speed of processing, response caution, and the time needed for perceptual encoding and overt motor responses. I use these methods and models to investigate underlying mental processes related to cognitive load, speech perception, and lexical decision-making. I also show that using different sequential sampling models to analyze the same data can lead researchers to draw different conclusions about cognitive processes, which serves as a caution for carelessly using these models. I also present a novel method that researchers can use to observe cognitive processes unfold online during perceptual decision-making tasks. I then discuss a promising collaboration emerging between researchers in the field of mathematical modeling and neuroscience.",
        "link": "http://dx.doi.org/10.31237/osf.io/3bhvg"
    },
    {
        "id": 20963,
        "title": "Decision Support System for Complex Systems Risk Assessment with Bayesian Networks",
        "authors": "Ayeley Tchangani",
        "published": "2022-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003189886-4"
    },
    {
        "id": 20964,
        "title": "Linking Environmental Data Models to Ecosystem Services’ Indicators for Strategic Decision Making",
        "authors": "Jurijs Holms, Irina Arhipova, Gatis Vitols",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006772701700174"
    },
    {
        "id": 20965,
        "title": "Scientific Models and Decision Making",
        "authors": "Eric Winsberg, Stephanie Harvard",
        "published": "2024-2-8",
        "citations": 2,
        "abstract": "This Element introduces the philosophical literature on models, with an emphasis on normative considerations relevant to models for decision-making. Chapter 1 gives an overview of core questions in the philosophy of modeling. Chapter 2 examines the concept of model adequacy for purpose, using three examples of models from the atmospheric sciences to describe how this sort of adequacy is determined in practice. Chapter 3 explores the significance of using models that are not adequate for purpose, including the purpose of informing public decisions. Chapter 4 provides a basic framework for values in modelling, using a case study to highlight the ethical challenges in building models for decision making. It concludes by establishing the need for strategies to manage value judgments in modelling, including the potential for public participation in the process.",
        "link": "http://dx.doi.org/10.1017/9781009029346"
    },
    {
        "id": 20966,
        "title": "Review for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v2/review1"
    },
    {
        "id": 20967,
        "title": "Review for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v1/review1"
    },
    {
        "id": 20968,
        "title": "Reenlistment Decision Models: Implications for Policy Making",
        "authors": "",
        "published": "2019-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429036026-17"
    },
    {
        "id": 20969,
        "title": "Review for \"Spatially explicit models for decision‐making in animal conservation and restoration\"",
        "authors": "",
        "published": "2021-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.05787/v1/review2"
    },
    {
        "id": 20970,
        "title": "Drift-diffusion models for multiple-alternative forced-choice decision making",
        "authors": "Alex Roxin",
        "published": "No Date",
        "citations": 0,
        "abstract": "The canonical computational model for the cognitive process underlying two-alternative forced-choice  decision making is the so-called drift-diffusion model (DDM). In this model, a decision variable keeps track of the integrated difference in sensory evidence for two competing alternatives. Here I extend the notion of  a drift-diffusion process to multiple alternatives. The competition between n alternatives takes place  in a linear subspace of n-1 dimensions; that is, there are n-1 decision variables, which are coupled through correlated noise sources. I derive the multiple-alternative DDM starting from a  system of coupled, linear firing rate equations. If the original neuronal system is  nonlinear, one can once again derive a model describing a lower dimensional diffusion process. The  dynamics of the nonlinear DDM can be recast as the motion of a particle on a potential, the general form of which is given analytically for an arbitrary number of alternatives.",
        "link": "http://dx.doi.org/10.1101/542431"
    }
]