[
    {
        "id": 305,
        "title": "Principal Component Analysis of Hierarchical and Multivariate Data",
        "authors": "Mehari Gebre Teklezgi L",
        "published": "2023",
        "citations": 0,
        "abstract": "Principal component analysis concerned with explaining the variance-covariance structure of a set of variables through a few linear combinations of these variables. To determine how many principal components should be considered, the eigenvalues should first be examined. Investigating whether the processing of numbers depend on the way the numbers were presented, i.e. whether the data could be reduced. Four variables (WordDiff, WordSame, ArabicDiff and ArabicSame) were used. Both covariate and correlation matrix were used to obtain the principal components and compare the results between them. In addition, canonical correlation was used to examine the correlation between the set of Word variables and the set of Arabic variables. To see the correlation between the Word variables and Arabic variables, observing the canonical correlation between the first Word canonical variable and the first Arabic variable is enough. Data was reduced into a single principal component (PC1) as more than 80% of the total variability was explained by this principal component.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/aabsc-16000209"
    },
    {
        "id": 306,
        "title": "Pengaruh sistem transportasi terhadap kesehatan masyarakat di jawa timur dengan principal component analysis (Influence of the transportation system public health in east java with principal component analysis)",
        "authors": "Anggraeny Elvyna",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4602494"
    },
    {
        "id": 307,
        "title": "Classifying Indian Rivers Surface Water Quality using Principal Component Analysis Combined with Principal Component Weighted Arithmetic Index Techniques",
        "authors": "V. Karpagam, S. Christy",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142739"
    },
    {
        "id": 308,
        "title": "POS0474 FACTORS ASSOCIATED WITH EROSIVE RHEUMATOID ARTHRITIS, A MULTIMARKER PRINCIPAL COMPONENT ANALYSIS (PCA) AND PRINCIPAL COMPONENT REGRESSION (PCR) ANALYSIS",
        "authors": "G. Adami, G. Orsolini, A. Fassio, O. Viapiana, E. Sorio, C. Benini, D. Gatti, D. Bertelle, M. Rossini",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/annrheumdis-2023-eular.3624"
    },
    {
        "id": 309,
        "title": "Automatic Viewpoint Selection for Interactive Motor Feedback Using Principal Component Analysis",
        "authors": "Florian Diller, Alexander Wiebel, Gerik Scheuermann",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012308700003660"
    },
    {
        "id": 310,
        "title": "An Improved Principal Component Analysis (PCA) Face Recognition Technique using Modular Approach",
        "authors": "",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56831/psen-02-044"
    },
    {
        "id": 311,
        "title": "Tensor Principal Component Analysis",
        "authors": "Andrii Babii, Eric Ghysels, Junsu Pan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4312303"
    },
    {
        "id": 312,
        "title": "Comparative Receptor Models Using Principal Component Analysis/Absolute Principal Component Scores and Positive Matrix Factorization to Assess Source Apportionment of PM2.5-10 and PM2.5 in Urban Cities",
        "authors": "Alassane Traore,  , Moustapha Kebe, Malick Sow, Vasiliki Vasilatou, Ababacar Sadikhe Ndao",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "b Source apportionment of PM2.5-10 and PM2.5 was conducted using two receptor models: the principal component analysis/absolute principal component scores (PCA/APCS) and the positive matrix factorization (PMF). Methods: The PCA/APCS model resolved four sources, namely, mineral dust, sea salt/secondary sulfur, a mixed source, and traffic and industry emissions. PMF model also resolved four sources of the same origin based on the proportion of each component from the analysis. All models identified the main sources that contribute to PM2.5-10 and PM2.5 emissions and reconfirmed that the potential sources were the dominants in particulate matter in the Capital city. Findings: The first four extracted component accounted for nearly 88.3% of the variability of the data set. The running matrix elements used for data processing within collected air particulate matter was BC, Na, Al, Si, P, S, Cl, K, Ca, Ti, V, Cr, Mn, Fe, Ni, Cu, Zn, Br, Rb, Sr, Ba, and Pb. This discrimination of the area of Dakar cites according to the PCA/APCS results confirms the impact that the major activities have on the environment in the most appropriate way, and it verifies the results of previous studies about the influence of Industry emissions, mineral dust, traffic emissions and sea salt/secondary sulfur on the surrounding urban areas. Novelty: Continued collection of speciation data at the urban areas will enhance the understanding of local versus regional source contributions for air quality index in sub-Sahara region.  Keywords: Aerosol, Particulate Matter, Source apportionment, receptor Modelling, XRF, heavy metals",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i9.2969"
    },
    {
        "id": 313,
        "title": "Principal Component Analysis for Nonstationary Series",
        "authors": "James D. Hamilton, Jin Xi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4702282"
    },
    {
        "id": 314,
        "title": "Variance The Estimation Eigen Value of Principal Component Analysis and Nonlinear Principal Component Analysis",
        "authors": " Makkulau, Andi Tenri Ampa, Irma Yahya, Lilis La Ome, La Ode Saidi",
        "published": "2024",
        "citations": 0,
        "abstract": "Nonlinear Principal Component Analysis (PRINCALS) is an extension of Principal Component Analysis (Linear), which can reduce the variables of mixed scale multivariable data (nominal, ordinal, interval, and ratio) simultaneously. This study investigated variance the estimation eigen value of Principal Component Analysis Linear and Nonlinear. The result showed that variance the estimation eigen value of Principal Component Analysis is $ {\\rm Var}({\\tilde{\\hat{\\lambda}}}_{S})=\\mathbf H_{S}^{\\prime}\\mathbf V_{S}\\mathbf H_{S} $ and variance the estimation eigen value of Nonlinear Principal Component Analysis is $ {\\rm Var}({{\\hat{\\lambda}}}_{R})=\\mathbf H_{R}^{\\prime}\\mathbf V_{R}\\mathbf H_{R} $ Variance the estimation eigen value of Nonlinear Principal Component Analysis better (efficient) than variance the estimation eigen value of Principal Component Analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/itmconf/20245804001"
    },
    {
        "id": 315,
        "title": "Sparse Functional Principal Component Analysis in High Dimensions",
        "authors": "Xiaoyu Hu, Fang Yao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202020.0445"
    },
    {
        "id": 316,
        "title": "Identifying key players in a network of child exploitation websites using Principal Component Analysis",
        "authors": "Movahedi Fateme, Frank Richard",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21428/cb6ab371.72559b71"
    },
    {
        "id": 317,
        "title": "FAKTOR-FAKTOR YANG MEMPENGARUHI PENGEMBANGAN AGROINDUSTRI KELAPA BERDASARKAN PRINCIPAL COMPONENT ANALYSIS",
        "authors": "",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24961/j.tek.ind.pert.20232.33.3.228"
    },
    {
        "id": 318,
        "title": "Principal component analysis of infinite variance functional data",
        "authors": "Piotr Kokoszka, Rafał Kulik",
        "published": "2023-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmva.2022.105123"
    },
    {
        "id": 319,
        "title": "HEATING TANK SYSTEM FAULT DIAGNOSTIC MECHANISM USING KERNEL PRINCIPAL COMPONENT ANALYSIS",
        "authors": "Duy An Huynh, Khuong Thanh Nguyen",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "Nowadays, global industry is witnessing the explosion of exible manufacturing systems considered as key role for the fourth industrial revolution. Almost hardware and software producers tried their best to assure the best performance for those system. However, some chemical processes in particular requires more strict conditions beside high-accuracy operation of actuators. Chemical reactions may lead to a poor quality for output product even a small change. Therefore, beside the necessary of high-performance integrated control system, monitoring operation should be fast and correct enough to detect and isolate faults when any problems happened in system. In this paper, a method for process fault detection and diagnostic based on data-driven estimation is investigated. In this method, the process fault is detected based on the error between process model response and process response. The Kernel Principal Component Analysis (KPCA) is utilized to classify errors for fault diagnostic. In this research, the method is veried on Stirred-Tank Heating Process. The simulation results demonstrate the effectiveness of proposed method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36106/gjra/5207383"
    },
    {
        "id": 320,
        "title": "Assessment of variation in rice maintainer lines using principal component analysis",
        "authors": "",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2024.1501.024"
    },
    {
        "id": 321,
        "title": "Principal Component Analysis - Points of Association Between Cancer and Economic Development",
        "authors": "",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/cejeme.2023.146538"
    },
    {
        "id": 322,
        "title": "Analysis of Merchandise sales by factor, principal component and cluster models",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/infse.2024.050119"
    },
    {
        "id": 323,
        "title": "Reaction Time Estimation Based on Recursive Short-Term Principal Component Analysis for Skeletal Information of Badminton Players",
        "authors": "Kana Sagawa, Hidehiko Shishido, Masashi Suita, Itaru Kitahara",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012156900003587"
    },
    {
        "id": 324,
        "title": "Principal component analysis and authorship",
        "authors": "Nathan Dooner",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/llc/fqad054"
    },
    {
        "id": 325,
        "title": "Principal component analysis and genetic correlation studies in Lens culinaris Medik.",
        "authors": "",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1403.097"
    },
    {
        "id": 326,
        "title": "Effectiveness analysis of university education management applying principal component analysis method",
        "authors": "Xiuli Chen",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper examines the effectiveness of educational management in colleges and universities by analyzing the comprehensive quality evaluation of students through principal component analysis. In the study, this paper constructs a set of index systems for students’ comprehensive quality evaluation obtains principal components and determines the number of retained principal components by standardizing the original data and calculating the eigenvalues and eigenvectors of the correlation coefficient matrix. Through detailed assessment and analysis of student’s basic information, personal comprehensive quality evaluation and overall quality evaluation, conclusions about the effectiveness of education management in colleges and universities were drawn. The analysis showed that the overall evaluation scores of students A, B, C, D and E, 5 were 84.7, 90.7, 74.79, 78.09 and 84.86, respectively. From the evaluation results, the student's overall quality development was relatively balanced, and the overall evaluation was good.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00846"
    },
    {
        "id": 327,
        "title": "Composition analysis of ancient glass products based on logistic regression and principal component analysis",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070612"
    },
    {
        "id": 328,
        "title": "Risk Factor Analysis in Breast Cancer Using Principal Component Analysis",
        "authors": "Charanpreet Kaur, Rosy Madaan",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10465837"
    },
    {
        "id": 329,
        "title": "Determining The Number of Principal Components with Schur's Theorem in Principal Component Analysis",
        "authors": "Cihan KARAKUZULU, İbrahim Halil GÜMÜŞ, Serkan GÜLDAL, Mustafa YAVAŞ",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "Principal Component Analysis is a method for reducing the dimensionality of datasets while also limiting information loss. It accomplishes this by producing uncorrelated variables that maximize variance one after the other. The accepted criterion for evaluating a Principal Component’s (PC) performance is λ_j/tr(S)  where tr(S) denotes the trace of the covariance matrix S. It is standard procedure to determine how many PCs should be maintained using a predetermined percentage of the total variance. In this study, the diagonal elements of the covariance matrix are used instead of the eigenvalues to determine how many PCs need to be considered to obtain the defined threshold of the total variance. For this, an approach which uses one of the important theorems of majorization theory is proposed. Based on the tests, this approach lowers the computational costs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17798/bitlisfen.1144360"
    },
    {
        "id": 330,
        "title": "Principal component analysis implementation on machine learning in diabetes classification",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/8492"
    },
    {
        "id": 331,
        "title": "Principal Component Analysis variants for Parkinson datasets",
        "authors": "Cheng Chen",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "Principal Component Analysis (PCA) is one of the most fundamental dimension reduction methods that need further research. With the widespread popularity of machine learning and the arrival of the era of big data, dimension reduction has become a hot topic and principal component analysis is a hot topic. However, although there are a lot of researchers who focus on the methods of the PCA, few researches on Parkinson Datasets have been made. As a result, the aim of our work is to discuss the PCA variants for Parkinson Datasets. This paper first introduces the three most commonly used PCA methods: PCA, Sparse PCA and Kernel PCA, and then introduces the Support Vector Machine (SVM) used to measure the dimension reduction effect. After that, we introduced the Parkinson's dataset and the meanings of root mean square error (RMSE), overall accuracy, Cohens kappa (Kappa) and computational time, the indicators that are used to measure the dimensionality reduction effect. Finally, we identified the variants among different PCA methods on the Parkinson dataset by comparing the indicators of the data obtained after dimensionality reduction using different methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/44/20230097"
    },
    {
        "id": 332,
        "title": "Computation of financial risk using principal component analysis",
        "authors": "Masiala Mavungu",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "This article uses Principal Component Analysis to compute and extract the main factors for the financial risk of a portfolio, to determine the most dominating stock for each risk factor and for each portfolio and finally to compute the total risk of the portfolio. Firstly, each dataset is standardized and yields a new datasets. For each obtained dataset a covariance matrix is constructed from which the eigenvalues and eigenvectors are computed. The eigenvectors are linearly independent one to another and span a real vector space where the dimension is equal to the number of the original variables. They are also orthogonal and yield the principal risk components (pcs) also called principal risk axis, principal risk directions or main risk factors for the risk of the portfolios. They capture the maximum variance (risk) of the original dataset. Their number may even be reduced with minimum (negligible) loss of information and they constitute the new system of coordinates. Every principal component is a linear combination of the original variables (stock rate of returns). For each dataset, each financial transaction can be written as a linear combination of the eigenvectors. Since they are mutually orthogonal and linearly independent and that they capture the maximum variance of the original data, the risk of the portfolio is calculated by using the principal components, then they have been used to calculate the total risk of the portfolio which is a weighted sum of the variance explained by the principal components.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/af-220339"
    },
    {
        "id": 333,
        "title": "A MORPHOMETRIC ANALYSIS OF CALIFA SURVEY GALAXIES THROUGH CLUSTERING AND PRINCIPAL COMPONENT ANALYSIS VISUALIZATION",
        "authors": "",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets47129"
    },
    {
        "id": 334,
        "title": "Analysis of factors influencing police investigation work based on principal component analysis",
        "authors": "Hao Huang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nIn this paper, the generation and carrier models of criminal psychological traces are synthesized and applied to detect criminal cases by constructing a criminal psychological trace model. Secondly, the psychological state of the interrogated person is identified using the first and second layers of the principal component analysis network, and the psychological characteristics of the interrogated person are extracted based on the grey time series improved principal component analysis (GPCA) method. Finally, the psychological state of the interrogated person was analyzed by the psychological test of the criminal psychological trace model. The results showed that the AUC of the CIT psychological test effect on criminal experience was 0.638, while the CIT psychological test effect using the criminal psychological trace model was 0.875. This indicates that the research method in this paper can better understand the criminal psychological traces in the police investigation and their effects on the interrogated person and improve the effectiveness and accuracy of the police investigation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00859"
    },
    {
        "id": 335,
        "title": "Principal Component Analysis in Image Classification: A review",
        "authors": "Sidra Aslam, Tamer Farouk Rabie",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aset56582.2023.10180847"
    },
    {
        "id": 336,
        "title": "Entropy-based subset selection principal component analysis for diabetes risk factor identification",
        "authors": "Valentino Pratama, Jimmy Tjen",
        "published": "2023",
        "citations": 0,
        "abstract": "Diabetes is one of the most common diseases, with an estimated 10% of the population suffering from this disease. Therefore, it is important to be able to identify the symptoms of this disease as early as possible before the patient's condition worsens and requires more expensive medical treatment. We aimed to study whether the entropy-based subset selection principal component analysis (E-ss PCA) can diagnose if a person is diabetic. The E-ss PCA is a novel machine learning method that can identify important parameters from a dataset. The E-ss PCA method was originally developed to fix the linearity problem that occurred when the principal component could not be written as the linear combination of the original parameters. Through the process, the E-ss PCA generates subsets of data that guarantee the linearity of variables of the subset. Via the E-ss PCA algorithm, we aim to verify which diabetic risk factors, such as pregnancy, triceps skinfold thickness, Body Mass Index (BMI), pedigree function, and age, are significant. Based on a dataset of diabetes patients from the United States National Institute of Diabetes and Digestive and Kidney Diseases, the E-ss PCA method was able to predict whether a person has diabetes or not with an average accuracy of 97.30%, which is higher than the classical PCA with an average accuracy of 94.45%. Furthermore, the proposed algorithm identified that the risk factors that accurately predict diabetes are BMI, triceps skin fold thickness, and blood pressure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/23-015"
    },
    {
        "id": 337,
        "title": "Principal Component Analysis in  advanced breeding lines of oat (A. sativa × A. sterilis)",
        "authors": "",
        "published": "2023-5-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1402.049"
    },
    {
        "id": 338,
        "title": "Evaluation of Homomorphic Encryption for Privacy in Principal Component Analysis",
        "authors": "David Arnold, Jafar Saniie",
        "published": "2023-5-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eit57321.2023.10187220"
    },
    {
        "id": 339,
        "title": "Principal Component Analysis on a Spring Mass Dynamic System",
        "authors": "Padmasri Venkatakrishnan, Hen-Geul Yeh",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igessc59090.2023.10321747"
    },
    {
        "id": 340,
        "title": "Structure and Analysis of the Smart Court Construction Evaluation Index Based on Principal Component Analysis for Different Regions",
        "authors": "Dan Zhang Dan Zhang, Ting-Jie Lu Dan Zhang, Chen-Xing Yang Ting-Jie Lu, Xue-Yan Wang Chen-Xing Yang",
        "published": "2023-8",
        "citations": 0,
        "abstract": "\n                        <p>In this paper, the principal component analysis method is mainly used to analyze that the construction level of Smart Court in different regions. The construction level of Smart Court consists of three main components. The result of Smart Court construction level in different regions is calculated. It is concluded that the construction level of Smart Court varies in different regions. It is necessary to make great efforts to solve the problem of unbalanced regional development. It is suggested that the construction of Smart Court in the future should focus on the publicity business such as online cases. And more and more new generation information technology such as artificial intelligence should be applied.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/199115992023083404009"
    },
    {
        "id": 341,
        "title": "Effectiveness of principal component analysis in breast cancer diagnosis: An empirical and visualization analysis",
        "authors": "Kangjie Lu",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "With the development of computer science technology, it is increasingly common to apply computer science technology to the medical field, and one of the typical examples is to predict the probability of cancer cells recurrence in cancer patients. However, there is still a lack of unified explanation for the impact of the principal component analysis (PCA) dimensionality reduction method used in prediction on the final experimental results. Therefore, the research topic of this paper is the effect of PCA dimensionality reduction method on the accuracy of cancer prediction. The methodology in this paper is as follows: First, patient data were collected, based on a usable machine learning repositor. It has 569 instances, which contains both malignant and benign tumors. Second, exploratory data analysis is performed on the data, detecting outliers and discovering existing correlated data. Then, the comparative method is used to explore the effectiveness of PCA dimensionality reduction method on the prediction accuracy by observing and analyzing tables and images. It is found that the PCA dimensionality reduction method plays a positive role for boosting the prediction accuracy, but the PCA method does not significantly improve the prediction accuracy for the data that has been processed and the dimension is not high.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/17/20230936"
    },
    {
        "id": 342,
        "title": "PENGENALAN WAJAH MENGGUNAKAN PRINCIPAL COMPONENT ANALYSIS ( PCA ) DAN EIGEN FACE",
        "authors": "Mohammad Sendy Satrio",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nAbstrak\r\nPengenalan wajah adalah kerangka kerja identitas individu yang memanfaatkan kualitas wajah seseorang. Biometrik adalah bidang ilmiah yang menggunakan karakteristik wajah seseorang untuk menentukan atau mengungkapkan identitas mereka. Pengenalan wajah merupakan salah satu subbidang dari biometrik. Penelitian ini mengembangkan sistem pengenalan wajah yang mengandalkan ekstraksi fitur berdasarkan Principal Component Analysis (PCA). Metode ini mencakup pengambilan bagian-bagian mendasar dari kumpulan data wajah. Pengujian sistem dengan 45 citra wajah asli dilakukan untuk memastikan akurasi sistem pengenalan wajah manusia yang dikembangkan dalam penelitian ini. Akurasi pengenalan gambar yang benar dari sistem ditentukan oleh hasil pengujian sebesar 80%.\r\n\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.36308/iris.v1i2.521"
    },
    {
        "id": 343,
        "title": "MORPHOLOGICAL CHARACTERIZATION OF PAKISTANI MANGO (MangiferaindicaL.) VARIETIES USING PRINCIPAL COMPONENT ANALYSIS",
        "authors": " H. Mukhtar",
        "published": "2023-1-4",
        "citations": 0,
        "abstract": "The morphological data of mango varieties was provided by Shujabad mangoresearch center. The point of present study was to evaluate diversity and grouping pattern of the mangovarieties and traits. A total of 36 morphological characters were considered.Twenty fourqualitativetraits fromtree(4), leaves (5), inflorescences (4), fruits and seeds (11) were included. Twelvequantitative traitsfrom leaf(2),flower and seed(10) were selected.Principal component analysis (PCA)was done by XLSTAT.Fifteen fruit traits and four leaf traits were used to index mangomorphology.The first three principal components clarified 34%of variation and identified fruit/stonetraits especially the fruit length, fruit thickness and fruit width, fiber length, total soluble salts (TSS),leaf colour, twisting of leaf blade as important traits that could be used to categorize mangovarieties.Fajri Kalan, Sindhri and Chaunsasufaidwere conspicuous due to highest fruit weight, stonethickness, fruit thickness and fruit length. The high morphological diversity within the mango varietiescould prove to be helpful in their identification and categorization",
        "keywords": "",
        "link": "http://dx.doi.org/10.57041/pjs.v68i3.530"
    },
    {
        "id": 344,
        "title": "Kernel $$\\ell ^1$$-norm principal component analysis for denoising",
        "authors": "Xiao Ling, Anh Bui, Paul Brooks",
        "published": "2023-9-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11590-023-02051-3"
    },
    {
        "id": 345,
        "title": "AN UNSUPERVISED MACHINE LEARNING ALGORITHM: PCA (PRINCIPAL COMPONENT ANALYSIS) COMPREHENSIVE REVIEW",
        "authors": "",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49457"
    },
    {
        "id": 346,
        "title": "A Principal Component Analysis of Digital Banking Development in Taiwan",
        "authors": "Mei-Mei Lin, Fu-Hsiang Kuo",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "Abstract\n\nIn Taiwan, the digitalization of banks has imparted a future trend and a national financial technology (FinTech) policy. This paper aims to study which factors will affect the promotion of digital banking amongst digital accounts. Categorically, we applied the principal components analysis (PCA) method to analyze and identify the main factors of digital banking development. In addition, this study used three years of data from 2017 to 2020 since the data were relatively comprehensive and included all the large financial holding companies (15 in total) in Taiwan. The empirical findings can briefly be summarized as follows: a bank that wants to promote digital accounts must start with a credit card since that is what digital finance must be bound to. They also need to let people know that digital accounts have many advantages, such as no deposit limits or interest-free cross-bank withdrawals. There are a few crucial factors that need to be considered, including the number of free transfers, the card in force, active cards, and the number of free withdrawals. If banks effectively promote and attract people to apply for digital accounts, it could strongly contribute to the development of digital banking in Taiwan.\n\nJEL classification numbers: C45, G10.\nKeywords: Financial technology, Digital banking, Digital account, Principal components analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47260/jafb/1342"
    },
    {
        "id": 347,
        "title": "Time series regression based on Bayesian model averaging and principal component analysis",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070110"
    },
    {
        "id": 348,
        "title": "Research and Application of Grey Principal Component Analysis in Big Data Analytics",
        "authors": "Chunyan Jiang",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccea58433.2023.10135466"
    },
    {
        "id": 349,
        "title": "Detecting the Foreground Dynamic Scenes using Gaussian Mixture Model Analysis Compared with Novel Principal Component Analysis",
        "authors": "Swathi Baswaraju",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250617"
    },
    {
        "id": 350,
        "title": "Information theory divergences in principal component analysis",
        "authors": "Eduardo K. Nakao, Alexandre L. M. Levada",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-024-01215-w"
    },
    {
        "id": 351,
        "title": "Analysis of Arctic Buoy Dynamics using the Discrete Fourier Transform and Principal Component Analysis",
        "authors": "James H. Hepworth, Amit Kumar Mishra",
        "published": "2023-5-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2mtc53148.2023.10176076"
    },
    {
        "id": 352,
        "title": "Spatio-temporal principal component analysis",
        "authors": "Mirosław Krzyśko, Peter Nijkamp, Waldemar Ratajczak, Waldemar Wołyński, Beata Wenerska",
        "published": "2024-1-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/17421772.2023.2237532"
    },
    {
        "id": 353,
        "title": "Gender and Age Detection Techniques for Blind People using Principal Component Analysis",
        "authors": "J. Meenakshi, G. Thailambal",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134298"
    },
    {
        "id": 354,
        "title": "A Predication Analysis of the Factors Influencing Minimum Ignition Temperature of Coal Dust Cloud Based on Principal Component Analysis and Support Vector Machine",
        "authors": "",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/ams.2019.128687"
    },
    {
        "id": 355,
        "title": "Photovoltaic Power Prediction Method based on Principal Component Analysis and Gated Recurrent Unite Network",
        "authors": "Gang Qi",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/powercon58120.2023.10331568"
    },
    {
        "id": 356,
        "title": "A Novel Rule-Based Skin Detection Method using Principal Component Analysis-Based Dimensionality Reduction and Individual Contribution on Principal Components",
        "authors": "Abdelkrim Sahnoune, Djamila Dahmani, Saliha Aouat",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiccsa59173.2023.10479292"
    },
    {
        "id": 357,
        "title": "Functional principal component analysis for cointegrated functional time series",
        "authors": "Won‐Ki Seo",
        "published": "2024-3",
        "citations": 1,
        "abstract": "Functional principal component analysis (FPCA) has played an important role in the development of functional time series analysis. This note investigates how FPCA can be used to analyze cointegrated functional time series and proposes a modification of FPCA as a novel statistical tool. Our modified FPCA not only provides an asymptotically more efficient estimator of the cointegrating vectors, but also leads to novel FPCA‐based tests for examining essential properties of cointegrated functional time series.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/jtsa.12707"
    },
    {
        "id": 358,
        "title": "Study of genetic variability and diversity analysis in maize (Zea mays L.) by agglomerative hierarchical clustering and principal component analysis",
        "authors": "",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1401.015"
    },
    {
        "id": 359,
        "title": "Association analysis and principal component analysis in green gram (Vigna radiata (L.) Wilczek) genotypes for yield and its contributing traits",
        "authors": "",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1404.164"
    },
    {
        "id": 360,
        "title": "Analysis of tea culture communication path based on the principal component analysis method",
        "authors": "Da Li, Yaozhao Zhong",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nTea culture is the main component of Chinese traditional culture, and the analysis of tea culture dissemination paths can promote the process of Chinese traditional culture dissemination to the outside world. This paper standardizes the tea culture dissemination paths based on the principal component analysis method. The correlation matrix of the standardized data is tested for sampling suitability, and the eigenvalues and eigenvectors are calculated to derive the principal components. The variance contribution rate and the cumulative contribution rate of the variance of the principal components are calculated, and then the scores of each principal component are derived and evaluated comprehensively. Accordingly, the main communication paths of tea culture are new media communication, museum collection and exhibition, and tea trade. Based on this, this paper analyzes the communication effects of the communication paths, and the results show that: the number of followers of public accounts related to tea culture reached 63,214 in 2021, an increase of nearly 24% compared with 2019. The total number of visitors to the museum collection and exhibition of tea culture was 28,004 in 2021, an increase of 22.7% compared with the previous year. The number of tea exports and export countries both increased significantly in 2021 compared with 2012. It can be seen that the main dissemination paths of tea culture obtained by the principal component analysis method are effective for the dissemination of tea culture and also provide a reference meaning for the dissemination of other traditional Chinese culture.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.1.00101"
    },
    {
        "id": 361,
        "title": "Quantification of Light Pollution Levels Based on Principal Component Analysis and Hierarchical Analysis Approach",
        "authors": "Xinyu Du, Zongjin Jian",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "The level of light pollution risk is influenced by a number of factors. In this paper, we established a model to evaluate the risk level of light pollution in a certain area by considering various factors.Through the principal component analysis of the 12 indicators selected by us, three principal components are extracted, and then the analytic hierarchy process is used to evaluate the three principal components, so as to establish the corresponding weight of the three principal components, and finally establish the relevant evaluation function.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v79i.15116"
    },
    {
        "id": 362,
        "title": "Analisis Random Forest Menggunakan Principal Component Analysis Pada Data Berdimensi Tinggi",
        "authors": "Farah Diba",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "Data yang memiliki dimensi tinggi membutuhkan metode machine learning yang mampu bekerja lebih cepat dan efektif dalam proses klasifikasi. Salah satu algoritma yang mampu menangani data kompleks adalah Random Forest. Random Forest bekerja dengan membangun beberapa decision tree secara random sebagai acuan feature selection. Namun, data berdimensi tinggi membutuhkan ruang penyimpanan yang lebih besar sehingga mengakibatkan lamanya proses komputasi. Oleh karena itu, Principal Component Analysis merupakan salah satu metode reduksi dimensi dalam merepresentasikan data berdimensi tinggi. PCA akan membentuk beberapa Principal Component yang mengandung informasi penting dari data asli. Dataset yang digunakan pada penelitian ini bersumber dari kaggle repository terdiri atas 26 atribut dan 129880 intances. Hasil dari penelitian ini RF dengan dengan n_estimators = 7 setelah direduksi PCA memiliki akurasi terbaik yaitu 90,13% pada data water quality.. Hal ini membuktikan bahwa PCA mampu mereduksi dimensi dengan membentuk pohon n_estimators sebanyak 7.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i4.3329"
    },
    {
        "id": 363,
        "title": "Interpretation and Classification of Phonocardiogram Using Principal\nComponent Analysis",
        "authors": "Nikita Jatia, Sachin Kumar, Karan Veer",
        "published": "2023-7",
        "citations": 0,
        "abstract": "\nBackground:\nLarge datasets are logically common yet frequently difficult to interpret.\nPrincipal Component Analysis (PCA) is a technique to reduce the dimensionality of a dataset.\n\n\nObjective:\nThe main objective of this work is to use principal component analysis to interpret and\nclassify phonocardiogram signals.\n\n\nMethods:\nFinding new factors aids in the reduction of important components of an eigenvalue/\neigenvector problem, thus enabling the new factors to be represented by the current dataset and\nmaking PCA a flexible data analysis tool. PCA is adaptable to a variety of systems created to update\ndifferent data types and technology advancements.\n\n\nResults:\nSignals acquired from a patient, i.e., bio-signals, are used to investigate the patient's\nstrength. One such bio-signal of central significance is the phonocardiogram (PCG), which addresses\nthe working of the heart. Any change in the PCG signal is a characteristic proportion of\nheart failure, an arrhythmia condition.\n\n\nConclusion:\nLong-term observation is difficult due to the many complexities, such as the lack of\nhuman competence and the high chance of misdiagnosis.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1574362418666230803145322"
    },
    {
        "id": 364,
        "title": "Principal component analysis: development and initial validation of the mirror effects inventory",
        "authors": "Wing W. Y. Ho",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Abstract\nBackground\nMirroring is a specific phenomenon that occurs in groups. People observe others enacting different roles in given situations, whereby concretizing the role of the observing aspect of their self as if looking in a mirror. Individuals could acquire emotional, cognitive, imaginative, behavioral, and interpersonal experiences through this process of mirroring; that is, “mirror effects.” Given that there are very few comprehensive scales capable of evaluating mirror effects, the Mirror Effects Inventory (MEI) was developed to measure experiences after participating in counseling education. This study describes the development of the MEI based on an interpersonal perspective and aimed to validate this scale.\n\nMethods\nThe development and validation of the MEI involved a seven-stage process that utilized both qualitative and quantitative methods. Former students who studied counseling (N = 24) were surveyed via semi-structured telephone interviews. A subjective perceived scale (the MEI) was then constructed. The MEI was administered to part-time university students (N = 221) studying counseling courses. Psychometric tests were performed to examine its validity and reliability. Validation of the MEI included examining correlations between three types of mirror effects and age differences and educational attainment.\n\nResults\nThe PCA revealed three types of mirror effects: general, positive, and negative. These components accounted for 53.82% of the total variance. Reliability estimates measured using Cronbach’s alpha of .88 indicated that the items were internally consistent. The findings showed that as the general mirror effect increased, there was a corresponding increase in the positive mirror effect and a decrease in the negative mirror effect. However, an increase in positive mirror effects was associated with an increase in negative mirror effects.\n\nConclusions\nThe development of a reliable and valid measure of mirror effects has benefits and implications for counseling education and clinical practice. Further empirical research could contribute to resolving the controversies concerning the basic conceptual understanding of MEI.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40359-023-01397-8"
    },
    {
        "id": 365,
        "title": "Principal Component Analysis of Aviation Noise Grids for Dimensionality Reduction",
        "authors": "Ameya Behere, Dimitri N. Mavris",
        "published": "2023-1-23",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-0794"
    },
    {
        "id": 366,
        "title": "Principal component analysis (PCA) on temporal changes of soil health indicators",
        "authors": "Fakher Kardoni",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Soil health indicators are related to environmental factors, such as nutrient management, crop practices, different cropping systems, and biodiversity. 14 soil health indicators were measured and compared in our study to clarify the impact of different cropping system on soil quality. The primary comparisons were carried out among perennial plants, annual plants, and cover cropping, with an examination of the tillage system and fertilization taken into account during the analysis. Multivariant analysis recorded that the most promising indicators of soil health that related to soil quality and health were organic carbon (OC), total carbon (TC), followed by fall soil total nitrogen (TN). The main factor for clustering treatments based on indicators was N fertilization according to Euclidean distance that was applied to measure similarity of the groups. Although perennials and cover crops recorded more carbon sequestration and TC improvement, corn crops showed the worse impact on soil pH and bulk density (BD). Non-tillage practices significantly increased wet aggregate and soil moisture. The combination of TC field measurements with long-term cropping systems information has improved our understanding of how different cropping practices influence SOC improvement in soil full profile. It would develop appropriate and cost-effective agricultural management activities, maintain or improve carbon soil accumulation to guide farmer decision making, and ultimately advance food and nutritional security.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ipas.85271"
    },
    {
        "id": 367,
        "title": "Innovative teaching strategies: A principal component analysis",
        "authors": "Ntsieni Fitzgerald Ramasimu",
        "published": "2024",
        "citations": 0,
        "abstract": "The paper investigated the degree of innovative teaching practices by secondary school teachers in the Vhembe District, South Africa, using a principal component analysis approach. Innovative teaching strategies refer to creative and efficient actions and performances that teachers use in the selection of materials, techniques, and learner assessments to encourage and develop learner creativity (Yu et al., 2021). Innovative teachers are those whose teaching methods differ from the conventional patterns of knowledge-transfer teaching and teacher-centred teaching. They solve educational problems in novel ways using new technologies and theoretical frameworks while guiding learners in deep learning and creativity (Tan et al., 2022). The objective of the study was to examine the innovative teaching strategies implemented by teachers in rural secondary schools to improve learner performance. A descriptive case study was employed in the paper, which was based on a quantitative research design. Using probability sampling approaches, 338 secondary school teachers were sampled. Data was collected through questionnaires and was analysed using descriptive statistical methods. The variables were reduced from 30 to 9 clusters using principal component analysis with varimax rotation. Clusters were termed stakeholders’ engagement, school and classroom practices, learner support, collaboration, professionalism, technology, relationships, diversity, and expertise.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22495/cbsrv5i1art9"
    },
    {
        "id": 368,
        "title": "Predicting Preeclampsia Using Principal Component Analysis and Decision\nTree Classifier",
        "authors": "Farida Musa, Rajesh Prasad",
        "published": "2023-5",
        "citations": 0,
        "abstract": "\nBackground:\nPreeclampsia affects pregnant women, resulting in stroke, organ failure, and other health problems like seizures. The effect of preeclampsia is most pronounced in developing countries and it affects about 4% of pregnant women causing several illnesses and even death. The key to solving the problem of preeclampsia is its early detection and use of machine learning algorithms that can take various demographic features, biochemical markers, or biophysical features, select important features and find hidden patterns that point to preeclampsia.\n\n\nObjective:\nThe objective of this research is to develop a machine-learning framework to detect Preeclampsia in pregnant women.\n\n\nMethods:\nThis research develops a model to detect preeclampsia using principal component analysis (PCA) as a feature selection, k-means as an outlier detection, a combination of SMOTE oversampling, random under sampling  and  the decision tree (DT) to classify and predict the risk of preeclampsia among pregnant women. The data was obtained from the University of Abuja Teaching Hospital, Abuja, Nigeria.\n\n\nResults:\nFindings revealed that the combination of the PCA, SMOTE and random undersampling and DT outcome resulted in the best accuracy of 96.8% which is better than the accuracy of existing work (92.1%). Furthermore, the reliability of the model was measured and tested using Bayesian Probability.\n\n\nConclusion:\nThe developed model can be helpful to Health care providers in checking preeclampsia among women with high blood pressure during their second antenatal visits.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573404820666230227120828"
    },
    {
        "id": 369,
        "title": "Dynamic Eccentricity Fault Detection in Synchronous Machines Using Principal Component Analysis",
        "authors": "Latifa Yusuf, Ilamparithi T",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccece58730.2023.10288802"
    },
    {
        "id": 370,
        "title": "Analysis of the Parameters of Radio Pulsars with Giant Pulses Using the Principal Component Analysis",
        "authors": "I. F. Malov, O. I. Malov",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Clustering of radio pulsars with observable giant pulses (GPs) has been carried out using the principal component analysis. Five parameters were used (period, its derivative, observed luminosity, kinematic age, and the angle between the rotation axis and the magnetic moment of the central neutron star). It was shown that the set of all known GP pulsars is divided into two clusters in the phase space of the principal components. One of the clusters contains four pulsars with short periods and high luminosity; the second cluster contains nine long-period and fainter sources. A separate object, not included in these two clusters, is the pulsar in the Crab Nebula. Possible models that could explain the observed difference between GP pulsars were considered.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31857/s0004629923030052"
    },
    {
        "id": 371,
        "title": "Optimization of Neptunium-237 Modified Direct Denitration Production via Principal Component Analysis",
        "authors": "Connor Parker, Kathryn Peruski, Samantha Cary",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13182/nets23-41699"
    },
    {
        "id": 372,
        "title": "Construction of Online Learning Evaluation System based on Principal Component Analysis Method",
        "authors": "Hao Su, Li Cheng",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.s10.67-78"
    },
    {
        "id": 373,
        "title": "Fault Detection of Multi-Rate Two Phase Reactor Condenser System with Recycle Using Multiple Probabilistic Principal Component Analysis",
        "authors": "Dhrumil Gandhi, Meka Srinivasarao",
        "published": "2023-5-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ecp2023-14669"
    },
    {
        "id": 374,
        "title": "Unsupervised High Impedance Fault Detection Using Autoencoder and Principal Component Analysis",
        "authors": "Yingxiang Liu, Mohammad Razeghi-Jahromi, James Stoupis",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ias54024.2023.10406489"
    },
    {
        "id": 375,
        "title": "Modeling Sri Lankan GDP using Macroeconomic Indicators: An Approach Using Principal Component Analysis",
        "authors": "A.W.S.P Karunarathne, I.T.S Piyatilake",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitr61062.2023.10382950"
    },
    {
        "id": 376,
        "title": "Longitudinal Principal Component and Cluster Analysis of Azerbaijan’s Agricultural Productivity in Crop Commodities",
        "authors": "Ibrahim Niftiyev, Gubad Ibadoghlu",
        "published": "2023-5-8",
        "citations": 1,
        "abstract": "Understanding long-term agricultural productivity is essential for designing agricultural policies, planning and targeting other economic policies (e.g., industrial policy), and managing agricultural business models. In a developing and oil-rich country such as Azerbaijan, agriculture is among the limited opportunities to diversify oil-based value added and address broad welfare issues, as farmers and agricultural workers account for a large share of total employment and the labor force. However, previous studies have not focused on an empirical assessment of the long-term and subsectoral productivity of crop commodities. Rather, they have used a highly aggregated and short-run perspective, focusing mainly on the impact of the oil sector on agricultural sectors. Here, we applied principal component analysis and hierarchical cluster analysis to identify similarities and differences in the productivity of specific crop commodities (e.g., cotton, tea, grains, tobacco, hay, fruits, and vegetables) between 1950 and 2021. We show that some crops are similar in terms of their variation, growth rates, and transition from the Soviet era to the post-Soviet period. Although the dynamics of change are different for food and non-food crops and for high- and low-productive commodities, it is still possible to narrow down specific subsectors that could reach the same productivity levels. This helps map out the productivity levels of crop commodities over time and across different subsectors, allowing for better policy decisions and resource allocation in the agricultural sector. In addition, we argue about some outlier commodities and their backward status despite extensive government support. Our results provide a common basis for policymakers and businesses to focus specifically on productivity and profitability from an economic standpoint.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/commodities2020009"
    },
    {
        "id": 377,
        "title": "Modelling of Earphone Design Using Principal Component Analysis",
        "authors": "Lucas Kwai Hong Lui, C. K. M. Lee",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "This research investigated a mathematical model of earphone design with principal component analysis. Along with simplifying the design problem, a predictive model for the sound quality indicators, namely, total harmonic distortion, power of output, range of frequency response, signal-to-noise ratio, impedance of the speaker, and headroom, was formulated. (1) Background: Earphone design is a difficult problem requiring excessive experience and know-how in the process. Therefore, this research was developed to formulate a predictive model to facilitate the design process. (2) Methods: A simplified model for the design was developed in previous research, while the sound quality indicators were found to be connected to the eight material-specific parameters. Simultaneously, a principal component analysis (PCA) was utilized to decrease the number of input variables and create a more convenient and streamlined model. (3) Results: The principal component analysis-based approach obtained suboptimal predictive accuracy for the sound quality indicators, but a simplified formulation was obtained. (4) Conclusions: Based on the development and comparison of the modelling approach, it can be seen that principal component analysis can be utilized to simplify the mathematical model of the earphone design problem with a trade-off of accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13179912"
    },
    {
        "id": 378,
        "title": "Application of Principal Component Analysis to Vehicle Sales: Case Study at IBM Company",
        "authors": "",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21271/zjhs.28.15"
    },
    {
        "id": 379,
        "title": "Application of Principal Component Analysis to Vehicle Sales: Case Study at IBM Company",
        "authors": "",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21271/zjhs.28.1.15"
    },
    {
        "id": 380,
        "title": "Cyclostationary signal sensing algorithm based on principal component analysis and AdaBoost",
        "authors": "Wei Qin",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604078.3604110"
    },
    {
        "id": 381,
        "title": "Robust Principal Component Analysis via Truncated $L_{1-2}$ Minimization",
        "authors": "Ying Huang, Zhi Wang, Qiang Chen, Wu Chen",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191506"
    },
    {
        "id": 382,
        "title": "Data collection and talent demand analysis of recruitment website based on principal component analysis",
        "authors": "Jihui Fan, Fengshan Yuan",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2667708"
    },
    {
        "id": 383,
        "title": "Analysis of glass relics based on principal component analysis and k-means clustering",
        "authors": "Kehan Tong",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "Abstract\nThe Silk Road was an important channel for cultural exchanges between China and the West in ancient times, of which glass was a precious item representing early trade exchanges. In China, ancient glass is generally classified into high potassium and lead-barium categories. Using data collected and classified by archaeologists for glass relics, this paper wants to investigate the differences between the classification results based on their own chemical composition data and those given empirically, and the effect of weathering on the chemical composition of glass relics. To this end, the chemical composition was first reduced using principal component analysis for non-weathered and weathered relics respectively, and three principal components were extracted for each, with variance explained at 94.49% and 98.44% respectively. Then, the number of clusters of K-means clustering was determined to be 2 after the analysis of silhouette coefficient, and then the clustering results of non-weathered and weathered glass relics were obtained by K-means clustering. For non-weathered relics, the clusters were “class Pb” and “class Pb-K”; for weathered relics, the clusters were “class Ba” and “class Pb”. Through the above study, this paper finds that glass relics can be more carefully classified according to their own chemical composition characteristics, and weathering has a great impact on the chemical composition of glass relics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2608/1/012017"
    },
    {
        "id": 384,
        "title": "Statistical Shape Modelling of the Lumbar Spine With Reference to Gender and Principal Component Analysis",
        "authors": "Faris A. Almalki, Daniel H. Cortes",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Abstract\nNumerical simulation of spine mechanics relies on anatomical features of the vertebrae. Statistical shape models aid in these simulations by including shape variability and differences between groups, facilitating finite element simulations for medical procedures. This study aims to develop a statistical shape model of the lumbar vertebrae and to determine shape differences between genders. This study used CT images and 3D segmentations from the Vertebrae Segmentation challenge (VerSe) with a total of 138 vertebrae from 46 patients consisting of L3, L4, and L5 vertebrae. From these segmentations, statistical shape models were created, using ShapeWorks software, for the overall and gender-specific means. Moreover, gender differences, principal component analysis and modes of variations were illustrated. Major differences in posterior elements between overall, male, and female means were identified. Regarding the principal component analysis, the first principal component accounted for 39.4% of the variation, which was distributed between the vertebrae in dissimilar patterns. The second principal component, accounting for 20.4% of the variation, was concentrated in L5. In conclusion, this study specifies locations in the lumbar vertebrae with significant differences between genders and identifies modes of variations in the sample using principal component analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/imece2023-110141"
    },
    {
        "id": 385,
        "title": "Evaluation of stretch reflex synergies in the upper limb using principal component analysis (PCA)",
        "authors": "Frida Torell",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "The dynamic nature of movement and muscle activation emphasizes the importance of a sound experimental design. To ensure that an experiment determines what we intend, the design must be carefully evaluated. Before analyzing data, it is imperative to limit the number of outliers, biases, and skewness. In the present study, a simple center-out experiment was performed by 16 healthy volunteers. The experiment included three load conditions, two preparatory delays, two perturbations, and four targets placed along a diagonal path on a 2D plane. While the participants performed the tasks, the activity of seven arm muscles were monitored using surface electromyography (EMG). Principal component analysis (PCA) was used to evaluate the study design, identify muscle synergies, and assess the effects of individual quirks. With PCA, we can identify the trials that trigger stretch reflexes and pinpoint muscle synergies. The posterior deltoid, triceps long head, and brachioradialis were engaged when targets were in the direction of muscle shortening and the perturbation was applied in the opposite direction. Similarly, the pectoralis and anterior deltoid were engaged when the targets were in the direction of muscle shortening and the perturbation was applied in the opposite direction. The stretch reflexes were not triggered when the perturbation brought the hand in the direction of, or into the target, except if the muscle was pre-loaded. The use of PCA was also proven valuable when evaluating participant performance. While individual quirks are to be expected, failure to perform trials as expected can adversely affect the study results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0292807"
    },
    {
        "id": 386,
        "title": "Study On the Risk Level of Light Pollution Based on Principal Component Analysis",
        "authors": "Yifan Luo",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "In this paper, based on the principal component analysis, the evaluation indication of light pollution is established, and the effective control strategy is put forward. Through the statistical analysis of a large number of samples, light pollution is divided into four risk levels: no pollution, mild pollution, moderate pollution and moderate pollution. Then, seven parameters affecting light pollution are selected, the parameters of four areas are statistically analyzed, and eight groups of data are obtained. Through the principal component analysis, the dimension of the three principal components is reduced, and finally the relationship between the grade score of light pollution and the three principal components is obtained. In this study, scores were used as a universal measure to determine the risk level of light pollution in a place. According to the analysis of this study, the intervention strategy is put forward, for New York, Shanghai, Beijing and other national central cities, economic development is a priority, enterprises and households use light is huge, the need to strengthen the detection of lighting equipment and the introduction of relevant policies. Similarly, economic development is not a priority for Shanghai suburbs and Yamagata counties, and businesses and households will reduce the use of lighting. Finally, for nature reserves such as Sanjiangyuan, the development goal is to ensure that the environment will not be damaged. As a result, the light pollution index in these areas is very low.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v69i.13775"
    },
    {
        "id": 387,
        "title": "Research and Application Based on Principal Component Analysis Model and XGBoost Regression",
        "authors": "Yumeng Yang",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda60612.2024.10485990"
    },
    {
        "id": 388,
        "title": "Soil Clustering and Anomaly Detection Based on EPBM Data Using Principal Component Analysis and Local Outlier Factor",
        "authors": "Dayu Apoji, Kenichi Soga",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484982.001"
    },
    {
        "id": 389,
        "title": "A study of the composition of ancient glass based on a principal component analysis model",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajmc.2023.040201"
    },
    {
        "id": 390,
        "title": "Investigating paired comparisons after principal component analysis",
        "authors": "J.C. Castura, P. Varela, T. Næs",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.foodqual.2023.104814"
    },
    {
        "id": 391,
        "title": "Keyword Search of Incomplete Graph Based on Kernel Principal Component Analysis",
        "authors": "Yan Zhang, Mingli Jing",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmsp58539.2023.10170813"
    },
    {
        "id": 392,
        "title": "Principal component analysis of older people registered as unemployed in public employment offices",
        "authors": "Karolina Bolesta",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "The determinants of registering as an unemployed person in the public employment office may be of both a socio-demographic and legal character. Although every individual has their own motivation to register as unemployed, it is still possible to analyse the phenomenon on a group level. The purpose of this study is to show the similarities and differences of older people registering as unemployed and to identify the factors that were key to professional deactivation. The research is based on data from the Polish Central Analytical and Reporting System concerning 1,276,555 people born in the years 19401965, who were at least once registered as unemployed in a public employment office. The study uses principal component analysis (PCA) to identify the factors which influence to the largest extent the decision to deactivate professionally. The Kaiser-Meyer-Olkin measure of sampling adequacy and Bartletts test of sphericity proved the feasibility of the PCA. The number of principal components was determined on the basis of Kaisers criterion. The varimax factor rotation was applied to simplify the relation between the variables and to enhance the interpretation of the obtained results. The analysis included five groups: pensioners, disability pensioners, people who reached retirement age, people who received pre-retirement benefits and the total population. For each group three to four components were identified which combined different variables. Education and occupation in the last place of work formed the only common component for the five groups which influences the most critical decisions in the labour market. This component demonstrates the level of competence and may determine the moment of professional deactivation. The research shows that economic mechanisms are more important than legal conditions in all the analysed groups.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5604/01.3001.0016.2361"
    },
    {
        "id": 393,
        "title": "Research and Evaluation Based on Principal Component Analysis and BP Neural Networks",
        "authors": "Yijun Liu",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda60612.2024.10485947"
    },
    {
        "id": 394,
        "title": "Principal component Analysis(PCA) normal estimation based on TOF sensor",
        "authors": "Cao Anqi, Ni Xiuhua, Zhang Long",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciibms60103.2023.10347668"
    },
    {
        "id": 395,
        "title": "Seismic landslide susceptibility assessment using principal component analysis and support vector machine",
        "authors": "Ziyao Xu, Ailan Che, Hanxu Zhou",
        "published": "2024-2-14",
        "citations": 1,
        "abstract": "AbstractSeismic landslides are dangerous natural hazards that can cause immense damage to human lives and property. Susceptibility assessment of earthquake-triggered landslides provides the scientific basis and theoretical foundation for disaster emergency management in engineering projects. However, landslide susceptibility assessment requires a massive amount of historical landslide data. Evidence of past landslide activities may be lost due to changes in geographical conditions and human factors over time. The lack of landslide data poses difficulties in assessing landslide susceptibility. The aim of this study is to establish a generalized seismic landslide susceptibility assessment model for applying it to the Dayong highway in the Chenghai area, where earthquakes occur frequently but with a lack of landslide data. The landslide data used comes from the 2014 Ludian Ms (Surface wave magnitude) 6.5 earthquake in a region with geographical conditions similar to those in the Chenghai area. The influencing factors considered include elevation, slope, slope aspect, distance to streams, distance to faults, geology, terrain wetness index, normalized difference vegetation index, epicenter distance and peak ground acceleration. The frequency ratio method is used to eliminate influencing factors with poor statistical dispersion of landslides. Principal component analysis (PCA) is utilized to reduce the dimensionality of landslide conditioning factors and to improve the transferability of the assessment model to different regions. A support vector machine model is used to establish the susceptibility assessment model. The results show that the accuracy of the PCA–SVM model reaches 93.6%. The landslide susceptibility of the Chenghai area is classified into 5 classes, with the “Very high” landslide susceptibility class accounting for 0.63%. The 13-km section in the middle of the Dayong highway, which accounts for 8.9%, is identified as the high-risk area most obviously impacted by seismic landslides. This study provides a new approach for seismic landslide susceptibility assessment in areas lacking in landslide inventory data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-48196-0"
    },
    {
        "id": 396,
        "title": "Robust projected principal component analysis for large-dimensional semiparametric factor modeling",
        "authors": "Shuquan Yang, Nengxiang Ling",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmva.2023.105155"
    },
    {
        "id": 397,
        "title": "Analysis and comparison for prediction of Diabetic Pregnant women using Innovative Principal Component Analysis algorithm over Support Vector Machine Algorithm with Improved Accuracy",
        "authors": "P.V.S. Kumar, N.S. Kumar",
        "published": "2023-2-14",
        "citations": 1,
        "abstract": "Aim: The study’s aim is to analyze and compare the accuracy, sensitivity, and precision of diabetic prediction among pregnant women using the innovative Principal Component Analysis algorithm and Support Vector Analysis. Materials and Methods: This study involves two groups: Principal Component Analysis (N=20) algorithm and Support Vector Machine (N=20) with a sample size of 40 for each group. The sample size calculation uses a pre-test power of 80%, a threshold of 0.05, and a confidence interval of 95%. Results: Performance of algorithms are measured using accuracy, sensitivity, and precision. Principal Component Analysis algorithm results in mean accuracy of 79.43% significantly different with P=0.488(p>0.05), a sensitivity of 79.29% with P=0.096 (p<0.05), and a precision of 83.57%. Support Vector Machine algorithm results in mean accuracy of 77.67%, a sensitivity of 76.67%, and a precision of 83.54%. Conclusion: Principal Component Analysis algorithm performed significantly better than the Support Vector Machine algorithm for Diabetic prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.942948"
    },
    {
        "id": 398,
        "title": "Filtrated common functional principal component analysis of multigroup functional data",
        "authors": "Shuhao Jiao, Ron Frostig, Hernando Ombao",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aoas1827"
    },
    {
        "id": 399,
        "title": "Principal Component Analysis (PCA) and hierarchial clustering in tobacco (Nicotiana tabacum L.) for yield and yield attributing traits",
        "authors": "",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1402.062"
    },
    {
        "id": 400,
        "title": "A Hybrid Technique to Re-establish Squat Contrast Underwater Images Centred on Principal Component Analysis",
        "authors": "Aman Mittal",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-02191-4"
    },
    {
        "id": 401,
        "title": "A Method for Evaluating the Achievement of Teaching Objectives in College Balloon Volleyball Based on Principal Component Analysis",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/fsr.2023.050804"
    },
    {
        "id": 402,
        "title": "Feature selection based on improved principal component analysis",
        "authors": "Zhangyu Li, Yihui Qiu",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590036"
    },
    {
        "id": 403,
        "title": "Multi-target regression via target combinations using principal component analysis",
        "authors": "Takafumi Yamaguchi, Yoshiyuki Yamashita",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compchemeng.2023.108510"
    },
    {
        "id": 404,
        "title": "Fusion of Out of Focus Images Using Principal Component Analysis and Spatial Frequency",
        "authors": " V.P.S. Naidu,  J.R. Raol",
        "published": "2023-8-10",
        "citations": 1,
        "abstract": "Details of principal component analysis and spatial frequency are presented. Two image fusion architectures are developed to fuse multi focused images and their performance is compared. In first architecture source images to be fused are considered as whole in the fusion process. In second architecture the source images to be fused are divided into blocks and then used in the fusion process. Overall SF shows slightly better performance. Block based image fusion scheme (second architecture) shows superior performance. This architecture is very simple and can be used in real time applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61653/joast.v60i3.2008.729"
    },
    {
        "id": 405,
        "title": "Using principal component analysis to explore multi-variable relationships",
        "authors": "Patricia E. Fraino",
        "published": "2023-4-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s43017-023-00414-z"
    },
    {
        "id": 406,
        "title": "Adaptive local Principal Component Analysis improves the clustering of high-dimensional data",
        "authors": "Nico Migenda, Ralf Möller, Wolfram Schenck",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.110030"
    },
    {
        "id": 407,
        "title": "A Quick Decline Method for Forecasting Multiple Wells Using Sparse Functional Principal Component Analysis",
        "authors": "H Hamdi, E Zirbes, C. R Clarkson",
        "published": "2024-3-12",
        "citations": 0,
        "abstract": "Abstract\nAccurate production forecasting for multiple wells that have both sparse and irregular measurements concurrently is a challenging task. Type-well analysis is commonly employed to model the average decline behavior of a group of wells from empirical relationships. The modeled type-well represents the behavior of a typical well in the studied reservoir. However, modifying the type-well to forecast individual well data is difficult. In this study, sparse functional principal component analysis (FPCA) is utilized to accurately forecast production from multiple wells simultaneously from the systematic statistical trends inferred from the group of wells.\nSparse FPCA analyzes an ensemble of irregularly-sampled timeseries to describe the underlying random process (RP) using the decomposed components. As such, one can sample from the estimated RP and generate a smooth and regularly-sampled timeseries. The sparse FPCA is primarily an interpolation method where the reconstructed timeseries could not reach beyond the horizon set by the ensemble length. However, with the proposed approach in this study, the decomposed components of FPCA are extrapolated using an autoregressive integrated moving average (ARIMA) model to generate the full probabilistic forecasts beyond the horizon. In this proposed method, the underlying RP is extrapolated first, and then the extended timeseries are generated simultaneously by sampling from the new RP. To validate the accuracy of the extrapolated data in the short-term, part of the timeseries with longer histories are excluded from the training process and only used for testing.\nThe sparse FPCA was applied to analyze monthly gas production data from 200 multi-fractured horizontal wells (MFHWs) of a selected operator in the Montney Formation in Canada. The results indicate that the production data of all the wells could be easily condensed using only two principal components, describing more than 99% of the information content of the production timeseries. Additionally, the resulting decomposed components were convoluted, and the production profiles of the wells with short histories were extended from the information contents of the ensemble. Additionally, with the proposed stochastic ARIMA technique, the production profiles of all the wells were forecasted for 400 months beyond the ensemble limit. The results demonstrate that the extrapolation could accurately match the measured data used for testing, which provides confidence in the stochastic long-term forecast.\nThis study demonstrates for the first time that sparse FPCA can be combined with the ARIMA model to quickly conduct the probabilistic production forecast for hundreds and even thousands of MFHWs simultaneously, which can significantly improve the current type-well modeling workflows.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/218078-ms"
    },
    {
        "id": 408,
        "title": "Exploring Dynamic Structures in Matrix-Valued Time Series via Principal Component Analysis",
        "authors": "Lynne Billard, Ahlame Douzal-Chouakria, S. Yaser Samadi",
        "published": "2023-6-8",
        "citations": 3,
        "abstract": "Time-series data are widespread and have inspired numerous research works in machine learning and data analysis fields for the classification and clustering of temporal data. While there are several clustering methods for univariate time series and a few for multivariate series, most methods are based on distance and/or dissimilarity measures that do not fully utilize the time-dependency information inherent to time-series data. To highlight the main dynamic structure of a set of multivariate time series, this study extends the use of standard variance–covariance matrices in principal component analysis to cross-autocorrelation matrices at time lags k=1,2,…. This results in “principal component time series”. Simulations and a sign language dataset are used to demonstrate the effectiveness of the proposed method and its benefits in exploring the main structural features of multiple time series.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12060570"
    },
    {
        "id": 409,
        "title": "Moving-Principal-Component-Analysis-Based Structural Damage Detection for Highway Bridges in Operational Environments",
        "authors": "Ye Yuan, Xinqun Zhu, Jun Li",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "With the deterioration of bridge performance and ever-increasing amounts of traffic, bridge safety is becoming a concern for the engineering community. A method that can assess a bridge’s condition in real time is urgently needed. The main factors that hinder bridge condition assessment are the uncertain operational environments. A new moving principal component analysis (MPCA)-based method is developed for structural damage detection in bridges in operational environments in this paper. Two main operational environmental factors, the environmental temperature and traffic loads, are studied in the assessment process to verify the robustness and practicality of the proposed method. The numerical and experimental results show that the proposed method is effective and accurate in assessing the bridge’s condition in operational environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24020383"
    },
    {
        "id": 410,
        "title": "Principal Component Analysis (PCA) in the Body Measurements of Nguni Cows",
        "authors": "Thobela Louis Tyasi, Widya Pintaka Bayu Putra",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17582/journal.pjz/20210605170634"
    },
    {
        "id": 411,
        "title": "Specific Emitter Identification with Principal Component Analysis (PCA) Dimensionality Reduction and Convolutional Neural Network",
        "authors": "Gianmarco Baldini, Fausto Bonavitacola",
        "published": "2023-7-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10215809"
    },
    {
        "id": 412,
        "title": "A Study and Application of Planning Model Based on Principal Component Analysis and Reinforcement Learning",
        "authors": "Yurou Xiong",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257781"
    },
    {
        "id": 413,
        "title": "Kombinasi Linier Target Data Untuk Regresi Multitarget Menggunakan Principal Component Analysis",
        "authors": "Yonathan Purbo Santosa",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "Regresi linier adalah metode untuk memprediksi sebuah nilai (variabel dependen) berdasarkan beberapa input (variabel independen). Permasalahan pada regresi linier adalah beberapa data tidak termasuk ke dalam kategori linier. Sebuah metode bernama RLC diciptakan untuk menemukan korelasi antara data output dengan cara memproyeksikan data ke dalam dimensi yang lebih tinggi. Sayangnya, metode RLC tidak dapat diinvers transformasinya. Selain itu, dengan memproyeksikan data ke dimensi yang lebih tinggi akan menambah kompleksitas dari algoritma pembelajaran. Oleh karena itu, PCA akan digunakan untuk memecahkan masalah ini dengan cara memproyeksikan data ke dimensi yang lebih rendah sembari mempertahankan kemampuan untuk melakukan invers proyeksi. Penelitian ini diimplementasikan dengan bantuan library scikit-learn untuk membuat model regresi dan transformasi data dengan menggunakan bahasa pemrograman Python. Hasilnya, untuk 12 dataset, metode augmentasi PCA mampu mendapatkan nilai error yang lebih rendah dalam 7 dataset dibandingkan dengan RLC dengan rata-rata nilai error 0.3270 untuk metode augmentasi PCA dan 0.4003 untuk metode augmentasi RLC.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54914/jtt.v9i1.516"
    },
    {
        "id": 414,
        "title": "A Study of an Innovative Weighted Independent Principal Component Analysis Algorithm",
        "authors": "Zihao Wang, Jilong Pu, Ruoqian Song",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257786"
    },
    {
        "id": 415,
        "title": "Effect of yoga training on body shape based on principal component analysis approach",
        "authors": "Ziyan Li",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper analyzes the practical strategy and significance of integrating form training in yoga training teaching and constructs an evaluation index system for yoga training teaching based on it. Secondly, a principal component analysis was used to introduce the covariance to calculate the comprehensive score of the indexes. Finally, an empirical analysis was conducted to verify the specific effects of yoga training on body shape. The research revealed that yoga asana teaching and breathing control method introduction were the primary components of yoga training, with factor loadings of 0.845 and 0.623, respectively. Yoga training significantly affected cardiorespiratory function, body fat and circumference, and flexibility, p<0.05. According to the statement, yoga training has the potential to enhance body shape and reduce body fat.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00984"
    },
    {
        "id": 416,
        "title": "Hybridization of Discrete Cosine Transform and Principal Component Analysis to Achieve Digital Watermarking",
        "authors": "Ashish Dixit, R. P Agarwal, B. K Sharma",
        "published": "2023-5-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt57929.2023.10151330"
    },
    {
        "id": 417,
        "title": "Monitoring groundwater quality using principal component analysis",
        "authors": "Manaswinee Patnaik, Chhabirani Tudu, Dilip Kumar Bagal",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12518-024-00552-z"
    },
    {
        "id": 418,
        "title": "Multi-Head Convolutional Neural Network Compression based on High-Order Principal Component Analysis",
        "authors": "Taehyeon Kim, Youjeong Na, Seho Park",
        "published": "2023-2-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic57457.2023.10049909"
    },
    {
        "id": 419,
        "title": "GROWTH ANALYSIS OF CHINESE LIQUOR LISTED COMPANIES BASED ON PRINCIPAL COMPONENT ANALYSIS",
        "authors": "Jun Luo, Xiaoyu Shi, Jingwei Liu",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "Online shopping has been increasingly popular in recent years due to the spread of the Internet, and the livestream sector has increased. Many traditional companies, such as Chinese liquor enterprises, tried to engage in livestreaming to keep pace with their new customers. The overall perceived value’s impact on user behavior has been examined in social commerce research, but the livestream context has received less attention. This study proposed and empirically tested a theoretical model, considering online word-of-mouth, and investigated the effect of consumer perceived value on livestream purchase intention of Chinese liquor. The findings demonstrate that online word-of-mouth serves as a mediator between the three dimensions of perceived value - functional, emotional, and social value - and livestream purchase intentions of Chinese liquor.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22437/jbsmr.v7i1.29350"
    },
    {
        "id": 420,
        "title": "Assessment Students' Performance through Principal Component Analysis and Factor Analysis : A Case Study",
        "authors": "Debasmita Dutta, Rabi Sankar Pandey, Sumanta Ray, Sanat Kumar Mahato",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54280/jse.233203"
    },
    {
        "id": 421,
        "title": "Retracted: Clustering of Brain Tumor Based on Analysis of MRI Images Using Robust Principal Component Analysis (ROBPCA) Algorithm",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9859342"
    },
    {
        "id": 422,
        "title": "Lung Cancer Prediction from Elvira Biomedical Dataset Using Ensemble Classifier with Principal Component Analysis",
        "authors": "Teresa Kwamboka Abuya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jdaip.2023.112010"
    },
    {
        "id": 423,
        "title": "Precision Analysis of Armature Velocity Measurement by Principal Component Analysis Method",
        "authors": "Zhen-Chun Wang, Yu-Ting Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tim.2023.3296122"
    },
    {
        "id": 424,
        "title": "Principal component analysis of yield related component of tropical wheat varieties grown under different irrigation regimes in Bauchi State, Nigeria.",
        "authors": "M.S Waziri, S.D Abdul, B. Apagu",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "Wheat is a globally cereal crop with a lot of utilities and nutritional values. The production of wheat is seriously reduced by water stress. In Nigeria, wheat is produced mostly using irrigation system in the Northern parts of the country, as such there is a need to investigate the optimum irrigation regime of wheat crop and also study the response of the crop to water stress with the goal of determining the main components for yield contributing traits. The study was carried out in Bauchi, Nigeria's savannah zone, during the 2018/2019 and 2019/2020 dry farming seasons. Ten tropical wheat varieties were grown in the field using a split plot design with three replications under three irrigation watering regimes. The analysis of variance revealed significant differences in all the thirteen traits observed among the varieties. There were mean differences (p<0.05) between the varieties. The principal component analysis (PCA) results revealed that the first five principal components (PC) explained over 98% of the total variability. The number of grains per spike, spike length, and thousand grain weight were all positively related to grain yield and had a high PC 1 score, indicating high variation. The highest yielders were KAUZ-9, ATTILA-7 and TEVEE'S, while the lowest was SERI-82. It is recommended that when screening wheat lines in tropical areas, thousand grain weight, number of grains per spike, and spike length should be emphasized, as well as the correlation between the thirteen traits. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4314/dujopas.v9i2a.11"
    },
    {
        "id": 425,
        "title": "Robust factored principal component analysis for matrix-valued outlier accommodation and detection",
        "authors": "Xuan Ma, Jianhua Zhao, Yue Wang, Changchun Shang, Fen Jiang",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csda.2022.107657"
    },
    {
        "id": 426,
        "title": "Principal Component Analysis of azimuthal flow in intermediate-energy heavy-ion reactions",
        "authors": "Bao-An Li, Jake Richter",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nuclphysa.2023.122640"
    },
    {
        "id": 427,
        "title": "Water Variables Analysis Using a Concept of Principal Component Statistics in Etim Ekpo River, Niger Delta Zone, Nigeria",
        "authors": "",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14738/aivp.113.14340"
    },
    {
        "id": 428,
        "title": "Dynamic multiobjective optimization with varying number of objectives assisted by dynamic principal component analysis",
        "authors": "Fei Zou, Gary G. Yen",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2024.120398"
    },
    {
        "id": 429,
        "title": "Alzheimer's disease prediction using machine learning techniques and principal component analysis (PCA)",
        "authors": "M. Sudharsan, G. Thailambal",
        "published": "2023",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2021.03.061"
    },
    {
        "id": 430,
        "title": "Investigation of Neural Network Parameters for MNIST Using QR Decomposition Algorithm and Principal Component Analysis",
        "authors": "Mohsin Ali, Jitendra Choudhary",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486346"
    },
    {
        "id": 431,
        "title": "Comparative patterns of principal component and cluster analysis under sodicity and normal soil conditions in rice (Oryza sativa L.)",
        "authors": "",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1403.101"
    },
    {
        "id": 432,
        "title": "Glass classification study based on principal component analysis and systematic clustering",
        "authors": "Junyang Shao, Zimin Wang, Kangqi Wang",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "Ancient Chinese glass is similar in appearance to Western glass, but the chemical composition and its content are very different. In order to properly explore the classification laws of different categories of glass and further study their subclassification, this paper starts from the sample data and uses systematic clustering and principal component analysis to develop a glass classification study based on the index Euclidean distance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v40i.6569"
    },
    {
        "id": 433,
        "title": "Forgery Detection of Digital Images Using Teaching–Learning Based Optimization and Principal Component Analysis",
        "authors": "S. Uma, P. D. Sathya",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11220-023-00424-7"
    },
    {
        "id": 434,
        "title": "A hybrid approach to optimization of radial inflow turbine with principal component analysis",
        "authors": "Łukasz Witanowski, Paweł Ziółkowski, Piotr Klonowicz, Piotr Lampart",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.127064"
    },
    {
        "id": 435,
        "title": "Principal component analysis of multi-sensor monitoring for LNG leakage",
        "authors": "Yali Cui, Zhiyong Lv, Fangyu Ren",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictis60134.2023.10243918"
    },
    {
        "id": 436,
        "title": "PRINCIPAL COMPONENT ANALYSIS AND OPTIMAL PORTFOLIO",
        "authors": "G. Beliavsky, N. Danilova, K. Yao",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10958-023-06526-7"
    },
    {
        "id": 437,
        "title": "Robust kernel principal component analysis and its application in blockage detection at the turn of conveyor belt",
        "authors": "Xin Sha, Naizhe Diao",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2022.112283"
    },
    {
        "id": 438,
        "title": "Robust Principal Component Analysis Integrating Sparse and Low-Rank Priors",
        "authors": "Wei Zhai, Fanlong Zhang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jcc.2024.124001"
    },
    {
        "id": 439,
        "title": "A novel ensemble wind speed forecasting method using the differential weighting scheme and principal component analysis",
        "authors": "Laleh Parviz",
        "published": "2023",
        "citations": 0,
        "abstract": "Wind speed forecasting has found economic significance as it can increase operational efficiency. In this regard, an accurate forecast of wind speed is crucial in the application of wind resources. This study is intended to incorporate independent and output variables as the input of support vector regression (SVR) to forecast wind speed of Zanjan and Ahvaz stations in Iran. The independent variables were minimum, maximum, and mean temperatures, relative humidity, precipitation, average visibility, and dew point temperature. The incorporation of independent and output variables were conducted with principal component analysis (PCA) and differential weighting scheme (DWS), respectively. DWS combined the forecasts of linear regression, SVR, and group method of data handling (GMDH) in which the SVR showed the best The forecast of DWS outperformed the other three mentioned models. The incorporation of DWS and PCA (DWS-PCA) improved the forecasts and the capability of DWS-PCA as a novel method was significant in terms of forecast stability. The novel method can be a robust approach for wind speed forecasting in some subjects such as renewable energy, and meteorological decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.28974/idojaras.2023.1.4"
    },
    {
        "id": 440,
        "title": "Quality assessment of promising garlic (Allium sativum L.) varieties based on principal component analysis",
        "authors": "Prem Prakash, Kamlesh Prakash",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "Physicochemical properties, pungency, anti-nutritional factors, cutting strength, and colour attributes of seven promising garlic varieties were assessed for their potential application. The garlic varieties were found to be slightly acidic (pH 6.08 - 6.77), and contained varying amounts of crude protein, carbohydrate, crude fat, ash, crude fibre, acidity, and total soluble solids (TSS). The pungency factor as pyruvic acid was found to be in the range of 34.84 - 86.69 μmol/mL, whereas anti-nutritional factors such as saponin (6.63 - 13.98 g), phytic acid (0.03 - 0.6 g), and tannin (0.18 - 0.39 gCE) per 100 g on a fresh weight basis were present. The Bhima purple (BP) variety with a purple tinge showed higher saponin content than the other varieties with a whitish tinge. The cutting strength of garlic cloves varied between 17.20 and 104.61 N. Physical and gravimetric properties were estimated and found to be variety-dependent (p ≤ 0.05). Colour attributes like L* (lightness), a* (redness), b* (yellowness), chroma, hue, and browning index were significantly different (p ≤ 0.05) for all the garlic varieties. The minimum hue value, and maximum a* and b* values, browning index (BI), and chroma were found in the BP variety. Principal component analysis as a significant multivariate analysis tool was applied to assess the existence of correlation among the estimated parameters. It was found to be 75.41% of the total variance when considering the first three principals. Haryana garlic-17 (HG-17) variety showed significant quality as it yielded positive correlation with the maximum number of quality attributes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47836/ifrj.30.6.16"
    },
    {
        "id": 441,
        "title": "The Sailing Boat Price Study Based on Principal Component Regression Analysis",
        "authors": "Yang Chen, Zifeng Li, DaPeng Jia",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "This paper conducts research on the pricing of second-hand sailboats under certain assumptions. Initially, a substantial amount of potentially relevant indicators and data related to sailboat pricing were collected from the internet. The Pearson correlation coefficient was used to investigate the correlation between these indicators and to filter them. Due to the distinctive characteristics of sailboats, they were categorized into monohull sailboats and catamarans for separate analysis. Subsequently, the processed data were used for price prediction using a BP neural network, yielding preliminary results. To obtain an explicit method for calculating sailboat prices, this paper employed principal component analysis to calculate the pricing objective function for both types of sailboats. This led to the derivation of two multivariate linear regression equations, which were subjected to significance testing. The results indicate that the objective functions obtained in this paper can serve as references for pricing second-hand sailboats.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ccpvnq18"
    },
    {
        "id": 442,
        "title": "Evaluating carbon neutrality potential in China based on sparse principal component analysis",
        "authors": "YuKun Liu, Xiyan Li, Xiqiao Lin",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.egyr.2023.04.044"
    },
    {
        "id": 443,
        "title": "An Application of Robust Principal Component Analysis Methods for Anomaly Detection",
        "authors": "Kübra Bağcı Genel, H. Eray Çelik",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "Ensuring a secure network environment is crucial, especially with the increasing number of threats and attacks on digital systems. Implementing effective security measures, such as anomaly detection can help detect any abnormal traffic patterns. Several statistical and machine learning approaches are used to detect network anomalies including robust statistical methods. Robust methods can help identify abnormal traffic patterns and distinguish them from normal traffic accurately. In this study, a robust Principal Component Analysis (PCA) method called ROBPCA which is known for its extensive use in the literature of chemometrics and genetics is utilized for detecting network anomalies and compared with another robust PCA method called PCAGRID. The anomaly detection performances of these methods are evaluated by injecting synthetic traffic volume into a well-known traffic matrix. According to the application results, when the normal subspace is contaminated with large anomalies the ROBPCA method provides much better performance in detecting anomalies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55525/tjst.1293057"
    },
    {
        "id": 444,
        "title": "The Multi-parameter Test of Gravitational Wave Dispersion with Principal Component Analysis",
        "authors": "Zhi-Chu Ma, Rui Niu, Wen Zhao",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "Abstract\nIn this work, we consider a conventional test of gravitational wave (GW) propagation which is based on the phenomenological parameterized dispersion relation to describe potential departures from General Relativity (GR) along the propagation of GWs. But different from tests conventionally performed previously, we vary multiple deformation coefficients simultaneously and employ the principal component analysis (PCA) method to remedy the strong degeneracy among deformation coefficients and obtain informative posteriors. The dominant PCA components can be better measured and constrained, thus are expected to be more sensitive to potential departures from the waveform model. Using this method we analyze 10 selected events and get the result that the combined posteriors of the dominant PCA parameters are consistent with GR within $99.7\\%$ credible intervals. The standard deviation of the first dominant PCA parameter is 3 times smaller than that of the original dispersion parameter of the leading order. However, the multi-parameter test with PCA is more sensitive to not only potential deviations from GR but also systematic errors of waveform models. The difference in results obtained by using different waveform templates hints that the demands of waveform accuracy are higher to perform the multi-parameter test with PCA. Whereas, it can not be strictly proven that the deviation is indeed and only induced by systematic errors. It requires more thorough research in the future to exclude other possible reasons in parameter estimation and data processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1674-4527/ad3c70"
    },
    {
        "id": 445,
        "title": "Analysis of factors influencing ChatGPT user’s willingness to use based on principal component analysis",
        "authors": "Yuhua Li, Yunfei Zhang",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004527"
    },
    {
        "id": 446,
        "title": "Analysis of Stock Value in the Science and Technology Innovation Board Market: A Principal Component Analysis Approach",
        "authors": "Jing Luo",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "The factors influencing stock returns have been extensively studied in the current academic sphere. In this study, the factor analysis method is employed to assess the investment value of stocks in the Science and Technology Innovation Board market (STAR Market) using indicators such as asset-liability ratio, current ratio, quick ratio, gross profit amount, YoY growth rate of net assets, asset return rate A, return on equity ratio ROEA, operating net profit margin, earnings per share of net assets, sales operating profit margin, and YoY growth rate of total assets. Factor scores are derived using principal component analysis. The obtained factor scores are ranked in descending order, revealing that Juchen Corporation holds a factor score of 1.11, ranking first among all companies and demonstrating the highest investment value. Following closely are EastMicro Semiconductor and Baochu Electronics. Additionally, this paper summarizes the stock performance of 20 other companies, offering investors a reference for value-based investment decisions. The quantitative findings of this study facilitate informed decision-making for investors, serving as a valuable reference for their investment strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/55/20231003"
    },
    {
        "id": 447,
        "title": "Analysis of the Parameters of Radio Pulsars with Giant Pulses Using the Principal Component Analysis",
        "authors": "I. F. Malov, O. I. Malov",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1063772923030058"
    },
    {
        "id": 448,
        "title": "Noise Pollution Analysis Using Geographic Information System, Agglomerative Hierarchical Clustering and Principal Component Analysis in Urban Sustainability (Case Study: Tehran)",
        "authors": "Amir Esmael Forouhid, Shahrzad Khosravi, Jafar Mahmoudi",
        "published": "2023-1-22",
        "citations": 1,
        "abstract": "In this study, a new approach has been used with SPSS and MATLAB analysis to study urban road traffic noise distribution mapping, to obtain the representative road traffic noise maps. The observation has been performed at a high traffic highway. The factors influencing noise level (traffic, road width, slope, and residential or administrative–commercial land) use were surveyed and recorded for each point and their local and time dependencies were computed. According to the analysis, the maximum value of goodness of fit index for the traffic and noise level relationship was 0.64, followed by 0.489 for the percentage of residential land use. The result of this study showed that the vehicle speed, width of the road, and the land use can affect different sound levels emitted by moving vehicles on road. The model predicts that by increasing one vehicle per hour, an increase in noise level by 0.002 dB will happen.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15032112"
    },
    {
        "id": 449,
        "title": "Analysis of the influence of environmental design teaching on students’ aesthetic level based on principal component analysis model",
        "authors": "Zhuo Wei, Ningning Xie",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper first analyzes the development trend of environmental design education from two aspects of environmental design’s diversified beginnings and aesthetic foundation and creates a conceptual idea of environmental design teaching system design. The second step is to construct an environmental design teaching index evaluation system, then pre-process the evaluation data and construct the environmental design teaching evaluation model using principal component analysis. Finally, the principal component analysis is conducted by example to evaluate the index weights and the index evaluation. The structure showed that the aesthetic analysis and aesthetic enhancement ratings were 3.56 and 3.33 before environmental design teaching and 8.1 and 8.6 after environmental design teaching. When taken together, environmental design instruction improves students’ aesthetic level.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00992"
    },
    {
        "id": 450,
        "title": "Nonlinear Principal Component Analysis with Mixed Data Formative Indicator Models in Path Analysis",
        "authors": "Rindu Hardianti, Solimun Solimun, Nurjannah Nurjannah, Rosita Hamdan",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "This research aims to obtain the main component score of the latent variable ability to pay, determine the strongest indicators forming the ability to pay on a mixed scale based on predetermined indicators, and model the ability to pay on time as mediated by fear of paying using path analysis. The data used is secondary data obtained through distributing questionnaires with a mixed data scale. The sampling technique used in the research was purposive sampling. The number of samples used in the research was 100 customers. The method used is nonlinear principal component analysis with path analysis modeling. The results of this research show that of the five indicators formed by the Principal Component, 74.8% of diversity or information is able to be stored, while 25.20% of diversity or other information is not stored (wasted). Credit term is the strongest indicator that forms the ability to pay variable. The variable ability to pay mortgage has a significant effect on payments by mediating the fear of being late in paying with a coefficient of determination of 73.63%. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/jtam.v8i1.17559"
    },
    {
        "id": 451,
        "title": "Chemometric study for the performances of deep eutectic solvents during the recovery of high‐added‐value substances from <i>Moringa oleifera</i> leaves: Principal component analysis",
        "authors": "Ebru Kurtulbaş",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "AbstractIntroductionMoringa oleifera is a plant with high antioxidant content in its leaves, flowers and seeds. It attracts the attention of researchers with the effect of its nutritional and medical advantages.ObjectiveThe purpose of the current study is to propose a deep eutectic solvent (DES)‐based ultrasound‐assisted extraction of bioactive substances from M. oleifera leaves by the application of a chemometric study.MethodologyA total of 18 different choline chloride‐based DESs were prepared by using several hydrogen bond donors (glucose, sucrose, glycerol, ethylene glycol, urea and dimethyl urea) with various molar ratios (1:1, 1:2 and 2:1) by addition of diluents (water and 50% methanol) or alone. In order to decide the best DES combination, principal component analysis (PCA) was applied. The response surface method (RSM) was used as statistical experimental design approach through the Box–Behnken design.ResultsThe best phenolic (TPC), flavonoid (TFC) and antioxidant activity yields of M. oleifera leaf extract were found to be 19.102 mg‐GAE, 10.47 mg‐CE and 24.404 mg‐TEAC per gram dried leaf under the optimal conditions (50% water content, 20% amplitude, 15 min time). The model fitting has been also found reliable depending on the statistical indicators such as p‐value (<0.0001), coefficients of determination (R2 = 0.9827, 0.9916 and 0.9864) and root mean square error (RMSE = 1.0562, 2.4656 and 0.7713).ConclusionsA chemometric study through PCA was carried out to determine the similarities and differences between the solvent groups, and the ethylene glycol‐based DES (1:2, molar ratio) with the addition of water showed the best performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/pca.3220"
    },
    {
        "id": 452,
        "title": "Some studies on principal component analysis, factor analysis and cluster analysis on a clubbed data",
        "authors": "Joseph Justin Rebello, Shafna Noushad, Suryamol KS",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22271/allresearch.2023.v9.i2e.10635"
    },
    {
        "id": 453,
        "title": "Generalized spherical principal component analysis",
        "authors": "Sarah Leyder, Jakob Raymaekers, Tim Verdonck",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11222-024-10413-9"
    },
    {
        "id": 454,
        "title": "Feature selection for text data via sparse principal component analysis",
        "authors": "Won Son",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5351/kjas.2023.36.6.501"
    },
    {
        "id": 455,
        "title": "Improved Service Quality Assessment Through the Integration of Principal Component Analysis and Support Vector Machines",
        "authors": "Feng Xiafei, Huang Fuli",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263572"
    },
    {
        "id": 456,
        "title": "Principal Component Analysis–Based Feature Recognition Technology for Marine Plankton Images in IoT Systems",
        "authors": "Jia Luo",
        "published": "2024-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1520/jte20230079"
    },
    {
        "id": 457,
        "title": "PCaLDI: Explainable Similarity and Distance Metrics using Principal Component Analysis Loadings for Feature Importance",
        "authors": "Takafumi Nakanishi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3387547"
    },
    {
        "id": 458,
        "title": "Multi-performance characteristics optimization in near-dry rotary EDM of AlSiC by weighted principal component analysis",
        "authors": "P.M. Gaigole, B. Rajiv",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2023.03.075"
    },
    {
        "id": 459,
        "title": "Understanding Housing Affordability Challenges in African Countries: Insights from Principal Component Analysis",
        "authors": "Abukar Warsame",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15396/afres2023-033"
    },
    {
        "id": 460,
        "title": "Portfolio management using principal component analysis approach",
        "authors": "Liem Chin, Agus Sukmana, Erwinna Chendra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0177736"
    },
    {
        "id": 461,
        "title": "Research of Light Pollution Levels Based on Principal Component Analysis and Topsis",
        "authors": "Zhicheng Guo, Yao Yao, Shihao Zhang",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "With the development of society, a large amount of light has a bad impact on people’s lives. The assessment and governance of light pollution levels also brought difficulties to government management in various regions. An evaluation model of light pollution level under the influence of main factors is constructed based on EWM-TOPSIS scoring method, combined with the advantages of principal component analysis in dealing with complex factors. This paper divides the cities into four areas based on hierarchical cluster analysis according to population density: protected land location, rural community, suburban community and urban community. Each region takes a city as an example group to calculate in our evaluation model, and the light pollution level score is as follows: Greater Khingan Mountains region: 3.7, Panzhihua City: 4.09, Suzhou City: 6.2, New York: 9.97. The results indicate that the areas with high population density have serious light pollution, which is consistent with the actual situation and verifies the rationality of the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v64i.11264"
    },
    {
        "id": 462,
        "title": "Using random forest with principal component analysis to detect SQLIA",
        "authors": "Ammar Hatem Farhan, Rehab Flaih Hasan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0167783"
    },
    {
        "id": 463,
        "title": "Ensemble Principal Component Analysis",
        "authors": "Olga Dorabiala, Aleksandr Y. Aravkin, J. Nathan Kutz",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3350984"
    },
    {
        "id": 464,
        "title": "Compressing recurrent neural network models through principal component analysis",
        "authors": "Haobo Qi, Jingxuan Cao, Shichong Chen, Jing Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4310/22-sii727"
    },
    {
        "id": 465,
        "title": "An Improved Intrusion Detection System Using Machine Learning with Singular Value Decomposition and Principal Component Analysis",
        "authors": "",
        "published": "2023-8-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0831.03"
    },
    {
        "id": 466,
        "title": "A Study on the Development of China’s Financial Leasing Industry Based on Principal Component Analysis and ARIMA Model",
        "authors": "Weiwei Lin, Yanping Shi",
        "published": "2023-6-21",
        "citations": 2,
        "abstract": "The sustainable development of China’s financial leasing industry is a growing concern among scholars. This paper analyzes the development data of China’s financial leasing industry from 2008–2021, using the dimensions of scale, speed, efficiency, structure, and quality. By employing principal component analysis, we construct the development index of China’s financial leasing industry and analyze the reasons for changes in the development level of the industry from the internal structure of the index. The study finds that scale serves as a key factor in the development of China’s financial leasing industry. While the contribution value of the structure factor shows fluctuations, the contribution values of the return and risk factors remain relatively stable. Using the ARIMA (Auto Regressive Integrated Moving Average) prediction model based on the principal component analysis, we establish the prediction model of the financial leasing industry change in the coming years. The study reveals that the financial leasing industry has entered a period of transformation, where the growth rate of its scale has dropped. Furthermore, this paper offers proposals to address the increasingly prominent asset-liability maturity mismatch problem, promote business structure optimization, enhance the contribution value of the structure factor and the income factor, and facilitate sustainable, higher-quality industry development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15139913"
    },
    {
        "id": 467,
        "title": "The Renewable Energy Performances of Black Sea and Balkan Countries: An Application of Grey Principal Component Analysis",
        "authors": "Deniz KOÇAK, Abdulkerim ÇALIŞKAN",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "Renewable energy, accepted as a solution to global energy needs, is an environmentally benign energy source that contributes to the economic development of countries, protects natural resources, and reduces pollution. Dependency on non-renewable energy sources raises serious concerns such as environmental degradation, energy security problems, and supply shortages. This study aims to evaluate the renewable energy performances of 14 Balkan and Black Sea countries with similar historical, cultural, and structural characteristics. For this purpose, the data on countries’ renewable energy indicators in 2020 is used in the grey principal component analysis that integrates grey system theory and principal component analysis. Thanks to the grey principal component analysis, it is possible to measure the countries’ existing state in renewable energy and evaluate the performance of countries comparatively. Results indicate that countries such as Russia and Türkiye, which stem from their potential in renewable energy indicators, or European Union member countries such as Greece and Romania, which are expected to fulfill certain obligations on renewable energy, rank first in the reference year. On the other hand, countries such as Bosnia–Herzegovina and Serbia, which have critical shortcomings in renewable energy applications, are in last place in the performance evaluation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21121/eab.1335788"
    },
    {
        "id": 468,
        "title": "A Consideration of the Recognition Taguchi Method Using High-Dimensional Principal Component Analysis",
        "authors": "Ryo Asano, Masato Ohkubo, Yasushi Nagata",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17929/tqs.8.70"
    },
    {
        "id": 469,
        "title": "Optimized strength modelling of foamed concrete using principal component analysis featurized regressors",
        "authors": "Pengfei Pan, Wenwei Yang, Yi Zhang, Pei-Pei Li",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.istruc.2023.01.068"
    },
    {
        "id": 470,
        "title": "Principal Component Analysis of Promising Advance  Chickpea Lines (Cicer arietinum L.)",
        "authors": "Niyati Jain, Anita Babbar, Shivangi Rahangdale",
        "published": "2023-12",
        "citations": 0,
        "abstract": "An experiment was conducted to evaluate 30 promising chickpea genotypes grown in Randomized Completely Block Design with three replications during rabi 2018-19. Observation were recorded on 15 traits viz., days to flower initiation, days to 50% flowering, days pod initiation, days to maturity, plant height (cm), stem height at first fruiting node (cm), number of primary branches per plant, number of secondary branches per plant, total number of pods per plant, number of effective pods per plant, number of seeds per pod, 100 seed weight (g), biological yield per plant (g), harvest index (%) and seed yield per plant (g) and showed that out of 15, only 6 principal components (PCs) displayed more than 1 Eigen values and demonstrated approximately 86.7% variation in the attributes under investigation. The genotypes from PC1 will be given due importance because it accounted for 28.6 % of total variability. The genotypes viz; JG 63 × JG 4958, ( JG 74 × JG 315 ) – 14, ICC 96029 × ICC 11551, JG 24, JG 11 × JG 14 , ICCV 15119 , ICC 552241 × JG 11, JG 11 × RVSSG-1 highest positive PC values for yield related traits. Thus, these genotypes can be utilized in chickpea improvement program.",
        "keywords": "",
        "link": "http://dx.doi.org/10.60151/envec/fwzp3528"
    },
    {
        "id": 471,
        "title": "Weighted Tensor Robust Principal Component Analysis to Reduce Noise in Wireless Sensor Networks",
        "authors": "Hanh Hong-Phuc Vo, Myungsik Yoo",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictc58733.2023.10392958"
    },
    {
        "id": 472,
        "title": "Railway Track Joints and Fasteners Fault Detection using Principal Component Analysis",
        "authors": "Muhammad Owais, Imtiaz Hussain, Gul Shahzad, Bilal Muhammad Khan",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrai57502.2023.10089579"
    },
    {
        "id": 473,
        "title": "Deep Kernel Principal Component Analysis for multi-level feature learning",
        "authors": "Francesco Tonin, Qinghua Tao, Panagiotis Patrinos, Johan A.K. Suykens",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.045"
    },
    {
        "id": 474,
        "title": "An Online Algorithm for Contrastive Principal Component Analysis",
        "authors": "Siavash Golkar, David Lipshutz, Tiberiu Tesileanu, Dmitri B. Chklovskii",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096380"
    },
    {
        "id": 475,
        "title": "Peningkatan Kualitas Udang Rebon Kering Multirespon Mengintegrasikan Metode Taguchi Gray Relational Analysis dan Principal Component Analysis",
        "authors": "Nabila Rahmawati, M. Hanifuddin Hakim, Ridho Akbar",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "Rebon shrimp is the catch of fishermen around Sukolilo Baru area, Bulak District of Surabaya. Rebon shrimp processing is only sorted and then dried and sold to collectors. However, the drying process has no definite parameters of factors that can affect the quality of dried rebon shrimp. In overcoming this, research was conducted on improving the quality of dried rebon shrimp. The increase certainly raised several quality responses, namely the color and moisture content of rebon shrimp. The resulting multiresponse needed to be converted into a single response. To optimize multiresponse into a single response, the Taguchi method was used in combination with the Gray Relational Analysis (GRA) and Principal Component Analysis (PCA) methods. Factors and levels were the volume of rebon shrimp (A) with levels of 4 Kg, 4.5 Kg, and 5 Kg, drying time (B) with levels of 90 minutes, 120 minutes, and 150 minutes, and drying temperatures (C) with levels of 41-44ºC, 45-49 ºC, and 36-40 ºC. The quality characteristics were nominal that was the best (if the resulting value is close to the target value, the quality is better). The result produced PCA weighting values on PC1 as evidenced by eigen>1 values. The optimal combination is the volume factor of rebon shrimp at the level of 4.5 Kg, the drying time factor of 120 minutes, and the drying temperature factor of 45 – 49 ºC.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52759/inventory.v4i2.129"
    },
    {
        "id": 476,
        "title": "PCSVD: A hybrid feature extraction technique based on principal component analysis and singular value decomposition",
        "authors": "Vineeta Gulati, Neeraj Raheja",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "<p>Feature extraction plays an important role in accurate preprocessing and real-world applications. High-dimensional features in the data have a significant impact on the machine learning classification system. Relevant feature extraction is a fundamental step not only to reduce the dimensionality but also to improve the performance of the classifier. In this paper, the author proposes a hybrid dimensionality reduction technique using principal component analysis (PCA) and singular value decomposition (SVD) in a machine classification system with a support vector classifier (SVC). To evaluate the performance of PCSVD, the results are compared without using feature extraction techniques or with existing methods of independent component analysis (ICA), PCA, linear discriminant analysis (LDA), and SVD. In addition, the efficiency of the PCSVD method is measured on an increased scale of 1.54% accuracy, 2.70% sensitivity, 3.71% specificity, and 3.58% precision. In addition, reduce the 15% dimensionality and 40.60% RMSE, which are better than existing techniques found in the literature.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v6i2.586"
    },
    {
        "id": 477,
        "title": "The Impact of Climate Information Disclosure on Audit Fees: A Study Based on Principal Component Analysis",
        "authors": "Chenlu Liao",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "To investigate the influence of corporate climate information disclosure on audit fees, this study examines the period from 2012 to 2021, focusing on companies listed on the Shanghai and Shenzhen stock exchanges. The research is based on the quasi-natural experiment of the ESG rating disclosure event by SynTao Green Finance in 2015. Firstly, using principal component analysis and a multi-period difference-in-differences model, the study determines the impact of climate information disclosure on audit fees. Robustness tests are conducted using trimming procedures and placebo experiments, which confirm the initial findings. Secondly, building on the previous analysis, the study explores the interaction effects of analyst forecast deviation and the presence of the Big Four audit firms on the relationship between ESG ratings and audit fees. Finally, the research concludes that the disclosure of climate risk information reduces audit fees by mitigating information risk and operational risk for companies. Moreover, this negative impact of climate risk disclosure on audit fees is more pronounced when analyst forecasts are more accurate or when the auditing firm belongs to the \"Big Four\" group.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hbem.v17i.11354"
    },
    {
        "id": 478,
        "title": "L1-Norm Principal Component Analysis Using Quaternion Rotations",
        "authors": "Adam Borowicz",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15439/2023f3368"
    },
    {
        "id": 479,
        "title": "Multichannel EEG Pattern Acknowledgment Feature Assortment Using T-Test Ranking and Principal Component Analysis",
        "authors": "Nittin Sharma",
        "published": "2023-3-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ihcsp56702.2023.10127161"
    },
    {
        "id": 480,
        "title": "Research on the Impact of AI on University Student Learning based on Principal Component Analysis and Factor Analysis Methods",
        "authors": "Yuqi Wang, Dandan Zhou",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "Artificial intelligence (AI) was introduced in 1956 by scientists from McCarthy and Minsky held at Dartmouth College in the United States. Its rapid development has a different depth of impact on all social strata, but also has a great impact on the education industry, especially for the future college students of the motherland. This paper uses the formal statistical data of the questionnaire to analyze and establish the mathematical model to understand the influence of artificial intelligence on college students in different aspects. First, the raw data is visualized and numericized. Secondly, the analysis results of the data are taken as the evaluation index and comprehensively considered from many aspects such as priority, scientificity and operability. We used principal component analysis and factor analysis to measure each index reasonably. Finally, a comprehensive evaluation method is used to evaluate the influence of AI on college students' learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jeer.v4i3.11382"
    },
    {
        "id": 481,
        "title": "Policy Analysis of Low-Carbon Energy Transition in Senegal Using a Multi-Criteria Decision Approach Based on Principal Component Analysis",
        "authors": "Herve Tevenim Mewenemesse, Qiang Yan, Prince Foli Acouetey",
        "published": "2023-2-28",
        "citations": 1,
        "abstract": "Senegal has been investing in the development of its energy sector for decades. By using a novel multi-criteria decision analysis (MCDA) based on the principal component analysis (PCA) method, this paper develops an approach to determine the effectiveness of Senegal’s policies in supporting low-carbon development. This was determined using six criteria (C1 to C6) and 17 policies selected from the review of Senegal’s energy system. In order to determine the optimal weighting of the six criteria, a PCA is performed. In our approach, the best weighted factor is the normalized version of the best linear combination of the initial criteria with the maximum summarized information. Proper weighted factors are determined through the percentage of the information provided by the six criteria kept by the principal components. The percentage of information is statistically a fit of goodness of a principal component. The higher it is, the more statistically important the corresponding principal component is. Among the six principal components obtained, the first principal component (comp1) best summarizes the values of criteria C1 to C6 for each policy. It contains 81.15% of the information on energy policies presented by the six criteria and was used to rank the policies. Future research should take into account that when the number of criteria is high, the share of information explained by the first principal component could be lower (less than 50% of the total variance). In this case, the use of a single principal component would be detrimental to the analysis. For such cases, we recommend a higher dimensional visualization (using two or three components), or a new PCA should be performed on the principal components. This approach presented in our study can serve as an important benchmark for energy projects and policy evaluation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15054299"
    },
    {
        "id": 482,
        "title": "Variable Selection Using Data Splitting and Projection for Principal Fitted Component Models in High Dimension",
        "authors": "Seungchul Baek, Park Hoyoung, Junyong Park",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csda.2024.107960"
    },
    {
        "id": 483,
        "title": "Principal Component Analysis and Cluster Analysis for Fatty Acid Assessment of Backfat in Three Pig Breeds",
        "authors": "Irina Chernukha, Marina Nikitina, Elena Kotenkova, Liliya Fedulova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18485/meattech.2023.64.2.60"
    },
    {
        "id": 484,
        "title": "NONLINEAR PRINCIPAL COMPONENT ANALYSIS IN PATH ANALYSIS WITH LATENT VARIABLES MIXED DATA",
        "authors": "Rindu Hardianti, Solimun Solimun, Nurjannah Nurjannah",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "This study aims to obtain the main component score of the ability to pay latent variable, determine the strongest indicators forming the ability to pay on a mixed scale based on defined indicators, and model the ability to pay on time mediated by fear of paying using path analysis. The data used in this study is secondary data from mortgage-paying customers with a sample size of 100. The method used is nonlinear principal component analysis with path analysis modeling. The results of this study indicate that the eleven variables formed by PC1 or X1 are able to store diversity or information by 32.50%, while 67.50% of diversity or other information is not stored (wasted). The credit term is the strongest indicator that forms the ability to pay variable. The variable ability to pay mortgages has a significant effect on payments by mediating the fear of paying late with a coefficient of determination of 80.40%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol18iss1pp0373-0382"
    },
    {
        "id": 485,
        "title": "An evaluation of the Gilbert-McKern pubic symphyseal age estimation method using Bayesian statistics and principal component analysis: A computed tomographic exploration in an Indian population",
        "authors": "Varsha Warrier, Rutwik Shedge, Pawan Kumar Garg, Shilpi Gupta Dixit, Kewal Krishan, Tanuj Kanchan",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1127/anthranz/2023/1702"
    },
    {
        "id": 486,
        "title": "Differentiating Between Three Licorice Species Using SFC-TOF/MS Analysis With Principal Component Analysis",
        "authors": "Hideki Saito, Shozo Miyoshi, Toshiyuki Murakami, Ryuichiro Suzuki",
        "published": "2023-10",
        "citations": 0,
        "abstract": "Objective Although the discrimination of crude drugs by metabolomics analysis using liquid chromatography–mass spectrometry (LC–MS) has been widely reported, there are few reports on natural products analysis using supercritical fluid chromatography (SFC)–MS. This study aimed to compare the results of metabolomic analysis of licorice obtained using SFC–MS and LC–MS. Methods We analyzed 14 CHCl3 extracts of licorice roots ( Glycyrrhiza glabra, G. uralensis, and G. inflata) using SFC-time-of-flight (TOF)/MS and LC-TOF/MS in conjunction with principal component analysis (PCA). The three species were assessed for discrimination based on the PCA results. The characteristic constituents of each variety were purified, and their chemical structures were elucidated using various spectroscopic analyses. Results The PCA score plots of the results of both SFC and LC classified the licorice samples into three groups. Seven compounds (six known compounds and one new phenolic compound, glyglabone) were isolated from G. glabra, five known compounds were isolated from G. uralensis, and four known compounds were isolated from G. inflata. Conclusions The 16 isolated compounds may be characteristic compounds in the three licorice species. The SFC and LC methods showed comparable results in distinguishing the three species. SFC was highly effective for directly analyzing CHCl3 extracts, reducing analysis time and organic solvent consumption by over 50% compared to the LC analysis. Thus, SFC-TOF/MS in combination with PCA can be used to differentiate between G. glabra, G. uralensis, and G. inflata. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/1934578x231205727"
    },
    {
        "id": 487,
        "title": "A novel hybrid multi-criteria optimization of 3D printing process using grey relational analysis (GRA) coupled with principal component analysis (PCA)",
        "authors": "Rajeev Ranjan, Abhijit Saha",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nFused deposition modeling (FDM) is renowned as a prominent approach in the realm of 3D printing, where objects are built layer by layer using a heated nozzle to extrude melted materials. This research was conducted to identify the most effective FDM process variables to enhance tensile strength while simultaneously reducing surface roughness. Polylactic Acid (PLA) was chosen to fabricate test samples, showcasing the applications of 3D printing. In the course of this research, we conducted a series of 27 experiments to investigate the fundamental relationship between the parameters and the corresponding responses. The central aim of this study lies in optimizing the input variables viz. printing speed, layer thickness, and carbon deposition (C-deposition) for the technological manufacturing process of embossing parts in the context of Industry 4.0. To enhance both tensile strength and surface roughness simultaneously, a new hybrid method has been suggested. This approach integrates grey relational analysis (GRA) with principal component analysis (PCA) to determine the optimal combination of process parameters in the 3D printing process. Notably, the experiment trial exhibited the highest grey relational grade (GRG), indicating optimal process parameter settings at a printing speed of 100 mm s−1, layer thickness of 0.1 mm, and C-deposition of 15 mg respectively. Additionally, mathematical models are created through response surface methodology to explore the impact of FDM parameters on the grey relational grade. The findings from this study can be utilized in various industries and applications where FDM 3D printing is employed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2631-8695/ad2320"
    },
    {
        "id": 488,
        "title": "Analysis of the composition of ancient glassware based on grey correlation and principal component analysis",
        "authors": "Dongchen Shang, Zhiying Chen, Jing Zhang, Yuening Zhang, Xiaonan Shen",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "Power load forecasting is very important for power dispatching. Accurate load forecasting is of great significance for saving energy, reducing generating cost and improving social and economic benefits. In order to accurately predict the power load, based on BP neural network theory, combined with the advantages of Clementine in dealing with big data and preventing overfitting, a neural network prediction model for large data is constructed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v33i.5310"
    },
    {
        "id": 489,
        "title": "Multivariate Statistical Analysis of Coal in Dahor Formation, Borneo Island, Indonesia: A Comparative Study Utilizing Principal Component Analysis (PCA)",
        "authors": "Ratih Hardini Kusuma Putri",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "This study focuses on the multivariate statistical analysis of coal samples from the Dahor Formation in Borneo Island, Indonesia, utilizing Principal Component Analysis (PCA). The objective is to discern the differences in coal samples based on their geological history and chemical properties. The Indonesian coal industry heavily relies on domestic consumption, with plans to increase coal usage for domestic purposes. Coal classification systems play a vital role in evaluating coal quality and determining its economic value. The geological background of the study area in Borneo Island is discussed, emphasizing relevant formations and sedimentation processes. The application of PCA in multivariate statistical analysis is explained, along with the generation of a correlation matrix to explore relationships between variables. The results reveal the presence of four distinct quadrants in the processed coal data, indicating the influence of volatile matter, total moisture, ash content, and fixed carbon. Further analysis demonstrates relatively insignificant differences in the proximate analysis parameters, except for ash content, which indicates the presence of impurity minerals. The concentration of volatile matter, ash, and moisture impacts the fixed carbon content, while volatile matter influences the combustion process. These findings provide valuable insights into coal quality and utilization. The utilization of PCA and multivariate analysis enhances understanding of coal characteristics and facilitates decision-making in coal-related industries. The study concludes with a call for further investigations and analyses to enhance our understanding of coal deposits, improve resource estimation, and develop more sustainable and efficient coal-based processes. Continued research in this field will contribute to advancements in coal science and the development of strategies for responsible coal utilization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31284/j.jemt.2023.v3i2.4504"
    },
    {
        "id": 490,
        "title": "Comparative Performance Analysis of Machine Learning Classifiers on COVID-19 Datasets: Exploring the Effect of Data Imputation, Cross-Validation, and Principal Component Analysis",
        "authors": "Tatenda Duncan Kavu, Olawande Daramola",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ddp60485.2023.00026"
    },
    {
        "id": 491,
        "title": "Estimating the Permeability Field Using the Bayesian Inference and Principal Component Analysis",
        "authors": "Zhen Zhang, Xupeng He, Yiteng Li, Marwa Alsinan, Hyung Kwak, Hussein Hoteit",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Abstract\nSurrogate modeling is essential in reducing computational costs for history-matching applications. Yet, traditional deep learning-based surrogate models cannot cope with high dimensional input parameters, such as the permeability field. This work introduces a robust method to automate the history matching process utilizing the Bayesian inversion assisted by a hybrid convolutional neural network and long short-term memory (CNN-LSTM) model and principal component analysis (PCA) method. The method includes five main steps. Step 1: Generate a high-spatial permeability field using a geostatistical approach. Step 2: use the PCA to reduce the dimensionality of the permeability fields, followed by using PCA to generate permeability fields and perform simulations. Step 3: construct the CNNLSTM to map the nonlinear relationship between the extracted features from PCA and the sequential outputs, such as the pressure response. Here, Bayesian optimization is employed to automate hyperparameter tuning. Step 4: perform the Bayesian inversion to inverse the high dimensional inputs, e.g., permeability field, in which the CNN-LSTM serves as the forward model to reduce the computational cost. The inversed PCA features are then fed into the PCA to recover the high dimensional inputs. Step 5: check convergence and if the errors are significant between the inversed high dimensional permeability field and the ground truth, revisit the construction of the CNN-BiLSTM and the prior information for the uncertainty parameters. A 2D reservoir model demonstrates the proposed history-matching method. We can inverse the high dimensional inputs (e.g., permeability field) with minor errors between the prediction and ground truth. We propose a Bayesian inversion assisted by a hybrid CNN-LSTM model and PCA method for high-dimensional parameter inversion, which is superior to the traditional models regarding accuracy and efficiency. This method enables us to perform history matching for reservoir simulation with high dimensional inputs and significant uncertainties.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/214922-ms"
    },
    {
        "id": 492,
        "title": "Efficient Robust Principal Component Analysis via Block Krylov Iteration and CUR Decomposition",
        "authors": "Shun Fang, Zhengqin Xu, Shiqian Wu, Shoulie Xie",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00136"
    },
    {
        "id": 493,
        "title": "Principal Component Analysis and Deep Learning-Based Traffic Anomaly Detection in WSN",
        "authors": "Vandana Shakya, Jaytrilok Choudhary, Dhirendra Pratap Singh",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs61402.2024.10481982"
    },
    {
        "id": 494,
        "title": "Age and Visual Contribution Effects on Postural Control Assessed by Principal Component Analysis of Kinematic Marker Data",
        "authors": "Arunee Promsri",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Postural control, the ability to control the body’s position in space, is considered a critical aspect of health outcomes. This current study aimed to investigate the effects of age and visual contribution on postural control. To this end, principal component analysis (PCA) was applied to extract movement components/synergies (i.e., principal movements, PMs) from kinematic marker data of bipedal balancing on stable and unstable surfaces with eyes closed and open, pooled from 17 older adults (67.8 ± 6.6 years) and 17 young adults (26.6 ± 3.3 years), one PCA-analysis for each surface condition. Then, three PCA-based variables were computed for each PM: the relative explained variance of PM-position (PP_rVAR) and of PM-acceleration (PA_rVAR) for measuring the composition of postural movements and of postural accelerations, respectively, and the root mean square of PM-acceleration (PA_RMS) for measuring the magnitude of neuromuscular control. The results show the age and visual contribution effects observed in PM1, resembling the anteroposterior ankle sway in both surface conditions. Specifically, only the greater PA1_rVAR and PA1_RMS are observed in older adults (p ≤ 0.004) and in closed-eye conditions (p < 0.001), reflecting their greater need for neuromuscular control of PM1 than in young adults and in open-eye conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sports11050098"
    },
    {
        "id": 495,
        "title": "Using Principal Component Analysis (PCA) Method to Optimize a Depleted Underground Gas Storage: A Case Study",
        "authors": "M. Arabi, M. Asareh, E. Toloei",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202320015"
    },
    {
        "id": 496,
        "title": "PRINCIPAL COMPONENT ANALYSIS AND CLASSIFICATION OF SUGARCANE PRODUCTION DATA IN BURUNDI",
        "authors": "BARANKANIRA Emmanuel,  NDIKUMANA, NITUNGA Benjamin",
        "published": "2023",
        "citations": 1,
        "abstract": "This study aims at identifying groupings of individuals (years) from sugarcane production data in Burundi by applying Principal Component Analysis (PCA) and classification, and computing clusters’ distances between centroids. These data were obtained from the Ministry of Environment, Agriculture and Livestock in Burundi and cover a period from 2000 to 2019, i.e. 20 years. The variables used are mean sugarcane yield, sugar production, cultivated area, sugarcane production, molasses production, herbicide inputs, mean temperature and cost of sugar production. R software version 3.6.1 was used to analyze data. This study shows that the years 2002 and 2013 are opposed by the first factorial axis while the years 2001 and 2017 are opposed by the second one. The years 2000, 2002, 2008, 2012, 2013 and 2017 are better represented on the principal factorial plane. The years 2017 and 2019 are characterized by high values of herbicide inputs and cultivated area while the years 2011, 2012 and 2013 are characterized by high values of mean temperature and mean sugarcane yield. The year 2015 is characterized by high values of sugar production, sugarcane production, cost of sugar production and molasses production.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35410/ijaeb.2023.5796"
    },
    {
        "id": 497,
        "title": "Low Rank Matrix Differential Equations as Deep Kernel Principal Component Analysis",
        "authors": "Shimin Shan, Yanbo Wang, Wenyu Chen, Fangshu Cui",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450169"
    },
    {
        "id": 498,
        "title": "SuSiE PCA: A scalable Bayesian variable selection technique for principal component analysis",
        "authors": "Dong Yuan, Nicholas Mancuso",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.isci.2023.108181"
    },
    {
        "id": 499,
        "title": "PEMODELAN SEKTOR UNGGULAN PROVINSI  KALIMANTAN BARAT DENGAN MENGGUNAKAN  PRINCIPAL COMPONENT ANALYSIS",
        "authors": "Neva Satyahadewi, Siti Aprizkiyandari, Nur Ismi Radinasari",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nWest Kalimantan is the province with the fourth largest area in Indonesia, namely 147,307 square km. West Kalimantan has 12 districts and 2 cities, one of which is Ketapang Regency which covers an area of ​​31,240.74 km2. The research is limited to three leading sectors which have the largest average contribution to GRDP in West Kalimantan Province, namely the agriculture, forestry and fisheries sectors; industrial processing; as well as wholesale and retail trade, and car and motorcycle repair. The focus of this research is aimed at modeling the leading sector for the West Kalimantan economy. The results of the modeling showed multicollinearity so it was continued with the Principal Component Analysis. The results of the analysis with the model   show that there is no element of multicollinearity between the dependent variables.\r\n\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.36526/tr.v7i2.2760"
    },
    {
        "id": 500,
        "title": "Analisis Principal Component Analysis (PCA) dalam Penentuan Faktor Kepuasan Pengunjung terhadap Layanan Perpustakaan Digilib",
        "authors": "Sudianto Manullang, Dita Aryani, Hanifah Rusydah",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Maximum management of the library, especially improving services to users is a must that needs to be evaluated by the library manager. Visitor satisfaction is difficult to measure because it relates to the high and low expectations of visitors to the service they want. The purpose of this study is to investigate the most important factors or components in aspects of visitor satisfaction. So that it can increase satisfaction appropriately so that the library can carry out the right strategy to maintain and provide the best quality service. The subjects of this study were students with 2019 – 2022 status. 120 samples were taken using a random sampling technique. The collected data will be analyzed using the Principal Component Analysis (PCA) method. The PCA analysis process was carried out in several stages, namely the Bartlett's test, testing the KMO value, testing the correlation matrix, PCA analysis, and interpreting the PCA results. Findings from PCA analysis by reducing 12 correlated variables into 2 factors, namely reference services and facilities and infrastructure. The results of this study indicate that the facilities and infrastructure factor have a greater cumulative percentage of variance compared to the reference service factor, which is equal to 51,387%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29408/edumatic.v7i1.14839"
    },
    {
        "id": 501,
        "title": "Research on the Evaluation Model of Multimedia Teaching Courseware Based on Principal Component Analysis Method",
        "authors": "Si Ying, Wang Haoyu, Huang Qiong",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csrswtc60855.2023.10427309"
    },
    {
        "id": 502,
        "title": "Optimization of innovative information-based teaching paths in college sports psychology based on principal component analysis",
        "authors": "Guohua Shao",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nPhysical education needs to focus on improving students’ physical fitness and quality and psychological training for students. Therefore, this paper proposes a strategy to combine sports psychology with realistic teaching to optimize innovative teaching paths in line with students’ development to develop students’ comprehensive quality level in college sports psychology teaching. The indicators in the teaching evaluation are classified and summarized to complete a multi-indicator evaluation to improve the quality of teaching. The theory of sports psychology is adjusted and improved, and the teaching guideline is changed to apply PCA (principal component analysis algorithm) of multivariate statistical analysis to teaching evaluation. The raw data of students’ evaluation were processed by calculation and analysis to determine the main factors affecting teaching quality and analyzed with experiments. The results show that 78.1% of college students think that physical exercise can enhance self-confidence and 77.4% think physical exercise can promote healthy growth. It can be seen that combining the content of sports psychology with practical training effectively improves students’ sports psychological quality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.1.00383"
    },
    {
        "id": 503,
        "title": "Unveiling the Dutch Disease Indexes: Principal Component Analysis in a Small Oil-rich Country",
        "authors": "Ibrahim Niftiyev",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "The Dutch disease (DD) theory is a popular approach when analyzing the economies of resource-rich countries. However, despite the extensive examination of both the original DD theory and its variations in numerous country cases, the findings remain contradictory and inconclusive, primarily due to the challenges associated with measuring DD. Building upon the notable case study of the Azerbaijani economy, this paper introduces a novel way to utilise principal component analysis (PCA) in index development, which incorporates the modelling framework of the original theory and provides a profound understanding of DD measurement. The findings of the study reveal that the fundamental variables associated with DD in the Azerbaijani economy can be effectively condensed into a small number of principal components (PCs). In addition, this research introduces not only a total Dutch disease index (TDDI), but also a resource movement index (RMI) and a spending index (SI), with the last of these demonstrating a more pronounced impact in Azerbaijan. The estimated indexes exhibit a significant and negative correlation with the manufacturing sector’s share in the industry, pointing to the presence of the crowding-out mechanism of DD. Moreover, a strong positive correlation is observed with key growth indicators such as gross domestic product (GDP) and gross capital formation, underscoring the exceptional role of the oil boom in the Azerbaijani economy. These findings justify the contention that DD is present in the Azerbaijani economy. The paper also provides a composite index that can be utilised by both policymakers and scholars for measuring DD.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3311/ppso.22914"
    },
    {
        "id": 504,
        "title": "Study on the Comprehensive Evaluation of Population Quality in Anhui Province Based on the Principal Component Analysis Model",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/fsst.2023.051119"
    }
]