[
    {
        "id": 9705,
        "title": "Research on Mining Association Rules for Classroom Concentration Based on Apriori Algorithm",
        "authors": "Jingqiu Bai, Huafeng Kong, Wenhan Hu",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291779"
    },
    {
        "id": 9706,
        "title": "Research on Mining Association Rules for Landslide Monitoring Data Based on Apriori Algorithm",
        "authors": "梅洁 吕",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/csa.2023.1311210"
    },
    {
        "id": 9707,
        "title": "An Improved Apriori Algorithm for Association Rule Mining in Employability Analysis",
        "authors": "",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17559/tv-20230327000481"
    },
    {
        "id": 9708,
        "title": "Association Rule Mining in Retail: Exploring Market Basket Analysis with Apriori Algorithm",
        "authors": "Aakanksha Jadhav, Aditya Jadhav, Dr Ramesh D Jadhav",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4461121"
    },
    {
        "id": 9709,
        "title": "Product Bundling Strategy for Office Supplies Retailer through Association Rules Mining: Comparative Study of Apriori and ECLAT Algorithms",
        "authors": "Raymond Oetama",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Our study aims to develop an effective bundled product promotion strategy for the office supply store to boost sales. The primary challenge is comprehending which product combinations align with customer preferences and cater to their needs. We leverage the Apriori and ECLAT algorithms for consistent rule generation, revealing robust associations between product purchases. Notably, a strong positive correlation rule emerges at a confidence level of 0.8, while at 0.9, no results are found. The identical rules derived from both algorithms signify their reliability. The shop owner employs two rules for bundled products based on a minimum Lift Ratio of 1.96. The first bundle focuses on 70gsm natural paper in Folio and Quarto sizes, capitalizing on their popularity, even though customers may prefer one size. The second bundle emphasizes notebooks, often bought together but in smaller quantities than paper products, reflecting diverse customer needs and behaviors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i6.3516"
    },
    {
        "id": 9710,
        "title": "Hybridization of Apriori Algorithm and Genetic Algorithm for Association Rule Mining in Generative AI Enabled Machine Learning",
        "authors": "Nida Afreen Rizvi, Pratik Buchke",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs61402.2024.10481845"
    },
    {
        "id": 9711,
        "title": "Shopping Cart Analysis Using Apriori Algorithm and Association Rules",
        "authors": "K B Prajna, K Abhishek, Ashwin A Shanbhag, B V Shashank, P Ekshith",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc58445.2023.10200434"
    },
    {
        "id": 9712,
        "title": "Analisis Data Mining Sistem Inventory Menggunakan Algoritma Apriori",
        "authors": " Fitriah,  Imam Riadi,  Herman",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "Dalam manajemen rantai persedian barang (supply chain management) diperlukan kebijakan persediaan barang yang maksimal agar ketersedian barang tetap tersedia dan tidak terlambat dalam restock barang. Hal ini dibutuhkan manajemen persedian barang untuk menentukan cara yang tepat dan mempermudah dalam pengendalian persedian barang tersebut. Salah satu cara yang dilakukan adalah dengan menerapkan teknik yang terdapat pada cabang ilmu Data Mining yaitu teknik aturan asosiasi (Association Rule). Tujuan penelitian ini adalah menganalisis informasi transaksi penjualan barang untuk menghasilkan association rules dari pola kombinasi itemsets yang sesuai agar membantu pemilik dalam melakukan peletakan dan persedian barang. Langkah terpenting aturan asosiasi adalah mengetahui seberapa sering kombinasi item yang disebut frequent pattern, muncul dalam database. Objek penelitian ini adalah data transaksi penjualan barang pakaian. Berdasarkan hasil pengujian menggunakan Ms. Excel dan RapidMiner diperoleh hasil dari association rules dengan minimum support 0,2% dan confidence sesuai dengan kriteria pengujian yang telah ditentukan bahwa hasil yang memenuhi nilai support minimum dan confidence 0,8% ditemukan 7 aturan asosiasi. Dari pengurutan nilai support tertinggi yaitu STX dan LK dengan nilai support 10% dengan nilai confidence 88% dan nilai Association rules Final 8,8%. Hal ini menunjukkan bahwa produk STX dan LK merupakan produk yang paling sering dibeli secara bersamaan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51454/decode.v3i1.132"
    },
    {
        "id": 9713,
        "title": "Apriori Algorithm and Hybrid Apriori Algorithm in the Data Mining: A Comprehensive Review",
        "authors": "Yahya Zakur, Laith Flaih",
        "published": "2023",
        "citations": 0,
        "abstract": "Data mining has the potential to empower healthcare organizations by allowing them to analyze various aspects of patient information and discover connections between seemingly unrelated data. By harnessing advanced data analysis techniques, healthcare providers can identify trends in patients' medical conditions and behaviours. The Apriori algorithm is used for mining frequent item sets and devising association rules from a transactional database. The parameters “support” and “confidence” are used. Support refers to items’ frequency of occurrence; confidence is a conditional probability, while Apriori-Hybrid. Apriori-Hybrid is the combination of algorithms Apriori and Apriori-TID, which can classify large itemsets and can improve the accuracy of classification and it can also shed light on the basic mechanism. In this research, a comparison was made between the two algorithms in terms of capabilities, strengths, areas of use, and suggestions about the nature of using each algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202344802021"
    },
    {
        "id": 9714,
        "title": "Apriori Algorithm based Association Rule Mining to Enhance Small-Scale Retailer Sales",
        "authors": "Vazeerudeen Abdul Hameed, Muhammad Ehsan Rana, Lim Hui Enn",
        "published": "2023-7-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bdai59165.2023.10256952"
    },
    {
        "id": 9715,
        "title": "IMPLEMENTASI ASSOCIATION RULES MINING UNTUK ANALISIS POLA PEMBELIAN PAKET KUOTA PERDANA PELANGGAN XL MENGGUNAKAN ALGORTIMA APRIORI",
        "authors": "Intan Pratiwi, Nana Suarna, Tati Suprapti",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Kartu perdana mulai ramai digunakan oleh pelanggan ponsel di seluruh dunia sebagai akses koniktivitas pada internet. Kartu perdana adalah paket penyedia layanan seluler yang mencakup akses paket data prabayar ke internet, panggilan, pesan teks, dan layanan komunikasi lainnya. Permasalahan yang terjadi di PT. XL Axiata Tegal adalah perusahaan belum menemukan pola pembelian paket kuota perdana pelanggan XL yang teridentifikasi, padahal peluang tersebut dapat mengoptimalkan strategi pemasaran dan menawarkan layanan yang lebih disesuaikan dengan preferensi pelanggan. Metode yang digunakan dalam analisis Association Rules Mining adalah pengimplementasian atau penerapan algoritma apriori pada dataset berupa data histori transaksi yang diperoleh dari PT. XL Axiata Tegal pada periode bulan Oktober 2023 dengan jumlah data sebanyak 22.121 transaksi. Tujuan penelitian ini adalah untuk menganalisis data transaksi pembelian paket kuota perdana, sehingga perusahaan dapat mengidentifikasi pola pembelian pelanggan XL yang dapat dijadikan sumber informasi untuk perusahaan dalam memperkirakan jumlah produksi dan persedian stok paket kuota perdana. Hasil penelitian ini  ditemukan aturan asosiasi tertinggi  item yang paling kuat dengan nilai confidence tertinggi adalah yang pertama jika pelanggan membeli PV Hotrod Special M (4GB) maka akan membeli juga paket kuota perdana PV Hotrod Special S (2.5 GB) secara bersamaan dengan nilai pendukung 39% dan confidence sebesar 93% dan aturan asosiasi terendah adalah Jika pelanggan PV Hotrod Special S (2.5 GB) maka akan membeli juga PV FLEX M 9GB secara bersamaan dengan nilai support 36% dan nilai confidence 60%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v8i1.8339"
    },
    {
        "id": 9716,
        "title": "Application Analysis of Nursing Students' Grades in Course Relevance Based on Association Rule Mining Algorithm Apriori",
        "authors": "Xuemei Li, Edward C. Jimenez",
        "published": "2024-2-25",
        "citations": 0,
        "abstract": "By analyzing the correlation between courses in students’ grades, we can provide a decision-making basis forthe revision of courses and syllabi, rationally optimize courses, and further improve teaching effects. With the help of IBM SPSS Modeler data mining software, this paper uses Apriori algorithm for association rule mining to conduct an in-depth analysis of the grades of nursing students in Shandong College of Traditional Chinese Medicine, and to explore the correlation between professional basic courses and professional core courses. Lastly, according to the detailed analysis of the mining results, valuable curriculum information will be found from the actual teaching data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26689/jcer.v8i2.6140"
    },
    {
        "id": 9717,
        "title": "Research on Weighted Association Rules Mining Algorithm for Big Data",
        "authors": "Wenhua Yang",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10441983"
    },
    {
        "id": 9718,
        "title": "Modified Meerkat Clan Algorithm for Association Rules Mining",
        "authors": "Mohamad Ab. Saleh, Ahmed T. Sadiq Sadiq",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Association Rules Mining (ARM) forms one of the important data mining techniques. The classical methods that were previously worked on by researchers have become ineffective to deal with the steady growth of databases, which prompted us to use the mining process for association rules based on metahuristic, and in our work all the correct rules will extracted, and mining is not limited to high-quality rules. Swarm intelligence based is one of these methods. In this paper, Modified Meerkat Clan for Association Rules Mining (MCC-ARM) has been proposed. Basically, the proposed algorithm depends on Meerkat Clan Algorithm (MCA). The greatest benefit is the diversity of candidate solutions in MCA. In our work the rules will represented using two methods which are borrowed from the genetic algorithm; in the first one each group of rules refers to object in society which is called Pittsburgh; while the second one each rule refers to an object in society which is called Michigan. The proposed algorithm aims to inspect for the maximum possible number of correct association rules. The so-called algorithm follows the approach of defining the effective search area, which depends on a main random mechanism to lead the algorithm in extracting alternative rules and avoiding total solutions from being guided by the same rule, and this led to a great deal of diversity. In addition, the MCC-ARM uses condensation method in the adjacency search process to prevent the algorithm from falling into the local mode. In order to prove their efficiency, it should be applied on four reliable datasets (i.e. Zoo, German Credit, Primary Tumor and Chess). The enhancement brought about by the proposed algorithm has obtained two crucial factors, namely on the number of correct rules and quality fitness value.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21123/bsj.2023.8018"
    },
    {
        "id": 9719,
        "title": "University Teaching Evaluation Based on APriori Algorithm and Data Mining",
        "authors": "Yang Yang",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276265"
    },
    {
        "id": 9720,
        "title": "Research on association rule mining of specialty industries based on apriori algorithm",
        "authors": "Peiguang Chen, Yong Wang, Ziheng Wang, Yiwen Jiang, Jizhe Dong",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3018235"
    },
    {
        "id": 9721,
        "title": "Research on Public Administration Decision Model Based on Big Data Association Rules Mining Algorithm",
        "authors": "Fengqi Guo",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00119"
    },
    {
        "id": 9722,
        "title": "Research on Personalized Recommendation Algorithm of Wenchuang Based on Association Rules Mining",
        "authors": "Liping Qiu",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00083"
    },
    {
        "id": 9723,
        "title": "A Data Mining Method for Biomedical Literature Based on Association Rules Algorithm",
        "authors": "Xiaofeng Shi, Yaohong Zhao, Haijuan Du",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmb.2023.10057445"
    },
    {
        "id": 9724,
        "title": "Research on Shopping Mall Sales Based on Apriori Association Rule Mining Algorithm",
        "authors": "Quan Jiang, Ming-le Ma, Liang-yu Dong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.28-10-2022.2328459"
    },
    {
        "id": 9725,
        "title": "A data mining method for biomedical literature based on association rules algorithm",
        "authors": "Xiaofeng Shi, Yaohong Zhao, Haijuan Du",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmb.2024.136220"
    },
    {
        "id": 9726,
        "title": "The Use of Apriori Algorithm in Digital Campus Web Data Mining",
        "authors": "He Wenjing",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442340"
    },
    {
        "id": 9727,
        "title": "Improved Apriori Algorithm in Higher Vocational English Education Information Data Mining",
        "authors": "Ying Liu, Lvlin Zeng",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdcece57866.2023.10150891"
    },
    {
        "id": 9728,
        "title": "A new evolutionary optimization based on multi-objective firefly algorithm for mining numerical association rules",
        "authors": "Babak Rokh, Hamid Mirvaziri, MohammadHossein Olyaee",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09558-y"
    },
    {
        "id": 9729,
        "title": "Retracted: Discussion on Redundant Processing Algorithm of Association Rules Based on Hypergraph in Data Mining",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9789505"
    },
    {
        "id": 9730,
        "title": "Mining Association Rules for a Sustainable Supply Chain Using Improved Multiobjective Crystal Structure Algorithm",
        "authors": "Salma Yacoubi, Ghaith Manita, Ouajdi Korbaa",
        "published": "2023-7-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codit58514.2023.10284054"
    },
    {
        "id": 9731,
        "title": "SufRec, an algorithm for mining association rules: Recursivity and task parallelism",
        "authors": "Abdelkader Mokkadem, Mariane Pelletier, Louis Raimbault",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121321"
    },
    {
        "id": 9732,
        "title": "Retracted: Application of Apriori Improvement Algorithm in Asthma Case Data Mining",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9858756"
    },
    {
        "id": 9733,
        "title": "Association rule mining of air quality through an improved Apriori algorithm: A case study in 244 Chinese cities",
        "authors": "Keyi Shen, Ye Tian, Bisong Hu, Jin Luo, Shuhua Qi, Songli Chen, Hui Lin",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "AbstractPredicting air pollution is complex due to intertwined factors among local climate, built environment, and development stages. This study leverages K‐means clustering and an improved Apriori algorithm to investigate the combined effects of local meteorological, morphological, and socioeconomic factors on air quality in 244 prefectural‐level Chinese cities. Results reveal that the secondary industry in GDP and saturation vapor pressure strongly relate to air quality. Severe air pollution occurs when urban development is coupled with reduced green areas and high temperatures, confirming that a single factor cannot predict air quality well. For example, we find that combining low population, low regional GDP, high maximum temperatures, and longer roads worsens air quality in small urban built‐up areas. Additionally, temperature and altitude differences associate with highway passenger volume, regional GDP, and population differently. Given our rules mining methods have broader applications in diversified urban environments, this study provides new insights for improving air quality and local Sustainable Development Goals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/tgis.13156"
    },
    {
        "id": 9734,
        "title": "Retracted: Mining and Evaluation of Teaching Civics Courses Based on Apriori-TIDS Algorithm",
        "authors": "",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9820609"
    },
    {
        "id": 9735,
        "title": "Data Mining Technique to Analysis of Student Library Usage Behavior using Apriori Algorithm",
        "authors": "Tewa Promnuchanont, Rujipan Kosarat",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5120/ijca2023922602"
    },
    {
        "id": 9736,
        "title": "Data Mining Implementation of Organic Vegetable Sales Using Apriori Algorithm",
        "authors": "Ahmad Fauzi, Andika Bayu Hasta Yanto, Novita Indriyani",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "In the modern organic vegetable sector, the author observes that there is very tight business competition. Therefore, an effective approach is essential to attract buyers, although restricted sources of new information are one of the hurdles in establishing this business.Association rules are expressed with numerous features that are commonly referred to as (affinity analysis) or (market basket analysis. It was discovered that if consumers buy curly red chilies, they are also inclined to buy cayenne pepper with a 100% confidence level. Likewise, if people buy kale and red curly chiles, they are more likely to buy cayenne pepper with a 100% confidence level. This also applies if consumers buy tomatoes and curly red chilies with a 100% confidence level. In addition, other associations were also observed, such as if consumers buy curly red chilies, they prefer to buy tomatoes with a confidence level of 86%, or if they buy tomatoes and bird's eye chilies, they tend to buy curly red chiles with an 86% confidence level.Likewise, if people buy both cayenne pepper and red curly chili, they are more likely to buy tomatoes with an 86% confidence level. Finally, if customers buy kale and cayenne pepper, they are also likely to buy red curly chilies at an 83% confidence level. Based on the data acquired from this study, it is intended to obtain information about combinations of organic veggies that consumers typically buy together in each transaction, with the intention of improving organic vegetable yields and devising appropriate sales tactics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36378/jtos.v6i1.3049"
    },
    {
        "id": 9737,
        "title": "Implementation of Stock Goods Data Mining Using the Apriori Algorithm",
        "authors": "Bosker Sinaga, Meman Marpaung, Ita Roseni Br Tarigan, Keke Tania",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "Stock inventory in the pharmacy should be well recorded. This is to provide the best service to customers/buyers. Buyers who come with empty results or the drug they want to buy will not feel disappointed, especially if they have made several purchases. This research implements data mining of drug stock inventory, where in the research carried out there are many empty and excess inventory items, resulting in less than optimal service. The research method, namely the survey research method, is a research method that is carried out using surveys or data collection through research respondents. The algorithm used in analyzing the data is the Apriori algorithm. The results of this study are the results of association rules based on predetermined parameters, namely a minimum support of 25% and a minimum confidence of 60%. The rule that is formed is that if consumers buy amoxicillin, they will buy mefenamic acid with a support value of 37% and a confidence of 183%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i3.12852"
    },
    {
        "id": 9738,
        "title": "Application research of association rule based on Apriori algorithm",
        "authors": "Xuemei Li",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3650215.3650360"
    },
    {
        "id": 9739,
        "title": "Student Grade Association Analysis with Apriori Algorithm",
        "authors": "Ilma Khoiruzzidan, Lizda Iswari",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "This study focuses on applying the Apriori algorithm to course grades of 150 students. The research aims to uncover correlations between course grades, providing insights for both the researcher and the institution. Data was directly extracted from the student academic database. The Apriori algorithm was implemented in three scenarios with varying minimum support and confidence thresholds. The final results depict patterns in course grades that tend to co-occur. Among the three scenarios, the combination of Game Development with an A grade, Informatics Fundamentals with an A grade, and Advanced Math with an A grade yielded the highest values, with a support of 26% and confidence of 88.6%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20885/snati.v3.i2.31"
    },
    {
        "id": 9740,
        "title": "Construction and analysis of tourism mapping based on data mining and Apriori algorithm",
        "authors": "Shenghan Wang",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2679050"
    },
    {
        "id": 9741,
        "title": "Evaluating the Performance of Association Rules in Apriori and FP-Growth Algorithms: Market Basket Analysis to Discover Rules of Item Combinations",
        "authors": "Dedy Dwiputra, Agung Mulyo Widodo, Habibullah Akbar, Gerry Firmansyah",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "This study focuses on applying data mining techniques, especially association rules mining using the Apriori and FP-GROWTH algorithms, for market basket analysis on PT. XYZ is a pharmaceutical company in Indonesia. A quantitative methodology uses a dataset of 100,498 transactions originating from 432,356 rows of data covering July to December 2022 in the JABODETABEK area. Apriori and FP-GROWTH algorithms are applied for association rules mining. The results show that FP-GROWTH has the fastest execution time of 84,655 seconds. However, the memory usage for the Apriori algorithm is the lowest at 482.32 MiB, with increments of: 0.21 MiB. For the rules generated, the two algorithms, both Apriori and FP-GROWTH, produce the same number of rules and values of support, confidence, lift, Bi-Support, Bi-Confidence, and Bi-Lift. In conclusion, Apriori is recommended for sales datasets if memory usage and ease of implementation are important. However, if the speed of execution time and a large amount of data are considered, FP-GROWTH is a better choice because the execution time is faster for large amounts of data. However, the choice of algorithm depends on the specific analysis objectives, itemset size, data scale, and computational capabilities. Results from association rules mining provide evidence of product popularity, purchasing patterns, and opportunities for strategic marketing and inventory management. These findings can help PT. XYZ improves business efficiency, understands customer behavior, and increases profitability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58344/jws.v2i8.403"
    },
    {
        "id": 9742,
        "title": "Implementation of Apriori Algorithm for Data Mining on Sales Transaction Data",
        "authors": " Hana Bernika Sabila,  Feri Candra",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Angkasa Mart Store is currently experiencing a decline in sales for specific products, leading to the implementation of the Apriori Algorithm to create bundled offerings that combine less popular items with top-selling products, aiming to revitalize sales and promote the underperforming inventory. Following the CRISP-DM methodology, the study analyzes sales transaction data from June to July 2022, covering 65,892 purchased items, to extract ten critical association rules essential for devising bundled packages. The study's findings propose two strategies for package composition: first, the development of bundled packages comprising strongly related products, identified through comprehensive data analysis and positively received by the store; second, the introduction of 21 bundled packages consisting of products with a relatively weaker relationship, effectively expanding consumer choices and encouraging additional purchases within the store. By implementing the Apriori Algorithm and adhering to the CRISP-DM methodology, this study effectively formulates bundled product packages for Angkasa Mart Store, addressing the challenge of declining sales and contributing to an overall improvement in business performance and customer satisfaction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31258/ijeepse.6.3.189-193"
    },
    {
        "id": 9743,
        "title": "Association Rule Mining untuk Penentuan Media Promosi Pendaftaran Mahasiswa Baru dengan Metode Apriori",
        "authors": "Devi Sugianti",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30591/smartcomp.v12i1.4124"
    },
    {
        "id": 9744,
        "title": "PENERAPAN ASSOCIATION RULES MENGGUNAKAN ALGORITMA APRIORI  UNTUK IDENTIFIKASI POLA PEMBELIAN",
        "authors": "Arya Wijaya, Ahmad Faqih, Dodi Solihudin, Cep Lukman Rohmat, Sandy Eka Permana",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "Transaksi penjualan dalam dunia bisnis seringkali mengalami peningkatan penjualan yang melonjak, dalam hal ini perusahaan-perusahaan memiliki data penjualan bulanan yang terarsip, Masalah yang seringkali terjadi yaitu tidak teratur nya pada penyesuaian stok barang, Data Mining adalah sebuah kegiatan pengolahan data untuk mengenali pola pembelian atau kecenderungan pelanggan terhadap produk penjualan. Penelitian ini bertujuan melibatkan pertanyaan tentang bagaimana algoritma Apriori dapat diterapkan secara efektif untuk mengungkap pola pembelian yang signifikan dalam data transaksi penjualan. studi ini mendiskusikan pentingnya pemahaman pola pembelian dalam bisnis, termasuk manfaatnya untuk rekomendasi produk, strategi pemasaran, dan pengelolaan persediaan. Metode yang digunakan adalah pengumpulan data transaksi penjualan, dengan menggunakan metode KDD dengan algoritma apriori tahapan yang dilakukan antara nya seleksi data, preprocessing data, transformasi data, Data mining, evaluasi. Penggunaan algoritma Apriori untuk mengidentifikasi itemset yang sering muncul bersama dalam transaksi, serta menentukan ambang batas dukungan yang relevan. Hasil dan Diskusi menyoroti pola pembelian yang berhasil diidentifikasi dan menggambarkan implikasinya dalam konteks bisnis, seperti peningkatan penjualan, efisiensi persediaan, dan pengembangan strategi pemasaran yang lebih cermat. Untuk menguji hasil penelitan ini digunakan nilai minimum Support 3% dan nilai Confidence 50% serta tahap evaluasi menggunakan lift ratio minimum 100% dari hasil pengujian tersebtut terdapat beberapa yang memenuhi syarat aturan asosiasi. Misalnya kombinasi, medialuna dan coffee yang memiliki nilai Support 3,5%, nilai Confidence 57% dan nilai lift ratio 120%, Implikasi dari hasil penemuan pola pembelian ini bisa dijadikan strategi penjualan Contohnya, saran untuk penempatan produk, promo khusus untuk produk dan manajemen stok yang efisien.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i6.8270"
    },
    {
        "id": 9745,
        "title": "IMPLEMENTASI ASSOCIATION RULES MENENTUKAN POLA PEMILIHAN MENU DI THE GADE COFFEE &amp; GOLD MENGGUNAKAN  ALGORITMA APRIORI",
        "authors": "Fachri Amsury, Ika Kurniawati, Muhammad Rizki Fahdia",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "ABSTRACT\r\nThe Gade Coffee & Gold produces a lot of sales transaction data every day that is stored in the database, but this data has not been maximized in conducting analysis to produce new knowledge, based on this problem it is necessary to carry out an analysis using a data mining approach and applying association techniques. Data mining is able to analyze data into information by applying association techniques to find several purchasing patterns that are useful to assist companies in the process of making business decisions such as determining product cross-selling, determining promotional programs, and so on. This study aims to determine the pattern of combinations of food and drinks ordered by customers by applying the Apriori method based on sales transaction data for the month of September 2022. The results show that there are 16 association rules with the highest support value which is 6.8% with a confidence value of 85 .7% and the Lift value is 111%, with the rule formed that if a customer buys an Almond Croisant product, there is a chance that the customer will also buy Van Lenning – Iced products.\r\nKeywords: Data Mining, KDD, Association, Apriori\r\n \r\nABSTRAK\r\nThe Gade Coffee & Gold setiap harinya menghasilkan banyak data transaksi penjualan yang tersimpan dalam basis data, namun data tersebut  belum dimaksimalkan dalam melakukan analisa untuk dapat menghasilkan suatu pengetahuan baru, berdasarkan masalah tersebut perlu dilakukan sebuah analisa dengan menggunakan pendekatan data mining serta menerapkan teknik asosiasi. Data mining mampu menganalisa data menjadi sebuah informasi dengan menerapkan teknik asosiasi dapat menemukan beberapa pola pembelian yang berguna untuk membantu perusahaan dalam proses pengambilan keputusan bisnis seperti menentukan cross-selling produk, menentukan program promosi, dan sebagainya. Penelitian ini bertujuan untuk menentukan pola kombinasi dari makanan dan minuman yang dipesan oleh pelanggan dengan menerapkan metode Apriori  berdasarkan data transaksi penjualan periode bulan September 2022.  Hasil penelitian menunjukkan sebanyak 16 aturan asosiasi dengan nilai support tertinggi adalah 6,8% dengan nilai confidence sebesar 85,7% dan nilai Lift 111%, dengan aturan yang terbentuk yaitu apabila pelanggan membeli produk Almond Croisant peluang pelanggan juga membeli produk Van Lenning – Iced.\r\nKata Kunci: Data Mining, KDD, Asosiasi, Apriori",
        "keywords": "",
        "link": "http://dx.doi.org/10.31949/infotech.v9i1.5357"
    },
    {
        "id": 9746,
        "title": "Data Mining Modeling Feasibility Patterns of Graduates Ability With Stakeholder Needs Using Apriori Algorithm",
        "authors": "Titin Winarti, Henny Indriyawati",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "This The speed of information, the accuracy of data, the ease of information services, and accountability are very important reasons for the implementation of the system. Semarang University (USM) is a private university in Semarang that has the most 2 students in Central Java. Based on the 2019 USM tracer data showing horizontal alignment, namely how close the relationship between the field of study and alumni work is, it appears that there is still a discrepancy in the ability of graduates with stakeholders.  The Apriori algorithm is the best-known algorithm for finding high-frequency patterns  Rules that state associations between attributes are often called affinity analysis or market basket analysis. The use of the Apriori Algorithm in data mining calculations using data from the Semarang University tracer that the limit of the minimum support is 50% and the minimum confidence is 100% so that it forms 4 rules. From the four rules produced that modeling using the Apriori Algorithm can produce several rule formations so that it can provide an evaluation to the University for compiling steps, this can be seen because the resulting rules are different because each graduate relationship with the desired desires and different styles.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.24246/ijiteb.422023.55-60"
    },
    {
        "id": 9747,
        "title": "Mining the medication rules of traditional Chinese medicine for thyroid diseases based on improved association rule algorithm",
        "authors": "Kankan She, Wenmin Yang",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2683534"
    },
    {
        "id": 9748,
        "title": "Retracted: Live Multiattribute Data Mining and Penalty Decision-Making in Basketball Games Based on the Apriori Algorithm",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9868761"
    },
    {
        "id": 9749,
        "title": "Analysis of Apriori Algorithm and Its Application",
        "authors": "Hao Liu, AnQi Liu, RuYu Wang, JiaWen Tang",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlccim60412.2023.00087"
    },
    {
        "id": 9750,
        "title": "Investigating school absenteeism and refusal among Australian children and adolescents using Apriori association rule mining",
        "authors": "Umme Marzia Haque, Enamul Kabir, Rasheda Khanam",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "AbstractIdentifying and determining the multitude of reasons behind school absences of students is often challenging. This study aims to uncover the hidden reasons for school absence in children and adolescents. The analysis is conducted on a national survey that includes 2967 Australian children and adolescents aged 11–17. The Apriori association rule generator of machine learning techniques and binary logistic regression are used to identify the significant predictors of school absences. Out of 2484, 83.7% (n = 2079) aged (11–17) years children and adolescents have missed school for various reasons, 42.28% (n = 879) are (11–15) years old, 24.52% (n = 609) and 16.9% (n = 420) are 16- and 17-years old adolescents respectively. A considerable proportion of adolescents, specifically 16.4% (n = 407) and 23.4% (n = 486) of 16 and 17 years old, respectively, have selected ‘refused to say’ as their reason for not attending school. It also highlights the negative outcomes associated with undisclosed reasons for school absence, such as bullying, excessive internet/gaming, reduced family involvement, suicide attempts, and existential hopelessness. The findings of the national survey underscore the importance of addressing these undisclosed reasons for school absence to improve the overall well-being and educational outcomes of children and adolescents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-51230-4"
    },
    {
        "id": 9751,
        "title": "A novel algorithm for mining couples of enhanced association rules based on the number of output couples and its application",
        "authors": "Petr Máša, Jan Rauch",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10844-023-00820-1"
    },
    {
        "id": 9752,
        "title": "Data Mining and Analysis Algorithm of Smart City Network Information Resource Description Framework Based on Fuzzy Association Rules",
        "authors": "Ruihua Li, Zhidong Feng, Hongbo Guo",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "Abstract\nAiming at the problems of poor effect, low precision, and a long time frame in the current data mining analysis algorithm of the network information resource description framework (RDF), a data mining analysis algorithm of the network information RDF based on fuzzy association rules is proposed. Using association rule mining technology combined with fuzzy set theory, a fuzzy association rule algorithm is obtained to deal with quantitative data. Fuzzy c-means (FCM) is used to discretize continuous attributes, and the fuzzy concept pattern and its support and credibility are defined. Add a Mining Query flag to extend the SPARQL Protocol and RDF Query Language (SPARQL) syntax, define the user specified mining model, generate the corresponding project set and transaction, adopt the fuzzy association rule algorithm to generate fuzzy association rules, and realize the RDF data mining analysis of network information. The experimental results show that the network RDF data mining analysis effect of the proposed algorithm is good, which can effectively improve the network RDF data mining analysis accuracy and shorten the mining analysis time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1520/jte20220098"
    },
    {
        "id": 9753,
        "title": "Implementasi Metode Association Rule Mining Pada Penjualan Barang Di Toko Bangunan Ada Mas Menggunakan Algoritma Apriori",
        "authors": "Anton Saputra, Herlina Latipa Sari, Devi Sartika",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "The purpose of this research is to implement the association rule mining method on sales transaction data at the store and also to find out the most popular and most sold building materials at the Ada Mas Building Shop. The implementation of the Association Rule Mining Method on the sale of goods at the Ada Mas Building Shop is used to provide information on the results of the sales pattern of building materials every month which can be used as a parameter in managing the inventory of building materials at the Ada Mas Building Shop, besides that it can provide information on the most popular and most sold building materials at the Ada Mas Building Shop. Based on sales transaction data for September 2022 as many as 193 transactions, the results of 2 itemset sales patterns using the Association Rule Mining Method that meet the minimum support of 10% and minimum confidence of 50% are the most popular items, namely Iron 10 KSTY, Iron 8 KSTY, and Iron 6 KSTY.  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.37676/mude.v2i4.4805"
    },
    {
        "id": 9754,
        "title": "Research On Parallel Association Rules Mining Of Big Data Based On Improved K-Means Clustering Algorithm",
        "authors": "Chaoping Guo, Tuanbu Wang, Li Hao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijaacs.2023.10042660"
    },
    {
        "id": 9755,
        "title": "A genetic algorithm coupled with tree-based pruning for mining closed association rules",
        "authors": "Jashma Suresh Ponmudiyan Poovan, Dinesh Acharya Udupi, Nandanvana Veerappareddy Subba Reddy",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "Due to the voluminous amount of itemsets that are generated, the association rules extracted from these itemsets contain redundancy, and designing an effective approach to address this issue is of paramount importance. Although multiple algorithms were proposed in recent years for mining closed association rules most of them underperform in terms of run time or memory. Another issue that remains challenging is the nature of the dataset. While some of the existing algorithms perform well on dense datasets others perform well on sparse datasets. This paper aims to handle these drawbacks by using a genetic algorithm for mining closed association rules. Recent studies have shown that genetic algorithms perform better than conventional algorithms due to their bitwise operations of crossover and mutation. Bitwise operations are predominantly faster than conventional approaches and bits consume lesser memory thereby improving the overall performance of the algorithm. To address the redundancy in the mined association rules a tree-based pruning algorithm has been designed here. This works on the principle of minimal antecedent and maximal consequent. Experiments have shown that the proposed approach works well on both dense and sparse datasets while surpassing existing techniques with regard to run time and memory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i3.pp2876-2890"
    },
    {
        "id": 9756,
        "title": "A data mining-based analysis of cognitive intervention for college students’ sports health using Apriori algorithm",
        "authors": "Qi Hao, Woong Jae Choi, Jie Meng",
        "published": "2023-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09163-z"
    },
    {
        "id": 9757,
        "title": "Protection of Data Privacy from Vulnerability Using Two-Fish Technique with Apriori Algorithm in Data Mining",
        "authors": "D. Dhinakaran, P. M. Joe Prathap",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0218126624501093"
    },
    {
        "id": 9758,
        "title": "Sales Analysis Using Apriori Algorithm in Data Mining Application on Food and Beverage (F&amp;B) Transactions",
        "authors": "Sonia Marselina, Jajam Haerul Jaman, Dwi Ely Kurniawan",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "The current business landscape has compelled many companies to compete in boosting their company's revenue, particularly in the F&B sector. Existing sales transaction data has not been fully maximized in determining the business strategy of companies. Therefore, the implementation of data mining is necessary to analyze and explore available data to discover new information that is more beneficial for the company. In this study, we analyze sales transaction data using the a priori algorithm method because this algorithm efficiently handles the data mining process on a large scale with a substantial amount of data. The results of this study indicate that the formed association rules can determine patterns of product purchases that are frequently bought together. The established association rules successfully combine sales transaction data into two-item combinations, namely green tea latte and french fries, with a support value of 16% and a confidence level of 83%. These rules can be used as a reference in determining the company's business strategy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30871/jaic.v7i2.5026"
    },
    {
        "id": 9759,
        "title": "Data Mining technique:  Application of Apriori algorithm for road accident analysis",
        "authors": "Ryan Clifford Larraquel Perez",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Road accidents can happen due to various factors. These factors that contribute to road accidents have cost damage to properties, injuries or deaths and most road accidents are attributable to the lack of knowledge on road safety. To provide safe driving and road safety plans, critical analysis of road accident data is needed, to identify the causes of road accidents. Annually, 1,250,000 people die and 50,000,000 are injured in road accidents worldwide, and fatal road accidents are caused by human error. Improving road conditions is not sufficient, but significantly understanding human errors that cause road accidents, and negligence of corrective and safety driving protocols provided by the concerned government agencies or private organizations. The study aimed to help get insights about the causes of road accidents, and to provide knowledge of road accidents for road safety using Association Rule Mining with the application of the Apriori Algorithm. Association rule mining using the Apriori Algorithm produces significant patterns and insights that help identify the causes of road accidents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46223/hcmcoujs.tech.en.13.2.2831.2023"
    },
    {
        "id": 9760,
        "title": "Forecast of seasonal consumption behavior of consumers and privacy-preserving data mining with new S-Apriori algorithm",
        "authors": "Duy Thanh Tran, Jun-Ho Huh",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05105-6"
    },
    {
        "id": 9761,
        "title": "Discovering the symptom patterns of COVID-19 from recovered and deceased patients using Apriori association rule mining",
        "authors": "Mohammad Dehghani, Zahra Yazdanparast",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.imu.2023.101351"
    },
    {
        "id": 9762,
        "title": "A Comprehensive Review on Association Rule Mining and its Algorithms: Apriori, FP Growth, and SS-FIM",
        "authors": "Priyankaben Vashi",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Abstract: The technique of extracting usable information from databases is known as data mining. It is employed to manage massive amounts of data. In order to forecast future trends and behaviours, data mining is performed. Today, data mining is a technique that is growing helpful since it has many uses. Massive amounts of data are produced daily in many different fields. Data mining is utilised since it is challenging to analyse such a big volume of data. It is often referred to as database knowledge discovery (KDD). Data mining technologies are used to forecast the behaviour and pattern of the data, assisting organisations in decision-making [1]. Association Rule Mining is one of the data mining techniques discussed in the present article. It has three algorithms. 1. Apriori, 2. FP-Growth, and 3. SS-FIM. In the current work, all three algorithms are discussed. After examining each algorithm, it was determined that the SS-FIM algorithm had the best combination of features",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.54067"
    },
    {
        "id": 9763,
        "title": "An Improved Eclat Algorithm based Association Rules Mining Method for Failure Status Information and Remanufacturing Machining Schemes of Retired Products",
        "authors": "Lei Wang, Yan Guo, Yuyao Guo, Xuhui Xia, Zelin Zhang, Jianhua Cao",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procir.2023.06.098"
    },
    {
        "id": 9764,
        "title": "Apriori Algorithm Application for Consumer Purchase Patterns Analysis",
        "authors": "Boldson Herdianto Situmorang, Ali Isra, Dhatu Paragya, David Aulia Akbar Adhieputra",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "The Apriori algorithm is a data mining association rule algorithm for finding relationship patterns between one or more items in a dataset. Apriori algorithm is often used in transaction data analysis or market basket analysis. Apriori algorithm is used to find out consumer purchase patterns in e-commerce systems and provide product recommendations to consumer by extaracting associations or events from transactional data. This study is purposed for deeply analyze the steps, performance of Apriori algorithm, and give relevant an example of case study to better explain the steps of Apriori algorithm application, as well as the results achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33751/komputasi.v21i1.9260"
    },
    {
        "id": 9765,
        "title": "Analysis of multiple chronic disease characteristics in middle-aged and elderly South Koreans by exercise habits based on association rules mining algorithm",
        "authors": "Yingcheng Huang, Yaqi Su, Yonghyun Byun, Youngil Lee, Sangho Kim",
        "published": "2023-6-26",
        "citations": 6,
        "abstract": "Abstract\nBackground\nThe term, “multiple chronic diseases” (MCD), describes a patient with two or more chronic conditions simultaneously at the same time. Compared with general chronic diseases, it is linked to poorer health outcomes, more difficult clinical management, and higher medical expenses. Several existing MCD guidelines support a healthy lifestyle including regular physical activities but do not include specific exercise therapy recommendations. This study aimed to understand the prevalence and model of MCD in middle-aged and elderly South Koreans by comparing MCD characteristics with exercise habits, to provide a theoretical basis for the implementation of exercise therapy in these patients.\n\nMethods\nThe data of 8477 participants aged > 45 years from the “2020 Korean Health Panel Survey” were used to analyze the current status of MCD in the middle-aged and elderly. The Chi-square test for categorical variables and the t-test for continuous variables. the used software was IBM SPSS Statistics 26.0 and IBM SPSS Modeler 18.0.\n\nResults\nIn this study, the morbidity rate of MCD was 39.1%. Those with MCD were more likely to be female (p < 0.001), seniors over 65 years of age (p < 0.001), with low education level, no regular exercise behavior (p < 0.01). Chronic renal failure (93.9%), depression (90.4%), and cerebrovascular disease (89.6%) were the top three diseases identified in patients with MCD. A total of 37 association rules were identified for the group of individuals who did not engage in regular exercise. This equated to 61% more than that of the regular exercise group, who showed only 23 association rules. In the extra association rules, cardiovascular diseases (150%), spondylosis (143%), and diabetes (125%) are the three chronic diseases with the highest frequency increase.\n\nConclusions\nAssociation rule analysis is effective in studying the relationship between various chronic diseases in patients with MCD. It also effectively helps with the identification of chronic diseases that are more sensitive to regular exercise behaviors. The findings from this study may be used to formulate more appropriate and scientific exercise therapy for patients with MCD.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12889-023-16099-4"
    },
    {
        "id": 9766,
        "title": "Improvements in Apriori Algorithm to increase effectiveness for Association Rule",
        "authors": "Atul R. Patil, Bechoo Lal, Prakash R. Kolhe, Vishnu D Jadhav",
        "published": "2023-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58443/ijrex.11.2.2023.35-41"
    },
    {
        "id": 9767,
        "title": "Data Mining Implementation Of Electronic Products Sales Using Apriori Algorithm (Case Study Of Fokus Komputer Shop)",
        "authors": "Yunita  Meli Dena, Muhammad Husni Rifqo, Yuza Reswan, A.R Walad Mahfuzi",
        "published": "2023-6-3",
        "citations": 0,
        "abstract": "Focus Komputer Store is one of the computer shops in Bengkulu City which is the destination for consumers in looking for computer-related goods and providing computer service services. Every day the sales transaction data in stores continues to grow and causes a very large data storage. Most sales transaction data are only used as archives without being put to good use. The process of selecting goods is carried out by taking into account the pattern of purchases in the previous month so that a list of items that must be provided is more extensive to meet current consumer needs. The problem is market interest or consumer needs are always changing depending on uncertain conditions. The process of selecting goods to fill stock is a very complicated process and takes a long time because you have to read the sales archives that were made the previous month. For this reason, it is necessary to have an application that can provide recommendations on what items are currently in demand by consumers based on last month's sales data. Applications that can be used for the process of extracting previous data are data mining applications. Data mining is an analysis of reviewing data sets to find unexpected relationships and summarize data in different ways that are understandable and useful to the data owner. To be able to get results that are more relevant to needs, applications must use suitable algorithms, one of which is the Apriori algorithm. The a priori algorithm is an algorithm that searches for frequent itemsets using the association rule technique. The application can be used as a sales cashier application at the Computer Focus store and can display the results of a priori algorithm calculations based on sales data that has been input into the application. The application that the author has built still has many shortcomings, especially in terms of appearance and data. The author hopes that there are criticisms and suggestions that can help in developing applications so that they are even better.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53697/jkomitek.v3i1.1200"
    },
    {
        "id": 9768,
        "title": "Information literacy of college students from library education in smart classrooms: based on big data exploring data mining patterns using Apriori algorithm",
        "authors": "Si Chen, Ying Xue, Xiangzhe Cui",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09621-8"
    },
    {
        "id": 9769,
        "title": "Metaheuristic Gene Regulatory Networks Inference Using Discrete Crow Search Algorithm and Quantitative Association Rules",
        "authors": "Hichem Haouassi, Abdeldjalil Ledmi, Aboubekeur Hamdi Cherif, Mohammed El Habib Souidi, Makhlouf Ledmi, Chafia Kara Mohamed",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmb.2025.10062651"
    },
    {
        "id": 9770,
        "title": "Analyzing Radicalism-Related Conversation Patterns on Twitter: A Comparative Study of Association Rules with Apriori and FP-Growth Algorithms",
        "authors": "Iva Alfiyanti, Dewi Khairani, Khodijah Hulliyah, Jm Muslimin, Feri Fahrianto, Nunung Isnaini Dwi Ningsih",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/citsm60085.2023.10455493"
    },
    {
        "id": 9771,
        "title": "Învățarea regulilor de asociere în mineritul datelor (Learning Association Rules in Data Mining)",
        "authors": "Nicolae Sfetcu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4731831"
    },
    {
        "id": 9772,
        "title": "Apriori and neural network algorithm for university databases and financial application using data mining algorithms",
        "authors": "Krishnamoorthy Muniyan, Karthikeyan Ramakrishnan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0163756"
    },
    {
        "id": 9773,
        "title": "Application of the Association Rule in Online Stores Using Apriori Algorithm for Product Recommendations at Promotional Events",
        "authors": "Syahrinnisa Fajrianti, Okyza Maherdy Prabowo, Rin Rin Nurmalasari, Rismawati Ramdani",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icwt58823.2023.10335465"
    },
    {
        "id": 9774,
        "title": "Equipment Quality Information Mining Method Based on Improved Apriori Algorithm",
        "authors": "Fulin Li, Chen Meng, Cheng Wang, Shuyi Fan",
        "published": "2023-5-3",
        "citations": 1,
        "abstract": "Equipment quality-related data contains valuable information. Data mining technology seems to be an efficient method for extracting knowledge from large amounts of data. In this paper, a general method for equipment quality information mining based on association rule is proposed for complex equipment. Due to the shortcomings of classical association rule mining algorithms such as long running time and high memory consumption, the candidate itemset generation process is optimized, and an improved Apriori algorithm is proposed. Taking five experimental data sets as the object, the performance of the algorithms is tested using time complexity and spatial complexity as evaluation criteria. Comparative experiments show that the improved algorithm had advantages. To further implement data processing and information representation, a matrix-based strong association rule extraction algorithm was proposed. Taking a certain type of equipment as an example, a simulation experiment was conducted using the method proposed in this article in reliability test data sets, and some interesting knowledge was obtained through mining, verifying the effectiveness of the method. The research in this article seems promising with respect to improving the scientific level of equipment support.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/2155590"
    },
    {
        "id": 9775,
        "title": "APPLICATION OF THE APRIORI ALGORITHM IN ORGANIZING EFFECTIVE WAREHOUSE LAYOUT",
        "authors": "Burcu ÖZCAN, Aysu KARAMAN, Yıldız Edanur YILMAZ",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Büyük veri setlerindeki değerli ve sonucu tahmin edilmeyen bilginin keşfine veri madenciliği denmektedir. Veri madenciliğinin çeşitli ve geniş uygulama alanı bulunmaktadır. Gelişen teknoloji ve ürün çeşitliliğinde ki artış ile birlikte sürdürülebilirliğin sağlanması için firmaların en önemli ihtiyaçları arasına girmiş olan etkin depo yönetimi konusu veri madenciliği ile birlikte ele alınmıştır. Firmanın siparişleri incelenerek dinamik sipariş analizi sonucu sürdürülebilir etkin depo yerleşimi yapılması hedeflenmiştir. Çalışmada ilk olarak veri ve veri madenciliği modelleri incelenmiştir. Daha sonra depo yönetimi ve yerleşimi kavramları üzerinde incelemeler yapılmıştır. Bu incelemeler birlikte kullanılmaya başlanarak boya fabrikası deposuna gelen siparişler doğrultusunda ürünlerin birlikte kullanılma sıklıkları Apriori algoritması ile incelenmiştir. %3 destek, %70 güven düzeyi ideal kabul edilerek Ü7’nin Ü4 ve Ü5'e en yakın konuma yerleştirilmesiyle başlanarak etkin depo yerleşimi gerçekleştirilmiştir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46238/jobda.930070"
    },
    {
        "id": 9776,
        "title": "An Efficient Healthcare Data Mining Approach Using Apriori Algorithm: A Case Study of Eye Disorders in Young Adults",
        "authors": "Kanza Gulzar, Muhammad Ayoob Memon, Syed Muhammad Mohsin, Sheraz Aslam, Syed Muhammad Abrar Akber, Muhammad Asghar Nadeem",
        "published": "2023-3-27",
        "citations": 6,
        "abstract": "In the public health sector and the field of medicine, the popularity of data mining and its usage in knowledge discovery and databases (KDD) are rising. The growing popularity of data mining has discovered innovative healthcare links to support decision making. For this reason, there is a great possibility to better diagnose patient’s diseases and maintain the quality of healthcare services in hospitals. So, there is an urgent need to make disease diagnosis possible by discovering the hidden patterns from the patients’ history information in developing countries. This work is a step towards how to use the extracted knowledge to enhance the quality of healthcare facilities. In this paper, we have proposed a web-centered hospital information management system (HIMS) that identifies frequent patterns from the data with eye disorder patients using the association rule-based Apriori data mining technique. The proposed framework has the capability to overcome all the key issues and problems in the current hospital information management system regarding data analysis and reporting services. For this purpose, data were collected from more than 1000 university students (China citizens) both online and manually (printed questionnaire). After applying the Apriori algorithm on the collected data, we revealed that almost 140 individuals out of 1035 had myopia (near-sighted disorder), at current age of 22 years, and that there were no male patients found with myopia. We concluded that their clinical relevance and utility can generate favorable results from prospective clinical studies by mapping out the habits or lifestyles that potentially lead to fatal diseases. In the future, we plan to extend this work to fully automate HIMS to help practitioners to diagnose the reasons of various diseases by extracting patient lifestyle patterns.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14040203"
    },
    {
        "id": 9777,
        "title": "Determination of Breakfast Menu Patterns on the Fast Food Restaurant Using Apriori Algorithm",
        "authors": "Anggi Putri, Dzulfiqar Fauzan, Hana’ Nabilah, Ruli Utami, Suryo Atmojo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012109200003680"
    },
    {
        "id": 9778,
        "title": "Implementation of association rule using apriori algorithm and frequent pattern growth for  inventory control",
        "authors": "Imam Riadi, Herman Herman, Fitriah Fitriah, Suprihatin Suprihatin, Alwas Muis, Muhajir Yunus",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Business success is a business that is able to compete and grow keep abreast of developments in the business world. Especially in the retail sector, where competition is getting tighter. Business owners need to pay attention to the layout of goods and stock management to improve service and meet consumer needs because consumers often have difficulty in finding goods. On the other hand, shortages and excess stock often occur due to lack of goods management. Based on these problems, appropriate techniques are needed for the management of goods supply, one of which is to apply techniques found in the branch of science. Data mining is a technique of association rules. This study aims to find patterns of placement and purchase of goods in generating Association Rule using FP-Growth algorithm. The dataset in this study used data on sales of goods in clothing stores. The results of the study of 140 transactions there are 24 association rules consisting of 7 association rules with 2-itemsets and 17 association rules with 3-itemsets that most often appear in transactions. Based on the order of the highest support value, namely CKJ→STX^LK with a support value of 67%, while the highest confidence value, there are 3 association rules that get the same value, namely STX^CKJ→LK, STX^CAK→LK, STX^RI→LK with a value of 100%. Thus, the rules of association produced by the frequent itemset algorithm, FP-growth, can serve as decision support for the sales of goods in small and medium-sized retail businesses",
        "keywords": "",
        "link": "http://dx.doi.org/10.20895/infotel.v15i4.980"
    },
    {
        "id": 9779,
        "title": "Association rules and decision rules",
        "authors": "Abdelkader Mokkadem, Mariane Pelletier, Louis Raimbault",
        "published": "2023-10",
        "citations": 0,
        "abstract": "AbstractDetermining association rules of significant interest is an essential task within data mining and statistical analysis. In this paper, we first precisely define the notion of association rule. For this, we introduce a general model, which includes the usual transaction model, and which allows many operations on the association rules. Then, we interpret association rules as statistical decision rules. This interpretation leads to four decisional measures, one of them being the usual confidence. Then, we give some strategies based on the use of these four decisional measures in order to select or to construct association rules with a given consequent. We finally present an experimental study to illustrate these strategies. This study is carried out in R language, with the R‐package we specifically built for association rules mining.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/sam.11620"
    },
    {
        "id": 9780,
        "title": "WOMDI-Apriori Data Mining Algorithm for Clustered Indicators Analysis of Specialty Groups in Higher Vocational Colleges",
        "authors": "Fei Gao, Jing Yang, Yang Yang, Xiaojing Yuan",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "\nThe cluster effect of specialty groups plays an important role in the development of Higher Vocational Colleges. The purpose of this research is to scientifically explore the interaction mech- anism of specialty groups clustering indexes in higher vocational colleges, uantitatively analyze the correlation of these indexes, nd explore reasonable measures to promote the specialty groups clustering effect in higher ocational olleges. Firstly, data denoising and field screening were car- ried out on the original data, and then the variables were clustered and divided into LHS (Left Hand Side) and RHS (Right Hand Side). Then, an improved multi-dimensional interactive Apri- ori association rule mining algorithm considering index weights and orientation constraints was proposed. The improved Apriori algorithm and the traditional Apriori algorithm were applied to mine the structured data sets. The results show that the improved WOMDI-Apriori algorithm in this study improves the accuracy by 79.96% compared with the traditional Apriori algorithm. The results indicate that, when the indicators of brand, key and characteristic majors at or above the provincial level, proportion of full-time teachers with double qualifications, and the number of internship students accepted by cooperative enterprises are at a low level, the number of projects and satisfaction proportion of employers with graduates would be negatively affected; The majr category of equipment manufacturing is subjected to various factors coupling, which may lead to different graduates’ counterpart mployment rate; for association rules where the uccessor of the mining results is dominated by negative results, measures should be taken to avoid or reduce the possibility of their occurrence as much as possible. For association rules in which the successors of the mining results are dominated by positive results, measures should be taken to facilitate the occurrence of these frequent item sets whenever possible. The framework proposed in this research can provide theoretical guidance for analyzing operating characteristics and promoting the positive effects of specialty groups in higher vocational colleges.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.15837/ijccc.2023.3.5045"
    },
    {
        "id": 9781,
        "title": "Analysis of the Application of Transaction Data with Association Techniques using the Apriori Algorithm in Pharmacy",
        "authors": "Wahyudi Nasutioni, Dodo Zaenal Abidin, Errissya Rasywir",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "The development of information technology influences the rapid growth in the amount of data collected and stored in large t. Dimas Pharmacy, located at Jl. Segara Kec. Nipah Panjang is one of the public health services that sells various medicines, medical devices, and so on. This study is expected to provide positive benefits for owners of Dimas Nipah Panjang Pharmacy in Providing information about the pattern of medicine purchases made by consumers and Facilitating pharmacy owners to know the available medicine supplies in the warehouse so as not to experience emptiness when needed. Problem Formulation, Literature Study, Data Collection, Calculation and Analysis of Associations with Priori Algorithms, Results Evaluation and Analysis and Report Making. Based on the results of interviews and observations that have been made, the authors obtain data from the Dimas Pharmacy sales transaction. Data held ± 1000 sales transaction data for the period of May and June. But the author only entered 216 sales transactions in May and 141 sales transactions in June. After knowing the method of data selection, the authors conducted data selection by taking 6 items of significant data specifications in certain contexts, namely Anti Serotonin / Allergy, Antacid / Ulcer, Antibiotics, Antipyretics, Inflammation, Hypertension Each of these items had different brands. From these results it can be explained that the sales transaction of the Dimas Pharmacy in May and June generates or generates relationships between shopping product items. With the calculation of the Apriori Association Algorithm, a Market Basket Analysis relationship was found between Medicinal Pronicy and Dexa items. With the Rule \"IF Buy Pronicy, THEN Buy Dexa\". The rule is generated from the highest support and confident values of the overall support and confident items. The highest support value is 0.15 and the highest confident value is 0.5 \".",
        "keywords": "",
        "link": "http://dx.doi.org/10.35145/jabt.v4i3.141"
    },
    {
        "id": 9782,
        "title": "An optimisation approach for determining the efficiency of vital medical devices in intensive care units with COVID-19 patients using Apriori algorithm",
        "authors": "Mehrshad Lalinia, Abasat Mirzaei, Fatemeh Hoseini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.10056852"
    },
    {
        "id": 9783,
        "title": "Implementasi Market Basket Analysis Menggunakan Algoritma Apriori pada Data Penjualan Buku",
        "authors": " Ahmad Thariq",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "Pada saat ini toko penjualan produk buku sangat banyaknya di berbagai daerah. Hal ini menjadi sebuah tantangan tersendiri bagi perusahaan Toko Bina Ilmu untuk bersaing di industri perdagangan itu sendiri. Oleh karena itu dibutuhkan adanya proses Data Mining dalam hal pengumpulan dan pengolahan data dengan menggunakan metode Association Rules Mining atau lebih dikenal dengan sebutan Market Basket Analysis untuk mengetahui hubungan antar barang pada satu dataset sebagai sebuah strategi dari perusahaan Toko Bina Ilmu. Sistem Informasi Penjualan produk buku yang ada di perusahaan Bina Ilmu belum benar-benar dapat dimanfaatkan untuk menentukan pengambilan keputusan yang tepat dalam sistem persediaan barang, sehingga sangat berpengaruh terhadap tingkat penjualan. Penelitian ini menggunakan Algoritma Apriori untuk mencari jenis produk buku yang paling banyak terjual diantara beberapa produk buku. Algortima Apriori digunakan untuk menentukan pola pembelian produk buku untuk persediaan produk buku berdasarkan kecendrungan pembeliaan produk buku oleh konsumen.Untuk pengembangan sistem dibangun dengan pendekatan Market Basket Analysis untuk menentukan produk mana yang akan dibeli oleh konsumen berdasarkan analisa terhadap daftar transaksi pelanggan. Hasil Implementasi Market Basket Analysis dengan Algoritma Apriori Jika membeli buku Novel, maka akan membeli buku Internet dengan support 50% dan confidence 75%. Jika membeli buku Internet, maka akan membeli buku Novel dengan support 50% dan confidence 80%. Dapat disimpulkan bahwa jenis produk buku yang paling banyak terjual adalah buku Novel dan buku Internet,  dengan diketahuinya produk yang paling banyak terjual tersebut,  sehingga perusahaan dapat menyusun strategi pemasaran untuk memasarkan produk dengan jenis lain dengan meneliti apa kelebihan produk yang paling banyak terjual tersebut dengan produk lainnya dan dapat menambah persedian buku Novel dan buku Internet",
        "keywords": "",
        "link": "http://dx.doi.org/10.56338/jks.v6i3.3333"
    },
    {
        "id": 9784,
        "title": "Design of Data Mining System for Sports Training Biochemical Indicators Based on Artificial Intelligence and Association Rules",
        "authors": "Dongbiao Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmb.2024.10060195"
    },
    {
        "id": 9785,
        "title": "An optimisation approach for determining the efficiency of vital medical devices in intensive care units with COVID-19 patients using Apriori algorithm",
        "authors": "Abasat Mirzaei, Fatemeh Hoseini, Mehrshad Lalinia",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.131377"
    },
    {
        "id": 9786,
        "title": "A Novel Association Rule Mining Model for Generating Positive and Negative Association Rules with Hybridized Meta-Heuristic Development",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0430.11"
    },
    {
        "id": 9787,
        "title": "Design of Education Management System Based on Apriori Algorithm",
        "authors": "Han Daoriao",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235011"
    },
    {
        "id": 9788,
        "title": "Research on Optimization of English Machine Translation Based on Association Rules Mining",
        "authors": "Xia Wei",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccect57938.2023.10140218"
    },
    {
        "id": 9789,
        "title": "Survey, Analysis and Association Rules derivation using Apriori Method for buying preference amongst kids of age-group 5 to 9 in India",
        "authors": "Neha Arora, Kamal Kumar Gola, Sagar Gulati, Parul Chutani",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pcems58491.2023.10136055"
    },
    {
        "id": 9790,
        "title": "Identification of polypharmacy patterns in new‐users of metformin using the Apriori algorithm: A novel framework for investigating concomitant drug utilization through association rule mining",
        "authors": "Maria Luisa Faquetti, Adrian Martinez‐De la Torre, Theresa Burkard, Guillaume Obozinski, Andrea M. Burden",
        "published": "2023-3",
        "citations": 1,
        "abstract": "AbstractPurposeWith increased concomitant chronic diseases in type 2 diabetes mellitus (T2DM), the use of multiple drugs increases as well as the risk of drug–drug interactions (DDI) and adverse drug reactions (ADR). Nevertheless, how medication patterns vary in T2DM patients across different sex and age groups is unclear. This study aims to identify and quantify common drug combinations in first‐time metformin users with polypharmacy (≥5 co‐medications).MethodsNew users of metformin were identified from the IQVIA Medical Research Data incorporating data from THIN, A Cegedim Database (2016–2019). A descriptive cohort study explored prescription patterns in patients with polypharmacy. The Apriori algorithm, used to find frequent item‐sets in databases, was first‐time applied to identify and quantify drug combinations of up to seven drugs to investigate potential harmful polypharmacy patterns.ResultsThe cohort included 34 169 new‐users of metformin, of which 20 854 (61.0%) received polypharmacy. Atorvastatin was the most frequently co‐prescribed drug with metformin overall (38.7%), in women (34.3%) and men (42.6%). In the stratified analysis, a higher proportion of women received polypharmacy (65.6%) compared to men (57.4%). Moreover, the proportion of patients receiving polypharmacy increased with age (18–39 years = 30.4%, 40–59 years = 50.5%, 60–74 years = 70.9%, and ≥75 years = 84.3%).ConclusionThis study is the first to identify and quantify commonly prescribed combinations of drugs compounds in patients with polypharmacy using the Apriori algorithm. The high polypharmacy prevalence at all strata indicates the need to optimize polypharmacy to minimize DDI and ADR.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/pds.5583"
    },
    {
        "id": 9791,
        "title": "Apriori Modified for Action Rules Mining",
        "authors": "Lukas Sykora, Tomas Kliegr",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587259.3627569"
    },
    {
        "id": 9792,
        "title": "Data Mining Using Association Rules for Intuitionistic Fuzzy Data",
        "authors": "Frederick Petry, Ronald Yager",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "This paper considers approaches to the computation of association rules for intuitionistic fuzzy data. Association rules can provide guidance for assessing the significant relationships that can be determined while analyzing data. The approach uses the cardinality of intuitionistic fuzzy sets that provide a minimum and maximum range for the support and confidence metrics. A new notation is used to enable the representation of the fuzzy metrics. A running example of queries about the desirable features of vacation locations is used to illustrate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14070372"
    },
    {
        "id": 9793,
        "title": "Implementation of the Association Rule Method using Apriori Algorithm to Recognize The Purchase Pattern of Pharmacy Drugs “XYZ”",
        "authors": "Fadhila Putri Utami, Arief Jananto",
        "published": "2023-1-4",
        "citations": 0,
        "abstract": "XYZ Pharmacy is a Special Health Service Point for employees and retirees of the XYZ company. This pharmacy carries out the process of buying and selling drugs by providing various types of drugs. The number of sales transactions in each day, resulting in sales data will increase over time. If the data is left alone, the pile of data will only become archives that are not utilized. By carrying out the data mining process, this data can be used to produce information that can be used to increase sales transactions at XYZ Pharmacy. The method used in this study is the Association Rule which functions to analyze the most sold and purchased drugs simultaneously, this analysis will be reviewed from drug sales transaction data at the XYZ Pharmacy. The application of the a priori algorithm in this study succeeded in finding the most item combinations based on transaction data and then formed an association pattern from the item combinations. By knowing the types of drugs that are often purchased together through identification of purchasing patterns, it is very useful for the XYZ Pharmacy to maintain the availability of the drugs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24114/cess.v8i1.40377"
    },
    {
        "id": 9794,
        "title": "Algorithm Analysis of Association Rule Apriori to Determine the Prediction of Sasirangan Production Based on the Patterns of Sales Transactions",
        "authors": " Heru Kartika Candra, Muhammad Bahit, Rahma Pitria Ningsih, Dwi Mulyani",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52731/liir.v005.228"
    },
    {
        "id": 9795,
        "title": "An Algorithm for Data Management of Higher Education Based on Fuzzy Set Theory - Association Rule Mining Algorithm",
        "authors": "Youmeng Guan",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31449/inf.v47i9.5222"
    },
    {
        "id": 9796,
        "title": "Penentuan Posisi Mesin Game Menggunakan Metode Aras Dan Algoritma Apriori",
        "authors": "Fernandito Freddy Setlight Durand,  Kusrini,  Dhani Ariatmanto",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Abstract — There are various game rides that can be used by the public like playing a Redemption Tickets game, vending machines, Large Game, and then bumper cars, and there also children's games 4 - 10 years called Kiddie Land/Kiddie Zone. This research will determine the position of game in The Play Zone Balikpapan using transaction data in June 2022 using 2 methods, aras method, association rules using the apriori algorithm and combination of these 2 methods. With aras method, a ranking search will be carried out with normalization and data optimization in order to find out the top 10 top machines that will be positioned near the entrance. With apriori algorithm, an itemset combination will be choosed on the minimum support and confidence parameters, in order to combine a game machine that is often played if a customer plays 1 or more then the customer also plays other machines in close proximity. From the results of this study, it was obtained the increase in game machine revenue for The Play Zone Balikpapan is game ticket redemption at the level method of 66.98%, the a priori algorithm is 173.11%, and a combination of these 2 methods is 489.54%.\n \nKey words — Game Center, Algorithm Apriori, Data Mining, Aras Methods, Decision System Support\n \nAbstrak — Ada berbagai wahana permainan yang dapat dipakai oleh masyarakat, seperti memainkan game yang mengeluarkan tiket yaitu Tiket Redemption, vending machine, juga Large Game seperti shooting game, fighting game, dance game, ada juga bumper car , dan permainan anak-anak 4 - 10 tahun yaitu Kiddie Land/Kiddie Zone dan Kiddy Ride. Pada penelitian ini akan dilakukannya penentuan posisi permainan di The Play Zone Balikpapan menggunakan data transaksi mesin pada bulan Juni 2022 dengan menggunakan 2 metode yaitu metode aras, aturan asosisai menggunakan algoritma apriori dan gabungan 2 metode ini. Dengan metode aras posisi mesin game akan dilakukannya pencarian ranking dengan normalisasi dan optimasi data guna untuk mengetahui 10 mesin top teratas yang nantinya posisi mesin tersebut akan diletakkan di dekat pintu masuk. Dengan menggunakan algoritma apriori akan dilakukannya kombinasi itemset berdasarkan parameter minimum support dan confidence, guna untuk mengkombinasikan suatu mesin game yang sering dimainkan jika suatu pelanggan memainkan 1 atau lebih maka pelanggan juga memainkan mesin yang lain secara berdekatan (aturan asosiasi) Dari hasil penelitian ini, didapat peningkatan pendapatan mesin game untuk perusahaan The Play Zone Balikpapan adalah game tiket redemption pada metode aras 66,98 %, algoritma apriori 173,11 %, dan gabungan antara 2 metode ini 489,54 %.  \n \nKata kunci — Game Center, Algoritma Apriori, Data Mining, Metode Aras, Sistem Pendukung Keputusan, MCDM, Metode Asosiasi",
        "keywords": "",
        "link": "http://dx.doi.org/10.35793/jtek.v12i2.48493"
    },
    {
        "id": 9797,
        "title": "An Apriori Algorithm-Based Association Rule Analysis to detect Human Suicidal Behaviour",
        "authors": "Md. Mehedi Hassan, Asif Karim, Swarnali Mollick, Sami Azam, Eva Ignatious, A S M Farhan Al Haque",
        "published": "2023",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.412"
    },
    {
        "id": 9798,
        "title": "Quantum Algorithm for Mining Frequent Patterns for Association Rule Mining",
        "authors": "Abdirahman Alasow, Marek Perkowski",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jqis.2023.131001"
    },
    {
        "id": 9799,
        "title": "Simulation of Financial Risk Prediction Model Based on Apriori Optimization Algorithm",
        "authors": "Muyi Yan",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00112"
    },
    {
        "id": 9800,
        "title": "Investing Decision Model Based on Apriori Algorithm",
        "authors": "Hanqi Chen",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "Quantitative investments can be effective in reducing losses. It plays an important role in the pre-diction of the market. Due to this, more and more investors are paying attention to it. Trade Strategy Model and other models are used to predict price and make the decision. In Data Mining (DM), quantile values, advance rate, and decline rate are utilized to determine relative likelihood. Furthermore, the Apriori algorithm is used to calculate the number of continuous rises and falls that occur with a probability greater than 90%. To determine the amount of dollars to be purchased or sold in the shipment space, we establish a Position-Management Model (PMM). Finally, we introduce the Decision-Making Model (DMM) as a tool for trading decisions. We then plug $1000 into the model to arrive at $1958.37 in 2021. Based on the comparison of the predicted price and the real price from 2019-9-1 to 2019-10-31, we found a slight deviation between the predicted and the real price. As part of our verification process, we used the BackTesting method and selected the indicator \"annual return rate,\" whose test showed an average of 17.687%, an excellent result. Afterward, we provide a summary of the strategy process for assisting its quantitative trading investment. To conclude, our models are distinguished by their precise values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ehss.v16i.9615"
    },
    {
        "id": 9801,
        "title": "Etkin Bir Pazarlama Stratejisi Oluşturmak için Apriori Algoritması Temelinde Müşteri Satın Alma Davranışının Ölçülmesi",
        "authors": "Murat AKCIL, Serap AKCAN",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "Due to technological developments and competitive conditions, it is becoming more and more important to gain customers and keep them. Association rules are one of the methods used effectively to determine which products and services are more important and preferred by customers together. The aim of this study is to determine the types of patterns purchased by a company operating in the forest products sector, using the data of decor paper, which affects the cost the most, is used extensively in production and is difficult to plan. This study was carried out with the Apriori algorithm in WEKA, which is widely used in association analysis. It is thought that the association rules obtained from this study will enable the firm to determine the purchasing behaviors of its customers by revealing the overseas model trends and associations. In addition, this study will shed light on the company at the stage of determining the marketing strategy of the company.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21605/cukurovaumfd.1377741"
    },
    {
        "id": 9802,
        "title": "IMPLEMENTASI DATA MINING MENGGUNAKAN ALGORITMA APRIORI UNTUK MENINGKATKAN POLA PENJUALAN",
        "authors": "Chairil Adam, Koko Handoko",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Medicine is a necessity for someone who is sold to people with disease. Therefore, every pharmacy or hospital must have a data processing system so that each transaction data can be used to make reports. From this report a useful result will be created to determine which drugs are most frequently purchased and sold so as to be able to determine the amount of stock at the pharmacy. But at the present time drug sales transaction data continues to increase every day so that it has accumulated because the system used is a system for storing or archiving bookkeeping without utilizing the transaction data, besides that the problem that often arises is the lack of maximum customer service at pharmacies because the drugs or needs that consumers are looking for are still not available. The a priori algorithm functions as a candidate for possible item combinations, then tests whether the combination meets the minimum support and minimum confidence parameters which are the threshold values ​​given by the user, so that it finds patterns in the form of products that will often be purchased together or products that tend to appear together in a transaction.\r\n \r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i6.7823"
    },
    {
        "id": 9803,
        "title": "Forecasting occupational safety performance and mining text-based association rules for incident occurrences",
        "authors": "Abhishek Verma, Krantiraditya Dhalmahapatra, J. Maiti",
        "published": "2023-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ssci.2022.106014"
    },
    {
        "id": 9804,
        "title": "Online education big data mining method based on association rules",
        "authors": "Na Zhang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijict.2024.137931"
    },
    {
        "id": 9805,
        "title": "Association Rules Mining of Solar-assisted Air Source Heat Pump Systems",
        "authors": "Yin-Bing Sun, Hui Li, Xiang-Yu Gao",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciea58696.2023.10241862"
    },
    {
        "id": 9806,
        "title": "Analysis of Stunting Factors in Toddlers Using Data Mining Method the Apriori Algorithm",
        "authors": "Rofi Abul Hasani, Muhammad Resa Yudianto, Pristi Sukmasetya",
        "published": "2024",
        "citations": 0,
        "abstract": "Stunting is one of the developmental problems in children which is influenced by many factors. Experts of nutrition mention several influencing factors such as nutrition during pregnancy, the mother's knowledge about nutrition, limited access to services, and inadequate access to sanitation and water hygiene. These patterns will be analyzed using a data mining method. In this study, 557 stunting data in Jakarta will be analyzed. The data mining method used is the association rule with the a priori algorithm. The steps taken are to perform data cleaning, data integration, data transformation, data mining, and pattern evaluation. There are many attributes in the data studied, but it is determined that several attributes are appropriate to obtain optimal results. The attributes taken are adjusted to research from the health sector. The test results produce several association rules. From all the association rules obtained using the Apriori algorithm, it is taken that meets a minimum support of 0.2 and a minimum confidence of 0.5. There is a result of 73% of the total meeting the minimum support and confidence. So that the results of the association rules can be used by health experts and stakeholders as a reference in determining policy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202450001006"
    },
    {
        "id": 9807,
        "title": "Implementasi Data Mining Pada Pola Penjualan Ulos Dengan Menggunakan Metode Apriori",
        "authors": " Femmy Fitria",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Seiring dengan berkembangnya teknologi informasi yang semakin hari semakin maju, membuat semakin berkembang pula kemampuan dalam menyelesaikan masalah yang ada. Dalam pola penjualan pada Graha Ulos Songket Medan masih banyak kendala yang sering terjadi. Salah satunya yaitu dalam pengumpulan data transaksi pola penjualan masih tergolong manual sehingga mengerjakannya membutuhkan waktu yang lama. Untuk mengatasi masalah yang terjadi, diperlukan data mining dengan metode Algoritma Apriori untuk pola penjualan ulos tersebut. Dengan hasil penelitian tersebut di harapkan dapat memudahkan karyawan untuk melakukan pengumpulan data transaksi pola penjualan pada Graha Ulos Songket Medan. Pada studi ini dihitung melalui tiga tahap iterasi pembentukan kandidat k-itemset. Aturan yang terbentuk dapat digunakan pengelola bisnis Graha Ulos Songket Medan untuk pengambilan keputusan dalam usaha meningkatkan nilai penjualan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/comforch.v2i3.847"
    },
    {
        "id": 9808,
        "title": "Application of Apriori Algorithm in Digital Financial Risk Information Management System",
        "authors": "Qisheng Guo",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245410"
    },
    {
        "id": 9809,
        "title": "Mining Association Rules for Classification Using Frequent Generator Itemsets in arules Package",
        "authors": "Abdeldjalil Ledmi, Chafia Kara Mohamed, Mohammed El Habib Souidi, Michael Hahsler, Makhlouf Ledmi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.10050487"
    },
    {
        "id": 9810,
        "title": "Classification based on Association Rules: Complexity and Interestingness Guided Algorithm",
        "authors": "Carlos Molina, Belén Prados-Suárez",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10253036"
    },
    {
        "id": 9811,
        "title": "Prediction of Maintenance Activities Using Generalized Sequential Pattern and Association Rules in Data Mining",
        "authors": "Abbas Al-Refaie, Banan Abu Hamdieh, Natalija Lepkova",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "This study proposed a data mining framework for predicting sequential patterns of maintenance activities. The framework consisted of data collection, prediction of maintenance activities with and without attributes, and then the comparison between prediction results. In data collection, historical data were collected regarding maintenance activities and product attributes. The generalized sequential pattern (GSP) and association rules were then applied to predict maintenance activities with and without attributes to determine the frequent sequential patterns and significant rules of maintenance activities. Finally, a comparison was performed between the sequences of maintenance activities with and without attributes. A real case study of washing machine products was presented to illustrate the developed framework. The results showed that the proposed framework effectively predicted the next maintenance activities and planning preventive maintenance based on product attributes. In conclusion, the data mining approach is found effective in determining the maintenance sequence that reduces downtime and thereby enhancing productivity and availability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13040946"
    },
    {
        "id": 9812,
        "title": "Application of Apriori Algorithm in the Development of Hotel Management Information",
        "authors": "Peifeng Zhu",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "The Apriori algorithm can effectively improve the efficiency and quality of the same time help accelerate the construction of smart hotels. Starting from understanding the application advantages of Apriori technology in the teaching of hotel management in higher vocational colleges, combining teaching cases to explore its specific application methods, and committed to giving It is hoped that the reports and related data generated by the evaluation system can be freely used by users, and users can operate and calculate the obtained data by themselves. higher vocational colleges. The thesis mainly discusses the information development and construction of the hotel management major courses in universities, taking the information development and construction of the marketing courses in this major as an example to carry out innovative applications of teaching reforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1204.1007"
    },
    {
        "id": 9813,
        "title": "Market Analysis System Based on Apriori Algorithm",
        "authors": "Shangqin Zhou",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3594409.3594428"
    },
    {
        "id": 9814,
        "title": "Retracted: Information Reconstruction of Student Management Work Based on Association Rules Mining",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9842749"
    },
    {
        "id": 9815,
        "title": "Mining significant local spatial association rules for multi-category point data",
        "authors": "Fei Cai, Jie Chen, Telin Chen, Banghua Zhang, Wenping Fan",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e25047"
    },
    {
        "id": 9816,
        "title": "Research on Diversified Communication Model of Cultural Intelligent Communication Platform Based on Association Rules Mining",
        "authors": "Junjun Zhang, Haoran Mo",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecice59523.2023.10383098"
    },
    {
        "id": 9817,
        "title": "687-P: Risk Patterns for Suicide Attempts among People with Diabetes Using Association Rules Mining",
        "authors": "PLOYPUN NARINDRARANGKURA, PATRICIA ALAFAIREET, UZMA Z. KHAN, MIN KIM",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Prevalence of suicide attempts among people with diabetes was approximately 10%, higher than the general population (&lt;5%). This is the first study using association rules mining to discover the risk patterns for suicide attempts in people with diabetes using large multi-centered EHR data. We retrieved data on 3,265,041 diabetes patients from 2010-2020, and 0.2% had a record of suicide attempts. Figure 1 shows the visualization of the top ten association rules. The first rule, {benzodiazepines, no. antidepressants ≥2} ≤ {suicide=Yes}, Support=0.19, Confidence=0.87, means “19% of patients had a record of benzodiazepines, the number of antidepressants ≥2 and suicide attempts together.” In addition, “87% of patients with benzodiazepines and the number of antidepressants ≥2 also had a record of suicide attempts.” We found new findings related to suicide attempts in people with diabetes, including the use of benzodiazepines, atypical antipsychotic agents, two and more antidepressants, none or one diabetes medication, and white in the race. Further studies are needed to validate the results and investigate the causality of suicide attempts and diabetes. Our results can be explainable and practically used by providers during outpatient clinic visits.\n\nFigure 1. Visualization of the top ten association rules represented by circles. Darker color denotes higher confidence, and a larger circle means greater support.\n\nDisclosure\nP.Narindrarangkura: None. P.Alafaireet: None. U.Z.Khan: None. M.Kim: None.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2337/db23-687-p"
    },
    {
        "id": 9818,
        "title": "An Apriori algorithm-based association rule analysis to identify acupoint combinations for treating uremic pruritus",
        "authors": "Ping-Hsun Lu, Chien-Cheng Lai, Ling-Ya Chiu, I-Hsin Lin, Chih-Chin Iou, Po-Hsuan Lu",
        "published": "2024",
        "citations": 0,
        "abstract": "\nObjective:\nUremic pruritus (UP) is a prevalent and troublesome condition affecting individuals with end-stage renal failure, which results in intense pruritus, depression, as well as poor quality of sleep, significantly impacting their quality of life. According to previous studies, acupuncture and acupoint stimulation have been shown to provide additional benefits in treating UP in dialysis patients. In addition, using acupoints combination may yield superior effectiveness compared to utilizing a singular acupoint. To investigate the potential correlations between acupoint combinations, an association-rule analysis was employed.\n\n\nMaterials and Methods:\nApriori algorithms stand out as highly potent techniques for identifying associations in databases; this study utilized an association rule mining to examine the association rules of key acupoint groupings that could be employed for treating UP.\n\n\nResults:\nThe analysis utilized information derived from the meta-analysis encompassing 40 randomized controlled trials that used acupuncture to treat UP. In total, 64 acupoints were analyzed, and 71 association rules were found. The following acupoint combinations: Auricular shenmen (TF4), Quchi (LI11), and Geshu (BL17); Auricular heart (Extra14), Sanyinjiao (SP6), and Auricular lung (CO14); and Auricular heart (Extra14), Xuehai (SP10), and Auricular lung (CO14) showed the strongest associations.\n\n\nConclusion:\nAcupoints involving Auricular shenmen (TF4), Quchi (LI11), Geshu (BL17), Auricular heart (Extra14), Sanyinjiao (SP6), Auricular lung (CO14), and Xuehai (SP10) can be regarded as the core combination of acupuncture points for managing UP.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/tcmj.tcmj_217_23"
    },
    {
        "id": 9819,
        "title": "Penerapan Data Mining untuk Analisa Pemilihan Genre Film menggunakan Algoritma Apriori",
        "authors": "Alfina Damayanti, Gusmelia Testiana",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Situs imdb.com adalah salah satu sumber data film terbesar dan paling terpercaya yang menyediakan informasi tentang film-film dari berbagai genre. Dari jutaan data film yang pada situs imdb.com, terdapat beberapa genre yang paling sering digunakan, diantaranya action, adventure, animation, comedy, dll. Penerapan data mining bertujuan mempermudah mencapai tujuan dengan menggunakan algoritma Apriori. Algoritma Apriori dipilih untuk menentukan aturan asosiasi untuk menganalisis genre film apa yang cocok untuk pengunjung website imdb.com berdasarkan genre film yang pernah ia kunjungi.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.33557/jbkom.v5i1.2430"
    },
    {
        "id": 9820,
        "title": "A Cloud Exhibition Hall System of Extended Reality Using Apriori Algorithm",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2024.070312"
    },
    {
        "id": 9821,
        "title": "Data Mining Implementation For Product Transaction Patterns Using Apriori Method",
        "authors": "Galih Wasito Aji, Putri Aisyiyah Rakhma Devi",
        "published": "2023-1-4",
        "citations": 0,
        "abstract": "In the era of information technology, entrepreneurs must have a good marketing strategy so that profits do not decrease. The decline in profits is happening at fast food restaurants for example fast food restaurants in Gresik city. This is due to the incompatibility of products sold with customers in Gresik city. Many promos given by marketing didn’t go well, resulting in sales targets not being achieved. To overcome this, good sales data analysis is needed to get products that match with type of customer. Using data mining with the Apriori algorithm is very appropriate for looking customer purchasing patterns. Association rules that are formed with support and confidence as benchmarks provide, a good reference regarding customer purchasing patterns. Research at fast food restaurant in Gresik was conducted by taking transaction data from September 2021 - September 2022 totaling 48,750 transactions with 134 transactions/day. The results of the research are customer buying patterns that are formed in 10 rules with highest percentage. The best rules that can be the best promos is: if customers buy Rice then buy Drinks with 11,19% support and 68,1% confidence. From the results of research that has been done, customer purchasing patterns have been obtained and can be used as a reference by marketing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i1.12071"
    },
    {
        "id": 9822,
        "title": "A novel algorithm weighting different importance of classes in enhanced association rules",
        "authors": "Petr Máša, Jan Rauch",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2024.111741"
    },
    {
        "id": 9823,
        "title": "Application of the Apriori Algorithm to Purchase Patterns",
        "authors": "Ferry Putrawansyah Fey",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "The purpose of this research is to produce an Apriori Algorithm application system to increase sales turnover at Viona stores. The problem faced by the Viona store is that the Viona store has decreased turnover in the midst of business competition because it has not been able to optimally analyze the products that are often purchased and the combination of purchases by consumers so that sales seem monotonous and do not have a business strategy to attract customers. sales that can attract consumers. One way is to make sales with sales packages at lower prices. It must have a good pattern and analysis to be able to combine products into a sales package. However, with the limited ability of Information Technology, in this study a sales application was built that applies the a priori algorithm. This a priori algorithm is very effective in finding the relationship pattern of one or more itemsets in a large data set so that it is effective in calculating a sales transaction data and finding patterns of combinations of consumer habits and being able to quickly create product sales packages. increase sales turnover. The results of the process of applying the a priori algorithm to sales data at the Viona Store through the RapidMiner application are the same as the results applied to the system built and using sales transaction data for the month of May 2022 using a minimum support of 30% and minimum confidence of 30%. So from this study, information was obtained that the items that were often purchased together during this May period were lighters and cigarettes with 100% Confidence. And for the month of June Viona Stores can recommend packages in their store by looking at the results of a combination of 3 items, which are later expected to increase sales turnover at Viona Stores.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i2.3105"
    },
    {
        "id": 9824,
        "title": "Analysis and research on library user behavior based on apriori algorithm",
        "authors": "Xiaoying Zhang, Jian Zhang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100802"
    },
    {
        "id": 9825,
        "title": "Air Quality Correlation Analysis Based on Apriori Algorithm",
        "authors": "Shaohui Yan, Shuai Kang",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "In recent years, air pollution has become an environmental issue of global concern. It not only affects human health, but also causes serious damage to the Earth's ecosystem. By analyzing the concentration values of various pollutants in the air and the air quality index (AQI) every hour, the most relevant components to the AQI can be identified. In this paper, Apriori association rule algorithm is applied to correlate various data in air quality monitoring to provide a new reference solution for solving environmental pollution problems in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/srhzpz06"
    },
    {
        "id": 9826,
        "title": "Association Rules Algorithm Based on Dual Support and Compression Matrix",
        "authors": "Suzhi Zhang, Haidi Fan, Pu Li, Xiang Lin",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291997"
    },
    {
        "id": 9827,
        "title": "MARCMV: Mining Multi-View Association Rules from  Clustered Multi-Views",
        "authors": "Shadi AL SHEHABI, Meltem YILDIRIM IMAMOGLU",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Data mining involves examining vast quantities of data to uncover valuable insights that can be utilized for making informed decisions and driving business objectives. The study focuses on the task of finding relationships between features belonging to two different views using multi-view model, and proposes a novel approach called MARCMV. This approach extracts multi-view association rules from different views of the same data set using multi-clustering neural model. The study finds that MARCMV outperforms conventional symbolic methods in terms of association rule quality and running time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22399/ijcesen.1292987"
    },
    {
        "id": 9828,
        "title": "Data Mining Menggunakan Algoritma Apriori Dalam Menentukan Tarif Pajak Penghasilan Di Oenity",
        "authors": "Hafiz Rodhiy, Zulham Sitorus",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "Thel Oelnity tax consulting officel is onel of thel companiels that havel a lot of data on goods, data-data, and transaction data elvelry day. In gelnelral, thel Oelnity tax consulting officel only usels this data for relporting purposels only. Tax transaction data collelcteld and storeld can providel uselful knowleldgel for company managelmelnt in carrying out elfforts rellateld to tax increlasels, for elxamplel in telrms of deltelrmining tax financel stratelgiels and supporting delcisions for thel company. Consumelrs who apply for thel procelss of deltelrmining incomel tax ratels usually havel relasons why thely choosel a tax data calculation systelm from a tax consultant rathelr than managing it thelmsellvels. Belcausel tax consultants can providel what thely want, such as convelnielncel, accuracy, speleld, and nelatnelss of incomel tax calculations. Many consumelrs complain about thel incomel tax ratel calculation systelm, whelrel thel layout, making it difficult for consumelrs to gelt thel final tax relsults thely neleld, will also spelnd quitel a long timel just to find thel total incomel tax ratel. Thel Apriori algorithm is onel of thel most frelquelntly useld typels of data analysis in thel world of data procelssing. This analysis procelss is to analyzel thel numbelr of businelssels and thel amount of consumelr incomel by finding associations beltweleln lists of taxels that must bel paid. Thel Apriori algorithm is useld to arrangel itelm layouts and group itelms. From thel relsults of systelm implelmelntation, it was concludeld that using thel Apriori Algorithm melthod can hellp thel procelss of finding incomel tax ratels for elach consumelr data.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bit.v4i2.673"
    },
    {
        "id": 9829,
        "title": "Mining association rules for classification using frequent generator itemsets in arules package",
        "authors": "Makhlouf Ledmi, Mohammed El Habib Souidi, Michael Hahsler, Abdeldjalil Ledmi, Chafia Kara Mohamed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.131399"
    },
    {
        "id": 9830,
        "title": "PENERAPAN DATA MINING PADA TRANSAKSI PENJUALAN MENGGUNAKAN ALGORITMA APRIORI DI ALFAMART CENTRE PARK",
        "authors": "Martinus Zega, Rahmat Fauzi",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "Along with the development of the economy from year to year, the retail industry is one of several industries that is experiencing quite good development, one of which is PT Sumber Alfaria Trijaya Tbk. or commonly known as Alfamart. Marketing activities at Alfamart that focus on buying and selling food and non-food goods with a large enough number of transactions in total daily sales, a company needs analytical tools to provide useful information for the company. Because Alfamart is a large-scale retail company, there are several problems that are often encountered daily, namely determining the layout of goods that are less strategic and easily noticed by customers, not knowing which products are most often purchased simultaneously by consumers and several types of goods in an overstock warehouse. Therefore, research was carried out with the implementation of data mining on sales at Alfamart using the Apriori algorithm and testing using the Rapidminer software to produce the highest association rules. The results of this study are the discovery of 10 association rules with a minimum support of 40% and 70% confidence which are expected to be recommendations for business actors to improve sales strategy.\r\n \r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i5.7783"
    },
    {
        "id": 9831,
        "title": "Implementasi Data Mining Menggunakan Algoritma Apriori Untuk Menemukan Frequent Itemset  Penjualan Sneakers",
        "authors": "Topan Setiawan",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "Every small or large company that wants to stay afloat in an increasingly fierce business competition requires the right sales strategy, including at the Yasa Collection Sport Store. One way is to perform data mining analysis on the sales transaction database using the a priori algorithm of the association rule method. This method makes it possible to find combinations of items that often (often) appear from a collection of items (itemset), so that store management knows market conditions, consumer tastes and sales patterns. Based on the results of research and data analysis conducted with a minimum support value of 0.33 and a minimum confidence value of 0.80, three association rules were obtained, in which the frequent itemset information that had been found using the a priori algorithm, could be utilized by the store management in determining sales strategies, such as discount promotion, packaging and stocking goods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32627/aims.v6i2.786"
    },
    {
        "id": 9832,
        "title": "Improvement of Apriori Algorithm and its Application in College Students PE Online Teaching System Platform",
        "authors": "Yu Li",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235139"
    },
    {
        "id": 9833,
        "title": "An Approach of Improved Traversal Merging of Transaction Data for Faster Apriori Algorithm",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070810"
    },
    {
        "id": 9834,
        "title": "Algorithm for Assisting Grammarians when Extracting Phonological Conditioning Rules for Nguni languages",
        "authors": "Zola Mahlaza, Langa Khumalo",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55492/dhasa.v5i1.5013"
    },
    {
        "id": 9835,
        "title": "IMPLEMENTATION OF ASSOCIATION RULES USING APRIPORI ALGORITHM FOR ANGKRINGAN",
        "authors": "Wiji Lestari, Herliyani Hasanah, Rudi Susanto",
        "published": "2023-9-23",
        "citations": 1,
        "abstract": "Angkringan is a culinary business that is often found, especially in Surakarta and Yogyakarta in particular and Central Java in general. Most angkringan include small and medium enterprises (SMES). Food and drink merchandise mapping is an important thing in angkringan. In this research, food and drink mapping was carried out at several snack bars in Jebres sub-district, Surakarta city using word clouds and the Apriori algorithm. The word cloud will produce the dominant food and beverage itemsets which will then be processed using the Apriori algorithm. The results of mapping with the Apriori algorithm for food yield support(tempeh) = support (tofu) = 95 which is the highest. Relationship value between dominant itemsets: Confidence(tempeh, tofu→satay, milkfish rice, quail egg, bakwan) = 21. Results for drinks have the highest support value for tea, support(tea) = 100. Relationship value between dominant itemsets: Confidence(tea → coffee, milk, ginger) = 15.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47701/icohetech.v4i1.3425"
    },
    {
        "id": 9836,
        "title": "A Collaborative Filtering Algorithm for Improving Similarity Based on Probability Weighted Association Rules",
        "authors": "Wang Yingbo, Wang Lijun",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca60615.2024.10471070"
    },
    {
        "id": 9837,
        "title": "Retracted: Integration and Recommendation of Multimedia Network-Assisted English Instructional Resources Based on Association Rules Mining",
        "authors": "",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9790252"
    },
    {
        "id": 9838,
        "title": "PENERAPAN DATA MINING UNTUK MENENTUKAN TATA LETAK PRODUK DENGAN MENGGUNAKAN ALGORITMA APRIORI Studi Kasus: ALFAMART CABANG MERUYA",
        "authors": "Hernalom Sitorus",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "Data mining merupakan proses untuk mendapatkan informasi yang berguna dari gudang basis data yang berupa ilmu pengetahuan. penelitian ini melakukan analisa data dengan menggunakan data mining dan metode algoritma apriori. Sistem yang dibangun ditujukan untuk pemenuhan dalam penentuan pola pembelian obat dengan menggunakan bahasa pemrograman PHP dan database Mysql pada studi kasus di alfamart. Sistem ini dibangun berdasarkan kebutuhan pengguna yang diperoleh melalui metode wawancara dan studi lapangan. Metodelogi pengembangan sistem yang digunakan yaitu metode waterfall yang terdiri Analisis, Desain, Pengkodean dan Pengujian. Hasil pengujian dengan algoritma apriori dan sistem yang dibangun menunjukan hasil yang telah memenuhi kebutuhan dalam penentuan tata letak produk berdasarkan kecenderungan pembelian makanan oleh pelanggan. Dibandingkan dengan sistem yang sedang berjalan kinerja tersebut ditunjukan pada efektifitas informasi dari sistem tentang penentuan tata letak prouk untuk ketersediaan makanan untuk memudahkan dalam mengetahui keberadaan obat yang dilihat dari 2 itemset obat.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59134/jsk.v4i1.402"
    },
    {
        "id": 9839,
        "title": "Incremental Benefits of Green Building Energy Efficiency Model Based on Apriori Algorithm",
        "authors": "Xiaoqian Liu, Jing Zhang",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc58445.2023.10200468"
    },
    {
        "id": 9840,
        "title": "Cluster Evaluation of Accounting COMET Professional Ability Training Based on Apriori Algorithm",
        "authors": "Ning Lei, Sha Fei",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245089"
    },
    {
        "id": 9841,
        "title": "Apriori algorithm applied in job forecasting with elective tracking",
        "authors": "Cherry Rose V. Concha, Aleta C. Fabregas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0162456"
    },
    {
        "id": 9842,
        "title": "Opinion Mining on E-commerce Live Broadcast of Agricultural Products Based on WLDA-Apriori Model",
        "authors": "Binghao Wang, Yifan Wang, Zeqi Wang",
        "published": "2023-5-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/mipro57284.2023.10159931"
    },
    {
        "id": 9843,
        "title": "A Multi-Level Association Rule Mining Algorithm Based on NSGA-II for Market Basket Analysis",
        "authors": "Zhenmin Wang",
        "published": "2023-5-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictc57116.2023.10154677"
    },
    {
        "id": 9844,
        "title": "Prediksi Pembelian Barang Pada Distributor Lampu Menggunakan Metode Apriori pada PT. XYZ",
        "authors": "Rudolfo Rizki Damanik, Moyo Hady Poernomo",
        "published": "2023-2-27",
        "citations": 1,
        "abstract": "Apriori is an algorithm that is widely used to determine the pattern of relationships between products that are often bought together in a store. This Apriori algorithm will be suitable to be applied in the field of determining strategy or promotion. PT. XYZ is one of the Lighting Distributor Companies. One of the problems of the company is the imbalance of stock in the warehouse. So, the purpose of this research is to obtain product purchase predictions from suppliers to maintain stock balance with product solds to customers. The object of this research is the application of apriori algorithm. This research data is in the form of sales transaction data at PT. XYZ. Data analysis using RapidMiner Software by determining the valure of support and confidence. The analysis shows that there are 22 Association Rules with a minimum support 20% and a minimum confidence 50%. This information is excpected to help the company in developing a product purchasing strategy from the supplier.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54259/jdmis.v1i1.1500"
    },
    {
        "id": 9845,
        "title": "Research and Analysis of College Students’ Selection of Tourist Attractions Based on Apriori Algorithm",
        "authors": "青青 曹",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/mm.2024.142033"
    },
    {
        "id": 9846,
        "title": "IMPLEMENTASI DATA MINING MINAT CUSTOMER TOKO DURIAN KIMHUI DENGAN ALGORITMA APRIORI",
        "authors": "Vincentsius Oliver Bryan Bryan, Koko Handoko Handoko",
        "published": "2023-9-9",
        "citations": 0,
        "abstract": "Tanaman durian adalah tanaman perkebunan yang berasal dari negara yang beriklim tropis. Tanaman durian ini sangat berpotensi untuk dikembangkan yang didukung oleh beberapa faktor seperti minat yang tinggi terhadap buah durian, Tanjung Batu merupakan produksi dari tanaman durian yang di ambil bibitnya dari negara Malaysia langsung dan ditanam di pulau Tanjung Batu, orang Batam sangat mengenal durian yang berasal dari Tanjung Batu dikarenakan rasa dan buahnya hampir sama persis seperti buah yang ditanam di negara Malaysia jenis - jenisnya sama seperti yang ada di negara Malaysia itu sendiri hanya berbeda tempat ditanamnya saja banyak orang batam yang membeli bibit durian dari Malaysia untuk ditanam dikarenakan ada yang hobby ada juga yang ingin memulai bisnis buah durian, dengan objek penelitian durian peneliti melakukan observasi terhadap penjualan durian dengan menggunakan metode algoritma apriori dibantu dengan software Rapidminer dan peneliti akan mendapatkan hasil dari perhitungan penjualan yang paling banyak diminati dan dicari oleh konsumen yaitu didapati jenis durian Musangking yang paling banyak diminati oleh konsumen karena durian Musangking memiliki rasa yang berbeda diantara durian lainnya dan juga musangking memiliki warna daging yang cantik oleh karena itu durian musangking memiliki banyak peminat, dan juga durian musangking mendapatkan nilai yang paling tinggi dalam perhitungan di aplikasi tersebut yaitu mendapatkan 100% nilai support tertinggi.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i1.7569"
    },
    {
        "id": 9847,
        "title": "Carbon reduction assessment of public buildings based on Apriori algorithm and intelligent big data analysis",
        "authors": "Xu Shen",
        "published": "2023-5-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08405-4"
    },
    {
        "id": 9848,
        "title": "Incremental association rules update algorithm based on the sort compression matrix",
        "authors": "Qian Zhang, Jianguo Wang",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Association rule algorithm has always been a research hotspot in the field of data mining, in the context of today’s big data era, in order to efficiently obtain association rules and effectively update them, based on the original fast update pruning (FUP) algorithm, an association rule incremental update algorithm (FBSCM) based on sorting compression matrix is proposed to solve the shortcomings of frequent scanning of transaction datasets. Firstly, The algorithm maps the transaction dataset as a Boolean matrix, and changes the storage mode of the matrix(that is, adding two columns and a row vector); Secondly, the matrix is compressed many times during the generation of frequent k-itemset; After that, the items in the matrix are sorted incrementally according to the support degree of the itemset; Finally, the original string comparison operation is replaced by the vector product of each column of the matrix. Experimental results and analysis show that the FBSCM algorithm has higher temporal performance than the traditional FUP algorithm in different incremental dataset sizes, different minimum support thresholds and different feature datasets, especially when the incremental transaction volume is large or the minimum support degree is small.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-231252"
    },
    {
        "id": 9849,
        "title": "Retracted: Design of English Interactive Teaching System Based on Association Rules Algorithm",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9765685"
    },
    {
        "id": 9850,
        "title": "Intelligent Control Algorithm of Coal-fired Management System in Thermal Power Plant Based on Improved Association Rules",
        "authors": "Jing Sun, Jinyu Wei",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00125"
    },
    {
        "id": 9851,
        "title": "Data-Mining Modeling of Corruption Perception Patterns Based on Association Rules",
        "authors": "Andrii Bozhenko, Dariusz Krawczyk, Karolina Hałuszko, Valerii Ozarenko",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Corruption is one of the many challenges facing Ukrainian society. After the full-scale war, 89% of Ukrainian citizens consider corruption to be the most serious problem for the stable development of Ukraine. In the article, it is argued that neglecting the problem of corruption in society leads to a decrease in the level of trust in public authorities, economic losses, a decrease in the country’s investment attractiveness, a loss of trust from international partners, as well as other economic and political turbulences. The study aims to develop an economic and mathematical model for determining the patterns of corruption perception in Ukraine based on association rules implemented using data mining methods. The Python Numerical Python library was used to build association rules. The study of the patterns of corruption perception was analysed in terms of the legislative (based on the activities of the Verkhovna Rada of Ukraine), judicial (based on the activities of the courts) and executive (on the example of the activities of the President and his Office) branches of government. The source of primary data was the data of a survey conducted by the “Join!” Public Participation Support Program together with the USAID project “Support for Leader Organizations in Combating Corruption in Ukraine”. 38 association rules were determined for the judicial system, among which the most informative consequences were “distrust in the judicial system” and “corruption is widespread in the courts”. For the executive branch of government, 27 association rules were built, where the informative consequence was “citizens can influence, namely participate in public councils or public hearings to monitor state institutions and their decisions”. For the legislative branch, 33 association rules were formed, where the informative consequence was “citizens can influence, namely participate in public councils or public hearings to monitor state institutions and their decisions”. According to the empirical calculations, a regularity was found that Ukrainian society is democratic and believes in its power to overcome corruption in any branch of government, but members of society do not show active desire and only revolutionary manifestations are possible in a critical situation. The Verkhovna Rada of Ukraine can use the results obtained during the improvement of Ukrainian legislation, the Cabinet of Ministers of Ukraine when approving the State Program for the Implementation of the Anti-Corruption Strategy and other state bodies in developing anti-corruption programs at various levels.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61093/bel.7(4).181-189.2023"
    },
    {
        "id": 9852,
        "title": "A multilevel comprehensive fuzzy evaluation algorithm for highway route schemes considering operating speed and association rules",
        "authors": "Yanjun Chen",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3024071"
    },
    {
        "id": 9853,
        "title": "Service Resources Mining Based on Association Rules",
        "authors": "Ruiting Qu, Lin Qiao, Qing Song, Yuanqi Yu, Zhenjiang Lei, Ran Ran, Haomiao Wang, Tianbo Wang",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsc59305.2023.00090"
    },
    {
        "id": 9854,
        "title": "PERANCANGAN APLIKASI DATA MINING UNTUK MENGANALISA PRODUK KOSMETIK DAN KECANTIKAN MENGGUNAKAN ALGORITMA APRIORI PADA PT RAJAWALI MUTIARA SEJAHTERA",
        "authors": "Zul Kifli",
        "published": "2023-8-13",
        "citations": 0,
        "abstract": "Dalam dunia bisnis penjualan kosmetik dan kecantikan strategi dalam pemasaran produk merupakan bagian yang penting untuk menunjang kelangsungan bisnis. PT Rajawali Mutiara Sejahtera adalah distributor yang melayani penjualan seluruh indonesia tentu membutuhkan strategi yang tepat dalam pemasaran penjualan produk. Salah satu cara dalam mencari informasi barang apa yang sering dibeli konsumen secara bersamaan yang terdapat dalam data transaksi penjualan barang adalah dengan menggunakan teknik Data Mining. Teknik Data Mining yang digunakan menggunakan Algoritma Apriori, yaitu mencari aturan asosiasi untuk menentukan hubungan kombinasi antar item barang yang dijual. Tujuan penelitian ini adalah mendapatkan informasi tentang barang apa yang sering dibeli konsumen secara bersamaan. Metode pengembangan sistem yang digunakan adalah Rapid Aplication Development (RAD) dengan pemodelan menggunakan Unified Modeling Language (UML). Hasil yang didapatkan adalah berupa aplikasi Data Mining menggunakan algoritma Apriori untuk mengetahui kombinasi antar item barang yang di beli secara bersamaan dengan menentukan nilai minimum support dan minimum confidence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59134/jsk.v1i1.423"
    },
    {
        "id": 9855,
        "title": "An Explorative Analysis of Innovation Activities in the Agricultural Sector: An Association Rule Mining Algorithm Approach",
        "authors": "Yasser Buchana",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4438393"
    },
    {
        "id": 9856,
        "title": "Data Mining Penerapan Asosiasi Apriori Dalam Penentuan Pola Penjualan",
        "authors": "Firdo Andri Saputra, Agus Iskandar",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Penjualan merupakan hal yang tak terpisahkan dari kehidupan sehari-hari, di mana setiap orang secara rutin melakukan transaksi jual beli yang berdampak besar bagi pertumbuhan ekonomi. Bagi para pebisnis yang bergerak di bidang penjualan, seperti pemilik coffee shop, strategi untuk meningkatkan jumlah penjualan dan laba menjadi hal krusial. Dengan aktivitas transaksi harian yang terus meningkat, data penjualan tersebut bukan sekadar arsip biasa, melainkan memiliki potensi untuk diolah menjadi informasi berharga guna meningkatkan penjualan. Namun, seringkali terjadi masalah ketika stok item yang diinginkan oleh konsumen tidak tersedia atau habis karena kurangnya pengelolaan stok yang baik oleh karyawan coffee shop. Akibatnya, data transaksi penjualan yang ada hanya terabaikan dan tidak dimanfaatkan secara optimal, menyebabkan kerugian karena persediaan menu tidak terkontrol dengan baik. Sebaliknya, data transaksi sebelumnya dapat digunakan untuk mengidentifikasi pola pembelian pelanggan, sehingga dapat diambil kesimpulan bahwa jika pelanggan membeli menu A, kemungkinan besar akan membeli menu B juga. Untuk mengatasi permasalahan tersebut, solusi yang dapat diterapkan adalah memanfaatkan data transaksi penjualan yang telah terkumpul. Data ini mengandung informasi berharga yang bisa digunakan untuk pengambilan keputusan dan memperoleh pengetahuan baru tentang pola penjualan di coffee shop, sehingga pengelolaan persediaan menu dapat lebih terstruktur dan jumlah persediaan menu yang tidak diminati dapat dikurangi. Untuk mencapai persediaan yang ideal, peneliti menggunakan metode Data Mining, khususnya metode Assosiasi dengan Apriori. Namun, pencarian support hanya dilakukan hingga 3 set item tanpa ditemukan kombinasi yang memenuhi batas minimum support, sehingga proses tersebut dihentikan. Untuk melanjutkan pencarian nilai confidence, digunakan gabungan 2 set item (L2) yang memenuhi syarat untuk membentuk asosiasi. Hasil analisis dengan metode ini menghasilkan tiga aturan asosiasi yang berharga untuk meningkatkan penjualan, yaitu \"Jika membeli cappuccino maka akan membeli donat\" dengan confidence 0,65, \"Jika membeli donat maka akan membeli cappuccino\" dengan confidence 0,93, dan \"Jika membeli muffin maka akan membeli cappuccino\" dengan confidence 0,83.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/josyc.v4i4.4043"
    },
    {
        "id": 9857,
        "title": "Intelligent Processing of Power Operation Data Based on Improved Apriori Algorithm",
        "authors": "Xin Zhao, Changda Huang",
        "published": "2024-1-14",
        "citations": 0,
        "abstract": "This paper addresses several problems in the power system. Key challenges include low-power information integration, inappropriate system data management, inaccurate system data updating, and inefficient fault diagnosis. We focus on analyzing and diagnosing transmission line faults using the operation data of the power system. The study incorporates the quantitative identification of statements. This is done using the Apriori big data analysis and calculation method. Additionally, we utilize big data analysis and vast power operation data. We aim to achieve automatic analysis and pinpoint the causes of transmission line faults. Furthermore, we seek to optimize the traditional Apriori calculation method. This optimization results in a reduction of about 52% in the candidate item set calculation. The optimized M-Apriori calculation method can analyze the correlation between event index data and faults in real time, and realize automatic diagnosis and analysis of faults through operation data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/spee1048-5236.43213"
    },
    {
        "id": 9858,
        "title": "ANALISA POLA PEMBELIAN KONSUMEN MENGGUNAKAN DATA MINING DENGAN ALGORITMA APRIORI (STUDI KASUS: EDUKITS BATAM CENTRE)",
        "authors": "Elnas Lowensky, Erlin Elisa",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "The initial research purposes is to do the analyzing of data transaction for one of the stationary stores in Batam city, namely edukits Batam Centre, because the store is a well-known business and of course many consumers are interested, of course, a lot of data has been collected so far. From transactions that have occurred so far, these data are only stored in the form of archive files without being processed or used for future business progress. To analyze this research, the a priori algorithm association rule method was used, by analysing support value and as well as the confidence value that were set so that the results of this study obtained the support value for the Printing Paper category 71%, Accessories 74%, 77%, Other Equipment 88%, Glue and Adhesive 72%. By using the Apriori algorithm, 2 rules are obtained, namely the antecedent value of stationery, the consequent accessories resulting in a support value of 65% and confidence of 84.4%. Then the second rule is the antecedent of accessories, the consequent of writing instruments with a support value of 65% and a confidence value of 88.4%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i2.7608"
    },
    {
        "id": 9859,
        "title": "Research on Network Data Algorithm Based on Association Rules",
        "authors": "Rui Wang",
        "published": "2023-3-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47738/ijiis.v6i2.159"
    },
    {
        "id": 9860,
        "title": "Mining of association rules between students’ behavior and academic achievements",
        "authors": "Chunling Ding, Yunfeng Chen, Yan Chen, Huan Zhou",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2681553"
    },
    {
        "id": 9861,
        "title": "Research on a data mining algorithm based on BERTopic for medication rules in Traditional Chinese Medicine prescriptions",
        "authors": "Hongchen Li, Xinyi Lu, Yujia Wu, Jie Luo",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractBackgroundA data mining algorithm is proposed based on BERTopic to provide new insights into the analysis of medication rules in Traditional Chinese Medicine (TCM) prescriptions.MethodsUsing the BERTopic algorithm, collected TCM prescriptions for corneal diseases are converted to embeddings through a transformer based on the Bidirectional Encoder Representations from Transformers pre‐trained model. Then, Uniform Manifold Approximation and Projection is applied to perform dimensionality reduction in prescription embeddings. Subsequently, Hierarchical Density‐Based Spatial Clustering of Applications with Noise is used for clustering. Finally, class‐based term frequency–inverse document frequency is used to generate several main drug combinations from the clustered results.ResultsThe highest frequency of drugs used included Buddleja officinalis, Bidens pilosa, Angelica sinensis, Eriocaulon buergerianum, and Raw Rehmannia glutinosa. The most frequent drug combinations were “Eriocaulon buergerianum, Raw Rehmannia glutinosa, Prunella vulgaris, Notopterygium incisum” “Lycii Fructus, Bidens pilosa, Buddleja officinalis” and “Kochiae Fructus, Cortex Dictamni.”ConclusionsThe proposed data mining algorithm based on BERTopic demonstrated promising outcomes in the analysis of TCM prescription medication rules. This method exhibited simplicity and efficiency, thereby offering a novel avenue for analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/med4.39"
    },
    {
        "id": 9862,
        "title": "Determining Marketing Strategy to Support Customer Relationship Management with the Apriori Algorithm",
        "authors": "Dheayri Agrema",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "Business competition has forced companies to be more selective in implementing their marketing strategies. This increasingly rapid technological development is an aspect that can be utilized in achieving ease of doing everything. The development of this technology can have a good impact on business people, Customer Relationship Management (CRM) is one of the business strategies to meet the goals of the store. To fulfill these objectives, the authors conducted an analysis of sales transaction data using assistive devices such as data mining. Data mining is part of analytical Customer Relationship Management (CRM) which is used to find patterns in data. By applying the Apriori Algorithm or Association Rule to achieve this business strategy. The Apriori algorithm is a method for finding relationship patterns between one or more items in a dataset. By using sales transaction data at the Rahmat Elektronik Store, it is possible to find out which products are in great demand by customers every time they shop at the Rahmat Elektronik Store. The results of applying the Apriori Algorithm or Association Rule use Minimum Support 5% and Minimum Confidance 50%",
        "keywords": "",
        "link": "http://dx.doi.org/10.35134/jcsitech.v9i2.70"
    },
    {
        "id": 9863,
        "title": "Improved Apriori Algorithm Using Hash Technique",
        "authors": "Sara Tanha, Richard Tirtho Biswas, Tonosree Roy Ritu, Shaheena Sultana",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ncim59001.2023.10212624"
    },
    {
        "id": 9864,
        "title": "CCHP Intelligent Optimization System of Enterprise Incentive Policy Based on Improved Apriori Algorithm",
        "authors": "Liqin Hu, Hong Liu",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmnwc60182.2023.10435935"
    },
    {
        "id": 9865,
        "title": "A Computation of Frequent Itemset using Matrix Based Apriori Algorithm",
        "authors": "Samin Jayaram Vivekanandan, Gurusamy Gunasekaran",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "gunasekaran.cse@drmgrdu.ac.in\r\nThe Apriori Algorithm is a traditional method for determining the frequent itemsets from a lot of data. Association rules can be generated based on frequently occurring item sets. The Apriori algorithm has two bottlenecks, namely that it generates a large number of candidate sets and that it repeatedly examines the database. It takes a long time to execute and takes up a lot of space. We provide a novel strategy called Matrix Based Apriori Algorithm to get beyond the limitations of Apriori Algorithm. We don't need to constantly scan the database because all operations are first applied to the matrix after which the database is converted back into its original form. In addition, we have reduced the potential itemsets by using several pruning techniques. The Matrix Based Apriori algorithm outperforms the standard Apriori algorithm in terms of time, with an average rate of time reduction of 71.5% with the first experiment and 86% with the second. In a similar vein, we contrasted our Matrix Based Apriori with an effective alternative known as improved apriori. We discovered that our method outperforms the upgraded apriori by 20%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52756/ijerr.2023.v30.022"
    },
    {
        "id": 9866,
        "title": "Evaluation of the Path Optimization System for Internally Driving Factors in Employment Based on Apriori Algorithm",
        "authors": "Ke Wang",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276366"
    },
    {
        "id": 9867,
        "title": "Abnormal Node Location Algorithm in Multi-source Heterogeneous Network Based on Association Rules",
        "authors": "Yinghui Ma, Liping Hao",
        "published": "2024-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1520/jte20220717"
    },
    {
        "id": 9868,
        "title": "Using advanced web ontology language properties for deriving novel and consistent association rules",
        "authors": "Eliot Bytyci, Lule Ahmedi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbidm.2024.10051202"
    },
    {
        "id": 9869,
        "title": "Association Rules Mining for Designing Product Bundling Strategy (Study Case at a Cafe in Jakarta)",
        "authors": "Milqi Miftahul Jannah, Yelita Anggiane Iskandar, Ferani Eva Zulvia",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "Cafe X is a modern and prominent coffee shop in town that sells specialty beverage products with a total of 73 variations. Sales transactions that occurred in March 2021 at that Cafe reached an average of 300 times per day. All this time, the transaction data is only used to calculate inventory replenishment and to observe sales profits whereas it can actually be utilized to reveal information related to customer behavior in buying products by finding the association or pattern between product sales. The purpose of this study is to obtain association models between items that can be used as a base to arrange recommendations for selling beverage products at Cafe X using a data mining method, namely the association rules with the Apriori algorithm. The transaction data specified for data processing are payment transactions of a total of 3,100 data records. From the analysis results, it is known that there are 8 product association rules that meet the minimum support of 0.01 and the minimum confidence of 0.5, which means that these rules can be used as an alternative basis for determining business strategy at Cafe X. Based on the association information between products, the customer relationship management (CRM) strategy that can be applied at Cafe X is the promotion strategy of product bundling. From a number of recommended bundled products, it is found that there are opportunities to increase sales for four products, they are MD001, TH002, LB001, and TU001.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31334/logistik.v7i2.3466"
    },
    {
        "id": 9870,
        "title": "Enhancing Multi-Channel Consumer Behavior Analysis: A Data-Driven Approach using the Optimized Apriori Algorithm",
        "authors": " Bijith Marakarkandy",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "Purpose –In the dynamic arena of retail and e-commerce, understanding customer behavior is crucial. This research paper investigates the strategies customers use to balance convenience and cost. It notes that consumers often divide their purchases, choosing online platforms for items they perceive as reasonably priced, while preferring physical stores for products associated with high shipping costs, lack of express shipping, or higher online prices. Traditional retail analysis methods, such as identifying frequently purchased and co-occurring items, are critical to the sector. However, these insights may be skewed if the analysis is solely confined to the online shopping cart, neglecting related purchases made at physical stores either before or after the online transaction. This paper addresses this analytical gap by looking into the complex interplay between online and offline purchases. The objective is to provide a more comprehensive, detailed understanding of multi-channel shopping behaviors, allowing retailers to better cater to their customers' needs and preferences while optimizing their strategies for a more effective market presence. This comprehensive approach attempts to uncover deeper insights into the interactions between online and offline purchases, thereby contributing to a more comprehensive understanding of consumer behavior in the retail and e-commerce industries.\r\nDesign/methodology/approach- A detailed survey questionnaire was administered, obtaining 2465 responses. The questionnaire was specifically designed to capture the complexities of online and offline purchases, with an emphasis on Apple's purchase channels. The Apriori algorithm was used twice to find frequently co-occurring items that were purchased online and then online clubbed with offline. Essential metrics like support and confidence were calculated for both online and offline purchases. To determine any significant differences between the groups, an independent-samples t-test was used. This comprehensive methodology ensures a thorough examination of multi-channel shopping behaviors, providing valuable insights into consumer behavior in the retail and e-commerce sectors.\r\nFindings–We find that cross channel switching in a multi-channel distribution environment occurs due to price differences, convenience and flexibility. The paper illustrates the flaws of drawing inferences with data from a single channel emphasizing the need for a more holistic, multi-channel approach to data analysis in order to capture the full range of consumer behavior.\r\nResearch limitations/implications –\r\nThis study assumes that self-reported purchases or acquisitions of products accurately reflect actual consumer behavior. The insights derived from this research have significant implications for various marketing strategies, including pricing, product bundling, cross-selling, and promotional activities. However, it’s important to note that the reliance on self-reported data may introduce certain limitations, as it may not fully capture the complexity of actual consumer behavior. Despite these limitations, the insights gained from the study will add value for several marketing decisions like pricing, bundling, cross-selling and promotions.\r\nOriginality value– While there is an abundance of literature on the application of Association Rule Mining for Market Basket Analysis, the existing body of work exploring its application within a multi-channel context is notably sparse. This study aims to address this gap in the literature, offering a unique perspective and making a substantial contribution to the existing body of knowledge in this area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1536"
    },
    {
        "id": 9871,
        "title": "Improvement of Apriori Algorithm Performance Using the TID-List Vertical Approach and Data Partitioning",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0430.15"
    },
    {
        "id": 9872,
        "title": "Implementasi Data Mining pada Penjualan Kopi Menggunakan Algoritma Apriori",
        "authors": "Irma Rosmayati, Wahyuningsih Wahyuningsih, Eliya Fatma Harahap, Hani Siti Hanifah",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "Coffee shop pada saat ini banyak diminati oleh masyarakat khususnya remaja karena jenis kopi yang banyak dan penyajian yang menarik. Karena banyaknya penjualan kopi semakin banyak juga data yang menumpuk. Untuk meminimalisir data yang tidak terpakai maka data tersebut diolah menggunakan data mining dengan pendekatan algoritma apriori. Algoritma apriori ini bertujuan untuk membuat rekomendasi kepada pihak coffe shop untuk membuat diskon dan rekomendasi kepada calon pembeli untuk membeli produk yang sering di beli oleh masyarakat. Dataset yang digunakan yaitu data penjualan bulan november tahun 2022. Penerapan data mining terhadap penjualan kopi rule tertinggi muncul pada barang Kopsu Friends dan V60 dengan nilai support 25% dan confidence 83%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33364/algoritma/v.20-1.1259"
    },
    {
        "id": 9873,
        "title": "PENERAPAN DATA MINING PENJUALAN BARANG TOKO BANGUNAN H.UBED MENGGUNAKAN METODE ALGORITMA APRIORI",
        "authors": "Fajrin Sidiq, Gunawan Gunawan",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "Process Sales activities on material goods so that they continue and so the data generated is increasing over time. Larger data will not be useful and useful if left alone. The Apriori Algorithm is one of the methods of Data Mining, namely data collection to determine the highest frequency pattern with the highest data collection and to determine transaction data, calculating the total number of transactions. The use of old data is used to find the results of the sale of the most and the fewest goods. The result of this data mining process is to find items that are often sold simultaneously. One of the benefits of using this method is to facilitate the preparation of goods to be separated in certain places such as items that are often sold. The a priori algorithm method in data mining is very efficient and speeds up the process of combining patterns of sales results from building stores. The data used is data on the sale of goods that are often sold. The list of building materials that have the most stock sold is Cement, White Cement, Sand, Wall Paint, Wood Paint, Ceramics, Wood, Bricks, Nails, Concrete Iron, and Wire",
        "keywords": "",
        "link": "http://dx.doi.org/10.32897/sobat.2023.5.0.3106"
    },
    {
        "id": 9874,
        "title": "Recommendation System of Food Package Using Apriori and FP-Growth Data Mining Methods",
        "authors": "Christofer Satria, Anthony Anggrawan,  Mayadi",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.3.454-462"
    },
    {
        "id": 9875,
        "title": "Image Annotation Optimization Method of Civil Engineering Supervision Based on Association Rule Mining Algorithm",
        "authors": "Ou Kai",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245977"
    },
    {
        "id": 9876,
        "title": "Research on the Application of Association Rule Mining Algorithm on Large Datasets",
        "authors": "Jilin Li, Man Wang",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470774"
    },
    {
        "id": 9877,
        "title": "Using advanced web ontology language properties for deriving novel and consistent association rules",
        "authors": "Eliot Bytyçi, Lule Ahmedi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbidm.2023.134321"
    },
    {
        "id": 9878,
        "title": "Research on fast mining of enterprise marketing investment data based on improved association rules",
        "authors": "Qixing Yin, Xiaosi Xu, Yinghui Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijitm.2023.10057265"
    },
    {
        "id": 9879,
        "title": "Adaptive model fusion algorithm for decision trees and association rules",
        "authors": "Zhang Hui, Zhiling Nie, Hongwei Xiao",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590006"
    },
    {
        "id": 9880,
        "title": "Retracted: Research on Sports Training Decision Support System Based on Improved Association Rules Algorithm",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9764372"
    },
    {
        "id": 9881,
        "title": "Mining residential power consumption behaviour based on association rules",
        "authors": "Fan Li, Yingjie Tian, Yi Wu, Yingying Zhao, Yun Su",
        "published": "2023-4-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672873"
    },
    {
        "id": 9882,
        "title": "ANALISIS DATA MINING PADA PEMILIHAN JENIS GAME TERPOPULER MENGGUNAKAN ALGORITMA APRIORI",
        "authors": " Muhammad Alwi,  Ninis Anggraini,  Rodia",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "Game adalah salah satu hiburan yang sering dipilih oleh masyarakat umum untuk mengisi waktu Game adalah salah satu hiburan yang sering dipilih oleh masyarakat umum untuk mengisi waktu luangnya. Game sendiri memiliki jenis-jenis yang berbeda dan sesuai dengan minat para masyarakat untuk bermain game tersebut. Contoh dari jenis game pada umumnya antara lain MOBA, Strategy, RPG dan beberapa jenis game lainnya yang sering dimainkan oleh masyarakat khususnya pada penggemar game. Dalam penelitian ini akan berfokus pada jenis game yang sangat populer pada kalangan masyarakat dengan menggunakan algoritma apriori sebagai metode analisis. Algoritma apriori dipilih karena dapat mengetahui bentuk pola pada jenis game yang diminati sehingga hasil dari penelitian ini akan dapat bermanfaat bagi industri penjualan game dalam menentukan jenis game yang akan dijual pada toko game maupun platform penjualan game. Dalam penelitian ini akan menggunakan nilai support minimum sebesar 50% dengan nilai confidence minimum sebesar 70%. Hasil penelitian menunjukkan bahwa jenis game Action, Adventure dan RPG menjadi jenis game yang sangat terpopuler dengan nilai kepercayaannya sebesar 82% dan jenis game RPG, Strategy dan Battle.\r\n \r\nKata Kunci— Data mining, game, algoritma apriori, jenis game",
        "keywords": "",
        "link": "http://dx.doi.org/10.21063/jtif.2023.v11.1.9-15"
    },
    {
        "id": 9883,
        "title": "Research on the Weighting Method Based on Tf-IDF and Apriori Algorithm",
        "authors": "En Yang, Zhaohua Long",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciscae59047.2023.10393523"
    },
    {
        "id": 9884,
        "title": "Design Information Systems for Malnutrition Analysis Apriori Algorithm",
        "authors": " Indri Sulistianingsih,  Wirda Fitriani,  Darmeli Nasution",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Malnutrition drives lasting detriments across individual and community wellbeing, requiring data-informed action. Advanced analytics through information systems present pathways for revelatory pattern detection from multidimensional health data. This paper outlines a system design encompassing preprocessing, modeling, analysis and interpretation techniques for mining malnutrition dataset through Apriori algorithm. The core data mining methodology enables extraction of frequencies, associations and prediction rules linking nutritional status parameters and food intake patterns. Custom algorithms filter results to high-confidence associations via statistical measures before expert evaluation. System testing verifies accurate architecture for surfaced dietary risk factors of malnutrition down to village-level. The systemization and computational augmentation of health insight derivation provides a template for needs-based analytics platforms. By targeting analysis to community data, impactful interventions become possible. The potential of customized information systems with data mining at the core is highlighted alongside domain challenges requiring cross-disciplinary impetus. The data-to-decisions system with embedded Apriori pipelines demonstrates applied informatics transforming malnutrition strategy through unveiling actionable patterns within intricacies of public welfare data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61306/ijecom.v2i2.45"
    },
    {
        "id": 9885,
        "title": "Big data analysis on medical field for drug recommendation using apriori algorithm and deep learning",
        "authors": "Sarbani Dasgupta, Banani Saha",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18832-6"
    },
    {
        "id": 9886,
        "title": "Crop Recommendation System Using Improved Apriori Algorithm",
        "authors": "Et al. Satyanarayana Nimmala",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "A crop suggestion system is a technologically advanced tool that helps farmers choose which crops to plant in a certain location or with precise environmental circumstances. These systems use a variety of data sources and analytical methods to give farmers customized crop recommendations. This work presents the Crop Recommendation System Using an Improved Apriori Algorithm, which is an Apriori-based crop recommendation system. The goal of the system is to assist farmers in making well-informed choices about which crops to grow and what fertilizers to use depending on the properties of the soil and environment. With consideration for crop variety, climate, and soil nutrient content, the suggested method is an enhanced version of the Apriori algorithm. Tests of the updated algorithm on a dataset of soil samples from different parts of India revealed that it could correctly suggest the optimal crop. The model's output, association rules, is a suggestion system that farmers can use to boost crop productivity while lowering input costs. The method suggested operates in three phases: In the first stage, preprocessing the data is carried out to gather the input parameters that are crucial for determining the recommendation system. In Stage 2, the recommendation system's association rules are extracted by using an iterative approach to determine the threshold support count and confidence. Stage 3: The recommendation system's knowledge base is formed by pruning the top 8 apriori rules depending on priority. From the experiments, it is evident that the improved apriori algorithm-based extracted recommendation system is an interesting development in precision agriculture that could raise farming practices' sustainability and efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i8.9083"
    },
    {
        "id": 9887,
        "title": "Implementation of Library Automation in an Information Retrieving System Using the Apriori Algorithm",
        "authors": "Dodi Nofri Yoliadi",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Library automation is the process of converting manual systems into digital or electronic ones; it can also be interpreted as the use of machines that act on their own or with self-control without human intervention in the process as a form of application of information technology for the benefit of the library, starting from the acquisition of collections to the enjoyment and access of these collections by users. Library automation is in the form of an information system, where this web-based library information system is expected to provide convenience to both staff and all parties who obtain information about the library without having to go to the library directly, can access it anytime and anywhere, and can answer all the problems that arise. appear. The approach used in this study uses a descriptive qualitative research approach, with the research design using the case study method. In contrast, the case raised is \"Implementation of Library Automation Systems at SMK Negeri 1 Batusangkar\". At the final stage of the research, it can be concluded that the information system created can help the administrator arrange books on a special shelf for books produced through an a priori calculation process. The information system created can provide recommendations to students for books produced through an a priori calculation process based on book categories that are interrelated with other categories.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31958/js.v15i2.8555"
    },
    {
        "id": 9888,
        "title": "Penerapan Data Mining Algoritma Apriori untuk Menemukan Pola Hubungan Status Gizi Balita",
        "authors": "Evi Nurmalasari, Utami Aryanti, Tonton Taufik Rachman",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "Malnutrition of toddlers can cause severely health problems, growth retardation, and decreased intelligence. Therefore, it is important to know the pattern of the relationship between the nutritional status of toddlers, especially against the condition of malnutrition to get information about the possible risk of nutritional coexistence problems. The purpose of this research is to apply data mining using the apriori algorithm in finding patterns of relationships betweennutritional status and to produce an accuracy level of association rules based on the value of support, confidence, and validation with the lift ratio. The results of this study are expected to generate information that can help prevent and treat malnutrition, as well as appropriate nutrition interventions. Analysis and implementation of data using the a priori algorithm method. Manual calculations are carried out using Microsoft Excell and accurate calculations with python programming. Data on the nutritional status of children under five, especially undernourished conditions will be processed to find patterns of association relationships. Determined the minimum support value of 0.1 or 10% and the minimum confidence of 0.5 or 50%. The research produces association rules in the form of association relationship patterns of nutritional status specifically malnutrition conditions (Underweight?Stunting ) with a support of 0.25 or 25% and confidence 0.57 or 57%. The rules have met the minimum support and minimum confidence values and have been validated by the lift ratio with a value &gt; 1.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32627/internal.v6i2.885"
    },
    {
        "id": 9889,
        "title": "IMPLENTASI DATA MINING UNTUK REKOMENDASI PAKET MENU MAKANAN DENGAN MENGGUNAKAN ALGORITMA APRIORI",
        "authors": "Mukti Qamal, Fadli Syah, Az Zura Izmi Parapat",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29103/techsi.v14i1.6747"
    },
    {
        "id": 9890,
        "title": "Apriori algorithm for re-categorization of railway stations",
        "authors": "M. Rani, K. V. Sambasiva Rao",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0148949"
    },
    {
        "id": 9891,
        "title": "Apriori Algorithm Based Exam Information Service Web App Design",
        "authors": "Huaidan Hao, Lu Zhang",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390285"
    },
    {
        "id": 9892,
        "title": "Investigation on Multi-objective Optimization of Construction Engineering Based on Data Mining Association Rule Algorithm",
        "authors": "Shoupu Gu",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc58445.2023.10199690"
    },
    {
        "id": 9893,
        "title": "Customer Churn Prediction Using Apriori Algorithm and Ensemble Learning",
        "authors": "Diaa Azzam, Manar Hamed, Nora Kasiem, Yomna Eid, Walaa Medhat",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/niles59815.2023.10296608"
    },
    {
        "id": 9894,
        "title": "Design and Research of Scientific Research Management System Based on Apriori Algorithm",
        "authors": "Nan Li, Jinsheng Qi",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda60612.2024.10485851"
    },
    {
        "id": 9895,
        "title": "Do users' characteristics really influence the perceived service quality of Multimodal Transportation Hub (MMTH)? An association rules mining approach",
        "authors": "Vivek Chauhan, Akshay Gupta, Manoranjan Parida",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.multra.2023.100069"
    },
    {
        "id": 9896,
        "title": "Association Rules Mining for a Specific Time Period in a Day in Large Transactional Database",
        "authors": "Md. Rabiul Islam, Mst. Sahela Rahman, Md. Julker Nayeem",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict4sd59951.2023.10303523"
    },
    {
        "id": 9897,
        "title": "Classification and variable selection using the mining of positive and negative association rules",
        "authors": "Thanh Do Van, Giap Cu Nguyen, Ha Dinh Thi, Lam Pham Ngoc",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2023.02.068"
    },
    {
        "id": 9898,
        "title": "Penemuan Pola Pergerakan Harga Saham Di Indonesia Pada Masa Pandemi COVID-19 Menggunakan Top K Association Rules Mining",
        "authors": "Chozainurrohmah Safitri, Imam Mukhlas, Mohammad Iqbal",
        "published": "2023-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12962/j23373520.v11i3.83282"
    },
    {
        "id": 9899,
        "title": "Market basket analysis for frequent item sets during festival season at hypermarkets using novel constraint based apriori algorithm with K-means clustering algorithm",
        "authors": "Somu Karthik, S. Ashwini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0176997"
    },
    {
        "id": 9900,
        "title": "Ten simple rules for providing bioinformatics support within a hospital",
        "authors": "Davide Chicco, Giuseppe Jurman",
        "published": "2023-2-23",
        "citations": 1,
        "abstract": "AbstractBioinformatics has become a key aspect of the biomedical research programmes of many hospitals’ scientific centres, and the establishment of bioinformatics facilities within hospitals has become a common practice worldwide. Bioinformaticians working in these facilities provide computational biology support to medical doctors and principal investigators who are daily dealing with data of patients to analyze. These bioinformatics analysts, although pivotal, usually do not receive formal training for this job. We therefore propose these ten simple rules to guide these bioinformaticians in their work: ten pieces of advice on how to provide bioinformatics support to medical doctors in hospitals. We believe these simple rules can help bioinformatics facility analysts in producing better scientific results and work in a serene and fruitful environment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13040-023-00326-0"
    },
    {
        "id": 9901,
        "title": "Penggunaan Algoritma Apriori untuk Data Mining Penjualan Sepatu Brand Lokal",
        "authors": "Wiwid Wahyudi, Rivoldy Bintang Daya, Irdha Yunianto",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "Penggunaan Data Mining pada Penjualan Sepatu Brand Lokal Menggunakan Algoritma Apriori merupakan sebuah penelitian yang bertujuan untuk menggali bagaimana data mining dapat digunakan untuk meningkatkan penjualan sepatu brand lokal. Penelitian ini menerapkan algoritma apriori untuk analisis data penjualan sepatu brand lokal dan menemukan pola yang membantu meningkatkan penjualan. Hasil penelitian ini menunjukkan bahwa dengan penerapan algoritma apriori dapat dijelaskan pola belanja agar berguna untuk penjualan sepatu brand lokal, seperti kombinasi produk yang sering dibeli bersama pelanggan atau waktu terbaik untuk menjual produk tertentu. Selain itu, penelitian ini juga mengungkapkan bahwa dengan menggunakan data mining, perusahaan dapat mengelola persediaan secara lebih efektif dan meramalkan permintaan pasar, sehingga dapat meminimalkan penjualan yang hilang dan meningkatkan keuntungan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55606/teknik.v3i2.2031"
    },
    {
        "id": 9902,
        "title": "Application of improved Apriori Algorithm in Innovation and Entrepreneurship Engineering Education Platform",
        "authors": "Xuanyuan Wu, Yi Xiao, Anhua Liu",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "The implementation of innovation and entrepreneurship education is inseparable from professional education, so it is important for the rich data in the education platform to mine the connection between professional courses and between grades and courses. The study of association rule algorithm based on education data mining improves the time performance efficiency and accuracy of Apriori algorithm. The study improves the time efficiencies of Apriori algorithm by maintaining Map table and splitting transaction database; the accuracy is improved by using mixed criteria to measure the accuracy and filtering deformation rules based on the inference of confidence. The results of the validation of the time efficiency of the algorithm show that the running time of the improved algorithm in solving frequent itemsets is improved by about 93.86%, 92.48% and 92.76%, respectively, compared with the other three algorithms. The running time of the algorithm for generating frequent itemsets of all orders is about 91.35 ms, which is 66.13% and 83.72% better than the Apriori algorithm and AprioriTid algorithm, respectively. The mining results of student examination data based on the education platform are reasonable and practical, which are of good practical significance for the innovation and entrepreneurship engineering education platform to develop training plans and improve teaching quality.is assumed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12694/scpe.v24i3.2307"
    },
    {
        "id": 9903,
        "title": "Optimization Design of Apriori Algorithm Based on Big Data Analysis and Cloud Computing",
        "authors": "Yu Chen, Zihan Wang, Shuai Zhang",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00129"
    },
    {
        "id": 9904,
        "title": "Effectiveness of Decision Support System for Hydroponic Plant Nutrient Selection Using Apriori Algorithm Method",
        "authors": "Silvi Khairiyah Manurung, Riri Syafitri Lubis",
        "published": "2023-1-1",
        "citations": 1,
        "abstract": "Hydroponics is an agricultural system that uses water as its growing medium by adding nutrients to plants without using soil. In hydroponic cultivation, the thing that needs to be considered is the provision of an optimal dose of nutrient solution as a food source for plants. The provision of nutrients that are not in accordance with the needs of plants results in plants stopping growing, so that plants do not take care of each other. The type of nutrition commonly used in hydroponic plants is AB mix. However, the use of AB mix as a hydroponic nutrient also has disadvantages, namely synthetics and the price of AB mix nutrients are quite expensive. Therefore, alternative nutrients are needed that have the potential to be used as hydroponic nutrients.  By analyzing hydroponic plant assessment data so that the rules of linkage between combinations of goods are found and form a pattern of itemset combinations with apriori algorithm. The association technique aims to find matching links in the database. From the results of data mining calculations using apriori algorithms, nutrient assessment data on hydroponic plants with the minimum support 20% and the minimum confidence 70%, formed five rules on hydroponic plant nutrition. One of the best rules is that AB mix nutrition is used on cucumber, spinach, celery, and kailan plants, so with 100% probability that POC nutrients will be good to also use on cucumber, spinach, celery, and kailan plants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i1.11975"
    }
]