[
    {
        "id": 7505,
        "title": "Exploration of Feature Engineering Techniques and Unsupervised Machine Learning Clustering Algorithms for Geophysical Data on Levees",
        "authors": "Brittany M. Russo, Adda Athanasopoulos-Zekkos",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485347.046"
    },
    {
        "id": 7506,
        "title": "Performance of ML-Based Unsupervised Clustering Algorithms for WSN Node Clustering",
        "authors": "M. Manoranjani",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Abstract: Wireless Sensor Networks are generally deployed in dynamically changing environment. When compared to common wired network nodes, WSN nodes must do more work. Since WSN devices are battery powered, so power management is a challenge. Clustering is one solution that has been proposed to alleviate the issue of limited power. Clustering is the most important method stabilizes the lifetime of the network. It entails the aggregation of sensor nodes into clusters and cluster head is picked out from all the clusters. Clustering is implemented in wireless sensor networks through the Machine Learning techniques. In wireless sensor networks, machine learning algorithms have an important role in cluster head formation and maintain the stability of the nodes in the cluster. Machine Learning approaches used in wireless sensor networks can be classified as Supervised learning, Unsupervised learning, and Reinforcement learning. Among these learning techniques, unsupervised learning deals with different clustering algorithms such as k-means, K-medoids, Fuzzy C-means, hierarichalbased, and SOM. This paper evaluates the performance of the variants of k-Means (kM) and Fuzzy C-means (FCM) algorithms in terms of the clustering and accuracy. This paper imparts performance analysis of different clustering algorithms in machine learning applied for wireless sensor networks. From the analysis, the Fuzzy C-Means algorithm found to be more suitable for node clustering in WSN",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.57868"
    },
    {
        "id": 7507,
        "title": "Assessing Search and Unsupervised Clustering Algorithms in Nested Sampling",
        "authors": "Lune Maillard, Fabio Finocchi, Martino Trassinelli",
        "published": "2023-2-14",
        "citations": 2,
        "abstract": "Nested sampling is an efficient method for calculating Bayesian evidence in data analysis and partition functions of potential energies. It is based on an exploration using a dynamical set of sampling points that evolves to higher values of the sampled function. When several maxima are present, this exploration can be a very difficult task. Different codes implement different strategies. Local maxima are generally treated separately, applying cluster recognition of the sampling points based on machine learning methods. We present here the development and implementation of different search and clustering methods on the nested_fit code. Slice sampling and the uniform search method are added in addition to the random walk already implemented. Three new cluster recognition methods are also developed. The efficiency of the different strategies, in terms of accuracy and number of likelihood calls, is compared considering a series of benchmark tests, including model comparison and a harmonic energy potential. Slice sampling proves to be the most stable and accurate search strategy. The different clustering methods present similar results but with very different computing time and scaling. Different choices of the stopping criterion of the algorithm, another critical issue of nested sampling, are also investigated with the harmonic energy potential.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25020347"
    },
    {
        "id": 7508,
        "title": "Augmentation of Densest Subgraph Finding Unsupervised Feature Selection Using Shared Nearest Neighbor Clustering",
        "authors": "Deepesh Chugh, Himanshu Mittal, Amit Saxena, Ritu Chauhan, Eiad Yafi, Mukesh Prasad",
        "published": "2023-1-3",
        "citations": 1,
        "abstract": "Determining the optimal feature set is a challenging problem, especially in an unsupervised domain. To mitigate the same, this paper presents a new unsupervised feature selection method, termed as densest feature graph augmentation with disjoint feature clusters. The proposed method works in two phases. The first phase focuses on finding the maximally non-redundant feature subset and disjoint features are added to the feature set in the second phase. To experimentally validate, the efficiency of the proposed method has been compared against five existing unsupervised feature selection methods on five UCI datasets in terms of three performance criteria, namely clustering accuracy, normalized mutual information, and classification accuracy. The experimental analyses have shown that the proposed method outperforms the considered methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16010028"
    },
    {
        "id": 7509,
        "title": "Contribution of Unsupervised Clustering Algorithms to Patient Safety Culture Promotion",
        "authors": "Youcef Oussama Fourar, Mebarek Djebabra",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasa59624.2023.10286567"
    },
    {
        "id": 7510,
        "title": "Unsupervised Few-Shot Image Segmentation with Dense Feature Learning and Sparse Clustering",
        "authors": "Kuangdai Leng, Robert Atwood, Winfried Kockelmann, Deniza Chekrygina, Jeyan Thiyagalingam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012380700003660"
    },
    {
        "id": 7511,
        "title": "FUB-Clustering: Fully Unsupervised Batch Clustering",
        "authors": "Salvatore Giurato, Alessandro Ortis, Sebastiano Battiato",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011969500003497"
    },
    {
        "id": 7512,
        "title": "Electrofacies clustering and classification from the Ariri Formation in Santos Basin (southeastern offshore Brazil) involving unsupervised learning algorithms",
        "authors": "Felipe Ferreira Luiz Gorla, Cleyton de Carvalho Carneiro",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13146-023-00889-3"
    },
    {
        "id": 7513,
        "title": "Automated algorithm composition of unsupervised image clustering algorithms",
        "authors": "Mia Gerber, Nelishia Pillay",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583133.3590555"
    },
    {
        "id": 7514,
        "title": "Ensembling Supervised and Unsupervised Machine Learning Algorithms for Detecting Distributed Denial of Service Attacks",
        "authors": "Saikat Das, Mohammad Ashrafuzzaman, Frederick T. Sheldon, Sajjan Shiva",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "The distributed denial of service (DDoS) attack is one of the most pernicious threats in cyberspace. Catastrophic failures over the past two decades have resulted in catastrophic and costly disruption of services across all sectors and critical infrastructure. Machine-learning-based approaches have shown promise in developing intrusion detection systems (IDSs) for detecting cyber-attacks, such as DDoS. Herein, we present a solution to detect DDoS attacks through an ensemble-based machine learning approach that combines supervised and unsupervised machine learning ensemble frameworks. This combination produces higher performance in detecting known DDoS attacks using supervised ensemble and for zero-day DDoS attacks using an unsupervised ensemble. The unsupervised ensemble, which employs novelty and outlier detection, is effective in identifying prior unseen attacks. The ensemble framework is tested using three well-known benchmark datasets, NSL-KDD, UNSW-NB15, and CICIDS2017. The results show that ensemble classifiers significantly outperform single-classifier-based approaches. Our model with combined supervised and unsupervised ensemble models correctly detects up to 99.1% of the DDoS attacks, with a negligible rate of false alarms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a17030099"
    },
    {
        "id": 7515,
        "title": "Unsupervised Clustering for a Comparative Methodology of Machine Learning Models to Detect Domain-Generated Algorithms Based on an Alphanumeric Features Analysis",
        "authors": "Mohamed Hassaoui, Mohamed Hanini, Said El Kafhali",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10922-023-09793-6"
    },
    {
        "id": 7516,
        "title": "Correction: Maillard et al. Assessing Search and Unsupervised Clustering Algorithms in Nested Sampling. Entropy 2023, 25, 347",
        "authors": "Lune Maillard, Fabio Finocchi, Martino Trassinelli",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "There was an error in the original publication [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e26010055"
    },
    {
        "id": 7517,
        "title": "Clustering-based Categorization of Music Users through Unsupervised Learning",
        "authors": "Ziang Zhang, Jingbo Chang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "The process of categorizing music users without the need for explicit guidance, known as unsupervised learning, has been explored through a technique called clustering. This innovative approach involves the use of algorithms to group music users based on their preferences, behaviors, or other relevant characteristics, thereby uncovering patterns and structures within the music consumption landscape. By identifying distinct clusters of music users, this method facilitates the creation of personalized recommendations, targeted marketing strategies, and tailored music experiences, ultimately enhancing user satisfaction and engagement. Through unsupervised learning, the clustering-based categorization of music users has the potential to revolutionize the music industry by enabling precise segmentation and understanding of diverse user segments. By leveraging this approach, music streaming platforms and other industry stakeholders can gain valuable insights into user behavior, preferences, and trends, empowering them to develop more effective content curation techniques, user interfaces, and promotional campaigns. Additionally, the application of unsupervised learning in music user categorization opens up opportunities for the development of more sophisticated recommendation systems, capable of delivering highly personalized and relevant music suggestions to individual users.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58195/emi.2018.1006"
    },
    {
        "id": 7518,
        "title": "Unsupervised Analysis of Scientific Paper Abstracts: Exploring Clustering Algorithms",
        "authors": "Ming Zheng Ong, Natalie Jie Yin Tan, Siew Mooi Lim, Jia Hui Ee",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdxa61007.2024.10470550"
    },
    {
        "id": 7519,
        "title": "Contrastive learning for unsupervised medical image clustering and reconstruction",
        "authors": "Matteo Ferrante, Tommaso Boccato, Andrea Duggento, Simeon Spasov, Nicola Toschi",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "The lack of large labeled medical imaging datasets, along with significant inter-individual variability compared to clinically established disease classes, poses significant challenges in exploiting medical imaging information in a precision medicine paradigm, where in principle dense patient-specific data can be employed to formulate individual predictions and/or stratify patients into finer-grained groups which may follow more homogeneous trajectories and therefore empower clinical trials. In order to efficiently explore the effective degrees of freedom underlying variability in medical images in an unsupervised manner, in this work we propose an unsupervised autoencoder framework which is augmented with a contrastive loss to encourage high separability in the latent space. The model is validated on (medical) benchmark datasets. As cluster labels are assigned to each example according to cluster assignments, we compare performance with a supervised transfer learning baseline. Our methods achieves similar performance to the supervised architecture, indicating that separation in the latent space reproduces expert medical observer-assigned labels. The proposed method could be beneficial for patient stratification, exploring new subdivision of larger classes or pathological continua or, due to its sampling abilities in a variation setting, data augmentation in medical image processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7557/18.6819"
    },
    {
        "id": 7520,
        "title": "Unsupervised Learning-Based WSN Clustering for Efficient Environmental Pollution Monitoring",
        "authors": "Catherine Nayer Tadros, Nader Shehata, Bassem Mokhtar",
        "published": "2023-6-20",
        "citations": 2,
        "abstract": "Wireless Sensor Networks (WSNs) have been adopted in various environmental pollution monitoring applications. As an important environmental field, water quality monitoring is a vital process to ensure the sustainable, important feeding of and as a life-maintaining source for many living creatures. To conduct this process efficiently, the integration of lightweight machine learning technologies can extend its efficacy and accuracy. WSNs often suffer from energy-limited devices and resource-affected operations, thus constraining WSNs’ lifetime and capability. Energy-efficient clustering protocols have been introduced to tackle this challenge. The low-energy adaptive clustering hierarchy (LEACH) protocol is widely used due to its simplicity and ability to manage large datasets and prolong network lifetime. In this paper, we investigate and present a modified LEACH-based clustering algorithm in conjunction with a K-means data clustering approach to enable efficient decision making based on water-quality-monitoring-related operations. This study is operated based on the experimental measurements of lanthanide oxide nanoparticles, selected as cerium oxide nanoparticles (ceria NPs), as an active sensing host for the optical detection of hydrogen peroxide pollutants via a fluorescence quenching mechanism. A mathematical model is proposed for the K-means LEACH-based clustering algorithm for WSNs to analyze the quality monitoring process in water, where various levels of pollutants exist. The simulation results show the efficacy of our modified K-means-based hierarchical data clustering and routing in prolonging network lifetime when operated in static and dynamic contexts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23125733"
    },
    {
        "id": 7521,
        "title": "A Review on Analysis of K-Means Clustering Machine Learning Algorithm based on Unsupervised Learning",
        "authors": "Manish Suyal, Sanjay Sharma",
        "published": "2024",
        "citations": 0,
        "abstract": "The process of machine learning is understood within Artificial Intelligence. Machine learning process gives the tools the ability to learn from their experiences and improve themselves without any coding. In machine learning, we program a computer or machine in such a way that the user wants the work done by the machine. It can give such work and in this process the computer does its work on the basis of the data already with it and gives its performance. The objective of writing the paper is how K- Means clustering algorithm is applied on the model dataset based on unsupervised learning. We used to pass feature data and label data to machine learning model in the supervised learning. But the method of unsupervised learning algorithms is different. In this we do not give the feature data and target data to the model. The dataset model uses only the input data for processing and the output data has no meaning in the model. Accordingly on the basis of the similarities found in the data and model predict the desired output. K-means is clustering algorithm based on unsupervised learning in which data and objects are separated into different clusters in such a way that objects that have similar properties are put in one cluster and objects that have different properties are put in separate cluster.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33969/ais.2024060106"
    },
    {
        "id": 7522,
        "title": "Assisting Convergence Behaviour Characterisation with Unsupervised Clustering",
        "authors": "Helena Stegherr, Michael Heider, Jörg Hähner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012202100003595"
    },
    {
        "id": 7523,
        "title": "Image Denoising Techniques Using Unsupervised Machine Learning and Deep Learning Algorithms: A Review",
        "authors": "Barwar Ferzo, Adnan Mohsin Abdulazeez",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "The continuous evolution of imaging technologies has accentuated the demand for robust and efficient image denoising techniques. Unsupervised machine learning algorithms have emerged as promising tools for addressing this challenge. This review scrutinizes the efficacy, versatility, and limitations of various unsupervised machine learning approaches in the area of image denoising. The paper commences with a clarification of the foundational concepts of image denoising and the pivotal role unsupervised machine learning plays in enhancing its efficacy. Traditional denoising methods, encompassing filters and transforms, are briefly outlined, highlighting their insufficiencies in handling complicated noise patterns prevalent in modern imaging systems. Subsequently, the review delves into an exploration of unsupervised machine learning techniques tailored for image denoising. This includes an in-depth analysis of methodologies such as clustering deep learning. Each technique is surveyed for its architectural variation, adaptability, and performance in denoising diverse image datasets. Additionally, the review encompasses an evaluation of prevalent metrics used for quantifying denoising performance, discussing their relevance and applicability across varying noise types and image characteristics. Furthermore, it delineates the challenges faced by unsupervised techniques in this domain and charts prospective avenues for future research, emphasizing the fusion of unsupervised methods with other learning paradigms for heightened denoising efficacy. This review merges empirical insights, critical analysis, and future perspectives, serving as a roadmap for researchers and practitioners navigating the landscape of image denoising through unsupervised machine learning methodologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v13i1.3724"
    },
    {
        "id": 7524,
        "title": "Detection of Counterfeit Accelerometer ICs Using Clustering and Unsupervised Machine Learning of Allan Variance",
        "authors": "Leonard MacEachern",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mwscas57524.2023.10405892"
    },
    {
        "id": 7525,
        "title": "Centroid Based Celestial Clustering Algorithm: A Novel Unsupervised Learning Method for Haemogram Data Clustering",
        "authors": "Shibu Kumar K. B., Philip Samuel",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tetci.2022.3211004"
    },
    {
        "id": 7526,
        "title": "Insider Threat Detection Model Enhancement Using Hybrid Algorithms between Unsupervised and Supervised Learning",
        "authors": "Junkai Yi, Yongbo Tian",
        "published": "2024-3-3",
        "citations": 0,
        "abstract": "Insider threats are one of the most costly and difficult types of attacks to detect due to the fact that insiders have the right to access an organization’s network systems and understand its structure and security procedures, making it difficult to detect this type of behavior through traditional behavioral auditing. This paper proposes a method to leverage unsupervised outlier scores to enhance supervised insider threat detection by integrating the advantages of supervised and unsupervised learning methods and using multiple unsupervised outlier mining algorithms to extract from the underlying data useful representations, thereby enhancing the predictive power of supervised classifiers on the enhanced feature space. This novel approach provides superior performance, and our method provides better predictive power compared to other excellent abnormal detection methods. Using only 20% of the computing budget, our method achieved an accuracy of 86.12%. Compared with other anomaly detection methods, the accuracy increased by up to 12.5% under the same computing budget.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13050973"
    },
    {
        "id": 7527,
        "title": "A Hybrid Machine Learning Method for Diabetes Detection based on Unsupervised Clustering",
        "authors": "Junhong Liu, Bo Peng, Zezhao Yin",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583788.3583809"
    },
    {
        "id": 7528,
        "title": "Feature distillation with mixup for unsupervised continual learning",
        "authors": "Yiyan Gao",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005825"
    },
    {
        "id": 7529,
        "title": "Unsupervised learning towards hierarchical clustering",
        "authors": "Suwarna Gothane, K. Srujan Raju, Saikumar Tara, P. Devika",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0150050"
    },
    {
        "id": 7530,
        "title": "An Unsupervised IR Approach Based Density Clustering Algorithm",
        "authors": "Achref Ouni",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011892800003417"
    },
    {
        "id": 7531,
        "title": "Unsupervised Machine Learning Clustering of Seismic and Infrasound Data Quality Metrics",
        "authors": "Juliann R. Coffey, Alex J. C. Witsil, Kenneth A. Macpherson, David Fee",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Abstract\nDeveloping techniques for improving quality control (QC) schemes to catch seismic and infrasound data defects continues to be an area of active research. Selecting universal thresholds for the automation of data quality (DQ) checks is an efficient way to find QC issues, but these thresholds may not apply well to multiple stations with varying DQ characteristics. In addition, these thresholds may not catch subtle changes in DQ parameters that still indicate problems. Machine learning can be an alternative way of diagnosing QC issues. K-means clustering, an unsupervised machine learning clustering algorithm, has been effectively used in the past for geophysical pattern exploration. This study furthers k-means applications to DQ analysis through clustering on DQ metrics derived from day-long segments of nuclear explosion monitoring data. Our k-means implementation on broadband seismometer DQ metrics separately clustered mass recenters, calibrations lasting at least one hour, and days without either. Applying this technique to infrasound DQ metrics revealed clusters related to physical issues at the stations, such as missing back volume screws and the flooding of ported pipe inlets. These are both examples of QC issues that are difficult to diagnose or detect through the thresholding of metrics or by inspecting waveforms and spectra. Our results show that k-means clustering can be a useful QC tool in exploring DQ patterns to assist analyst review of station operation and maintenance. The learned knowledge from this exploration can then inform a thresholding workflow on how to tailor to individual stations, or the k-means model could classify data directly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1785/0220230177"
    },
    {
        "id": 7532,
        "title": "Brain Tumor Detection and Categorization with Segmentation of Improved Unsupervised Clustering Approach and Machine Learning Classifier",
        "authors": "Usharani Bhimavarapu, Nalini Chintalapudi, Gopi Battineni",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "There is no doubt that brain tumors are one of the leading causes of death in the world. A biopsy is considered the most important procedure in cancer diagnosis, but it comes with drawbacks, including low sensitivity, risks during biopsy treatment, and a lengthy wait for results. Early identification provides patients with a better prognosis and reduces treatment costs. The conventional methods of identifying brain tumors are based on medical professional skills, so there is a possibility of human error. The labor-intensive nature of traditional approaches makes healthcare resources expensive. A variety of imaging methods are available to detect brain tumors, including magnetic resonance imaging (MRI) and computed tomography (CT). Medical imaging research is being advanced by computer-aided diagnostic processes that enable visualization. Using clustering, automatic tumor segmentation leads to accurate tumor detection that reduces risk and helps with effective treatment. This study proposed a better Fuzzy C-Means segmentation algorithm for MRI images. To reduce complexity, the most relevant shape, texture, and color features are selected. The improved Extreme Learning machine classifies the tumors with 98.56% accuracy, 99.14% precision, and 99.25% recall. The proposed classifier consistently demonstrates higher accuracy across all tumor classes compared to existing models. Specifically, the proposed model exhibits accuracy improvements ranging from 1.21% to 6.23% when compared to other models. This consistent enhancement in accuracy emphasizes the robust performance of the proposed classifier, suggesting its potential for more accurate and reliable brain tumor classification. The improved algorithm achieved accuracy, precision, and recall rates of 98.47%, 98.59%, and 98.74% on the Fig share dataset and 99.42%, 99.75%, and 99.28% on the Kaggle dataset, respectively, which surpasses competing algorithms, particularly in detecting glioma grades. The proposed algorithm shows an improvement in accuracy, of approximately 5.39%, in the Fig share dataset and of 6.22% in the Kaggle dataset when compared to existing models. Despite challenges, including artifacts and computational complexity, the study’s commitment to refining the technique and addressing limitations positions the improved FCM model as a noteworthy advancement in the realm of precise and efficient brain tumor identification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bioengineering11030266"
    },
    {
        "id": 7533,
        "title": "Unsupervised hypergraph convolutional clustering networks",
        "authors": "Mingwei You, Nan Xiang, Qilin Wang, Zhenguo Wang",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3013388"
    },
    {
        "id": 7534,
        "title": "Image Formation Algorithms for Low-Cost Freehand Ultrasound Scanner Based on Ego-Motion Estimation and Unsupervised Clustering",
        "authors": "Ayusha Abbas, Jeffrey Neasham, Mohsen Naqvi",
        "published": "2023-8-28",
        "citations": 2,
        "abstract": "This paper describes the application of unsupervised learning techniques to improve ego-motion estimation for a low-cost freehand ultrasound probe. Echo decorrelation measurements, which are used to estimate the lateral velocity of a scanning probe as it is passed over the skin, are found to be sensitive to varying tissue types and echogenicity in the imaged scene, and this can impact the geometric accuracy of the generated images. Here, we investigate algorithms to cluster the collated 1D echo data into regions of different echogenicity by applying a Gaussian mixture model (GMM), spatial fuzzy c-means (SFCM) or k-means clustering techniques, after which the decorrelation measurements can focus on the regions that yield the most accurate velocity estimates. A specially designed mechanical rig is used to provide the ground truth for the quantitative analysis of probe position estimation on phantom and in vivo data using different clustering techniques. It is concluded that the GMM is the most effective in classifying regions of echo data, leading to the reconstruction of the most geometrically correct 2D B-mode ultrasound image.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12173634"
    },
    {
        "id": 7535,
        "title": "Unsupervised clustering ensemble for traffic level prediction",
        "authors": "Jian Wang, Jin Guo, Yueying Li, Ran Hao, Hongjun Wang",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/9789811269264_0066"
    },
    {
        "id": 7536,
        "title": "A Survey of Unsupervised Learning Algorithms for Zero-Day Attacks in Intrusion Detection Systems.",
        "authors": "Sunkanmi Oluwadare, Zag ElSayed",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Intrusion detection systems (IDS) are systems that are used to monitor networks for malicious events, abnormal activities, and policy violations. They are systems that are capable of detecting and classifying network attacks based on behaviors or signatures of previously known attacks based on markers. However, since network attacks are constantly evolving and it is almost impossible to infuse all possible combinations and signatures of the attacks, the effectiveness of Machine Learning based IDS is often challenged and called into play as a result of novel attacks generated, known as Zero-day attacks. This has facilitated the need to have intelligent-based IDS that could detect anomalies without relying on a detailed signature repository. In this paper, we present a literature-based survey of popular deep learning algorithms and evaluated their capabilities, strengths, limitations, and resource requirements for detecting anomalies and Zero-Day attacks. Based on our evaluation, we propose Long Short-Term (LSTM) networks and Autoencoder networks as the best algorithms for further analysis in intrusion detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32473/flairs.36.133182"
    },
    {
        "id": 7537,
        "title": "Image Clustering and Feature Extraction by Utilizing an Improvised Unsupervised Learning Approach",
        "authors": "R. Bhuvanya, M. Kavitha",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nThe need for information is gradually shifting from text to images due to the technology’s growth and increase in digital images. It is quite challenging for people to find similar color images. To obtain similarity matching, the color of the image needs to be identified. This paper aims at various clustering techniques to identify the color of the digital image. Though many clustering techniques exist, this paper focuses on Fuzzy c-Means, Mean-Shift, and a hybrid technique that amalgamates the agglomerative hierarchies and k-Means, known as hKmeans to cluster the intensity of the image. Applying evaluation metrics of Mean Squared Error, Root Mean Squared Error, Mean Absolute Error, Homogeneity, Completeness, V-Score, and Peak signal-to-noise ratio it is proven that the results obtained demonstrate the good performance of the proposed technique. Then the color histogram is applied to identify the color and differentiate the color distribution on the original and clustered image.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/cait-2023-0010"
    },
    {
        "id": 7538,
        "title": "Mapping of Mean Deformation Rates Based on APS-Corrected InSAR Data Using Unsupervised Clustering Algorithms",
        "authors": "Mohammad Amin Khalili, Behzad Voosoghi, Luigi Guerriero, Saeid Haji-Aghajany, Domenico Calcaterra, Diego Di Martire",
        "published": "2023-1-16",
        "citations": 5,
        "abstract": "Different interferometric approaches have been developed over the past few decades to process SAR data and recover surface deformation, and each approach has advantages and limitations. Finding an accurate and reliable interval for preparing mean deformation rate maps (MDRMs) remains challenging. The primary purpose of this paper is to implement an application consisting of three unsupervised clustering algorithms (UCAs) for determining the best interval from SAR-derived deformation data, which can be used to interpret long-term deformation processes, such as subsidence, and identify displacement patterns. Considering Port Harcourt (in the Niger Delta) as the study area, it was essential to remove the sources of error in extracting deformation signals from SAR data, spatially ionospheric and tropospheric delays, before using UCAs to obtain its characteristics and real deformation data. Moreover, another purpose of this paper is to implement the advanced integration method (AIM) for atmospheric phase screen (APS) correction to enhance deformation signals obtained through different SAR processing approaches, including interferometric SARs (two-pass interferometry, InSAR) and multitemporal interferometry SARs (n-pass interferometry, DInSAR; permanent scatterer interferometry (PSI); and small baseline subset (SBAS)). Two methods were chosen to evaluate and find the best technique with which to create an MDRM: The first one was to compare the signals corrected by the AIM and the vertical component of the GPS station, which showed the AIM providing 58%, 42%, and 28% of the matching with GNSS station outputs for InSAR, PSI, and SBAS, respectively. Secondly, similarity measures and Davies–Bouldin index scores were implemented to find an accurate and reliable interval in which the SBAS technique with the unsupervised K-medians method has been chosen. Based on GNSS vertical deformation in a 500 m radius around the station, the SBAS K-medians technique expressed up to 5.5% better deformation patterns than the map of SAR processing techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15020529"
    },
    {
        "id": 7539,
        "title": "Learning the Character Inventories of Undeciphered Scripts Using Unsupervised Deep Clustering",
        "authors": "Logan Born, M. Willis Monroe, Kathryn Kelley, Anoop Sarkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.cawl-1.11"
    },
    {
        "id": 7540,
        "title": "Earth Quack Prediction of Southern California Using Unsupervised Clustering Based Ensemble Deep Learning Model",
        "authors": "Raghavi K Bhujang, Veeranna Kotagi",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390335"
    },
    {
        "id": 7541,
        "title": "Clustering honey samples with unsupervised machine learning methods using FTIR data",
        "authors": "FATIH MEHMET AVCU",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1590/0001-3765202420230409"
    },
    {
        "id": 7542,
        "title": "A New Procedure for Unsupervised Clustering Based on Combination of Artificial Neural Networks",
        "authors": "Yaroslava Pushkarova, Paul Kholodniuk",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "Classification methods have become one of the main tools for extracting essential information from multivariate data. New classification algorithms are continuously being proposed and created. This paper presents a classification procedure based on a combination of Kohonen and probabilistic neural networks. Its applicability and efficiency are estimated using model data sets (iris flowers data set, wine data set, data with a two-hierarchical structure), then compared with the traditional clustering algorithms (hierarchical clustering, k-means clustering, fuzzy k-means clustering). The algorithm was designed as M-script in Matlab 7.11b software. It was shown that the proposed classification procedure has a great advantage over traditional clustering methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24018/ejai.2023.2.4.31"
    },
    {
        "id": 7543,
        "title": "An Unsupervised Learning Based System Employing K-Means Clustering to Perform Customer Segmentation",
        "authors": "Atharva Gupta",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "Abstract: The job of marketers is to get the right product in front of the right consumer at the moment that they’re most likely to buy that product. The ability for marketers to do just that and to drill down to more and more specific niches of customers has grown exponentially over time. AI technology is now being used to help marketers get even more specific with predictive targeting and personalization. Targeted advertising is a form of online advertising which micro-targets its customers. It is based on the traits and behavioral patterns of different people. Nowadays, people, knowingly or unknowingly, are churning out personal data at an unprecedented scale because of the use of all electronic devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.53911"
    },
    {
        "id": 7544,
        "title": "Clustering Based Unsupervised Hashing Framework for Image Retrieval",
        "authors": "Shulong Pan, Jialin Pan, Muhammad Muhibb Ullah",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616901.3616940"
    },
    {
        "id": 7545,
        "title": "Unsupervised Machine Learning-Based User Clustering in THz-NOMA Systems",
        "authors": "Yushen Lin, Kaidi Wang, Zhiguo Ding",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lwc.2023.3262788"
    },
    {
        "id": 7546,
        "title": "Unsupervised Machine Learning for Bot Detection on Twitter: Generating and Selecting Features for Accurate Clustering",
        "authors": "Raad Al-azawi, Safaa O. AL-mamory",
        "published": "2024-2-25",
        "citations": 0,
        "abstract": "Twitter is a popular social media platform that is widely used by individuals and businesses. However, it is vulnerable to bot attacks, which can have negative effects on society. Supervised machine learning techniques can detect bots but require labeled data to differentiate between human and bot users. Twitter generates a significant amount of unlabeled data, which can be expensive to label. Unsupervised machine learning techniques, specifically clustering algorithms, are crucial for managing this data and reducing computational complexity. Effective feature selection is necessary for clustering, as some features are more important than others. This study aims to enhance feature reliability, introduce new features, and reduce them to improve bot identification accuracy using clustering algorithms. The study achieved an accuracy rate of 0.99 in four clustering algorithms, including agglomerative hierarchy, k-medoids, DBSCAN, and K-means. This was accomplished by minimizing dataset dimensions and selecting essential features. By employing unsupervised machine learning techniques, Twitter can detect and mitigate bot attacks more efficiently, which can positively impact society\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4114/intartif.vol27iss73pp142-158"
    },
    {
        "id": 7547,
        "title": "Correction: K-means tree: an optimal clustering tree for unsupervised learning",
        "authors": "Pooya Tavallali, Peyman Tavallali, Mukesh Singhal",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05723-0"
    },
    {
        "id": 7548,
        "title": "Social Media User Oppression Detection Technique Using Supervised and Unsupervised Machine Learning Algorithms",
        "authors": "Pradeep T. Shreya, P. Durgadevi",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "Social media is the highly gained popular medium of interaction.And because of using the social media in our day to day life more oftenly,the increase in cyberbullying has also increased,especially to the young people who are more into the social media platform.So by cyberbullying detection technique we can make a world or environment more safe.cyberbullying detection technique will categorize tweets or comments as bullying and non bullying words. The previous existing system uses algorithms such as Naïve Bayes which is slow and less accurate in identifying cyber bullying and also high false positives is observed.Instead here CNN and LSTM is proposed to identify cyberbullying comments and to provide good amount of accuracy",
        "keywords": "",
        "link": "http://dx.doi.org/10.4028/p-3gv27w"
    },
    {
        "id": 7549,
        "title": "Big Data Analysis Using Unsupervised Machine Learning: K-means Clustering and Isolation Forest Models for Efficient Anomaly Detection and Removal in Complex Lithologies",
        "authors": "Aneeq Nasir Janjua, Abdulazeez Abdulraheem, Zeeshan Tariq",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract\nLithology identification holds a pivotal role in the characterization of subsurface formations. In recent years, the advent of big data and the need for more precise lithology identification have spurred the growing adoption of machine learning algorithms. This paper's primary objective is to leverage unsupervised machine learning techniques for the identification and subsequent removal of anomalies inherent in complex datasets. The Isolation Forest model is the cornerstone of our approach for anomaly detection and elimination.\nTo initiate this process, we employed the K-means algorithm to create clusters, followed by a evaluation using silhouette coefficients. Subsequently, we selected input data for each cluster and conducted exploratory data analysis both prior to and after the removal of outliers. The histograms portraying average anomaly scores for each cluster were thoughtfully presented. For real-time anomaly detection, we harnessed the power of the Isolation Forest model, which facilitated the creation of an Isolation Forest anomalies map by plotting neutron-porosity against bulk density.\nOur rigorous data analysis employed various statistical techniques, including data statistics, histograms, and cross plots between neutron-porosity and bulk density. This multifaceted approach successfully eradicated anomalies from the dataset, a fact vividly illustrated by the histograms, where anomalies were discernible through their negative scores. The Isolation Forest map conclusively demonstrated the effective removal of outliers from the dataset, underscoring the model's proficiency in identifying and mitigating these anomalies based on their negative scores.\nThe Isolation Forest model has thus exhibited remarkable efficacy in the identification and elimination of data anomalies. Its versatility makes it a valuable asset for the detection and removal of outliers, deviations, or noise from datasets, rendering it particularly well-suited for anomaly detection and outlier mitigation in various analytical scenarios. Notably, the combination of the K-means and Isolation Forest algorithms emerges as a potent and advantageous approach, especially when dealing with extensive datasets and conducting comprehensive analyses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-23580-ea"
    },
    {
        "id": 7550,
        "title": "Arguably at SemEval-2023 Task 11: Learning the disagreements using unsupervised behavioral clustering and language models",
        "authors": "Guneet Singh Kohli, Vinayak Tiwari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.295"
    },
    {
        "id": 7551,
        "title": "Unsupervised Feature Learning Architecture with Multi-clustering Integration RBM",
        "authors": "Jielei Chu, Hongjun Wang, Jing Liu, Zhiguo Gong, Tianrui Li",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00332"
    },
    {
        "id": 7552,
        "title": "IMPLEMENTASI UNSUPERVISED LEARNING PADA NILAI JASMANI KESAMAPTAAN SEKOLAH POLISI NEGARA DENGAN METODE CLUSTERING ANALYSIS",
        "authors": "Zaenal Muttaqin",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "- Agglomerative adalah salah satu dari metode Hierarchical Analysis Clustering (HAC) yang merupakan bagian dari konsep Unsupervised Learning dengan tujuan untuk mengelompokan data-data dari hasil perhitungan terhadap variabel yang ada. Dalam metode Agglomerative terdapat proses perhitungan jarak seperti Manhattan dan Euclidean untuk mengukur kesamaan (similiarity) antar objek. Metode hierarki yang digunakan dalam penelitian ini yaitu metode Single Linkage, Average Linkage dan Complete Linkage. Pengelompokan Nilai Kesamaptaan diperlukan untuk dapat dilakukan penugasan sesuai dengan kelompok nilai yang telah ditentukan. Setiap nilai pada variabel di analisa melalui perpaduan perhitungan metode jarak dengan setiap metode hierarki. Diperoleh hasil bahwa metode perhitungan jarak Manhattan dengan metode Single Linkage lebih variatif (heterogen) sebanyak 17 klaster, sedangkan untuk Average Linkage kombinasi dengan perhitungan jarak Manhattan menghasilkan 24 klaster. Analisa terakhir diperoleh dari metode Complete Linkage kombinasi dengan perhitungan jarak Euclidean menghasilkan 24 klaster.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30656/prosisko.v10i1.6269"
    },
    {
        "id": 7553,
        "title": "A Comparative Study of Contrastive Learning-Based Few-Shot Unsupervised Algorithms for Efficient Deep Learning",
        "authors": "Yancheng Zhu, Qiwei Wu, Jianzi Liu",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\nThe rapid development in computer vision algorithms, particularly in target detection algorithms based on deep neural networks, has led to significant advancements in various fields. However, recent research on target detection algorithms has shifted towards small sample scenarios with long-tailed distribution of categories, where achieving high accuracy target detection with limited data has become a crucial research topic. Deep neural networks often face several challenges when dealing with limited data, including convergence problems, overfitting, and poor generalization performance. In such scenarios, categories with little data are easily overwhelmed by the negative gradients generated by other categories during network training, which affects the final detection results. To address this issue, an unsupervised contrast learning algorithm has been proposed that can achieve accurate results on a small number of reference datasets without requiring a large number of datasets. One recently proposed contrast learning algorithm is PixelCL, which combines information from image depth in pretraining to improve results. The results of this algorithm show that it can obtain more accurate results through contrast learning with limited sample data. These findings highlight the potential of contrast learning algorithms in addressing negative gradient issues and improving the performance of deep neural networks in target detection tasks with limited data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2560/1/012048"
    },
    {
        "id": 7554,
        "title": "Segmentation for Factoring Customers: Using Unsupervised Machine Learning Algorithms",
        "authors": "Nur Seher Ayyıldız, Ahmet Akçay, Berat Yalçuva, Alperen Sayar, Seyit Ertuğrul, Tuna Çakar",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296639"
    },
    {
        "id": 7555,
        "title": "Comparison of Machine Learning Classification and Clustering Algorithms for TV Commercials Detection",
        "authors": "Eman Abdelfattah, Shreehar Joshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3325888"
    },
    {
        "id": 7556,
        "title": "An Unsupervised Machine Learning Algorithms: Comprehensive Review",
        "authors": "Samreen Naeem, Aqib Ali, Sania Anam, Muhammad Munawar Ahmed",
        "published": "2023-4-16",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12785/ijcds/130172"
    },
    {
        "id": 7557,
        "title": "Special Issue on Supervised and Unsupervised Classification Algorithms—Foreword from Guest Editors",
        "authors": "Laura Antonelli, Mario Rosario Guarracino",
        "published": "2023-3-7",
        "citations": 1,
        "abstract": "Supervised and unsupervised classification algorithms are the two main branches of machine learning [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16030145"
    },
    {
        "id": 7558,
        "title": "Implementing Unsupervised Machine Learning Algorithms for Image Processing in Post-Stack Seismic Data to Delineated Structural Geological Features",
        "authors": "A. A. Aqrawi, A. A. Aqrawi",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "Seismic attribute calculations have been traditionally used for measuring specific traits in seismic data for further interpretation (Chopra and Marfurt 2007). These calculations tend to have a fixed operator or window size from one sample to the other during the computation. They also tend to focus on single measurements and rely heavily on user input for parameterization. This tends to make it hard to reproduce results between users or even understand the certain choices made by various experts as they do their measurements and calculations on the seismic data. This can also be very limiting given the varied nature of the seismic signal and aspects such as seismic attenuation. One will tend to easily over sample or under sample at any given state in the seismic data as the signal changes, ultimately yielding results that need to be tweaked repetitively to get the perfect fit for the given depth/time the features of interest are in. We have looked at how we can calculate signal decomposition features for typical fluvial system detection in an adaptive fashion to overcome some of these challenges (Aqrawi and Aqrawi 2014).\nIn the past few decades, the concept of using Artificial Intelligence (AI) to develop Machine Learning (ML) models to solve challenging issues in the various industrial sectors and in academia has skyrocketed, and for a good reason as well. As time has gone on, it has become clear that the \"fourth industrial revolution\" is the digital transformation, which is characterized by the convergence of technologies like robotics, artificial intelligence, and autonomous vehicles that blur the lines between the physical, digital, and biological realms (Sircar, et al. 2021) (See Figure 1, which represents the various fields of AI and ML).\nMachine learning, which is a subset of AI, is defined as a computing paradigm in which the ability to solve the presented problem is developed by referring to similar prior cases called training examples. It reasons the problem by \"learning\" from the training examples. There are several tasks to which we can apply ML methods to. These include:",
        "keywords": "",
        "link": "http://dx.doi.org/10.4043/32929-ms"
    },
    {
        "id": 7559,
        "title": "Unsupervised Transformer-Based Anomaly Detection in ECG Signals",
        "authors": "Abrar Alamr, Abdelmonim Artoli",
        "published": "2023-3-9",
        "citations": 10,
        "abstract": "Anomaly detection is one of the basic issues in data processing that addresses different problems in healthcare sensory data. Technology has made it easier to collect large and highly variant time series data; however, complex predictive analysis models are required to ensure consistency and reliability. With the rise in the size and dimensionality of collected data, deep learning techniques, such as autoencoder (AE), recurrent neural networks (RNN), and long short-term memory (LSTM), have gained more attention and are recognized as state-of-the-art anomaly detection techniques. Recently, developments in transformer-based architecture have been proposed as an improved attention-based knowledge representation scheme. We present an unsupervised transformer-based method to evaluate and detect anomalies in electrocardiogram (ECG) signals. The model architecture comprises two parts: an embedding layer and a standard transformer encoder. We introduce, implement, test, and validate our model in two well-known datasets: ECG5000 and MIT-BIH Arrhythmia. Anomalies are detected based on loss function results between real and predicted ECG time series sequences. We found that the use of a transformer encoder as an alternative model for anomaly detection enables better performance in ECG time series data. The suggested model has a remarkable ability to detect anomalies in ECG signal and outperforms deep learning approaches found in the literature on both datasets. In the ECG5000 dataset, the model can detect anomalies with 99% accuracy, 99% F1-score, 99% AUC score, 98.1% recall, and 100% precision. In the MIT-BIH Arrhythmia dataset, the model achieved an accuracy of 89.5%, F1 score of 92.3%, AUC score of 93%, recall of 98.2%, and precision of 87.1%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16030152"
    },
    {
        "id": 7560,
        "title": "Kore Initial Clustering for Unsupervised Domain Adaptation",
        "authors": "Kyungsik Lee, Youngmi Jun, EunJi Kim, Suhyun Kim, Seong Hwang, Jonghyun Choi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012353200003660"
    },
    {
        "id": 7561,
        "title": "Dynamic Graph Clustering Learning for Unsupervised Diabetic Retinopathy Classification",
        "authors": "Chenglin Yu, Hailong Pei",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "Diabetic retinopathy (DR) is a common complication of diabetes, which can lead to vision loss. Early diagnosis is crucial to prevent the progression of DR. In recent years, deep learning approaches have shown promising results in the development of an intelligent and efficient system for DR classification. However, one major drawback is the need for expert-annotated datasets, which are both time-consuming and costly. To address these challenges, this paper proposes a novel dynamic graph clustering learning (DGCL) method for unsupervised classification of DR, which innovatively deploys the Euclidean and topological features from fundus images for dynamic clustering. Firstly, a multi-structural feature fusion (MFF) module extracts features from the structure of the fundus image and captures topological relationships among multiple samples, generating a fused representation. Secondly, another consistency smoothing clustering (CSC) module combines network updates and deep clustering to ensure stability and smooth performance improvement during model convergence, optimizing the clustering process by iteratively updating the network and refining the clustering results. Lastly, dynamic memory storage is utilized to track and store important information from previous iterations, enhancing the training stability and convergence. During validation, the experimental results with public datasets demonstrated the superiority of our proposed DGCL network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13203251"
    },
    {
        "id": 7562,
        "title": "Unsupervised Stock Clustering Based on Adversarial Learning and Its Application in Quantitative Investment",
        "authors": "Jiachen Ke, Renjie Xie, Wei Xu",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616712.3616765"
    },
    {
        "id": 7563,
        "title": "A Comparative Study of Fast and Accurate Clustering Algorithms in Multi-Sized Data Sets",
        "authors": "",
        "published": "2024-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14738/tecs.122.14317"
    },
    {
        "id": 7564,
        "title": "Scalable Machine Learning: Development of Efficient Clustering Algorithms for High-Volume Temporal Data Analysis",
        "authors": "Madhur Taneja",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsai59793.2023.10421711"
    },
    {
        "id": 7565,
        "title": "Sentiment clustering using the unsupervised machine learning approach",
        "authors": "Abinash Tripathy, Utpal Chandra De, Bibhuti Bhusan Dash, Sudhansu Shekhar Patra, Binod Kumar Pattanayak, Trilok Nath Pandey",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrtac59277.2023.10480817"
    },
    {
        "id": 7566,
        "title": "Integrating Unsupervised Clustering and Label-Specific Oversampling to Tackle Imbalanced Multi-Label Data",
        "authors": "Payel Sadhukhan, Arjun Pakrashi, Sarbani Palit, Brian Namee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011901200003393"
    },
    {
        "id": 7567,
        "title": "Hand Sign Classification Techniques Using Supervised And Unsupervised Learning Algorithms",
        "authors": "J L V Sri Harshitha, N Saranya, Yekkitilli Sruthi, S Srithar, J Vijaya Chandra",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128426"
    },
    {
        "id": 7568,
        "title": "Unsupervised graph-based image clustering for pretext distribution learning in IC assurance",
        "authors": "Yee-Yang Tee, Xuenong Hong, Deruo Cheng, Tong Lin, Yiqiong Shi, Bah-Hwee Gwee",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.microrel.2023.115160"
    },
    {
        "id": 7569,
        "title": "Unsupervised Clustering on Paleochannel Detection with Curvature-Based Attribute",
        "authors": "Bilal Hungund, Fan Jiang",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract\nThis research focuses on the application of advanced seismic data processing techniques and unsupervised clustering algorithms to accurately identify and map paleochannels in the high-resolution Maui seismic dataset. Pre-processing steps were applied to enhance data quality, followed by the calculation of a positive curvature attribute used as input for multiple clustering algorithms. The study evaluates four state-of-the-art unsupervised clustering methods and employs Principal Component Analysis (PCA) for result refinement and differentiation. By analysing the effectiveness of the algorithms, we demonstrate that Fuzzy C-means and Birch provide optimal segmentation of paleochannels. This automated approach not only overcomes the challenges of noisy data but also opens avenues for similar applications in seismic interpretation. The research underscores the significance of the unsupervised method in facilitating efficient resource exploration, emphasizing the integration of PCA to enhance segmentation accuracy and reduce human intervention. This study contributes to the sustainable management and extraction of natural resources, underscoring the potential of advanced techniques in remote sensing analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-23429-ea"
    },
    {
        "id": 7570,
        "title": "Unsupervised Group Re-identification via Adaptive Clustering-Driven Progressive Learning",
        "authors": "Hongxu Chen, Quan Zhang, Jian-Huang Lai, Xiaohua Xie",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Group re-identification (G-ReID) aims to correctly associate groups with the same members captured by different cameras. However, supervised approaches for this task often suffer from the high cost of cross-camera sample labeling. Unsupervised methods based on clustering can avoid sample labeling, but the problem of member variations often makes clustering unstable, leading to incorrect pseudo-labels. To address these challenges, we propose an adaptive clustering-driven progressive learning approach (ACPL), which consists of a group adaptive clustering (GAC) module and a global dynamic prototype update (GDPU) module. Specifically, GAC designs the quasi-distance between groups, thus fully capitalizing on both individual-level and holistic information within groups. In the case of great uncertainty in intra-group members, GAC effectively minimizes the impact of non-discriminative features and reduces the noise in the model's pseudo-labels. Additionally, our GDPU devises a dynamic weight to update the prototypes and effectively mine the hard samples with complex member variations, which improves the model's robustness. Extensive experiments conducted on four popular G-ReID datasets demonstrate that our method not only achieves state-of-the-art performance on unsupervised G-ReID but also performs comparably to several fully supervised approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i2.27866"
    },
    {
        "id": 7571,
        "title": "A Systematic Literature Review on Identifying Patterns Using Unsupervised Clustering Algorithms: A Data Mining Perspective",
        "authors": "Mahnoor Chaudhry, Imran Shafi, Mahnoor Mahnoor, Debora Libertad Ramírez Vargas, Ernesto Bautista Thompson, Imran Ashraf",
        "published": "2023-8-31",
        "citations": 2,
        "abstract": "Data mining is an analytical approach that contributes to achieving a solution to many problems by extracting previously unknown, fascinating, nontrivial, and potentially valuable information from massive datasets. Clustering in data mining is used for splitting or segmenting data items/points into meaningful groups and clusters by grouping the items that are near to each other based on certain statistics. This paper covers various elements of clustering, such as algorithmic methodologies, applications, clustering assessment measurement, and researcher-proposed enhancements with their impact on data mining thorough grasp of clustering algorithms, its applications, and the advances achieved in the existing literature. This study includes a literature search for papers published between 1995 and 2023, including conference and journal publications. The study begins by outlining fundamental clustering techniques along with algorithm improvements and emphasizing their advantages and limitations in comparison to other clustering algorithms. It investigates the evolution measures for clustering algorithms with an emphasis on metrics used to gauge clustering quality, such as the F-measure and the Rand Index. This study includes a variety of clustering-related topics, such as algorithmic approaches, practical applications, metrics for clustering evaluation, and researcher-proposed improvements. It addresses numerous methodologies offered to increase the convergence speed, resilience, and accuracy of clustering, such as initialization procedures, distance measures, and optimization strategies. The work concludes by emphasizing clustering as an active research area driven by the need to identify significant patterns and structures in data, enhance knowledge acquisition, and improve decision making across different domains. This study aims to contribute to the broader knowledge base of data mining practitioners and researchers, facilitating informed decision making and fostering advancements in the field through a thorough analysis of algorithmic enhancements, clustering assessment metrics, and optimization strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sym15091679"
    },
    {
        "id": 7572,
        "title": "Two Medoid-Based Algorithms for Clustering Sets",
        "authors": "Libero Nigro, Pasi Fränti",
        "published": "2023-7-20",
        "citations": 1,
        "abstract": "This paper proposes two algorithms for clustering data, which are variable-sized sets of elementary items. An example of such data occurs in the analysis of a medical diagnosis, where the goal is to detect human subjects who share common diseases to possibly predict future illnesses from previous medical history. The first proposed algorithm is based on K-medoids and the second algorithm extends the random swap algorithm, which has proven to be capable of efficient and careful clustering; both algorithms depend on a distance function among data objects (sets), which can use application-sensitive weights or priorities. The proposed distance function makes it possible to exploit several seeding methods that can improve clustering accuracy. A key factor in the two algorithms is their parallel implementation in Java, based on functional programming using streams and lambda expressions. The use of parallelism smooths out the O(N2) computational cost behind K-medoids and clustering indexes such as the Silhouette index and allows for the handling of non-trivial datasets. This paper applies the algorithms to several benchmark case studies of sets and demonstrates how accurate and time-efficient clustering solutions can be achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16070349"
    },
    {
        "id": 7573,
        "title": "Identifying the authenticity and geographical origin of rice by analyzing hyperspectral images using unsupervised clustering algorithms",
        "authors": "Mahsa Edris, Mahdi Ghasemi-Varnamkhasti, Sajad Kiani, Hassan Yazdanpanah, Zahra Izadi",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jfca.2023.105737"
    },
    {
        "id": 7574,
        "title": "An Unsupervised Feature Extraction Using Endmember Extraction and Clustering Algorithms for Dimension Reduction of Hyperspectral Images",
        "authors": "Sayyed Hamed Alizadeh Moghaddam, Saeed Gazor, Fahime Karami, Meisam Amani, Shuanggen Jin",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "Hyperspectral images (HSIs) provide rich spectral information, facilitating many applications, including landcover classification. However, due to the high dimensionality of HSIs, landcover mapping applications usually suffer from the curse of dimensionality, which degrades the efficiency of supervised classifiers due to insufficient training samples. Feature extraction (FE) is a popular dimension reduction strategy for this issue. This paper proposes an unsupervised FE algorithm that involves extracting endmembers and clustering spectral bands. The proposed method first extracts existing endmembers from the HSI data via a vertex component analysis method. Using these endmembers, it subsequently constructs a prototype space (PS) in which each spectral band is represented by a point. Similar/correlated bands in the PS remain near one another, forming several clusters. Therefore, our method, in the next step, clusters spectral bands into multiple clusters via K-means and fuzzy C-means algorithms. Finally, it combines all the spectral bands in the same cluster using a weighted average operator to decrease the high dimensionality. The extracted features were evaluated by applying an SVM classifier. The experimental results confirmed the superior performance of the proposed method compared with five state-of-the-art dimension reduction algorithms. It outperformed these algorithms in terms of classification accuracy on three widely used hyperspectral images (Indian Pines, KSC, and Pavia Centre). The suggested technique also showed comparable or even stronger performance (up to 9% improvement) compared with its supervised competitor. Notably, the proposed method exhibited higher accuracy even when only a limited number of training samples were available for supervised classification. Using only five training samples per class for the KSC and Pavia Centre datasets, our method’s classification accuracy was higher than that of its best-performing unsupervised competitors by about 7% and 1%, respectively, in our experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15153855"
    },
    {
        "id": 7575,
        "title": "Fully Unsupervised Topic Clustering of Unlabelled Spoken Audio Using Self-Supervised Representation Learning and Topic Model",
        "authors": "Takashi Maekaku, Yuya Fujita, Xuankai Chang, Shinji Watanabe",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095280"
    },
    {
        "id": 7576,
        "title": "OP0198 UNSUPERVISED MACHINE LEARNING FOR PATIENT CLUSTERING IN CHRONIC REFRACTORY PAIN SYNDROMES AND FIBROMYALGIA: RESULTS FROM A MULTIMODAL TREATMENT PROGRAM",
        "authors": "T. Hügle, T. Pretat, C. Lovejoy, P. Ming Azevedo",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/annrheumdis-2023-eular.1220"
    },
    {
        "id": 7577,
        "title": "Correction to: Longitudinal clustering of Life’s Essential 8 health metrics: application of a novel unsupervised learning method in the CARDIA study",
        "authors": "",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jamia/ocae021"
    },
    {
        "id": 7578,
        "title": "Utilizing Clustering Algorithms to Provide Vark Learning Style Recommendations",
        "authors": "MS Hasibuan, RZ Abdul Aziz, Sigit A",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eecsi59885.2023.10295933"
    },
    {
        "id": 7579,
        "title": "Dynamic Context-Aware Recommender System for Home Automation Through Synergistic Unsupervised and Supervised Learning Algorithms",
        "authors": "Tahar Dilekh, Saber Benharzallah, Ayoub Mokeddem, Saoueb Kerdoudi",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18267/j.aip.228"
    },
    {
        "id": 7580,
        "title": "Application of unsupervised machine learning algorithms to credit classification methods for tobacco retailers",
        "authors": "Lili Zhu, Jun Xiao, Hao Jiang, Liang Zhang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper uses a clustering algorithm to extract and classify credit rating features of tobacco retailers and evaluates whether the classification results are reasonable by combining clustering evaluation indexes. The distance between samples is calculated using the similarity measure. The natural domain method density and peak clustering method are used to analyze the distribution of sample points in the data set. Combining the cluster analysis creates the tobacco retail credit rating evaluation index. The results show that cluster analysis can effectively extract credit rating features from tobacco retailers. When the number of features is 25, the model has the best classification effect, with a classification accuracy rate of 91.1%, a recall rate of 91.5%, and an F1 value of 91.3%. The classification of tobacco retailers’ credit ratings can be improved effectively by the research in this paper.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00940"
    },
    {
        "id": 7581,
        "title": "Dynamic Clustering and Cluster Contrastive Learning for Unsupervised Person Re-Id With Feature Distribution Alignment",
        "authors": "Ziqi He, Mengjia Xue, Yunhao Du, Zhicheng Zhao, Fei Su",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447711"
    },
    {
        "id": 7582,
        "title": "Specification Mining Based on the Ordering Points to Identify the Clustering Structure Clustering Algorithm and Model Checking",
        "authors": "Yiming Fan, Meng Wang",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Software specifications are of great importance to improve the quality of software. To automatically mine specifications from software systems, some specification mining approaches based on finite-state automatons have been proposed. However, these approaches are inaccurate when dealing with large-scale systems. In order to improve the accuracy of mined specifications, we propose a specification mining approach based on the ordering points to identify the clustering structure clustering algorithm and model checking. In the approach, the neural network model is first used to produce the feature values of states in the traces of the program. Then, according to the feature values, finite-state automatons are generated based on the ordering points to identify the clustering structure clustering algorithm. Further, the finite-state automaton with the highest F-measure is selected. To improve the quality of the finite-state automatons, we refine it based on model checking. The proposed approach was implemented in a tool named MCLSM and experiments, including 13 target classes, were conducted to evaluate its effectiveness. The experimental results show that the average F-measure of finite-state automatons generated by our method reaches 92.19%, which is higher than most related tools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a17010028"
    },
    {
        "id": 7583,
        "title": "Unsupervised Representation Learning by Quasiconformal Extension",
        "authors": "Hirokazu Shimauchi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012254500003595"
    },
    {
        "id": 7584,
        "title": "Time dependent Pinch analysis with sensor data and unsupervised learning algorithms",
        "authors": "U Halisdemir, Q Dumont, A Jean-Marie",
        "published": "2023-2-1",
        "citations": 1,
        "abstract": "Abstract\nHeat integration is essential for energy efficiency and operational cost reduction in energy-related applications. Pinch Analysis is a heat integration model that has attracted a lot of attention over the past few decades. Although the method has been successfully applied to many industrial processes, it has also been shown to have many limitations. One of these limitations is that the method only considers the average values of the physical quantities of a process, and therefore is not suitable for studying dynamic processes that undergo variations in their operating conditions. Attempts have been made to improve Pinch Analysis to circumvent this limitation, but they have been found to oversimplify and result in unrealistic solutions. The purpose of this work is to use sensor data and unsupervised learning algorithms to extend Pinch Analysis to dynamic processes. Specifically, we use time series segmentation to detect changes in the process operating conditions and clustering to group similar segments. The approach is applied to a real industrial use case. We compare the performance of heat exchanger network with and without data analysis. The solutions obtained with our methodology improves waste heat recovery by 20% while reducing the cost of the heat exchanger network by 31%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2430/1/012001"
    },
    {
        "id": 7585,
        "title": "An autoencoder-based fast online clustering algorithm for evolving data stream",
        "authors": "Dazheng Gao",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590020"
    },
    {
        "id": 7586,
        "title": "Efficient Clustering of Brain Tumor Segments using Level-set Hybrid Machine Learning Algorithms",
        "authors": "He Lvliang, Wu Hua",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "Cluster computing is an essential technology in distributed environments for practical data analysis in complex datasets like tumor segmentation, disease classification etc. Today real-world applications like medicine and transport are needed for big data analytics environments. This research article considers complex image data environments like brain tumor segmentation based on advanced clustering techniques for effective tumor prediction. An a-state-of-art analysis used Hierarchical clustering to extract initial tumor segments from the image. The next segment is further refined using novel Noise detection-based level-setting techniques. The unsupervised Fuzzy C-means and k- means clustering is used to segment the diseases affected region to enhance noise detection used in the level set. Effective features are extracted using gray level co-occurrence matrix and redundant discrete wavelet transform. Finally, classifying malignant and benign brain tumor images is done using deep probabilistic neural networks. Publicly available datasets are used to validate the proposed algorithms. Experimental results prove that proposed pipeline techniques have effective performance in tumor segmentation and classification model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12694/scpe.v24i4.2141"
    },
    {
        "id": 7587,
        "title": "Cell Consistency Evaluation Method Based on Multiple Unsupervised Learning Algorithms",
        "authors": "Jiang Chang, Xianglong Gu, Jieyun Wu, Debu Zhang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26599/bdma.2023.9010003"
    },
    {
        "id": 7588,
        "title": "Breast Cancer Prediction Using Unsupervised Learning Technique K-Means Clustering Algorithm",
        "authors": "Soumyalatha Naveen, Nachiketh V. Kashyap, Varun P Kulkarni, Sandeep A, Meruva Sai Chakradhar",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vitecon58111.2023.10157765"
    },
    {
        "id": 7589,
        "title": "Multiview Data Clustering with Similarity Graph Learning Guided Unsupervised Feature Selection",
        "authors": "Ni Li, Manman Peng, Qiang Wu",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "In multiview data clustering, consistent or complementary information in the multiview data can achieve better clustering results. However, the high dimensions, lack of labeling, and redundancy of multiview data certainly affect the clustering effect, posing a challenge to multiview clustering. A clustering algorithm based on multiview feature selection clustering (MFSC), which combines similarity graph learning and unsupervised feature selection, is designed in this study. During the MFSC implementation, local manifold regularization is integrated into similarity graph learning, with the clustering label of similarity graph learning as the standard for unsupervised feature selection. MFSC can retain the characteristics of the clustering label on the premise of maintaining the manifold structure of multiview data. The algorithm is systematically evaluated using benchmark multiview and simulated data. The clustering experiment results prove that the MFSC algorithm is more effective than the traditional algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25121606"
    },
    {
        "id": 7590,
        "title": "Unsupervised Seizure Detection in Eeg Using Long Short Term Memory Network and Clustering",
        "authors": "Samayan Bhattacharya, Alexis Bennett, Celina Alba, Kseniia Kriukova, Dominique Duncan",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285945"
    },
    {
        "id": 7591,
        "title": "Empirical Analysis of Supervised and Unsupervised Machine Learning Algorithms with Aspect-Based Sentiment Analysis",
        "authors": "Satwinder Singh, Harpreet Kaur, Rubal Kanozia, Gurpreet Kaur",
        "published": "2023-6-1",
        "citations": 3,
        "abstract": "Abstract\nMachine learning based sentiment analysis is an interdisciplinary approach in opinion mining, particularly in the field of media and communication research. In spite of their different backgrounds, researchers have collaborated to test, train and again retest the machine learning approach to collect, analyse and withdraw a meaningful insight from large datasets. This research classifies the texts of micro-blog (tweets) into positive and negative responses about a particular phenomenon. The study also demonstrates the process of compilation of corpus for review of sentiments, cleaning the body of text to make it a meaningful text, find people’s emotions about it, and interpret the findings. Till date the public sentiment after abrogation of Article 370 has not been studied, which adds the novelty to this scientific study. This study includes the dataset collection from Twitter that comprises 66.7 % of positive tweets and 34.3 % of negative tweets of the people about the abrogation of Article 370. Experimental testing reveals that the proposed methodology is much more effective than the previously proposed methodology. This study focuses on comparison of unsupervised lexicon-based models (TextBlob, AFINN, Vader Sentiment) and supervised machine learning models (KNN, SVM, Random Forest and Naïve Bayes) for sentiment analysis. This is the first study with cyber public opinion over the abrogation of Article 370. Twitter data of more than 2 lakh tweets were collected by the authors. After cleaning, 29732 tweets were selected for analysis. As per the results among supervised learning, Random Forest performs the best, whereas among unsupervised learning TextBlob achieves the highest accuracy of 99 % and 88 %, respectively. Performance parameters of the proposed supervised machine learning models also surpass the result of the recent study performed in 2023 for sentiment analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/acss-2023-0012"
    },
    {
        "id": 7592,
        "title": "A visual analysis of domestic county medical community research based on clustering algorithms",
        "authors": "Guoqin Zhang, Haiyang Nie",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3650215.3650313"
    },
    {
        "id": 7593,
        "title": "A recommendation model for college majors based on deep learning and clustering algorithms",
        "authors": "Yu Jian, Ning Xiao, Li Youfeng",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "Many colleges in China have adopted the policy of recruiting students by academic subject categories in order to optimize the talent training mode. To solve the problems in major selection after enrollment, this paper has designed an intelligent algorithm model for recommending college majors. Compared with existing methods for assigning college majors, the model uses deep neural networks and clustering algorithms to simulate complex calculations in the human brain. It uses historical learning data from senior students or graduates to predict the future grades of freshmen, judge their adaptability to various college majors, reduce human interference in the college major selection process, recommend the most suitable college major to students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/isu-230201"
    },
    {
        "id": 7594,
        "title": "Diagnosis of robotic arm anomalous sounds using unsupervised learning algorithms",
        "authors": "Zi-Wei Zheng, Tzu-huan Peng, Yu-Ting Tsai",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "In this paper, we develop a technique that integrates acoustics detection with artificial intelligence, empowering robotic arms in production environments with the capacity to monitor, diagnose, and predict anomalies. We combine the deep learning techniques of AI with audio signals collected by an array of microphones. We predict the health status of equipment systems and prevent equipment failure by using this sound data. Our novel approach focuses on converting and analyzing environmental acoustics data. The distinctive contribution of this research lies in its strategy learning and inference. By harnessing large-scale audio data information, we establish AI learning models that automatically parse input data to recognize audio features. We also employ device scheduling operations for comparative detection, endowing the equipment with abnormal diagnosis and prediction capabilities. We utilize commercially available microphone devices for sound collection, voice activity detection, and spectrogram reduction for signal preprocessing and capture before we create a dataset. Finally, we use the Gaussian mixture model (GMM) for unsupervised learning, estimating the probability density of data, and calculating GMM scores of data points for in-depth analysis. In this way, we can judge whether the sound signals collected by the microphone are abnormal.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1121/10.0023059"
    },
    {
        "id": 7595,
        "title": "Quantum kernel subspace alignment for unsupervised domain adaptation",
        "authors": "Xi He, Feiyu Du",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590054"
    },
    {
        "id": 7596,
        "title": "Possibilities of identifying members from Milky Way satellite galaxies using unsupervised machine learning algorithms",
        "authors": "Devika K. Divakar, Pallavi Saraf, Thirupathi Sivarani, Vijayakumar H. Doddamani",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12036-023-09990-4"
    },
    {
        "id": 7597,
        "title": "Unsupervised and Supervised Machine Learning Methods for Cutting Tool Path Clustering and RUL Estimation in Manufacturing",
        "authors": "Fabio C. Zegarra, Juan Vargas-Machuca, Avid Roman-Gonzalez, Alberto M. Coronado",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36897/jme/171432"
    },
    {
        "id": 7598,
        "title": "Research on learning video recommendation system based on DBSCAN clustering algorithm",
        "authors": "Xidong Liu, Xianwei Xue",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011632"
    },
    {
        "id": 7599,
        "title": "Uncertainty clustering internal validity assessment using Fréchet distance for unsupervised learning",
        "authors": "Nestor Rendon, Jhony H. Giraldo, Thierry Bouwmans, Susana Rodríguez-Buritica, Edison Ramirez, Claudia Isaza",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106635"
    },
    {
        "id": 7600,
        "title": "CLUSTERING ANALYSIS OF ADMISSION OF NEW STUDENTS USING K-MEANS CLUSTERING AND K-MEDOIDS ALGORITHMS TO INCREASE CAMPUS MARKETING POTENTIAL",
        "authors": "Hasan Amin",
        "published": "2023-8-29",
        "citations": 1,
        "abstract": "Acceptance of new students is a very important activity for a high school or university. The admissions data has not been utilized by the campus in making strategic decisions, marketing potential, and considering invitations through academic admissions. So, to assist in processing the new student admissions data, in this study the design and analysis of new student admissions data was carried out using stages in data mining. The clustering method approach can be applied in analyzing the potential level of PMB quality produced by utilizing the PMB recording dataset for the 2023 period. 86 data records. The K-Means and K-Medoids algorithm models that are applied have results that show a new insight, namely grouping based on 2 clusters, cluster 1 (C0) is a pass category while cluster 2 (C1) has not been determined. The results of the K-Medoids algorithm which has cluster 1 (C0) 60 results, cluster 2 (C1) has 26 results is a potential pass of 60 and has not yet been determined 26 of the data tested 86 while the results of the K-Means cluster 1 algorithm (C0) 40 , cluster 2 ( C1 ) 46 is a potential pass consisting of 40 and 46 undetermined data from the 86 datasets tested. Testing using the RapidMiner Studio application can also produce similar insights, namely each cluster has Davies Bouldin Index or DBI results from each K-Means and K-Medoids algorithm. K-Means has a Davies Bouldin Index result of -0.533 while K-Medoids has a Davies Bouldin Index result of -0.877",
        "keywords": "",
        "link": "http://dx.doi.org/10.31253/te.v7i1.2264"
    },
    {
        "id": 7601,
        "title": "Unsupervised Point Cloud Representation Learning by Clustering and Neural Rendering",
        "authors": "Guofeng Mei, Cristiano Saltori, Elisa Ricci, Nicu Sebe, Qiang Wu, Jian Zhang, Fabio Poiesi",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "AbstractData augmentation has contributed to the rapid advancement of unsupervised learning on 3D point clouds. However, we argue that data augmentation is not ideal, as it requires a careful application-dependent selection of the types of augmentations to be performed, thus potentially biasing the information learned by the network during self-training. Moreover, several unsupervised methods only focus on uni-modal information, thus potentially introducing challenges in the case of sparse and textureless point clouds. To address these issues, we propose an augmentation-free unsupervised approach for point clouds, named CluRender, to learn transferable point-level features by leveraging uni-modal information for soft clustering and cross-modal information for neural rendering. Soft clustering enables self-training through a pseudo-label prediction task, where the affiliation of points to their clusters is used as a proxy under the constraint that these pseudo-labels divide the point cloud into approximate equal partitions. This allows us to formulate a clustering loss to minimize the standard cross-entropy between pseudo and predicted labels. Neural rendering generates photorealistic renderings from various viewpoints to transfer photometric cues from 2D images to the features. The consistency between rendered and real images is then measured to form a fitting loss, combined with the cross-entropy loss to self-train networks. Experiments on downstream applications, including 3D object detection, semantic segmentation, classification, part segmentation, and few-shot learning, demonstrate the effectiveness of our framework in outperforming state-of-the-art techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11263-024-02027-5"
    },
    {
        "id": 7602,
        "title": "Mine local homogeneous representation by interaction information clustering with unsupervised learning in histopathology images",
        "authors": "Jing Ke, Yiqing Shen, Yizhou Lu, Yi Guo, Dinggang Shen",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cmpb.2023.107520"
    },
    {
        "id": 7603,
        "title": "Combating Financial Crimes with Unsupervised Learning Techniques: Clustering and Dimensionality Reduction for Anti-Money Laundering",
        "authors": "Ahmed N. Bakry, Almohammady S. Alsharkawy, Mohamed S. Farag, Kamal R. Raslan",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58675/2636-3305.1664"
    },
    {
        "id": 7604,
        "title": "Unsupervised Sensor-Based Continuous Authentication With Low-Rank Transformer Using Learning-to-Rank Algorithms",
        "authors": "Zhenyu Yang, Yantao Li, Gang Zhou",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmc.2024.3353209"
    },
    {
        "id": 7605,
        "title": "Transformational Entrepreneurship and Digital Platforms: A Combination of ISM-MICMAC and Unsupervised Machine Learning Algorithms",
        "authors": "Pejman Ebrahimi, Hakimeh Dustmohammadloo, Hosna Kabiri, Parisa Bouzari, Mária Fekete-Farkas",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "For many years, entrepreneurs were considered the change agents of their societies. They use their initiative and innovative minds to solve problems and create value. In the aftermath of the digital transformation era, a new group of entrepreneurs have emerged who are called transformational entrepreneurs. They use various digital platforms to create value. Surprisingly, despite their importance, they have not been sufficiently investigated. Therefore, this research scrutinizes the elements affecting transformational entrepreneurship in digital platforms. To do so, the authors have considered a two-phase method. First, interpretive structural modeling (ISM) and Matrices d’Impacts Croises Multiplication Appliqué a Un Classement (MICMAC) are used to suggest a model. ISM is a qualitative method to reach a visualized hierarchical structure. Then, four unsupervised machine learning algorithms are used to ensure the accuracy of the proposed model. The findings reveal that transformational leadership could mediate the relationship between the entrepreneurial mindset and thinking and digital transformation, interdisciplinary approaches, value creation logic, and technology diffusion. The GMM in the full type, however, has the best accuracy among the various covariance types, with an accuracy of 0.895. From the practical point of view, this paper provides important insights for practitioners, entrepreneurs, and public actors to help them develop transformational entrepreneurship skills. The results could also serve as a guideline for companies regarding how to manage the consequences of a crisis such as a pandemic. The findings also provide significant insight for higher education policymakers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bdcc7020118"
    },
    {
        "id": 7606,
        "title": "Unsupervised Cyclic Siamese Networks Automating Cell Imagery Analysis",
        "authors": "Dominik Stallmann, Barbara Hammer",
        "published": "2023-4-12",
        "citations": 0,
        "abstract": "Novel neural network models that can handle complex tasks with fewer examples than before are being developed for a wide range of applications. In some fields, even the creation of a few labels is a laborious task and impractical, especially for data that require more than a few seconds to generate each label. In the biotechnological domain, cell cultivation experiments are usually done by varying the circumstances of the experiments, seldom in such a way that hand-labeled data of one experiment cannot be used in others. In this field, exact cell counts are required for analysis, and even by modern standards, semi-supervised models typically need hundreds of labels to achieve acceptable accuracy on this task, while classical image processing yields unsatisfactory results. We research whether an unsupervised learning scheme is able to accomplish this task without manual labeling of the given data. We present a VAE-based Siamese architecture that is expanded in a cyclic fashion to allow the use of labeled synthetic data. In particular, we focus on generating pseudo-natural images from synthetic images for which the target variable is known to mimic the existence of labeled natural data. We show that this learning scheme provides reliable estimates for multiple microscopy technologies and for unseen data sets without manual labeling. We provide the source code as well as the data we use. The code package is open source and free to use (MIT licensed).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16040205"
    },
    {
        "id": 7607,
        "title": "Deep learning algorithm of clustering analysis in IUR teaching system",
        "authors": "QI LIU, Zheng Gao, Yun Zhang",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006116"
    },
    {
        "id": 7608,
        "title": "Efficient optimization algorithms for various machine learning tasks, including classification, regression, and clustering",
        "authors": "Hengki Tamando Sihotang, Marc Albert, Fristi Riandari, Larry Rendell",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "The research on efficient optimization algorithms for machine learning is novel because it addresses several gaps in previous research and proposes new solutions to improve the efficiency and accuracy of machine learning models. Firstly, the proposed research focuses on developing more efficient algorithms for large-scale deep learning. While there have been many optimization algorithms proposed for deep learning, the proposed research aims to develop new algorithms that can handle the complexity and scale of these models and improve their efficiency. Secondly, the proposed research aims to explore the effectiveness of optimization algorithms for different types of machine learning tasks. While many studies have focused on deep learning, the proposed research aims to evaluate the effectiveness of optimization algorithms for other types of machine learning tasks, such as reinforcement learning, unsupervised learning, and semi-supervised learning. Thirdly, the proposed research aims to develop optimization algorithms that can handle noisy and incomplete data, which is a significant challenge for machine learning models. The proposed research aims to develop algorithms that can handle noisy and incomplete data and improve the accuracy of machine learning models. Fourthly, the proposed research aims to develop optimization algorithms that can handle non-convex objective functions. While some optimization techniques have been proposed for non-convex optimization, the proposed research aims to develop new algorithms that can handle these functions and improve the accuracy of machine learning models. The proposed research aims to investigate the trade-off between optimization efficiency and model performance. While previous research has explored this trade-off to some extent, the proposed research aims to develop algorithms that can balance these factors and optimize both efficiency and performance. The proposed research is novel because it addresses several gaps in previous research and proposes new solutions to improve the efficiency and accuracy of machine learning models for various tasks, including classification, regression, and clustering. By developing new algorithms and evaluating their effectiveness for different types of machine learning tasks, the proposed research can advance the field of machine learning and improve the accuracy and efficiency of machine learning models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35335/idea.v1i1.3"
    },
    {
        "id": 7609,
        "title": "A Taxonomy of Machine Learning Clustering Algorithms, Challenges, and Future Realms",
        "authors": "Shahneela Pitafi, Toni Anwar, Zubair Sharif",
        "published": "2023-3-9",
        "citations": 10,
        "abstract": "In the field of data mining, clustering has shown to be an important technique. Numerous clustering methods have been devised and put into practice, and most of them locate high-quality or optimum clustering outcomes in the field of computer science, data science, statistics, pattern recognition, artificial intelligence, and machine learning. This research provides a modern, thorough review of both classic and cutting-edge clustering methods. The taxonomy of clustering is presented in this review from an applied angle and the compression of some hierarchical and partitional clustering algorithms with various parameters. We also discuss the open challenges in clustering such as computational complexity, refinement of clusters, speed of convergence, data dimensionality, effectiveness and scalability, data object representation, evaluation measures, data streams, and knowledge extraction; scientists and professionals alike will be able to use it as a benchmark as they strive to advance the state-of-the-art in clustering techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13063529"
    },
    {
        "id": 7610,
        "title": "Unsupervised machine learning algorithms identify expected haemorrhage relationships but define unexplained coagulation profiles mapping to thrombotic phenotypes in hereditary haemorrhagic telangiectasia",
        "authors": "Ghazel Mukhtar, Claire L. Shovlin",
        "published": "2023-8",
        "citations": 2,
        "abstract": "AbstractHereditary haemorrhagic telangiectasia (HHT) can result in challenging anaemia and thrombosis phenotypes. Clinical presentations of HHT vary for relatives with identical casual mutations, suggesting other factors may modify severity. To examine objectively, we developed unsupervised machine learning algorithms to test whether haematological data at presentation could be categorised into sub‐groupings and fitted to known biological factors. With ethical approval, we examined 10 complete blood count (CBC) variables, four iron index variables, four coagulation variables and eight iron/coagulation indices combined from 336 genotyped HHT patients (40% male, 60% female, 86.5% not using iron supplementation) at a single centre. T‐SNE unsupervised, dimension reduction, machine learning algorithms assigned each high‐dimensional datapoint to a location in a two‐dimensional plane. k‐Means clustering algorithms grouped into profiles, enabling visualisation and inter‐profile comparisons of patients’ clinical and genetic features. The unsupervised machine learning algorithms using t‐SNE and k‐Means identified two distinct CBC profiles, two iron profiles, four clotting profiles and three combined profiles. Validating the methodology, profiles for CBC or iron indices fitted expected patterns for haemorrhage. Distinct coagulation profiles displayed no association with age, sex, C‐reactive protein, pulmonary arteriovenous malformations (AVMs), ENG/ACVRL1 genotype or epistaxis severity. The most distinct profiles were from t‐SNE/k‐Means analyses of combined iron‐coagulation indices and mapped to three risk states – for venous thromboembolism in HHT; for ischaemic stroke attributed to paradoxical emboli through pulmonary AVMs in HHT; and for cerebral abscess attributed to odontogenic bacteremias in immunocompetent HHT patients with right‐to‐left shunting through pulmonary AVMs. In conclusion, unsupervised machine learning algorithms categorise HHT haematological indices into distinct, clinically relevant profiles which are independent of age, sex or HHT genotype. Further evaluation may inform prophylaxis and management for HHT patients’ haemorrhagic and thrombotic phenotypes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jha2.746"
    },
    {
        "id": 7611,
        "title": "B-144 A Comparative Analysis of Unsupervised Machine Learning Algorithms for Polyploidy Analysis Using Flow Cytometry",
        "authors": "S Lee, K Kim, N Kim, J Park, J Lee, Y Cho, D Kim",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nRecently, there has been a growing interest in using cell differentiation inducers to produce platelets in vitro by inducing megakaryocytic differentiation in cell lines. During this process, cells undergo polyploidization through endomitosis. To measure the degree of polyploidy, cell cycle analysis by flow cytometry is commonly used. However, manual gating can be time-consuming and prone to human error, especially when analyzing large datasets. To address this issue, this study aimed to compare the performance of unsupervised machine learning algorithms for polyploidy analysis of flow cytometry data.\n\n\nMethods\nThe K562 cell line (Korea Cell Line Bank, Korea) was cultured under four conditions, including 1 nM and 2.5 nM of PMA (phorbol 12-myristate 13-acetate; Sigma Aldrich, USA) and 5 μg/mL of phytosphingosine (TCI, Japan), for four days. Propidium iodide (Sigma Aldrich, USA) was used to stain the cells for ploidy analysis, and flow cytometry (Navios, Beckman Coulter Inc, USA) was used to obtain the intensity values. Twelve flow cytometry measurements were obtained for K562 cells cultured under four different conditions, with each condition tested in triplicate. Unsupervised machine learning algorithms, including K-Means, Bisecting K-Means (BKM), Mini Batch K-Means (MBKM), Agglomerative Clustering (AC), Gaussian Mixture Models (GMM), K-Medoids, and Partitioning Around Medoids (PAM), were used to generate boundaries among three clusters (2n, 4n, and ≥8n). The boundary values generated by each algorithm were comparatively analyzed by calculating the standard derivation index (SDI) on each boundary. The concordance of each algorithm with manual gating of flow cytometry data was evaluated by calculating residual errors.\n\n\nResults\nA total of 168 SDI values were obtained from seven different unsupervised machine learning algorithms for two boundaries among 2n, 4n, and ≥8n clusters of four culture conditions in triplicate. When comparing the average (±95% confidence interval) of SDI for each algorithm for the entire dataset, K-Means showed the most acceptable average SDI value of −0.07 (±0.17) with the narrowest confidence interval followed by −0.13 (±0.54) of AC, −0.26 (±0.18) of MBKM, −0.53 (±0.2) of K-Medoids, −0.58 (±0.2) of PAM, 0.74 (±0.3) of GMM, and 0.84 (±0.35) of BKM. In addition, the average (±95% confidence interval) of the absolute value of the residual errors of each algorithm was calculated, with K-Means showing the lowest value of 6.67 (±2.3), indicating higher concordance with manual gating. AC, MBKM, K-Medoids, PAM, BKM, and GMM had higher average residual errors of 10.04 (±2.5), 10.46 (±4.07), 11.13 (±4.65), 12.04 (±4.83), 12.54 (±3.0), and 12.75 (±3.5), respectively.\n\n\nConclusion\nK-means demonstrated the best performance for clustering each ploidy among the seven unsupervised machine learning algorithms tested for the flow cytometry data. In addition, the algorithms achieved acceptable concordance with manual gating in most cases in this study. Therefore, unsupervised machine learning algorithms show promise in automating the gating of flow cytometry data for polyploidy analysis and measuring megakaryocytic differentiation in cell lines.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/clinchem/hvad097.477"
    },
    {
        "id": 7612,
        "title": "Melt Instability Identification Using Unsupervised Machine Learning Algorithms",
        "authors": "Alex Gansen, Julian Hennicker, Clemens Sill, Jean Dheur, Jack S. Hale, Jörg Baller",
        "published": "2023-6",
        "citations": 0,
        "abstract": "AbstractIn industrial extrusion processes, increasing shear rates can lead to higher production rates. However, at high shear rates, extruded polymers and polymer compounds often exhibit melt instabilities ranging from stick‐slip to sharkskin to gross melt fracture. These instabilities result in challenges to meet the specifications on the extrudate shape. Starting with an existing published data set on melt instabilities in polymer extrusion, we assess the suitability of clustering, unsupervised machine learning algorithms combined with feature selection, to extract and identify hidden and important features from this data set, and their possible relationship with melt instabilities. The data set consists of both intrinsic features of the polymer as well as extrinsic features controlled and measured during an extrusion experiment. Using a range of commonly available clustering algorithms, it is demonstrated that the features related to only the intrinsic properties of the data set can be reliably divided into two clusters, and that in turn, these two clusters may be associated with either the stick‐slip or sharkskin instability. Furthermore, using a feature ranking on both the intrinsic and extrinsic features of the data set, it is shown that the intrinsic properties of molecular weight and polydispersity are the strongest indicators of clustering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mame.202200628"
    },
    {
        "id": 7613,
        "title": "Interpretable unsupervised learning enables accurate clustering with high-throughput imaging flow cytometry",
        "authors": "Zunming Zhang, Xinyu Chen, Rui Tang, Yuxuan Zhu, Han Guo, Yunjia Qu, Pengtao Xie, Ian Y. Lian, Yingxiao Wang, Yu-Hwa Lo",
        "published": "2023-11-23",
        "citations": 1,
        "abstract": "AbstractA primary challenge of high-throughput imaging flow cytometry (IFC) is to analyze the vast amount of imaging data, especially in applications where ground truth labels are unavailable or hard to obtain. We present an unsupervised deep embedding algorithm, the Deep Convolutional Autoencoder-based Clustering (DCAEC) model, to cluster label-free IFC images without any prior knowledge of input labels. The DCAEC model first encodes the input images into the latent representations and then clusters based on the latent representations. Using the DCAEC model, we achieve a balanced accuracy of 91.9% for human white blood cell (WBC) clustering and 97.9% for WBC/leukemia clustering using the 3D IFC images and 3D DCAEC model. Above all, although no human recognizable features can separate the clusters of cells with protein localization, we demonstrate the fused DCAEC model can achieve a cluster balanced accuracy of 85.3% from the label-free 2D transmission and 3D side scattering images. To reveal how the neural network recognizes features beyond human ability, we use the gradient-weighted class activation mapping method to discover the cluster-specific visual patterns automatically. Evaluation results show that the automatically identified salient image regions have strong cluster-specific visual patterns for different clusters, which we believe is a stride for the interpretable neural network for cell analysis with high-throughput IFCs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-46782-w"
    },
    {
        "id": 7614,
        "title": "Comparative Analysis of Unsupervised Machine Learning Algorithms for Anomaly Detection in Network Data",
        "authors": "Júnia Maísa Oliveira, Jônatan Almeida, Daniel Macedo, José Marcos Nogueira",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/latincom59467.2023.10361849"
    },
    {
        "id": 7615,
        "title": "Mixing supervised and unsupervised learning algorithms to solve human perception subjectivity in internal fruit quality assessment",
        "authors": "Mirko Piani, Gianmarco Bortolotti, Dario Mengoli, Niccolò Raule, Francesco Spinelli, Luigi Manfrini",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/metroagrifor58484.2023.10424353"
    },
    {
        "id": 7616,
        "title": "Anomaly detection of train wheels utilizing short-time Fourier transform and unsupervised learning algorithms",
        "authors": "Ting Hei Wan, Chi Wai Tsang, King Hui, Edward Chung",
        "published": "2023-6",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106037"
    },
    {
        "id": 7617,
        "title": "Unsupervised social event detection via hybrid graph contrastive learning and reinforced incremental clustering",
        "authors": "Yuanyuan Guo, Zehua Zang, Hang Gao, Xiao Xu, Rui Wang, Lixiang Liu, Jiangmeng Li",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.111225"
    },
    {
        "id": 7618,
        "title": "Unsupervised deep learning for clustering tumor subcompartments in histopathological images of non-small cell lung cancer",
        "authors": "Matheus de Freitas Oliveira Baffa, Nadine S. Schaadt, Friedrich Feuerhake, Thomas M. Deserno",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3009180"
    },
    {
        "id": 7619,
        "title": "Intelligent Recommendation System Based on the Infusion Algorithms with Deep Learning, Attention Network and Clustering",
        "authors": "Wenjun Li",
        "published": "2023-5-13",
        "citations": 2,
        "abstract": "AbstractThe creation and use of big data have driven the intelligent development of e-commerce. The information generated in e-commerce provides a good means to analyze the behavior of users. How to use this information to give customer recommendations, improve the accuracy of recommendations and protect information security is a topic worth studying. For improving the accuracy of recommendations, analysis of users and tagging of resources are key. The current popular session recommendation algorithms face many problems, such as user interest drift which is difficult to be handled by these algorithms, thus affecting the recommendation accuracy. Based on these problems, this paper proposes a recommendation model based on deep learning, applies it to the clustering analysis of user tagging system, and designs a personalized recommendation algorithm for the tagging system. The model proposed in this paper can effectively analyze not only the interests exhibited by users in the current session, but also their potential long-term interests. By comparing the different performances of different datasets, the experimental results of this paper show that the proposed algorithmic model in this paper helps to dig the interests of different users, thus improving the quality of the recommendation system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s44196-023-00264-z"
    },
    {
        "id": 7620,
        "title": "Inter-Intra Modality Knowledge Learning and Clustering Noise Alleviation for Unsupervised Visible-Infrared Person Re-Identification",
        "authors": "Zhiyong Li, Haojie Liu, Xiantao Peng, Wei Jiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tkde.2024.3367304"
    },
    {
        "id": 7621,
        "title": "Unsupervised Time Series Novelty Detection Using Clustering-based Local Autoencoders",
        "authors": "Renan Albuquerque, Guilherme Barreto",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Novelty detection, also known as anomaly detection, plays a crucial role in identifying new or abnormal instances within a dataset. Traditional autoencoder models have been effective in learning compact representations of data, but they often struggle with capturing fine-grained local variations in complex and high-dimensional datasets. To address this limitation, we propose a novel learning method called Local Autoencoders (LAEs) for novelty detection. LAEs incorporate local information into the encoding and decoding processes, enabling more precise and detailed reconstructions. In this paper, we present preliminary results on evaluation of LAEs considering benchmark datasets for time series novelty detection and compare their performance against traditional (i.e., global) autoencoder and nearest neighbor learning method. The results demonstrate LAEs competitive performance in detecting novel instances, surpassing (in several cases) traditional autoencoders. The proposed LAEs present a promising avenue for further exploration in the field of novelty detection, leading into new opportunities for research and practical applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21528/cbic2023-172"
    },
    {
        "id": 7622,
        "title": "DeepSense: An Unsupervised Deep Clustering Approach for Cooperative Spectrum Sensing",
        "authors": "Nada Abdel Khalek, Walaa Hamouda",
        "published": "2023-5-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10279156"
    },
    {
        "id": 7623,
        "title": "Personalized Student Learning Mechanisms using K-Means and K-Medoids Clustering Algorithms based on Individual Preferences",
        "authors": "Rendy Wenda Dwi Kurniawan, Arief Hermawan",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5120/ijca2023923274"
    },
    {
        "id": 7624,
        "title": "Which algorithm can detect unknown attacks? Comparison of supervised, unsupervised and meta-learning algorithms for intrusion detection",
        "authors": "Tommaso Zoppi, Andrea Ceccarelli, Tommaso Puccetti, Andrea Bondavalli",
        "published": "2023-4",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2023.103107"
    },
    {
        "id": 7625,
        "title": "Clustering Appliance Operation Modes With Unsupervised Deep Learning Techniques",
        "authors": "Marco Castangia, Nicola Barletta, Christian Camarda, Stefano Quer, Enrico Macii, Edoardo Patti",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tii.2022.3217495"
    },
    {
        "id": 7626,
        "title": "Phenotypic Analysis of Hematopoietic Stem and Progenitor Cell Populations in Acute Myeloid Leukemia Based on Spectral Flow Cytometry, a 20-Color Panel, and Unsupervised Learning Algorithms",
        "authors": "Thomas Matthes",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "The analysis of hematopoietic stem and progenitor cell populations (HSPCs) is fundamental in the understanding of normal hematopoiesis as well as in the management of malignant diseases, such as leukemias, and in their diagnosis and follow-up, particularly the measurement of treatment efficiency with the detection of measurable residual disease (MRD). In this study, I designed a 20-color flow cytometry panel tailored for the comprehensive analysis of HSPCs using a spectral cytometer. My investigation encompassed the examination of forty-six samples derived from both normal human bone marrows (BMs) and patients with acute myeloid leukemia (AML) and myelodysplastic syndromes (MDS) along with those subjected to chemotherapy and BM transplantation. By comparing my findings to those obtained through conventional flow cytometric analyses utilizing multiple tubes, I demonstrate that my innovative 20-color approach enables a more in-depth exploration of HSPC subpopulations and the detection of MRD with at least comparable sensitivity. Furthermore, leveraging advanced analytical tools such as t-SNE and FlowSOM learning algorithms, I conduct extensive cross-sample comparisons with two-dimensional gating approaches. My results underscore the efficacy of these two methods as powerful unsupervised alternatives for manual HSPC subpopulation analysis. I expect that in the future, complex multi-dimensional flow cytometric data analyses, such as those employed in this study, will be increasingly used in hematologic diagnostics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ijms25052847"
    },
    {
        "id": 7627,
        "title": "A scalable unsupervised learning of scRNAseq data detects rare cells through integration of structure-preserving embedding, clustering and outlier detection",
        "authors": "Koushik Mallick, Sikim Chakraborty, Saurav Mallik, Sanghamitra Bandyopadhyay",
        "published": "2023-5-19",
        "citations": 1,
        "abstract": "Abstract\nSingle-cell RNA-seq analysis has become a powerful tool to analyse the transcriptomes of individual cells. In turn, it has fostered the possibility of screening thousands of single cells in parallel. Thus, contrary to the traditional bulk measurements that only paint a macroscopic picture, gene measurements at the cell level aid researchers in studying different tissues and organs at various stages. However, accurate clustering methods for such high-dimensional data remain exiguous and a persistent challenge in this domain. Of late, several methods and techniques have been promulgated to address this issue. In this article, we propose a novel framework for clustering large-scale single-cell data and subsequently identifying the rare-cell sub-populations. To handle such sparse, high-dimensional data, we leverage PaCMAP (Pairwise Controlled Manifold Approximation), a feature extraction algorithm that preserves both the local and the global structures of the data and Gaussian Mixture Model to cluster single-cell data. Subsequently, we exploit Edited Nearest Neighbours sampling and Isolation Forest/One-class Support Vector Machine to identify rare-cell sub-populations. The performance of the proposed method is validated using the publicly available datasets with varying degrees of cell types and rare-cell sub-populations. On several benchmark datasets, the proposed method outperforms the existing state-of-the-art methods. The proposed method successfully identifies cell types that constitute populations ranging from 0.1 to 8% with F1-scores of 0.91 0.09. The source code is available at https://github.com/scrab017/RarPG",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bib/bbad125"
    },
    {
        "id": 7628,
        "title": "Power Transformers' Health Index Determination: A Machine Learning Approach Using Clustering Algorithms and Industry-Specific Parameters",
        "authors": "Farhan Hamid, Md Arif Hossen, Mohammed Imamul Hassan Bhuiyan",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/r10-htc57504.2023.10461745"
    },
    {
        "id": 7629,
        "title": "Fully Unsupervised Defect Clustering using Adversarial Autoencoder",
        "authors": "Taewan Kim, Seungchul Lee",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "Identifying defect types and developing proper maintenance strategies is a major concern in modern industry. Most conventional studies have been conducted primarily based on a supervised learning scheme. However, supervised learning has a critical limitation in that it requires labeled data, which is difficult and expensive to obtain in real-world industry. Considering that there are many industries that do not perform post investigations on the defects, fully unsupervised learning methods, which do not exploit any information such as label data or the number of types, need to be developed. Accordingly, in this study, we propose a fully unsupervised defect clustering method that does not exploit any information other than the data itself. The proposed method consists of two major components. The first is dimensionality reduction into latent space via adversarial autoencoder, and the second is a Bayesian mixture model for distribution estimation in latent space. The experiments on a rolling-element-bearing dataset validate the effectiveness of our method. Specifically, our method performs defect clustering without any information other than the data itself, which is promising for real industrial applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36001/phmap.2023.v4i1.3758"
    },
    {
        "id": 7630,
        "title": "Unsupervised Multiview Fuzzy C-Means Clustering Algorithm",
        "authors": "Ishtiaq Hussain, Kristina P. Sinaga, Miin-Shen Yang",
        "published": "2023-10-30",
        "citations": 3,
        "abstract": "The rapid development in information technology makes it easier to collect vast numbers of data through the cloud, internet and other sources of information. Multiview clustering is a significant way for clustering multiview data that may come from multiple ways. The fuzzy c-means (FCM) algorithm for clustering (single-view) datasets was extended to process multiview datasets in the literature, called the multiview FCM (MV-FCM). However, most of the MV-FCM clustering algorithms and their extensions in the literature need prior information about the number of clusters and are also highly influenced by initializations. In this paper, we propose a novel MV-FCM clustering algorithm with an unsupervised learning framework, called the unsupervised MV-FCM (U-MV-FCM), such that it can search an optimal number of clusters during the iteration process of the algorithm without giving the number of clusters a priori. It is also free of initializations and parameter selection. We then use three synthetic and six benchmark datasets to make comparisons between the proposed U-MV-FCM and other existing algorithms and to highlight its practical implications. The experimental results show that our proposed U-MV-FCM algorithm is superior and more useful for clustering multiview datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12214467"
    },
    {
        "id": 7631,
        "title": "Retracted: Unsupervised Hyperspectral Microscopic Image Segmentation Using Deep Embedded Clustering Algorithm",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9890786"
    },
    {
        "id": 7632,
        "title": "Performance Analysis of Machine Learning Algorithms with Clustering Protocol in Wireless Sensor Networks",
        "authors": "Rahma Gantassi, Zaki Masood, Sol Lim, Quota Alief Sias, Yonghoon Choi",
        "published": "2023-2-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiic57133.2023.10067019"
    },
    {
        "id": 7633,
        "title": "Clustering and Determinant Analysis of Corporate Environmental Management Attitudes: Unsupervised Learning Techniques",
        "authors": "Ji-Young An,  ",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Purpose - The main objective of this study is to cluster companies based on environmental management attitudes using various indicators, and analyze differences in activities among the clusters to gain insights into environmental management performance.\r\nDesign/Methodology/Approach - The study encompasses panel data from 12 countries, 22 industry sectors, and 3,402 companies from 2013 to 2022. This study uses both machine learning methodology and conventional econometric methodology. The primary methodology involves using an unsupervised learning technique, K-means clustering, to categorize environmental management attitudes. Subsequently, Kernel Density estimation and Multinomial Logistic Regression were employed to conduct comparative analyses of environmental performance indicators within each cluster and identify the determinants shaping environmental management attitudes.\r\nFindings - The research revealed the existence of five distinct clusters of companies with varying environmental management attitudes. Through Multinomial Logistics Regression, it identified that variables such as greenhouse gas emissions, energy consumption, total assets, return on assets, and other significantly influence environmental management attitudes.\r\nResearch Implications - By uncovering common characteristics and determinants within major countries and industries, this study offers valuable insights in promoting domestic environmental management in the context of rapidly changing international trade and investment environments. The findings provide policy implications and suggestions for fostering proactive environmental management practices among domestic companies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.16980/jitc.19.4.202308.211"
    },
    {
        "id": 7634,
        "title": "Unsupervised clustering of bitcoin transactions",
        "authors": "George Vlahavas, Kostas Karasavvas, Athena Vakali",
        "published": "2024-1-17",
        "citations": 1,
        "abstract": "AbstractSince its inception in 2009, Bitcoin has become and is currently the most successful and widely used cryptocurrency. It introduced blockchain technology, which allows transactions that transfer funds between users to take place online, in an immutable manner. No real-world identities are needed or stored in the blockchain. At the same time, all transactions are publicly available and auditable, making Bitcoin a pseudo-anonymous ledger of transactions. The volume of transactions that are broadcast on a daily basis is considerably large. We propose a set of features that can be extracted from transaction data. Using this, we apply a data processing pipeline to ultimately cluster transactions via a k-means clustering algorithm, according to the transaction properties. Finally, according to these properties, we are able to characterize these clusters and the transactions they include. Our work mainly differentiates from previous studies in that it applies an unsupervised learning method to cluster transactions instead of addresses. Using the novel features we introduce, our work classifies transactions in multiple clusters, while previous studies only attempt binary classification. Results indicate that most transactions fall into a cluster that can be described as common user transactions. Other clusters include transactions made by online exchanges and lending services, those relating to mining activities as well as smaller clusters, one of which contains possibly illicit or fraudulent transactions. We evaluated our results against an online database of addresses that belong to known actors, such as online exchanges, and found that our results generally agree with them, which enhances the validity of our methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40854-023-00525-y"
    },
    {
        "id": 7635,
        "title": "Towards unsupervised radiograph clustering for COVID-19: The use of graph-based multi-view clustering",
        "authors": "F. Dornaika, S. El Hajjar, J. Charafeddine",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108336"
    },
    {
        "id": 7636,
        "title": "Active Learning Based on Clustering Algorithms for the Detection of Grapes in Images",
        "authors": "Ren Hao Wong, Leon Kantikov, Hubert Cecotti",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsip57908.2023.10271067"
    },
    {
        "id": 7637,
        "title": "Unsupervised Wavelet-Feature Correlation Ratio Markov Clustering Algorithm for Remotely Sensed Images",
        "authors": "Zhaohui Wang",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "The spectrums of one type of object under different conditions have the same features (up, down, protruding, concave) at the same spectral positions, which can be used as primary parameters to evaluate the difference among remotely sensed pixels. The wavelet-feature correlation ratio Markov clustering algorithm (WFCRMCA) for remotely sensed data is proposed based on an accurate description of abrupt spectral features and an optimized Markov clustering in the wavelet feather space. The peak points can be captured and identified by applying a wavelet transform to spectral data. The correlation ratio between two samples is a statistical calculation of the matched peak point positions on the wavelet feature within an adjustable spectrum domain or a range of wavelet scales. The evenly sampled data can be used to create class centers, depending on the correlation ratio threshold at each Markov step, accelerating the clustering speed by avoiding the computation of Euclidean distance for traditional clustering algorithms, such as K-means and ISODATA. Markov clustering applies several strategies, such as a simulated annealing method and gradually shrinking the clustering size, to control the clustering convergence. It can quickly obtain the best class centers at each clustering temperature. The experimental results of the Airborne Visible/Infrared Imaging Spectrometer (AVIRIS) and Thermal Mapping (TM) data have verified its acceptable clustering accuracy and high convergence velocity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14020767"
    },
    {
        "id": 7638,
        "title": "Semi-Supervised Medical Image Classification Combined with Unsupervised Deep Clustering",
        "authors": "Bang Xiao, Chunyue Lu",
        "published": "2023-4-28",
        "citations": 1,
        "abstract": "An effective way to improve the performance of deep neural networks in most computer vision tasks is to improve the quantity of labeled data and the quality of labels. However, in the analysis and processing of medical images, high-quality annotation depends on the experience and professional knowledge of experts, which makes it very difficult to obtain a large number of high-quality annotations. Therefore, we propose a new semi-supervised framework for medical image classification. It combines semi-supervised classification with unsupervised deep clustering. Spreading label information to unlabeled data by alternately running two tasks helps the model to extract semantic information from unlabeled data, and prevents the model from overfitting to a small amount of labeled data. Compared with current methods, our framework enhances the robustness of the model and reduces the influence of outliers. We conducted a comparative experiment on the public benchmark medical image dataset to verify our method. On the ISIC 2018 Dataset, our method surpasses other methods by more than 0.85% on AUC and 1.08% on Sensitivity. On the ICIAR BACH 2018 dataset, our method achieved 94.12% AUC, 77.92% F1-score, 77.69% Recall, and 78.16% Precision. The error rate is at least 1.76% lower than that of other methods. The result shows the effectiveness of our method in medical image classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13095520"
    },
    {
        "id": 7639,
        "title": "Unsupervised Clustering of GNSS Receiver Measurements for Satellite Selection",
        "authors": "Caner Savas",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rast57548.2023.10197993"
    },
    {
        "id": 7640,
        "title": "Spectral Clustering in Rule-Based Algorithms for Multi-Agent Path Finding",
        "authors": "Irene Saccani, Kristýna Janovská, Pavel Surynek",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012206800003543"
    },
    {
        "id": 7641,
        "title": "An unsupervised machine learning approach for ground‐motion spectra clustering and selection",
        "authors": "Robert Bailey Bond, Pu Ren, Jerome F. Hajjar, Hao Sun",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractClustering analysis of sequence data continues to address many applications in engineering design, aided with the rapid growth of machine learning in applied science. This paper presents an unsupervised machine learning algorithm to extract defining characteristics of earthquake ground‐motion spectra, also called latent features, to aid in ground‐motion selection (GMS). In this context, a latent feature is a low‐dimensional machine‐discovered spectral characteristic learned through nonlinear relationships of a neural network autoencoder. Machine discovered latent features can be combined with traditionally defined intensity measures and clustering can be performed to select a representative subgroup from a large ground‐motion suite. The objective of efficient GMS is to choose characteristic records representative of what the structure will probabilistically experience in its lifetime. Three examples are presented to validate this approach, including the use of synthetic and field recorded ground‐motion datasets. The presented deep embedding clustering of ground‐motion spectra has three main advantages: (1) defining characteristics that represent the sparse spectral content of ground motions are discovered efficiently through training of the autoencoder, (2) domain knowledge is incorporated into the machine learning framework with conditional variables in the deep embedding scheme, and (3) the method results in a ground‐motion subgroup that is more representative of the original ground‐motion suite compared to traditional GMS techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/eqe.4062"
    },
    {
        "id": 7642,
        "title": "A Largely Unsupervised Domain-Independent Qualitative Data Extraction Approach for Empirical Agent-Based Model Development",
        "authors": "Rajiv Paudel, Arika Ligmann-Zielinska",
        "published": "2023-7-14",
        "citations": 3,
        "abstract": "Agent-based model (ABM) development needs information on system components and interactions. Qualitative narratives contain contextually rich system information beneficial for ABM conceptualization. Traditional qualitative data extraction is manual, complex, and time- and resource-consuming. Moreover, manual data extraction is often biased and may produce questionable and unreliable models. A possible alternative is to employ automated approaches borrowed from Artificial Intelligence. This study presents a largely unsupervised qualitative data extraction framework for ABM development. Using semantic and syntactic Natural Language Processing tools, our methodology extracts information on system agents, their attributes, and actions and interactions. In addition to expediting information extraction for ABM, the largely unsupervised approach also minimizes biases arising from modelers’ preconceptions about target systems. We also introduce automatic and manual noise-reduction stages to make the framework usable on large semi-structured datasets. We demonstrate the approach by developing a conceptual ABM of household food security in rural Mali. The data for the model contain a large set of semi-structured qualitative field interviews. The data extraction is swift, predominantly automatic, and devoid of human manipulation. We contextualize the model manually using the extracted information. We also put the conceptual model to stakeholder evaluation for added credibility and validity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16070338"
    },
    {
        "id": 7643,
        "title": "LiDAR-Based Vehicle Detection by Using DBSCAN Unsupervised Clustering Approach",
        "authors": "Tri Bien Minh, Hien Vo Bich",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccri58865.2023.00020"
    },
    {
        "id": 7644,
        "title": "Data-Driven Phenotyping of Central Disorders of Hypersomnolence With Unsupervised Clustering",
        "authors": "",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1212/wnl.0000000000201652"
    },
    {
        "id": 7645,
        "title": "Shelved–Retrieved Method for Weakly Balanced Constrained Clustering Problems",
        "authors": "Xinxiang Hou, Andong Qiu, Lu Yang, Zhouwang Yang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Clustering problems are prevalent in areas such as transport and partitioning. Owing to the demand for centralized storage and limited resources, a complex variant of this problem has emerged, also referred to as the weakly balanced constrained clustering (WBCC) problem. Clusters must satisfy constraints regarding cluster weights and connectivity. However, existing methods fail to guarantee cluster connectivity in diverse scenarios, thereby resulting in additional transportation costs. In response to the aforementioned limitations, this study introduces a shelved–retrieved method. This method embeds adjacent relationships during power diagram construction to ensure cluster connectivity. Using the shelved–retrieved method, connected clusters are generated and iteratively adjusted to determine the optimal solutions. Further, experiments are conducted on three synthetic datasets, each with three objective functions, and the results are compared to those obtained using other techniques. Our method successfully generates clusters that satisfy the constraints imposed by the WBCC problem and consistently outperforms other techniques in terms of the evaluation measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16100492"
    },
    {
        "id": 7646,
        "title": "Unsupervised Feature Vector Clustering Using Temporally Coded Spiking Networks",
        "authors": "Peter G. Stratton, Tara J. Hamilton, Andrew Wabnitz",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191150"
    },
    {
        "id": 7647,
        "title": "Erratum: Unsupervised clustering reveals phenotypes of AKI in ICU COVID-19 patients",
        "authors": " ",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fmed.2023.1172589"
    },
    {
        "id": 7648,
        "title": "COT: Unsupervised Domain Adaptation with Clustering and Optimal Transport",
        "authors": "Yang Liu, Zhipeng Zhou, Baigui Sun",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01915"
    },
    {
        "id": 7649,
        "title": "An Objective Reduction Evolutionary Multiobjective Algorithm using Adaptive Density-Based Clustering for Many-objective Optimization Problem",
        "authors": "Mingjing Wang, Long Chen, Huiling Chen",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590103"
    },
    {
        "id": 7650,
        "title": "Comparison of Algorithms K-Means and DBSCAN for Clustering Student Cognitive Learning Outcomes in Physics Subject",
        "authors": "Kertanah Kertanah, Wiwit Pura Nurmayanti, Sri Rahmatun Aini, Lalu Muh. Amrullah, Muhammad Sya'roni",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "Clustering is an activity of grouping data into the same group based on similarity. The purpose of the study is to cluster and determine student cognitive learning outcomes characteristics. Cluster analysis was conducted on student cognitive learning outcomes using algorithms K-Means and DBSCAN. Both algorithms are appropriate to have been applied to the overlapping data such as student learning outcomes data. Also, their advantages are scaling large datasets and outliers. The data used in this study is student cognitive learning outcomes - final and mid-term exams grade X in physics subject. Applying the two proposed algorithms K-Means and DBSCAN, the best cluster algorithm to have been used for clustering analysis is K-Means which is based on the highest silhouette score of 0.43, while the silhouette score of DBSCAN is 0.39 respectively. Using the best cluster, the K-Means algorithm, found two types of clusters – cluster 1 consists of 132 students who have a high average score, and cluster 2 shows 183 students who have a low average score in both final and mid-term exams respectively. From the analysis results, most students still have low cognitive learning outcomes in physics subject.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29408/kpj.v7i2.18428"
    },
    {
        "id": 7651,
        "title": "Selecting and Scatter Based Unsupervised Domain Adaptation Method",
        "authors": "Maosong Li, Weixin Ling",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdp59959.2023.00040"
    },
    {
        "id": 7652,
        "title": "Learning Distributed Representations and Deep Embedded Clustering of Texts",
        "authors": "Shuang Wang, Amin Beheshti, Yufei Wang, Jianchao Lu, Quan Z. Sheng, Stephen Elbourn, Hamid Alinejad-Rokny",
        "published": "2023-3-13",
        "citations": 1,
        "abstract": "Instructors face significant time and effort constraints when grading students’ assessments on a large scale. Clustering similar assessments is a unique and effective technique that has the potential to significantly reduce the workload of instructors in online and large-scale learning environments. By grouping together similar assessments, marking one assessment in a cluster can be scaled to other similar assessments, allowing for a more efficient and streamlined grading process. To address this issue, this paper focuses on text assessments and proposes a method for reducing the workload of instructors by clustering similar assessments. The proposed method involves the use of distributed representation to transform texts into vectors, and contrastive learning to improve the representation that distinguishes the differences among similar texts. The paper presents a general framework for clustering similar texts that includes label representation, K-means, and self-organization map algorithms, with the objective of improving clustering performance using Accuracy (ACC) and Normalized Mutual Information (NMI) metrics. The proposed framework is evaluated experimentally using two real datasets. The results show that self-organization maps and K-means algorithms with Pre-trained language models outperform label representation algorithms for different datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16030158"
    },
    {
        "id": 7653,
        "title": "Unsupervised Functional Data Clustering Based on Adaptive Weights",
        "authors": "Yutong Gao, Shuang Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ojs.2023.132011"
    },
    {
        "id": 7654,
        "title": "DeepCut: Unsupervised Segmentation using Graph Neural Networks Clustering",
        "authors": "Amit Aflalo, Shai Bagon, Tamar Kashti, Yonina Eldar",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00010"
    },
    {
        "id": 7655,
        "title": "Clustering of live network alarms using unsupervised statistical models",
        "authors": "D. Maillot-Tchofo, A. Triki, M. Laye, J. Puentes",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.2517"
    },
    {
        "id": 7656,
        "title": "Unsupervised nested Dirichlet finite mixture model for clustering",
        "authors": "Fares Alkhawaja, Nizar Bouguila",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-04888-8"
    },
    {
        "id": 7657,
        "title": "Unsupervised clustering using nonparametric finite mixture models",
        "authors": "David R. Hunter",
        "published": "2024-1",
        "citations": 1,
        "abstract": "AbstractThis article presents basic ideas of finite mixture models in which the number of components is known and the distributions comprising the components are not assumed to come from any parametrically specified family.This article is categorized under:\nAlgorithms and Computational Methods > Algorithms\nStatistical Learning and Exploratory Methods of the Data Sciences > Clustering and Classification\nStatistical and Graphical Methods of Data Analysis > Nonparametric Methods\nStatistical Models > Classification Models\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/wics.1632"
    },
    {
        "id": 7658,
        "title": "Mathematical enhancement of unsupervised machine learning algorithms for optimal lifeline donor knowledge extraction",
        "authors": "P. Ramesh Naidu, Pratik Gite, Vaskar Deka, K. D. V. Prasad, V. Dankan Gowda, Mirzanur Rahman",
        "published": "2024",
        "citations": 0,
        "abstract": "Lifeline Donor groups are crucial in the field of humanitarian aid because they provide lifesaving aid in times of crisis. For effective resource management and aid coordination, it is crucial to draw relevant insights from donor data in a timely manner. Scalability, precision, and flexibility in responding to changing donor dynamics are all areas where traditional techniques of knowledge extraction fall short. This study offers a fresh method for optimizing knowledge extraction from Lifeline Donor databases by utilizing improved unsupervised machine learning methods. In order to extract, categorize, and prioritize donor knowledge from disparate data sources, this research presents a multi-faceted framework that includes cutting-edge machine learning algorithms. By merging cutting-edge developments in NLP and data mining, the proposed framework improves upon classic clustering and topic modelling methods. The program is able to capture subtle semantic links and underlying patterns in donor communication data by using methods like word embedding models and graph-based clustering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jsms-1282"
    },
    {
        "id": 7659,
        "title": "Two unsupervised learning algorithms for detecting abnormal inactivity within a household based on smart meter data",
        "authors": "Zhenyu Zhou, Yanchao Liu, Tingli Hu, Caisheng Wang",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120565"
    },
    {
        "id": 7660,
        "title": "Over-optimism in unsupervised microbiome analysis: Insights from network learning and clustering",
        "authors": "Theresa Ullmann, Stefanie Peschel, Philipp Finger, Christian L. Müller, Anne-Laure Boulesteix",
        "published": "2023-1-6",
        "citations": 3,
        "abstract": "In recent years, unsupervised analysis of microbiome data, such as microbial network analysis and clustering, has increased in popularity. Many new statistical and computational methods have been proposed for these tasks. This multiplicity of analysis strategies poses a challenge for researchers, who are often unsure which method(s) to use and might be tempted to try different methods on their dataset to look for the “best” ones. However, if only the best results are selectively reported, this may cause over-optimism: the “best” method is overly fitted to the specific dataset, and the results might be non-replicable on validation data. Such effects will ultimately hinder research progress. Yet so far, these topics have been given little attention in the context of unsupervised microbiome analysis. In our illustrative study, we aim to quantify over-optimism effects in this context. We model the approach of a hypothetical microbiome researcher who undertakes four unsupervised research tasks: clustering of bacterial genera, hub detection in microbial networks, differential microbial network analysis, and clustering of samples. While these tasks are unsupervised, the researcher might still have certain expectations as to what constitutes interesting results. We translate these expectations into concrete evaluation criteria that the hypothetical researcher might want to optimize. We then randomly split an exemplary dataset from the American Gut Project into discovery and validation sets multiple times. For each research task, multiple method combinations (e.g., methods for data normalization, network generation, and/or clustering) are tried on the discovery data, and the combination that yields the best result according to the evaluation criterion is chosen. While the hypothetical researcher might only report this result, we also apply the “best” method combination to the validation dataset. The results are then compared between discovery and validation data. In all four research tasks, there are notable over-optimism effects; the results on the validation data set are worse compared to the discovery data, averaged over multiple random splits into discovery/validation data. Our study thus highlights the importance of validation and replication in microbiome analysis to obtain reliable results and demonstrates that the issue of over-optimism goes beyond the context of statistical testing and fishing for significance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pcbi.1010820"
    },
    {
        "id": 7661,
        "title": "Unsupervised Learning Based Indoor Personnel Behavior Pattern Mining",
        "authors": "Tian Wen, Gaofei Sun, Yuting Wang, Aoran Xi, Lifeng Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/iciae2023.023"
    },
    {
        "id": 7662,
        "title": "Clustering-Aware Negative Sampling for Unsupervised Sentence Representation",
        "authors": "Jinghao Deng, Fanqi Wan, Tao Yang, Xiaojun Quan, Rui Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.555"
    },
    {
        "id": 7663,
        "title": "Consensus Big Data Clustering for Bayesian Mixture Models",
        "authors": "Christos Karras, Aristeidis Karras, Konstantinos C. Giotopoulos, Markos Avlonitis, Spyros Sioutas",
        "published": "2023-5-9",
        "citations": 4,
        "abstract": "In the context of big-data analysis, the clustering technique holds significant importance for the effective categorization and organization of extensive datasets. However, pinpointing the ideal number of clusters and handling high-dimensional data can be challenging. To tackle these issues, several strategies have been suggested, such as a consensus clustering ensemble that yields more significant outcomes compared to individual models. Another valuable technique for cluster analysis is Bayesian mixture modelling, which is known for its adaptability in determining cluster numbers. Traditional inference methods such as Markov chain Monte Carlo may be computationally demanding and limit the exploration of the posterior distribution. In this work, we introduce an innovative approach that combines consensus clustering and Bayesian mixture models to improve big-data management and simplify the process of identifying the optimal number of clusters in diverse real-world scenarios. By addressing the aforementioned hurdles and boosting accuracy and efficiency, our method considerably enhances cluster analysis. This fusion of techniques offers a powerful tool for managing and examining large and intricate datasets, with possible applications across various industries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16050245"
    },
    {
        "id": 7664,
        "title": "Unsupervised Anomaly Detection",
        "authors": "Suliman Alnutefy, Ali Alsuwayh",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "This research focuses on Unsupervised Anomaly Detection using the \"ambient_temperature_system_failure.csv\" dataset from Numenta Anomaly Benchmark (NAB). The dataset contains time-series temperature readings from an industrial machine's sensor. The aim is to detect anomalies indicating system failures or aberrant behavior without labeled data. Various algorithms, such as K-means, Gaussian/Elliptic Envelopes, Markov Chain, Isolation Forest, One-Class SVM, and RNNs, are applied to analyze the temperature data. These algorithms are chosen for their ability to identify significant deviations in unlabeled datasets. The study explores how these techniques enhance anomaly understanding in time series data, relevant in manufacturing, healthcare, and finance. This research's novelty lies in employing unsupervised learning techniques on a real-world dataset and understanding theiradaptability in anomaly detection. The results are expected to contribute valuable insights to the field, showcasing the practicality and effectiveness of these algorithms across various scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140210"
    },
    {
        "id": 7665,
        "title": "RamanCluster: A deep clustering-based framework for unsupervised Raman spectral identification of pathogenic bacteria",
        "authors": "Zhijian Sun, Zhuo Wang, Mingqi Jiang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.talanta.2024.126076"
    },
    {
        "id": 7666,
        "title": "Unsupervised optimal model bank for multiple model control systems: Genetic-based automatic clustering approach",
        "authors": "Mohammad Fathi, Hossein Bolandi",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e25986"
    },
    {
        "id": 7667,
        "title": "Unsupervised Particle Picking and Clustering in Cryo-EM Micrographs",
        "authors": "Alireza Nasiri, Darnell Granberry, Tristan Bepler",
        "published": "2023-7-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/micmic/ozad067.482"
    },
    {
        "id": 7668,
        "title": "Unsupervised clustering for intrinsic mode functions selection in Hyperspectral image classification",
        "authors": "Zhiqiang Liu",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16884-8"
    },
    {
        "id": 7669,
        "title": "Reservoir characterization through comprehensive modeling of elastic logs prediction in heterogeneous rocks using unsupervised clustering and class-based ensemble machine learning",
        "authors": "Muhammad Ali, Peimin Zhu, Ren Jiang, Ma Huolin, Muhsan Ehsan, Wakeel Hussain, Hao Zhang, Umar Ashraf, Jared Ullaah",
        "published": "2023-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110843"
    },
    {
        "id": 7670,
        "title": "Fusion of Centroid-Based Clustering With Graph Clustering: An Expectation-Maximization-Based Hybrid Clustering",
        "authors": "Zekeriya Uykan",
        "published": "2023-8",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3121224"
    },
    {
        "id": 7671,
        "title": "Unsupervised text feature selection by binary fire hawk optimizer for text clustering",
        "authors": "Mohammed M. Msallam, Syahril Anuar Bin Idris",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10586-024-04364-z"
    },
    {
        "id": 7672,
        "title": "Unsupervised multilayer fuzzy neural networks for image clustering",
        "authors": "Yifan Wang, Hisao Ishibuchi, Meng Joo Er, Jihua Zhu",
        "published": "2023-4",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2022.11.149"
    },
    {
        "id": 7673,
        "title": "Development of a Real-Time Failure Prediction System Using Unsupervised Learning",
        "authors": "Tetsuya Ojiro, Hirotaka Gondo, Kazuhiro Tsuruta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/iciae2023.036"
    },
    {
        "id": 7674,
        "title": "Exploiting clustering algorithms for spatial analysis of geophysical data",
        "authors": "Dave O'Leary",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.62329/cxym4148"
    },
    {
        "id": 7675,
        "title": "Unsupervised Domain Adaptation Via Dynamic Clustering and Co-Segment Attentive Learning for Video-Based Person Re-Identification",
        "authors": "Fuping Zhang, Fengjun Chen, Zhonggen Su, Jianming Wei",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3365583"
    },
    {
        "id": 7676,
        "title": "Survival analysis of patient groups defined by unsupervised machine learning clustering methods based on patient metabolomic data.",
        "authors": "Caroline Bailleux, David Chardin, Jean-Marie Guigonis, Jean-Marc Ferrero, Yann Chateau, Olivier Humbert, Thierry Pourcher, Jocelyn Gal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csbj.2023.10.033"
    },
    {
        "id": 7677,
        "title": "Retracted: Unsupervised Anomaly Detection Based on Deep Autoencoding and Clustering",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9842183"
    },
    {
        "id": 7678,
        "title": "Improving Clustering Accuracy of K-Means and Random Swap by an Evolutionary Technique Based on Careful Seeding",
        "authors": "Libero Nigro, Franco Cicirelli",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "K-Means is a “de facto” standard clustering algorithm due to its simplicity and efficiency. K-Means, though, strongly depends on the initialization of the centroids (seeding method) and often gets stuck in a local sub-optimal solution. K-Means, in fact, mainly acts as a local refiner of the centroids, and it is unable to move centroids all over the data space. Random Swap was defined to go beyond K-Means, and its modus operandi integrates K-Means in a global strategy of centroids management, which can often generate a clustering solution close to the global optimum. This paper proposes an approach which extends both K-Means and Random Swap and improves the clustering accuracy through an evolutionary technique and careful seeding. Two new algorithms are proposed: the Population-Based K-Means (PB-KM) and the Population-Based Random Swap (PB-RS). Both algorithms consist of two steps: first, a population of J candidate solutions is built, and then the candidate centroids are repeatedly recombined toward a final accurate solution. The paper motivates the design of PB-KM and PB-RS, outlines their current implementation in Java based on parallel streams, and demonstrates the achievable clustering accuracy using both synthetic and real-world datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16120572"
    },
    {
        "id": 7679,
        "title": "The Use of Clustering and Classification Methods in Machine Learning and Comparison of Some Algorithms of the Methods",
        "authors": "Guhdar A. A. Mulla, Yıldırım Demir",
        "published": "2023-6-10",
        "citations": 0,
        "abstract": "In this article, two machine learning methods such as classification and clustering are used for decision tree (DT), artificial neural network (ANN), and K-nearest neighbors algorithms. The datasets were used to evaluate the effectiveness of the clustering method and the data mining tool. Weather data were used to compare algorithms and methods in the study. This study showed that the best model was DT according to accuracy and precision measures but the best model according to F-measure and receiver operating characteristic curve area measures was ANN. Waikato Environment for Knowledge Analysis, a data mining tool, is utilized in this paper to carry out the clustering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24086/cuesj.v7n1y2023.pp52-59"
    },
    {
        "id": 7680,
        "title": "Combined Unsupervised and Supervised Learning for Improving Chest X-Ray Classification",
        "authors": "Anca Ignat, Robert-Adrian Găină",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011793000003417"
    },
    {
        "id": 7681,
        "title": "Unsupervised learning of pixel clustering in Mueller matrix images for mapping microstructural features in pathological tissues",
        "authors": "Jiachen Wan, Yang Dong, Yue Yao, Weijin Xiao, Ruqi Huang, Jing-Hao Xue, Ran Peng, Haojie Pei, Xuewu Tian, Ran Liao, Honghui He, Nan Zeng, Chao Li, Hui Ma",
        "published": "2023-12-8",
        "citations": 1,
        "abstract": "AbstractIn histopathology, doctors identify diseases by characterizing abnormal cells and their spatial organization within tissues. Polarization microscopy and supervised learning have been proved as an effective tool for extracting polarization parameters to highlight pathological features. Here, we present an alternative approach based on unsupervised learning to group polarization-pixels into clusters, which correspond to distinct pathological structures. For pathological samples from different patients, it is confirmed that such unsupervised learning technique can decompose the histological structures into a stable basis of characteristic microstructural clusters, some of which correspond to distinctive pathological features for clinical diagnosis. Using hepatocellular carcinoma (HCC) and intrahepatic cholangiocarcinoma (ICC) samples, we demonstrate how the proposed framework can be utilized for segmentation of histological image, visualization of microstructure composition associated with lesion, and identification of polarization-based microstructure markers that correlates with specific pathology variation. This technique is capable of unraveling invisible microstructures in non-polarization images, and turn them into visible polarization features to pathologists and researchers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s44172-023-00136-6"
    },
    {
        "id": 7682,
        "title": "Stable Clustering Algorithms for VANETs: A Survey",
        "authors": "Omar Baradia, Liana Jalalaltamimi",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icit58056.2023.10226088"
    },
    {
        "id": 7683,
        "title": "Mining regular behaviors based on clustering algorithms",
        "authors": "Huanhuan Mao",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00081"
    },
    {
        "id": 7684,
        "title": "Understanding multi-phase nano-scale structural complexity of reacted SiC coating of TRISO particle using STEM and unsupervised clustering",
        "authors": "",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22443/rms.mmc2023.129"
    },
    {
        "id": 7685,
        "title": "A Fuzzy Integral Approach for Ensembling Unsupervised Feature Selection Algorithms",
        "authors": "Amin Hashemi, Mohammad Bagher Dowlatshahi",
        "published": "2023-1-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csicc58665.2023.10105330"
    },
    {
        "id": 7686,
        "title": "A Survey on Unsupervised Anomaly Detection Algorithms for Industrial Images",
        "authors": "Yajie Cui, Zhaoxiang Liu, Shiguo Lian",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3282993"
    },
    {
        "id": 7687,
        "title": "Josseline Madrid - ECG-Based Unsupervised Clustering in Coronary Artery Disease Associates with Ventricular Arrhythmia",
        "authors": "Josseline Madrid",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26754/jjii3a.20239511"
    },
    {
        "id": 7688,
        "title": "Uncovering Insights in Coal Mill Plant Operation Modes Using GMM-LSTM-Based Unsupervised Clustering",
        "authors": "Makomane Dorothea L Sekhoto, Akihiro Fujii",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/saupec60914.2024.10445043"
    },
    {
        "id": 7689,
        "title": "Differentiable double clustering with edge-aware superpixel fitting for unsupervised image segmentation",
        "authors": "Xin Li, Xiaoying Chen, Yuanbo Qiu, Chunfeng Tao, Pan Zheng",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.displa.2024.102721"
    },
    {
        "id": 7690,
        "title": "Unsupervised hyperspectral image segmentation of films: a hierarchical clustering-based approach",
        "authors": "Lingxi Liu, Giovanni Delnevo, Silvia Mirri",
        "published": "2023-3-11",
        "citations": 2,
        "abstract": "AbstractHyperspectral imaging (HSI) has been drastically applied in recent years to cultural heritage (CH) analysis, conservation, and also digital restoration. However, the efficient processing of the large datasets registered remains challenging and still in development. In this paper, we propose to use the hierarchical clustering algorithm (HCA) as an alternative machine learning approach to the most common practices, such as principal component analysis(PCA). HCA has shown its potential in the past decades for spectral data classification and segmentation in many other fields, maximizing the information to be extracted from the high-dimensional spectral dataset via the formation of the agglomerative hierarchical tree. However, to date, there has been very limited implementation of HCA in the field of cultural heritage. Data used in this experiment were acquired on real historic film samples with various degradation degrees, using a custom-made push-broom VNIR hyperspectral camera (380–780nm). With the proposed HCA workflow, multiple samples in the entire dataset were processed simultaneously and the degradation areas with distinctive characteristics were successfully segmented into clusters with various hierarchies. A range of algorithmic parameters was tested, including the grid sizes, metrics, and agglomeration methods, and the best combinations were proposed at the end. This novel application of the semi-automating and unsupervised HCA could provide a basis for future digital unfading, and show the potential to solve other CH problems such as pigment mapping.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40537-023-00713-8"
    },
    {
        "id": 7691,
        "title": "How can entrepreneurs improve digital market segmentation? A comparative analysis of supervised and unsupervised learning algorithms",
        "authors": "Laura Sáez-Ortuño, Ruben Huertas-Garcia, Santiago Forgas-Coll, Eloi Puertas-Prats",
        "published": "2023-12",
        "citations": 4,
        "abstract": "AbstractThe identification of digital market segments to make value-creating propositions is a major challenge for entrepreneurs and marketing managers. New technologies and the Internet have made it possible to collect huge volumes of data that are difficult to analyse using traditional techniques. The purpose of this research is to address this challenge by proposing the use of AI algorithms to cluster customers. Specifically, the proposal is to compare the suitability of supervised algorithms, XGBoost, versus unsupervised algorithms, K-means, for segmenting the digital market. To do so, both algorithms have been applied to a sample of 5 million Spanish users captured between 2010 and 2022 by a lead generation start-up. The results show that supervised learning with this type of data is more useful for segmenting markets than unsupervised learning, as it provides solutions that are better suited to entrepreneurs’ commercial objectives.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11365-023-00882-1"
    },
    {
        "id": 7692,
        "title": "Unsupervised Clustering of Microseismic Signals Using a Contrastive Learning Model",
        "authors": "Zhen Yang, Huailiang Li, Xianguo Tuo, Linjia Li, Junnan Wen",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tgrs.2023.3240728"
    },
    {
        "id": 7693,
        "title": "Multimodal contrastive learning for unsupervised video representation learning",
        "authors": "Anup Hiremath, Avideh Zakhor",
        "published": "2023-1-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2352/ei.2023.35.14.coimg-173"
    },
    {
        "id": 7694,
        "title": "Unsupervised Clustering and Supervised Machine Learning for Lightning Classification: Application to Identifying EIPs for Ground‐Based TGF Detection",
        "authors": "Yunjiao Pu, Steven A. Cummer, Fanchao Lyu, Yu Zheng, Michael S. Briggs, Stephen Lesage, Bagrat Mailyan, Oliver J. Roberts",
        "published": "2023-5-16",
        "citations": 2,
        "abstract": "AbstractWe developed a framework merging unsupervised and supervised machine learning to classify lightning radio signals, and applied it to the possible detection of terrestrial gamma‐ray flashes (TGFs). Recent studies have established a tight connection between energetic in‐cloud pulses (EIPs, >150 kA) and a subset of TGFs, enabling continuous and large‐scale ground‐based TGF detection. However, even with a high peak current threshold, it is time‐consuming to manually search for EIPs in a background of many non‐EIP events, and it becomes even more difficult when a lower peak current threshold is used. Machine learning classifiers are an effective tool. Beginning with unsupervised learning, spectral clustering is performed on the low‐dimensional features extracted by an autoencoder from raw radio waveforms, showing that +EIPs naturally constitute a distinct class of waveform and 6%–7% of the total population. The clustering results are used to form a labeled data set (∼10,000 events) to further train supervised convolutional neural network (CNN) that targets for +EIPs. Our CNN models identify on average 95.2% of true +EIPs with accuracy up to 98.7%, representing a powerful tool for +EIP classification. The pretrained CNN classifier is further applied to identify lower peak current EIPs (LEIPs, >50 kA) from a larger data set (∼30,000 events). Among 10 LEIPs coincident with Fermi TGF observations, 2 previously reported TGFs and 2 unreported but suspected TGFs are found, while the majority are not associated with detectable TGFs. In addition, unsupervised clustering is found to reflect characteristics of the ionosphere reflection height and its effect on radio wave propagation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2022jd038369"
    },
    {
        "id": 7695,
        "title": "Unsupervised modulation classification based on multi-level deep subspace clustering",
        "authors": "Lisha Xue, Yanfei Bao, Bolin Zhang",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2673114"
    },
    {
        "id": 7696,
        "title": "Unsupervised machine learning to analyze corneal tissue surfaces",
        "authors": "Carolin A. Rickert, Fabio Henkel, Oliver Lieleg",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Identifying/classifying damage features on soft materials, such as tissues, is much more challenging than on classical, hard materials—but nevertheless important, especially in the field of bio-tribology. For instance, cartilage samples from osteoarthritic patients exhibit surface damage even at early stages of tissue degeneration, and corneal tissues can be damaged by contact lenses when the ocular lubrication system fails. Here, we employ unsupervised machine learning (ML) methods to assess the surface condition of a soft tissue by detecting and classifying different wear morphologies as well as the severity of surface damage they represent. We show that different clustering methods, especially a k-means clustering algorithm, can indeed achieve a—from a material science point of view—meaningful classification of those tissue samples. Our study pinpoints the ability of unsupervised ML models to guide or even replace human decision processes for the analysis of complex surfaces and topographical datasets that—either owing to their complexity or the sample size—exceed the capability of the human brain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0159502"
    },
    {
        "id": 7697,
        "title": "Unsupervised Wafer Defect Classification Model  Based On Joint Reconstruction And Clustering",
        "authors": "Luyang Jie, Yilong Guo, Yiming Yao, Yongkang Liu",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "Defect detection of unpatterned wafer is very important for determining the causes of wafer defects, and it is also a significant way to improve production yield. At present, the defect detection model based on the deep learning method has been widely used and has shown promising performance. However, the labor cost of supervised learning method based on labeled samples is very expensive, so the wafer defect detection model based on unsupervised learning is a future research direction. In this paper, we propose an unsupervised wafer defect classification model(UWDDM), in which the reconstruction loss is used to train the feature extractor of wafer defects, and the classifier is trained based on the cross entropy loss of clustering results and classification results. The experimental results on the real dataset MixedWM38 show that the proposed model has higher recognition accuracy and less inference time than other unsupervised models. This unsupervised learning method has great potential for wafer defect detection. It can avoid the expensive manual labeling cost and provide an effective way to automatically detect wafer defects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56028/aetr.9.1.182.2024"
    },
    {
        "id": 7698,
        "title": "Comparative Study of Unsupervised Clustering Methods Used for RADAR Applications",
        "authors": "Miit Prajapati, Vaibhav Payghan, Abhisha Chauhan, Kranthi Nidubrolu",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "<div class=\"section abstract\"><div class=\"htmlview paragraph\">Driver safety has become an important aspect. To have driver safety RADAR is an essential part of vehicles hence RADAR has great significance in the automotive industry. The Radar sensor collects data from surroundings that may have unwanted data that may lead to improper detections of intended objects, so to have proper object detections it is needed to use clustering methods on the radar point cloud data. There are numerous unsupervised clustering methods used for RADAR applications. In this paper, the comparisons of different unsupervised algorithms such as K-Means Clustering, Hierarchical Clustering, Cluster Using the Gaussian Mixture Model, and DBSCAN are presented. All these clustering algorithms are evaluated based on various evaluation criteria such as the Silhouette coefficient, Davies Bouldin index, etc. Based on evaluations and comparative studies applications of the clustering algorithms are classified.</div></div>",
        "keywords": "",
        "link": "http://dx.doi.org/10.4271/2024-26-0029"
    },
    {
        "id": 7699,
        "title": "Score-Based Unsupervised Anomaly Detection using Graph Clustering and the Activity and Event Network Model",
        "authors": "Amir Mohammadi Bagha, Isaac Woungang, Issa Traore",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnet59123.2023.10339745"
    },
    {
        "id": 7700,
        "title": "Credit Card Fraud Detection: A Hybrid of PSO and K-Means Clustering Unsupervised Approach",
        "authors": "Nityanand Sharma, Vivek Ranjan",
        "published": "2023-1-19",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/confluence56041.2023.10048876"
    },
    {
        "id": 7701,
        "title": "Fetal Arrhythmia: Deep Learning and Clustering Techniques, Analysis through Permutation Entropy and Genetic Algorithms in Its Early Diagnosis",
        "authors": "Zayd Isaac Valdez, Luz Alexandra Díaz Pareja, Antonio Gabriel Ravelo-García, Miguel Vizcardo",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22489/cinc.2023.274"
    },
    {
        "id": 7702,
        "title": "Benchmarking a Wide Range of Unsupervised Learning Methods for Detecting Anomaly in Blast Furnace",
        "authors": "Kendai Itakura, Dukka Bahadur, Hiroto Saigo",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012310800003654"
    },
    {
        "id": 7703,
        "title": "Improved Portfolio Diversification Through Unsupervised Learning",
        "authors": "Michael J. Lewis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4580833"
    },
    {
        "id": 7704,
        "title": "Semi-supervised labelling of chest x-ray images using  unsupervised clustering for ground-truth generation",
        "authors": "Victor Ikechukwu Agughasi, Murali Srinivasiah",
        "published": "2023-9-12",
        "citations": 1,
        "abstract": "Supervised classifiers require a lot of data with accurate labels to learn to recognize chest X-ray images (CXR). However, manually labeling an extensive collection of CXR images is time-consuming and costly. To address this issue, a method for the semi-supervised labelling of extensive collections of CXR images is proposed leveraging unsupervised clustering with minimum expert knowledge to generate ground truth images. The proposed methodology entails: using unsupervised clustering techniques such as K-Means and Self-Organizing Maps. Second, the images are fed to five different feature vectors to utilize the potential differences between features to their full advantage. Third, each data point gets the label of the cluster’s center to which it belongs. Finally, a majority vote is used to decide the ground truth image. The number of clusters created by the method chosen strictly limits the amount of human involvement. To evaluate the effectiveness of the proposed method, experiments were conducted on two publicly available CXR datasets, namely VinDR-CXR and Montgomery datasets. The experiments showed that, for a KNN classifier, manually labeling only 1% (VinDr-CXR), or 10% (Montgomery) of the training data, gives a similar performance as labeling the whole dataset. The proposed methodology efficiently generates ground-truth images from publicly available CXR datasets. To our knowledge, this is the first study to use the VinDr-CXR and Montgomery datasets for ground truth image generation. Extensive experimental analysis using machine learning and statistical techniques shows that the proposed methodology efficiently generates ground truth images from CXR datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31763/aet.v2i3.1143"
    }
]