[
    {
        "id": 21071,
        "title": "Creating Deep Convolutional Neural Networks for Image Classification",
        "authors": "Nabeel Siddiqui",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "\n            This lesson provides a beginner-friendly introduction to convolutional neural networks (CNNs) for image classification. The tutorial provides a conceptual understanding of how neural networks work by using Google's Teachable Machine to train a model on paintings from the ArtUK database. This lesson also demonstrates how to use Javascript to embed the model in a live website.\n          ",
        "link": "http://dx.doi.org/10.46430/phen0108"
    },
    {
        "id": 21072,
        "title": "Image-based Lesion Classification using Deep Neural Networks",
        "authors": "Ákos Hermann, Zoltán Vámossy",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011126200003209"
    },
    {
        "id": 21073,
        "title": "Convolutions and Convolutional Neural Networks",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_12"
    },
    {
        "id": 21074,
        "title": "What are Artificial Neural Networks? Part 2",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_3"
    },
    {
        "id": 21075,
        "title": "Complex-valued convolutional neural networks for real-valued image classification",
        "authors": "Calin-Adrian Popa",
        "published": "2017-5",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2017.7965936"
    },
    {
        "id": 21076,
        "title": "What are Artificial Neural Networks? Part 1",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_2"
    },
    {
        "id": 21077,
        "title": "Capsule Networks: An Alternative Approach to Image Classification Using Convolutional Neural Networks",
        "authors": "KARAN SOOD, Jinan Fiaidhi",
        "published": "No Date",
        "citations": 0,
        "abstract": "I studied a new approach called Capsule networks to overcome the drawbacks of convolutional neural networks.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12100713"
    },
    {
        "id": 21078,
        "title": "Capsule Networks: An Alternative Approach to Image Classification Using Convolutional Neural Networks",
        "authors": "KARAN SOOD, Jinan Fiaidhi",
        "published": "No Date",
        "citations": 0,
        "abstract": "I studied a new approach called Capsule networks to overcome the drawbacks of convolutional neural networks.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12100713.v1"
    },
    {
        "id": 21079,
        "title": "Protein structure featurization via standard image classification neural networks",
        "authors": "Tobias Sikosek",
        "published": "No Date",
        "citations": 0,
        "abstract": "ABSTRACTMany applications in the biomedical domain involve the detailed molecular and functional characterization of macro-molecules such as proteins. Where possible, this involves the knowledge of detailed 3D coordinates of every atom within a protein. At the same time, machine learning has become the basis of much innovation within this domain in recent years. There are, however, a few challenges in applying machine learning to 3D protein structures, such as variability in size and high dimensionality of the data. It would therefore be beneficial to be able to map every protein structure to a smaller fixed-dimensional representation that is directly learned from the structure without manual curation. In addition, it would be valuable for biomedical researchers if such approaches would require little method development and instead draw from cutting-edge research such as image classification via deep neural networks. Here, such an approach is outlined that first re-formats protein structures as 2D color images and then applies off-the-shelf neural networks for image classification. It is shown that such neural networks can be trained to effectively encode the CATH protein classification database and that feature vectors extracted from such networks, once trained, can be transferred to a completely new task that is likely to benefit from molecular protein information, namely that of small molecule binding.",
        "link": "http://dx.doi.org/10.1101/841783"
    },
    {
        "id": 21080,
        "title": "Image Classification Using Artificial Neural Networks",
        "authors": "Dian Ade Kurnia",
        "published": "No Date",
        "citations": 0,
        "abstract": "Artificial neural networks use the same analogy, and process information using artificial neurons.Information is transferred from one artificial neuron to another, which finally leads to an activation function, which acts like a brain and makes a decision",
        "link": "http://dx.doi.org/10.31219/osf.io/hf2pd"
    },
    {
        "id": 21081,
        "title": "Image Classification With Convolutional Neural Networks In MapReduce",
        "authors": "Min Chen",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nDeep learning (DL) techniques, more specifically Convolutional Neural Networks (CNNs), have become increasingly popular in advancing the field of data science and have had great successes in a wide array of applications including computer vision, speech, natural language processing and etc. However, the training process of CNNs is computationally intensive and high computational cost, especially when the dataset is huge. To overcome these obstacles, this paper takes advantage of distributed frameworks and cloud computing to develop a parallel CNN algorithm. MapReduce is a scalable and fault-tolerant data processing tool that was developed to provide significant improvements in large-scale data-intensive applications in clusters. A MapReduce-based CNN (MCNN) is developed in this work to tackle the task of image classification. In addition, the proposed MCNN adopted the idea of adding dropout layers in the networks to tackle the overfitting problem. Close examination of the implementation of MCNN as well as how the proposed algorithm accelerates learning are discussed and demonstrated through experiments. Results reveal high classification accuracy and significant improvements in speedup, scaleup and sizeup compared to the standard algorithms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1131730/v1"
    },
    {
        "id": 21082,
        "title": "Deep Hybrid Real-Complex-Valued Convolutional Neural Networks for Image Classification",
        "authors": "Calin-Adrian Popa",
        "published": "2018-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489274"
    },
    {
        "id": 21083,
        "title": "Chapter 22 - Multi-Modality Brain Image Classification With Deep Convolutional Neural Networks",
        "authors": "",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "The brain is one of the important and complex organs that controls all the metabolic activities of human body. Tumor is formed in the brain due to unwanted growth of tissue. Multimodal Brain Tumor detection is a significant process to avoid mortality and severe illness. Multimodal brain tumor detection is a significant process to diagnose the presence of the tumor.",
        "link": "http://dx.doi.org/10.59646/csebookc22/004"
    },
    {
        "id": 21084,
        "title": "Chapter 13 - Deep Convolutional Neural Networks for Multi-Modality Brain Image Classification",
        "authors": "",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "Attention deficit hyperactivity disorder (ADHD) is one of the mostcommon mental health disorders. As a neuro development disorder, neuroimaging technologies, such as magnetic resonance imaging (MRI), coupled with machine learning algorithms, are being increasingly explored as biomarkers in ADHD.",
        "link": "http://dx.doi.org/10.59646/ecebookc13/007"
    },
    {
        "id": 21085,
        "title": "Exposing Neural Network Models",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_16"
    },
    {
        "id": 21086,
        "title": "Improving the Performance of Convolutional Neural Networks for Image Classification",
        "authors": " Davar Giveki",
        "published": "2021-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s1060992x21010100"
    },
    {
        "id": 21087,
        "title": "Introduction to Convolutional Neural Networks",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0"
    },
    {
        "id": 21088,
        "title": "Wavelet Integrated Adder Neural Networks for Better Image Classification",
        "authors": "Guangping Li, Dingkai Liang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Adder neural networks is a new kind of deep learning model in which the\noriginal massive multiplications in convolutions are replaced by\nadditions. The overall energy consumption using adder networks is\nreduced significantly. However, there is an accuracy drop in image\nclassification task. In this letter, we present a add-wavelet transform\nblock (AWT) instead of the existing down-sampling operations. Based on\nthe AWT, we propose a novel adder neural networks (AddWaveNets) to\nimprove classification accuracy. Experimental results on CIFAR datasets\nshow that our proposed AddWaveNets achieves significant improvements in\nclassification accuracy and a powerful ability of feature learning\ncompared to state-of-the-art quantization networks.",
        "link": "http://dx.doi.org/10.22541/au.165573426.68869254/v1"
    },
    {
        "id": 21089,
        "title": "Let’s Build a Neural Network!",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_5"
    },
    {
        "id": 21090,
        "title": "WITHDRAWN: Exploring the features of quanvolutional neural networks for improved image classification",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe full text of this preprint has been withdrawn by the authors as it was submitted and made public without the full consent of all the authors. Therefore, the authors do not wish this work to be cited as a reference. Questions should be directed to the corresponding author.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2844895/v2"
    },
    {
        "id": 21091,
        "title": "Exploring the Impact of Recurrent Neural Networks on Image Classification and Optimizing Neural Configuration",
        "authors": "Abdul Hasib Uddin",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn this research, we delve into the unexplored potential of Long Short-term Memory (LSTM) and Gated Recurrent Unit (GRU) networks in the field of Computer Vision (CV). With the trend of Deep Learning methods shifting towards complex Neural Network architectures, researchers have acknowledged the efficacy of Dense and Convolutional Neural Networks (CNNs) in CV tasks, while Recurrent Neural Networks (RNNs) have been proven to be effective in Natural Language Processing (NLP) problems. Despite some recent developments in blending RNN with CNN for NLP, there have been very few attempts in applying RNN-based approaches in CV. To address this gap, we take a unique in order to develop LSTM and GRU models by tuning the number of layers and number of neurons in each layer. The models are then applied to multiple benchmark datasets (Fashion-MNIST, MNIST, EMNIST-Letters, EMNIST-Digits, Kuzushiji-MNIST, and Kuzushiji-49). Our experimental results indicate that LSTM and GRU networks significantly outperforms corresponding CNN and Dense networks with optimal number of parameters. Our findings suggest that RNN (LSTM and GRU) can be valuable alternatives to CNN and Dense networks for image classification problems in CV. This study presents a new direction for further research in the field and highlights the potential of LSTM and GRU networks in CV tasks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2822822/v1"
    },
    {
        "id": 21092,
        "title": "Modified Convolutional Neural Networks Architecture for Hyperspectral Image Classification (Extra‐Convolutional Neural Networks)",
        "authors": "Maissa HAMOUDA, Med Salim BOUHLEL",
        "published": "2021-3-14",
        "citations": 3,
        "abstract": "AbstractClassification of Hyperspectral Satellite Images (HSI) is a very important technology for object detection and cartography. Several problems can be detected, which make classification difficult (large size of the images, fusion between the classes, small amount of samples, etc.). Recently, several Convolutional Neural Networks (CNN‐HSI) have been proposed for the classification of hyperspectral images. In this article, an improvement to CNN‐HSI is proposed, aiming to reduce the number of erroneous pixels during classification (due to the limited number of samples). Thus, an extra‐convolution technique (ExCNN) is proposed, where we add layers of global convolutions on the classified images, outgoing from classical CNN. The addition of 1 to 10 layers, on three real hyperspectral images, is tested. The results obtained are compared with other similar methods of the state of art, and show the effectiveness of the proposed method.",
        "link": "http://dx.doi.org/10.1049/ipr2.12169"
    },
    {
        "id": 21093,
        "title": "Disaster Image Classification Using Capsule Networks",
        "authors": "Soudabeh Taghian Dinani, Doina Caragea",
        "published": "2021-7-18",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534448"
    },
    {
        "id": 21094,
        "title": "Investigating Temporal Convolutional Neural Networks For Satellite Image Time Series Classification",
        "authors": "Zahraa Abdallah, James Brock",
        "published": "No Date",
        "citations": 2,
        "abstract": "Publically available data used in this research",
        "link": "http://dx.doi.org/10.36227/techrxiv.19590580"
    },
    {
        "id": 21095,
        "title": "Hyperparameters",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_4"
    },
    {
        "id": 21096,
        "title": "Investigating Temporal Convolutional Neural Networks For Satellite Image Time Series Classification",
        "authors": "Zahraa Abdallah, James Brock",
        "published": "No Date",
        "citations": 0,
        "abstract": "Publically available data used in this research",
        "link": "http://dx.doi.org/10.36227/techrxiv.19590580.v1"
    },
    {
        "id": 21097,
        "title": "Convolutional neural networks for image classification",
        "authors": "Andrii O. Tarasenko, Yuriy V. Yakimov, Vladimir N. Soloviev",
        "published": "2020-2-9",
        "citations": 9,
        "abstract": "This paper shows the theoretical basis for the creation of convolutional neural networks for image classification and their application in practice. To achieve the goal, the main types of neural networks were considered, starting from the structure of a simple neuron to the convolutional multilayer network necessary for the solution of this problem. It shows the stages of the structure of training data, the training cycle of the network, as well as calculations of errors in recognition at the stage of training and verification. At the end of the work the results of network training, calculation of recognition error and training accuracy are presented.",
        "link": "http://dx.doi.org/10.31812/123456789/3682"
    },
    {
        "id": 21098,
        "title": "Efficient Convolutional Neural Networks for Multi-Spectral Image Classification",
        "authors": "Jacob J. Senecal, John W. Sheppard, Joseph A. Shaw",
        "published": "2019-7",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8851840"
    },
    {
        "id": 21099,
        "title": "Semantic Hierarchy-based Convolutional Neural Networks for Image Classification",
        "authors": "Matheus Inoue, Carlos Henrique Forster, Antonio Carlos dos Santos",
        "published": "2020-7",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207246"
    },
    {
        "id": 21100,
        "title": "A patch-based convolutional neural network for remote sensing image classification",
        "authors": "Atharva Sharma, Xiuwen Liu, Xiaojun Yang, Di Shi",
        "published": "2017-11",
        "citations": 174,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2017.07.017"
    },
    {
        "id": 21101,
        "title": "On improving recurrent neural network for image classification",
        "authors": "B. Chandra, Rajesh Kumar Sharma",
        "published": "2017-5",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2017.7966083"
    },
    {
        "id": 21102,
        "title": "Pretrained Models",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_14"
    },
    {
        "id": 21103,
        "title": "EQNAS: Evolutionary Quantum Neural Architecture Search for Image Classification",
        "authors": "Yangyang Li, Ruijiao Liu, Xiaobin Hao, Ronghua Shang, Peixiang Zhao, Licheng Jiao",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.040"
    },
    {
        "id": 21104,
        "title": "Group Convolutional Neural Networks for Hyperspectral Image Classification",
        "authors": "Xian Li, Mingli Ding, Aleksandra Pizurica",
        "published": "2019-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8803839"
    },
    {
        "id": 21105,
        "title": "Auroral Image Classification with Deep Neural Networks",
        "authors": "Andreas Kvammen, Kristoffer Wickstrøm, Derek McKay, Noora Partamies",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10501968.1"
    },
    {
        "id": 21106,
        "title": "Bayesian Neural Networks for Cellular Image Classification and Uncertainty Analysis",
        "authors": "Giacomo Deodato, Christopher Ball, Xian Zhang",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractOver the last decades, deep learning models have rapidly gained popularity for their ability to achieve state-of-the-art performances in different inference settings. Novel domains of application define a new set of requirements that transcend accurate predictions and depend on uncertainty measures. The aims of this study are to implement Bayesian neural networks and use the corresponding uncertainty estimates to improve predictions and perform dataset analysis. We identify two main advantages in modeling the predictive uncertainty of deep neural networks performing classification tasks. The first is the possibility to discard highly uncertain predictions to increase model accuracy. The second is the identification of unfamiliar patterns in the data that correspond to outliers in the model representation of the training data distribution. Such outliers can be further characterized as either corrupted observations or data belonging to different domains. Both advantages are well demonstrated on benchmark datasets. Furthermore we apply the Bayesian approach to a biomedical imaging dataset where cancer cells are treated with diverse drugs, and show how one can increase classification accuracy and identify noise in the ground truth labels with uncertainty analysis.",
        "link": "http://dx.doi.org/10.1101/824862"
    },
    {
        "id": 21107,
        "title": "Advancing Automated Diagnosis: Convolutional Neural Networks for Alzheimer's Disease Classification through MRI Image Processing",
        "authors": "Dheiver Francisco Santos",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>This study evaluates the performance of a convolutional neural network (CNN) model for Alzheimer's disease (AD) classification based on MRI image processing. The results show that after 22 epochs of training, the model achieved a validation accuracy of 80.61%. Furthermore, the model exhibited high precision (78.99%) and recall (30.55%) rates, along with a significant area under the curve (AUC) value of 86.05%. These findings suggest the potential of the CNN model in accurately identifying AD cases using MRI scans, emphasizing its effectiveness as a diagnostic tool for early detection and intervention in AD.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23002007.v1"
    },
    {
        "id": 21108,
        "title": "How Quality Affects Deep Neural Networks in Fine-Grained Image Classification",
        "authors": "Joseph Smith, Zheming Zuo, Jonathan Stonehouse, Boguslaw Obara",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012359200003660"
    },
    {
        "id": 21109,
        "title": "Universal Function Approximators",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_1"
    },
    {
        "id": 21110,
        "title": "Advancing Automated Diagnosis: Convolutional Neural Networks for Alzheimer's Disease Classification through MRI Image Processing",
        "authors": "Dheiver Francisco Santos",
        "published": "No Date",
        "citations": 1,
        "abstract": "<p>This study evaluates the performance of a convolutional neural network (CNN) model for Alzheimer's disease (AD) classification based on MRI image processing. The results show that after 22 epochs of training, the model achieved a validation accuracy of 80.61%. Furthermore, the model exhibited high precision (78.99%) and recall (30.55%) rates, along with a significant area under the curve (AUC) value of 86.05%. These findings suggest the potential of the CNN model in accurately identifying AD cases using MRI scans, emphasizing its effectiveness as a diagnostic tool for early detection and intervention in AD.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23002007"
    },
    {
        "id": 21111,
        "title": "Example 1 – Imports",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_6"
    },
    {
        "id": 21112,
        "title": "Graph Neural Networks for Colorectal Histopathological Image Classification",
        "authors": "Esra Tepe, Gokhan Bilgin",
        "published": "2022-10-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tiptekno56568.2022.9960184"
    },
    {
        "id": 21113,
        "title": "An Enhanced X-Ray Image Classification Model Using Deep Convolutional Neural Networks",
        "authors": "Suresh Mohan, Subhashini Narayan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4397703"
    },
    {
        "id": 21114,
        "title": "Learning a discriminative SPD manifold neural network for image set classification",
        "authors": "Rui Wang, Xiao-Jun Wu, Ziheng Chen, Tianyang Xu, Josef Kittler",
        "published": "2022-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.03.012"
    },
    {
        "id": 21115,
        "title": "SOMNet: Unsupervised Feature Learning Networks for Image Classification",
        "authors": "Richard Hankins, Yao Peng, Hujun Yin",
        "published": "2018-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489404"
    },
    {
        "id": 21116,
        "title": "Example 1 – Data Loading",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_8"
    },
    {
        "id": 21117,
        "title": "Example 1 – Testing Loop",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_10"
    },
    {
        "id": 21118,
        "title": "Example 4 – Exposing Models",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_17"
    },
    {
        "id": 21119,
        "title": "Remote Sensing Image Classification Using Transfer Learning Based Convolutional Neural Networks: An Experimental Overview",
        "authors": "Sushish Baral, Jagannath Aryal",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Image classification is one of the prominent tasks influencing the rapid advancement in computer vision using deep learning models such as convolutional neural networks, analogously gaining remarkable attention in remote sensing scene classification. However, the systematic comparability of literature concerning well-established large-scale or application-dependent datasets and models still requires improvement. This article intends to introduce the five high-capacity convolutional neural network architectures (VGG, ResNet, DenseNet, SqueezeNet, and AlexNet) and their variations with ten large-scale and small- scale datasets to provide a one-to-one experimentation summary. The observations were noted for comparison by keeping the configurations ideal in each trial. The performance of the models is depicted and discussed, with a focus on the number of flops, accuracy, F1-score, precision, recall, and AUCROC. This experiment validates the remote sensing image classification benchmark and provides insight for researchers and practitioners based on the summary and discussion for choosing the optimal model by comparing performance and the number of required floating point operations. Finally, The advanced optimization techniques of Normalization, Mixed-up augmentation, and Label smoothing are introduced to the best-chosen model in the case of each dataset. </p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22581457.v1"
    },
    {
        "id": 21120,
        "title": "Remote Sensing Image Classification Using Transfer Learning Based Convolutional Neural Networks: An Experimental Overview",
        "authors": "Sushish Baral, Nabin Sharma",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Image classification is one of the prominent tasks influencing the rapid advancement in computer vision using deep learning models such as convolutional neural networks, analogously gaining remarkable attention in remote sensing scene classification. However, the systematic comparability of literature concerning well-established large-scale or application-dependent datasets and models still requires improvement. This article intends to introduce the five high-capacity convolutional neural network architectures (VGG, ResNet, DenseNet, SqueezeNet, and AlexNet) and their variations with ten large-scale and small- scale datasets to provide a one-to-one experimentation summary. The observations were noted for comparison by keeping the configurations ideal in each trial. The performance of the models is depicted and discussed, with a focus on the number of flops, accuracy, F1-score, precision, recall, and AUCROC. This experiment validates the remote sensing image classification benchmark and provides insight for researchers and practitioners based on the summary and discussion for choosing the optimal model by comparing performance and the number of required floating point operations. Finally, the advanced optimization techniques of Normalization, Mixed-up augmentation, and Label smoothing are introduced to the best-chosen model in the case of each dataset.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22581457.v2"
    },
    {
        "id": 21121,
        "title": "ELM embedded discriminative dictionary learning for image classification",
        "authors": "Yijie Zeng, Yue Li, Jichao Chen, Xiaofan Jia, Guang-Bin Huang",
        "published": "2020-3",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2019.11.015"
    },
    {
        "id": 21122,
        "title": "Example 3 – Pretrained Models",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_15"
    },
    {
        "id": 21123,
        "title": "Example 1 – Training Loop",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_9"
    },
    {
        "id": 21124,
        "title": "Example 1 – Model Definition",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_7"
    },
    {
        "id": 21125,
        "title": "Shallow and deep learning for image classification",
        "authors": "G. Ososkov, P. Goncharov",
        "published": "2017-10",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s1060992x1704004x"
    },
    {
        "id": 21126,
        "title": "Adversarial pair-wise distribution matching for remote sensing image cross-scene classification",
        "authors": "Sihan Zhu, Chen Wu, Bo Du, Liangpei Zhang",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106241"
    },
    {
        "id": 21127,
        "title": "Image Classification Using Convolutional Neural Networks to Automate Visual Inspection of CCO Containers (Rev. 1)",
        "authors": "Isaac Garon",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1997257"
    },
    {
        "id": 21128,
        "title": "Example 2 – Convolutional Model",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_13"
    },
    {
        "id": 21129,
        "title": "Remote Sensing Image Classification Using Transfer Learning Based Convolutional Neural Networks: An Experimental Overview",
        "authors": "Sushish Baral, Nabin Sharma",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Image classification is one of the prominent tasks influencing the rapid advancement in computer vision using deep learning models such as convolutional neural networks, analogously gaining remarkable attention in remote sensing scene classification. However, the systematic comparability of literature concerning well-established large-scale or application-dependent datasets and models still requires improvement. This article intends to introduce the five high-capacity convolutional neural network architectures (VGG, ResNet, DenseNet, SqueezeNet, and AlexNet) and their variations with ten large-scale and small- scale datasets to provide a one-to-one experimentation summary. The observations were noted for comparison by keeping the configurations ideal in each trial. The performance of the models is depicted and discussed, with a focus on the number of flops, accuracy, F1-score, precision, recall, and AUCROC. This experiment validates the remote sensing image classification benchmark and provides insight for researchers and practitioners based on the summary and discussion for choosing the optimal model by comparing performance and the number of required floating point operations. Finally, the advanced optimization techniques of Normalization, Mixed-up augmentation, and Label smoothing are introduced to the best-chosen model in the case of each dataset.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22581457"
    },
    {
        "id": 21130,
        "title": "Exploring Highly Efficient Compact Neural Networks For Image Classification",
        "authors": "Xukai Xie, Yuan Zhou, Sun-Yuan Kung",
        "published": "2020-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip40778.2020.9191334"
    },
    {
        "id": 21131,
        "title": "Neural Networks for Classification and Unsupervised Segmentation of Visibility Artifacts on Monocular Camera Image",
        "authors": "Vladislav I. Kuznetsov, Dmitry A. Yudin",
        "published": "2022-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s1060992x22030043"
    },
    {
        "id": 21132,
        "title": "AFINet: Attentive Feature Integration Networks for image classification",
        "authors": "Xinglin Pan, Jing Xu, Yu Pan, Liangjian Wen, Wenxiang Lin, Kun Bai, Hongguang Fu, Zenglin Xu",
        "published": "2022-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.08.026"
    },
    {
        "id": 21133,
        "title": "Complex-Valued Neural Networks for Synthetic Aperture Radar Image Classification",
        "authors": "Theresa Scarnati, Benjamin Lewis",
        "published": "2021-5-7",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/radarconf2147009.2021.9455316"
    },
    {
        "id": 21134,
        "title": "Improved deep CNNs based on Nonlinear Hybrid Attention Module for image classification",
        "authors": "Nan Guo, Ke Gu, Junfei Qiao, Jing Bi",
        "published": "2021-8",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2021.01.005"
    },
    {
        "id": 21135,
        "title": "Convolutional Neural Networks for Image Classification",
        "authors": "Yiju Hao",
        "published": "2021-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaice54393.2021.00073"
    },
    {
        "id": 21136,
        "title": "Image Classification of Stroke Blood Clot Origin Using Deep Convolutional Neural Networks and Visual Transformers: A Kaggle Competition",
        "authors": "",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "Stroke is one of two main causes of death worldwide. Many individuals suffer from ischemic stroke every year. Only in US, more over 700,000 individuals meet ischemic stroke due to blood clot blocking an artery to the brain every year. «Stroke symptoms typically start suddenly, over seconds to minutes, and in most cases do not progress further. The symptoms depend on the area of the brain affected. The more extensive the area of the brain affected, the more functions that are likely to be lost. »  «Ischemic stroke occurs because of a loss of blood supply to part of the brain, initiating the ischemic cascade. » In the case of subsequent strokes, it is possible to mitigate consequences if physicians can determine stroke etiology. The paper describes particular approach how to apply Artificial Intelligence for purposes of separating two major acute ischemic stroke (AIS) etiology subtypes: cardiac and large artery atherosclerosis. Four deep neural network architectures and simple ensemble method are used in the approach.",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.14"
    },
    {
        "id": 21137,
        "title": "Example 1 – Testing Our Model",
        "authors": "Nemanja Milosevic",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5648-0_11"
    },
    {
        "id": 21138,
        "title": "Evolving Deep Neural Networks for Efficient Image Classification",
        "authors": "Abhinav Agnihotri, Rajitha B",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3576482"
    },
    {
        "id": 21139,
        "title": "Universal adversarial attacks on deep neural networks for medical image classification",
        "authors": "Hokuto Hirano, Akinori Minagi, Kazuhiro Takemoto",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nBackground. Deep neural networks (DNNs) are widely investigated in medical image classification to achieve ﻿automated support for clinical diagnosis. It is necessary to evaluate the robustness of medical DNN tasks against adversarial attacks, as high-stake decision-making will be made based on the diagnosis. Several previous studies have considered simple adversarial attacks. However, the vulnerability of DNNs to more realistic and higher risk attacks, such as universal adversarial perturbation (UAP), which is a single perturbation that can induce DNN failure in most classification tasks has not been evaluated yet.Methods. We focus on three representative DNN-based medical image classification tasks (i.e., skin cancer, referable diabetic retinopathy, and pneumonia classifications) and investigate their vulnerability to the seven model architectures of UAPs.Results. We demonstrate that DNNs are vulnerable to both nontargeted UAPs, which cause a task failure resulting in an input being assigned an incorrect class, and to targeted UAPs, which cause the DNN to classify an input into a specific class. The almost imperceptible UAPs achieved > 80% success rates for nontargeted and targeted attacks. The vulnerability to UAPs depended very little on the model architecture. Moreover, we discovered that adversarial retraining, which is known to be an effective method for adversarial defenses, increased DNNs’ robustness against UAPs in only very few cases.Conclusion. Unlike previous assumptions, the results indicate that DNN-based clinical diagnosis is easier to deceive because of adversarial attacks. Adversaries can cause failed diagnoses at lower costs (e.g., without consideration of data distribution); moreover, they can affect the diagnosis. The effects of adversarial defenses may not be limited. Our findings emphasize that more careful consideration is required in developing DNNs for medical imaging and their practical applications.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-70727/v2"
    },
    {
        "id": 21140,
        "title": "Universal adversarial attacks on deep neural networks for medical image classification",
        "authors": "Hokuto Hirano, Akinori Minagi, Kazuhiro Takemoto",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground. Deep neural networks (DNNs) are widely investigated in medical image classification to achieve ﻿automated support for clinical diagnosis. It is necessary to evaluate the robustness of medical DNN tasks against adversarial attacks, as high-stake decision making will be made based on the diagnosis. Several previous studies have considered simple adversarial attacks. However, the vulnerability of DNNs to more realistic and higher risk attacks have not been evaluated yet, i.e., universal adversarial perturbation (UAP), which is a single perturbation that can induce DNN failure in most classification tasks.Methods. We focus on three representative DNN-based medical image classification tasks (i.e., skin cancer, referable diabetic retinopathy, and pneumonia classifications) and investigate their vulnerability of DNNs with various model architectures to UAPs.Results. We demonstrate that the DNNs are vulnerable to both nontargeted UAPs, which cause a task failure resulting in an input being assigned an incorrect class, and to targeted UAPs, which cause the DNN to classify an input into a specific class. The almost imperceptible UAPs achieved > 80% success rates for nontargeted and targeted attacks. The vulnerability to UAPs barely depended on model architecture. Moreover, we discovered that adversarial retraining, which is known to be an effective method for adversarial defenses, increased the robustness of DNNs against UAPs in only limited cases. Conclusion. Unlike previous assumptions, the results indicate that DNN-based clinical diagnosis is easier to deceive because of adversarial attacks. Adversaries can result in failed diagnoses at lower costs (e.g., without consideration of data distribution); moreover, they can affect the diagnosis. The effects of adversarial defenses may be not limited. Our findings emphasize that more careful consideration is required in developing DNNs for medical imaging and their practical applications.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-70727/v1"
    },
    {
        "id": 21141,
        "title": "Bacterial Image Classification Using Convolutional Neural Networks",
        "authors": "Tumun Shaily, S Kala",
        "published": "2020-12-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/indicon49873.2020.9342356"
    },
    {
        "id": 21142,
        "title": "Random Image Frequency Aggregation Dropout in Image Classification for Deepconvolutional Neural Networks",
        "authors": "Ju-Hyeon Nam, Sang-Chul Lee",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4113647"
    },
    {
        "id": 21143,
        "title": "Margin-Based Sample Filtering for Image Classification Using Convolutional Neural Networks",
        "authors": "Pantelis I. Kaplanoglou, Konstantinos Diamantaras",
        "published": "2018-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2018.8451592"
    },
    {
        "id": 21144,
        "title": "On Quantization of Image Classification Neural Networks for Compression Without Retraining",
        "authors": "Marcos Tonin, Ricardo L. de Queiroz",
        "published": "2022-10-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip46576.2022.9897466"
    },
    {
        "id": 21145,
        "title": "Deep Convolutional Neural Networks for Image Classification: A Comprehensive Review",
        "authors": "Waseem Rawat, Zenghui Wang",
        "published": "2017-9",
        "citations": 2144,
        "abstract": " Convolutional neural networks (CNNs) have been applied to visual tasks since the late 1980s. However, despite a few scattered applications, they were dormant until the mid-2000s when developments in computing power and the advent of large amounts of labeled data, supplemented by improved algorithms, contributed to their advancement and brought them to the forefront of a neural network renaissance that has seen rapid progression since 2012. In this review, which focuses on the application of CNNs to image classification tasks, we cover their development, from their predecessors up to recent state-of-the-art deep learning systems. Along the way, we analyze (1) their early successes, (2) their role in the deep learning renaissance, (3) selected symbolic works that have contributed to their recent popularity, and (4) several improvement attempts by reviewing contributions and challenges of over 300 publications. We also introduce some of their current trends and remaining challenges. ",
        "link": "http://dx.doi.org/10.1162/neco_a_00990"
    },
    {
        "id": 21146,
        "title": "Retinal OCT Image Classification Based on CNN-RNN Unified Neural Networks",
        "authors": "Xue-Feng Jiang Xue-Feng Jiang, Ken-Cheng Xue-Feng Jiang, Zhi-De Li Ken-Cheng",
        "published": "2024-2",
        "citations": 0,
        "abstract": "\n                        <p>Computer-aided diagnosis of retinopathy is a hot research topic in the field of medical image classification, where optical coherence tomography (OCT) is an important basis for the diagnosis of ophthalmic diseases. Traditional approaches to multi-label image classification learn independent classifiers for each category and employ ranking or thresholding on the classification results. These techniques, although working well, fail to explicitly exploit the label dependencies in an image. In this paper, two publicly available retinal OCT image datasets are integrated and screened. Then, an end-to-end deep learning algorithmic framework based on CNN-RNN Unified Neural Networks was proposed to automatically and reliably classify six categories of retinal OCT images. Numerical results suggest that the proposed algorithm works well in terms of accuracy, precision, sensitivity and specificity, approaching or even partially surpassing the performance of clinical experts. It is valuable in promoting computer-aided diagnosis towards practical clinical applications and improving the efficiency of clinical diagnosis of retinal diseases.</p>\n<p>&nbsp;</p>\n                    ",
        "link": "http://dx.doi.org/10.53106/199115992024023501021"
    },
    {
        "id": 21147,
        "title": "An Investigation of Methods for Improving Spatial Invariance of Convolutional Neural Networks for Image Classification",
        "authors": "David Noel, Sumitra Mukherjee",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4548826"
    },
    {
        "id": 21148,
        "title": "METHODS FOR ASSESSMENT OF EFFICIENCY OF NEURAL NETWORKS FOR IMAGE CLASSIFICATION",
        "authors": "D.V. Kuznetsov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51691/2541-8327_2023_4_21"
    },
    {
        "id": 21149,
        "title": "Spectral Graph Neural Networks with Manifold-Learning-Based Feature Extraction for Hyperspectral Image Classification",
        "authors": "Shengliang Pu",
        "published": "2022-2-9",
        "citations": 0,
        "abstract": "In this short article, we briefly retrospect the recent progress of spectral graph neural networks with manifold-learning-based feature extraction for hyperspectral image classification. \n",
        "link": "http://dx.doi.org/10.32388/b899uz"
    },
    {
        "id": 21150,
        "title": "Brain MR Image Classification for ADHD Diagnosis Using Deep Neural Networks",
        "authors": "Sahar Abdolmaleki, Mohammad Saniee Abadeh",
        "published": "2020-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mvip49855.2020.9116877"
    },
    {
        "id": 21151,
        "title": "CEGAT: A CNN and enhanced-GAT based on key sample selection strategy for hyperspectral image classification",
        "authors": "Cuiping Shi, Haiyang Wu, Liguo Wang",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.059"
    },
    {
        "id": 21152,
        "title": "Hyperspectral Band Selection for Multispectral Image Classification with Convolutional Networks",
        "authors": "Giorgio Morales, John Sheppard, Riley Logan, Joseph Shaw",
        "published": "2021-7-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9533700"
    },
    {
        "id": 21153,
        "title": "Causal multi-label learning for image classification",
        "authors": "Yingjie Tian, Kunlong Bai, Xiaotong Yu, Siyu Zhu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.052"
    },
    {
        "id": 21154,
        "title": "Image Classification Using the Method of Convolutional Neural Networks",
        "authors": "Kaixin Huang",
        "published": "2022-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tocs56154.2022.10016070"
    },
    {
        "id": 21155,
        "title": "Classification of Imbalanced Cloud Image Data Using Deep Neural Networks –Performance Improvement Through a Data Science Competition–",
        "authors": "Daisuke Matsuoka",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nImage data classification using machine learning is one of the effective methods for detecting atmospheric phenomena. However, extreme weather events with a small number of cases cause a decrease in classification prediction accuracy owing to the imbalance of data between the target class and the other classes. In order to build a highly accurate classification model, we held a data analysis competition to determine the best classification performance for two classes of cloud image data: tropical cyclones including precursors and other classes. For the top models in the competition, minority data oversampling, majority data undersampling, ensemble learning, deep layer neural networks, and cost-effective loss functions were used to improve the imbalanced classification performance. In particular, the best model out of 209 submissions succeeded in improving the classification capability by 65.4% over similar conventional methods in a measure of low false alarm ratio.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-710989/v1"
    },
    {
        "id": 21156,
        "title": "Convolutional neural networks for histopathology image classification: Training vs. Using pre-trained networks",
        "authors": "Brady Kieffer, Morteza Babaie, Shivam Kalra, H. R. Tizhoosh",
        "published": "2017-11",
        "citations": 78,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipta.2017.8310149"
    },
    {
        "id": 21157,
        "title": "Convolutional Neural Networks for High Spatial Resolution Remote Sensing Image Classification",
        "authors": "Rajagopal T K P, Sakthi G, Prakash J",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nHyperspectral remote sensing based image classification is found to be a very widely used method employed for scene analysis that is from a remote sensing data which is of a high spatial resolution. Classification is a critical task in the processing of remote sensing. On the basis of the fact that there are different materials with reflections in a particular spectral band, all the traditional pixel-wise classifiers both identify and also classify all materials on the basis of their spectral curves (or pixels). Owing to the dimensionality of the remote sensing data of high spatial resolution along with a limited number of labelled samples, a remote sensing image of a high spatial resolution tends to suffer from something known as the Hughes phenomenon which can pose a serious problem. In order to overcome such a small-sample problem, there are several methods of learning like the Support Vector Machine (SVM) along with the other methods that are kernel based and these were introduced recently for a remote sensing classification of the image and this has shown a good performance. For the purpose of this work, an SVM along with Radial Basis Function (RBF) method was proposed. But, a feature learning approach for the classification of the hyperspectral image is based on the Convolutional Neural Networks (CNNs). The results of the experiment that were based on various image datasets that were hyperspectral which implies that the method proposed will be able to achieve a better performance of classification compared to other traditional methods like the SVM and the RBF kernel and also all conventional methods based on deep learning (CNN).",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-953414/v1"
    },
    {
        "id": 21158,
        "title": "Fruit Image Classification Using Convolution Neural Networks",
        "authors": "Yifan Yang",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Artificial intelligence has been used in many places in people's daily life, and there are more and more methods to classify objects by using deep learning. However, at present, the technique of fruit classification is mainly manual classification, and the accuracy of mechanical classification needs to be improved. The ideas for fruit recognition are primarily focused on distinguishing the shape, texture, and colour of fruits. Therefore, this paper uses deep learning technology since the performance of deep learning in the field of computer vision is better than that of traditional machine learning. The convolutional neural network (CNN) of deep learning will automatically learn the features of different fruit images to establish a model for predicting fruit types. In this paper, four CNNs models with different structures are compared with the prediction results for 131 different types of fruit. The data showed that the best model provided 98.2% accuracy.",
        "link": "http://dx.doi.org/10.54097/hset.v34i.5430"
    },
    {
        "id": 21159,
        "title": "Distorted image classification using neural activation pattern matching loss",
        "authors": "Satoshi Suzuki, Shoichiro Takeda, Ryuichi Tanida, Yukihiro Bandoh, Hayaru Shouno",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.050"
    },
    {
        "id": 21160,
        "title": "Garbage Image Classification Based on Improved Residual Neural Networks",
        "authors": "Ling-Ying Zhao, Hong-Yu Zhao",
        "published": "2022-10-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicml57342.2022.10009851"
    },
    {
        "id": 21161,
        "title": "Effects of objects and image quality on melanoma classification using Deep Neural Networks",
        "authors": "Bilge Süheyla Akkoca-Gazioğlu, Mustafa Kamasak",
        "published": "No Date",
        "citations": 3,
        "abstract": "Abstract\nBackground: Melanoma is a type of skin cancer with a higher mortality compared to other types of skin cancers. Early and accurate diagnosis of melanoma has critical importance on its prognosis. Recently, deep neural network based models dominated the CAD systems for classification of the potential melanoma lesions. In clinical settings, capturing impeccable skin images is not always possible. In some cases, an external object such as a ruler is required for determination of lesion size. Sometimes, the skin images can be blurry, noisy or have low contrast. The aim of this work is to investigate the effects of external objects (ruler, hair) and image quality (blur, noise, contrast) on the classification of melanoma using commonly used Convolutional Neural Network(CNN) models.Results: Performance is analyzed using accuracy, sensitivity, specificity and precision metrics over 6 different test sets. Hair set has 89.22%, ruler set has 86% and none set has 88.81% as the best accuracy with DenseNet121 architecture. Also, DenseNet has the best average accuracy with comparing the other three models in other datasets, which are noise and blur. We find that ResNet is better for contrast dataset. We can infer that DenseNet can be used for melanoma classification with image distortions and degradations. Conclusion: In this study, we investigate the effect of ruler/hair and image blur, noise and contrast on the melanoma detection performance of four commonly used CNN models: ResNet50, DenseNet121, VGG16 and AlexNet. Melanoma images can be better recognized under contrast changes unlike the benign images, we recommend ResNet model whenever there is contrast issue. Noise significantly degrades the performance on melanoma images and the recognition rates decrease with compared to benign lesions in noisy set. DenseNet121 also works well in this set. Both classes are sensitive to blur changes and best accuracy is obtained with DenseNet model. The images contain ruler has decreased the classification accuracy and ResNet has better performance if there is ruler in an image. Hairy images have the best success rate in our system since it has the maximum number of images in total dataset. DenseNet performs better for both hairy and high quality images.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-35907/v1"
    },
    {
        "id": 21162,
        "title": "Galaxy Classification Using Neural Networks: A Review",
        "authors": "Pranjal Sharma, Arijit Baral",
        "published": "2018-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icalip.2018.8455426"
    },
    {
        "id": 21163,
        "title": "Self-supervision assisted multimodal remote sensing image classification with coupled self-looping convolution networks",
        "authors": "Shivam Pande, Biplab Banerjee",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.04.019"
    },
    {
        "id": 21164,
        "title": "Fully Convolutional Neural Networks for Tissue Histopathology Image Classification and Segmentation",
        "authors": "Binbin Peng, Lin Chen, Mingsheng Shang, Jianjun Xu",
        "published": "2018-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2018.8451517"
    },
    {
        "id": 21165,
        "title": "Image Classification Using Convolutional Neural Networks and Kernel Extreme Learning Machines",
        "authors": "Zhuangzi Li, Xiaobin Zhu, Lei Wang, Peiyu Guo",
        "published": "2018-10",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2018.8451560"
    },
    {
        "id": 21166,
        "title": "Classification of Human Metaspread Images Using Convolutional Neural Networks",
        "authors": "Tanvi Arora",
        "published": "2020-12-19",
        "citations": 6,
        "abstract": " Chromosomes are the genetic information carriers. Any modification to the structure or the number of chromosomes results in a medical condition termed as genetic defect. In order to uncover the genetic defects, the chromosomes are imaged during the cell division process. The images thus generated are termed as metaspread images and are used for identifying the genetic defects. It has been observed that the metaspread images generally suffer from intensity inhomogeneity and the chromosomes are also present in varied orientations, and as a result finding genetic defects from such images is a tedious process. Therefore, cytogeneticists manually select the images that can be used for the purpose of uncovering the genetic defects and the generation of the karyotype. In the proposed approach, a novel method is being presented using DenseNet architecture of the convolutional neural networks-based classifier, which classifies the human metaspread images into two distinct categories, namely, analyzable and non-analyzable based on the orientation of the chromosomes present in the metaspread images. This classification process will help to select the most prominent metaspread images for karyotype generation that has least amount of touching and overlapping chromosomes. The proposed method is novel in comparison to the earlier methods as it works on any type of image, be it G band images, MFISH images or the Q-banded images. The proposed method has been trained by using a ground truth of 156 750 metaspread images. The proposed classifier has been able to achieve an error rate of 1.46%. ",
        "link": "http://dx.doi.org/10.1142/s0219467821500339"
    },
    {
        "id": 21167,
        "title": "Adaptive Image Anonymization in the Context of Image Classification with Neural Networks",
        "authors": "Nadiya Shvai, Arcadi Llanza Carmona, Amir Nakib",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00468"
    },
    {
        "id": 21168,
        "title": "Autonomous and Real-time Rock Image Classification using Convolutional Neural Networks",
        "authors": "Alexis David Pascual, Kenneth McIsaac, Gordon Osinski",
        "published": "No Date",
        "citations": 0,
        "abstract": "Autonomous image recognition has numerous potential applications in the field of planetary science and geology. For instance, having the ability to classify images of rocks would allow geologists to have immediate feedback without having to bring back samples to the laboratory. Also, planetary rovers could classify rocks in remote places and even in other planets without needing human intervention. Shu et al. classified 9 different types of rock images using a Support Vector Machine (SVM) with the image features extracted autonomously. Through this method, the authors achieved a test accuracy of 96.71%. In this research, Convolutional Neural Networks(CNN) have been used to classify the same set of rock images. Results show that a 3-layer network obtains an average accuracy of 99.60% across 10 trials on the test set. A version of Self-taught Learning was also implemented to prove the generalizability of the features extracted by the CNN. Finally, one model has been chosen to be deployed on a mobile device to demonstrate practicality and portability. The deployed model achieves a perfect classification accuracy on the test set, while taking only 0.068 seconds to make a prediction, equivalent to about 14 frames per second.",
        "link": "http://dx.doi.org/10.20944/preprints202109.0285.v1"
    },
    {
        "id": 21169,
        "title": "Domestic Solid Waste Classification Using Convolutional Neural Networks",
        "authors": "Surajsingh Dookhee",
        "published": "2022-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipas55744.2022.10052971"
    },
    {
        "id": 21170,
        "title": "Image Classification Using Convolutional Neural Networks",
        "authors": "Madhurima Tummala",
        "published": "2019-8-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29322/ijsrp.9.08.2019.p9261"
    }
]