[
    {
        "id": 901,
        "title": "Medicine Product Recommendation System using Apriori Algorithm and Fp-Growth Algorithm",
        "authors": "Sukenda -, Ari Purno Wahyu, Sunjana -",
        "published": "2020-2-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37200/ijpr/v24i2/pr200629"
    },
    {
        "id": 902,
        "title": "Apriori Algorithm and Hybrid Apriori Algorithm in the Data Mining: A Comprehensive Review",
        "authors": "Yahya Zakur, Laith Flaih",
        "published": "2023",
        "citations": 0,
        "abstract": "Data mining has the potential to empower healthcare organizations by allowing them to analyze various aspects of patient information and discover connections between seemingly unrelated data. By harnessing advanced data analysis techniques, healthcare providers can identify trends in patients' medical conditions and behaviours. The Apriori algorithm is used for mining frequent item sets and devising association rules from a transactional database. The parameters “support” and “confidence” are used. Support refers to items’ frequency of occurrence; confidence is a conditional probability, while Apriori-Hybrid. Apriori-Hybrid is the combination of algorithms Apriori and Apriori-TID, which can classify large itemsets and can improve the accuracy of classification and it can also shed light on the basic mechanism. In this research, a comparison was made between the two algorithms in terms of capabilities, strengths, areas of use, and suggestions about the nature of using each algorithm.",
        "link": "http://dx.doi.org/10.1051/e3sconf/202344802021"
    },
    {
        "id": 903,
        "title": "Apriori Algorithm for Frequent Pattern Mining for Public Librariesin United States",
        "authors": "Muhammad Muhajir, Ayundyah Kesumawati, Satibi Mulyadi",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008517200600064"
    },
    {
        "id": 904,
        "title": "Implementation of The Apriori Algorithm to Determine Purchase Patterns at Kolega Coffee",
        "authors": "Vianabila Banda, Ade Eviyanti",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.3825"
    },
    {
        "id": 905,
        "title": "Privacy-Preserving Outsourced Association Rule Mining using apriori algorithm.",
        "authors": "",
        "published": "2017-2-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21884/ijmter.2017.4038.ux0su"
    },
    {
        "id": 906,
        "title": "Hp-Apriori: Horizontal parallel-apriori algorithm for frequent itemset mining from big data",
        "authors": "Mohammad-Hossein Nadimi-Shahraki, Mehdi Mansouri",
        "published": "2017-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbda.2017.8078825"
    },
    {
        "id": 907,
        "title": "Apriori Algorithm",
        "authors": "Hannu Toivonen",
        "published": "2017",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_27"
    },
    {
        "id": 908,
        "title": "Apriori Algorithm Application for Consumer Purchase Patterns Analysis",
        "authors": "Boldson Herdianto Situmorang, Ali Isra, Dhatu Paragya, David Aulia Akbar Adhieputra",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "The Apriori algorithm is a data mining association rule algorithm for finding relationship patterns between one or more items in a dataset. Apriori algorithm is often used in transaction data analysis or market basket analysis. Apriori algorithm is used to find out consumer purchase patterns in e-commerce systems and provide product recommendations to consumer by extaracting associations or events from transactional data. This study is purposed for deeply analyze the steps, performance of Apriori algorithm, and give relevant an example of case study to better explain the steps of Apriori algorithm application, as well as the results achieved.",
        "link": "http://dx.doi.org/10.33751/komputasi.v21i1.9260"
    },
    {
        "id": 909,
        "title": "An improved Apriori algorithm for mining association rules",
        "authors": "Xiuli Yuan",
        "published": "2017",
        "citations": 47,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.4977361"
    },
    {
        "id": 910,
        "title": "TFI-Apriori: Using new encoding to optimize the apriori algorithm",
        "authors": "Ebrahim Ansari, M.H. Sadreddini, S.M.H. Mirsadeghi, Morteza Keshtkaran, Richard Wallace",
        "published": "2018-6-27",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/ida-173473"
    },
    {
        "id": 911,
        "title": "Data Mining Analysis of Retail Products Using the Association Method by Applying the Apriori Algorithm",
        "authors": "Mochammad Septa Sandy, Hamzah Setiawan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.735"
    },
    {
        "id": 912,
        "title": "Apriori Algorithm",
        "authors": "Hannu Toivonen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7502-7_10-1"
    },
    {
        "id": 913,
        "title": "Apriori Algorithm against Fp Growth Algorithm: A Comparative Study of Data Mining Algorithms",
        "authors": "Manoj Patil, Tejashri Patil",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4113695"
    },
    {
        "id": 914,
        "title": "APPLICATION OF THE APRIORI ALGORITHM IN ORGANIZING EFFECTIVE WAREHOUSE LAYOUT",
        "authors": "Burcu ÖZCAN, Aysu KARAMAN, Yıldız Edanur YILMAZ",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Büyük veri setlerindeki değerli ve sonucu tahmin edilmeyen bilginin keşfine veri madenciliği denmektedir. Veri madenciliğinin çeşitli ve geniş uygulama alanı bulunmaktadır. Gelişen teknoloji ve ürün çeşitliliğinde ki artış ile birlikte sürdürülebilirliğin sağlanması için firmaların en önemli ihtiyaçları arasına girmiş olan etkin depo yönetimi konusu veri madenciliği ile birlikte ele alınmıştır. Firmanın siparişleri incelenerek dinamik sipariş analizi sonucu sürdürülebilir etkin depo yerleşimi yapılması hedeflenmiştir. Çalışmada ilk olarak veri ve veri madenciliği modelleri incelenmiştir. Daha sonra depo yönetimi ve yerleşimi kavramları üzerinde incelemeler yapılmıştır. Bu incelemeler birlikte kullanılmaya başlanarak boya fabrikası deposuna gelen siparişler doğrultusunda ürünlerin birlikte kullanılma sıklıkları Apriori algoritması ile incelenmiştir. %3 destek, %70 güven düzeyi ideal kabul edilerek Ü7’nin Ü4 ve Ü5'e en yakın konuma yerleştirilmesiyle başlanarak etkin depo yerleşimi gerçekleştirilmiştir.",
        "link": "http://dx.doi.org/10.46238/jobda.930070"
    },
    {
        "id": 915,
        "title": "Determination of Breakfast Menu Patterns on the Fast Food Restaurant Using Apriori Algorithm",
        "authors": "Anggi Putri, Dzulfiqar Fauzan, Hana’ Nabilah, Ruli Utami, Suryo Atmojo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012109200003680"
    },
    {
        "id": 916,
        "title": "Analisis Data Mining Sistem Inventory Menggunakan Algoritma Apriori",
        "authors": " Fitriah,  Imam Riadi,  Herman",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "Dalam manajemen rantai persedian barang (supply chain management) diperlukan kebijakan persediaan barang yang maksimal agar ketersedian barang tetap tersedia dan tidak terlambat dalam restock barang. Hal ini dibutuhkan manajemen persedian barang untuk menentukan cara yang tepat dan mempermudah dalam pengendalian persedian barang tersebut. Salah satu cara yang dilakukan adalah dengan menerapkan teknik yang terdapat pada cabang ilmu Data Mining yaitu teknik aturan asosiasi (Association Rule). Tujuan penelitian ini adalah menganalisis informasi transaksi penjualan barang untuk menghasilkan association rules dari pola kombinasi itemsets yang sesuai agar membantu pemilik dalam melakukan peletakan dan persedian barang. Langkah terpenting aturan asosiasi adalah mengetahui seberapa sering kombinasi item yang disebut frequent pattern, muncul dalam database. Objek penelitian ini adalah data transaksi penjualan barang pakaian. Berdasarkan hasil pengujian menggunakan Ms. Excel dan RapidMiner diperoleh hasil dari association rules dengan minimum support 0,2% dan confidence sesuai dengan kriteria pengujian yang telah ditentukan bahwa hasil yang memenuhi nilai support minimum dan confidence 0,8% ditemukan 7 aturan asosiasi. Dari pengurutan nilai support tertinggi yaitu STX dan LK dengan nilai support 10% dengan nilai confidence 88% dan nilai Association rules Final 8,8%. Hal ini menunjukkan bahwa produk STX dan LK merupakan produk yang paling sering dibeli secara bersamaan.",
        "link": "http://dx.doi.org/10.51454/decode.v3i1.132"
    },
    {
        "id": 917,
        "title": "Submarine Pipelines Internal Corrosion Characterization Mining with Apriori Algorithm Based on Inspection and Monitoring Data",
        "authors": "Sijia Chen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4691112"
    },
    {
        "id": 918,
        "title": "Determining the Relationship between Anime Species Using Apriori Algorithm",
        "authors": "",
        "published": "2019-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7176/jstr/5-7-13"
    },
    {
        "id": 919,
        "title": "The improved Apriori algorithm based on matrix pruning and weight analysis",
        "authors": "Zhenhong Lang",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5033777"
    },
    {
        "id": 920,
        "title": "Implementasi Market Basket Analysis Menggunakan Algoritma Apriori pada Data Penjualan Buku",
        "authors": " Ahmad Thariq",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "Pada saat ini toko penjualan produk buku sangat banyaknya di berbagai daerah. Hal ini menjadi sebuah tantangan tersendiri bagi perusahaan Toko Bina Ilmu untuk bersaing di industri perdagangan itu sendiri. Oleh karena itu dibutuhkan adanya proses Data Mining dalam hal pengumpulan dan pengolahan data dengan menggunakan metode Association Rules Mining atau lebih dikenal dengan sebutan Market Basket Analysis untuk mengetahui hubungan antar barang pada satu dataset sebagai sebuah strategi dari perusahaan Toko Bina Ilmu. Sistem Informasi Penjualan produk buku yang ada di perusahaan Bina Ilmu belum benar-benar dapat dimanfaatkan untuk menentukan pengambilan keputusan yang tepat dalam sistem persediaan barang, sehingga sangat berpengaruh terhadap tingkat penjualan. Penelitian ini menggunakan Algoritma Apriori untuk mencari jenis produk buku yang paling banyak terjual diantara beberapa produk buku. Algortima Apriori digunakan untuk menentukan pola pembelian produk buku untuk persediaan produk buku berdasarkan kecendrungan pembeliaan produk buku oleh konsumen.Untuk pengembangan sistem dibangun dengan pendekatan Market Basket Analysis untuk menentukan produk mana yang akan dibeli oleh konsumen berdasarkan analisa terhadap daftar transaksi pelanggan. Hasil Implementasi Market Basket Analysis dengan Algoritma Apriori Jika membeli buku Novel, maka akan membeli buku Internet dengan support 50% dan confidence 75%. Jika membeli buku Internet, maka akan membeli buku Novel dengan support 50% dan confidence 80%. Dapat disimpulkan bahwa jenis produk buku yang paling banyak terjual adalah buku Novel dan buku Internet,  dengan diketahuinya produk yang paling banyak terjual tersebut,  sehingga perusahaan dapat menyusun strategi pemasaran untuk memasarkan produk dengan jenis lain dengan meneliti apa kelebihan produk yang paling banyak terjual tersebut dengan produk lainnya dan dapat menambah persedian buku Novel dan buku Internet",
        "link": "http://dx.doi.org/10.56338/jks.v6i3.3333"
    },
    {
        "id": 921,
        "title": "Association Rule Mining of Aircraft Incident Causes based on Apriori Algorithm",
        "authors": "Huaqun Chen, Minghui Yang, Xie Tang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nCombining accident causation 2–4 model with Apriori algorithm of data mining technology, an association rule of aircraft incident causation is proposed. The data cleaning model based on expert system is adopted on the python platform with the statistics of unsafe events in Civil Aviation of China in 2023. The accident cause 2–4 model divides the factors leading to aircraft unsafe incidents into internal and external factors of HMI organization. The top 30 TF-IDF words of each level are taken as the cause factors of the level, and strong association rules between aircraft unsafe events and cause factors are found through the iterative method of searching layer by layer with Apriori algorithm. Taking the 3-year unsafe incidents of Southwest Air Traffic Management Bureau in CAAC as an example, 90 cause-causing factor sets were identified, and unsupervised and supervised learning methods were respectively adopted. The support, confidence and improvement degrees of the two methods were compared using the complex network diagram of aircraft accident cause-causing generated by Gephi. The comparison results revealed that the analysis of association rules among factors is no longer limited to a single node, the index difference of association rules is increased, and the strong causality is more significant. It points out the direction of accident prevention and prediction.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3900171/v1"
    },
    {
        "id": 922,
        "title": "Intelligence Data Mining Based on Improved Apriori Algorithm",
        "authors": "Zhang Jie",
        "published": "2019",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17706/jcp.14.1.52-62"
    },
    {
        "id": 923,
        "title": "A Comparison of Apriori Algorithm and Apriorib with Hashing Algorithm",
        "authors": "Arjun Malik, Mihir Agarwal, Sonika Dahiya",
        "published": "2022-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciccs53718.2022.9788238"
    },
    {
        "id": 924,
        "title": "Carbon reduction assessment of public buildings based on Apriori algorithm and intelligent big data analysis",
        "authors": "Xu Shen",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nToday, with the continuous progress of urbanization, public buildings have many environmental problems. Their high carbon emissions and energy consumption have caused considerable environmental pollution. Based on the analysis of the whole life cycle of public buildings, it can be seen from the results that due to its long time span, the service life will cause more pollution to the environment, high energy consumption and carbon emissions. In this environment, this paper completes the design and construction of carbon reduction measurement system for public buildings by combining intelligent big data technology and Apriori algorithm. The system mainly analyzes the whole life cycle of the building to calculate all energy consumption projects of the building, converts them into carbon footprint indicators, and uses the indicators to complete the quantitative assessment of environmental pollution level for public buildings in the whole life cycle, and obtains the carbon reduction assessment data of the building in the operating cycle in combination with the carbon emission factors of energy and electricity. The results of quantitative data analysis can be used for the design and arrangement of energy conservation and emission reduction policies, which can be realized by changing the lighting and ventilation, peripheral protection, shape coefficient and rainwater circulation of buildings. This paper conducts carbon reduction assessment for public buildings by integrating intelligent big data and Apriori algorithm.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2712185/v1"
    },
    {
        "id": 925,
        "title": "Apriori Algorithm Optimization using Temporary Table",
        "authors": "Arif Dwi Laksito,  Kusrini",
        "published": "2019-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoiact46704.2019.8938475"
    },
    {
        "id": 926,
        "title": "Design of Education Management System Based on Apriori Algorithm",
        "authors": "Han Daoriao",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235011"
    },
    {
        "id": 927,
        "title": "Analysis of Association Rules Based on Improved Apriori Algorithm",
        "authors": "敏 汪",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/csa.2021.116176"
    },
    {
        "id": 928,
        "title": "MINING OF DRUGS REACTIONS IN PATIENTS WITH MALARIA USING APRIORI ALGORITHM",
        "authors": "IASET iaset",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3948561"
    },
    {
        "id": 929,
        "title": "Data mining of public building energy consumption based on Apriori algorithm",
        "authors": "Ling Cao, Jichang Zhang",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.4981633"
    },
    {
        "id": 930,
        "title": "Mining Frequent Itemsets Based on Improved Apriori Algorithm",
        "authors": "建鑫 兰",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/csa.2022.123063"
    },
    {
        "id": 931,
        "title": "Crime Analysis Based on Association Rules Using Apriori Algorithm",
        "authors": "Mehmet Sevri,  , Hacer Karacan, M. Ali Akcayol,  ",
        "published": "2017-5",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijiee.2017.7.3.669"
    },
    {
        "id": 932,
        "title": "Determination of Data Mining Application Design Patterns Booking Raw Food  In Restaurant Fountain With Apriori Algorithm",
        "authors": "Risnamawati Ndruru, Paska Marto Hasugian",
        "published": "2020-6-1",
        "citations": 3,
        "abstract": "Booking is an activity carried out by certain parties to ensure availability, in carrying out certain activities the company has a supply of material in quantities that exceed the needs. As a result, in the warehouse there is a buildup of raw materials or it can happen otherwise. Inventories of materials that are too small can hinder the company's operations in the form of unavailability of materials when needed. The role of inventory will determine the operation of the company because the inventory will run well if supported by good management. Therefore, the concept of inventory management that affects ordering is very important to be applied by companies so that the goals of effectiveness and efficiency are achieved. So we need a Data Mining that can quickly to determine the Determination of Food Raw Material Ordering Patterns in Restaurant Fountain Using Apriori. Data Mining is the extraction of new information taken from large chunks of data that helps in making decisions. One of the applications of data mining for Determining the Pattern of Ordering Food Raw Materials in Restaurant Fountain Using Apriori. Apriori method is a method for determining frequent itemsets for boolean association rules. The research aims to build the application of Determining the Pattern of Ordering Food Raw Materials in Restaurant Fountain with a web-based application and as a tool for designing applications using the Mysql Database. This data mining is able to determine the ordering of food items in the Restaurant Fountain with the required amount.\r\n ",
        "link": "http://dx.doi.org/10.47709/cnapc.v2i2.415"
    },
    {
        "id": 933,
        "title": "Implementation Of Data Mining On Suzuki Motorcycle Sales In Gemilang Motor Prosperous With Apriori Algorithm Method",
        "authors": "Anju Eliarsyam Lubis, Paska Marto Hasugian",
        "published": "2020-1-1",
        "citations": 0,
        "abstract": "The sale is part of the marketing that determine the survival of the company. With the sale, the company can achieve the goals or targets. To be a company that continues to grow in motorcycle sales, the company should be able to compete in increasing sales volume. Starting from the launch prodak the best in sophistication motorcycles, up to a very attractive price cuts the attention of consumers. Things like that already sanggat often do, so the company can still compete, Motorcycles is a two-wheeled transfortasi tool used more and more common people. From teenagers to old orag, not infrequently motorcycle including important sanggat needs. If we do not have it feels very hard in activity quickly. Make sales without any restriction of sales data accumulate, until finally overwhelmed the company in terms of taking care of customer files. To find the most sales required Apriori Algorithm. Apriori algorithm, including the type of association rules on Data Mining. One stage of association that can produce an efficient algorithm is with high frequency pattern analysis. In an association can be determined by two benchmarks, namely: Support and Confidence. Support \"penunang value\" is the percentage of combinations of items in a database, and Confidence \"value certainty\" is strong correlation between the items in an association's rules. Apriori algorithm, including the type of association rules on Data Mining. One stage of association that can produce an efficient algorithm is with high frequency pattern analysis. In an association can be determined by two benchmarks, namely: Support and Confidence. Support \"penunang value\" is the percentage of combinations of items in a database, and Confidence \"value certainty\" is strong correlation between the items in an association's rules. Apriori algorithm, including the type of association rules on Data Mining. One stage of association that can produce an efficient algorithm is with high frequency pattern analysis. In an association can be determined by two benchmarks, namely: Support and Confidence. Support \"penunang value\" is the percentage of combinations of items in a database, and Confidence \"value certainty\" is strong correlation between the items in an association's rules.",
        "link": "http://dx.doi.org/10.47709/cnapc.v2i1.353"
    },
    {
        "id": 934,
        "title": "Weighted Apriori Algorithm Based on Spark",
        "authors": "Tongqing Liu, Qin Lu",
        "published": "2022-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icedcs57360.2022.00100"
    },
    {
        "id": 935,
        "title": "Cultural Publicity Website Based on Apriori Improved Algorithm",
        "authors": "Peng Chen",
        "published": "2022-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ickecs56523.2022.10060284"
    },
    {
        "id": 936,
        "title": "Trading Strategies Model Using the Apriori Algorithm and the Neural Network Optimized by the Genetic Algorithm",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajcis.2022.050306"
    },
    {
        "id": 937,
        "title": "Data Mining Using Apriori And FP-Tree Algorithm",
        "authors": "",
        "published": "2022-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56343/stet.116.015.004.007"
    },
    {
        "id": 938,
        "title": "An Algorithm for Association Rules Mining using Apriori based on Genetic Algorithm",
        "authors": "",
        "published": "2017-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2017.3240"
    },
    {
        "id": 939,
        "title": "The Probability Apriori Multiple Minimum Support  Algorithm on the Grid Environment",
        "authors": "",
        "published": "2020-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.5/008"
    },
    {
        "id": 940,
        "title": "Apriori-based Spatial Pattern Mining Algorithm for Big Data",
        "authors": "Bao Lei",
        "published": "2020-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icuems50872.2020.00074"
    },
    {
        "id": 941,
        "title": "Inferring implications in semantic maps via the Apriori algorithm",
        "authors": "Ni Zeng, Hong Xiao",
        "published": "2020-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.lingua.2020.102808"
    },
    {
        "id": 942,
        "title": "Penentuan Posisi Mesin Game Menggunakan Metode Aras Dan Algoritma Apriori",
        "authors": "Fernandito Freddy Setlight Durand,  Kusrini,  Dhani Ariatmanto",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Abstract — There are various game rides that can be used by the public like playing a Redemption Tickets game, vending machines, Large Game, and then bumper cars, and there also children's games 4 - 10 years called Kiddie Land/Kiddie Zone. This research will determine the position of game in The Play Zone Balikpapan using transaction data in June 2022 using 2 methods, aras method, association rules using the apriori algorithm and combination of these 2 methods. With aras method, a ranking search will be carried out with normalization and data optimization in order to find out the top 10 top machines that will be positioned near the entrance. With apriori algorithm, an itemset combination will be choosed on the minimum support and confidence parameters, in order to combine a game machine that is often played if a customer plays 1 or more then the customer also plays other machines in close proximity. From the results of this study, it was obtained the increase in game machine revenue for The Play Zone Balikpapan is game ticket redemption at the level method of 66.98%, the a priori algorithm is 173.11%, and a combination of these 2 methods is 489.54%.\n \nKey words — Game Center, Algorithm Apriori, Data Mining, Aras Methods, Decision System Support\n \nAbstrak — Ada berbagai wahana permainan yang dapat dipakai oleh masyarakat, seperti memainkan game yang mengeluarkan tiket yaitu Tiket Redemption, vending machine, juga Large Game seperti shooting game, fighting game, dance game, ada juga bumper car , dan permainan anak-anak 4 - 10 tahun yaitu Kiddie Land/Kiddie Zone dan Kiddy Ride. Pada penelitian ini akan dilakukannya penentuan posisi permainan di The Play Zone Balikpapan menggunakan data transaksi mesin pada bulan Juni 2022 dengan menggunakan 2 metode yaitu metode aras, aturan asosisai menggunakan algoritma apriori dan gabungan 2 metode ini. Dengan metode aras posisi mesin game akan dilakukannya pencarian ranking dengan normalisasi dan optimasi data guna untuk mengetahui 10 mesin top teratas yang nantinya posisi mesin tersebut akan diletakkan di dekat pintu masuk. Dengan menggunakan algoritma apriori akan dilakukannya kombinasi itemset berdasarkan parameter minimum support dan confidence, guna untuk mengkombinasikan suatu mesin game yang sering dimainkan jika suatu pelanggan memainkan 1 atau lebih maka pelanggan juga memainkan mesin yang lain secara berdekatan (aturan asosiasi) Dari hasil penelitian ini, didapat peningkatan pendapatan mesin game untuk perusahaan The Play Zone Balikpapan adalah game tiket redemption pada metode aras 66,98 %, algoritma apriori 173,11 %, dan gabungan antara 2 metode ini 489,54 %.  \n \nKata kunci — Game Center, Algoritma Apriori, Data Mining, Metode Aras, Sistem Pendukung Keputusan, MCDM, Metode Asosiasi",
        "link": "http://dx.doi.org/10.35793/jtek.v12i2.48493"
    },
    {
        "id": 943,
        "title": "Rainfall Prediction using Apriori Algorithm",
        "authors": "",
        "published": "2019-8-10",
        "citations": 1,
        "abstract": "The growth of machine learning techniques has paved way for predicting various areas and weather prediction is one of the most commonly used application. One of the most interesting part of research is rainfall prediction Rainfall prediction is done by various researchers as it is one of the prime aspects in detecting the rainfall and measuring its intensity beforehand to reduce the number of loss of lives and properties. Nowadays, severe rainfall is one of the major reason is most of disasters such as floods and landslides. Predicting its occurrence well before could be very much helpful in further disaster management operations. In this paper, we have predicted rainfall by making use of various machine learning techniques and is been deployed by using it in predicting Chennai rainfall dataset. The research work makes use of Apriori Algorithm to demonstrate the feature set and to look out for the possibility of rainfall. Preprocessing of the dataset is done in order to extract the features of the dataset and then the Apriori Algorithm is used. The designed model is proposed to produce about 95% of accuracy, potency and lesser time when compared to other model",
        "link": "http://dx.doi.org/10.35940/ijrte.b1109.0782s319"
    },
    {
        "id": 944,
        "title": "Hoax Information Detection System Using Apriori Algorithm and Random Forest Algorithm in Twitter",
        "authors": "Mailia Putri Utami, Oky Dwi Nurhayati, Budi Warsito",
        "published": "2020-12-14",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icidm51048.2020.9339648"
    },
    {
        "id": 945,
        "title": "Using Apriori Algorithm to Determine Investigation Templates Specific to Intensive Care Units",
        "authors": "",
        "published": "2020-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7176/jstr/6-03-08"
    },
    {
        "id": 946,
        "title": "Market Basket Analysis using Apriori Algorithm in R Language",
        "authors": "Nidhi Makarand Kawale, Dr. Snehil Dahima,  ",
        "published": "2018-6-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31142/ijtsrd15677"
    },
    {
        "id": 947,
        "title": "Analysis of residential electricity consumption behavior based on the improved Apriori algorithm",
        "authors": "Bing Zhang",
        "published": "2017-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315158570-27"
    },
    {
        "id": 948,
        "title": "University Teaching Evaluation Based on APriori Algorithm and Data Mining",
        "authors": "Yang Yang",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276265"
    },
    {
        "id": 949,
        "title": "Human Resource Database Management Based on Apriori Algorithm",
        "authors": "Fuzhang Tian",
        "published": "2022-4-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipec54454.2022.9777457"
    },
    {
        "id": 950,
        "title": "Data Preprocessing and Apriori Algorithm Improvement in Medical Data Mining",
        "authors": "Feng Lv",
        "published": "2021-7-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icces51350.2021.9489242"
    },
    {
        "id": 951,
        "title": "Audit Data Analysis Based on Improved Apriori Algorithm",
        "authors": "Quan Wan, Weibo Li",
        "published": "2020-10-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/crc51253.2020.9253476"
    },
    {
        "id": 952,
        "title": "Online Music Performance Evaluation System Based on Apriori Algorithm",
        "authors": "Shenfu Zhang",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isaiee57420.2022.00142"
    },
    {
        "id": 953,
        "title": "Investing Decision Model Based on Apriori Algorithm",
        "authors": "Hanqi Chen",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "Quantitative investments can be effective in reducing losses. It plays an important role in the pre-diction of the market. Due to this, more and more investors are paying attention to it. Trade Strategy Model and other models are used to predict price and make the decision. In Data Mining (DM), quantile values, advance rate, and decline rate are utilized to determine relative likelihood. Furthermore, the Apriori algorithm is used to calculate the number of continuous rises and falls that occur with a probability greater than 90%. To determine the amount of dollars to be purchased or sold in the shipment space, we establish a Position-Management Model (PMM). Finally, we introduce the Decision-Making Model (DMM) as a tool for trading decisions. We then plug $1000 into the model to arrive at $1958.37 in 2021. Based on the comparison of the predicted price and the real price from 2019-9-1 to 2019-10-31, we found a slight deviation between the predicted and the real price. As part of our verification process, we used the BackTesting method and selected the indicator \"annual return rate,\" whose test showed an average of 17.687%, an excellent result. Afterward, we provide a summary of the strategy process for assisting its quantitative trading investment. To conclude, our models are distinguished by their precise values.",
        "link": "http://dx.doi.org/10.54097/ehss.v16i.9615"
    },
    {
        "id": 954,
        "title": "Etkin Bir Pazarlama Stratejisi Oluşturmak için Apriori Algoritması Temelinde Müşteri Satın Alma Davranışının Ölçülmesi",
        "authors": "Murat AKCIL, Serap AKCAN",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "Due to technological developments and competitive conditions, it is becoming more and more important to gain customers and keep them. Association rules are one of the methods used effectively to determine which products and services are more important and preferred by customers together. The aim of this study is to determine the types of patterns purchased by a company operating in the forest products sector, using the data of decor paper, which affects the cost the most, is used extensively in production and is difficult to plan. This study was carried out with the Apriori algorithm in WEKA, which is widely used in association analysis. It is thought that the association rules obtained from this study will enable the firm to determine the purchasing behaviors of its customers by revealing the overseas model trends and associations. In addition, this study will shed light on the company at the stage of determining the marketing strategy of the company.",
        "link": "http://dx.doi.org/10.21605/cukurovaumfd.1377741"
    },
    {
        "id": 955,
        "title": "Student Detection and People Counting System Based on Apriori Algorithm",
        "authors": "Ou Sha",
        "published": "2022-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icenit57306.2022.00037"
    },
    {
        "id": 956,
        "title": "Simulation of Financial Risk Prediction Model Based on Apriori Optimization Algorithm",
        "authors": "Muyi Yan",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00112"
    },
    {
        "id": 957,
        "title": "An Improved Apriori Algorithm Based on Matrix",
        "authors": "Liu Shuwen, Xiao Jiyi",
        "published": "2020-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmtma50254.2020.00111"
    },
    {
        "id": 958,
        "title": "Construction of Human Resource Allocation Model Based on Apriori Algorithm",
        "authors": "Jie Chen",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/netcit57419.2022.00070"
    },
    {
        "id": 959,
        "title": "Application of medical intelligence based on Apriori algorithm in the management of rehabilitation nursing personnel",
        "authors": "SHI Minmin, WANG Qiuyue, GUO Feng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nWith the increasing demand for medical services, the amount of data in the field of health care is gradually increasing in a stepwise manner every year. These medical data actually capture the medical information of patients and the entire diagnosis and treatment process of doctors, and can reflect the actual situation in the medical and health field. Currently, most hospital rehabilitation nurses use simple statistical methods to process medical data, and the use value of medical data resources is limited. To improve the value of using medical information, check the relationship between hidden laws and medical information. As one of the effective methods in the field of data mining, Apriori's basic principle is to use specific association rules to define all common element sets that support exceeding the minimum support threshold, and to create association rules that use a common model to achieve the validity threshold. This article uses Apriori algorithm to detect rehabilitation nursing personnel in hospitals, conduct data mining and exploration on medical data, design and construct a medical intelligence system, and then use Apriori algorithm to conduct research, propose a disease classification model and inpatient flow model, and conduct training and testing through the disease classification model. Finally, 300 hospital rehabilitation nursing personnel have received training in using a medical intelligence system to test the actual performance of the system, which has proven to enable rehabilitation nursing personnel to better understand patient information and provide personalized services.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2767138/v1"
    },
    {
        "id": 960,
        "title": "Appliance of Apriori Algorithm on Technical-Tactics Analysis of Volleyball",
        "authors": "Quan-Ying Li",
        "published": "2018-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icvris.2018.00047"
    },
    {
        "id": 961,
        "title": "Apriori Algorithm Based Component Classifications and Adaptation for Software Reuses",
        "authors": "Sampath Korra",
        "published": "2022-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17010/ijcs/2022/v7/i2/169683"
    },
    {
        "id": 962,
        "title": "Smart Bag Prototype with Apriori Algorithm",
        "authors": "Taufan Samudra Akbar, Maman Abdurohman, Aji Gautama Putrada",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isesd.2019.8909490"
    },
    {
        "id": 963,
        "title": "A Comparative Book Recommendation System using Apriori &amp;amp; FP Growth Algorithm Removing the Barriers of Time &amp;amp; Memory Constraint.",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe authors have requested that this preprint be removed from Research Square.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-245630/v2"
    },
    {
        "id": 964,
        "title": "Data Mining of Medical Record Front Page Based on Improved Apriori Algorithm",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.38007/proceedings.0001673"
    },
    {
        "id": 965,
        "title": "SURVEY ON APRIORI ALGORITHM FOR MARKET ANALYSIS",
        "authors": "",
        "published": "2017-2-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21090/ijaerd.27383"
    },
    {
        "id": 966,
        "title": "Analysis of Consumer Data on Black Friday Sales Using Apriori Algorithm",
        "authors": "Menuka Maharjan",
        "published": "2019-9-9",
        "citations": 5,
        "abstract": "Ability to recognize and track patterns in data help businesses shift through the layers of seemingly unrelated data for meaningful relationships. Through this analysis it becomes easy for the online retailers to determine the dimensions that influence the uptake of online shopping and plan effective marketing strategies. This paper builds a roadmap for analyzing consumer’s online buying behavior with the help of Apriori algorithm. The major factors that affect the consumer’s online buying behavior are convenience, ease of use and perceived benefits. Security is also a major consideration when opting to conduct shopping activities online. This study will helping further analyzing the consumer online buying behavior towards Online shopping which will help the retailers to design appropriate marketing strategies for selling their products online which will further help in development of the country.",
        "link": "http://dx.doi.org/10.3126/scitech.v14i1.25529"
    },
    {
        "id": 967,
        "title": "Application of Apriori Algorithm in Digital Financial Risk Information Management System",
        "authors": "Qisheng Guo",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245410"
    },
    {
        "id": 968,
        "title": "Generating maximum prime patterns using Benders decomposition and Apriori algorithm",
        "authors": "Hany Osman",
        "published": "2021-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46254/an11.20210762"
    },
    {
        "id": 969,
        "title": "Research on Technical and Tactical Action Mining of Basketball Based on Apriori Algorithm",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.38007/proceedings.0000882"
    },
    {
        "id": 970,
        "title": "Data Mining Apriori Algorithm for Heart Disease Prediction",
        "authors": "",
        "published": "2017-1-31",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15242/ijccie.dir1116010"
    },
    {
        "id": 971,
        "title": "A Combined Horizontal Parallel Apriori Algorithm and Adaptive Frequent Pattern Growth Algorithm for Big Data Mining",
        "authors": "",
        "published": "2019-12-30",
        "citations": 0,
        "abstract": "Due to the massive data size and complexness, big data mining using a sole computer is a problematic task. With the rapid increase in the database size, parallel and distributed computing systems can yield better benefits in the data mining applications. Parallelization of the Association Rule Mining (ARM) algorithms is a significant task in the data mining application for effectively mining the frequent itemsets from the large-size databases. These mining algorithms allocate the database in a horizontal manner or increase the number of processors to decrease the overall time necessary for mining the frequent itemsets. In this paper, a combined Horizontal Parallel-Apriori (HP-Apriori) and Adaptive Frequent Pattern (FP) Growth algorithm is proposed to divide the database both horizontally and vertically into four sub-processes, for parallel processing of all four tasks. The Horizontal Parallel-Apriori algorithm increases the speed of the mining process using an index file. Adaptive Binomial Distribution (ABD) is applied to the Frequent Pattern Growth Algorithm to find the minimum support for mining the optimal frequent itemsets. Experimental analysis established that the combined algorithm outperforms in terms of minimizing the overall execution time and increasing the computational speed in high scalability.",
        "link": "http://dx.doi.org/10.35940/ijitee.b1133.1292s219"
    },
    {
        "id": 972,
        "title": "Association analysis of Primary liver cancer based on Apriori Algorithm",
        "authors": "Yunxiang Liu, Qi Pan",
        "published": "2019-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciibms46890.2019.8991456"
    },
    {
        "id": 973,
        "title": "Assosiation Rules for Product Sales Data Analysis Using The Apriori Algorithm",
        "authors": "Jarseno Pamungkas, Yopi Handrianto",
        "published": "2020-10-7",
        "citations": 1,
        "abstract": "To increase sales transactions, the company must be able to compete with other competitors so that it requires an appropriate strategy in carrying out the sales process carried out. In addition to the marketing strategy, the company must be able to analyze the products sold based on the number of sales that have occurred so that the company can see which products are more dominant in consumer demand so that the company can determine a more effective sales strategy. PT. Surya Indah City is a company engaged in the sale of various clothing and accessories. In an effort to increase sales of its products, an analysis is needed to be able to increase company revenue by utilizing sales transaction data it has. To analyze the relationship between clothing products and accessories which are more predominantly sold and other available clothing and accessories products, a data mining algorithm is used, namely the a priori algorithm. With the help of the tanagra application to carry out the calculation process, the dominant product that consumers are interested in can be determined. By using two variables that meet support and minimum confidence, it can be concluded that the most sold products are from the type of clothing, namely clothes and pants. It was concluded that the results of the known final association rules, if you buy a shirt, you will buy pants with 50% support and 75% confidence. If you buy pants, you will buy clothes with 50% support and 85% confidence.",
        "link": "http://dx.doi.org/10.33395/sinkron.v5i1.10599"
    },
    {
        "id": 974,
        "title": "Application of Apriori Algorithm in the Development of Hotel Management Information",
        "authors": "Peifeng Zhu",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "The Apriori algorithm can effectively improve the efficiency and quality of the same time help accelerate the construction of smart hotels. Starting from understanding the application advantages of Apriori technology in the teaching of hotel management in higher vocational colleges, combining teaching cases to explore its specific application methods, and committed to giving It is hoped that the reports and related data generated by the evaluation system can be freely used by users, and users can operate and calculate the obtained data by themselves. higher vocational colleges. The thesis mainly discusses the information development and construction of the hotel management major courses in universities, taking the information development and construction of the marketing courses in this major as an example to carry out innovative applications of teaching reforms.",
        "link": "http://dx.doi.org/10.7753/ijsea1204.1007"
    },
    {
        "id": 975,
        "title": "Research and Application of Improved APRIORI Algorithm Based on Hash Technology",
        "authors": "Fulan Ye",
        "published": "2020-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipec49694.2020.9115141"
    },
    {
        "id": 976,
        "title": "Unsupervised Machine Learning: The Apriori Algorithm",
        "authors": "",
        "published": "2019-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119404729.ch26"
    },
    {
        "id": 977,
        "title": "An Extension of the Apriori Algorithm for Finding Frequent Items",
        "authors": "Noorollah Karimtabar, Mohammad Javad Shayegan Fard",
        "published": "2020-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwr49608.2020.9122282"
    },
    {
        "id": 978,
        "title": "Market Analysis System Based on Apriori Algorithm",
        "authors": "Shangqin Zhou",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3594409.3594428"
    },
    {
        "id": 979,
        "title": "An Apriori Algorithm to Improve Teaching Effectiveness",
        "authors": "Xu Shengsha",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23940/ijpe.20.05.p13.792799"
    },
    {
        "id": 980,
        "title": "Implement Mapreduce Apriori Algorithm to Generate Frequent Itemsets",
        "authors": "Jyoti Yadav, Neha Sehta",
        "published": "2018-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2018916785"
    },
    {
        "id": 981,
        "title": "An Improved Apriori Algorithm for Association Rule Mining in Employability Analysis",
        "authors": "",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17559/tv-20230327000481"
    },
    {
        "id": 982,
        "title": "Associative Rule Mining in Large Datasets using Neural Network Algorithm and enhanced Apriori - Based algorithm",
        "authors": "Febin Issac, Yeshwant More",
        "published": "2018-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22312803/ijctt-v59p106"
    },
    {
        "id": 983,
        "title": "Personalized Accurate Recommendation Algorithm for Distance Education Courses Based on Apriori Classification",
        "authors": "Shi Tang",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/phm-yantai55411.2022.9941969"
    },
    {
        "id": 984,
        "title": "Student Psychological Prediction and Analysis System based on Improved Apriori Algorithm",
        "authors": "Jing Huang",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isaiee57420.2022.00137"
    },
    {
        "id": 985,
        "title": "Determination Potential Experts by Application The Apriori Algorithm and the K-Means Algorithm",
        "authors": "Rini Sovia, Sarjon Defit, Noor Fatimah",
        "published": "2021-6-23",
        "citations": 0,
        "abstract": "Experts are people who have special expertise who provide services based on their expertise. The company has experts in handling projects that will be carried out for the progress of the company. The importance of the quality of experts in the company can improve the quality of human resources. The Apriori algorithm is a data mining method that has the aim of looking for association patterns based on the project being carried out so that they can be identified by experts who are often used in handling projects. Furthermore, a data mining approach is needed to classify experts with the K-means algorithm used. This study combines the Apriori and K-means algorithms, by grouping experts based on the handling of the project they are working on.",
        "link": "http://dx.doi.org/10.29099/ijair.v6i1.219"
    },
    {
        "id": 986,
        "title": "Efforts to Increase New Student Promotion at STIE-Graha Karya Muara Bulian Using the Apriori Algorithm Method",
        "authors": "Azwar Anas",
        "published": "2021-12-30",
        "citations": 0,
        "abstract": "The purpose of this study is to determine the STIE-GK Muara Bulian promotion strategy. The author uses a priori algorithm to analyze the data of new students of STIE-GK Muara Bulian in the academic year 2018/2019. A priori algorithm was chosen because of its ability to analyze data that appears simultaneously and repeatedly and data that has accumulated a long time, so it is necessary to use data mining, to gain knowledge. The data that I use is the data of new students STIE-GK Muara Bulian randomly as many as 100. The research method that I use is to manually calculate data then a trial of the Weka data mining software is conducted. The results of this study indicate, partially Vocational High School and TKJ majors are the most contributors to new students with a confidence level of 13%. The SMK and ADM majors are the second largest contributor to new students with a confidence level of 10%. The management study program comes from the TKJ major with a confidence level of 7%. The accounting study program comes from the TKJ major with a confidence level of 5%.",
        "link": "http://dx.doi.org/10.56667/jveit.v2i2.39"
    },
    {
        "id": 987,
        "title": "Article Recommendation Using Apriori Algorithm on Website",
        "authors": "",
        "published": "2019-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32897/infotronik.2019.4.1.3"
    },
    {
        "id": 988,
        "title": "Application of the Apriori Algorithm to Purchase Patterns",
        "authors": "Ferry Putrawansyah Fey",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "The purpose of this research is to produce an Apriori Algorithm application system to increase sales turnover at Viona stores. The problem faced by the Viona store is that the Viona store has decreased turnover in the midst of business competition because it has not been able to optimally analyze the products that are often purchased and the combination of purchases by consumers so that sales seem monotonous and do not have a business strategy to attract customers. sales that can attract consumers. One way is to make sales with sales packages at lower prices. It must have a good pattern and analysis to be able to combine products into a sales package. However, with the limited ability of Information Technology, in this study a sales application was built that applies the a priori algorithm. This a priori algorithm is very effective in finding the relationship pattern of one or more itemsets in a large data set so that it is effective in calculating a sales transaction data and finding patterns of combinations of consumer habits and being able to quickly create product sales packages. increase sales turnover. The results of the process of applying the a priori algorithm to sales data at the Viona Store through the RapidMiner application are the same as the results applied to the system built and using sales transaction data for the month of May 2022 using a minimum support of 30% and minimum confidence of 30%. So from this study, information was obtained that the items that were often purchased together during this May period were lighters and cigarettes with 100% Confidence. And for the month of June Viona Stores can recommend packages in their store by looking at the results of a combination of 3 items, which are later expected to increase sales turnover at Viona Stores.",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i2.3105"
    },
    {
        "id": 989,
        "title": "Student Grade Association Analysis with Apriori Algorithm",
        "authors": "Ilma Khoiruzzidan, Lizda Iswari",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "This study focuses on applying the Apriori algorithm to course grades of 150 students. The research aims to uncover correlations between course grades, providing insights for both the researcher and the institution. Data was directly extracted from the student academic database. The Apriori algorithm was implemented in three scenarios with varying minimum support and confidence thresholds. The final results depict patterns in course grades that tend to co-occur. Among the three scenarios, the combination of Game Development with an A grade, Informatics Fundamentals with an A grade, and Advanced Math with an A grade yielded the highest values, with a support of 26% and confidence of 88.6%.",
        "link": "http://dx.doi.org/10.20885/snati.v3.i2.31"
    },
    {
        "id": 990,
        "title": "Analysis and research on library user behavior based on apriori algorithm",
        "authors": "Xiaoying Zhang, Jian Zhang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100802"
    },
    {
        "id": 991,
        "title": "Web Log Mining Techniques to Optimize Apriori Association Rule Algorithm in Sports Data Information Management",
        "authors": "Tiantian Li, Fang Liu, Xiaobin Chen, Chao Ma",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper combines the Apriori association rule algorithm and Web application development technology to optimize and upgrade the management system to optimize the current college sports data information management system. On the one hand, the novel log mining technology in web application development technology is introduced. This technology has an excellent performance in improving system performance and understanding user behavior to discuss students’ access habits and content through processing sports data. On the other hand, combined with log mining technology to optimize the Apriori algorithm, the association between sports data information is found through the optimization algorithm. The retrieval accuracy and time are improved, which is convenient for the webmaster to grasp the details of the system. Finally, experiments are used to verify the reliability and effectiveness of the optimized system. The experimental results show that before the algorithm optimization, with the increase in the amount of information, the running time of the Apriori algorithm almost shows a multiplication trend. However, the optimized algorithm has improved its execution efficiency by at least 10–15%, which can verify that the optimized algorithm also exhibits good performance when the amount of information is enormous. Compared with traditional management systems, the optimized system has dramatically improved information retrieval time and accuracy, with an average retrieval accuracy of 98.3% and a retrieval time improvement of 23%. This is because adding the association algorithm improves the correlation between the information. It improves the retrieval accuracy of the system and shortens the retrieval time. Therefore, the technology and algorithm studied here have specific application value in the sports information management system and provide a methodological reference for the information management of other subjects.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3267807/v1"
    },
    {
        "id": 992,
        "title": "Misdiagnosis Features of Ancient Clinical Records Based on Apriori Algorithm",
        "authors": "Ling Yu",
        "published": "2020",
        "citations": 1,
        "abstract": "\nObjective:\nTo analyze misdiagnosis features in clinical cases of “Classified Medical Cases of Famous Physicians” and “Supplement to Classified Case Records of Celebrated Physicians.”\n\n\nMaterials and Methods:\nTwo hundred and five ancient misdiagnosed cases were analyzed in aspects of locations (exterior-interior type, qi-blood type and Zang-Fu organs type) and patterns (heat-cold type and deficiency-excess type) by Apriori Algorithm Method.\n\n\nResults:\nThe main types of misdiagnosis in those medical casesare as follows:: Zang-Fu location misjudgment, misjudging the interior as the exterior, misjudging deficiency pattern as excess pattern, and misjudging cold pattern as heat pattern. Among them, the most outstanding type is the misjudgment of deficiency–cold pattern as excess–heat pattern.\n\n\nConclusions:\n(1) Accurate judgment of location and differentiation of deficiency and excess patterns are the key points in diagnosing the diseases correctly. The confusion of true deficiency–cold and pseudo-excess–heat pattern should be taken seriously. (2) Data mining on ancient clinical cases offers a new methodology for assisting clinical diagnosis of traditional Chinese medicine.\n",
        "link": "http://dx.doi.org/10.4103/cmac.cmac_12_20"
    },
    {
        "id": 993,
        "title": "Air Quality Correlation Analysis Based on Apriori Algorithm",
        "authors": "Shaohui Yan, Shuai Kang",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "In recent years, air pollution has become an environmental issue of global concern. It not only affects human health, but also causes serious damage to the Earth's ecosystem. By analyzing the concentration values of various pollutants in the air and the air quality index (AQI) every hour, the most relevant components to the AQI can be identified. In this paper, Apriori association rule algorithm is applied to correlate various data in air quality monitoring to provide a new reference solution for solving environmental pollution problems in the future.",
        "link": "http://dx.doi.org/10.54097/srhzpz06"
    },
    {
        "id": 994,
        "title": "An Approach to Improve Apriori Algorithm for Extraction of Frequent Itemsets",
        "authors": "Mohammad Javad Shayegan, Parsa Asgari Namin",
        "published": "2021-5-19",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwr51868.2021.9443137"
    },
    {
        "id": 995,
        "title": "Web Mining Using Improved Apriori Algorithm",
        "authors": "C.K. Mohammed Malik",
        "published": "2022-9-26",
        "citations": 0,
        "abstract": "In this study, we will be concentrating on one of the more recent advancements in data mining, specifically mining online usage. The purpose of web use mining is to gain usable knowledge from the data that web servers keep about the actions of its visitors by mining the data that is stored on such servers. By using the association rule generation in the Web domain, the pages that are most frequently referenced together can be combined into a single server session. This is possible because of the interconnected nature of the Web. In association rule mining, a technique known as frequent set mining is one of the methods that may be used to discover regular patterns from a web log file. When it comes to mining the usage of the web, the term association rules refers to groups of web pages that are accessed together and have a support value that is higher than a given threshold. The support can be expressed as a proportion of total transactions that match a particular pattern. With the aid of the presence or absence of association rules, web designers are able to effectively reconstruct the websites they have created for their clients. In this research, we have introduced a method called Aprior for the purpose of extracting frequent patterns from online log files. The findings of the experiments that were carried out on data relating to peoples use of the website indicate that general sequential patterns or frequent item sets are more suitable for use in Web customization and recommender systems.",
        "link": "http://dx.doi.org/10.9756/iajir/v9i1/iajir0917"
    },
    {
        "id": 996,
        "title": "An Improvement of Apriori Mining Algorithm using Linked List Based Hash Table",
        "authors": "Zin Mar, Khine Khine Oo",
        "published": "2020-11-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icait51105.2020.9261804"
    },
    {
        "id": 997,
        "title": "Implementation of Apriori Algorithm Data Mining for Increase Sales",
        "authors": "Reza Alfianzah, Rani Irma Handayani, Murniyati Murniyati",
        "published": "2020-10-3",
        "citations": 1,
        "abstract": "Any company or organization that wants to survive needs to determine the right business strategy. The product sales data carried out by Lakoe Dessert Pondok Kacang will eventually result in a pile of data, so it is unfortunate if it is not re-analyzed. The products offered vary with a wide variety of products as many as 45 products, to find out the products with the most sales and the relationship between one product and another, one of the algorithms is needed in the data mining algorithm, namely the a priori algorithm to find out, and with the help of the Rapidminer 5 application, with a support value 2,4% and a confidence value 50%, products that customers often buy or are interested in can be found. This study used sales data for March 2020, which amounted to 209 transaction data. From the research, it was found that the item with the name Pudding Strawberry and Pudding Vanilla was the product most purchased by consumers. With knowledge of the most sold products and the patterns of purchasing goods by consumers, Lakoe Dessert Pondok Kacang can develop marketing strategies to market other products by analyzing the profits from selling the most sold products and anticipating running out or empty of stock or materials at a later date.",
        "link": "http://dx.doi.org/10.33395/sinkron.v5i1.10587"
    },
    {
        "id": 998,
        "title": "Improvement of Apriori Algorithm and its Application in College Students PE Online Teaching System Platform",
        "authors": "Yu Li",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235139"
    },
    {
        "id": 999,
        "title": "Research on Product Recommendation Based on Association Rules and Improved Apriori Algorithm",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajcis.2022.050315"
    },
    {
        "id": 1000,
        "title": "Item Layout for Building Materials Management with Apriori Algorithm",
        "authors": "Afrina Wati",
        "published": "2022-7-31",
        "citations": 0,
        "abstract": "The initial stage of opening a business is one of the business activities that can have an impact on the economy. TB. Jasa Manis is a trading business that sells various kinds of building materials, electrical equipment, materials and others. A sales strategy is needed to maintain business and marketing. Data Mining answers this problem by analyzing customer transaction data, then creating a certain rule, pattern or model. Products that are frequently purchased by customers will be used as a reference point in viewing consumer spending patterns. The association technique that can be used is an a priori algorithm designed to find item combinations. The a priori algorithm is guided by the min support and min confidence values. The combination pattern of sales transaction data itemset for two months on TB. Jasa Manis, it can be found that with a combination pattern the minimum support value is 14% and the minimum confidence is 40%. The rules for the highest association or goods that are often purchased together by customers are found in the Lotus Geese/LBR and Roof Nails. Through the analysis of customer shopping habits obtained, the layout of building materials can be adjusted to the customer's shopping pattern. With the data mining socialization rules, patterns of consumer shopping behavior can be identified and can increase sales at TB. Sweet Service",
        "link": "http://dx.doi.org/10.35134/jcsitech.v8i3.42"
    }
]