[
    {
        "id": 10971,
        "title": "A Sequence-to-Sequence Neural Network for Joint Aspect Term Extraction and Aspect Term Sentiment Classification Tasks",
        "authors": "Hasna Chouikhi, Fethi Jarray, Mohammed Alsuhaibani",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011620500003393"
    },
    {
        "id": 10972,
        "title": "Inter and Intra Patient ECG Heartbeat Classification For Arrhythmia Detection: A Sequence to Sequence Deep Learning Approach",
        "authors": "Sajad Mousavi",
        "published": "No Date",
        "citations": 4,
        "abstract": "Electrocardiogram (ECG) signal is a common and powerful tool to study heart function and diagnose several abnormal arrhythmias. While there have been remarkable improvements in cardiac arrhythmia classification methods, they still cannot offer acceptable performance in detecting different heart conditions, especially when dealing with imbalanced datasets. In this paper, wepropose a solution to address this limitation of current classification approaches by developing an automatic heartbeat classification method using deep convolutional neural networks and sequence to sequence models. We evaluated the proposed method on the MIT-BIH arrhythmia database, considering the intra-patient and inter-patient paradigms, and the AAMI EC57 standard. The evaluation results for both paradigms show that our method achieves the best performance in the literature (a positive predictive value of 96.46% and sensitivity of 100% for the category S, and a positive predictive value of 98.68% and sensitivity of 97.40% for the category F for the intra-patient scheme; a positive predictive value of 92.57% and sensitivity of 88.94% for the category S, and a positive predictive value of 99.50% and sensitivity of 99.94% for the category V for the inter-patient scheme.). The source code is available at https://github.com/SajadMo/ECG-Heartbeat-Classification-seq2seq-model.",
        "link": "http://dx.doi.org/10.31224/osf.io/uedzx"
    },
    {
        "id": 10973,
        "title": "Star Temporal Classification: Sequence Classification with Partially Labeled Data",
        "authors": "Vineel Pratap, Awni Hannun, Gabriel Synnaeve, Ronan Collobert",
        "published": "No Date",
        "citations": 1,
        "abstract": "We develop an algorithm which can learn from partially labeled and unsegmented sequential data. Most sequential loss functions, such as Connectionist Temporal Classification (CTC), break down when many labels are missing. We address this problem with Star Temporal Classification (STC) which uses a special \\textit{star} token to allow alignments which include all possible tokens whenever a token could be missing. We express STC as the composition of weighted finite-state transducers (WFSTs) and use GTN (a framework for automatic differentiation with WFSTs) to compute gradients. We perform extensive experiments on automatic speech recognition. These experiments show that STC can recover most of the performance of supervised baseline when up to 70\\% of the labels are missing. We also perform experiments in handwriting recognition to show that our method easily applies to other sequence classification tasks.",
        "link": "http://dx.doi.org/10.31219/osf.io/7m5ht"
    },
    {
        "id": 10974,
        "title": "PlasClass improves plasmid sequence classification",
        "authors": "David Pellow, Itzik Mizrahi, Ron Shamir",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractBackgroundMany bacteria contain plasmids, but separating between contigs that originate on the plasmid and those that are part of the bacterial genome can be difficult. This is especially true in metagenomic assembly, which yields many contigs of unknown origin. Existing tools for classifying sequences of plasmid origin give less reliable results for shorter sequences, are trained using a fraction of the known plasmids, and can be difficult to use in practice.ResultsWe present PlasClass, a new plasmid classifier. It uses a set of standard classifiers trained on the most current set of known plasmid sequences for different sequence lengths. PlasClass outperforms the state-of-the-art plasmid classification tool on shorter sequences, which constitute the majority of assembly contigs, while using less time and memory.ConclusionsPlasClass can be used to easily classify plasmid and bacterial genome sequences in metagenomic or isolate assemblies. It is available from: https://github.com/Shamir-Lab/PlasClass",
        "link": "http://dx.doi.org/10.1101/783571"
    },
    {
        "id": 10975,
        "title": "Peer Review #1 of \"Ribovirus classification by a polymerase barcode sequence (v0.1)\"",
        "authors": "",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.14055v0.1/reviews/1"
    },
    {
        "id": 10976,
        "title": "Peer Review #1 of \"Ribovirus classification by a polymerase barcode sequence (v0.2)\"",
        "authors": "",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.14055v0.2/reviews/1"
    },
    {
        "id": 10977,
        "title": "Motif-based Classification using Enhanced Sub-Sequence-Based Dynamic Time Warping",
        "authors": "Mohammed Alshehri, Frans Coenen, Keith Dures",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010519300002993"
    },
    {
        "id": 10978,
        "title": "Motif-based Classification using Enhanced Sub-Sequence-Based Dynamic Time Warping",
        "authors": "Mohammed Alshehri, Frans Coenen, Keith Dures",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010519301840191"
    },
    {
        "id": 10979,
        "title": "Bag-of-Words Algorithms Can Supplement Transformer Sequence Classification &amp; Improve Model Interpretability",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7249/wra1719-1"
    },
    {
        "id": 10980,
        "title": "Ribovirus classification by a polymerase barcode sequence",
        "authors": "Artem Babaian, Robert C. Edgar",
        "published": "No Date",
        "citations": 14,
        "abstract": "Abstract\nRNA viruses encoding a polymerase gene (riboviruses) dominate the known\n                    eukaryotic virome. Next-generation sequencing is revealing a wealth of new\n                    riboviruses with uncharacterised phenotypes, precluding classification by\n                    traditional taxonomic methods. These are often classified on the basis of\n                    polymerase sequence identity, but standardised methods to support this approach\n                    are currently lacking. To address this need, we describe the polymerase\n                    palmprint, a well-defined segment of the palm sub-domain delineated by\n                    well-conserved catalytic motifs. We present a novel algorithm,\n                        Palmscan, which identifies palmprints in\n                    nucleotide and amino acid sequences. We describe PALMdb, a reference database of\n                    palmprints derived from public sequence databases.\n                        Palmscan source code and PALMdb data are\n                    deposited at https://github.com/rcedgar/palmscan and https://github.com/rcedgar/palmdb, respectively.",
        "link": "http://dx.doi.org/10.1101/2021.03.02.433648"
    },
    {
        "id": 10981,
        "title": "CLASSIFICATION OF PROKARYOTIC DNA METHYLTRANSFERASES BY TOPOLOGY AND SEQUENCE SIMILARITY",
        "authors": "Maria Samokhina",
        "published": "No Date",
        "citations": 0,
        "abstract": "Prokaryotic DNA methyltrasferases (MTases) are essential enzymes within restrictionmodification systems, preventing self DNA cleavage by restriction enzymes. They also participate in the regulation of gene expression, DNA repair, DNA replication and other processes. We propose a sequence-based homology classification of prokaryotic MTases, addressing a deficiency that has existed for over 20 years in the previous classification of MTases by Malone, Bujnicki into groups α, β, γ, etc. We defined 11 MTases classes on catalytic domain 3D topology by analysis available 3D structures and certain predicted 3D structures of MTases from AlfaFold DB. For each class we have selected from domain family's databases HMM profiles, that predicts in the hits the topology class on the base of sequence similarity with catalytic and SAM-binding subdomains. Based on the set of non-predicted MTases from DB REBASE we developed the algorithm for MTase topology classification and location conservative catalytic and SAMbinding motifs. The algorithm was applied to all available MTases. Topology classes are further subdivided into subclasses with the same domains architectures according Pfam DB. Homology classification allows to recover the MTases evolution as well as MTase annotations in existing and new sequences data sets.",
        "link": "http://dx.doi.org/10.1101/2023.12.13.571470"
    },
    {
        "id": 10982,
        "title": "Functional Annotation of Proteins using Domain Embedding based Sequence Classification",
        "authors": "Bishnu Sarker, David Ritchie, Sabeur Aridhi",
        "published": "2019",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008353401630170"
    },
    {
        "id": 10983,
        "title": "BugSeq 16S: NanoCLUST with Improved Consensus Sequence Classification",
        "authors": "Ana Jung, Samuel D Chorlton",
        "published": "No Date",
        "citations": 4,
        "abstract": "AbstractNanoCLUST has enabled species-level taxonomic classification from noisy nanopore 16S sequencing data for BugSeq’s users and the broader nanopore sequencing community. We noticed a high misclassification rate of NanoCLUST-derived consensus 16S sequences due to its use of BLAST top hit taxonomy assignment. We replaced the consensus sequence classifier of NanoCLUST with QIIME2’s VSEARCH-based classifier to enable greater accuracy. We use mock microbial community and clinical 16S sequencing data to show that this replacement results in significantly improved nanopore 16S accuracy (over 5% recall and 19% precision), and make this new tool (BugSeq 16S) freely available for academic use atBugSeq.com/free.",
        "link": "http://dx.doi.org/10.1101/2021.03.16.434153"
    },
    {
        "id": 10984,
        "title": "Coronavirus Genome Sequence Similarity and Protein Sequence Classification",
        "authors": "Partha Mukherjee, Youakim Badr, Srushti Karvekar, Shanmugapriya Viswanathan",
        "published": "2021-12-28",
        "citations": 0,
        "abstract": "The world currently is going through a serious pandemic due to the coronavirus disease (COVID-19). In this study, we investigate the gene structure similarity of coronavirus genomes isolated from COVID-19 patients, Severe Acute Respiratory Syndrome (SARS) patients and bats genes. We also explore the extent of similarity between their genome structures to find if the new coronavirus is similar to either of the other genome structures. Our experimental results show that there is 82.42% similarity between the CoV-2 genome structure and the bat genome structure. Moreover, we have used a bidirectional Gated Recurrent Unit (GRU) model as the deep learning technique and an improved variant of Recurrent Neural networks (i.e., Bidirectional Long Short Term Memory model) to classify the protein families of these genomes to isolate the prominent protein family accession. The accuracy of Gated Recurrent Unit (GRU) is 98% for labeled protein sequences against the protein families. By comparing the performance of the Gated Recurrent Unit (GRU) model with the Bidirectional Long Short Term Memory (Bi-LSTM) model results, we found that the GRU model is 1.6% more accurate than the Bi-LSTM model for our multiclass protein classification problem. Our experimental results would be further support medical research purposes in targeting the protein family similarity to better understand the coronavirus genomic structure.",
        "link": "http://dx.doi.org/10.33847/2686-8296.3.2_1"
    },
    {
        "id": 10985,
        "title": "Peer Review #2 of \"Ribovirus classification by a polymerase barcode sequence (v0.2)\"",
        "authors": "G Dominguez Huerta",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.14055v0.2/reviews/2"
    },
    {
        "id": 10986,
        "title": "Peer Review #2 of \"Ribovirus classification by a polymerase barcode sequence (v0.1)\"",
        "authors": "G Dominguez Huerta",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.14055v0.1/reviews/2"
    },
    {
        "id": 10987,
        "title": "Driver Attention Estimation Based on Temporal Sequence Classification of Distracting Contexts",
        "authors": "Raluca Brehar, George Coblişan, Attila Füzes, Radu Dănescu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012160200003543"
    },
    {
        "id": 10988,
        "title": "Neural Audio Captioning Based on Conditional Sequence-to-Sequence\n                        Model",
        "authors": "Shota Ikawa, Kunio Kashino",
        "published": "2019",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33682/7bay-bj41"
    },
    {
        "id": 10989,
        "title": "Rapid and accurate taxonomic classification of cpn60 amplicon sequence variants",
        "authors": "Qingyi Ren, Janet E. Hill",
        "published": "No Date",
        "citations": 1,
        "abstract": "ABSTRACTThe “universal target” region of the gene encoding the 60 kDa chaperonin protein (cpn60, also known as groEL or hsp60) is a proven sequence barcode for bacteria and a useful target for marker gene amplicon-based studies of complex microbial communities. To date, identification of cpn60 sequence variants from microbiome studies has been accomplished by alignment of queries to a reference database. Naïve Bayesian classifiers including the RDP classifier offer an alternative identification method that provides variable rank classification and shorter analysis times. We curated a set of cpn60 barcode sequences to train the RDP classifier and tested its performance on data from previous human microbiome studies. Results showed that sequences accounting for 79%, 86% and 92% of the observations (read counts) in saliva, vagina and infant stool microbiome data sets were classified to the species rank. We also established a threshold confidence value of 0.6 at phylum rank for filtering non-target amplicon sequences from study data and demonstrated that trimming the training sequences to match the lengths of the queries is not needed for accurate cpn60 sequence classification. Successful implementation of a naïve Bayesian classifier for cpn60 sequences will facilitate future microbiome studies and open opportunities to integrate cpn60 amplicon sequence identification into existing analysis pipelines.",
        "link": "http://dx.doi.org/10.1101/2023.01.29.526108"
    },
    {
        "id": 10990,
        "title": "Classification of prokaryotic DNA methyltransferases by sequence similarity of the catalytic domain",
        "authors": "",
        "published": "2022-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18699/sbb-2022-100"
    },
    {
        "id": 10991,
        "title": "Hierarchical Sequence-to-Sequence Model for Multi-Label Text Classification",
        "authors": "Zhenyu Yang, Guojing Liu",
        "published": "2019",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2019.2948855"
    },
    {
        "id": 10992,
        "title": "Data Independent Sequence Augmentation Method for Acoustic Scene Classification",
        "authors": "Zhang Teng, Kailai Zhang, Ji Wu",
        "published": "2018-9-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2018-1250"
    },
    {
        "id": 10993,
        "title": "Hist2Vec: Kernel-Based Embeddings for Biological Sequence Classification",
        "authors": "Sarwan Ali, Haris Mansoor, Prakash Chourasia, Murray Patterson",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractBiological sequence classification is vital in various fields, such as genomics and bioinformatics. The advancement and reduced cost of genomic sequencing have brought the attention of researchers for protein and nucleotide sequence classification. Traditional approaches face limitations in capturing the intricate relationships and hierarchical structures inherent in genomic sequences, while numerous machine-learning models have been proposed to tackle this challenge. In this work, we propose Hist2Vec, a novel kernel-based embedding generation approach for capturing sequence similarities. Hist2Vec combines the concept of histogram-based kernel matrices and Gaussian kernel functions. It constructs histogram-based representations using the uniquek-mers present in the sequences. By leveraging the power of Gaussian kernels, Hist2Vec transforms these representations into high-dimensional feature spaces, preserving important sequence information. Hist2Vec aims to address the limitations of existing methods by capturing sequence similarities in a high-dimensional feature space while providing a robust and efficient framework for classification. We employ kernel Principal Component Analysis (PCA) using standard machine-learning algorithms to generate embedding for efficient classification. Experimental evaluations on protein and nucleotide datasets demonstrate the efficacy of Hist2Vec in achieving high classification accuracy compared to state-of-the-art methods. It outperforms state-of-the-art methods by achieving > 76% and > 83% accuracies for DNA and Protein datasets, respectively. Hist2Vec provides a robust framework for biological sequence classification, enabling better classification and promising avenues for further analysis of biological data.",
        "link": "http://dx.doi.org/10.1101/2023.08.24.554699"
    },
    {
        "id": 10994,
        "title": "An Overview of the Application of Deep Learning in Short Read Sequence Classification",
        "authors": "Kristaps Bebris, Inese Polaka",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractAdvances in sequencing technology have led to an ever increasing amount of available short read sequencing data. This has, consequently, exacerbated the need for efficient and precise classification tools that can be used in the analysis of this data. As it stands, recent years have shown that massive leaps in performance can be achieved when it comes to approaches that are based in heuristics, and alongside these improvements there has been an ever increasing interest in applying deep learning techniques to revolutionize this classification task. We attempt to gather up these approaches and to evaluate their performance in a reproducible fashion to get a better perspective on the current state of deep learning based methods when it comes to the classification of short read sequencing data.",
        "link": "http://dx.doi.org/10.1101/2020.09.19.304782"
    },
    {
        "id": 10995,
        "title": "Centrifuger: lossless compression of microbial genomes for efficient and accurate metagenomic sequence classification",
        "authors": "Li Song, Ben Langmead",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractCentrifuger is an efficient taxonomic classification method that compares sequencing reads against a microbial genome database. In Centrifuger, the Burrows-Wheeler transformed genome sequences are losslessly compressed using a novel scheme called run-block compression. Run-block compression achieves sublinear space complexity and is effective at compressing diverse microbial databases like RefSeq while supporting fast rank queries. Combining this compression method with other strategies for compacting the Ferragina-Manzini (FM) index, Centrifuger reduces the memory footprint by half compared to other FM-index-based approaches. Furthermore, the lossless compression and the unconstrained match length help Centrifuger achieve greater accuracy than competing methods at lower taxonomic levels.",
        "link": "http://dx.doi.org/10.1101/2023.11.15.567129"
    },
    {
        "id": 10996,
        "title": "UDSMProt: Universal Deep Sequence Models for Protein Classification",
        "authors": "Nils Strodthoff, Patrick Wagner, Markus Wenzel, Wojciech Samek",
        "published": "No Date",
        "citations": 5,
        "abstract": "AbstractMotivationInferring the properties of a protein from its amino acid sequence is one of the key problems in bioinformatics. Most state-of-the-art approaches for protein classification tasks are tailored to single classification tasks and rely on handcrafted features such as position-specific-scoring matrices from expensive database searches. We argue that this level of performance can be reached or even be surpassed by learning a task-agnostic representation once, using self-supervised language modeling, and transferring it to specific tasks by a simple finetuning step.ResultsWe put forward a universal deep sequence model that is pretrained on unlabeled protein sequences from Swiss-Prot and finetuned on protein classification tasks. We apply it to three prototypical tasks, namely enzyme class prediction, gene ontology prediction and remote homology and fold detection. The proposed method performs on par with state-of-the-art algorithms that were tailored to these specific tasks or, for two out of three tasks, even outperforms them. These results stress the possibility of inferring protein properties from the sequence alone and, on more general grounds, the prospects of modern natural language processing methods in omics.AvailabilitySource code is available under https://github.com/nstrodt/UDSMProt.Contactfirstname.lastname@hhi.fraunhofer.de",
        "link": "http://dx.doi.org/10.1101/704874"
    },
    {
        "id": 10997,
        "title": "Motif selection enables efficient sequence-based classification of non-coding RNA",
        "authors": "Ibrahim Chegrane, Nabil Benjaa, Aida Ouangraoua",
        "published": "No Date",
        "citations": 0,
        "abstract": "Motivation: Non-coding RNAs (ncRNAs) classification is important for genome annotation and to perform functional analyses of these biological molecules. Efficient methods for large-scale RNA classification remain challenging. Existing methods often rely on structure similarity, and they require huge computing times because they use secondary structure information, which impedes any large scale use. Results: We present a sequence-based method that relies on the computation and the selection of common sequence motifs to provide a set of features for effectively classifying ncRNAs families by a supervised learning approach. The results show that our method achieves an equal or higher accuracy than existing structure-based methods and drastically reduces required computing times. Results also demonstrate that, thanks to an appropriate selection of local sequence motifs, an efficient sequencebased ncRNA classification can be achieved through supervised learning.",
        "link": "http://dx.doi.org/10.1101/2023.09.19.558381"
    },
    {
        "id": 10998,
        "title": "SeSaMe: Metagenome Sequence Classification of Arbuscular Mycorrhizal Fungi Associated Microorganisms",
        "authors": "Jee Eun Kang, Antonio Ciampi, Mohamed Hijri",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractArbuscular mycorrhizal fungi (AMF) are plant root symbionts that play key roles in plant growth and soil fertility. They are obligate biotrophic fungi that form coenocytic multinucleated hyphae and spores. Numerous studies have shown that diverse microorganisms live on the surface and inside their mycelia, resulting in a metagenome when whole genome sequencing (WGS) data are obtained from sequencing AMF cultivatedin vivo.The metagenome contains not only the AMF sequences, but also those from associated microorganisms. In this article, we introduce a novel bioinformatics program, SeSaMe, designed for taxonomic classification of short sequences obtained by next-generation DNA sequencing. A genus-specific usage bias database was created based on amino acid usage and codon usage of three consecutive codon DNA 9-mers encoding for an amino acid trimer in a protein secondary structure. The program distinguishes between coding sequence (CDS) and non-CDS, and classifies a query sequence into a genus group out of 54 genera used as reference. The average correct prediction percentages of the CDS and the non-CDS test sets at the genus level were 71% and 50% for bacteria, 65% and 73% for fungi (excluding AMF), and 49% and 72% for AMF (Rhizophagus irregularis), respectively. The program provides a means for estimating not only taxonomic diversity and abundance but also the gene reservoir of the reference taxonomic groups associated with AMF. Therefore, the program enables users to study the symbiotic roles of associated microorganisms. SeSaMe can be applicable to other microorganisms as well as soil metagenomes. It is freely available atwww.journal.comandwww.fungalsesame.org.",
        "link": "http://dx.doi.org/10.1101/2020.05.20.106559"
    },
    {
        "id": 10999,
        "title": "Profile hidden Markov model for malware classification — usage of system call sequence for malware classification",
        "authors": "Ramandika Pranamulia, Yudistira Asnar, Riza Satria Perdana",
        "published": "2017-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icodse.2017.8285885"
    },
    {
        "id": 11000,
        "title": "Learning Actively for Sequence Classification",
        "authors": "Maoto Inoue, Takao Miura",
        "published": "2017-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/taai.2017.36"
    },
    {
        "id": 11001,
        "title": "Efficient Sequence Embedding For SARS-CoV-2 Variants Classification",
        "authors": "Sarwan Ali, Usama Sardar, Imdad Ullah Khan, Murray Patterson",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractKernel-based methods, such as Support Vector Machines (SVM), have demonstrated their utility in various machine learning (ML) tasks, including sequence classification. However, these methods face two primary challenges:(i) the computational complexity associated with kernel computation, which involves an exponential time requirement for dot product calculation, and (ii) the scalability issue of storing the largen × nmatrix in memory when the number of data points(n) becomes too large. Although approximate methods can address the computational complexity problem, scalability remains a concern for conventional kernel methods. This paper presents a novel and efficient embedding method that overcomes both the computational and scalability challenges inherent in kernel methods. To address the computational challenge, our approach involves extracting thek-mers/nGrams (consecutive character substrings) from a given biological sequence, computing a sketch of the sequence, and performing dot product calculations using the sketch. By avoiding the need to compute the entire spectrum (frequency count) and operating with low-dimensional vectors (sketches) for sequences instead of the memory-intensiven × nmatrix or full-length spectrum, our method can be readily scaled to handle a large number of sequences, effectively resolving the scalability problem. Furthermore, conventional kernel methods often rely on limited algorithms (e.g., kernel SVM) for underlying ML tasks. In contrast, our proposed fast and alignment-free spectrum method can serve as input for various distance-based (e.g.,k-nearest neighbors) and non-distance-based (e.g., decision tree) ML methods used in classification and clustering tasks. We achieve superior prediction for coronavirus spike/Peplomer using our method on real biological sequences excluding full genomes. Moreover, our proposed method outperforms several state-of-the-art embedding and kernel methods in terms of both predictive performance and computational runtime.",
        "link": "http://dx.doi.org/10.1101/2023.08.24.554650"
    },
    {
        "id": 11002,
        "title": "CFSP: a collaborative frequent sequence pattern discovery algorithm for nucleic acid sequence classification",
        "authors": "He Peng",
        "published": "2020-4-20",
        "citations": 2,
        "abstract": "\nBackground\nConserved nucleic acid sequences play an essential role in transcriptional regulation. The motifs/templates derived from nucleic acid sequence datasets are usually used as biomarkers to predict biochemical properties such as protein binding sites or to identify specific non-coding RNAs. In many cases, template-based nucleic acid sequence classification performs better than some feature extraction methods, such as N-gram and k-spaced pairs classification. The availability of large-scale experimental data provides an unprecedented opportunity to improve motif extraction methods. The process for pattern extraction from large-scale data is crucial for the creation of predictive models.\n\n\nMethods\nIn this article, a Teiresias-like feature extraction algorithm to discover frequent sub-sequences (CFSP) is proposed. Although gaps are allowed in some motif discovery algorithms, the distance and number of gaps are limited. The proposed algorithm can find frequent sequence pairs with a larger gap. The combinations of frequent sub-sequences in given protracted sequences capture the long-distance correlation, which implies a specific molecular biological property. Hence, the proposed algorithm intends to discover the combinations. A set of frequent sub-sequences derived from nucleic acid sequences with order is used as a base frequent sub-sequence array. The mutation information is attached to each sub-sequence array to implement fuzzy matching. Thus, a mutate records a single nucleotide variant or nucleotides insertion/deletion (indel) to encode a slight difference between frequent sequences and a matched subsequence of a sequence under investigation.\n\n\nConclusions\nThe proposed algorithm has been validated with several nucleic acid sequence prediction case studies. These data demonstrate better results than the recently available feature descriptors based methods based on experimental data sets such as miRNA, piRNA, and Sigma 54 promoters. CFSP is implemented in C++ and shell script; the source code and related data are available at https://github.com/HePeng2016/CFSP.\n",
        "link": "http://dx.doi.org/10.7717/peerj.8965"
    },
    {
        "id": 11003,
        "title": "Recurrent neural networks: generating new molecules and proteins sequence classification",
        "authors": "Habib Izadkhah",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-823822-6.00019-6"
    },
    {
        "id": 11004,
        "title": "NL4IA at SemEval-2023 Task 3: A Comparison of Sequence Classification and Token Classification to Detect Persuasive Techniques",
        "authors": "Albert Pritzkau",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.110"
    },
    {
        "id": 11005,
        "title": "Self Co-articulation Removal in Mid-air Gesticulated Trajectories via a Sequence-to-Sequence Based Classification Approach using LSTM",
        "authors": "Monsley K. Anish, Kuldeep Singh Yadav, Rabul Hussain Laskar",
        "published": "2022-2-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/delcon54057.2022.9753318"
    },
    {
        "id": 11006,
        "title": "Joint Sequence Complexity: Introduction and Theory",
        "authors": "Dimitrios Milioris",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-66414-9_3"
    },
    {
        "id": 11007,
        "title": "Inter- and Intra- Patient ECG Heartbeat Classification for Arrhythmia Detection: A Sequence to Sequence Deep Learning Approach",
        "authors": "Sajad Mousavi, Fatemeh Afghah",
        "published": "2019-5",
        "citations": 78,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp.2019.8683140"
    },
    {
        "id": 11008,
        "title": "Feature Sequence Representation Via Slow Feature Analysis For Action Classification",
        "authors": "Takumi Kobayashi",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5244/c.31.125"
    },
    {
        "id": 11009,
        "title": "Detecting Misannotated Long Non-coding RNAs with Training Dynamics of Deep Sequence Classification",
        "authors": "Afshan Nabi, Ogun Adebali, Oznur Tastan",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractLong non-coding RNAs (lncRNAs) are the largest class of non-coding RNAs (ncRNAs). However, recent experimental evidence has shown that some lncRNAs contain small open reading frames (sORFs) that are translated into functional micropeptides. Current methods to detect misannotated lncRNAs rely on ribosome-profiling (ribo-seq) experiments, which are expensive and cell-type dependent. In addition, while very accurate machine learning models have been trained to distinguish between coding and non-coding sequences, little attention has been paid to the increasing evidence about the incorrect ground-truth labels of some lncRNAs in the underlying training datasets. We present a framework that leverages deep learning models’ training dynamics to determine whether a given lncRNA transcript is misannotated. Our models achieve AUC scores > 91% and AUPR > 93% in classifying non-coding vs. coding sequences while allowing us to identify possible misannotated lncRNAs present in the dataset. Our results overlap significantly with a set of experimentally validated misannotated lncRNAs as well as with coding sORFs within lncRNAs found by a ribo-seq dataset. The general framework applied here offers promising potential for use in curating datasets used for training coding potential predictors and assisting experimental efforts in characterizing the hidden proteome encoded by misannotated lncRNAs. Source code is available athttps://github.com/nabiafshan/DetectingMisannotatedLncRNAs.",
        "link": "http://dx.doi.org/10.1101/2020.11.07.372771"
    },
    {
        "id": 11010,
        "title": "pysster: Classification of Biological Sequences by Learning Sequence and Structure Motifs with Convolutional Neural Networks",
        "authors": "Stefan Budach, Annalisa Marsico",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractSummaryConvolutional neural networks (CNNs) have been shown to perform exceptionally well in a variety of tasks, including biological sequence classification. Available implementations, however, are usually optimized for a particular task and difficult to reuse. To enable researchers to utilize these networks more easily we implemented pysster, a Python package for training CNNs on biological sequence data. Sequences are classified by learning sequence and structure motifs and the package offers an automated hyper-parameter optimization procedure and options to visualize learned motifs along with information about their positional and class enrichment. The package runs seamlessly on CPU and GPU and provides a simple interface to train and evaluate a network with a handful lines of code. Using an RNA A-to-I editing data set and CLIP-seq binding site sequences we demonstrate that pysster classifies sequences with higher accuracy than other methods and is able to recover known sequence and structure motifs.Availabilitypysster is freely available at https://github.com/budach/pysster.Contactbudach@molgen.mpg.de, marsico@molgen.mpg.de",
        "link": "http://dx.doi.org/10.1101/230086"
    },
    {
        "id": 11011,
        "title": "SpeciesMLP: Sequence based Multi-layer Perceptron for Amplicon Read Classification Using Real-time Data Augmentation",
        "authors": "Ali Kishk, Mohamed El-Hadidi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Taxonomic assignment is the core of targeted metagenomics approaches that aims to assign sequencing reads to their corresponding taxonomy. Sequence similarity searching and machine learning (ML) are two commonly used approaches for taxonomic assignment based on the 16S rRNA. Similarity based approaches require high computation resources, while ML approaches do not need these resources in prediction. The majority of these ML approaches depend on k-mer frequency rather than direct sequence, which leads to low accuracy on short reads as k-mer frequency does not consider k-mer position. Moreover training ML taxonomic classifiers depend on a specific read length which may reduce the prediction performance by decreasing read length. In this study, we built a neural network classifier for 16S rRNA reads based on SILVA database (version 132). Modeling was performed on direct sequences using Convolutional neural network (CNN) and other neural network architectures such as Multi-layer Perceptron and Recurrent Neural Network. In order to reduce modeling time of the direct sequences, In-silico PCR was applied on SILVA database. Total number of 14 subset databases were generated by universal primers for each single or paired high variable region (HVR). Moreover, in this study, we illustrate the results for the V2 database model on 8443 classes on the species level and 1552 on the genus level. In order to simulate sequencing fragmentation, we trained variable length subsequences from 50 bases till the full length of the HVR that are randomly changing in each training iteration. Simple MLP model with global max pooling gives 0.71 & 0.93 test accuracy for the species and genus levels respectively (for reads of 100 base sub-sequences) and 0.75 & 0.96 accuracy for the species and genus levels respectively (on the full length V2 HVR). In this study, we present a novel method (SpeciesMLP https://github.com/ali-kishk/SpeciesMLP) to model the direct amplicon sequence using MLP over a sequence of k-mers faster 20 times than CNN in training and 10 times in prediction.",
        "link": "http://dx.doi.org/10.1101/419846"
    },
    {
        "id": 11012,
        "title": "Behavioral Sequence Classification with Constraints",
        "authors": "Jiayang Wu, Wensheng Gan, Zhenlian Qi",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdis55630.2022.00060"
    },
    {
        "id": 11013,
        "title": "Sequence Classification with\n                  Machine Learning at the Example of Viral Host Prediction",
        "authors": "Florian Mock, Manja Marz",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003097679-10"
    },
    {
        "id": 11014,
        "title": "Sequence Classification of the Limit Order Book Using Recurrent Neural Networks",
        "authors": "Matthew Francis Dixon",
        "published": "No Date",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3002814"
    },
    {
        "id": 11015,
        "title": "A Fusion of Deep Convolutional Generative Adversarial Networks and Sequence to Sequence Autoencoders for Acoustic Scene Classification",
        "authors": "Shahin Arniriparian, Michael Freitag, Nicholas Cummins, Maurice Gerczuk, Sergey Pugachevskiy, Bjorn Schuller",
        "published": "2018-9",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco.2018.8553225"
    },
    {
        "id": 11016,
        "title": "Genomic Benchmarks: A Collection of Datasets for Genomic Sequence Classification",
        "authors": "Katarina Gresova, Vlastimil Martinek, David Cechak, Petr Simecek, Panagiotis Alexiou",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this paper, we propose a collection of curated and easily accessible sequence classification datasets in the field of genomics. The proposed collection is based on a combination of novel datasets constructed from the mining of publicly available databases and existing datasets obtained from published articles. The main aim of this effort is to create a repository for shared datasets that will make machine learning for genomics more comparable and reproducible while reducing the over-head of researchers that want to enter the field. The collection currently contains eight datasets that focus on regulatory elements (promoters, enhancers, open chromatin region) from three model organisms: human, mouse, and roundworm. A simple convolution neural network is also included in a repository and can be used as a baseline model. Benchmarks and the baseline model are distributed as the Python package ‘genomic-benchmarks’, and the code is available at https://github.com/ML-Bioinfo-CEITEC/genomic_benchmarks.",
        "link": "http://dx.doi.org/10.1101/2022.06.08.495248"
    },
    {
        "id": 11017,
        "title": "Inter-patient ECG heartbeat classification for arrhythmia classification: a new approach of multi-layer perceptron with weight capsule and sequence-to-sequence combination",
        "authors": "Chenchen Zhou, Xiangkui Li, Fan Feng, Jian Zhang, He Lyu, Weixuan Wu, Xuezhi Tang, Bin Luo, Dong Li, Wei Xiang, Dengju Yao",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "Objective: The objective of this research is to construct a method to alleviate the problem of sample imbalance in classification, especially for arrhythmia classification. This approach can improve the performance of the model without using data enhancement.Methods: In this study, we have developed a new Multi-layer Perceptron (MLP) block and have used a Weight Capsule (WCapsule) network with MLP combined with sequence-to-sequence (Seq2Seq) network to classify arrhythmias. Our work is based on the MIT-BIH arrhythmia database, the original electrocardiogram (ECG) data is classified according to the criteria recommended by the American Association for Medical Instrumentation (AAMI). Also, our method’s performance is further evaluated.Results: The proposed model is evaluated using the inter-patient paradigm. Our proposed method shows an accuracy (ACC) of 99.88% under sample imbalance. For Class N, sensitivity (SEN) is 99.79%, positive predictive value (PPV) is 99.90%, and specificity (SPEC) is 99.19%. For Class S, SEN is 97.66%, PPV is 96.14%, and SPEC is 99.85%. For Class V, SEN is 99.97%, PPV is 99.07%, and SPEC is 99.94%. For Class F, SEN is 97.94%, PPV is 98.70%, and SPEC is 99.99%. When using only half of the training sample, our method shows that the SEN of Class N and V is 0.97% and 5.27% higher than the traditional machine learning algorithm.Conclusion: The proposed method combines MLP, weight capsule network with Seq2seq network, effectively addresses the problem of sample imbalance in arrhythmia classification, and produces good performance. Our method also shows promising potential in less samples.",
        "link": "http://dx.doi.org/10.3389/fphys.2023.1247587"
    },
    {
        "id": 11018,
        "title": "Sequence theory for classification in multi-label ATR classification tasks",
        "authors": "Christine M. Schubert Kabban, Mark E. Oxley",
        "published": "2019-5-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2520394"
    },
    {
        "id": 11019,
        "title": "Category Recognition in E-Commerce using Sequence-to-Sequence Hierarchical Classification",
        "authors": "Idan Hasson, Slava Novgorodov, Gilad Fuchs, Yoni Acriche",
        "published": "2021-3-8",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3437963.3441717"
    },
    {
        "id": 11020,
        "title": "Exploring different sequence representations and classification methods for the prediction of nucleosome positioning",
        "authors": "Nikos Kostagiolas, Nikiforos Pittaras, Christoforos Nikolaou, George Giannakopoulos",
        "published": "No Date",
        "citations": 2,
        "abstract": "Nucleosomes form the first level of DNA compaction and thus bear a critical role in the overall genome organization. At the same time, they modulate chromatin accessibility and, through a dynamic equilibrium with other DNA-binding proteins, may shape gene expression. A number of large-scale nucleosome positioning maps, obtained for various genomes, has compelled the importance of nucleosomes in the regulation of gene expression and has shown constraints in the relative positions of nucleosomes to be much stronger around regulatory elements (i.e. promoters, splice junctions and enhancers). At the same time, the great majority of nucleosome positions appears to be rather flexible. Various computational methods have in the past been used in order to capture the sequence determinants of nucleosome positioning but, as the extent to which DNA sequence preferences may guide nucleosome occupancy largely varies, this has proved to be rather difficult. In order to focus on highly specific sequence attributes, in this work we have analyzed two well-defined sets of nucleosome-occupied sites (NOS) and nucleosome-free-regions (NFR) from the genome of S. cerevisiae, with the use of textual representations. We employed 3 different genomic sequence representations (Hidden Markov Models, Bag-of-Words and N-gram Graphs) combined with a number of machine learning algorithms on the task of classifying genomic sequences as nucleosome-free (NFR) or nucleosome-occupied NOS (to be further amended based on updated results). We found that different approaches that involve the usage of different representations or algorithms can be more or less effective at predicting nucleosome positioning based on the textual data of the underlying genomic sequence. More interestingly, we show that N-gram Graphs, a sequence representation that takes into account both k-mer occurrences and relative positioning at various lengths scales is outperforming other methodologies and may thus be a choice of preference for the analysis of DNA sequences with subtle constraints.",
        "link": "http://dx.doi.org/10.1101/482612"
    },
    {
        "id": 11021,
        "title": "Taxonomic identification of environmental DNA with informatic sequence classification trees.",
        "authors": "Shaun P Wilkinson, Simon K Davy, Michael Bunce, Michael Stat",
        "published": "No Date",
        "citations": 25,
        "abstract": "High-throughput sequencing of environmental DNA (eDNA) offers a simple and cost-effective solution for marine biodiversity assessments. Yet several analytical challenges remain, including the incorporation of statistical inference in the assignment of taxonomic identities. We developed a probabilistic method for DNA barcode classification that can be used for both eDNA and traditional single-source sampling. The pipeline involves: (1) compiling a primer-specific database of barcode sequences to be used as training data (obtained from GenBank and other sequence repositories), (2) generating a classification tree using an iterative learning algorithm that divisively sorts the training data into hierarchical clusters based on profile hidden Markov models, (3) assignment of each query sequence to a cluster using a recursive series of model-comparison tests, and (4) taxonomic identification of the query sequences based on the lowest common taxonomic rank of the training sequences within the cluster. This method compares favorably to other DNA classification methods when tested on benchmark datasets, and offers the added features of classifying at higher taxonomic ranks and returning interpretable confidence values in the form of the Akaike weight statistic. This bioinformatics pipeline is available as an open source R package called ‘insect’ (informatic sequence classification trees).",
        "link": "http://dx.doi.org/10.7287/peerj.preprints.26812v1"
    },
    {
        "id": 11022,
        "title": "Sequence-Spectrogram Fusion Network for Machinery Diagnosis Through Few-Shot Time-Series Classification",
        "authors": "Hao Zhang, Teng Li, Ai Jing, Siyuan Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4767023"
    },
    {
        "id": 11023,
        "title": "GenFooT: Genomic Footprint of mitochondrial sequence for Taxonomy classification",
        "authors": "Aritra Mahapatra, Jayanta Mukherjee",
        "published": "2020-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bibm49941.2020.9313475"
    },
    {
        "id": 11024,
        "title": "Sequence Classification",
        "authors": "Mehala Balamurali",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-26050-7_466-1"
    },
    {
        "id": 11025,
        "title": "Fault Detection Utilizing Deep Learning for Long-Sequence Time Series Classification",
        "authors": "Yunwei Hu, Guneet Sethi",
        "published": "2022-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/rams51457.2022.9893895"
    },
    {
        "id": 11026,
        "title": "Sequence Classification",
        "authors": "Mehala Balamurali",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-85040-1_466"
    },
    {
        "id": 11027,
        "title": "Preliminary Classification of Novel Hemorrhagic Fever-Causing Viruses Using Sequence-Based PAirwise Sequence Comparison (PASC) Analysis",
        "authors": "Yīmíng Bào, Jens H. Kuhn",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-6981-4_3"
    },
    {
        "id": 11028,
        "title": "Adapting Sequence Alignments for Text Classification",
        "authors": "Rasha A. BinThalab, Seham A. Bamatraf",
        "published": "2019-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoice48418.2019.9035138"
    },
    {
        "id": 11029,
        "title": "MalClassifier: Malware family classification using network flow sequence behaviour",
        "authors": "Bushra A. AlAhmadi, Ivan Martinovic",
        "published": "2018-5",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecrime.2018.8376209"
    },
    {
        "id": 11030,
        "title": "AN EFFECTIVE DATA MINING TECHNIQUE FOR THE MULTI-CLASS PROTEIN SEQUENCE CLASSIFICATION",
        "authors": "",
        "published": "2020-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/jcr.07.06.35"
    },
    {
        "id": 11031,
        "title": "Peer Review #1 of \"Comprehensive classification of the plant non-specific lipid transfer protein superfamily towards its sequence–structure–function analysis (v0.1)\"",
        "authors": "",
        "published": "2019-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.7504v0.1/reviews/1"
    },
    {
        "id": 11032,
        "title": "Peer Review #3 of \"Comprehensive classification of the plant non-specific lipid transfer protein superfamily towards its sequence–structure–function analysis (v0.1)\"",
        "authors": "",
        "published": "2019-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.7504v0.1/reviews/3"
    },
    {
        "id": 11033,
        "title": "Sequence-based Optimized Chaos Game Representation and Deep Learning for Peptide/Protein Classification",
        "authors": "Beibei Huang, Eric Zhang, Rajan Chaudhari, Heiko Gimperlein",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractAs an effective graphical representation method for 1D sequence (e.g., text), Chaos Game Representation (CGR) has been frequently combined with deep learning (DL) for biological analysis. In this study, we developed a unique approach to encode peptide/protein sequences into CGR images for classification. To this end, we designed a novel energy function and enhanced the encoder quality by constructing a Supervised Autoencoders (SAE) neural network. CGR was used to represent the amino acid sequences and such representation was optimized based on the latent variables with SAE. To assess the effectiveness of our new representation scheme, we further employed convolutional neural network (CNN) to build models to study hemolytic/non-hemolytic peptides and the susceptibility/resistance of HIV protease mutants to approved drugs. Comparisons were also conducted with other published methods, and our approach demonstrated superior performance.Supplementary informationavailable online",
        "link": "http://dx.doi.org/10.1101/2022.09.10.507145"
    },
    {
        "id": 11034,
        "title": "Taxonomic identification of environmental DNA with informatic sequence classification trees.",
        "authors": "Shaun P Wilkinson, Simon K Davy, Michael Bunce, Michael Stat",
        "published": "No Date",
        "citations": 3,
        "abstract": "High-throughput sequencing of environmental DNA (eDNA) offers a simple and cost-effective solution for marine biodiversity assessments. Yet several analytical challenges remain, including the incorporation of statistical inference in the assignment of taxonomic identities. We developed a probabilistic method for DNA barcode classification that can be used for both eDNA and traditional single-source sampling. The pipeline involves: (1) compiling a primer-specific database of barcode sequences to be used as training data (obtained from GenBank and other sequence repositories), (2) generating a classification tree using an iterative learning algorithm that divisively sorts the training data into hierarchical clusters based on profile hidden Markov models, (3) assignment of each query sequence to a cluster using a recursive series of model-comparison tests, and (4) taxonomic identification of the query sequences based on the lowest common taxonomic rank of the training sequences within the cluster. This method compares favorably to other DNA classification methods when tested on benchmark datasets, and offers the added features of classifying at higher taxonomic ranks and returning interpretable confidence values in the form of the Akaike weight statistic. This bioinformatics pipeline is available as an open source R package called ‘insect’ (informatic sequence classification trees).",
        "link": "http://dx.doi.org/10.7287/peerj.preprints.26812"
    },
    {
        "id": 11035,
        "title": "Classification of a sequence family using plateaued functions",
        "authors": "Serdar Boztas, Ferruh Ozbudak, Eda Tekin",
        "published": "2017-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isit.2017.8006782"
    },
    {
        "id": 11036,
        "title": "Predicting Stroke by Combination of Sequence Pattern Mining and Associative Classification",
        "authors": "Sujitra Nasingkhun, Panida Songram",
        "published": "2018-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/incit.2018.8584879"
    },
    {
        "id": 11037,
        "title": "ClassiPhages 2.0: Sequence-based classification of phages using Artificial Neural Networks",
        "authors": "Cynthia Maria Chibani, Florentin Meinecke, Anton Farr, Sascha Dietrich, Heiko Liesegang",
        "published": "No Date",
        "citations": 6,
        "abstract": "AbstractBackground/ MotivationIn the era of affordable next generation sequencing technologies we are facing an exploding amount of new phage genome sequences. This requests high throughput phage classification tools that meet the standards of the International Committee on Taxonomy of Viruses (ICTV). However, an accurate prediction of phage taxonomic classification derived from phage sequences still poses a challenge due to the lack of performant taxonomic markers. Since machine learning methods have proved to be efficient for the classification of biological data we investigated how artificial neural networks perform on the task of phage taxonomy.ResultsIn this work, 5,920 constructed and refined profile Hidden Markov Models (HMMs), derived from 8,721 phage sequences classified into 12 well known phage families, were used to scan phage proteome datasets. The resulting Phage Family-proteome to Phage-derived-HMMs scoring matrix was used to develop and train an Artificial Neural Network (ANN) to find patterns for phage classification into one of the phage families. Results show that using the 100 fold cross-validation test, the proposed method achieved an overall accuracy of 84.18 %. The ANN was tested on a set of unclassified phages and resulted in a taxonomic prediction. The ANN prediction was benchmarked against the prediction resulting of multi-HMM hits, and showed that the ANN performance is dependent on the quality of the input matrix.ConclusionsWe believe that, as long as some phage families on public databases are underrepresented, multi-HMM hits can be used as a classification method to populate those phage families, which in turn will improve the performance and accuracy of the ANN. We believe that the proposed method is an effective and promising method for phage classification. The good performance of the ANN and HMM based predictor indicates the efficiency of the method for phage classification, where we foresee its improvement with an increasing number of sequenced viral genomes.",
        "link": "http://dx.doi.org/10.1101/558171"
    },
    {
        "id": 11038,
        "title": "A Sequence-Pair-Classification-Based Method for Detecting and Correcting Under-Clustered Gene Families",
        "authors": "Akshay Yadav, David Fernández-Baca, Steven B. Cannon",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractGene families are groups of genes that have descended from a common ancestral gene present in the species under study. Current, widely used gene family building algorithms can produce family clusters that may be fragmented or missing true family sequences (under-clustering). Here we present a classification method based on sequence pairs that, first, inspects given families for under-clustering and then predicts the missing sequences for the families using family-specific alignment score cutoffs. We have tested this method on a set of curated, gold-standard (“true”) families from the Yeast Gene Order Browser (YGOB) database, including 20 yeast species, as well as a test set of intentionally under-clustered (“deficient”) families derived from the YGOB families. For 83% of the modified yeast families, our pair-classification method was able to reliably detect under-clustering in “deficient” families that were missing 20% of sequences relative to the full/” true” families. We also attempted to predict back the missing sequences using the family-specific alignment score cutoffs obtained during the detection phase. In the case of “pure” under-clustered families (under-clustered families with no “wrong”/unrelated sequences), for 78% of families the prediction precision and recall was ≥0.75, with mean precision = 0.928 and mean recall = 0.859. For “impure” under-clustered families, (under-clustered families containing closest sequences from outside the family, in addition to missing true family sequences), the prediction precision and recall was ≥0.75 for 63% of families with mean precision = 0.790 and mean recall = 0.869. To check if our method can detect and correct incomplete families obtained using existing family building methods, we attempted to correct 374 under-clustered yeast families produced using the OrthoFinder tool. We were able to predict missing sequences for at least 19 yeast families with mean precision of 0.9 and mean recall of 0.65. We also analyzed 14,663 legume families built using the OrthoFinder program, with 14 legume species. We were able to identify 1,665 OrthoFinder families that were missing one or more sequences - sequences which were previously un-clustered or clustered into unusually small families. Further, using a simple merging strategy, we were able to merge 2,216 small families into 933 under-clustered families using the predicted missing sequences. Out of the 933 merged families, we could confirm correct mergings in at least 534 families using the maximum-likelihood phylogenies of the merged families. We also provide recommendations on different types of family-specific alignment score cutoffs that can be used for predicting the missing sequences based on the “purity” of under-clustered families and the chosen precision and recall for prediction. Finally, we provide the containerized version of the pair-classification method that can be applied on any given set of gene families.",
        "link": "http://dx.doi.org/10.1101/2020.02.22.942557"
    },
    {
        "id": 11039,
        "title": "Attention-based Sequence Classification for Affect Detection",
        "authors": "Cristina Gorrostieta, Richard Brutti, Kye Taylor, Avi Shapiro, Joseph Moran, Ali Azarbayejani, John Kane",
        "published": "2018-9-2",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2018-1610"
    },
    {
        "id": 11040,
        "title": "Sequence labelling and sequence classification with gaze: Novel uses of eye‐tracking data for Natural Language Processing",
        "authors": "Maria Barrett, Nora Hollenstein",
        "published": "2020-11",
        "citations": 6,
        "abstract": "AbstractEye‐tracking data from reading provide a structured signal with a fine‐grained temporal resolution which closely follows the sequential structure of the text. It is highly correlated with the cognitive load associated with different stages of human, cognitive text processing. While eye‐tracking data have been extensively studied to understand human cognition, it has only recently been considered for Natural Language Processing (NLP). In this review, we provide a comprehensive overview of how gaze data are being used in data‐driven NLP, in particular for sequence labelling and sequence classification tasks. We argue that eye‐tracking may effectively counter one of the core challenges of machine‐learning‐based NLP: the scarcity of annotated data. We outline the recent advances in gaze‐augmented NLP to discuss how the gaze signal from human readers can be leveraged while also considering the potentials and limitations of this data source.",
        "link": "http://dx.doi.org/10.1111/lnc3.12396"
    },
    {
        "id": 11041,
        "title": "Peer Review #2 of \"Comprehensive classification of the plant non-specific lipid transfer protein superfamily towards its sequence–structure–function analysis (v0.1)\"",
        "authors": "D Hincha",
        "published": "2019-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.7504v0.1/reviews/2"
    },
    {
        "id": 11042,
        "title": "A64 Viral sequence classification using deep learning algorithms",
        "authors": "David Nieuwenhuijse, Bas Oude Munnink, My Phan, Marion Koopmans",
        "published": "2019-8-1",
        "citations": 0,
        "abstract": "Abstract\nSewage samples have a high potential benefit for surveillance of circulating pathogens because they are easy to obtain and reflect population-wide circulation of pathogens. These type of samples typically contain a great diversity of viruses. Therefore, one of the main challenges of metagenomic sequencing of sewage for surveillance is sequence annotation and interpretation. Especially for high-threat viruses, false positive signals can trigger unnecessary alerts, but true positives should not be missed. Annotation thus requires high sensitivity and specificity. To better interpret annotated reads for high-threat viruses, we attempt to determine how classifiable they are in a background of reads of closely related low-threat viruses. As an example, we attempted to distinguish poliovirus reads, a virus of high public health importance, from other enterovirus reads. A sequence-based deep learning algorithm was used to classify reads as either polio or non-polio enterovirus. Short reads were generated from 500 polio and 2,000 non-polio enterovirus genomes as a training set. By training the algorithm on this dataset we try to determine, on a single read level, which short reads can reliably be labeled as poliovirus and which cannot. After training the deep learning algorithm on the generated reads we were able to calculate the probability with which a read can be assigned to a poliovirus genome or a non-poliovirus genome. We show that the algorithm succeeds in classifying the reads with high accuracy. The probability of assigning the read to the correct class was related to the location in the genome to which the read mapped, which conformed with our expectations since some regions of the genome are more conserved than others. Classifying short reads of high-threat viral pathogens seems to be a promising application of sequence-based deep learning algorithms. Also, recent developments in software and hardware have facilitated the development and training of deep learning algorithms. Further plans of this work are to characterize the hard-to-classify regions of the poliovirus genome, build larger training databases, and expand on the current approach to other viruses.",
        "link": "http://dx.doi.org/10.1093/ve/vez002.063"
    },
    {
        "id": 11043,
        "title": "Activity Sequence Classification for Monitoring and Assessment",
        "authors": "Marilyn Wolf",
        "published": "2017-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3131885.3131913"
    },
    {
        "id": 11044,
        "title": "Autoencoders and Generative Adversarial Networks for Imbalanced Sequence Classification",
        "authors": "Stephanie Ger, Yegna Subramanian Jambunath, Diego Klabjan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386960"
    },
    {
        "id": 11045,
        "title": "Malware Classification Based On System Call Sequence",
        "authors": "Sachchidanand Kumar, Aryan Agrahri, Shivam Kumar Jha, Kapil Gupta",
        "published": "2021-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet51464.2021.9456208"
    },
    {
        "id": 11046,
        "title": "A comparison between CNNs and WFAs for Sequence Classification",
        "authors": "Ariadna Quattoni, Xavier Carreras",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.sustainlp-1.21"
    },
    {
        "id": 11047,
        "title": "Fine-Tuning of BERT models for Sequence Classification",
        "authors": "Diego Uribe, Enrique Cuan, Elisa Urquizo",
        "published": "2022-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmeae58636.2022.00031"
    },
    {
        "id": 11048,
        "title": "An Approach to DNA Sequence Classification Through Machine Learning",
        "authors": "Sapna Juneja, Annu Dhankhar, Abhinav Juneja, Shivani Bali",
        "published": "2022-8-26",
        "citations": 4,
        "abstract": "Machine learning (ML) has been instrumental in optimal decision making through relevant historical data, including the domain of bioinformatics. In bioinformatics classification of natural genes and the genes that are infected by disease called invalid gene is a very complex task. In order to find the applicability of a fresh protein through genomic research, DNA sequences need to be classified. The current work identifies classes of DNA sequence using machine learning algorithm. These classes are basically dependent on the sequence of nucleotides. With a fractional mutation in sequence, there is a corresponding change in the class. Each numeric instance representing a class is linked to a gene family including G protein coupled receptors, tyrosine kinase, synthase, etc. In this paper, the authors applied the classification algorithm on three types of datasets to identify which gene class they belong to. They converted sequences into substrings with a defined length. That ‘k value' defines the length of substring which is one of the ways to analyze the sequence.",
        "link": "http://dx.doi.org/10.4018/ijrqeh.299963"
    },
    {
        "id": 11049,
        "title": "Higher recall in metagenomic sequence classification exploiting overlapping reads",
        "authors": "Samuele Girotto, Matteo Comin, Cinzia Pizzi",
        "published": "2017-12",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1186/s12864-017-4273-6"
    },
    {
        "id": 11050,
        "title": "Species abundance information improves sequence taxonomy classification accuracy",
        "authors": "Benjamin D. Kaehler, Nicholas A. Bokulich, Daniel McDonald, Rob Knight, J. Gregory Caporaso, Gavin A. Huttley",
        "published": "No Date",
        "citations": 3,
        "abstract": "AbstractPopular naive Bayes taxonomic classifiers for amplicon sequences assume that all species in the reference database are equally likely to be observed. We demonstrate that classification accuracy degrades linearly with the degree to which that assumption is violated, and in practice it is always violated. By incorporating environment-specific taxonomic abundance information, we demonstrate that species-level resolution is attainable.",
        "link": "http://dx.doi.org/10.1101/406611"
    },
    {
        "id": 11051,
        "title": "Credit Scoring Based on Transaction Sequence Classification",
        "authors": "Xiaofeng Gu, Hao Zhou, Lei Fan",
        "published": "2018-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cyberc.2018.00062"
    },
    {
        "id": 11052,
        "title": "Classification of miRNA-related sequence variations",
        "authors": "Karin Hrovatin, Tanja Kunej",
        "published": "2018-4-1",
        "citations": 31,
        "abstract": " miRNA regulome is whole set of regulatory elements that regulate miRNA expression or are under control of miRNAs. Its understanding is vital for comprehension of miRNA functions. Classification of miRNA-related genetic variability is challenging because miRNA interact with different genomic elements and are studied at different omics levels. In the present study, miRNA-associated genetic variability is presented at three levels: miRNA genes and their upstream regulation, miRNA silencing machinery and miRNA targets. Several types of miRNA-associated genetic variations are known, including short and structural polymorphisms and epimutations. Differential expression can also affect miRNA regulome function. Classification of miRNA-associated genetic variability presents a baseline for complementing sequence variant nomenclature, planning of experiments, protocols for multi-omics data integration and development of biomarkers. ",
        "link": "http://dx.doi.org/10.2217/epi-2017-0126"
    },
    {
        "id": 11053,
        "title": "Automatic Chromosome Classification using Deep Attention Based Sequence Learning of Chromosome Bands",
        "authors": "Monika Sharma,  Swati, Lovekesh Vig",
        "published": "2018-7",
        "citations": 26,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489321"
    },
    {
        "id": 11054,
        "title": "Sequence Classification with Human Attention",
        "authors": "Maria Barrett, Joachim Bingel, Nora Hollenstein, Marek Rei, Anders Søgaard",
        "published": "2018",
        "citations": 32,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/k18-1030"
    },
    {
        "id": 11055,
        "title": "Application of Efficient Express Sequence Tags Information for Classification and Functional Study of Simple Sequence Repeats in Cattle Testis Tissue",
        "authors": "M. Manavipour, A. Ehsani, A. A. Masoudi",
        "published": "2020-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5398/tasj.2020.43.1.25"
    },
    {
        "id": 11056,
        "title": "Plasma confinement mode classification using a sequence-to-sequence neural network with attention",
        "authors": "F. Matos, V. Menkovski, A. Pau, G. Marceca, F. Jenko,  the TCV Team",
        "published": "2021-4-1",
        "citations": 6,
        "abstract": "Abstract\nIn a typical fusion experiment, the plasma can have several possible confinement modes. At the tokamak à configuration variable, aside from the low (L) and high (H) confinement modes, an additional mode, dithering (D), is frequently observed. Developing methods that automatically detect these modes is considered to be important for future tokamak operation. Previous work (Matos et al 2020 Nucl. Fusion\n60 036022) with deep learning methods, particularly convolutional long short-term memory networks (conv-LSTMs), indicates that they are a suitable approach. Nevertheless, those models are sensitive to noise in the temporal alignment of labels, and that model in particular is limited to making individual decisions taking into account only the input data at a given timestep and the past data, represented in its hidden state. In this work, we propose an architecture for a sequence-to-sequence neural network model with attention which solves both of those issues. Using a carefully calibrated dataset, we compare the performance of a conv-LSTM with that of our proposed sequence-to-sequence model, and show two results: one, that the conv-LSTM can be improved upon with new data; two, that the sequence-to-sequence model can improve the results even further, achieving excellent scores on both train and test data.",
        "link": "http://dx.doi.org/10.1088/1741-4326/abe370"
    },
    {
        "id": 11057,
        "title": "Extracting social determinants of health from clinical note text with classification and sequence-to-sequence approaches",
        "authors": "Brian Romanowski, Asma Ben Abacha, Yadan Fan",
        "published": "2023-7-19",
        "citations": 4,
        "abstract": "Abstract\n\nObjective\nSocial determinants of health (SDOH) are nonmedical factors that can influence health outcomes. This paper seeks to extract SDOH from clinical texts in the context of the National NLP Clinical Challenges (n2c2) 2022 Track 2 Task.\n\n\nMaterials and Methods\nAnnotated and unannotated data from the Medical Information Mart for Intensive Care III (MIMIC-III) corpus, the Social History Annotation Corpus, and an in-house corpus were used to develop 2 deep learning models that used classification and sequence-to-sequence (seq2seq) approaches.\n\n\nResults\nThe seq2seq approach had the highest overall F1 scores in the challenge’s 3 subtasks: 0.901 on the extraction subtask, 0.774 on the generalizability subtask, and 0.889 on the learning transfer subtask.\n\n\nDiscussion\nBoth approaches rely on SDOH event representations that were designed to be compatible with transformer-based pretrained models, with the seq2seq representation supporting an arbitrary number of overlapping and sentence-spanning events. Models with adequate performance could be produced quickly, and the remaining mismatch between representation and task requirements was then addressed in postprocessing. The classification approach used rules to generate entity relationships from its sequence of token labels, while the seq2seq approach used constrained decoding and a constraint solver to recover entity text spans from its sequence of potentially ambiguous tokens.\n\n\nConclusion\nWe proposed 2 different approaches to extract SDOH from clinical texts with high accuracy. However, accuracy suffers on text from new healthcare institutions not present in the training data, and thus generalization remains an important topic for future study.\n",
        "link": "http://dx.doi.org/10.1093/jamia/ocad071"
    },
    {
        "id": 11058,
        "title": "Implementation of Protein Sequence Classification for Globin family using Ensemble Learnin",
        "authors": "",
        "published": "2021-4-7",
        "citations": 0,
        "abstract": "Feature Extraction from protein sequence is a very important task in bioinformatics. The main focus of that work is protein sequences classification that can be used to improve drug discovery and identification of diseases for treating patients in the early stages of diagnosis. In this paper, we proposed a method which is used for feature extraction i.e. converting the protein sequence of hemoglobin in to feature vectors. The feature vectors are then given to the ensemble classifier as an input which uses various classifier to provide better result/performance as compared to any constituent learning algorithm alone.",
        "link": "http://dx.doi.org/10.30534/ijeter/2021/18942021"
    },
    {
        "id": 11059,
        "title": "On the diversity of F<sub>420</sub>-dependent oxidoreductases: a sequence- and structure-based classification",
        "authors": "María Laura Mascotti, Maximiliano Juri Ayub, Marco W. Fraaije",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThe F420 deazaflavin cofactor is an intriguing molecule as it structurally resembles the canonical flavin cofactor, although biochemically behaves as a nicotinamide cofactor. Since its discovery, numerous enzymes relying on it have been described. The known deazaflavoproteins are taxonomically restricted to Archaea and Bacteria. The biochemistry of the deazaflavoenzymes is diverse and they exhibit some degree of structural variability as well. In this study a thorough sequence and structural homology evolutionary analysis was performed in order to generate an overarching classification of all known F420-dependent oxidoreductases. Five different superfamilies are described: Superfamily I, TIM-barrel F420-dependent enzymes; Superfamily II, Rossmann fold F420-dependent enzymes; Superfamily III, β-roll F420-dependent enzymes; Superfamily IV, SH3 barrel F420-dependent enzymes and Superfamily V, 3 layer ββα sandwich F420-dependent enzymes. This classification aims to be the framework for the identification, the description and the understanding the biochemistry of novel deazaflavoenzymes.",
        "link": "http://dx.doi.org/10.1101/2020.08.24.261826"
    },
    {
        "id": 11060,
        "title": "Classification of Local Field Potentials using Gaussian Sequence Model",
        "authors": "Taposh Banerjee, John Choi, Bijan Pesaran, Demba Ba, Vahid Tarokh",
        "published": "2018-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssp.2018.8450778"
    },
    {
        "id": 11061,
        "title": "Sequence encoding incorporated CNN model for Email document sentiment classification",
        "authors": "Sisi Liu, Ickjai Lee",
        "published": "2021-4",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2021.107104"
    },
    {
        "id": 11062,
        "title": "Ensemble recurrent neural network with whale optimization algorithm-based DNA sequence classification for medical applications",
        "authors": "Abdulaziz Alshammari",
        "published": "2023-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-023-08435-y"
    },
    {
        "id": 11063,
        "title": "A Study on the Importance of Formant Transitions for Stop-Consonant Classification in VCV Sequence",
        "authors": "Siddarth Chandrasekar, Arvind Ramesh, Tilak Purohit, Prasanta Kumar Ghosh",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1738"
    },
    {
        "id": 11064,
        "title": "Short-Spoken Language Intent Classification with Conditional Sequence Generative Adversarial Network",
        "authors": "Xinyu Zhou, Yang Peng",
        "published": "2019-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictai.2019.00261"
    },
    {
        "id": 11065,
        "title": "EEG Based Motor Imagery Classification Using Instantaneous Phase Difference Sequence",
        "authors": "Satyam Kumar, Tharun Reddy, Laxmidhar Behera",
        "published": "2018-10",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smc.2018.00094"
    },
    {
        "id": 11066,
        "title": "SERC: Syntactic and Semantic Sequence based Event Relation Classification",
        "authors": "Kritika Venkatachalam, Raghava Mutharaju, Sumit Bhatia",
        "published": "2021-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictai52525.2021.00208"
    },
    {
        "id": 11067,
        "title": "Sequence Classification Using Third-Order Moments",
        "authors": "Rasmus Troelsgaard, Lars Kai Hansen",
        "published": "2018-1",
        "citations": 0,
        "abstract": " Model-based classification of sequence data using a set of hidden Markov models is a well-known technique. The involved score function, which is often based on the class-conditional likelihood, can, however, be computationally demanding, especially for long data sequences. Inspired by recent theoretical advances in spectral learning of hidden Markov models, we propose a score function based on third-order moments. In particular, we propose to use the Kullback-Leibler divergence between theoretical and empirical third-order moments for classification of sequence data with discrete observations. The proposed method provides lower computational complexity at classification time than the usual likelihood-based methods. In order to demonstrate the properties of the proposed method, we perform classification of both simulated data and empirical data from a human activity recognition study. ",
        "link": "http://dx.doi.org/10.1162/neco_a_01033"
    },
    {
        "id": 11068,
        "title": "Shadows Don't Lie: n-Sequence Trajectory Inspection for Misbehaviour Detection and Classification in VANETs",
        "authors": "Anhtuan Le, Carsten Maple",
        "published": "2019-9",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vtcfall.2019.8891137"
    },
    {
        "id": 11069,
        "title": "Time Series Classification by Sequence Learning in All-Subsequence Space",
        "authors": "Thach Le Nguyen, Severin Gsponer, Georgiana Ifrim",
        "published": "2017-4",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icde.2017.142"
    },
    {
        "id": 11070,
        "title": "Introduction of 3D-classification and its derived surgical sequence of Schatzker type IV tibial plateau fractures",
        "authors": "Zihao Liu, Shengjie Wang, Shuai Wang, AQin Peng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIntroduction\n Schatzker IV tibial plateau fractures usually have worse prognosis due to its high variability and the combination of bony and soft tissue injuries. The aim of this study was to introduce a new classification of Schatzker IV tibial plateau fractures based on the injury mechanism and evaluate its reliability. The secondary aim was to evaluate the outcomes of operative Schatzker IV tibial plateau fractures treated according to the surgical sequences which were determined by the new classification.\nMaterials and Methods\n 63 operative Schatzker IV tibial plateau fractures which were treated following the new surgical sequence were enrolled in our study. CT images of these patients were reviewed and classified twice according to our new classification by four observers. The reliability of the classification was calculated by application of kappa analysis. The surgical sequence determined by the classification was evaluated by observing the the postoperative efficacy during the follow-up.\nResults\n The intra-observer reliability of 3D-classification showed excellent agreement according to Landis and Koch (The mean k = 0.897, CI 0.806–0.971). And the inter-obsever reliability of 3D-classification also showed excellent agreement. (The mean k = 0.883, CI 0.786–0.961). All patients were followed up and the average follow-up of the cases was 12.8 months (6–28 months). As for the evaluation of the postoperative efficacy, according to KSS, 53 cases were rated as excellent, 8 cases were rated as good and 2 cases were considered as fair results.\nConclusions\n The new proposed classification showed high intra and inter-observer reliability in our study. And the surgical sequence determined by the classification can help surgeons to acquire good reduction and rigid internal fixation. Therefore the new classification of Schatzker IV tibial plateau fractures and the accompanied surgical sequence are worthy of further popularization and application in clinical trials.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2660137/v1"
    }
]