[
    {
        "id": 19471,
        "title": "Comparison between popular Genetic Algorithm (GA)-based tool and Covariance Matrix Adaptation - Evolutionary Strategy (CMA-ES) for optimizing indoor daylight",
        "authors": "Manal Anis, Sumedh Pendurkar, Yun Kyu Yi, Guni Sharon",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26868/25222708.2023.1218"
    },
    {
        "id": 19472,
        "title": "BSO-CMA-ES: Brain Storm Optimization Based Covariance Matrix Adaptation Evolution Strategy for Multimodal Optimization",
        "authors": "Liang Qu, Ruiqi Zheng, Yuhui Shi",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-7502-7_19"
    },
    {
        "id": 19473,
        "title": "Neural Architecture Search Using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Nilotpal Sinha, Kuan-Wen Chen",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "Abstract\nEvolution-based neural architecture search methods have shown promising results, but they require high computational resources because these methods involve training each candidate architecture from scratch and then evaluating its fitness, which results in long search time. Covariance Matrix Adaptation Evolution Strategy (CMA-ES) has shown promising results in tuning hyperparameters of neural networks but has not been used for neural architecture search. In this work, we propose a framework called CMANAS which applies the faster convergence property of CMA-ES to the deep neural architecture search problem. Instead of training each individual architecture seperately, we used the accuracy of a trained one shot model (OSM) on the validation data as a prediction of the fitness of the architecture, resulting in reduced search time. We also used an architecture-fitness table (AF table) for keeping a record of the already evaluated architecture, thus further reducing the search time. The architectures are modeled using a normal distribution, which is updated using CMA-ES based on the fitness of the sampled population. Experimentally, CMANAS achieves better results than previous evolution-based methods while reducing the search time significantly. The effectiveness of CMANAS is shown on two different search spaces using four datasets: CIFAR-10, CIFAR-100, ImageNet, and ImageNet16-120. All the results show that CMANAS is a viable alternative to previous evolution-based methods and extends the application of CMA-ES to the deep neural architecture search field.",
        "link": "http://dx.doi.org/10.1162/evco_a_00331"
    },
    {
        "id": 19474,
        "title": "Individuals redistribution based on differential evolution for covariance matrix adaptation evolution strategy",
        "authors": "Zhe Chen, Yuanxing Liu",
        "published": "2022-1-19",
        "citations": 1,
        "abstract": "AbstractAmong population-based metaheuristics, both Differential Evolution (DE) and Covariance Matrix Adaptation Evolution Strategy (CMA-ES) perform outstanding for real parameter single objective optimization. Compared with DE, CMA-ES stagnates much earlier in many occasions. In this paper, we propose CMA-ES with individuals redistribution based on DE, IR-CMA-ES, to address stagnation in CMA-ES. We execute experiments based on two benchmark test suites to compare our algorithm with nine peers. Experimental results show that our IR-CMA-ES is competitive in the field of real parameter single objective optimization.",
        "link": "http://dx.doi.org/10.1038/s41598-021-04549-1"
    },
    {
        "id": 19475,
        "title": "Improving (1+1) covariance matrix adaptation evolution strategy: A simple yet efficient approach",
        "authors": "Fabio Caraffini, Giovanni Iacca, Anil Yaman",
        "published": "2019",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5089971"
    },
    {
        "id": 19476,
        "title": "On-line Search History-assisted Restart Strategy for Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Yang Lou, Shiu Yin Yuen, Guanrong Chen, Xin Zhang",
        "published": "2019-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2019.8790368"
    },
    {
        "id": 19477,
        "title": "Aberration correction for multiphoton microscopy using covariance matrix adaptation evolution strategy",
        "authors": "Ke Wang, Lei Zheng, Mengyuan Qin, Wanjian Zhang, Xiangquan Deng, Shen Tong, Hui Cheng, Jie Huang, Jincheng Zhong, Yingxian Zhang, Ping Qiu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3788/col202321.051701"
    },
    {
        "id": 19478,
        "title": "CMA-ES with exponential based multiplicative covariance matrix adaptation for global optimization",
        "authors": "Bishal Karmakar, Abhishek Kumar, Rammohan Mallipeddi, Dong-Gyu Lee",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.swevo.2023.101296"
    },
    {
        "id": 19479,
        "title": "Toward a Matrix-Free Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Jaroslaw Arabas, Dariusz Jagodzinski",
        "published": "2020-2",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tevc.2019.2907266"
    },
    {
        "id": 19480,
        "title": "Restart Covariance Matrix Adaptation Evolution Strategy for Solving Wind-integrated Emission Economic Dispatch Problems",
        "authors": "Qun Niu, Han Wang, Yang Zhang",
        "published": "2019-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2019.8789917"
    },
    {
        "id": 19481,
        "title": "Robust Covariance Matrix Adaptation Evolution Strategy: Optimal Design of Magnetic Devices Considering Material Variation",
        "authors": "Akito Maruo, Hajime Igarashi",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3288287"
    },
    {
        "id": 19482,
        "title": "Parameter Optimization Using Covariance Matrix Adaptation—Evolutionary Strategy (CMA-ES), an Approach to Investigate Differences in Channel Properties Between Neuron Subtypes",
        "authors": "Zbigniew Jȩdrzejewski-Szmek, Karina P. Abrahao, Joanna Jȩdrzejewska-Szmek, David M. Lovinger, Kim T. Blackwell",
        "published": "2018-7-31",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3389/fninf.2018.00047"
    },
    {
        "id": 19483,
        "title": "Modified box constraint handling for the covariance matrix adaptation evolution strategy",
        "authors": "Naoki Sakamoto, Youhei Akimoto",
        "published": "2017-7-15",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3067695.3075986"
    },
    {
        "id": 19484,
        "title": "PPO-CMA: Proximal Policy Optimization with Covariance Matrix Adaptation",
        "authors": "Perttu Hamalainen, Amin Babadi, Xiaoxiao Ma, Jaakko Lehtinen",
        "published": "2020-9",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlsp49062.2020.9231618"
    },
    {
        "id": 19485,
        "title": "A Topology Optimization of Hydroelectric Generator Using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Takahiro Sato, Masafumi Fujita, Masashi Okubo, Hiroaki Ishizuka",
        "published": "2020-11-24",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/icems50442.2020.9291184"
    },
    {
        "id": 19486,
        "title": "Ship Autonomous Berthing Simulation Based on Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Guoquan Chen, Jian Yin, Shenhua Yang",
        "published": "2023-7-11",
        "citations": 1,
        "abstract": "Existing research on auto-berthing of ships has mainly focused on the design and implementation of controllers for automatic berthing. For the real automatic docking processes, not only do external environmental perturbations need to be taken into account but also motion paths, docking strategies and ship mechanical constraints, which are important influential factors to measure autonomous docking methods. Through a literature review of ship path planning and motion control for automatic berthing, it is found that many studies ignore the interference of the actual navigational environment, especially for ships sailing at slow speed when berthing, or do not consider the physical constraints of the steering gear and the main engine. In this paper, we propose a hybrid approach for autonomous berthing control systems based on a Linear Quadratic Regulator (LQR) and Covariance Matrix Adaptation Evolution Strategy (CMA-ES), which systematically addresses the problems involved in the berthing process, such as path planning, optimal control, adaptive berthing strategies, dynamic environmental perturbations and physically enforced structural constraints. The berthing control system based on the LQR and modified LQR-CMA-ES have been validated by simulation work. The simulation results show that the proposed method is able to achieve the automatic docking of the ship well and the system is robust and well adapted to environmental disturbances at slow speed when docking.",
        "link": "http://dx.doi.org/10.3390/jmse11071400"
    },
    {
        "id": 19487,
        "title": "Optimization of a Photonic Crystal Nanocavity Using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Kohei Takahashi, Toshihiko Baba",
        "published": "2022-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/jphot.2022.3168543"
    },
    {
        "id": 19488,
        "title": "PSA-CMA-ES",
        "authors": "Kouhei Nishida, Youhei Akimoto",
        "published": "2018-7-2",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3205455.3205467"
    },
    {
        "id": 19489,
        "title": "Enhancing Graph Routing Algorithm of Industrial Wireless Sensor Networks Using the Covariance-Matrix Adaptation Evolution Strategy",
        "authors": "Nouf Alharbi, Lewis Mackenzie, Dimitrios Pezaros",
        "published": "2022-10-1",
        "citations": 3,
        "abstract": "The emergence of the Industrial Internet of Things (IIoT) has accelerated the adoption of Industrial Wireless Sensor Networks (IWSNs) for numerous applications. Effective communication in such applications requires reduced end-to-end transmission time, balanced energy consumption and increased communication reliability. Graph routing, the main routing method in IWSNs, has a significant impact on achieving effective communication in terms of satisfying these requirements. Graph routing algorithms involve applying the first-path available approach and using path redundancy to transmit data packets from a source sensor node to the gateway. However, this approach can affect end-to-end transmission time by creating conflicts among transmissions involving a common sensor node and promoting imbalanced energy consumption due to centralised management. The characteristics and requirements of these networks encounter further complications due to the need to find the best path on the basis of the requirements of IWSNs to overcome these challenges rather than using the available first-path. Such a requirement affects the network performance and prolongs the network lifetime. To address this problem, we adopt a Covariance-Matrix Adaptation Evolution Strategy (CMA-ES) to create and select the graph paths. Firstly, this article proposes three best single-objective graph routing paths according to the IWSN requirements that this research focused on. The sensor nodes select best paths based on three objective functions of CMA-ES: the best Path based on Distance (PODis), the best Path based on residual Energy (POEng) and the best Path based on End-to-End transmission time (POE2E). Secondly, to enhance energy consumption balance and achieve a balance among IWSN requirements, we adapt the CMA-ES to select the best path with multiple-objectives, otherwise known as the Best Path of Graph Routing with a CMA-ES (BPGR-ES). A simulation using MATALB with different configurations and parameters is applied to evaluate the enhanced graph routing algorithms. Furthermore, the performance of PODis, POEng, POE2E and BPGR-ES is compared with existing state-of-the-art graph routing algorithms. The simulation results reveal that the BPGR-ES algorithm achieved 87.53% more balanced energy consumption among sensor nodes in the network compared to other algorithms, and the delivery of data packets of BPGR-ES reached 99.86%, indicating more reliable communication.",
        "link": "http://dx.doi.org/10.3390/s22197462"
    },
    {
        "id": 19490,
        "title": "Parameters estimation of the full equivalent circuit of an induction motor, by using simple measurements and covariance matrix adaptation evolution strategy",
        "authors": "Nikola Makedonski",
        "published": "2019-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bulef48056.2019.9030706"
    },
    {
        "id": 19491,
        "title": "Parallel Workflow to Optimize Well Placement in Heterogeneous Reservoir using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Atsuhiro Miyagi, Hajime Yamamoto, Youhei Akimoto, Ziqiu Xue",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3366345"
    },
    {
        "id": 19492,
        "title": "Simplify Your Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Hans-Georg Beyer, Bernhard Sendhoff",
        "published": "2017-10",
        "citations": 75,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tevc.2017.2680320"
    },
    {
        "id": 19493,
        "title": "Cross Entropy Covariance Matrix Adaptation Evolution Strategy Solving the Bi-Level Bidding Optimization Problem in Local Energy Markets with Renewables",
        "authors": "Dharmesh Dabhi, Kartik Pandya, Joao Soares, Fernando Lezama, Zita Vale",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract: The increased penetration of renewables in distribution power systems has motivated researchers to take significant interest in local energy transactions. The major goal of Local Energy Markets (LEM) is to promote the participation of small consumers in energy transactions and providing an opportunity for transactive energy systems. Such energy transactions in LEM are considered as a bi-level optimization problem in which all agents at upper and lower levels try to maximize their profits. But typical bi-level problem is very complex as it is inherently nonlinear, discontinued and strongly NP-hard. So, this article proposes the application of hybridized Cross Entropy Covariance Matrix Adaptation Evolution Strategy (CE-CMAES) to tackle such a complex bi-level problem of LEM. The proposed CE-CMAES secured the 1st rank in Testbed-2 entitled, &ldquo;Bi-level optimization of end-users&rsquo; bidding strategies in local energy markets (LM)&rdquo; at international competitions on Smart Grid Problems, held at GECCO 2020 and WCCI 2020. CE method is used for global exploration of search space and CMAES is used for local exploitation as its adaptive step-size mechanism prevents its premature convergence. A practical distribution system with renewable energy penetration is considered for simulation. The comparative analysis shows that the overall cost, mean fitness and Ranking Index (R.I) obtained from CE-CMAES are superior to those obtained from the state-of-the-art participated algorithms. Wilcoxon Signed Rank Statistical test also proves that CE-CMAES is statistically different from the tested algorithms.",
        "link": "http://dx.doi.org/10.20944/preprints202112.0141.v1"
    },
    {
        "id": 19494,
        "title": "Topology Optimization of NRD Guide Devices Using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Naoya Hieda, Akito Iguchi, Yasuhide Tsuji, Keita Morimoto, Tatsuya Kashiwa",
        "published": "2022-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/apmc55665.2022.10000032"
    },
    {
        "id": 19495,
        "title": "A Fast and Simple Evolution Strategy with Covariance Matrix Estimation",
        "authors": "Oliver Kramer",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14428/esann/2022.es2022-112"
    },
    {
        "id": 19496,
        "title": "Multimodal Optimization by Covariance Matrix Self-Adaptation Evolution Strategy with Repelling Subpopulations",
        "authors": "Ali Ahrari, Kalyanmoy Deb, Mike Preuss",
        "published": "2017-9",
        "citations": 46,
        "abstract": "During the recent decades, many niching methods have been proposed and empirically verified on some available test problems. They often rely on some particular assumptions associated with the distribution, shape, and size of the basins, which can seldom be made in practical optimization problems. This study utilizes several existing concepts and techniques, such as taboo points, normalized Mahalanobis distance, and the Ursem’s hill-valley function in order to develop a new tool for multimodal optimization, which does not make any of these assumptions. In the proposed method, several subpopulations explore the search space in parallel. Offspring of a subpopulation are forced to maintain a sufficient distance to the center of fitter subpopulations and the previously identified basins, which are marked as taboo points. The taboo points repel the subpopulation to prevent convergence to the same basin. A strategy to update the repelling power of the taboo points is proposed to address the challenge of basins of dissimilar size. The local shape of a basin is also approximated by the distribution of the subpopulation members converging to that basin. The proposed niching strategy is incorporated into the covariance matrix self-adaptation evolution strategy (CMSA-ES), a potent global optimization method. The resultant method, called the covariance matrix self-adaptation with repelling subpopulations (RS-CMSA), is assessed and compared to several state-of-the-art niching methods on a standard test suite for multimodal optimization. An organized procedure for parameter setting is followed which assumes a rough estimation of the desired/expected number of minima available. Performance sensitivity to the accuracy of this estimation is also studied by introducing the concept of robust mean peak ratio. Based on the numerical results using the available and the introduced performance measures, RS-CMSA emerges as the most successful method when robustness and efficiency are considered at the same time.",
        "link": "http://dx.doi.org/10.1162/evco_a_00182"
    },
    {
        "id": 19497,
        "title": "Covariance Matrix Adaptation Evolution Strategy for Improving Machine Learning Approaches in Streamflow Prediction",
        "authors": "Rana Muhammad Adnan Ikram, Leonardo Goliatt, Ozgur Kisi, Slavisa Trajkovic, Shamsuddin Shahid",
        "published": "2022-8-17",
        "citations": 24,
        "abstract": "Precise streamflow estimation plays a key role in optimal water resource use, reservoirs operations, and designing and planning future hydropower projects. Machine learning models were successfully utilized to estimate streamflow in recent years In this study, a new approach, covariance matrix adaptation evolution strategy (CMAES), was utilized to improve the accuracy of seven machine learning models, namely extreme learning machine (ELM), elastic net (EN), Gaussian processes regression (GPR), support vector regression (SVR), least square SVR (LSSVR), extreme gradient boosting (XGB), and radial basis function neural network (RBFNN), in predicting streamflow. The CMAES was used for proper tuning of control parameters of these selected machine learning models. Seven input combinations were decided to estimate streamflow based on previous lagged temperature and streamflow data values. For numerical prediction accuracy comparison of these machine learning models, six statistical indexes are used, i.e., relative root mean squared error (RRMSE), mean absolute error (MAE), mean absolute percentage error (MAPE), Nash–Sutcliffe efficiency (NSE), and the Kling–Gupta efficiency agreement index (KGE). In contrast, this study uses scatter plots, radar charts, and Taylor diagrams for graphically predicted accuracy comparison. Results show that SVR provided more accurate results than the other methods, especially for the temperature input cases. In contrast, in some streamflow input cases, the LSSVR and GPR were better than the SVR. The SVR tuned by CMAES with temperature and streamflow inputs produced the least RRMSE (0.266), MAE (263.44), and MAPE (12.44) in streamflow estimation. The EN method was found to be the worst model in streamflow prediction. Uncertainty analysis also endorsed the superiority of the SVR over other machine learning methods by having low uncertainty values. Overall, the SVR model based on either temperature or streamflow as inputs, tuned by CMAES, is highly recommended for streamflow estimation.",
        "link": "http://dx.doi.org/10.3390/math10162971"
    },
    {
        "id": 19498,
        "title": "Covariance matrix adaptation evolution strategy based optical phase control",
        "authors": "Hansol Kim, Yoonchan Jeong",
        "published": "2021-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/ell2.12174"
    },
    {
        "id": 19499,
        "title": "Brain Storm Algorithm Combined with Covariance Matrix Adaptation Evolution Strategy for Optimization",
        "authors": "Yang Yu, Lin Yang, Yirui Wang, Shangce Gao",
        "published": "2019",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-15070-9_6"
    },
    {
        "id": 19500,
        "title": "Hybrid Artificial Bee Colony with Covariance Matrix Adaptation Evolution Strategy for Economic Load Dispatch",
        "authors": "Xin Zhang, Yang Lou, Shiu Yin Yuen, Zhou Wu, Yaodong He, Xiu Zhang",
        "published": "2019-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2019.8790221"
    },
    {
        "id": 19501,
        "title": "A modified covariance matrix adaptation evolution strategy for real-world constrained optimization problems",
        "authors": "Abhishek Kumar, Swagatam Das, Ivan Zelinka",
        "published": "2020-7-8",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3377929.3398185"
    },
    {
        "id": 19502,
        "title": "Self-organizing migrating algorithm using covariance matrix adaptation evolution strategy for dynamic constrained optimization",
        "authors": "Lenka Skanderova, Tomas Fabian, Ivan Zelinka",
        "published": "2021-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.swevo.2021.100936"
    },
    {
        "id": 19503,
        "title": "A covariance matrix adaptation evolution strategy variant and its engineering application",
        "authors": "Yajun Liang, Xiaofei Wang, Hui Zhao, Tong Han, Zhenglei Wei, Yintong Li",
        "published": "2019-10",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2019.105680"
    },
    {
        "id": 19504,
        "title": "Zeroth-order covariance matrix adaptation evolution strategy for single objective bound constrained numerical optimization competition",
        "authors": "Yue Ning, Daohong Jian, Hua Wu, Jun Zhou",
        "published": "2022-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3520304.3534053"
    },
    {
        "id": 19505,
        "title": "A Reference Vector-Based Simplified Covariance Matrix Adaptation Evolution Strategy for Constrained Global Optimization",
        "authors": "Abhishek Kumar, Swagatam Das, Rammohan Mallipeddi",
        "published": "2022-5",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tcyb.2020.3013950"
    },
    {
        "id": 19506,
        "title": "Optimal design of wave barriers in dry and saturated poroelastic grounds using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Alireza Esmaeili Moghadam, Reza Rafiee-Dehkharghani",
        "published": "2021-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compgeo.2021.104015"
    },
    {
        "id": 19507,
        "title": "A scanner matching method based on covariance matrix adaptation evolution strategy",
        "authors": "Yuguang Chen, Sikun Li, Shaobo Hu, Guodong Chen, Ming Tang, Weijie Shi, Xiangzhao Wang",
        "published": "2021-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2605879"
    },
    {
        "id": 19508,
        "title": "Covariance matrix adaptation evolution strategy for topology optimization of foundations under static and dynamic loadings",
        "authors": "Sina Sadeghi, Farzaneh Abedini, Reza Rafiee-Dehkharghani, Karim Laknejadi",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compgeo.2021.104461"
    },
    {
        "id": 19509,
        "title": "Reliability Analysis via an Optimal Covariance Matrix Adaptation Evolution Strategy: Emphasis on Applications in Civil Engineering",
        "authors": "Ali Kaveh, Seyed Mohammad Javadi, Roya Mahdipour Moghanni",
        "published": "2020-4-17",
        "citations": 5,
        "abstract": "In this paper, a reliability-based optimization approach is applied using a recently proposed CMA-ES with optimal covariance update and storage complexity. Cholesky-CMA-ES gives a significant increase in optimization speed and reduces the runtime complexity of the standard CMA-ES. The reliability index is the shortest distance between the surface of Limit-State Function (LSF) and the origin of the standard normal space. Hence, finding the reliability index can be expressed as a constrained optimization problem. To verify the concept and test the feasibility of this algorithm, several numerical examples consisting of mathematical and highly nonlinear civil engineering problems are investigated. The reliability indexes obtained agree reasonably well with reported values from some existing approximation methods and Monte Carlo simulation.",
        "link": "http://dx.doi.org/10.3311/ppci.15793"
    },
    {
        "id": 19510,
        "title": "Gbest-Guided Covariance Matrix Adaptation Evolution Strategy for Large Scale Global Optimization",
        "authors": "Zhang Fuxing, Zhang Tao, Wang Rui",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-63309-1_1"
    },
    {
        "id": 19511,
        "title": "A covariance matrix adaptation evolution strategy in reproducing kernel Hilbert space",
        "authors": "Viet-Hung Dang, Ngo Anh Vien, TaeChoong Chung",
        "published": "2019-12",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10710-019-09357-1"
    },
    {
        "id": 19512,
        "title": "DC carpet cloak designed by topology optimization based on covariance matrix adaptation evolution strategy",
        "authors": "Garuda Fujii, Youhei Akimoto",
        "published": "2019-4-15",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1364/ol.44.002057"
    },
    {
        "id": 19513,
        "title": "Optimizing CMA-ES with CMA-ES",
        "authors": "André Thomaser, Marc-Eric Vogt, Thomas Bäck, Anna Kononova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012179400003595"
    },
    {
        "id": 19514,
        "title": "Improving the differential evolution strategy by coupling it with CMA-ES",
        "authors": "Eryk Warchulski, Jarosław Arabas, Rafał Biedrzycki",
        "published": "2022-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3520304.3529023"
    },
    {
        "id": 19515,
        "title": "CMA-ES with Learning Rate Adaptation: Can CMA-ES with Default Population Size Solve Multimodal and Noisy Problems?",
        "authors": "Masahiro Nomura, Youhei Akimoto, Isao Ono",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3583131.3590358"
    },
    {
        "id": 19516,
        "title": "Optimization of rotation patterns of a mangle-type magnetic field source using covariance matrix adaptation evolution strategy",
        "authors": "Hiroshi Sakuma, Takuto Nakagawara",
        "published": "2021-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jmmm.2021.167752"
    },
    {
        "id": 19517,
        "title": "Covariance matrix adaptation evolution strategy based on correlated evolution paths with application to reinforcement learning",
        "authors": "Oladayo S. Ajani, Abhishek Kumar, Rammohan Mallipeddi",
        "published": "2024-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123289"
    },
    {
        "id": 19518,
        "title": "Fuzzy cognitive maps learning algorithm based on modified covariance matrix adaptation evolution strategy",
        "authors": "Zhuofan Li, Jingping Wang, Yingjun Zhang, Hua Huang, Hui Yin, Hongli Xu",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2679055"
    },
    {
        "id": 19519,
        "title": "Radiation source reconstruction based on a covariance matrix adaptation evolution strategy and the adjoint flux and forward source inner product evaluation method",
        "authors": "M. Dion, L. Blomeley, D.D. Radford",
        "published": "2017-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.anucene.2016.09.010"
    },
    {
        "id": 19520,
        "title": "Groundwater parameter estimation using multiquadric-based meshfree simulation with covariance matrix adaptation evolution strategy optimization for a regional aquifer system",
        "authors": "Sharad Patel, T. I. Eldho, Ashok Kumar Rastogi, Avinoam Rabinovich",
        "published": "2022-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10040-022-02544-y"
    },
    {
        "id": 19521,
        "title": "A Covariance Matrix Self-Adaptation Evolution Strategy for Optimization Under Linear Constraints",
        "authors": "Patrick Spettel, Hans-Georg Beyer, Michael Hellwig",
        "published": "2019-6",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tevc.2018.2871944"
    },
    {
        "id": 19522,
        "title": "Inverse Profiling of Inhomogeneous Subsurface Targets With Arbitrary Cross Sections Using Covariance Matrix Adaptation Evolution Strategy",
        "authors": "Maryam Hajebi, Ahmad Hoorfar, Elie Bou-Daher, Ahad Tavakoli",
        "published": "2017-5",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/lgrs.2017.2665560"
    },
    {
        "id": 19523,
        "title": "Source mask optimization using the covariance matrix adaptation evolution strategy",
        "authors": "Guodong Chen, Sikun Li, Xiangzhao Wang",
        "published": "2020-10-26",
        "citations": 13,
        "abstract": "Source mask optimization (SMO) is one of the indispensable resolution enhancement techniques to guarantee the image fidelity and process robustness for the 2Xnm technology node and beyond. The optimization capacity and convergence efficiency of SMO are important, especially for full-chip SMO. An SMO method using the covariance matrix adaptation evolution strategy (CMA-ES), together with a new source representation method, is proposed in this paper. Based on the forward vector imaging formulation, the encoding and decoding methods of the source and the mask, and the constructed merit function, the source and the mask are optimized using the CMA-ES algorithm. The solution search space and the search step size are adaptively updated during the optimization procedure. Considering the sparsity of the optimal source, the source is represented by a set of ideal point sources with unit intensity and adjustable positions. The advantageous spatial frequency components of the source for imaging performance improvement are identified through the aggregation of the point sources. Simulations and comparisons verify the superior optimization capacity and convergence efficiency of the proposed method.",
        "link": "http://dx.doi.org/10.1364/oe.410032"
    },
    {
        "id": 19524,
        "title": "A Covariance Matrix Adaptation Evolution Strategy Based on Cooperative Co-Evolutionary Framework Using Delta Grouping for Large-Scale Dynamic Economic Dispatch",
        "authors": "Qun Niu, Likun Wang, Ming You",
        "published": "2020-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3426826.3426849"
    },
    {
        "id": 19525,
        "title": "An intelligent protection framework for intrusion detection in cloud environment based on covariance matrix self-adaptation evolution strategy and multi-criteria decision-making",
        "authors": "Mohamad Mulham Belal, Divya Meena Sundaram",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "The security defenses that are not comparable to sophisticated adversary tools, let the cloud as an open environment for attacks and intrusions. In this paper, an intelligent protection framework for intrusion detection in a cloud computing environment based on a covariance matrix self-adaptation evolution strategy (CMSA-ES) and multi-criteria decision-making (MCDM) is proposed. The proposed framework constructs an optimal intrusion detector by using CMSA-ES algorithm which adjusts the best parameter set for the attack detector. Moreover, the proposed framework uses a MEREC-VIKOR, a hybrid standardized evaluation technique. MEREC-VIKOR generates the own performance metrics (S, R, and Q) of the proposed framework which is a combination of multi-conflicting criteria. The proposed framework is evaluated for attack detection by using CICIDS 2017 dataset. The experiments show that the proposed framework can detect cloud attacks accurately with low S (utility), R (regret), and Q (integration between S and R). The proposed framework is analyzed with respect to several evolutionary algorithms such as GA, IGASAA, and CMA-ES. The performance analysis demonstrates that the proposed framework that depends on CMSA-ES converges faster than the other evolutionary algorithms such as GA, IGASAA, and CMA-ES. The outcomes also demonstrate that the proposed model is comparable to the state-of-the-art techniques.",
        "link": "http://dx.doi.org/10.3233/jifs-224135"
    },
    {
        "id": 19526,
        "title": "Diagonal Acceleration for Covariance Matrix Adaptation Evolution Strategies",
        "authors": "Y. Akimoto, N. Hansen",
        "published": "2020-9",
        "citations": 30,
        "abstract": " We introduce an acceleration for covariance matrix adaptation evolution strategies (CMA-ES) by means of adaptive diagonal decoding (dd-CMA). This diagonal acceleration endows the default CMA-ES with the advantages of separable CMA-ES without inheriting its drawbacks. Technically, we introduce a diagonal matrix [Formula: see text] that expresses coordinate-wise variances of the sampling distribution in DCD form. The diagonal matrix can learn a rescaling of the problem in the coordinates within a linear number of function evaluations. Diagonal decoding can also exploit separability of the problem, but, crucially, does not compromise the performance on nonseparable problems. The latter is accomplished by modulating the learning rate for the diagonal matrix based on the condition number of the underlying correlation matrix. dd-CMA-ES not only combines the advantages of default and separable CMA-ES, but may achieve overadditive speedup: it improves the performance, and even the scaling, of the better of default and separable CMA-ES on classes of nonseparable test functions that reflect, arguably, a landscape feature commonly observed in practice.  The article makes two further secondary contributions: we introduce two different approaches to guarantee positive definiteness of the covariance matrix with active CMA, which is valuable in particular with large population size; we revise the default parameter setting in CMA-ES, proposing accelerated settings in particular for large dimension.  All our contributions can be viewed as independent improvements of CMA-ES, yet they are also complementary and can be seamlessly combined. In numerical experiments with dd-CMA-ES up to dimension 5120, we observe remarkable improvements over the original covariance matrix adaptation on functions with coordinate-wise ill-conditioning. The improvement is observed also for large population sizes up to about dimension squared. ",
        "link": "http://dx.doi.org/10.1162/evco_a_00260"
    },
    {
        "id": 19527,
        "title": "Short-term solar radiation forecasting using hybrid deep residual learning and gated LSTM recurrent network with differential covariance matrix adaptation evolution strategy",
        "authors": "Mehdi Neshat, Meysam Majidi Nezhad, Seyedali Mirjalili, Davide Astiaso Garcia, Erik Dahlquist, Amir H. Gandomi",
        "published": "2023-9",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.127701"
    },
    {
        "id": 19528,
        "title": "CMA-ES and advanced adaptation mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2022-7-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3520304.3533648"
    },
    {
        "id": 19529,
        "title": "Topology-optimized thermal carpet cloak expressed by an immersed-boundary level-set method via a covariance matrix adaptation evolution strategy",
        "authors": "Garuda Fujii, Youhei Akimoto",
        "published": "2019-7",
        "citations": 53,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ijheatmasstransfer.2019.03.162"
    },
    {
        "id": 19530,
        "title": "CMA-ES and advanced adaptation mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2019-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3319619.3323390"
    },
    {
        "id": 19531,
        "title": "CMA-ES and advanced adaptation mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2021-7-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3449726.3462748"
    },
    {
        "id": 19532,
        "title": "CMA-ES and advanced adaptation mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2017-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3067695.3067698"
    },
    {
        "id": 19533,
        "title": "CMA-ES and advanced adaptation mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2018-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3205651.3207854"
    },
    {
        "id": 19534,
        "title": "Mirrored Orthogonal Sampling for Covariance Matrix Adaptation Evolution Strategies",
        "authors": "Hao Wang, Michael Emmerich, Thomas Bäck",
        "published": "2019-12",
        "citations": 9,
        "abstract": " Generating more evenly distributed samples in high dimensional search spaces is the major purpose of the recently proposed mirrored sampling technique for evolution strategies. The diversity of the mutation samples is enlarged and the convergence rate is therefore improved by the mirrored sampling. Motivated by the mirrored sampling technique, this article introduces a new derandomized sampling technique called mirrored orthogonal sampling. The performance of this new technique is both theoretically analyzed and empirically studied on the sphere function. In particular, the mirrored orthogonal sampling technique is applied to the well-known Covariance Matrix Adaptation Evolution Strategy (CMA-ES). The resulting algorithm is experimentally tested on the well-known Black-Box Optimization Benchmark (BBOB). By comparing the results from the benchmark, mirrored orthogonal sampling is found to outperform both the standard CMA-ES and its variant using mirrored sampling. ",
        "link": "http://dx.doi.org/10.1162/evco_a_00251"
    },
    {
        "id": 19535,
        "title": "Integrated Multi-Operator Differential Evolution Technique with Cma-Es for Solving Multi-Objective Optimization Problems",
        "authors": "Sakshi Aggarwal, Sarsij Tripathi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4384444"
    },
    {
        "id": 19536,
        "title": "CMA-ES and Advanced Adaptation Mechanisms",
        "authors": "Youhei Akimoto, Nikolaus Hansen",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3583133.3595054"
    },
    {
        "id": 19537,
        "title": "Matrix Adaptation Evolution Strategy with Multi-Objective Optimization for Multimodal Optimization",
        "authors": "Wei Li",
        "published": "2019-3-5",
        "citations": 3,
        "abstract": "The standard covariance matrix adaptation evolution strategy (CMA-ES) is highly effective at locating a single global optimum. However, it shows unsatisfactory performance for solving multimodal optimization problems (MMOPs). In this paper, an improved algorithm based on the MA-ES, which is called the matrix adaptation evolution strategy with multi-objective optimization algorithm, is proposed to solve multimodal optimization problems (MA-ESN-MO). Taking advantage of the multi-objective optimization in maintaining population diversity, MA-ESN-MO transforms an MMOP into a bi-objective optimization problem. The archive is employed to save better solutions for improving the convergence of the algorithm. Moreover, the peaks found by the algorithm can be maintained until the end of the run. Multiple subpopulations are used to explore and exploit in parallel to find multiple optimal solutions for the given problem. Experimental results on CEC2013 test problems show that the covariance matrix adaptation with Niching and the multi-objective optimization algorithm (CMA-NMO), CMA Niching with the Mahalanobis Metric and the multi-objective optimization algorithm (CMA-NMM-MO), and matrix adaptation evolution strategy Niching with the multi-objective optimization algorithm (MA-ESN-MO) have overall better performance compared with the covariance matrix adaptation evolution strategy (CMA-ES), matrix adaptation evolution strategy (MA-ES), CMA Niching (CMA-N), CMA-ES Niching with Mahalanobis Metric (CMA-NMM), and MA-ES-Niching (MA-ESN).",
        "link": "http://dx.doi.org/10.3390/a12030056"
    },
    {
        "id": 19538,
        "title": "Landscape analysis of gaussian process surrogates for the covariance matrix adaptation evolution strategy",
        "authors": "Zbyněk Pitra, Jakub Repický, Martin Holeňa",
        "published": "2019-7-13",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3321707.3321861"
    },
    {
        "id": 19539,
        "title": "Rotation patterns of a mangle-type magnetic field source optimized via covariance matrix adaptation evolution strategy with 3D finite element method",
        "authors": "Hiroshi Sakuma",
        "published": "2023-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jmmm.2022.170315"
    },
    {
        "id": 19540,
        "title": "A Matrix Adaptation Evolution Strategy for Constrained Real-Parameter Optimization",
        "authors": "Michael Hellwig, Hans-Georg Beyer",
        "published": "2018-7",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2018.8477950"
    },
    {
        "id": 19541,
        "title": "Ultrasonic fiber Bragg grating sensor placement optimization in structural health monitoring using\ncovariance matrix adaptation evolutionary strategy",
        "authors": "Rohan N. Soman, Wieslaw Ostachowicz",
        "published": "2021-3-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2582976"
    },
    {
        "id": 19542,
        "title": "Using Covariance Matrix Adaptation Evolution Strategies for solving different types of differential equations",
        "authors": "Jose M. Chaquet, Enrique J. Carmona",
        "published": "2019-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-017-2888-9"
    },
    {
        "id": 19543,
        "title": "Design of acoustic metamaterials using the covariance matrix adaptation evolutionary strategy",
        "authors": "Bei Huang, Qiang Cheng, Gang Yong Song, Tie Jun Cui",
        "published": "2017-3-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7567/apex.10.037301"
    },
    {
        "id": 19544,
        "title": "Solving large-scale many-objective optimization problems by covariance matrix adaptation evolution strategy with scalable small subpopulations",
        "authors": "Huangke Chen, Ran Cheng, Jinming Wen, Haifeng Li, Jian Weng",
        "published": "2020-1",
        "citations": 108,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ins.2018.10.007"
    },
    {
        "id": 19545,
        "title": "Covariance matrix adaptation evolution strategy based on ensemble of mutations for parking navigation and maneuver of autonomous vehicles",
        "authors": "Esther Tolulope Aboyeji, Oladayo S. Ajani, Rammohan Mallipeddi",
        "published": "2024-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123565"
    },
    {
        "id": 19546,
        "title": "An efficient rank-1 update for Cholesky CMA-ES using auxiliary evolution path",
        "authors": " Zhenhua Li,  Qingfu Zhang",
        "published": "2017-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2017.7969406"
    },
    {
        "id": 19547,
        "title": "A New Step-Size Adaptation Rule for CMA-ES Based on the Population Midpoint Fitness",
        "authors": "Eryk Warchulski, Jaroslaw Arabas",
        "published": "2021-6-28",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec45853.2021.9504829"
    },
    {
        "id": 19548,
        "title": "A Modified Matrix Adaptation Evolution Strategy with Restarts for Constrained Real-World Problems",
        "authors": "Michael Hellwig, Hans-Georg Beyer",
        "published": "2020-7",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec48606.2020.9185566"
    },
    {
        "id": 19549,
        "title": "Modeling and optimization of the extraction of ylang-ylang essential oils using surrogate models from simulated data, coupled with covariance matrix adaptation evolution strategy",
        "authors": "Alexander P Espinoza-Vasquez, Daniela Galatro, Yris Gonzalez, Wilfredo Angulo, Juan J Álava-Intriago, Patricia Manzano, Manuel Rodríguez Hernández",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jfoodeng.2023.111637"
    },
    {
        "id": 19550,
        "title": "A Covariance Matrix Adaptation Evolution Strategy-based Manta Ray Foraging optimization",
        "authors": "Qianqian Li, Tongyan Liu, Houtian He, Kaiyu Wang, Shangce Gao",
        "published": "2022-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/scisisis55246.2022.10001965"
    },
    {
        "id": 19551,
        "title": "Using Covariance Matrix Adaptation Evolutionary Strategy to boost the search accuracy in hierarchic memetic computations",
        "authors": "Jakub Sawicki, Marcin Łoś, Maciej Smołka, Julen Alvarez-Aramberri",
        "published": "2019-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jocs.2019.04.005"
    },
    {
        "id": 19552,
        "title": "A Matrix Adaptation Evolution Strategy Based Evolution Algorithm for Large-scale Many-objective Optimization",
        "authors": "Ling Yang, Jianchang Liu, Fei Li, Shubin Tan, Tianzi Zheng, Yuanchao Liu",
        "published": "2020-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccdc49329.2020.9164739"
    },
    {
        "id": 19553,
        "title": "Hybrid Cuckoo Search Algorithm with Covariance Matrix Adaption Evolution Strategy for Global optimisation Problem",
        "authors": "Minghao Yin, Xiangtao Li, Xin Zhang",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijbic.2017.10004358"
    },
    {
        "id": 19554,
        "title": "Covariance Matrix adaptation based on Opposition learning for multimodal optimization",
        "authors": "Wei Li, Qingzheng Xu",
        "published": "2019-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccdc.2019.8832455"
    },
    {
        "id": 19555,
        "title": "Benchmarking MO-CMA-ES and COMO-CMA-ES on the bi-objective bbob-biobj testbed",
        "authors": "Paul Dufossé, Cheikh Touré",
        "published": "2019-7-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3319619.3326892"
    },
    {
        "id": 19556,
        "title": "Self-adaptive CMA-ES Algorithm",
        "authors": "Yuliia Litvinchuk,  ",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "This article will consider one of the self-adaptive algorithms for selecting parameters of complex systems, examples of which are neural networks. Self-adaptive algorithms are algorithms that change their behavior at runtime based on available information and predetermined reward mechanisms. These algorithms are widely used in various fields, including machine learning, optimization, and data compression. The self-adaptiveness of the algorithm in this case will be based on the selection of the number of peaks in the mixture of distributions in the extended CMA-ES algorithm under the condition of a normal base distribution.  The work presents an improved self-adaptive CMA-ES algorithm, with an emphasis on the parameter that selects the number of pixels in a mixture of normal distributions. The algorithm takes into account the methods of setting this optimal value, which is used when choosing cluster numbers in the CURE, BIRCH, etc. clustering algorithms. It is obvious that the given justification of this approach can be extended to mixtures with a different base distribution, each of which is characterized by a skin number of peaks in the mixture distribution. This implies self-adaptability and applicability of the algorithm to a wider range of scenarios involving different distribution characteristics.  There is no doubt that the proposed sado-adaptive parameter setting algorithm, based on the CMA-ES algorithm, can be extended to other genetic and evolutionary algorithms that include the selection of additional chromosomes (individuals) during the transition between iteration epochs of the algorithm. Another feature of the proposed algorithm is the use of theoretical foundations of cluster analysis to estimate the number of peaks in the distribution of chromosomes. This approach is widely used in the latest self-adaptive algorithms for determining the initial parameters (hyperparameters) of complex systems",
        "link": "http://dx.doi.org/10.32626/2308-5878.2023-24.81-90"
    },
    {
        "id": 19557,
        "title": "CoMABO: Covariance Matrix Adaptation for Bayesian Optimization",
        "authors": "Hsiang-Yu Ku, Che-Rung Lee",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386873"
    },
    {
        "id": 19558,
        "title": "Covariance Matrix Adaptation Evolution Strategy for Convolutional Neural Network in Text Classification",
        "authors": "Orlando Grabiel Toledano-López, Julio Madera, Héctor González, Alfredo Simón Cuevas",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-89691-1_8"
    },
    {
        "id": 19559,
        "title": "Trajectory Correction of the Rocket for Aerodynamic Load Shedding Based on Deep Neural Network and the Chaotic Evolution Strategy With Covariance Matrix Adaptation",
        "authors": "Guanghui Cheng, Yudong Hu, Wuxing Jing, Ruoming An, Changsheng Gao",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/taes.2023.3331676"
    },
    {
        "id": 19560,
        "title": "Overview of surrogate-model versions of covariance matrix adaptation evolution strategy",
        "authors": "Zbyněk Pitra, Lukáš Bajer, Jakub Repický, Martin Holeňa",
        "published": "2017-7-15",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3067695.3082539"
    },
    {
        "id": 19561,
        "title": "Cross Entropy Covariance Matrix Adaptation Evolution Strategy for Solving the Bi-Level Bidding Optimization Problem in Local Energy Markets",
        "authors": "Dharmesh Dabhi, Kartik Pandya, Joao Soares, Fernando Lezama, Zita Vale",
        "published": "2022-7-1",
        "citations": 1,
        "abstract": "The increased penetration of renewables in power distribution networks has motivated significant interest in local energy systems. One of the main goals of local energy markets is to promote the participation of small consumers in energy transactions. Such transactions in local energy markets can be modeled as a bi-level optimization problem in which players (e.g., consumers, prosumers, or producers) at the upper level try to maximize their profits, whereas a market mechanism at the lower level maximizes the energy transacted. However, the strategic bidding in local energy markets is a complex NP-hard problem, due to its inherently nonlinear and discontinued characteristics. Thus, this article proposes the application of a hybridized Cross Entropy Covariance Matrix Adaptation Evolution Strategy (CE-CMAES) to tackle such a complex bi-level problem. The proposed CE-CMAES uses cross entropy for global exploration of search space and covariance matrix adaptation evolution strategy for local exploitation. The CE-CMAES prevents premature convergence while efficiently exploring the search space, thanks to its adaptive step-size mechanism. The performance of the algorithm is tested through simulation in a practical distribution system with renewable energy penetration. The comparative analysis shows that CE-CMAES achieves superior results concerning overall cost, mean fitness, and Ranking Index (i.e., a metric used in the competition for evaluation) compared with state-of-the-art algorithms. Wilcoxon Signed-Rank Statistical test is also applied, demonstrating that CE-CMAES results are statistically different and superior from the other tested algorithms.",
        "link": "http://dx.doi.org/10.3390/en15134838"
    },
    {
        "id": 19562,
        "title": "Hybrid cuckoo search algorithm with covariance matrix adaption evolution strategy for global optimisation problem",
        "authors": "Xin Zhang, Xiang tao Li, Ming hao Yin",
        "published": "2019",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijbic.2019.098403"
    },
    {
        "id": 19563,
        "title": "LSHADE with semi-parameter adaptation hybrid with CMA-ES for solving CEC 2017 benchmark problems",
        "authors": "Ali W. Mohamed, Anas A. Hadi, Anas M. Fattouh, Kamal M. Jambi",
        "published": "2017-6",
        "citations": 171,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2017.7969307"
    },
    {
        "id": 19564,
        "title": "On the steady state analysis of covariance matrix self-adaptation evolution strategies on the noisy ellipsoid model",
        "authors": "Michael Hellwig, Hans-Georg Beyer",
        "published": "2020-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.tcs.2018.05.016"
    },
    {
        "id": 19565,
        "title": "Covariance Matrix Adaptation for Multi-Agent Proximal Policy Optimization",
        "authors": "Yiou Shen, Xiang Gao, Zhiwei Liang",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10327347"
    },
    {
        "id": 19566,
        "title": "Data-driven adaptive predictive control of hydrocracking process using a covariance matrix adaption evolution strategy",
        "authors": "Zhongmei Li, Xinjie Wang, Wenli Du, Minglei Yang, Zhi Li, Peizhi Liao",
        "published": "2022-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.conengprac.2022.105222"
    },
    {
        "id": 19567,
        "title": "Application of optimal control theory based on the evolution strategy (CMA-ES) to automatic berthing (part: 2)",
        "authors": "Atsuo Maki, Youhei Akimoto, Umeda Naoya",
        "published": "2021-9",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00773-020-00774-x"
    },
    {
        "id": 19568,
        "title": "Enhanced Linearization Process Based on Modified Multi Objective Covariance Matrix Adapted Evolution Strategy",
        "authors": "J. Babitha Thangamalar, A Abudhahir",
        "published": "2018-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1166/jctn.2018.7172"
    },
    {
        "id": 19569,
        "title": "Load frequency and voltage control of two area interconnected power system using covariance matrix adaptation evolution strategy based Aquila optimization optimized fast fuzzy-fractional order tilt integral derivative controller",
        "authors": "Ananta Kumar Sahoo, Ashwin Kumar Sahoo, Smrutiranjan Nayak, Sanjeeb Kumar Kar",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.prime.2024.100488"
    },
    {
        "id": 19570,
        "title": "Effectiveness and mechanism of broaching-to prevention using global optimal control with evolution strategy (CMA-ES)",
        "authors": "Sreenath Maniyappan, Naoya Umeda, Atsuo Maki, Youhei Akimoto",
        "published": "2021-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00773-020-00743-4"
    }
]