[
    {
        "id": 22105,
        "title": "Embedding a Microblog Context in Ephemeral Queries for Document Retrieval",
        "authors": "Shilpa Sethi",
        "published": "2023-10-25",
        "citations": 1,
        "abstract": "With the proliferation of information globally, the search engine had become an indispensable tool that helps the user to search for information in a simple, easy and quick way. These search engines employ sophisticated document ranking algorithms based on query context, link structure and user behavior characterization. However, all these features keep changing in the real scenario. Ideally, ranking algorithms must be robust enough to time-sensitive queries. Microblog content is typically short-lived as it is often intended to provide quick updates or share brief information in a concise manner. The technique first determines if a query is currently in high demand, then it automatically appends a time-sensitive context to the query by mining those microblogs whose torrent matches with query-in-demand. The extracted contextual terms are further used in re-ranking the search results. The experimental results reveal the existence of a strong correlation between ephemeral search queries and microblog volumes. These volumes are analyzed to identify the temporal proximity of their torrents. It is observed that approximately 70% of search torrents occurred one day before or after blog torrents for lower threshold values. When the threshold is increased, the match ratio of torrent is raised to ∼90%. In addition, the performance of the proposed model is analyzed for different combining principles namely, aggregate relevance (AR) and disjunctive relevance (DR). It is found that the DR variant of the proposed model outperforms the AR variant of the proposed model in terms of relevance and interest scores. Further, the proposed model’s performance is compared with three categories of retrieval models: log-logistic model, sequential dependence model (SDM) and embedding based query expansion model (EQE1). The experimental results reveal the effectiveness of the proposed technique in terms of result relevancy and user satisfaction. There is a significant improvement of ∼25% in the result relevance score and ∼35% in the user satisfaction score compared to underlying retrieval models. The work can be expanded in many directions in the future as various researchers can combine these strategies to build a recommendation system, auto query reformulation system, Chatbot, and NLP professional toolkit.",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/jwe1540-9589.2245"
    },
    {
        "id": 22106,
        "title": "Predicting Personalized Textual Reviews via Collaborative Filtering using Document Embedding",
        "authors": "Young Park, Harika Bollam",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581754.3584147"
    },
    {
        "id": 22107,
        "title": "Word Embedding of Dimensionality Reduction for Document Clustering",
        "authors": "Pengyu Zhu, Qi Lang, Xiaodong Liu",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10327354"
    },
    {
        "id": 22108,
        "title": "A Novel Approach to Text Summarization of Document using BERT Embedding",
        "authors": "Kumkum S. Adwani, P. P. Shelke",
        "published": "2023-1-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaect57570.2023.10117938"
    },
    {
        "id": 22109,
        "title": "Enhancing Large Document Organization Through Effective Preprocessing and Data Embedding",
        "authors": "Aniruddha Shrikhande, Saachi Shrikhande, Siddhesh Borse, Jyoti Madake, Shripad Bhatlawande",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvmi59935.2023.10465040"
    },
    {
        "id": 22110,
        "title": "Reversible data hiding in JPEG document images based on zero coefficients embedding",
        "authors": "Xiaolin Yin, Shaowu Wu, Bing Chen, Ke Wang, Wei Lu",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2022.108917"
    },
    {
        "id": 22111,
        "title": "Visualization of topic transitions in SNSs through document embedding and dimensionality reduction",
        "authors": "Tiandong Xiao, Naoya Oda, Yosuke Onoue",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12650-023-00936-0"
    },
    {
        "id": 22112,
        "title": "Beyond Layout Embedding: Layout Attention with Gaussian Biases for Structured Document Understanding",
        "authors": "Xi Zhu, Xue Han, Shuyuan Peng, Shuo Lei, Chao Deng, Junlan Feng",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.521"
    },
    {
        "id": 22113,
        "title": "Hybrid Entropy-based Weighted Graph Embedding Model for Multi-Document Text Summarization",
        "authors": "Samina Mulla, Nuzhat F. Shaikh",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i-smac58438.2023.10290709"
    },
    {
        "id": 22114,
        "title": "Topic sentiment analysis based on deep neural network using document embedding technique",
        "authors": "Azam Seilsepour, Reza Ravanmehr, Ramin Nassiri",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05423-9"
    },
    {
        "id": 22115,
        "title": "A Multi Document Summarization of Learning Materials using Bigram Embedding Technique and Integer Linear Programming",
        "authors": "Sakkaravarthy Iyyappan K, Balasundaram SR",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "In the present era of the Internet, teachers and learners are heavily inclined to use e-learning systems for an efficient learning process. Due to the proliferation of educational text contents in these e-learning systems, the need for incorporating advanced text analysis tools and techniques are becoming inevitable. Multi Document Summarization (MDS) is a technique for producing concise summaries from a collection of related text documents. The usage of MDS in the context of e-learning is more promising for providing summaries for learning materials which helps students and teachers to focus on key concepts of the learning materials. In this paper a semantic approach towards the learning material summarization is proposed based on bigram embedding and ILP technique. This approach considers bigram as the basic meaningful semantic unit of the sentences to understand and summarize documents. Embedding techniques are employed to learn the vector representation of phrases to semantically identify similar phrases to reduce the redundancy and improving coherence. Using ILP technique, the summaries were generated by selecting important sentences while reducing the redundancy using phrase vectors. Experimental results on newly created educational dataset (EduSumm) shows better performance compared to the baseline systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15379/ijmst.v10i2.3149"
    },
    {
        "id": 22116,
        "title": "Design Pattern Recommendation Using Doc2vec",
        "authors": "Nada Shorim, Mohammad El-Ramly, Hanaa Mobarz",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicis58388.2023.10391121"
    },
    {
        "id": 22117,
        "title": "HWNet v3: a joint embedding framework for recognition and retrieval of handwritten text",
        "authors": "Praveen Krishnan, Kartik Dutta, C. V. Jawahar",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-022-00423-6"
    },
    {
        "id": 22118,
        "title": "A Method for Selecting Training Data Using Doc2Vec for Automatic Test Cases Generation",
        "authors": "Yuto Fujita, Kiyoshi Ueda",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444275"
    },
    {
        "id": 22119,
        "title": "An integer linear programming model for multi document summarization of learning materials using phrase embedding technique",
        "authors": "K. Sakkaravarthy Iyyappan, S. R. Balasundaram",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13198-024-02299-7"
    },
    {
        "id": 22120,
        "title": "Software Vulnerability Detection via Doc2vec with path representations",
        "authors": "Tong Wan, Lu Lu, Hao Xu, Quanyi Zou",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qrs-c60940.2023.00078"
    },
    {
        "id": 22121,
        "title": "Processing-in-Memory Development Strategy for AI Computing Using Main-Path and Doc2Vec Analyses",
        "authors": "Euiyoung Chung, So Young Sohn",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "Processing-in-Memory (PiM), which combines a memory device with a Processing Unit (PU) into an integrated chip, has drawn special attention in the field of Artificial Intelligence semiconductors. Currently, in the development and commercialization of PiM’s technology, there are challenges in the hegemony competition between the PU and memory device industries. In addition, there are challenges in finding strategic partnerships rather than independent development due to the complexity of technological development caused by heterogeneous chips. In this study, patent Main Path Analysis (MPA) is used to identify the majority and complementary groups between PU and memory devices for PiM. Subsequently, Document-to-Vector (Doc2Vec) and similarity-scoring analyses are used to determine the potential partners for technical cooperation required for PiM technology development for the majority group identified. According to the empirical results, PiM core technology is evolving from PU to memory device with an ‘architecture-operation-architecture’ design pattern. The ten ASIC candidates are identified for strategic partnerships with memory device suppliers. Those partnership candidates include several mobile AP firms, implying PiM’s opportunities in the field of mobile applications. It suggests that memory device suppliers should prepare for different technology strategies for PiM technology development. This study contributes to the literature and high-tech industry via the proposed quantitative technology partnership model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su151612439"
    },
    {
        "id": 22122,
        "title": "Automatic Text-to-sound Generation by Doc2Vec",
        "authors": "Kakeru Iwamoto, Hironori Uchida, Yujie Li, Yoshihisa Nakatoh",
        "published": "2023",
        "citations": 0,
        "abstract": "Nowadays, the market size for games and video viewing services has been\n                        expanding. The demand for sound effects to produce content using these\n                        services is also rising. However, sound-effect production often requires\n                        expensive software or hardware, exceptional equipment use, and experience.\n                        Therefore, this study aims to reduce the cost of sound effects production\n                        and enable the output of sound effects as imagined. It examines a method for\n                        automatically generating sound effects based on text input using Doc2Vec.\n                        The Natural Language Processing Model (NLP) calculates the similarity\n                        between the input text and the labels in the dataset. The Natural Language\n                        Processing Model (NLP) is created by Doc2Vec pre-loading sound-related\n                        language expressions (labels). The model is pre-trained using labels from\n                        VGG-Sound data. The calculated highly similar sounds are downloaded from\n                        VGG-Sound, a specified number of sound datasets. The data downloaded from\n                        highly similar data is synthesized in similarity order, and the audio is\n                        output.Furthermore, we verify the correlation between the sentences used in\n                        the proposed method and the generated sound effects. We conducted an\n                        experiment in which we presented the generated sounds and the sentences used\n                        to create them and had the participants rate them on a 5-point scale. The\n                        sentences used for a generation are those that live in the dataset, those\n                        that lived in a small number in the data set, those that did not exist in\n                        the data collection, those to which information such as location or scene\n                        has been added, and those that contain multiple events. The results show\n                        that the more speech in the dataset, the higher the rating and that\n                        sentences with added information or numerous events produce lower ratings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1004033"
    },
    {
        "id": 22123,
        "title": "The Impact of Applying Different Pre-Processing Techniques on Swahili Textual Data Using Doc2Vec",
        "authors": "Bernard Masua, Noel Masasi, Hellen Maziku, Betty Mbwilo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55060/j.nlpre.230606.001"
    },
    {
        "id": 22124,
        "title": "It’s All in the Embedding! Fake News Detection Using Document Embeddings",
        "authors": "Ciprian-Octavian Truică, Elena-Simona Apostol",
        "published": "2023-1-18",
        "citations": 12,
        "abstract": "With the current shift in the mass media landscape from journalistic rigor to social media, personalized social media is becoming the new norm. Although the digitalization progress of the media brings many advantages, it also increases the risk of spreading disinformation, misinformation, and malformation through the use of fake news. The emergence of this harmful phenomenon has managed to polarize society and manipulate public opinion on particular topics, e.g., elections, vaccinations, etc. Such information propagated on social media can distort public perceptions and generate social unrest while lacking the rigor of traditional journalism. Natural Language Processing and Machine Learning techniques are essential for developing efficient tools that can detect fake news. Models that use the context of textual data are essential for resolving the fake news detection problem, as they manage to encode linguistic features within the vector representation of words. In this paper, we propose a new approach that uses document embeddings to build multiple models that accurately label news articles as reliable or fake. We also present a benchmark on different architectures that detect fake news using binary or multi-labeled classification. We evaluated the models on five large news corpora using accuracy, precision, and recall. We obtained better results than more complex state-of-the-art Deep Neural Network models. We observe that the most important factor for obtaining high accuracy is the document encoding, not the classification model's complexity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11030508"
    },
    {
        "id": 22125,
        "title": "Document theory and document design",
        "authors": "Arthur Perret",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "This paper reports on an experiment which connects document design with document theory. Document design is about what documents should do. We use the example of document graphs and of Cosma, a visualization program created during the HyperOtlet research programme, to show how theory can inform design decisions and help conceptualize results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35492/docam/10/2/6"
    },
    {
        "id": 22126,
        "title": "Experimental Document Analysis—an analytical framework for document design",
        "authors": "Niels Lund",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "In this paper I will present an analytical framework for future documents, an experimental document analysis providing support for document design. The American economist, Herbert A. Simon outlined how to design an artificial object in his work \"The Sciences of the Artificial\" (1969, 1996) and described how this can be done in a systematic way, by a science of design. Simon describes the design process as a matter of finding possible alternatives among the potential optimal alternatives and finding a satisficing solution, by which he means a solution in-between satisfactory solutions and optimal solutions which can work in real life, expressing a rationality bounded by the conditions given by the environment. I will illustrate the experimental document analysis by an historical example of a pasticcio opera in the 18th century, Dido Abbandonata by P. Metastastio and multiple composers. I will discuss how this kind of document analysis may open for a comparative approach in documentation research in general.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35492/docam/10/2/1"
    },
    {
        "id": 22127,
        "title": "SSCDV: Social media document embedding with sentiment and topics for financial market forecasting",
        "authors": "Kentaro Ueda, Hirohiko Suwa, Masaki Yamada, Yuki Ogawa, Eiichi Umehara, Tatsuo Yamashita, Kota Tsubouchi, Keiichi Yasumoto",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122988"
    },
    {
        "id": 22128,
        "title": "SLDT: Sequential Latent Document Transformer for Multilingual Document-based Dialogue",
        "authors": "Zhanyu Ma, Zeming Liu, Jian Ye",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.dialdoc-1.7"
    },
    {
        "id": 22129,
        "title": "Improving Bilingual TTS Using Language And Phonology Embedding With Embedding Strength Modulator",
        "authors": "Fengyu Yang, Jian Luan, Meng Meng, Yujun Wang",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-709"
    },
    {
        "id": 22130,
        "title": "BLOCKCHAIN TECHNOLOGY AS A DOCUMENT MANAGEMENT AND ELECTRONIC DOCUMENT MANAGEMENT SYSTEM TOOL",
        "authors": "S.Sh. Muminova,  ",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "This article discusses the basic concepts in the field of blockchain technology, analyzes various types of blockchain and consensus algorithms. The advantages and disadvantages of various technologies are considered, their preferred areas of application are determined. It is shown how, based on the analysis, the types of blockchain and the consensus algorithm were selected, which are the most suitable for the implementation of an electronic document management system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37547/ajast/volume03issue05-12"
    },
    {
        "id": 22131,
        "title": "Text Vectorization Techniques for Trending Topic Clustering on Twitter: A Comparative Evaluation of TF-IDF, Doc2Vec, and Sentence-BERT",
        "authors": "Alvian Daniel Susanto, Steven Andrian Pradita, Caroline Stryadhi, Karli Eka Setiawan, Muhammad Fikri Hasani",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoris60118.2023.10352228"
    },
    {
        "id": 22132,
        "title": "Document AI: A Comparative Study of Transformer-Based, Graph-Based Models, and Convolutional Neural Networks for Document Layout Analysis",
        "authors": "",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Document AI aims to automatically analyze documents by leveraging natural language processing and computer vision techniques. One of the major tasks of Document AI is document layout analysis, which structures document pages by interpreting the content and spatial relationships of layout, image, and text. This task can be image-centric, wherein the aim is to identify and label various regions such as authors and paragraphs, or text-centric, where the focus is on classifying individual words in a document. Although there are increasingly sophisticated methods for improving layout analysis, doubts remain about the extent to which their findings can be generalized to a broader context. Specifically, prior work developed systems based on very different architectures, such as transformer-based, graph-based, and CNNs. However, no work has mentioned the effectiveness of these models in a comparative analysis. Moreover, while language-independent Document AI models capable of knowledge transfer have been developed, it remains to be investigated to what degree they can effectively transfer knowledge. In this study, we aim to fill these gaps by conducting a comparative evaluation of state-of-the-art models in document layout analysis and investigating the potential of cross-lingual layout analysis by utilizing machine translation techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.17"
    },
    {
        "id": 22133,
        "title": "Session details: Visual Document Analysis",
        "authors": "Melissa Cote",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3614004"
    },
    {
        "id": 22134,
        "title": "Session details: Document Content Analysis",
        "authors": "Charlotte Curtis",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3614007"
    },
    {
        "id": 22135,
        "title": "Modifier Embedding for Temporal Knowledge Graph Embedding",
        "authors": "Runfeng Wang, Tongyan Li, Fei Luo, Rong Fu",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jcice59059.2023.00040"
    },
    {
        "id": 22136,
        "title": "A document format for sewing patterns",
        "authors": "Charlotte Curtis",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3609353"
    },
    {
        "id": 22137,
        "title": "Session details: Document Recognition, Summarisation and Inference",
        "authors": "Peter King",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3614003"
    },
    {
        "id": 22138,
        "title": "Experimental Application of Semantic Segmentation Models Fine-Tuned with Synthesized Document Images to Text Line Segmentation in a Handwritten Japanese Historical Document",
        "authors": "Sayaka Mori, Tetsuya Suzuki",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012433100003654"
    },
    {
        "id": 22139,
        "title": "Session details: Document Modelling, Management and Representation",
        "authors": "Ethan Munson",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3614002"
    },
    {
        "id": 22140,
        "title": "Performance analysis of using multimodal embedding and word embedding transferred to sentiment classification",
        "authors": "Zhuo Zou",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Multimodal machine learning is one of artificial intelligence's most important research topics. Contrastive Language-Image Pretraining (CLIP) is one of the applications of multimodal machine Learning and is well applied to computer vision. However, there is a research gap in applying CLIP in natural language processing. Therefore, based on IMDB, this paper applies the multimodal features of CLIP and three other pre-trained word vectors, Glove, Word2vec, and BERT, to compare their effects on sentiment classification of natural language processing, to test the performance of CLIP multimodal feature tuning in natural language processing. The results show that the multimodal feature of CLIP does not produce a significant effect on sentiment classification, and other multimodal features gain better effects. The highest accuracy is produced by BERT, and the Word embedding of CLIP is the lowest of the four accuracies of word embedding. At the same time, glove and word2vec are relatively close. The reason may be that the pre-trained CLIP model learns SOTA image representations from pictures and their descriptions, which is unsuitable for sentiment classification tasks. The specific reason remains untested.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/5/20230610"
    },
    {
        "id": 22141,
        "title": "Binary Classification of Spinal Cord Injury Patients’ EEG Data Based on the Local Linear Embedding and Spectral Embedding Methods",
        "authors": "Hezzal Kucukselbes, Ebru Sayilgan",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tiptekno59875.2023.10359212"
    },
    {
        "id": 22142,
        "title": "Research on Chinese Audio and Text Alignment Algorithm Based on AIC-FCM and Doc2Vec",
        "authors": "Keliang Chen, Jianming Huang, Yansong Cui, Weizheng Ren",
        "published": "2023-3-31",
        "citations": 2,
        "abstract": "‘‘Audiobook” is a multimedia-based reading technology that has emerged in recent years. Realizing the alignment of e-book text and book audio is the most important part of its processing. This article describes an audio and text alignment algorithm using deep learning and neural network technology to improve the efficiency and quality of audiobook production. The algorithm first uses dual-threshold endpoint detection technology to segment long audio into short audio with sentence dimensions and recognizes it as short text. The threshold is calculated by AIC-FCM optimized based on simulated annealing genetic algorithm. Then the algorithm uses Doc2vec optimized by the threshold prediction method based on the average length of the short text to calculate the text similarity. Finally, proofread and output the text sequence and audio segment aligned in the time dimension to meet the needs of audiobook production. Experiments show that compared to traditional audio and text alignment algorithms, the proposed algorithm is closer to the ideal segmentation result in long audio segmentation, and the alignment effect is basically the same as Doc2vec and the time complexity is reduced by about 35%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3532852"
    },
    {
        "id": 22143,
        "title": "Adaptive dewarping of severely warped camera-captured document images based on document map generation",
        "authors": "C. H. Nachappa, N. Shobha Rani, Peeta Basa Pati, M. Gokulnath",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-022-00425-4"
    },
    {
        "id": 22144,
        "title": "Exploiting Patent Documents for Cross-Domain Knowledge Transfer in Innovative Engineering Design: A Doc2Vec-GAT-Based Approach",
        "authors": "Mingrui Li, Zuoxu Wang, Zhijie Yan, Jihong Liu",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/case56687.2023.10260662"
    },
    {
        "id": 22145,
        "title": "Source-Code Embedding-Based Software Defect Prediction",
        "authors": "Diana-Lucia Miholca, Zsuzsanna Oneţ-Marian",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012129600003538"
    },
    {
        "id": 22146,
        "title": "Analyzing Embedding Models for Embedding Vectors in Vector Databases",
        "authors": "Paras Nath Singh, Sreya Talasila, Shivaraj Veerappa Banakar",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10455990"
    },
    {
        "id": 22147,
        "title": "Document Productivity Cycle (Study case of Samudera Raksa Ship Museum)",
        "authors": "Ciwuk Musiana Yudhawasthi",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "The study aims to discuss document productivity in the case of the Samudera Raksa Ship Museum. To answer this, the researchers made a productivity document study based on (1) Blasius Sudarsono's axiom, which states that \"In the beginning, it was the human will to express what he thought and/or felt;\" (2) Sudarsono's thoughts regarding documents as processes and products; (3) Lund’s concept of document creation; (4) Sabine Roux's thoughts on the rhizome concept in the document productivity process; and (5) the concept of museum communication by Yudhawasthi. Based on these theoretical frameworks, an analysis of the document productivity in the case of the Samudra Raksa Ship Museum is outlined with the formulation of research questions: (1) Is the document productivity a cycle? (2) How is the document productivity cycle in the case of the Samudra Raksa Ship Museum? This research was a qualitative study and research data were obtained through an in-depth interview process with three research informants, literature search, and field observation. The informants are (1) curator of the Samudera Raksa Ship Museum and Borobudur Temple area management, (2) the leader of Digital Technology Development of the Samudera Raksa Ship Museum, and (3) a former crew of the Samudera Raksa Ship. From the mapping, the researcher found the dimensions that reflect a cycle: 1. document creation stage where knowledge, the object/message/document as well as the media and technology are used to produce. 2. The product produced does not stop as a work, but humans can continue to interpret and reinterpret it, thereby producing knowledge and/or knowledge. Then, 3. returning to the initial cycle, namely creation, which drives the next creation process. 4. All of these steps involve communication and documentation 5. All of the processes are human brain simulations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35492/docam/10/2/13"
    },
    {
        "id": 22148,
        "title": "Abelian varieties with prescribed embedding and full embedding degrees",
        "authors": "Steve Thakur",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jnt.2023.06.009"
    },
    {
        "id": 22149,
        "title": "What Is a Lesbian Document? Platforming Archival Description, Documents, and History in Sweden",
        "authors": "Rachel Pierce",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "As Joanna Drucker (2014) convincingly argues, “Most information visualizations are acts of interpretation masquerading as presentation\" (p. 10). This article investigates the visuality and built-in argumentations of the Alvin interface for digitized Swedish cultural heritage, focusing on how the platform defines a document and the effects this definition has on the accessibility and interconnectedness of documents related to lesbian and feminist histories. This paper addresses how (failed) systematization and an emphasis on large quantities of documents and metadata breathes new life into outdated historiographies and renders documents and information related to feminist and lesbian histories and connections between these histories invisible. In doing so, platforms reinstitute divisions and stereotypes about feminist and lesbian history criticized by Adrienne Rich in her seminal essay “Compulsory Heterosexuality and Lesbian Existence.” Platform designers must begin to take seriously queer and feminist researchers' emphasis on context and the need to build flexibility, interconnectivity across private/public boundaries, fuzziness, and incompleteness into cultural heritage platforms from the outset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35492/docam/10/2/10"
    },
    {
        "id": 22150,
        "title": "Automatically Inferring the Document Class of a Scientific Article",
        "authors": "Antoine Gauquier, Pierre Senellart",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3604894"
    },
    {
        "id": 22151,
        "title": "Neural embedding: learning the embedding of the manifold of physics data",
        "authors": "Sang Eon Park, Philip Harris, Bryan Ostdiek",
        "published": "2023-7-12",
        "citations": 2,
        "abstract": "Abstract\nIn this paper, we present a method of embedding physics data manifolds with metric structure into lower dimensional spaces with simpler metrics, such as Euclidean and Hyperbolic spaces. We then demonstrate that it can be a powerful step in the data analysis pipeline for many applications. Using progressively more realistic simulated collisions at the Large Hadron Collider, we show that this embedding approach learns the underlying latent structure. With the notion of volume in Euclidean spaces, we provide for the first time a viable solution to quantifying the true search capability of model agnostic search algorithms in collider physics (i.e. anomaly detection). Finally, we discuss how the ideas presented in this paper can be employed to solve many practical challenges that require the extraction of physically meaningful representations from information in complex high dimensional datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/jhep07(2023)108"
    },
    {
        "id": 22152,
        "title": "Sentence Embedding Leaks More Information than You Expect: Generative Embedding Inversion Attack to Recover the Whole Sentence",
        "authors": "Haoran Li, Mingshi Xu, Yangqiu Song",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.881"
    },
    {
        "id": 22153,
        "title": "Forensic Document Examination Using Image Processing Tools",
        "authors": "Shivam Chourasiya",
        "published": "2023",
        "citations": 0,
        "abstract": "Paper documents have always been our primary means of transmitting and storing information. However, for better storage and processing, the majority of records are currently only available in electronic format. As a result of digitization, the field of forensic document analysis has improved and evolved to keep up with the times, as it has become relatively easy for anyone to change any type of document using various image modification tools. The current study focuses to examine documents that have been manipulated by computers using open-source image processing tools. Forensically beta, FotoForensics, and Adobe Photoshop tools were used to analyze the sample documents that had been altered. The results suggest that these image processing tools can be used to analyze digitally modified documents to detect manipulations and thus can help Forensic document examiners. The present work reveals that some minute characteristics are present in the transplanted documents which can be identified by careful analysis of soft copies of documents with tools present in Forensically beta, FotoForensics, and Adobe Photoshop.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/ijfsc-16000292"
    },
    {
        "id": 22154,
        "title": "Ecological functions of the document in art and design: diplomatic-documents in artistics inquiries",
        "authors": "Yann Aucompte",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "A certain ecologist art form has been on the rise for the past twenty years. Those artworks include documents. The analysis will take two examples : Tale as Tool, and Chroniques de l’accueil. The use of documents doesn't deal with representation, as it used to be in art, but with inquiries. The ecological art tries to trigger testimonies and transformations of the common representation of nature. They don’t use documents as a trace but for their diplomatic capabilities. The document doesn’t record events or facts but it changes the situation. The ecological artists come with this paradoxical art stance : recording the existing state of social relation to transform it.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35492/docam/10/2/4"
    },
    {
        "id": 22155,
        "title": "Fault text classification of on-board equipment in high-speed railway based on labeled-Doc2vec and BiGRU",
        "authors": "Wei Wei, Xiaoqiang Zhao",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jrtpm.2023.100372"
    },
    {
        "id": 22156,
        "title": "Geometry of universal embedding spaces for almost complex manifolds",
        "authors": "Gabriella Clemente",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5817/am2024-1-35"
    },
    {
        "id": 22157,
        "title": "Learning knowledge graph embedding with a dual-attention embedding network",
        "authors": "Haichuan Fang, Youwei Wang, Zhen Tian, Yangdong Ye",
        "published": "2023-2",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118806"
    },
    {
        "id": 22158,
        "title": "Exploration of multilingual prompts in document-grounded dialogue",
        "authors": "Xiaocheng Zhang, Huang Qing, Fu Lin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.dialdoc-1.3"
    },
    {
        "id": 22159,
        "title": "Test Document",
        "authors": "O. K. Tester",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Abstract\nThis is a test document only.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/123456-ms-test"
    },
    {
        "id": 22160,
        "title": "Attribute-based document image retrieval",
        "authors": "Melissa Cote, Alexandra Branzan Albu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00447-6"
    },
    {
        "id": 22161,
        "title": "Multi-document reading comprehension model based on electra and document sliding window",
        "authors": "Zheyu Yang, Benkui Zhang, Nan Jiang",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3014619"
    },
    {
        "id": 22162,
        "title": "Enhancing Target Document Search in CopyCatch: A Focus on Thai and English document",
        "authors": "Supon Klaithin, Sawit Kasuriya",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354947"
    },
    {
        "id": 22163,
        "title": "Versatile Bengali OCR: Document Analysis Technique for Varied Document Styles and Content",
        "authors": "Akm Shahariar Azad Rabby, Hasmot Ali, Md. Majedul Islam, Fuad Rahman",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386582"
    },
    {
        "id": 22164,
        "title": "Embedding-Enhanced Similarity Metrics for Next POI Recommendation",
        "authors": "Sara Jarrad, Hubert Naacke, Stephane Gancarski, Modou Gueye",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012060300003541"
    },
    {
        "id": 22165,
        "title": "Derivation of the ghost Gutzwiller approximation from quantum embedding principles: Ghost density matrix embedding theory",
        "authors": "Nicola Lanatà",
        "published": "2023-12-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevb.108.235112"
    },
    {
        "id": 22166,
        "title": "AI-powered Resume-Job matching",
        "authors": "Sima Rezaeipourfarsangi, Evangelos E. Milios",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3609347"
    },
    {
        "id": 22167,
        "title": "Exploiting Label Dependencies for Multi-Label Document Classification Using Transformers",
        "authors": "Haytame Fallah, Emmanuel Bruno, Patrice Bellot, Elisabeth Murisasco",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3609356"
    },
    {
        "id": 22168,
        "title": "Disaster-news datasets for multi-label document classification, sentence classification, and abstractive document summarization tasks",
        "authors": "Sumanta Banerjee, Shyamapada Mukherjee, Sivaji Bandyopadhyay",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wispnet57748.2023.10134469"
    },
    {
        "id": 22169,
        "title": "Retracted: BRFP: An Efficient and Universal Sentence Embedding Learning Model Method Supporting Fused Syntax Combined with Graph Embedding Representation Algorithm",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9898423"
    },
    {
        "id": 22170,
        "title": "Integrating subsystem embedding subalgebras and coupled cluster Green’s function: a theoretical foundation for quantum embedding in excitation manifold",
        "authors": "Bo Peng, Karol Kowalski",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nIn this study, we introduce a novel approach to coupled-cluster Green’s function (CCGF) embedding by seamlessly integrating conventional CCGF theory with the state-of-the-art sub-system embedding sub-algebras coupled cluster (SES-CC) formalism. This integration focuses primarily on delineating the characteristics of the sub-system and the corresponding segments of the Green’s function, defined explicitly by active orbitals. Crucially, our work involves the adaptation of the SES-CC paradigm, addressing the left eigenvalue problem through a distinct form of Hamiltonian similarity transformation. This advancement not only facilitates a comprehensive representation of the interaction between the embedded sub-system and its surrounding environment but also paves the way for the quantum mechanical description of multiple embedded domains, particularly by employing the emergent quantum flow algorithms. Our theoretical underpinnings further set the stage for a generalization to multiple embedded sub-systems. This expansion holds significant promise for the exploration and application of non-equilibrium quantum systems, enhancing the understanding of system–environment interactions. In doing so, the research underscores the potential of SES-CC embedding within the realm of quantum computations and multi-scale simulations, promising a good balance between accuracy and computational efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2516-1075/ad1e3b"
    },
    {
        "id": 22171,
        "title": "FastPacket: Towards Pre-trained Packets Embedding based on FastText for nextgeneration NIDS",
        "authors": "",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "New Attacks are increasingly used by attackers everyday but many of them are not detected by Intrusion Detection Systems as most IDS ignore raw packet information and only care about some basic statistical information extracted from PCAP files. Using networking programs to extract fixed statistical features from packets is good, but may not enough to detect nowadays challenges. We think that it is time to utilize big data and deep learning for automatic dynamic feature extraction from packets. It is time to get inspired by deep learning pre-trained models in computer vision and natural language processing, so security deep learning solutions will have its pre-trained models on big datasets to be used in future researches. In this paper, we proposed a new approach for embedding packets based on character-level embeddings, inspired by FastText success on text data. We called this approach FastPacket. Results are measured on subsets of CIC-IDS-2017 dataset, but we expect promising results on big data pre-trained models. We suggest building pre-trained FastPacket on MAWI big dataset and make it available to community, similar to FastText. To be able to outperform currently used NIDS, to start a new era of packet-level NIDS that can better detect complex attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jctcsr.02.01.07"
    },
    {
        "id": 22172,
        "title": "CSE: Surface Anomaly Detection with Contrastively Selected Embedding",
        "authors": "Simon Thomine, Hichem Snoussi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012546700003660"
    },
    {
        "id": 22173,
        "title": "Embedding and fractional embedding of Bergman-type spaces in the Schatten class",
        "authors": "Wenwan Yang, Xiao-Min Huang, Feifei Du",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.amc.2024.128628"
    },
    {
        "id": 22174,
        "title": "Applying Social Network Embedding and Word Embedding for Socialbots Detection",
        "authors": "I-Hsien Ting, Kazunori Minetaki, Mei-Yun Hsu, Chia-Sung Yen",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3625007.3627306"
    },
    {
        "id": 22175,
        "title": "JoVe-FL: A Joint-Embedding Vertical Federated Learning Framework",
        "authors": "Maria Hartmann, Grégoire Danoy, Mohammed Alswaitti, Pascal Bouvry",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011802600003393"
    },
    {
        "id": 22176,
        "title": "Cross-lingual Data Augmentation for Document-grounded Dialog Systems in Low Resource Languages",
        "authors": "Qi Gou, Zehua Xia, Wenzhe Du",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.dialdoc-1.1"
    },
    {
        "id": 22177,
        "title": "An efficient technique for detecting document forgery in hyperspectral document images",
        "authors": "Naglaa F. EL Abady, Hala H. Zayed, Mohamed Taha",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aej.2023.11.040"
    },
    {
        "id": 22178,
        "title": "Normalization and Denormalization for a Document-Oriented Data",
        "authors": "Shady Hamouda, Mohammed Anbar, Omar Elejla",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011868100003393"
    },
    {
        "id": 22179,
        "title": "A hybrid CNN-Transformer model for Historical Document Image Binarization",
        "authors": "Vahid Rezanezhad, Konstantin Baierer, Clemens Neudecker",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604951.3605508"
    },
    {
        "id": 22180,
        "title": "An Advanced Graph Embedding Framework with Node Embedding to Design Water Pipeline Networks",
        "authors": "Alvida Mustika Rukmi, Ary Mazharuddin Shiddiqi, Ahmad Saikhu, Muhammad Jefri Fransiska, Leo Mazeau",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icts58770.2023.10330890"
    },
    {
        "id": 22181,
        "title": "EMBEDD-ER: EMBEDDing Educational Resources Using Linked Open Data",
        "authors": "Aymen Bazouzi, Mickaël Foursov, Hoël Le Capitaine, Zoltan Miklos",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012045300003470"
    },
    {
        "id": 22182,
        "title": "Document sans titre",
        "authors": "",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4000/caravelle.13414"
    },
    {
        "id": 22183,
        "title": "Embedding Experimental Research in the Learning Management System",
        "authors": "Ben Motz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2002324"
    },
    {
        "id": 22184,
        "title": "HierMDS: a hierarchical multi-document summarization model with global–local document dependencies",
        "authors": "Shuimin Li, Jungang Xu",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08680-0"
    },
    {
        "id": 22185,
        "title": "Document Flattening: Beyond Concatenating Context for Document-Level Neural Machine Translation",
        "authors": "Minghao Wu, George Foster, Lizhen Qu, Gholamreza Haffari",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.33"
    },
    {
        "id": 22186,
        "title": "Enhancing Document Image Retrieval in Education: Leveraging Ensemble-Based Document Image Retrieval Systems for Improved Precision",
        "authors": "Yehia Ibrahim Alzoubi, Ahmet Ercan Topcu, Erdem Ozdemir",
        "published": "2024-1-16",
        "citations": 1,
        "abstract": "Document image retrieval (DIR) systems simplify access to digital data within printed documents by capturing images. These systems act as bridges between print and digital realms, with demand in organizations handling both formats. In education, students use DIR to access online materials, clarify topics, and find solutions in printed textbooks by photographing content with their phones. DIR excels in handling complex figures and formulas. We propose using ensembles of DIR systems instead of single-feature models to enhance DIR’s efficacy. We introduce “Vote-Based DIR” and “The Strong Decision-Based DIR”. These ensembles combine various techniques, like optical code reading, spatial analysis, and image features, improving document retrieval. Our study, using a dataset of university exam preparation materials, shows that ensemble DIR systems outperform individual ones, promising better accuracy and efficiency in digitizing printed content, which is especially beneficial in education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14020751"
    },
    {
        "id": 22187,
        "title": "CoreSelect: A New Approach to Select Landmarks for Dissimilarity Space Embedding",
        "authors": "Sylvain Chabanet, Philippe Thomas, Hind El-Haouzi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012163500003595"
    },
    {
        "id": 22188,
        "title": "Graph-based Categorical Embedding",
        "authors": "Weiwei Wang, Stefano Bromuri, Michel Dumontier",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-32"
    },
    {
        "id": 22189,
        "title": "YinYang, a Fast and Robust Adaptive Document Image Binarization for Optical Character Recognition",
        "authors": "Jean-Luc Bloechle, Jean Hennebert, Christophe Gisler",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3609354"
    },
    {
        "id": 22190,
        "title": "Document Layout Analysis with Deep Learning and Heuristics",
        "authors": "Vahid Rezanezhad, Konstantin Baierer, Mike Gerber, Kai Labusch, Clemens Neudecker",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604951.3605513"
    },
    {
        "id": 22191,
        "title": "Design of Enhanced Document HTML and the Reliable Electronic Document Distribution Service",
        "authors": "Hyun-Cheon Hwang, Woo-Je Kim",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "Electronic documents are becoming increasingly popular in various industries and sectors as they provide greater convenience and cost-efficiency than physical documents. PDF is a widely used format for creating and sharing electronic documents, while HTML is commonly used in mobile environments as the foundation for creating web pages displayed on mobile devices, such as smartphones and tablets. HTML is becoming a more critical document format as mobile environments have been raised as the primary communication channel nowadays. However, HTML does not have the standard content integrity feature, and an electronic document based on HTML consists of a set of related files. Therefore, it has a vulnerability in terms of reliable electronic documents. We have proposed Document HTML, a single independent file with extended meta tags, to be a reliable electronic document and Chained Document, a single independent file with a blockchain network to secure content integrity and delivery assurance. In this paper, we improved the definition of Document HTML and researched certified electronic document intermediaries. Additionally, we designed and validated the electronic document distribution service using Enhanced Document HTML for real usability. Moreover, we conducted experimental verification using a tax notification electronic document, which has one of the top distribution volumes in Korea, to confirm how Document HTML provides a content integrity verification feature. Document HTML can be used in an enterprise that must send a reliable electronic document to a customer with an electronic document delivery service provider.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12102176"
    },
    {
        "id": 22192,
        "title": "Embedding AI Logic and Cyber Security into Field and Cloud Edge Gateways",
        "authors": "Sumanth Tatineni",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231015015837"
    },
    {
        "id": 22193,
        "title": "Proposal of a New Approach Using Deep Learning for QR Code Embedding",
        "authors": "Kanaru Kumabuchi, Hiroyuki Kobayashi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012238900003543"
    },
    {
        "id": 22194,
        "title": "Document vector extension for document classification",
        "authors": "K. S. Guruprakash, K. Valli Priyadharshini, G. Pavithra, S. Suruthi, R. Sujeetha, S. Soundaram, K. Santhiya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0173197"
    },
    {
        "id": 22195,
        "title": "DIVA-DAF: A Deep Learning Framework for Historical Document Image Analysis",
        "authors": "Lars Vögtlin, Anna Scius-Bertrand, Paul Maergner, Andreas Fischer, Rolf Ingold",
        "published": "2023-8-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604951.3605511"
    },
    {
        "id": 22196,
        "title": "Promoting Topic Coherence and Inter-Document Consorts in Multi-Document Summarization via Simplicial Complex and Sheaf Graph",
        "authors": "Yash Atri, Arun Iyer, Tanmoy Chakraborty, Vikram Goyal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.133"
    },
    {
        "id": 22197,
        "title": "Embedding Diversity, Equity, and Inclusion",
        "authors": "Alan Gutterman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4663759"
    },
    {
        "id": 22198,
        "title": "Heimatkunde: Dataset for Multi-Modal Historical Document Analysis",
        "authors": "Josef Baloun, Václav Honzík, Ladislav Lenc, Jiří Martínek, Pavel Král",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012428500003636"
    },
    {
        "id": 22199,
        "title": "Peek Across: Improving Multi-Document Modeling via Cross-Document Question-Answering",
        "authors": "Avi Caciularu, Matthew Peters, Jacob Goldberger, Ido Dagan, Arman Cohan",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.110"
    },
    {
        "id": 22200,
        "title": "Historical document image analysis using controlled data for pre-training",
        "authors": "Najoua Rahal, Lars Vögtlin, Rolf Ingold",
        "published": "2023-9",
        "citations": 1,
        "abstract": "AbstractUsing neural networks for semantic labeling has become a dominant technique for layout analysis of historical document images. However, to train or fine-tune appropriate models, large labeled datasets are needed. This paper addresses the case when only limited labeled data are available and promotes a novel approach using so-called controlled data to pre-train the networks. Two different strategies are proposed: The first addresses the real labeling task by using artificial data; the second uses real data to pre-train the networks with a pretext task. To assess these strategies, a large set of experiments has been carried out on a text line detection and classification task using different variants of U-Net. The observations, obtained from two different datasets, show that globally the approach reduces the training time while offering similar or better performance. Furthermore, the effect is bigger on lightweight network architectures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00437-8"
    },
    {
        "id": 22201,
        "title": "Building impact: Embedding design PhD researchers in industry contexts",
        "authors": "Leah Heiss,  ",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21606/drslxd.2023.052"
    },
    {
        "id": 22202,
        "title": "MeSH-Based Semantic Weighting Scheme to Enhance Document Indexing: Application on Biomedical Document Classification",
        "authors": "Imen Gabsi, Hager Kammoun, Dalila Souidi, Ikram Amous",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": " Document indexing phase plays a significant role in text mining applications such as text document classification. The common indexing paradigm is based on terms frequency in documents known as Bag Of Words (BOW)-based representation approach. However, such classical approach suffers from ambiguity and disparity of words. In addition, traditional term weighting schemes, such as TF-IDF, exploit only the statistical information of terms in documents. To overcome these problems, we have been interested in biomedical semantic document indexing using concepts extracted from the knowledge resource MeSH. Thus, we have focused first on a disambiguation method to identify the adequate senses of ambiguous MeSH concepts and we have considered four representation enrichment strategies to identify the best appropriate representatives of the adequate sense in the textual entities representation. Second, we propose to introduce a semantic weighting scheme that quantifies MeSH concept’s importance in documents through their occurrence frequency and semantic similarities with unambiguous MeSH concepts. Our contribution lies particularly in the in-depth experimental study of the performance of these methods and precisely the impact of the semantic weighting scheme on the performance. To do that, three benchmark datasets TREC 2004 genomics, BioCreative II and OHSUMED were used. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0219649224500357"
    },
    {
        "id": 22203,
        "title": "Enhancing Multi-Document Summarization with Cross-Document Graph-based Information Extraction",
        "authors": "Zixuan Zhang, Heba Elfardy, Markus Dreyer, Kevin Small, Heng Ji, Mohit Bansal",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.124"
    },
    {
        "id": 22204,
        "title": "Enhancing Multilingual Document-Grounded Dialogue Using Cascaded Prompt-Based Post-Training Models",
        "authors": "Jun Liu, Shuang Cheng, Zineng Zhou, Yang Gu, Jian Ye, Haiyong Luo",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.dialdoc-1.5"
    },
    {
        "id": 22205,
        "title": "Embedding Businesses' Commitments to Human Rights",
        "authors": "Alan Gutterman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4360160"
    },
    {
        "id": 22206,
        "title": "Building impact: Embedding design PhD researchers in industry contexts",
        "authors": "Leah Heiss,  ",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21606/drslxd.2024.052"
    },
    {
        "id": 22207,
        "title": "Building impact: Embedding design PhD researchers in industry contexts",
        "authors": "Leah Heiss,  ",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21606/drslxd2024.052"
    },
    {
        "id": 22208,
        "title": "Perturbation analysis on PCA plus graph embedding methods and PCA plus exponential graph embedding methods",
        "authors": "Wenya Shi, Gang Wu",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cam.2024.115788"
    },
    {
        "id": 22209,
        "title": "WEATHERGOV+",
        "authors": "Amanda Dash, Melissa Cote, Alexandra Branzan Albu",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3604901"
    },
    {
        "id": 22210,
        "title": "TOMDS (Topic-Oriented Multi-Document Summarization): Enabling Personalized Customization of Multi-Document Summaries",
        "authors": "Xin Zhang, Qiyi Wei, Qing Song, Pengzhou Zhang",
        "published": "2024-2-25",
        "citations": 0,
        "abstract": "In a multi-document summarization task, if the user can decide on the summary topic, the generated summary can better align with the reader’s specific needs and preferences. This paper addresses the issue of overly general content generation by common multi-document summarization models and proposes a topic-oriented multi-document summarization (TOMDS) approach. The method is divided into two stages: extraction and abstraction. During the extractive stage, it primarily identifies and retrieves paragraphs relevant to the designated topic, subsequently sorting them based on their relevance to the topic and forming an initial subset of documents. In the abstractive stage, building upon the transformer architecture, the process includes two parts: encoding and decoding. In the encoding part, we integrated an external discourse parsing module that focuses on both micro-level within-paragraph semantic relationships and macro-level inter-paragraph connections, effectively combining these with the implicit relationships in the source document to produce more enriched semantic features. In the decoding part, we incorporated a topic-aware attention mechanism that dynamically zeroes in on information pertinent to the chosen topic, thus guiding the summary generation process more effectively. The proposed model was primarily evaluated using the standard text summary dataset WikiSum. The experimental results show that our model significantly enhanced the thematic relevance and flexibility of the summaries and improved the accuracy of grammatical and semantic comprehension in the generated summaries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14051880"
    },
    {
        "id": 22211,
        "title": "Editorial for special issue on “advanced topics in document analysis and recognition”",
        "authors": "Koichi Kise, Richard Zanibbi, Rajiv Jain, Gernot A. Fink",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00448-5"
    },
    {
        "id": 22212,
        "title": "KALM: Knowledge-Aware Integration of Local, Document, and Global Contexts for Long Document Understanding",
        "authors": "Shangbin Feng, Zhaoxuan Tan, Wenqian Zhang, Zhenyu Lei, Yulia Tsvetkov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.118"
    },
    {
        "id": 22213,
        "title": "DAN: a Segmentation-free Document Attention Network for Handwritten Document Recognition",
        "authors": "Denis Coquenet, Clement Chatelain, Thierry Paquet",
        "published": "2023",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpami.2023.3235826"
    },
    {
        "id": 22214,
        "title": "A Review of Document Image Enhancement Based on Document Degradation Problem",
        "authors": "Yanxi Zhou, Shikai Zuo, Zhengxian Yang, Jinlong He, Jianwen Shi, Rui Zhang",
        "published": "2023-7-4",
        "citations": 1,
        "abstract": "Document image enhancement methods are often used to improve the accuracy and efficiency of automated document analysis and recognition tasks such as character recognition. These document images could be degraded or damaged for various reasons including aging, fading handwriting, poor lighting conditions, watermarks, etc. In recent years, with the improvement of computer performance and the continuous development of deep learning, many methods have been proposed to enhance the quality of these document images. In this paper, we review six tasks of document degradation, namely, background texture, page smudging, fading, poor lighting conditions, watermarking, and blurring. We summarize the main models for each degradation problem as well as recent work, such as the binarization model that can be used to deal with the degradation of background textures, lettering smudges. When facing the problem of fading, a model for stroke connectivity can be used, while the other three degradation problems are mostly deep learning models. We discuss the current limitations and challenges of each degradation task and introduce the common public datasets and metrics. We identify several promising research directions and opportunities for future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13137855"
    },
    {
        "id": 22215,
        "title": "Effect of acupoint catgut embedding combined with western medicine on patients with stable COPD: Acupoint catgut embedding treating stable COPD meta-analysis",
        "authors": "Chengfeng Gu, Yunfeng Yu, Yan Chen, Shenjia Duan, Rong Xu, Shang Liu, Can Wang",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "\nBackground:\nAlthough bronchodilators and glucocorticoids can reduce the symptoms of cough and asthma to a certain extent, the adverse drug reactions and recurrence after recovery still trouble clinicians. Acupoint catgut embedding is effective in preventing and treating acute recurrence and deterioration of COPD, but its clinical efficacy remains controversial. Therefore, this study evaluated the clinical efficacy and safety of acupoint catgut embedding combined with conventional Western medicine for COPD through meta-analysis.\n\n\nMethods:\nPubmed, the Cochrane Library, Web of Science, Sinomed, China Knowledge Network, VIP, and Wanfang databases were searched, with a time frame from database creation to November 2022. Meta-analysis was performed with Revman 5.3. Publication bias was assessed by Stata 15.0.\n\n\nResults:\nSeventeen studies were listed, with a total sample size of 1516 cases. Meta-analysis showed that compared with conventional western medicine, acupoint catgut embedding combined with conventional western medicine could effectively improve the total effective rate of clinical symptoms of stable COPD [RR = 1.21, 95%CI (1.13, 1.29), P < .00001], forced expiratory volume in 1 second (FEV1) [mean difference (MD) = 0.04, 95%CI (0.00, 0.09), P = .04],the percentage of forced expiratory volume in 1 second predicted value [MD = 1.13, 95%CI (0.38,1.88), P = .003], acute exacerbation of chronic obstructive pulmonary disease [MD = −0.73, 95%CI (−1.04, −0.42), P < .00001], COPD assessment test score [MD = −2.39, 95%CI (−3.65, −1.13), P = .0002], the improved medical research council respiratory questionnaire score (mMRC score) [MD = −0.15, 95%CI (−0.29, −0.02),P = .03], 6-minute walk distance [MD = 28.16, 95%CI (17.31, 39.00), P < .00001], the production of inflammatory factor interleukin-8 [MD = −9.65, 95%CI (−10.44, −8.86), P < .00001], but the adverse event rate was comparable[RR = 1.39, 95%CI (0.28,6.91), P = .69]. However, there was no significant difference in forced expiratory volume in 1 second/forced vital capacity and TNF-α between the acupoint catgut embedding combined group and the conventional western medication group. Harbord test showed no significant publication bias.\n\n\nConclusion:\nThe clinical efficacy of acupoint catgut embedding combined with conventional western medicine for stable COPD is better than that of conventional western medicine, and the safety may be equivalent to that of conventional western medicine, which has the value of further research exploration.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/md.0000000000035281"
    },
    {
        "id": 22216,
        "title": "A Method for Embedding Binary Image in Photographic Image Using 8-Neighbor Average",
        "authors": "Kanya Goto",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/jiiae.12.1"
    },
    {
        "id": 22217,
        "title": "CRE: Circle relationship embedding of patches in vision transformer",
        "authors": "Zhengyang Yu, Jochen Triesch",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-75"
    },
    {
        "id": 22218,
        "title": "A Dually Flat Embedding of Spacetime",
        "authors": "Jan Naudts",
        "published": "2023-4-13",
        "citations": 1,
        "abstract": "A model of spacetime is presented. It has an extension to five dimensions, and in five dimensions the geometry is the dual of the Euclidean geometry w.r.t. an arbitrary positive-definite metric. Dually flat geometries are well-known in the context of information geometry. The present work explores their role in describing the geometry of spacetime. It is shown that the positive-definite metric with its flat 5-d connection can coexist with a pseudometric for which the connection is that of Levi–Civita. The 4-d geodesics are characterized by five conserved quantities, one of which can be chosen freely and is taken equal to zero in the present work. An explicit expression for the parallel transport operators is obtained. It is used to construct a pseudometric for spacetime by choosing an arbitrary possibly degenerate inner product in the tangent space of a reference point, for instance, that of Minkowski. By parallel transport, one obtains a pseudometric for spacetime, the metric connection of which extends to a 5-d connection with vanishing curvature tensor. The de Sitter space is considered as an example.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25040651"
    },
    {
        "id": 22219,
        "title": "WeExt: A Framework of Extending Deterministic Knowledge Graph Embedding Models for Embedding Weighted Knowledge Graphs",
        "authors": "Kong Wei Kun, Xin Liu, Teeradaj Racharak, Guanqun Sun, Jianan Chen, Qiang Ma, Le-Minh Nguyen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3276319"
    },
    {
        "id": 22220,
        "title": "Embedding quality in primary healthcare",
        "authors": "Federica Secci, Shams Syed",
        "published": "2023-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/bmj.p883"
    },
    {
        "id": 22221,
        "title": "Control-aware Learning of Koopman Embedding Models",
        "authors": "Daisuke Uchida, Karthik Duraisamy",
        "published": "2023-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/acc55779.2023.10156352"
    },
    {
        "id": 22222,
        "title": "Language-Agnostic Transformers and Assessing ChatGPT-Based Query Rewriting for Multilingual Document-Grounded QA",
        "authors": "Srinivas Gowriraj, Soham Dinesh Tiwari, Mitali Potnis, Srijan Bansal, Teruko Mitamura, Eric Nyberg",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.dialdoc-1.11"
    },
    {
        "id": 22223,
        "title": "Document Localization and Classification As Stages of a Document Recognition System",
        "authors": "N. S. Skoryukina, D. V. Tropin, J. A. Shemiakina, V. V. Arlazarov",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1054661823040430"
    },
    {
        "id": 22224,
        "title": "Inferring Interpretable Semantic Cognitive Maps from Noisy Document Corpora",
        "authors": "Yahya Emara, Tristan Weger, Ryan Rubadue, Rishabh Choudhary, Simona Doboli, Ali Minai",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012389100003636"
    },
    {
        "id": 22225,
        "title": "EMBEDDING SUSTAINABILITY INTO THE EDUCATION OF HEALTH PROFESSIONALS",
        "authors": "Angela Flynn",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/edulearn.2023.2188"
    },
    {
        "id": 22226,
        "title": "A previously unknown document concerning the battle of Nicopolis (1396)",
        "authors": "Sophie Le Goff, Jacques Paviot",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4000/abpo.8509"
    },
    {
        "id": 22227,
        "title": "A Comparative Analysis of the Administrative Document  \"Application\" in English and Uzbek Dictionaries",
        "authors": "I. M. Turdiev, Sh. A. Sultonova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012490500003792"
    },
    {
        "id": 22228,
        "title": "Documents as Intelligent Agents: An Approach to Optimize Document Representations in Semantic Search",
        "authors": "Oliver Strauß, Holger Kett",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012239200003584"
    },
    {
        "id": 22229,
        "title": "Inv3D: a high-resolution 3D invoice dataset for template-guided single-image document unwarping",
        "authors": "Felix Hertlein, Alexander Naumann, Patrick Philipp",
        "published": "2023-9",
        "citations": 2,
        "abstract": "AbstractNumerous business workflows involve printed forms, such as invoices or receipts, which are often manually digitalized to persistently search or store the data. As hardware scanners are costly and inflexible, smartphones are increasingly used for digitalization. Here, processing algorithms need to deal with prevailing environmental factors, such as shadows or crumples. Current state-of-the-art approaches learn supervised image dewarping models based on pairs of raw images and rectification meshes. The available results show promising predictive accuracies for dewarping, but generated errors still lead to sub-optimal information retrieval. In this paper, we explore the potential of improving dewarping models using additional, structured information in the form of invoice templates. We provide two core contributions: (1) a novel dataset, referred to as Inv3D, comprising synthetic and real-world high-resolution invoice images with structural templates, rectification meshes, and a multiplicity of per-pixel supervision signals and (2) a novel image dewarping algorithm, which extends the state-of-the-art approach GeoTr to leverage structural templates using attention. Our extensive evaluation includes an implementation of DewarpNet and shows that exploiting structured templates can improve the performance for image dewarping. We report superior performance for the proposed algorithm on our new benchmark for all metrics, including an improved local distortion of 26.1 %. We made our new dataset and all code publicly available at https://felixhertlein.github.io/inv3d.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00434-x"
    },
    {
        "id": 22230,
        "title": "Multi-document influence on readers: augmenting social emotion prediction by learning document interactions",
        "authors": "Xu Mou, Qinke Peng, Zhao Sun, Muhammad Fiaz Bashir, Haozhou Li",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-024-09420-8"
    },
    {
        "id": 22231,
        "title": "News Recommendation System Based on Topic Embedding and Knowledge Embedding",
        "authors": "Haojie ZHANG, Hui SUN, Baiwen QI, Zhidong SHEN",
        "published": "2023-2",
        "citations": 0,
        "abstract": "News recommendation system is designed to deal with massive news and provide personalized recommendations for users. Accurately capturing user preferences and modeling news and users is the key to news recommendation. In this paper, we propose a new framework, news recommendation system based on topic embedding and knowledge embedding (NRTK). NRTK handle news titles that users have clicked on from two perspectives to obtain news and user representation embedding :1) extracting explicit and latent topic features from news and mining users' preferences for them in historical behaviors; 2) extracting entities and propagating users' potential preferences in the knowledge graph. Experiments in a real-world dataset validate the effectiveness and efficiency of our approach. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/wujns/2023281029"
    },
    {
        "id": 22232,
        "title": "Delay-Embedding Spatio-Temporal Dynamic Mode Decomposition",
        "authors": "Gyurhan Nedzhibov",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "Spatio-temporal dynamic mode decomposition (STDMD) is an extension of dynamic mode decomposition (DMD) designed to handle spatio-temporal datasets. It extends the framework so that it can analyze data that have both spatial and temporal variations. This facilitates the extraction of spatial structures along with their temporal evolution. The STDMD method extracts temporal and spatial development information simultaneously, including wavenumber, frequencies, and growth rates, which are essential in complex dynamic systems. We provide a comprehensive mathematical framework for sequential and parallel STDMD approaches. To increase the range of applications of the presented techniques, we also introduce a generalization of delay coordinates. The extension, labeled delay-embedding STDMD allows the use of delayed data, which can be both time-delayed and space-delayed. An explicit expression of the presented algorithms in matrix form is also provided, making theoretical analysis easier and providing a solid foundation for further research and development. The novel approach is demonstrated using some illustrative model dynamics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12050762"
    },
    {
        "id": 22233,
        "title": "Ordered and Binary Speaker Embedding",
        "authors": "Jiaying Wang, Xianglong Wang, Namin Wang, Lantian Li, Dong Wang",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1565"
    },
    {
        "id": 22234,
        "title": "ECAPA++: Fine-grained Deep Embedding Learning for TDNN Based Speaker Verification",
        "authors": "Bei Liu, Yanmin Qian",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-777"
    },
    {
        "id": 22235,
        "title": "Embedding and customizing templates in cross-disciplinary modeling",
        "authors": "Wybo Houkes",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "AbstractIn this paper, I develop a template-based analysis to include several elements of processes through which templates are transferred between fields of inquiry. The analysis builds on Justin Price’s identification of the importance of a “landing zone” in the recipient domain, from which “conceptual pressure” may be created. I will argue that conceptual pressure is a characteristic feature of the process of template transfer; that this means that there are costs to the process of transfer as well as benefits; and that it would be reasonable if modelers try to mitigate these costs. I will discuss two such mitigation strategies: ‘conceptual embedding’ and ‘customization’. I illustrate the claims, focusing on the mitigation strategies, with a case study: that of pioneering applications of reaction–diffusion equations in mathematical ecology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11229-023-04076-8"
    },
    {
        "id": 22236,
        "title": "Conventional paraffin embedding technique and double-embedding technique for minute oral biopsies and delicate pulp tissue — a comparative study",
        "authors": "A. Sundararajan, R. Muthusamy, H. Prasad, K.K. Sri Chinthu, R. Selvakumar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17116/patol20248602152"
    },
    {
        "id": 22237,
        "title": "A Two-Step Approach for Syllabus Development and  Evaluation using Machine Learning such as Doc2Vec based on Eduinformatics",
        "authors": "Akira ITOH, Hibiki Ito, Sayaka Matsumoto, Ikuhiro Noda, Kenya Bannaka, Keita Nishiyama, Takafumi Kirimura, Taion Kunisaki, Kenichiro Mitsunari, Katsuhiko Murakami, Ryosuke Kozaki, Aoi Kishida, Mizuki Kondo, Shotaro Imai, Masao Mori, Yasuo Nakata, Masato Omori, Kunihiko Takamatsu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52731/lir.v003.128"
    },
    {
        "id": 22238,
        "title": "An Analysis of Political Bias in Major Newspapers’ Coverage on the 20th Presidential Election in South Korea : Focusing on classification using deep learning and comparison of similarity using Doc2vec",
        "authors": "Sanghyun Park",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21487/jrm.2024.3.9.1.1"
    },
    {
        "id": 22239,
        "title": "Study of Embedding Crochet Into Girls' STEM Learning",
        "authors": "Portia York",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2004846"
    },
    {
        "id": 22240,
        "title": "Embedding Theorems for Flexible Varieties",
        "authors": "Shulim Kaliman",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1307/mmj/20226268"
    },
    {
        "id": 22241,
        "title": "Analyzing the potential of active learning for document image classification",
        "authors": "Saifullah Saifullah, Stefan Agne, Andreas Dengel, Sheraz Ahmed",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractDeep learning has been extensively researched in the field of document analysis and has shown excellent performance across a wide range of document-related tasks. As a result, a great deal of emphasis is now being placed on its practical deployment and integration into modern industrial document processing pipelines. It is well known, however, that deep learning models are data-hungry and often require huge volumes of annotated data in order to achieve competitive performances. And since data annotation is a costly and labor-intensive process, it remains one of the major hurdles to their practical deployment. This study investigates the possibility of using active learning to reduce the costs of data annotation in the context of document image classification, which is one of the core components of modern document processing pipelines. The results of this study demonstrate that by utilizing active learning (AL), deep document classification models can achieve competitive performances to the models trained on fully annotated datasets and, in some cases, even surpass them by annotating only 15–40% of the total training dataset. Furthermore, this study demonstrates that modern AL strategies significantly outperform random querying, and in many cases achieve comparable performance to the models trained on fully annotated datasets even in the presence of practical deployment issues such as data imbalance, and annotation noise, and thus, offer tremendous benefits in real-world deployment of deep document classification models. The code to reproduce our experiments is publicly available at https://github.com/saifullah3396/doc_al.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00429-8"
    },
    {
        "id": 22242,
        "title": "The Alexandria Document",
        "authors": "Paul McPartlan",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1163/17455316-19030002"
    },
    {
        "id": 22243,
        "title": "The Study of Thesis Made on Lifelong Learning in Turkey by Document Analysis",
        "authors": "Rümeysa TUNA-GÜNDOĞDU, Aysel ARSLAN",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "The aim of this study is to analysee the content of postgraduate theses on lifelong learning in Turkey between the years 2007-2022. Only the thesis studies that are in the national thesis center database and that are open to the access of other researchers by the researchers who carried out the thesis studies were included in this study. A total of 212 theses related to lifelong learning were identified in the detailed search conducted in the national thesis data center. However, one of these theses was not included in the scope of the study because there was no access permission and 7 of them were out of the field, and the remaining 204 theses were examined. Content and frequency analysis methods were used. Data on the year of publication, subject area, working group, method and findings of the examined theses were created. According to the results of the research, it was seen that the postgraduate thesis studies were mostly in the field of competence development and gaining proficiency between the years 2007-2022, the quantitative research method was mainly used, and the teachers were mostly preferred as the sample group.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31458/iejes.1248507"
    },
    {
        "id": 22244,
        "title": "Travel Document",
        "authors": "Luuk van der Baaren, Dimitry Kochenov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4606180"
    },
    {
        "id": 22245,
        "title": "Automatic Scoring Using Term Frequency Inverse Document Frequency Document Frequency and Cosine Similarity",
        "authors": "Winda Yulita, Meida Cahyo Untoro, Mugi Praseptiawan, Ilham Firman Ashari, Aidil Afriansyah, Ahmad Naim Bin Che Pee",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "Purpose: In the learning process, most of the tests to assess learning achievement have been carried out by providing questions in the form of short answers or essay questions. The variety of answers given by students makes a teacher have to focus on reading them. This scoring process is difficult to guarantee quality if done manually. In addition, each class is taught by a different teacher, which can lead to unequal grades obtained by students due to the influence of differences in teacher experience. Therefore the purpose of this study is to develop an assessment of the answers. Automated short answer scoring is designed to automatically grade and evaluate students' answers based on a series of trained answer documents.Methods: This is ‘how’ you did it. Let readers know exactly what you did to reach your results. For example, did you undertake interviews? Did you carry out an experiment in the lab? What tools, methods, protocols or datasets did you use The method used is TF-IDF-DF and Similarity and scoring computation.  Theword weight used is the term Frequency-Inverse Documents Frequency -Document Frequency (TF-IDF-DF) method. The data used is 5 questions with each question answered by 30 students, while the students' answers are assessed by teachers/experts to determine the real score. The study was evaluated by Mean Absolute Error (MAE).Result: The evaluation results obtained Mean Absolute Error (MAE) with a resulting value of 0.123.Value: The word weighting method used is the Term Frequency Inverse Document Frequency DocumentFrequency (TF-IDF-DF) which is an improvement over the Term Frequency Inverse Document Frequency (TF-IDF) method. This method is a method of weighting words that will be applied before calculating the similarity of sentences between teachers and students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15294/sji.v10i2.42209"
    },
    {
        "id": 22246,
        "title": "TRIP: Accelerating Document-level Multilingual Pre-training via Triangular Document-level Pre-training on Parallel Data Triplets",
        "authors": "Hongyuan Lu, Haoyang Huang, Shuming Ma, Dongdong Zhang, Wai Lam, Zhaochuan Gao, Anthony Aue, Arul Menezes, Furu Wei",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.526"
    },
    {
        "id": 22247,
        "title": "Semantic Metadata Integration Support Method for Editable Re-flowable Document OOXML and Fixed-layout Document PDF",
        "authors": "Yongxuan Wang, Ning Li, Yingai Tian",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3627915.3628080"
    },
    {
        "id": 22248,
        "title": "A Chaotic Approach for Calculating Minimum Embedding Dimension",
        "authors": "Kamad Nath Shandilya,  , Satish Kumar, Sumita Singh",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i1.2485"
    },
    {
        "id": 22249,
        "title": "Clustering of Monolingual Embedding Spaces",
        "authors": "Kowshik Bhowmik, Anca Ralescu",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "Suboptimal performance of cross-lingual word embeddings for distant and low-resource languages calls into question the isomorphic assumption integral to the mapping-based methods of obtaining such embeddings. This paper investigates the comparative impact of typological relationship and corpus size on the isomorphism between monolingual embedding spaces. To that end, two clustering algorithms were applied to three sets of pairwise degrees of isomorphisms. It is also the goal of the paper to determine the combination of the isomorphism measure and clustering algorithm that best captures the typological relationship among the chosen set of languages. Of the three measures investigated, Relational Similarity seemed to capture best the typological information of the languages encoded in their respective embedding spaces. These language clusters can help us identify, without any pre-existing knowledge about the real-world linguistic relationships shared among a group of languages, the related higher-resource languages of low-resource languages. The presence of such languages in the cross-lingual embedding space can help improve the performance of low-resource languages in a cross-lingual embedding space.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/digital3010004"
    },
    {
        "id": 22250,
        "title": "Hate Speech Detection based on Word Embedding and Linguistic Features",
        "authors": "Archika Jain,  , Sandhya Sharma",
        "published": "2023-11-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i41.2128"
    },
    {
        "id": 22251,
        "title": "SNP distributed representation using entity embedding",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/7962"
    },
    {
        "id": 22252,
        "title": "Embracing the Complexity of Current Societal Challenges Embedding a Transformative Dimension Into Science Education",
        "authors": "Giulia Tasquier",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2014970"
    },
    {
        "id": 22253,
        "title": "Low-Complexity Audio Embedding Extractors",
        "authors": "Florian Schmid, Khaled Koutini, Gerhard Widmer",
        "published": "2023-9-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289815"
    },
    {
        "id": 22254,
        "title": "Embedding Beyond Electrostatics: The Extended Polarizable Density Embedding Model",
        "authors": "Willem Van den Heuvel, Peter Reinholdt, Jacob Kongsted",
        "published": "2023-4-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jpcb.2c08721"
    },
    {
        "id": 22255,
        "title": "Deep Distance Metric Learning for Similarity Preserving Embedding of Point Clouds",
        "authors": "Ahmed Abouelazm, Igor Vozniak, Nils Lipp, Pavel Astreika, Christian Mueller",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011627100003417"
    },
    {
        "id": 22256,
        "title": "pLMSNOSite: an ensemble-based approach for predicting protein S-nitrosylation sites by integrating supervised word embedding and embedding from pre-trained protein language model",
        "authors": "Pawel Pratyush, Suresh Pokharel, Hiroto Saigo, Dukka B. KC",
        "published": "2023-2-8",
        "citations": 6,
        "abstract": "AbstractBackgroundProtein S-nitrosylation (SNO) plays a key role in transferring nitric oxide-mediated signals in both animals and plants and has emerged as an important mechanism for regulating protein functions and cell signaling of all main classes of protein. It is involved in several biological processes including immune response, protein stability, transcription regulation, post translational regulation, DNA damage repair, redox regulation, and is an emerging paradigm of redox signaling for protection against oxidative stress. The development of robust computational tools to predict protein SNO sites would contribute to further interpretation of the pathological and physiological mechanisms of SNO.ResultsUsing an intermediate fusion-based stacked generalization approach, we integrated embeddings from supervised embedding layer and contextualized protein language model (ProtT5) and developed a tool called pLMSNOSite (protein language model-based SNO site predictor). On an independent test set of experimentally identified SNO sites, pLMSNOSite achieved values of 0.340, 0.735 and 0.773 for MCC, sensitivity and specificity respectively. These results show that pLMSNOSite performs better than the compared approaches for the prediction of S-nitrosylation sites.ConclusionTogether, the experimental results suggest that pLMSNOSite achieves significant improvement in the prediction performance of S-nitrosylation sites and represents a robust computational approach for predicting protein S-nitrosylation sites. pLMSNOSite could be a useful resource for further elucidation of SNO and is publicly available athttps://github.com/KCLabMTU/pLMSNOSite.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12859-023-05164-9"
    },
    {
        "id": 22257,
        "title": "Document Classification Using Lightweight Neural Network",
        "authors": "Chung-Hsing Chen Chung-Hsing Chen, Ko-Wei Huang Chung-Hsing Chen",
        "published": "2023-12",
        "citations": 0,
        "abstract": "\n                        <p>In recent years, OCR data has been used for learning and analyzing document classification. In addition, some neural networks have used image recognition for training, such as the network published by the ImageNet Large Scale Visual Recognition Challenge for document image training, AlexNet, GoogleNet, and MobileNet. Document image classification is important in data extraction processes and often requires significant computing power. Furthermore, it is difficult to implement image classification using general computers without a graphics processing unit (GPU). Therefore, this study proposes a lightweight neural network application that can perform document image classification on general computers or the Internet of Things (IoT) without a GPU. Plustek Inc. provided 3065 receipts belonging to 58 categories. Three datasets were considered as test samples while the remaining were considered as training samples to train the network to obtain a classifier. After the experiments, the classifier achieved 98.26% accuracy, and only 3 out of 174 samples showed errors.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/160792642023122407012"
    },
    {
        "id": 22258,
        "title": "METHOD IMPLEMENTATION DOCUMENT FOR BS 4142",
        "authors": "J SMYRNOVA, G BROWN, T CLAYTON, J TOFTS",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25144/16595"
    },
    {
        "id": 22259,
        "title": "A Compressed Synthetic Speech Detection Method with Compression Feature Embedding",
        "authors": "Jinghong Zhang, Xiaowei Yi, Xianfeng Zhao",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1696"
    },
    {
        "id": 22260,
        "title": "6 Embedding wellbeing support in foundation induction",
        "authors": "Huma Naqvi, Michael Blaber",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/leader-2023-fmlm.6"
    },
    {
        "id": 22261,
        "title": "EHDI: Enhancement of Historical Document Images via Generative Adversarial Network",
        "authors": "Abir Fathallah, Mounim El-Yacoubi, Najoua Ben Amara",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011662700003417"
    },
    {
        "id": 22262,
        "title": "Quality, Space and Time Competition on Binarizing Photographed Document Images",
        "authors": "Rafael Dueire Lins, Gabriel de F. Pe Silva, Gustavo P. Chaves, Ricardo da Silva Barboza, Rodrigo Barros Bernardino, Steven J. Simske",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3573128.3604903"
    },
    {
        "id": 22263,
        "title": "In hoeverre is de Fundamentele Wet van de Kerk (1980) een waardig constitutioneel document? De fundamentele wet van de kerk langs de meetlat van een staatsrechtelijk document",
        "authors": "Olav Boelens",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7590/ntkr_2023_005"
    },
    {
        "id": 22264,
        "title": "EXPLORING DOCUMENT, THE RAW MATERIALS, TECHNIQUE AND MOTIFS USED IN BANDHANI",
        "authors": "",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2021.19.2.nq21032"
    },
    {
        "id": 22265,
        "title": "A brief review of state-of-the-art object detectors on benchmark document images datasets",
        "authors": "Trong Thuan Nguyen, Hai Le, Truong Nguyen, Nguyen D. Vo, Khang Nguyen",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-023-00431-0"
    },
    {
        "id": 22266,
        "title": "Document as a multifaceted knowledge object",
        "authors": "Roberto Guarasci",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "\n\nThe definition of document and its evolution over time and within different disciplinary fields influences and determines norms, safeguarding and protection profiles and also disciplinary boundaries, without, to date, any adequate theoretical reflection and any universally accepted semantics. An attempt to define at the very least a state of the art represents the unavoidable condition towards the re-establishment of text and documentary disciplines within an epistemic framework in the making. The terminological definition influences and determines the very concept of archive which, in a digital context, increases its innate polysemy and requires a deep conceptual redefinition.\n \n\n\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36253/jlis.it-532"
    },
    {
        "id": 22267,
        "title": "Code Book for the Annotation of Diverse Cross-Document Coreference of Entities in News Articles",
        "authors": "",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "This paper presents a scheme for annotating coreference across news articles, extending beyond traditional identity relations by also considering near-identity and bridging relations. It includes a precise description of how to set up Inception, a respective annotation tool, how to annotate entities in news articles, connect them with diverse coreferential relations, and link them across documents to Wiki data’s global knowledge graph. This multi-layered annotation approach is discussed in the context of the problem of media bias. Our main contribution lies in providing a methodology for creating a diverse cross-document coreference corpus which can be applied to the analysis of media bias by word-choice and labelling",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/ijmn.01.01.09"
    },
    {
        "id": 22268,
        "title": "De-Embedding Technology for Active and Passive Device Testing Used in the Microwave and Terahertz Bands: A Review: An Overview of Different De-Embedding Techniques",
        "authors": "Shihan Xiang, Xu Chi, Huihua Liu, Chenxi Zhao, Yiming Yu, Kai Kang, Yunqiu Wu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mmm.2023.3340989"
    },
    {
        "id": 22269,
        "title": "SEF-Net: Speaker Embedding Free Target Speaker Extraction Network",
        "authors": "Bang Zeng, Suo Hongbin, Yulong Wan, Ming Li",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1749"
    },
    {
        "id": 22270,
        "title": "Statistical Embedding: Beyond Principal Components",
        "authors": "Dag Tjøstheim, Martin Jullum, Anders Løland",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/22-sts881"
    },
    {
        "id": 22271,
        "title": "Design Innovation Methodology Handbook (Second Edition) - Embedding Design in Organizations",
        "authors": "Design Innovation",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4508284"
    },
    {
        "id": 22272,
        "title": "Temporal Link Prediction Using Graph Embedding Dynamics",
        "authors": "Sanaz Hasanzadeh Fard, Mohammad Ghassemi",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigmm59094.2023.00014"
    },
    {
        "id": 22273,
        "title": "GENUINE: Genomic and Nucleus Information Embedding for Single Cell Genetic Alteration Classification in Microscopic Images",
        "authors": "Simon Gutwein, Martin Kampel, Sabine Taschner-Mandl, Roxane Licandro",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012319700003654"
    },
    {
        "id": 22274,
        "title": "Heuristic energy-saving virtual network embedding algorithm based on Katz centrality",
        "authors": "",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aee.2020.133920"
    },
    {
        "id": 22275,
        "title": "Comparison of Gravoply plate barcode embedding in Complete Denture Prosthesis (CDP) to lamination barcode embedding for forensic identification purposes",
        "authors": " Basma Rosandi Prakosa,  Raden Aditya Wisnu Wardhana,  Annisa Putri,  Emy Khuironi,  Wahyu Agung Pramukti",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Background: Mass disasters often occur in Indonesia, thus require the rapid identification of victims. Teeth can be one of the primary identifiers besides fingerprints and DNA. It includes dentures worn by the victim. The Denture Marking System is a technique for labeling dentures to prevent it being swapped to another. Labeling usually uses embedded barcode, made from laminated paper or gravoply plate. Purpose: To compare Gravoply plate barcode to lamination barcode embedded in prothese for forensic identification. Methods: The type of research is a true experimental study with a posttest-only control group design. The sample size used in this study is 20 CDP samples divided into two test groups, one is Gravoply plate barcode and another one is laminated photo paper barcode. Results: 10 sampels of gravoply plate barcode can be read correctly, meanwhile 6 of laminated photo paper barcode showed incorrect reading and only 4 of total samples had correct result. Chi-Square test obtained p value (p<0,05) means there is significant difference between two embedding techniques. Conclusion: Embedding barcode in denture protheses for forensic identification is better using Gravoply plate rather than laminated photo paper.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30574/wjarr.2023.18.3.1122"
    },
    {
        "id": 22276,
        "title": "Political Education Document",
        "authors": "Anousha Peters, Paola Del Toro",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5749/ces.0802.04"
    },
    {
        "id": 22277,
        "title": "Embedding Experimental Research in the Learning Management System (Poster 17)",
        "authors": "Ben Motz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2002324"
    },
    {
        "id": 22278,
        "title": "SemanticGraph2Vec: Semantic graph embedding for text representation",
        "authors": "Wael Etaiwi, Arafat Awajan",
        "published": "2023-3",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.array.2023.100276"
    },
    {
        "id": 22279,
        "title": "Deep Discriminative Feature Learning for Document Image Manipulation Detection",
        "authors": "Kais Rouis, Petra Gomez-Krämer, Mickaël Coustaty, Saddock Kébairi, Vincent Poulain d’Andecy",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012410800003660"
    },
    {
        "id": 22280,
        "title": "Time to Document",
        "authors": "Alyxandra Vesey",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "In recent years, Björk has defied pop music criticism’s persistent myth of male genius by asserting her authorship as a singer, songwriter, composer, and producer. She expressed these concerns during a 2015 Pitchfork interview with Jessica Hopper by reflecting on the press’s minimization of her production work throughout her career and her desire to reclaim her creative authority as a model for younger female-identified artists. During this portion of the conversation, she mused, “I’ve sometimes thought about releasing a map of all my albums and just making it clear who did what.” Her impulse to challenge masculinist creation myths through documentation became the catalyst for Björk: Sonic Symbolism, a 2022 podcast miniseries sponsored by Mailchimp in which she discussed her albums’ creative processes with friends Oddný Eir and Ásmundur Jónson in a series of interviews. The title, which Björk defines as “a visual shortcut to describe sound,” provides the podcast’s framework for her articulation of authorial control, which she examines through album art that illustrates each cover’s mood and character; poetic synopses of each album’s unique audiovisual language; and references to her various studio, video, and stage collaborators. By using close listening to examine Björk’s conversations with Eir and Jónson and the episodes’ illustrative song segments, this article posits that Björk’s engagement with podcasting as an audio storytelling medium allows her to foreground her distinct speaking and singing voice as both a feminist intervention upon the recording industry and as a sonic metaphor for authorial control.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1525/jpms.2023.35.4.54"
    },
    {
        "id": 22281,
        "title": "Compliance and Data Security in Document Management Systems",
        "authors": "K. Kurteva",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/et59121.2023.10279617"
    },
    {
        "id": 22282,
        "title": "DIGITAL DOCUMENT MANAGEMENT SYSTEM",
        "authors": "",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49302"
    },
    {
        "id": 22283,
        "title": "Assessment of Approximations to the Embedding Potential in Frozen-Density Embedding Theory for the Calculation of Electric Field Gradients",
        "authors": "Yann Gimbal-Zofka, Cristina E. González-Espinoza, Christopher A. Rumble, Tomasz A. Wesolowski",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jctc.3c00773"
    },
    {
        "id": 22284,
        "title": "Embedding sustainability",
        "authors": "Caroline Voogd",
        "published": "2023-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12968/eyed.2023.23.21.5"
    },
    {
        "id": 22285,
        "title": "A Multiple QoS Metrics-Aware Virtual Network Embedding Algorithm",
        "authors": "Meilian Lu, Meng Li",
        "published": "2023-5-2",
        "citations": 1,
        "abstract": "Abstract\nAs a key issue of network virtualisation, virtual network embedding (VNE) aims to embed multiple virtual network requests (VNRs) from different applications onto the substrate network effectively. In real networks, about 90% of traffic is generated by different quality of service (QoS) sensitive applications. However, most existing VNE algorithms do not account for the difference. Although several VNE algorithms considered the delay metric of applications, they usually provide strict delay guarantees for all VNRs, leading to a low VNR acceptance ratio. In this paper, we focus on the VNE problem involving multiple QoS metrics and propose a multiple QoS metrics-aware VNE algorithm based on reinforcement learning (RLQ-VNE). We first classify VNRs according to their different requirements for multiple QoS metrics including delay, jitter and packet loss rate, and then introduce reinforcement learning to implement differentiated VNE. Specifically, RLQ-VNE provides strict QoS guarantees for the VNRs with high-level QoS requirements and provides lower QoS guarantees for the VNRs with low-level QoS requirements, thus balancing the QoS guarantee and request acceptance ratio. Simulation results from multiple experimental scenarios show that RLQ-VNE improves the request acceptance ratio and network resource utilisation by sacrificing less QoS.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/comjnl/bxad050"
    },
    {
        "id": 22286,
        "title": "Towards a Fusion: Embedding Object-Based Learning for addressing Eco-Social Justice in Design Education",
        "authors": "Lezhi Zang",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5151/ead2023-1bil-03posit-01zang"
    },
    {
        "id": 22287,
        "title": "Two question-embedding strategies and answer-orientedness",
        "authors": "Deniz Özyıldız, Wataru Uegaki",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "Japanese and Turkish attitude predicates combine with two main kinds of embedded clauses: Nominalizations, and clauses introduced by the morphemes to and diye. We describe their interrogative variants, showing that nominalizations give rise to answer-oriented inferences with responsive predicates (e.g., factivity, belief), but that diye/to interrogatives are question-oriented and entail that the attitude holder linguistically produces the interrogative. We propose a compositional fragment where attitude predicates take nominalizations as arguments, which they may impose semantic restrictions on, and where diye/to-clauses modify and enrich attitude meanings with a linguistic production inference.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3765/1rcmh783"
    },
    {
        "id": 22288,
        "title": "Constrained Dynamic Virtual Network Embedding",
        "authors": "Junkai He, Makhlouf Hadji, Djamal Zeghlache",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcn58197.2023.10223368"
    },
    {
        "id": 22289,
        "title": "The role of stress in the biological embedding of experience",
        "authors": "Robert Kumsta",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.psyneuen.2023.106364"
    },
    {
        "id": 22290,
        "title": "Towards a Fusion: Embedding Object-Based Learning for addressing Eco-Social Justice in Design Education",
        "authors": "Lezhi Zhang",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5151/ead2023-1bil-03posit-01zhang"
    },
    {
        "id": 22291,
        "title": "EMBEDDING DIVERSITY AND INCLUSION IN INITIAL TEACHER EDUCATION: POLICIES AND PRACTICE",
        "authors": "Camelia Nadia Bran",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/iceri.2023.0362"
    },
    {
        "id": 22292,
        "title": "A Review on Applications of Holomorphic Embedding Methods",
        "authors": "Kaiyang Huang, Kai Sun",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ien.2023.0037"
    },
    {
        "id": 22293,
        "title": "E8⊗E8 Julia Set Embedding via Bohmian Trajectories ⊗ Cl(16) ⊗ 26DBST",
        "authors": "Kaylin Thornton",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4563578"
    },
    {
        "id": 22294,
        "title": "AsthmaSCELNet: A Lightweight Supervised Contrastive Embedding Learning Framework for Asthma Classification Using Lung Sounds",
        "authors": "Arka Roy, Udit Satija",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-428"
    },
    {
        "id": 22295,
        "title": "Classification and Embedding of Semantic Scene Graphs for Active Cross-Domain Self-Localization",
        "authors": "Yoshida Mitsuki, Yamamoto Ryogo, Wakayama Kazuki, Hiroki Tomoe, Tanaka Kanji",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011621200003417"
    },
    {
        "id": 22296,
        "title": "Embedding Esg Essentials To Attain Sustainability",
        "authors": "Kailash Kalyani",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33516/maj.v58i3.37-41p"
    },
    {
        "id": 22297,
        "title": "Force-directed graph embedding with hops distance",
        "authors": "Hamidreza Lotfalizadeh, Mohammad Al Hasan",
        "published": "2023-12-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386461"
    },
    {
        "id": 22298,
        "title": "Self-Supervised Acoustic Word Embedding Learning via Correspondence Transformer Encoder",
        "authors": "Jingru Lin, Xianghu Yue, Junyi Ao, Haizhou Li",
        "published": "2023-8-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-359"
    },
    {
        "id": 22299,
        "title": "A novel multi document summarization with document-elements augmentation for learning materials using concept based ILP and clustering methods",
        "authors": "K. Sakkaravarthy Iyyappan, S. R. Balasundaram",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/1206212x.2023.2284446"
    },
    {
        "id": 22300,
        "title": "Material forgery of the document",
        "authors": "Ewelina Rytelewska",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "The article is an attempt to confirm the recent changes in chapter XXXIV of the cur-rent Penal Code, with particular emphasis on crimes against the credibility of documents. This applies mainly to changes resulting from the consolidated text of April 28, 2022, i.e. Journal Laws of 2022, item 1138 and changes: Journal Laws of 2022, item 1726, item 1855; Sejm printout 1911 and 2024. Where the main goal is to explain and provide a basic comment speci-fying the changes made by the legislator for the proper understanding of the issue of material falsification, as defined in Art. 270 k.k..Analyzing the scope of legal regulations defining the crime of material forgery of  a document in the content of art. 270 k.k., it is necessary to discuss the subject of protection and the subject page, taking into account the notion of a document, the subject of a common crime and the subject page  1,  2 and  3 of Art. 270 of the Penal Code. A prag-matic commentary and in-depth descriptions of basic concepts like; forgery of a document, alteration of a document, use as an authentic one, or the criteria of a minor case indicate the correct interpretation of the discussed issue of material falsification. The argumentation pre-sented in the article refers to the views of the doctrine and jurisprudence in the discussed thematic scope. In order to properly illustrate the threats and the scale of the commented cate-gory of crime on the documents, two tables present an analysis of the size and scale of crimes identified under Art. 270 k.k., using statistical data of the Ministry of Justice and the Police. The literature listed in the study includes cited items and publications relevant to the commen-ted article.The issues presented in the study cover the legal status as of November 30, 2022.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5604/01.3001.0053.9745"
    },
    {
        "id": 22301,
        "title": "Developing and Implementing School Policy: Embedding Equity Across the District",
        "authors": "Daniel Reyes-Guerra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2017846"
    },
    {
        "id": 22302,
        "title": "Abed at KSAA-RD Shared Task: Enhancing Arabic Word Embedding with Modified BERT Multilingual",
        "authors": "Abdelrahim Qaddoumi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.42"
    },
    {
        "id": 22303,
        "title": "EMBEDDING EQUALITY, DIVERSITY AND INCLUSION &amp; SUSTAINABILITY INTO CURRICULUM VIA POSTGRADUATE REVALIDATION",
        "authors": "Shuai Zhang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/iceri.2023.2185"
    },
    {
        "id": 22304,
        "title": "Intelligent system embedding design rules for vector-based textile pattern generation",
        "authors": "Hong Qu, K.P. Chau, P.Y. Mok",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31274/itaa.17600"
    }
]