[
    {
        "id": 21171,
        "title": "Credit Card Fraud Detection Using Machine Learning Algorithms",
        "authors": "Jai Gupta",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/sr231123121203"
    },
    {
        "id": 21172,
        "title": "A Review: Credit Card Fraud Detection in Banks using Machine Learning Algorithms",
        "authors": "Muhammad Hazeel Ahmed",
        "published": "No Date",
        "citations": 0,
        "abstract": "A fraud Detection System",
        "link": "http://dx.doi.org/10.14293/s2199-1006.1.sor-.ppfi7p0.v2"
    },
    {
        "id": 21173,
        "title": "Application of Machine Learning Algorithms With Balancing Techniques for Credit Card Fraud Detection: A Comparative Analysis",
        "authors": " Shiksha",
        "published": "2022-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119821908.ch12"
    },
    {
        "id": 21174,
        "title": "Credit Card Fraud Intelligent Detection Based on Machine Learning",
        "authors": "Duojiao Mu",
        "published": "2022-2-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eebda53927.2022.9744875"
    },
    {
        "id": 21175,
        "title": "CREDIT CARD FRAUD DETECTION USING MACHINE LEARNING ALGORITHMS",
        "authors": " K.Kowsalya,  Mrs.Vasumathi,  Dr.S.Selvakani",
        "published": "2024-3-12",
        "citations": 0,
        "abstract": "The Credit card frauds represent facile and amiable targets, particularly as the proliferation of e-commerce and various online platforms has led to a commensurate expansion in online payment modalities, thereby augmenting the susceptibility to online fraudulent activities. In response to the escalating rates of fraudulent incidents, researchers have undertaken the utilization of diverse machine learning methodologies to ascertain and scrutinize frauds within the realm of online transactions.\nThe primary objective of this scholarly endeavor is to formulate and advance an innovative fraud detection modus operandi tailored for Streaming Transaction Data. The overarching goal is to meticulously scrutinize the historical transaction particulars of patrons and distill discernible behavioral patterns. This involves the clustering of cardholders into disparate cohorts predicated upon their transactional magnitudes. Subsequently, a sliding window strategy is employed to amalgamate transactions conducted by cardholders across distinct groups, facilitating the extraction of their respective behavioral patterns.\nConsecutively, diverse classifiers trained on these distinct groups, and the classifier exhibiting superior rating scores is earmarked as one of the preeminent methods for prognosticating fraudulent activities. This is succeeded by the implementation of a feedback mechanism aimed at mitigating the challenges posed by the phenomenon of concept drift. The empirical investigation detailed in this paper is grounded in the analysis of a European credit card fraud dataset.\nIt is imperative for credit card companies to adeptly discern instances of fraudulent credit card transactions to preclude customers from incurring charges for items they did not legitimately acquire. The resolution to such quandaries lies in the realm of Data Science, a discipline whose significance, when coupled with Machine Learning, is of paramount importance. This undertaking endeavors to elucidate the construction of a model utilizing machine learning techniques for Credit Card Fraud Detection.\nThe Credit Card Fraud Detection Problem entails the modeling of historical credit card transactions, incorporating data from those that transpired as fraudulent. Subsequently, this model is employed to ascertain the veracity of new transactions, distinguishing between fraudulent and non-fraudulent activities. The primary aim is the meticulous detection of 100% of fraudulent transactions, while concurrently minimizing instances of erroneous classifications of non-fraudulent transactions. Credit Card Fraud Detection serves as a quintessential exemplar of classification challenges.\nIn the course of this endeavor, significant emphasis has been placed on the analysis and pre-processing of datasets. Furthermore, a diverse array of anomaly detection algorithms, including the Local Outlier Factor and Isolation Forest algorithm, have been deployed on Principal Component Analysis (PCA) transformed Credit Card Transaction data. \nKEYWORDS: Card-Not-Present frauds, Card-Present-Frauds, Concept Drift,,Credit card fraud, applications of machine  \nlearning, data science.",
        "link": "http://dx.doi.org/10.36713/epra16045"
    },
    {
        "id": 21176,
        "title": "Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms",
        "authors": "Mark Lokanan",
        "published": "No Date",
        "citations": 0,
        "abstract": "The ease with which mobile money is used to facilitate cross-border payments presents a global threat to law enforcement in the fight against laundering and terrorist financing. This paper aims to use machine learning classifiers to predict transactions flagged as fraud in mobile money transfers. Data for this paper came from real-time transactions that stimulate a well-known mobile transfer fraud scheme. This paper uses logistic regression as the baseline model and compares it with ensembles and gradient descent models. The results indicate that the established logistic regression model did not perform too poorly compared to the other models. The random forest classifier had the most outstanding performance among all measures. The amount of money transferred was the top feature to predict money laundering transactions through mobile money transfers. These findings suggest that more research is needed to improve the logistic regression model. The random forest classifier should be further explored as a potential tool for law enforcement and financial institutions to detect money laundering activities in mobile money transfers.\n",
        "link": "http://dx.doi.org/10.32388/elvm4l"
    },
    {
        "id": 21177,
        "title": "Machine Learning Algorithms in Fraud Detection: Case Study on Retail Consumer Financing Company",
        "authors": "Nadya Intan Mustika, Bagus Nenda, Dona Ramadhan",
        "published": "2021-12-30",
        "citations": 3,
        "abstract": "This study aims to implement a machine learning algorithm in detecting fraud based on historical data set in a retail consumer financing company. The outcome of machine learning is used as samples for the fraud detection team. Data analysis is performed through data processing, feature selection, hold-on methods, and accuracy testing. There are five machine learning methods applied in this study: Logistic Regression, K-Nearest Neighbor (KNN), Decision Tree, Random Forest, and Support Vector Machine (SVM). Historical data are divided into two groups: training data and test data. The results show that the Random Forest algorithm has the highest accuracy with a training score of 0.994999 and a test score of 0.745437. This means that the Random Forest algorithm is the most accurate method for detecting fraud. Further research is suggested to add more predictor variables to increase the accuracy value and apply this method to different financial institutions and different industries.",
        "link": "http://dx.doi.org/10.21532/apfjournal.v6i2.216"
    },
    {
        "id": 21178,
        "title": "Fraud Detection and Prevention Using Machine Learning Algorithms: A Review",
        "authors": "G. Jaculine Priya, S. Saradha",
        "published": "2021-2-11",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icees51510.2021.9383631"
    },
    {
        "id": 21179,
        "title": "Combining Control Rules, Machine Learning Models, and Community Detection Algorithms for Effective Fraud Detection",
        "authors": "Tinsae Tadesse",
        "published": "2022-11-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ict4da56482.2022.9971235"
    },
    {
        "id": 21180,
        "title": "Optimizing Insurance Fraud Claim Detection through Machine Learning: A Comprehensive Approach for Improved Fraud Detection",
        "authors": "Aayush .",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nInsurance fraud is a growing concern, prompting proactive measures through advanced machine learning techniques. This research focuses on constructing a predictive model for distinguishing genuine and fraudulent auto insurance claims. The dataset, comprising 1,000 instances and 40 attributes, covers customer demographics, policy details, incidents, and financial data. Early fraud detection is crucial for financial loss mitigation and maintaining insurance system integrity. The study employs data preprocessing to handle missing values and features XGBoost importance, variance thresholding, and correlation analysis for enhanced model interpretability. The machine learning model integrates nine algorithms, with a hard-voting ensemble of Logistic Regression and XGBoost demonstrating competitive accuracy, reaching 83.0%. Results highlight Linear Discriminant Analysis as the leading classifier, achieving 84% accuracy. The ensemble approach achieves 83.0% accuracy with a notable precision of 91%, showcasing the strength of combining diverse models. The study emphasizes the significance of preprocessing, feature selection, and ensemble learning for fraud detection optimization. The refined model achieves a minimal Brier loss of 0.00054, indicating minimal discrepancies in predicted probabilities and actual outcomes in binary classification. Exploration of principal component analysis (PCA) with multiple linear regression reveals a trade-off between model simplicity and performance. Retaining 32 components preserves 95% of variance, achieving a balance at 0.7967, while keeping 35 components reaches the highest value of 0.9991, showcasing dimensionality reduction's potential to capture nearly all the data variance.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-4109015/v1"
    },
    {
        "id": 21181,
        "title": "Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms",
        "authors": "Mark Lokanan",
        "published": "No Date",
        "citations": 0,
        "abstract": "The ease with which mobile money is used to facilitate cross-border\npayments presents a global threat to law enforcement in the fight\nagainst laundering and terrorist financing. This paper aims to use\nmachine learning classifiers to predict transactions flagged as a fraud\nin mobile money transfers. Data for this paper came from real-time\ntransactions that stimulate a  well-known mobile transfer fraud scheme.\nThis paper uses logistic regression as the baseline model and compares\nit with ensembles and gradient descent models. The results indicate that\nthe established logistic regression model did not perform too poorly\ncompared to the other models. The random forest classifier had the most\noutstanding performance among all measures. The amount of money\ntransferred was the top feature to predict money laundering transactions\nthrough mobile money transfers. These findings suggest that more\nresearch is needed to improve the logistic regression model. The random\nforest classifier should be further explored as a potential tool for law\nenforcement and financial institutions to detect money laundering\nactivities in mobile money transfers.",
        "link": "http://dx.doi.org/10.22541/au.168172408.81196220/v1"
    },
    {
        "id": 21182,
        "title": "Detection of Credit Card Fraud using Machine Learning Algorithms",
        "authors": "Akhilesh Kumar Singh",
        "published": "2022-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smart55829.2022.10047099"
    },
    {
        "id": 21183,
        "title": "Analysis of Credit Card Fraud Transaction Detection using Machine Learning Algorithms",
        "authors": "Shashank Sahu, Neeta Sahu",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397696"
    },
    {
        "id": 21184,
        "title": "Credit card Fraud Detection based on Machine Learning Algorithms",
        "authors": "Heta Naik, Prashasti Kanikar",
        "published": "2019-3-15",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2019918521"
    },
    {
        "id": 21185,
        "title": "Credit Card Fraud Detection using Machine Learning Algorithms",
        "authors": "",
        "published": "2022-6-20",
        "citations": 0,
        "abstract": "With the advancement of technology, the use of credit cards for shopping is also increasing. Since credit cards are the most popular payment method, errors on these credit cards are also increasing. This white paper presents the techniques used to detect credit card fraud as an overview paper. Fraud detection should be performed as soon as it is executed. Fraud detection methods are constantly evolving to prevent or prevent criminals from taking over their strategies. The transaction was determined to be normal, abnormal, or suspicious based on the initial assumptions. When a transaction is determined to be suspicious, their beliefs are further strengthened or weakened by comparing their similarities to fraudulent or real transactions using Bayesian learning",
        "link": "http://dx.doi.org/10.36647/ijercse/09.06.art003"
    },
    {
        "id": 21186,
        "title": "Credit Card Fraud Detection Using Machine Learning\nClassification Algorithms over Highly Imbalanced Data",
        "authors": "",
        "published": "2020-5-29",
        "citations": 3,
        "abstract": ":Most online customers use cards to pay for their purchases. As charge cards become the most mainstream\nstrategy for installment, instances of misrepresentation relationship with it too increases. The primary goal of this\nventure is to be ready to perceive false exchanges from non-fake exchanges. In request to do so,primarily,data\nmining methods are utilized to examine the examples and attributes of deceitful and non-fake\ntransactions.Then,machine learning systems are utilized to foresee the fake and non-fake exchanges automatically.\nAlgorithms LR (Logistic Regression) is used. Therefore, the blend of AI and information mining procedures are\nutilized to distinguish the fake and non-fake exchanges by learning the examples of the information. Models are\nmade utilizing these calculations and afterward precision,accuracy,recall are determined and an examination is\nmade.",
        "link": "http://dx.doi.org/10.46243/jst.2020.v5.i3.pp138-146"
    },
    {
        "id": 21187,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Pratikkumar Barot",
        "published": "2022-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/7cwta5"
    },
    {
        "id": 21188,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Sionfou Coulibaly",
        "published": "2022-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/tahcxy"
    },
    {
        "id": 21189,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Ijaz Shah",
        "published": "2022-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ov48zc"
    },
    {
        "id": 21190,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Wei Xu",
        "published": "2022-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/l89haj"
    },
    {
        "id": 21191,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Santosh Joshi",
        "published": "2022-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ms63ym"
    },
    {
        "id": 21192,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Sonal Linda",
        "published": "2022-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/i0r6h2"
    },
    {
        "id": 21193,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Ujjwal Das",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/getg4h"
    },
    {
        "id": 21194,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Micheal Arowolo",
        "published": "2022-9-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/z7rnmy"
    },
    {
        "id": 21195,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Dau Hoang",
        "published": "2022-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/z78ilb"
    },
    {
        "id": 21196,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Saeedreza Shehnepoor",
        "published": "2022-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/q6uktd"
    },
    {
        "id": 21197,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Shahid Tufail",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/82nbsh"
    },
    {
        "id": 21198,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Amit Gupta",
        "published": "2022-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/uuqxr3"
    },
    {
        "id": 21199,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Albert Buabeng",
        "published": "2022-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/147mac"
    },
    {
        "id": 21200,
        "title": "Fraud Detection using Machine Learning",
        "authors": "Akinbusola Olushola, Joseph Mart",
        "published": "No Date",
        "citations": 0,
        "abstract": "The winding path of this research into fraud detection using traditional machine learning (ML) led us through landscapes of both impressive strides and thought-provoking hurdles. As we retrace our steps, revisiting key findings and peering into the technology's potential, a nuanced understanding of its effectiveness comes into focus. Our primary contribution lies in demonstrating the surprising efficacy of traditional ML algorithms in combating fraudulent activities. By meticulously dissecting the Credit Card Fraud dataset and employing a rigorous methodological approach, we established that these algorithms can achieve commendable accuracy in identifying suspicious transactions. This not only reaffirms the viability of ML in fraud detection but also offers a valuable roadmap for future research and practical implementation. Our journey unveiled a fascinating tapestry of insights. We observed that different ML algorithms excel in specific domains. While Random Forest and Gradient Boosting proved to be overall champions, Logistic Regression [19] displayed exceptional talent in pinpointing certain types of fraudulent behavior. This underscores the importance of wielding a diverse arsenal of algorithms to achieve comprehensive fraud detection. Furthermore, we discovered that feature engineering is not merely a parlor trick, but a crucial stage in the dance with fraud. By crafting tailored features from the raw data, we were able to significantly enhance the accuracy of our models. This highlights the critical role of domain expertise in understanding the subtle nuances of fraudulent transactions and translating them into actionable features for ML algorithms. However, the ever-shifting sands of fraud necessitate constant vigilance and adaptation. Our research emphasizes the paramount importance of real-time monitoring and model updates to stay ahead of evolving fraudster tactics. This agility will be the key to unlocking the full potential of ML in this dynamic arena. Yet, our exploration would be remiss if it failed to acknowledge the limitations that linger within traditional ML. The \"black box\" nature of some algorithms can hinder interpretability and raise concerns about bias. Additionally, their reliance on historical data can render them vulnerable to novel fraud schemes that haven't yet graced the training dataset. However, these challenges should not overshadow the immense potential of traditional ML. Its ability to handle large datasets, learn from experience, and adapt to changing patterns remains invaluable in the fight against fraud. By combining traditional ML with other approaches, such as explainable AI and deep learning, we can unlock even greater capabilities and build robust, interpretable fraud detection systems that are not only effective, but also transparent and accountable. This research journey into traditional ML for fraud detection has illuminated both its strengths and weaknesses, paving the way for future advancements. By embracing its potential and addressing its limitations, we can leverage this powerful technology to create a safer and more secure digital landscape for everyone. The path forward lies in harnessing the diverse power of ML, while remaining mindful of its limitations, to build a future where fraudsters find themselves perpetually outwitted and outmaneuvered.",
        "link": "http://dx.doi.org/10.14293/pr2199.000647.v1"
    },
    {
        "id": 21201,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Guoping Zeng",
        "published": "2022-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/dqindd"
    },
    {
        "id": 21202,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Hui Hui",
        "published": "2022-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/4nuboa"
    },
    {
        "id": 21203,
        "title": "Performance comparison of machine learning algorithms for credit card fraud detection",
        "authors": "Zhendong Chen",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Digital payment methods like credit cards have increased in popularity and usage dramatically in the past two decades along with the whole world transforming to digital and the emergence of E-commerce like Amazon, Shopify, and eBay that completely changed peoples spending habits. There is no doubt that online shopping and credit cards have brought huge conveniences to everyones daily lives, however, it also makes committing payment fraud easier than ever before. Payment fraud can be categorized into a variety of types and the research is focused on fraud where a credit card gets accessed by unknown individuals or groups with unauthorized transactions. The research consists of three main parts: 1. Determine a suitable metric to measure how well different machine learning algorithms work in terms of the ability to correctly identify fraudulent transactions and the practicability when being utilized in real-life scenarios. 2. Compares the performance of the algorithms including Gaussian Naive Bayes, Logistic Regression, SVM, Random Forest, and Sequential Neutral Network. 3. Explores techniques like random undersampling and smote oversampling that handle imbalanced data and evaluates their impacts on the performance of the algorithms. Throughout the research, it is shown that the recall and precision for fraudulent transactions should be the priority metric to measure how capable the machine learning algorithms are in detecting credit card fraud. Random forest performed the best overall compared to 4 other algorithms examined in the research. In addition, random undersampling made the overall performance of the algorithms worse, and smote oversampling had positive impacts on the recall for the Random Forest and Sequential Neural Network algorithms but with a slight drop in precision.",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230901"
    },
    {
        "id": 21204,
        "title": "Credit Card Fraud Detection using Machine Learning Algorithms",
        "authors": "Vaishnavi Nath Dornadula, S Geetha",
        "published": "2019",
        "citations": 136,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2020.01.057"
    },
    {
        "id": 21205,
        "title": "Analysis of Machine Learning Algorithms for Insurance Fraud Detection",
        "authors": "Rahul Chauhan, Rohit Negi, Deepak Kumar Verma",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/r10-htc57504.2023.10461774"
    },
    {
        "id": 21206,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Wilton Bernardino",
        "published": "2022-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/wx82k7"
    },
    {
        "id": 21207,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Yu Xie",
        "published": "2022-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/pqtmhr"
    },
    {
        "id": 21208,
        "title": "Credit Card Fraud Detection Using Unsupervised Machine Learning Algorithms",
        "authors": "Hariteja Bodepudi",
        "published": "2021-8-25",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22312803/ijctt-v69i8p101"
    },
    {
        "id": 21209,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Yufei Xia",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/pe0u3g"
    },
    {
        "id": 21210,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Elaheh Moharamkhani",
        "published": "2022-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ast09x"
    },
    {
        "id": 21211,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Zaleha Othman",
        "published": "2022-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/8u7npe"
    },
    {
        "id": 21212,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Siyu Zhou",
        "published": "2022-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/7exhnq"
    },
    {
        "id": 21213,
        "title": "Credit Card Fraud Detection Using State-of-the-Art Machine Learning and Deep Learning Algorithms",
        "authors": "M.Shraddha -, K. Sumedha -, V.Veda Samhitha -",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "This research study aims to detect credit card frauds, such as accessibility of public data, high-class imbalance data, changes in fraud nature, and high rates of false alarm. Machine learning and deep learning algorithms have been used to detect frauds, but there is still a need to apply state-of-the-art deep learning algorithms to reduce fraud losses. Comparative analysis of both machine learning and deep learning algorithms was performed to find efficient outcomes. The European card benchmark dataset was used to evaluate the proposed model, which outperformed the state-of-the-art machine learning and deep learning algorithms.",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i03.2926"
    },
    {
        "id": 21214,
        "title": "Performance Evaluation of Machine Learning Algorithms for Credit Card Fraud Detection",
        "authors": "Sangeeta Mittal, Shivani Tyagi",
        "published": "2019-1",
        "citations": 48,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/confluence.2019.8776925"
    },
    {
        "id": 21215,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Sanjiv Kumar Jain",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/36vlh4"
    },
    {
        "id": 21216,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Subrat Kumar Dang",
        "published": "2022-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/nuaglw"
    },
    {
        "id": 21217,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Dr Rajesh Pasupuleti",
        "published": "2022-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/8uwy37"
    },
    {
        "id": 21218,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Yan-Xue Wu",
        "published": "2022-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/bpzejo"
    },
    {
        "id": 21219,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Madhukar Rao Gandra",
        "published": "2022-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/6sa5ih"
    },
    {
        "id": 21220,
        "title": "Risks of Digital Transformation: Review of Machine Learning Algorithms in Credit Card Fraud Detection",
        "authors": "Gunes Gursoy, Asaf Varol",
        "published": "2021-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iisec54230.2021.9672354"
    },
    {
        "id": 21221,
        "title": "Credit Card Fraud Detection Using Machine Learning: A Comparative Study of Ensemble Learning Algorithms",
        "authors": "Susmit Sekhar Bhakta, Sangita Ghosh, Bikash Sadhukhan",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icscc59169.2023.10335075"
    },
    {
        "id": 21222,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Jyoti Umesh Kundale",
        "published": "2022-12-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/iidau1"
    },
    {
        "id": 21223,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Mustafa S. Kadhm",
        "published": "2022-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/af6x8f"
    },
    {
        "id": 21224,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Atul Kumar Uttam",
        "published": "2022-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ejml3v"
    },
    {
        "id": 21225,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Dr Abdul Shaikh",
        "published": "2022-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/rw0kyf"
    },
    {
        "id": 21226,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Guang-Yih Sheu",
        "published": "2022-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/axw5yk"
    },
    {
        "id": 21227,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Sunil  Kumar Verma",
        "published": "2022-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/0iw6a3"
    },
    {
        "id": 21228,
        "title": "Cloud Based Credit Card Fraud Detection System in Banking Using Machine Learning and Deep Learning algorithms",
        "authors": "Sai Madhuree Gopavaram, P. Vinothiyalakshmi",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307070"
    },
    {
        "id": 21229,
        "title": "Investigation of the Noise Sensitivity of Machine Learning Algorithms on Credit Card Fraud Detection",
        "authors": "İlhan Aytutuldu, Mürüvvet Aslı Aydin",
        "published": "2021-6-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu53274.2021.9477832"
    },
    {
        "id": 21230,
        "title": "Research on improvements of fraud detection system: basing on improved machine learning algorithms",
        "authors": "Zhiding Zhang",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "Nowadays, commercial fraud behaviors commonly occur in many industries. However, due to obstacles like concept drift, imbalanced dataset and uneven distribution of fraud entries, Fraud Detection System (FDS) fails to identify such behaviors. Among the problems mentioned above, most research focus on dealing with skewed dataset. This paper first presents common application scenarios of FDS which consist of credit card fraud, insurance fraud and supply chain fraud. Then, this study introduces five representative methods in dealing with problems mentioned above, which are K Nearest Neighbors-Synthetic Minority Oversampling Technique-Long Short-term Memory Networks (kNN-SMOTE-LSTM), Generative Adversarial Nets-AdaBoost-Decision tree (GAN-AdaBoost-DT), Wasserstein GAN-Kernel Density Estimation-Gradient Boosting DT (WGAN-KDE-GBDT), Time-LSTM (TLSTM) and Adaptive Synthetic Sampling-Sequential Forward Selection-Random Forest (ADASYN-SFS-RF). KNN-SMOTE-LSTM adopts KNN as an identifying classifier so as to only retain true samples. GAN-AdaBoost-DT generates new samples without referring to real transactions. WGAN-KDE-GBDT uses Wasserstein Distance as distance measurement instead, and thus improves training speed and guarantees successful generation. TLSTM tires to consider the weights of different time intervals and measures the similarity between the simulated behavior and the genuine behavior. ADASYN-SFS-RF employs SFS algorithm, basing on RF, to only reserve optimal subsets of features. Finally, result metrics prove that those improved algorithms do improve the overall performance of FDS, even if with limitations at some indicators.",
        "link": "http://dx.doi.org/10.54254/2755-2721/27/20230146"
    },
    {
        "id": 21231,
        "title": "Advancing Credit Card Fraud Detection: A Review of Machine Learning Algorithms and the Power of Light Gradient Boosting",
        "authors": "Farhan Aslam",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11648/ajcst.20240701.12"
    },
    {
        "id": 21232,
        "title": "Early Prediction of Credit Card Fraud Detection using Isolation Forest Tree and Local Outlier Factor Machine Learning Algorithms",
        "authors": "",
        "published": "2020-6-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.6/077"
    },
    {
        "id": 21233,
        "title": "Credit Card Fraud Detection using Machine Learning Algorithms",
        "authors": " Varun Kumar K S,  ",
        "published": "2020-8-5",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17577/ijertv9is070649"
    },
    {
        "id": 21234,
        "title": "Review of: \"Predicting Mobile Money Transaction Fraud using Machine Learning Algorithms\"",
        "authors": "Qasem Abu Al-Haija",
        "published": "2022-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/r8ytd6"
    },
    {
        "id": 21235,
        "title": "Survey Paper on Fraud Detection in Medicare Using Machine Learning",
        "authors": "Muthulakshmi S.",
        "published": "2020-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37200/ijpr/v24i5/pr2020130"
    },
    {
        "id": 21236,
        "title": "Comparative Evaluation of Machine Learning Algorithms with Parameter Optimization and Feature Elimination for Fraud Detection",
        "authors": "Yunus Koc, Mustafa Cetin",
        "published": "2021-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecet52533.2021.9698686"
    },
    {
        "id": 21237,
        "title": "Integrating Machine Learning Algorithms With Quantum Annealing Solvers for Online Fraud Detection",
        "authors": "Haibo Wang, Wendy Wang, Yi Liu, Bahram Alidaee",
        "published": "2022",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2022.3190897"
    },
    {
        "id": 21238,
        "title": "Comparative Analysis of Machine Learning Algorithms using GANs through Credit Card Fraud Detection",
        "authors": "Emilija Strelcenia, Simant Prakoonwit",
        "published": "2022-12-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/contesa57046.2022.10011268"
    },
    {
        "id": 21239,
        "title": "Comparative Analysis of Machine Learning Algorithms through Credit Card Fraud Detection",
        "authors": "Rishi Banerjee, Gabriela Bourla, Steven Chen, Mehal Kashyap, Sonia Purohit",
        "published": "2018-10-5",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/urtc45901.2018.9244782"
    },
    {
        "id": 21240,
        "title": "Current Research Landscape of Machine Learning Algorithms in Online Identity Fraud Prediction and Detection",
        "authors": "Brad Conlin, Umar Ruhi",
        "published": "2021-11-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictmod52902.2021.9739308"
    },
    {
        "id": 21241,
        "title": "Comparative Study of Machine Learning Algorithms for Fraud Detection in Blockchain",
        "authors": "Madhuparna Bhowmik, Tulasi Sai Siri Chandana, Bhawana Rudra",
        "published": "2021-4-8",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccmc51019.2021.9418470"
    },
    {
        "id": 21242,
        "title": "Evaluation of Supervised Machine Learning Algorithms for Credit Card Fraud Detection: A Comparison",
        "authors": "Qazaleh Sadat Mirhashemi, Negar Nasiri, Mohammad Reza Keyvanpour",
        "published": "2023-5-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwr57742.2023.10139098"
    },
    {
        "id": 21243,
        "title": "Credit Card Fraud Detection using Python &amp; Machine Learning Algorithms",
        "authors": "Ekta Mangal",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: Browsing and many other online sites have increased the digital payment modes through which risk of frauds during transactions got increased. It is necessary to have a look on fraud transactions so that the customers does not pay for what they haven’t done. Such complications may be intercept with Data mining through Machine Learning. It aims to display the customization of a data set by applying machine learning with Credit Card Fraud Detection. The CCFD complications comprise of analyzing previous transactions through credit card along the data of the unauthorized users. These models are then applied to analyze whether the new transaction is authorized or not. In this project, we have concentrated on examining and pre-refining the data sets in addition to the deployment of numerous inconsistency observation methods such as Logical Regression, Random Forest, Decision tree, XG Boost on Credit Card Transaction data.",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.52242"
    },
    {
        "id": 21244,
        "title": "Analysis of Supervised Machine Learning Algorithms in the Context of Fraud Detection",
        "authors": "Pradeep Verma, Poornima Tyagi",
        "published": "2022-4-24",
        "citations": 13,
        "abstract": "In today’s era, where ‘time’ is considered as ‘money,’ people are completely depending on e-commerce and online banking for their routine purchases, shopping, and financial transactions. This increasing dependency on e-commerce are increasing fraud in online transactions, and credit card fraud is one example. Such malicious and unethical practices may cause identity theft and monitory loss to the people across the world. In this research paper, our effort is to identify the best Supervised Machine Learning algorithm that helps in classifying fraudulent and non-fraudulent transactions under credit card fraud on an imbalanced dataset. To conduct this research and compare the results, we have used five different Supervised Machine Learning Classification techniques. On implementing these machine learning techniques, it has been observed that both Supervised Vector Classifier and Logistic Regression Classifier perform better for detecting credit card fraud in an imbalanced dataset.",
        "link": "http://dx.doi.org/10.1149/10701.7189ecst"
    },
    {
        "id": 21245,
        "title": "Healthcare Fraud Detection Using Machine Learning",
        "authors": "Idowu  Thomas Aruleba, Yanxia Sun",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4631193"
    },
    {
        "id": 21246,
        "title": "Credit Card Fraud Detection Using Machine Learning",
        "authors": "Vishal Vishal Kumar",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "To make life better, many mechanisms in modern environment are carried out via the Internet. The economy is expanding yet on the other side, there is a lot of illegal and unauthorised activity carried throughout the country that is seriously hampering that progress. Scam instances, which mislead individuals while also causing economic losses, are just one of them. In realistic conditions, fraud involving credit cards surveillance is the main emphasis of this research. Contrary to earlier eras, the number of credit card scammers is drastically increasing right now. Criminals use various forms of innovation, fake documents, and deception to con others and take their cash. Therefore, it is extremely crucial to discover a solution to these frauds. As technology advances, it becomes harder to keep up with the behaviour and trends of illegal activities. Ai technology, machine learning, as well as other relevant data technology fields have advanced to the point that it is currently feasible to expedite this process and reduce the volume of labour-intensive effort needed in recognizing credit card scams. The user-submitted utilization of credit cards database might be collected initially, then using machine learning approach; it would be split into databases for testing and training purposes. This methodical technique could be utilized by researchers once they have evaluated both the larger information collection and the user-provided available data collection. Enhance the accuracy of the outcome statistics after that. Depending on its exactness and precision, a technology's efficiency is assessed. The results show that XG-Boost and Random Forest techniques have the greatest performance.",
        "link": "http://dx.doi.org/10.36647/ciml/04.01.a009"
    },
    {
        "id": 21247,
        "title": "Review on Credit Card Fraud Detection using Machine Learning Algorithms",
        "authors": "Poo ja, Dr. Ashle sha",
        "published": "2020-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22312803/ijctt-v68i6p113"
    },
    {
        "id": 21248,
        "title": "Review on Credit Card Fraud Detection using Machine Learning Algorithms",
        "authors": "Poo ja, Dr. Ashle sha",
        "published": "2020-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22312803/ijctt-v68i6p104"
    },
    {
        "id": 21249,
        "title": "An Analysis of the Most Used Machine Learning Algorithms for Online Fraud Detection",
        "authors": "Elena-Adriana MINASTIREANU, Gabriela MESNITA",
        "published": "2019-3-30",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12948/issn14531305/23.1.2019.01"
    },
    {
        "id": 21250,
        "title": "Credit Card Fraud Detection Using Machine Learning Algorithms",
        "authors": "Muskan Banu, Prof. Kavitha G",
        "published": "2022-10-31",
        "citations": 0,
        "abstract": "Abstract: Credit Card Fraud can be defined as a case where a person uses someone else’s credit card for personal reasons while the owner and the card-issuing authorities are unawareof the fact that the card is being used. Credit card frauds are easy and friendly targets. E-commerce and many other online sites have increased the online payment modes, increasing the risk for online frauds. In the era of digitalization, the need to identify credit card frauds is necessary. Fraud detection involves monitoring and analyzing the behaviour of various users to estimate, detect or avoid undesirable behaviour. To identify credit card fraud detection effectively, we need to understand the various technologies, algorithms and types involved in detecting credit card frauds. The algorithm can differentiate transactions which are fraudulent or not. To find fraud, we need to pass dataset and knowledge of the fraudulenttransaction. Algorithms analyze the dataset and classify all transactions. Fraud detection involves monitoring the activitiesof populations of users to estimate, perceive or avoidobjectionable behaviour, which consist of fraud, intrusion, and defaulting. Machine learning algorithms are employed to analyse all the authorized transactions and report the suspicious ones. We have taken an imbalanced dataset of transactions to detect the frauds",
        "link": "http://dx.doi.org/10.22214/ijraset.2022.47127"
    },
    {
        "id": 21251,
        "title": "Analysis of Credit Card Fraud Detection Using Machine Learning Algorithms",
        "authors": " D. Harish Kumar,  S. Arumugam",
        "published": "2022-5-30",
        "citations": 0,
        "abstract": "For the past decade of year’s credit card holders are facing a problem that the card had been swiped and cash has been withdrawn in an ATM (Automatic Teller Machine) or it has been swiped in a shopping mall by purchasing a product as creating a fake credit card. These transactions are considered as illegal activity, it is also one of the cybercrime theft activities. Credit card fraud detection has been increasing highly in the world. Fake credit cards can be tackled by applying data science along various machine learning algorithms. This research work focus on analysis of various credit card fraud transaction using machine learning algorithms. Also, this research focuses on detecting the fake credit cards by approaching Artificial Intelligence (AI), Data mining and Big data analytics etc. by using machine learning algorithms. Machine learning algorithms are applied by training the dataset which are collected from the fake credit dataset and original credit card dataset. Computer operations are handled by the data as data’s are ruling the world. Predicted card details are stored on the server of the banker. From the server information has been passed to the cybercrime in order to catch the culprit. Different kinds of machine learning algorithms that has been used for credit card fraud detection has been studied on which it gives the more precision.",
        "link": "http://dx.doi.org/10.48175/ijarsct-4541"
    },
    {
        "id": 21252,
        "title": "Credit Card Fraud Detection Using Machine Learning Algorithms",
        "authors": "Rishabh Tyagi, Ravi Ranjan, S. Priya",
        "published": "2021-11-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/i-smac52330.2021.9640822"
    },
    {
        "id": 21253,
        "title": "Supervised Machine Learning Algorithms for Credit Card Fraud Detection: A Comparison",
        "authors": "Samidha Khatri, Aishwarya Arora, Arun Prakash Agrawal",
        "published": "2020-1",
        "citations": 62,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/confluence47617.2020.9057851"
    },
    {
        "id": 21254,
        "title": "Credit Card Fraud Detection - A Machine Learning Perspective",
        "authors": "Shahana Fathima, Leena C Sekhar, Jaseena K U",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/sr231128212352"
    },
    {
        "id": 21255,
        "title": "Performance comparative study of machine learning algorithms for automobile insurance fraud detection",
        "authors": "Bouzgarne Itri, Youssfi Mohamed, Qbadou Mohammed, Bouattane Omar",
        "published": "2019-10",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icds47004.2019.8942277"
    },
    {
        "id": 21256,
        "title": "Credit card fraud detection by implementing machine learning techniques",
        "authors": "Debachudamani Prusti, S. S. Harshini Padmanabhuni, Santanu Kumar Rath",
        "published": "2020-12-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003031352-14"
    },
    {
        "id": 21257,
        "title": "Comparison of Poisson process and machine learning algorithms approach for credit card fraud detection",
        "authors": "Anastasiia Izotova, Adel Valiullin",
        "published": "2021",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2021.04.214"
    },
    {
        "id": 21258,
        "title": "Performance Analysis of Credit Card Fraud Analysis and Detection Machine Learning Algorithms",
        "authors": "Kevin Coello, Kaiyue Zhou, Harsha Nutalapati, Nestor Michael C. Tiglao",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323945"
    },
    {
        "id": 21259,
        "title": "Fraud and Anomaly Detection",
        "authors": "Maris Sekar",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8051-5_21"
    },
    {
        "id": 21260,
        "title": "Machine learning algorithms for fraud prediction in property insurance: Empirical evidence using real-world microdata",
        "authors": "Matheus Kempa Severino, Yaohao Peng",
        "published": "2021-9",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2021.100074"
    },
    {
        "id": 21261,
        "title": "Fraud Detection in MeDInsu using Machine Learning Algorithms - A Web Application",
        "authors": "Mr. Naveen Kumar G",
        "published": "2019-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2019.10105"
    },
    {
        "id": 21262,
        "title": "Credit Card Fraud Detection Using Hybrid Machine Learning Algorithms",
        "authors": "Parth Chaturvedi, Suraj Mishra, Suraj Agrawal",
        "published": "2022-10-31",
        "citations": 0,
        "abstract": "Abstract: Credit cards have a high frequency of transactions taking place daily. There are approximately 36.4 percent fraud related to commercial cards which include credit card, debit card, etc. In 2022 there are 64 million people who use credit cards to initiate the transaction, therefore they are also prone to card fraud. To evaluate the model efficacy, a publicly available credit card data set is used. Investigation on different hybrid algorithms for the given dataset were studied. This research investigates seven different hybrid machine learning models to detect fraudulent activities. Our findings indicated that the hybrid model of Adaboost and LGBM is the most efficient model due to its high performance.",
        "link": "http://dx.doi.org/10.22214/ijraset.2022.47028"
    },
    {
        "id": 21263,
        "title": "Credit card fraud detection using predictive features and machine learning algorithms",
        "authors": "Naoufal Rtayli, Nourddine Enneya",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijitst.2022.10051923"
    },
    {
        "id": 21264,
        "title": "Design and Implementation of Different Machine Learning Algorithms for Credit Card Fraud Detection",
        "authors": "Aditi Singh, Anoushka Singh, Anshul Aggarwal, Anamika Chauhan",
        "published": "2022-11-16",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceccme55909.2022.9988588"
    },
    {
        "id": 21265,
        "title": "Fraud detection in Online Payment Transaction using Machine Learning Algorithms",
        "authors": "Darshan Aladakatti, Gagana P, Ashwini Kodipalli, Shoaib Kamal",
        "published": "2022-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssteps57475.2022.00063"
    },
    {
        "id": 21266,
        "title": "Credit card fraud detection using predictive features and machine learning algorithms",
        "authors": "Naoufal Rtayli, Nourddine Enneya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijitst.2023.129578"
    },
    {
        "id": 21267,
        "title": "A comparison of machine learning algorithms for credit card fraud detection",
        "authors": "Rabab Cherkaoui, El Mokhtar En-Naimi",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3607720.3607759"
    },
    {
        "id": 21268,
        "title": "It’s Fraud! Application of Machine Learning Techniques for Detection of Fraudulent Digital Advertising",
        "authors": "Snigdha Mathur, Sunita Daniel",
        "published": "2022-1-20",
        "citations": 0,
        "abstract": "Due to the on-going COVID-19 pandemic, industries are heavily reliant on online meeting platforms. The pandemic has forced most MNCs to rely on online platforms such as Zoom or Microsoft Teams to hold daily business meetings and even conferences and other corporate events. Schools and other educational institutions have also been forced to conduct classes and all other events through these platforms. This increased unavoidable dependence on online platforms has resulted in an exponential increase in advertising fraud. Advertising fraud is the application of any method or technology that hampers the proper delivery of advertisements to the proper audience or the proper place, or forcefully inserts advertisements at undesirable times or locations. This could take multiple forms and has become far more widespread with increased use of online platforms. Some common methods used for digital fraud can be the pay-per-click (PPC) model, domain spoofing or in the form of bots, but the main objective is to gain financial advantages from advertising transactions. The primary objective of this study is to identify and understand the factors lying behind the presence of fraudulent activities on any online medium and to analyse the probability of downloading an application after coming across the online advertisement, and watching it. The study also aims to highlight how marketing agencies tend to float fraud advertisement just to gain more revenue from their end.",
        "link": "http://dx.doi.org/10.14704/web/v19i1/web19166"
    },
    {
        "id": 21269,
        "title": "Performance Analysis of Machine Learning Algorithms in Credit Cards Fraud Detection",
        "authors": "Vinod Jain, Mayank Agrawal, Anuj Kumar",
        "published": "2020-6",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icrito48877.2020.9197762"
    },
    {
        "id": 21270,
        "title": "Combing machine learning and elemental profiling for geographical authentication of Chinese Geographical Indication (GI) rice",
        "authors": "Fei Xu, Fanzhou Kong, Hong Peng, Shuofei Dong, Weiyu Gao, Guangtao Zhang",
        "published": "2021-7-8",
        "citations": 10,
        "abstract": "AbstractIdentification of geographical origin is of great importance for protecting the authenticity of valuable agri-food products with designated origins. In this study, a robust and accurate analytical method that could authenticate the geographical origin of Geographical Indication (GI) products was developed. The method was based on elemental profiling using inductively coupled plasma mass spectrometry (ICP-MS) in combination with machine learning techniques for model building and feature selection. The method successfully predicted and classified six varieties of Chinese GI rice. The elemental profiles of 131 rice samples were determined, and two machine learning algorithms were implemented, support vector machines (SVM) and random forest (RF), together with the feature selection algorithm Relief. Prediction accuracy of 100% was achieved by both Relief-SVM and Relief-RF models, using only four elements (Al, B, Rb, and Na). The methodology and knowledge from this study could be used to develop reliable methods for tracing geographical origins and controlling fraudulent labeling of diverse high-value agri-food products.",
        "link": "http://dx.doi.org/10.1038/s41538-021-00100-8"
    }
]