[
    {
        "id": 7201,
        "title": "Environmental Sound Classification Base on CNN and LightGBM",
        "authors": "威平 廖",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/csa.2019.910212"
    },
    {
        "id": 7202,
        "title": "ECG Signal’s Classification Algorithm Based on LightGBM",
        "authors": "宇光 洪",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/jisp.2020.93020"
    },
    {
        "id": 7203,
        "title": "Identifying Grid Pattern of Urban Road Networks Using LightGBM",
        "authors": "云滔 徐",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/gst.2020.81001"
    },
    {
        "id": 7204,
        "title": "Product Order Demand Forecast Based on LightGBM Model",
        "authors": "玉骁 赵",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/aam.2023.1211464"
    },
    {
        "id": 7205,
        "title": "An Application of XGBoost, LightGBM, CatBoost Algorithms on House Price Appraisal System",
        "authors": "Jengei Hong",
        "published": "2020-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52344/hfr.2021.4.0.33"
    },
    {
        "id": 7206,
        "title": "An Application of XGBoost, LightGBM, CatBoost Algorithms on House Price Appraisal System",
        "authors": "Jengei Hong",
        "published": "2020-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52344/hfr.2020.4.0.33"
    },
    {
        "id": 7207,
        "title": "Research on Short-Term Power Load Forecasting Based on LightGBM Algorithm",
        "authors": "隽杰 许",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/mos.2022.114098"
    },
    {
        "id": 7208,
        "title": "A Deep Auto-Encoder based LightGBM Approach for Network Intrusion Detection System",
        "authors": "Kun Mo, Jian Li",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008098401420147"
    },
    {
        "id": 7209,
        "title": "A Prediction Method for Institutional Reserve Based on LSTM, Transformer, and LightGBM",
        "authors": "乃庚 冀",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/csa.2024.142025"
    },
    {
        "id": 7210,
        "title": "LightGBM Scorecard Based on SHAP Values",
        "authors": "Yutae Choi, Eunji Cha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4637305"
    },
    {
        "id": 7211,
        "title": "A Customer Composition Model for Supplier Proactive Maintenance Based on TCN and LightGBM",
        "authors": "铭 刘",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/mos.2023.124307"
    },
    {
        "id": 7212,
        "title": "LightGBM-Based Stochastic Modeling for River Dust-Raising Alert",
        "authors": "Chih Chao Ho, Chih Hsiung Chang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nTo enhance the accuracy of Taiwan's existing river dust-raising alert system, which exclusively depends on wind speed predictions, this study combines hydrological, meteorological, air quality information with LightGBM to establish a stochastic model for forecasting PM10 exceedance probabilities. The flexible probability information can effectively reduce the risk of poor decision-making caused by concentration deterministic forecast errors. LightGBM, a boosting-based ensemble learning algorithm, employs a depth-constrained leaf-wise growth strategy, speeding up training, reducing memory consumption, and shortening training time. The results of model training and validation demonstrate good performance in terms of accuracy, recall, and specificity metrics. This signifies that the model effectively predicts the occurrence of actual dust-raising events. In comparison to the current dust-raising alert mechanism, the model can significantly reduce unnecessary dust alerts and lightening the workforce's burden. Moreover, this model effectively forecasts dust events under low to moderate wind speed conditions, providing decision-makers with crucial support data for proactive dust control deployment.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3773734/v1"
    },
    {
        "id": 7213,
        "title": "Review of: \"LightGBM and XGBoost Learning Method for Postoperative Critical Illness Key Indicators Analysis\"",
        "authors": "Senthil Kumar Thillaigovindan",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/6601xg"
    },
    {
        "id": 7214,
        "title": "JLGBMLoc: A Novel High-precision Indoor Localization Method Based on LightGBM",
        "authors": "Lu Yin, Pengcheng Ma, Zhongliang Deng",
        "published": "No Date",
        "citations": 1,
        "abstract": "Wi-Fi based localization has become one of the most practical methods for mobile users in location-based services. However, due to the interference of multipath and high-dimensional sparseness of fingerprint data, the localization system based on received signal strength (RSS) is hard to obtain high accuracy. In this paper, we propose a novel indoor positioning method, named JLGBMLoc (Joint denoising auto-encoder with LightGBM Localization). Firstly, because the noise and outliers may influence the dimensionality reduction on high-dimensional sparseness fingerprint data, we propose a novel feature extraction algorithm, named joint denoising auto-encoder (JDAE), which reconstructs the sparseness fingerprint data for a better feature representation and restores the fingerprint data. Then, the LightGBM is introduced to the Wi-Fi localization by scattering the processed fingerprint data to histogram, and dividing the decision tree under leaf-wise algorithm with depth limitation. At last, we evaluated the proposed JLGBMLoc on UJIIndoorLoc dataset and Tampere dataset, experimental results show that the proposed model increases the positioning accuracy dramatically comparing with other existing methods.",
        "link": "http://dx.doi.org/10.20944/preprints202103.0215.v1"
    },
    {
        "id": 7215,
        "title": "Effective Diagnosis of Multiple Sleep Disorders by LEE Classifier: LightGBM-EOG-EEG",
        "authors": "Ritika Jain, Ramakrishnan Angarai Ganesan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4586323"
    },
    {
        "id": 7216,
        "title": "Commodity Recommendation Algorithm Based on the Fusion Model of LightGBM and Deep Interest Network Stacking",
        "authors": "彤 王",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/sa.2023.126157"
    },
    {
        "id": 7217,
        "title": "FairPut: A Light Framework for Machine Learning Fairness with LightGBM",
        "authors": "Derek Snow",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3619715"
    },
    {
        "id": 7218,
        "title": "An Efficient Traffic Classification Scheme Using Embedded Feature Selection and LightGBM",
        "authors": "Yanpei Hua",
        "published": "2020-5",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictc49638.2020.9123302"
    },
    {
        "id": 7219,
        "title": "A Study on the Combined LightGBM and SHAP Approach for Predicting Domestic Helper Turnover",
        "authors": "峰涛 刘",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/ssem.2023.121005"
    },
    {
        "id": 7220,
        "title": "LightGBM-PPI: Predicting protein-protein interactions through LightGBM with multi-information fusion",
        "authors": "Cheng Chen, Qingmei Zhang, Qin Ma, Bin Yu",
        "published": "2019-8",
        "citations": 172,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.chemolab.2019.06.003"
    },
    {
        "id": 7221,
        "title": "Data-Driven LightGBM Controller for Robotic Manipulator",
        "authors": "Dimitri Mahayana",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2024.3377893"
    },
    {
        "id": 7222,
        "title": "Stock Volatility Prediction Using LightGBM Based Algorithm",
        "authors": "Zhangqi Liu",
        "published": "2022-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bdicn55575.2022.00061"
    },
    {
        "id": 7223,
        "title": "Improved Mayfly Optimization and LightGBM Classifier for Smart City Traffic Prediction",
        "authors": "J Jenifer,  , R Jemima Priyadarsini",
        "published": "2022-10-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17485/ijst/v15i40.1155"
    },
    {
        "id": 7224,
        "title": "Daily Streamflow Forecasting in Mountainous Catchment Using XGBoost, LightGBM and CatBoost",
        "authors": "Robert Szczepanek",
        "published": "2022-12-13",
        "citations": 20,
        "abstract": "Streamflow forecasting in mountainous catchments is and will continue to be one of the important hydrological tasks. In recent years machine learning models are increasingly used for such forecasts. A direct comparison of the use of the three gradient boosting models (XGBoost, LightGBM and CatBoost) to forecast daily streamflow in mountainous catchment is our main contribution. As predictors we use daily precipitation, runoff at upstream gauge station and two-day preceding observations. All three algorithms are simple to implement in Python, fast and robust. Compared to deep machine learning models (like LSTM), they allow for easy interpretation of the significance of predictors. All tested models achieved Nash-Sutcliffe model efficiency (NSE) in the range of 0.85–0.89 and RMSE in the range of 6.8–7.8 m3s−1. A minimum of 12 years of training data series is required for such a result. The XGBoost did not turn out to be the best model for the daily streamflow forecast, although it is the most popular model. Using default model parameters, the best results were obtained with CatBoost. By optimizing the hyperparameters, the best forecast results were obtained by LightGBM. The differences between the model results are much smaller than the differences within the models themselves when suboptimal hyperparameters are used.",
        "link": "http://dx.doi.org/10.3390/hydrology9120226"
    },
    {
        "id": 7225,
        "title": "Loan Default Prediction based on Machine Learning (LightGBM Model)",
        "authors": "Xingzhe Dong",
        "published": "2022-8-30",
        "citations": 0,
        "abstract": "With the rapid development of Internet finance, the number of online loan platforms has been increasing, and the scale of loan business is gradually expanding. At the same time, the bad debt and non-performing loan ratios have also risen sharply, the reasons for which include incomplete information of lenders, imprudent management of capital chain, inaccurate default prediction, etc. Therefore, loan platforms need a set of efficient and accurate loan default prediction solutions to ensure the healthy operation of Internet finance and avoid huge losses for platforms and investors. Current loan default prediction models mainly contain traditional machine learning methods such as logistic regression and decision tree, as well as integrated models such as Random Forest and GBDT. In this paper, we use LightGBM machine learning model to process massive loan default information using the lender information dataset on Tianchi Platform, and the process includes data preprocessing, feature engineering, model training and evaluation. The experimental results show that the LightGBM algorithm has a strong ability to predict loan default, with a final AUC value reaching about 0.73. This method is helpful for banks and Internet loan platforms to conduct background investigation and default prediction of loan applicants, so as to strengthen the ability of loan risk management.",
        "link": "http://dx.doi.org/10.54691/bcpbm.v25i.1857"
    },
    {
        "id": 7226,
        "title": "Stock Prediction Using Optimized LightGBM Based on Cost Awareness",
        "authors": "Xiaosong ZHAO, Qiangfu ZHAO",
        "published": "2021-6-8",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cybconf51991.2021.9464148"
    },
    {
        "id": 7227,
        "title": "Synthesis of Data-Driven LightGBM Controller for Spacecraft Attitude Control",
        "authors": "Dimitri Mahayana",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3290309"
    },
    {
        "id": 7228,
        "title": "Customer churn Research Based on LightGBM",
        "authors": "Yingying Mei, Yuanyuan Wang",
        "published": "2022-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccsmt58129.2022.00007"
    },
    {
        "id": 7229,
        "title": "UWB Wireless Positioning Method Based on LightGBM",
        "authors": "Xuerong Cui, Yuanxu Li, Juan Li, Bin Jiang, Shibao Li, Jianhang Liu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn the ultra-wideband indoor positioning sceneraio, the non-line of sight (NLOS) propagation may be caused by obstacles, which may lead to the deviation of ranging value and affect the positioning precision. Therefore, we propose a NLOS identification and error regression positioning algorithm based on light gradient boosting machine (LightGBM). Firstly, ReliefF algorithm combined with Spearman correlation coefficient is used to analyze the feature correlation, and eight channel features such as total channel impulse response power and standard deviation of noise are selected as NLOS identification features. Then, we adopt genetic algorithm to optimize the hyperparameters of LightGBM for NLOS identification. On this basis, the proposed error regression model based on convolutional neural network (CNN) combined with LightGBM is used to correct the ranging results, so as to achieve highprecision positioning. Through the verification on the public dataset, the NLOS identification accuracy reached 91.8%, and the positioning precision is improved by 45cm after correcting the ranging results.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2247936/v1"
    },
    {
        "id": 7230,
        "title": "An Efficient Lightgbm-Based Differential Evolution Method for Nonlinear Inelastic Truss Optimization",
        "authors": "Viet-Hung Truong, Sawekchai Tangaramvong, George Papazafeiropoulos",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4395575"
    },
    {
        "id": 7231,
        "title": "Quantitative investment model based on LightGBM algorithm",
        "authors": "",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajcis.2022.050707"
    },
    {
        "id": 7232,
        "title": "Disk failure prediction via Lightgbm model",
        "authors": "Sitao Ji, Xingquan Zuo, Hai Huang",
        "published": "2022-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2652965"
    },
    {
        "id": 7233,
        "title": "Stock Trend Prediction Based on ARIMA-LightGBM Hybrid Model",
        "authors": "Xiuyan Zheng, Jiajing Cai, Guangfu Zhang",
        "published": "2022-5-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictc55111.2022.9778304"
    },
    {
        "id": 7234,
        "title": "Pm2.5 Extended-Range Forecast Based on Mjo and S2s Using Lightgbm",
        "authors": "Zhongqi Yu, Jinghui Ma, Yuanhao Qu, Liang Pan, Shiquan Wan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4327487"
    },
    {
        "id": 7235,
        "title": "A Default Prediction Method using XGBoost and LightGBM",
        "authors": "Yuntao Zheng",
        "published": "2022-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicml57342.2022.10009823"
    },
    {
        "id": 7236,
        "title": "Optimizing LightGBM for Intrusion Detection Systems using GOA",
        "authors": " Prastavana, Babita Majhi",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10308360"
    },
    {
        "id": 7237,
        "title": "Walmart Sale Forecasting Model Based On LightGBM",
        "authors": "Zihan Qiao",
        "published": "2020-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlbdbi51377.2020.00020"
    },
    {
        "id": 7238,
        "title": "Ion channel prediction Using Lightgbm Model",
        "authors": "Xinyu Zhang",
        "published": "2020-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbaie49996.2020.00079"
    },
    {
        "id": 7239,
        "title": "LightGBM-LncLoc: A LightGBM-Based Computational Predictor for Recognizing Long Non-Coding RNA Subcellular Localization",
        "authors": "Jianyi Lyu, Peijie Zheng, Yue Qi, Guohua Huang",
        "published": "2023-1-25",
        "citations": 3,
        "abstract": "Long non-coding RNAs (lncRNA) are a class of RNA transcripts with more than 200 nucleotide residues. LncRNAs play versatile roles in cellular processes and are thus becoming a hot topic in the field of biomedicine. The function of lncRNAs was discovered to be closely associated with subcellular localization. Although many methods have been developed to identify the subcellular localization of lncRNAs, there still is much room for improvement. Herein, we present a lightGBM-based computational predictor for recognizing lncRNA subcellular localization, which is called LightGBM-LncLoc. LightGBM-LncLoc uses reverse complement k-mer and position-specific trinucleotide propensity based on the single strand for multi-class sequences to encode LncRNAs and employs LightGBM as the learning algorithm. LightGBM-LncLoc reaches state-of-the-art performance by five-fold cross-validation and independent test over the datasets of five categories of lncRNA subcellular localization. We also implemented LightGBM-LncLoc as a user-friendly web server.",
        "link": "http://dx.doi.org/10.3390/math11030602"
    },
    {
        "id": 7240,
        "title": "Intrusion Detection Model of Internet of Things Based on Lightgbm☆",
        "authors": "guosheng Zhao, Yang Wang, Jian Wang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3993056"
    },
    {
        "id": 7241,
        "title": "Stock Volatility Prediction with Hybrid Model of FFNN and Lightgbm",
        "authors": "Yiyang Zhang",
        "published": "2022-4-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsp54964.2022.9778512"
    },
    {
        "id": 7242,
        "title": "A study of the GeGDP problem base on the LightGBM regression",
        "authors": "Yang Peilin",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "This study uses AHP hierarchy analysis to select three indicators as the measurement standard of green GDP: GDP, resource consumption and reduction cost and environmental degradation cost, and analyzes the weight of green GDP indicators and the importance of the three indicators. With GeGDP as the main indicator of a country's economic health, a Lasso regression model is established to analyze the predicted global climate mitigation impacts. Then, this paper establishes LightGBPGBM regression model to predict the future GeGDP and GDP of the United States, and uses r square and other indicators to test the accuracy of the model, and makes a human correlation analysis of GeGDP and GDP before and after the prediction, to analyze the degree of correlation between the two. Finally, taking the United States as an example, we substituted relevant data into the LightGBM regression model developed above, predicted its value, and conducted one-way analysis of variance on it to determine the degree of change before and after. This study uses AHP hierarchy analysis to select three indicators as the measurement standard of green GDP: GDP, resource consumption and reduction cost and environmental degradation cost, and analyzes the weight of green GDP indicators and the importance of the three indicators. With GeGDP as the main indicator of a country's economic health, a Lasso regression model is established to analyze the predicted global climate mitigation impacts. Then, this paper establishes LightGBPGBM regression model to predict the future GeGDP and GDP of the United States, and uses r square and other indicators to test the accuracy of the model, and makes a human correlation analysis of GeGDP and GDP before and after the prediction, to analyze the degree of correlation between the two. Finally, taking the United States as an example, we substituted relevant data into the LightGBM regression model developed above, predicted its value, and conducted one-way analysis of variance on it to determine the degree of change before and after.",
        "link": "http://dx.doi.org/10.54691/bcpbm.v48i.5356"
    },
    {
        "id": 7243,
        "title": "Application of Improved LightGBM Model in Blood Glucose Prediction",
        "authors": "Yan Wang, Tao Wang",
        "published": "2020-5-6",
        "citations": 44,
        "abstract": "In recent years, with increasing social pressure and irregular schedules, many people have developed unhealthy eating habits, which has resulted in an increasing number of patients with diabetes, a disease that cannot be cured under the current medical conditions, and can only be mitigated by early detection and prevention. A lot of human and material resources are required for the detection of the blood glucose of a large number of people in medical examination, while the integrated learning model based on machine learning can quickly predict the blood glucose level and assist doctors in treatment. Therefore, an improved LightGBM model based on the Bayesian hyper-parameter optimization algorithm is proposed for the prediction of blood glucose, namely HY_LightGBM, which optimizes parameters using a Bayesian hyper-parameter optimization algorithm based on LightGBM. The Bayesian hyper-parameter optimization algorithm is a model-based method for finding the minimum value of the function so as to obtain the optimal parameters of the LightGBM model. Experiments have demonstrated that the parameters obtained by the Bayesian hyper-parameter optimization algorithm are superior to those obtained by a genetic algorithm and random search. The improved LightGBM model based on the Bayesian hyper-parameter optimization algorithm achieves a mean square error of 0.5961 in blood glucose prediction, with a higher accuracy than the XGBoost model and CatBoost model.",
        "link": "http://dx.doi.org/10.3390/app10093227"
    },
    {
        "id": 7244,
        "title": "CUS-LightGBM-based financial distress prediction for small- and medium-sized enterprises with imbalanced data",
        "authors": "Sumei Ruan, Jiayong Zhang, Wei Li",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nIn this paper, by analyzing the financial data of small- and medium-sized enterprises, it is found that there is a general problem of imbalance data. Therefore, an effective financial distress prediction model based on clustering under-sampling and LightGBM model is constructed. Based on the idea of ensemble learning, this paper proposes the CUS-LightGBM (cluster-based under-sampling with LightGBM) model. First, the data are divided into minority and majority class samples. Then the K-means algorithm is used to cluster the majority class samples, and some data are selected from each cluster to form the balanced data. Finally, it is fused with the LightGBM algorithm based on decision tree to form an efficient prediction model. In addition, there are a large number of redundant features in the proposed model, which will reduce the prediction accuracy and efficiency of the model. Therefore, this paper adopts the feature selection based on ensemble strategy, and determines the main risk factors according to the principle of minority obeying majority. Finally, through the experimental analysis of real financial data, the results show that the CUS-LightGBM model can significantly improve the recognition ability of small- and medium-sized enterprises in financial distress, and the proposed model is more effective in processing financial ratio data than the benchmark model.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-415706/v1"
    },
    {
        "id": 7245,
        "title": "Prediction of Used Car Price Based on LightGBM",
        "authors": "Han Zhang",
        "published": "2022-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aemcse55572.2022.00073"
    },
    {
        "id": 7246,
        "title": "Predictive Modeling of Diseases with Explainable Artificial Intelligence Using LightGBM",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.59287/as-ijanser.10"
    },
    {
        "id": 7247,
        "title": "Next-Generation Machine Learning with Spark",
        "authors": "Butch Quinto",
        "published": "2020",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-5669-5"
    },
    {
        "id": 7248,
        "title": "Improved Sales Forecasting using Trend and Seasonality Decomposition with LightGBM",
        "authors": "Tong Zhou",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaibd57115.2023.10206380"
    },
    {
        "id": 7249,
        "title": "LightGBM Based Optiver Realized Volatility Prediction",
        "authors": "Yue Wu, Qi Wang",
        "published": "2021-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csaiee54046.2021.9543438"
    },
    {
        "id": 7250,
        "title": "Multiclass classification of body performance based on LightGBM",
        "authors": "Ziniu Lu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "The fitness industry is transforming due to the Covid-19 pandemic, and the demand for personal training is growing. The absence of a standardized and accurate body performance measuring framework can lead to misjudgement of the clients physical condition and risks of injuries or dissatisfaction with the service. This paper applies LightGBM on a dataset containing 13393 instances from Kaggle.com for body performance level classification analysis. The model is built with 12 predictors, such as age, gender, body fat percentage, sit and bend forward distance, and a target variable class, representing the body performance level of a person. The accuracy score obtained from the confusion matrix is used as the key metric for model performance. A grid search on hyperparameters including regularization term, maximum number of leaves, and maximum depth of the tree is conducted for parameter tuning. The outcome of the model gives insight into the importance of various features to body performance and helps fitness trainers to better understand their clients physical conditions. Results of this research show that sit and bend forward distance and sit ups counts are the most important factors of body performance. The quality of the classifier solution makes it a useful decision aid for personal trainers to access their clients physical condition.",
        "link": "http://dx.doi.org/10.54254/2753-8818/11/20230410"
    },
    {
        "id": 7251,
        "title": "Analysis and Visualization of Accidents Severity Based on Lightgbm-Tpe",
        "authors": "Xiao Liu, Kun Li, Haocheng Xu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4024035"
    },
    {
        "id": 7252,
        "title": "Bitcoin Return Prediction based on OLS, Random Forest, LightGBM, and LSTM",
        "authors": "Gaohao Zhu",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "Since Bitcoin was proposed in 2008, it has become a very valuable asset and an important part of many investors’ portfolios. It’s important to both understand Bitcoin mechanics and predict its valuation with the help of the state-of-art machine learning tools. The study develops four different models, including Ordinary Least Squares (OLS) regression model, Random Forest, Light Gradient Boosting Machine (LightGBM), and Long Short-Term Memory (LSTM), to predict the return of Bitcoin and compare the performance of these models. According to the analysis, the daily changes in the high, low, close price of Bitcoin, and close price of Tesla stock, and gold price between yesterday and today are all strongly correlated to the Bitcoin return on tomorrow. The statistical approach, or OLS modeling, has the simplest algorithm whereas the highest accuracy rate. The LightGBM model and LSTM model have lower accuracy rates in order, but still exceed the 50% (random benchmark). The Random Forest model, as another type of decision tree algorithm, has similar prediction results with the LightGBM model but a lower accuracy rate that fails to reach the benchmark. Based on the analysis, multiple factors affect the Bitcoin return, and these results provide an insight for investors to the cryptocurrency market and the macroeconomic environment. It validates the effectiveness of several machine learning algorithms in Bitcoin return forecasting and supports future developments in related fields.",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.3698"
    },
    {
        "id": 7253,
        "title": "Hard Disk Failure Prediction Based on Lightgbm with CID",
        "authors": "Hengrui Wang, Yahui Yang, Hongzhang Yang",
        "published": "2021-9-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscc53001.2021.9631504"
    },
    {
        "id": 7254,
        "title": "A Novel Integrated Network with LightGBM for Click-Through Rate Prediction",
        "authors": "Zhen Xia, Senlin Mao, Jing Bai, Xinyu Geng, Liu Yi",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nClick-through Rate (CTR) prediction has become one of the core tasks of the recommendation system and its online advertising with the development of e-commerce. In the CTR prediction field, different features extraction schemes are used to mine the user click behavior to achieve the maximum CTR, which helps the advertisers maximize their profits. At present, achievements have been made in CTR prediction based on Deep Neural Network (DNN), but insufficiently, DNN can only learn high-order features combination. In this paper, Product & Cross supported Stacking Network with LightGBM (PCSNL) is proposed for CTR prediction to solve such problems. Firstly, the  L  1   and L  2  regularizations are imposed on Light Gradient Boosting Machine (LightGBM) to prevent overfitting. Secondly, the method of vector-wise feature interactions is added to product layer in product network to learn second-order feature combinations. Lastly, feature information is fully learned through the cross network, product network and stacking network in PCSNL. The online ads CTR prediction datasets released by Huawei and Avazu on the Kaggle platform are involved for experiments. It is shown that the PCSN model and PCSNL have better performance than the traditional CTR prediction models and deep learning models.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-872310/v1"
    },
    {
        "id": 7255,
        "title": "Microsoft Malware Prediction Using LightGBM Model",
        "authors": "ZheMing Zhang",
        "published": "2022-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbaie56435.2022.9985850"
    },
    {
        "id": 7256,
        "title": "Predictive Analysis of Cryptocurrency Residual Log-returns Based on Lightgbm",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajbm.2022.040419"
    },
    {
        "id": 7257,
        "title": "Long-Term Rainfall Forecast Model Based on The TabNet and LightGbm Algorithm",
        "authors": "Tianyu Xu, Yongchuan Yu, Jianzhuo Yan, Hongxia Xu",
        "published": "No Date",
        "citations": 2,
        "abstract": "Abstract\nDue to the problems of unbalanced data sets and distribution differences in long-term rainfall prediction, the current rainfall prediction model had poor generalization performance and could not achieve good prediction results in real scenarios. This study uses multiple atmospheric parameters (such as temperature, humidity, atmospheric pressure, etc.) to establish a TabNet-LightGbm rainfall probability prediction model. This research uses feature engineering (such as generating descriptive statistical features, feature fusion) to improve model accuracy, Borderline Smote algorithm to improve data set imbalance, and confrontation verification to improve distribution differences. The experiment uses 5 years of precipitation data from 26 stations in the Beijing-Tianjin-Hebei region of China to verify the proposed rainfall prediction model. The test set is to predict the rainfall of each station in one month. The experimental results shows that the model has good performance with AUC larger than 92%. The method proposed in this study further improves the accuracy of rainfall prediction, and provides a reference for data mining tasks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-107107/v1"
    },
    {
        "id": 7258,
        "title": "Cost Harmonization LightGBM-Based Stock Market Prediction",
        "authors": "Xiaosong Zhao, Yong Liu, Qiangfu Zhao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3318478"
    },
    {
        "id": 7259,
        "title": "High-resolution mapping of&amp;#160; VOCs using the fast space-time Light Gradient Boosting Machine (LightGBM)",
        "authors": "Bingqing Lu, Xiang Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "Volatile organic compounds (VOCs) play a crucial role in atmospheric chemistry, influencing global climate and posing potential health risks to humans. Accurate spatiotemporal estimation of VOCs is vital for establishing advanced early warning systems and controlling air pollution. However, research on high-resolution spatiotemporal prediction of VOCs concentrations using machine learning is still limited. This study conducted an extensive VOCs observational campaign in Shanghai, improving upon the LightGBM model with the integration of spatiotemporal information, satellite data, meteorological data, emission inventories, and geographical data for VOCs estimation. We achieved a high-precision distribution map of VOCs concentrations in Shanghai (1 km, 1 hour resolution), demonstrating the model&#8217;s excellent hourly VOCs estimation performance (R^2 = 0.92). Further analysis with SHapley Additive exPlanations (SHAP) regression revealed the significant contributions of each input feature to VOCs estimation. Compared to many traditional machine learning models, this approach offers lower computational demands in terms of speed and memory. Moreover, the model maintained good hourly spatiotemporal VOCs prediction performance during the COVID-19 lockdown. This research analyzed the spatiotemporal variations of VOCs concentrations in Shanghai, providing a scientific basis for future control of VOCs levels in the city and offering algorithmic support for comprehensive VOCs prediction in other regions.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-331"
    },
    {
        "id": 7260,
        "title": "Research on Floating Population and Enterprise Innovation Based on LightGBM",
        "authors": "Ying Chen, ShunJie Xu",
        "published": "2022-11-5",
        "citations": 0,
        "abstract": "The research on the relationship between the floating population and social-economic development has always been a key research issue in population economics. This study first introduced the LightGBM to examine multi-dimensional floating population characteristics can predict enterprise innovation. Taking the dynamic survey data of China's floating population from 2011 to 2018 and listed enterprises as samples, the study verifies whether the characteristics of a floating population can predict enterprise innovation. Further, it analyzes the characteristics of the floating population and its prediction model, which has an excellent ability to predict enterprise innovation. The researchers have found that: 1) On the whole, the prediction ability to float population characteristics to enterprise innovation is limited. 2) Among many characteristics, the prediction ability of population mobility dimensional characteristics is higher. 3) There is a nonlinear relationship between characteristics and enterprise innovation, and there is a population crowding effect, which is consistent with the previous theory. 4) It is tested that the population crowding effect is through mechanisms such as human capital. This study uses the machine learning method to explore the characteristics of floating population more comprehensively and inspires the formulation and implementation of the government's industrial and talent policies and the development decisions of enterprises.",
        "link": "http://dx.doi.org/10.54691/bcpbm.v31i.2672"
    },
    {
        "id": 7261,
        "title": "A Boruta-LightGBM Model-based Method For Detecting Electricity Theft",
        "authors": "Xinxing Nie, Song Li",
        "published": "2022-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ifeea57288.2022.10037840"
    },
    {
        "id": 7262,
        "title": "Predicting Player Performance in Tactical Games with the Lightgbm Algorithm",
        "authors": "Sławomir Pioroński, Tomasz Górecki",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmew59549.2023.00010"
    },
    {
        "id": 7263,
        "title": "Leveraging LightGBM for Categorical Big Data",
        "authors": "John Hancock, Taghi M. Khoshgoftaar",
        "published": "2021-8",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdataservice52369.2021.00024"
    },
    {
        "id": 7264,
        "title": "Bike-Sharing Demand Prediction Model Based on PSO-Lightgbm Algorithm",
        "authors": "Li Ming",
        "published": "2022-6-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itaic54216.2022.9836609"
    },
    {
        "id": 7265,
        "title": "AE-LGBM: Sequence-Based Novel Approach To Detect Interacting Protein Pairs <i>via</i> Ensemble of Autoencoder and LightGBM",
        "authors": "Abhibhav Sharma, Buddha Singh",
        "published": "No Date",
        "citations": 0,
        "abstract": "1.AbstractProtein-protein interactions (PPIs) are a vital phenomenon for every biological process. Prediction of PPI can be very helpful in the probing of protein functions which can further help in the development of new and powerful therapy designs for disease prevention. A lot of experimental studies have been done previously to study PPIs. However, lab-based experimental studies of PPI prediction are resource-extensive and time-consuming. In recent years, several high throughput, computational approaches to predict PPI have been developed but they could be fallible in terms of accuracy and false-positive rate. To overcome these shortcomings, we propose a novel approach AE-LGBM to predict the PPI more accurately. This method is based on the LightGBM classifier and utilizes the Autoencoder, which is an artificial neural network, to efficiently produce lower-dimensional, discriminative, and noise-free features. We incorporate conjoint triad (CT) features along with Composition-Transition-Distribution (CTD) features into the model and obtained promising results. The ten-fold cross-validation results indicate that the prediction accuracies obtained for Human and Yeast datasets are 98.7% and 95.4% respectively. This method was further evaluated on other datasets and has achieved excellent accuracies of 100%, 100%, 99.9%, 99.2% on E.coli, M.musculus, C.elegans, and H.sapiens respectively. We also executed AE-LGBM over three important PPI networks namely, single-core network (CD9), the multiple-core network (The Ras/Raf/MEK/ERK pathway), and the cross-connection network (Wnt Network). The method was successful in predicting the pathway with an impressive accuracy of 100%, 100%, and 98.9% respectively. These figures are significantly higher than previous methods that are based on state-of-the-art models and models including LightGBM or Autoencoder, proving AE-LGBM to be highly versatile, efficient, and robust.",
        "link": "http://dx.doi.org/10.1101/2020.07.03.186866"
    },
    {
        "id": 7266,
        "title": "Cryptocurrency price prediction based on Xgboost, LightGBM and BNN",
        "authors": "Guoxuan Sun",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "The valuation and prediction of cryptocurrency prices have become increasingly important in the financial market. Therefore, this study aims to focus on the selection and evaluation of machine learning models for cryptocurrency valuation. Thus, two types of machine learning models, gradient boosting trees (Xgboost and LightGBM) and neural networks, are compared to determine their effectiveness in generating features for cryptocurrency valuation. Additionally, correlation tests are conducted to identify the most suitable input variables for the models. The results demonstrate that the generated features have a significant impact on the accuracy of machine learning predictions for cryptocurrency prices. It highlights the potential of machine learning models in accurately predicting and evaluating the value of cryptocurrencies. Overall, the findings of this study contribute to the understanding of the role of machine learning in cryptocurrency valuation and provide valuable insights for investors and researchers. By leveraging machine learning techniques, investors can make informed decisions and develop effective investment strategies in the cryptocurrency market. This study contributes to cryptocurrency valuation research. Leveraging machine learning enables informed decisions and effective investment strategies. Furthermore, the findings inform the development of advanced machine learning models and algorithms for cryptocurrency valuation.",
        "link": "http://dx.doi.org/10.54254/2755-2721/49/20241414"
    },
    {
        "id": 7267,
        "title": "Predicting House Prices using Machine Learning and LightGBM.",
        "authors": "Linda M. John, Rakshit Shinde, Shoaib Shaikh, Devanshu Ashar",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4108744"
    },
    {
        "id": 7268,
        "title": "LightGBM stock forecasting model based on PCA",
        "authors": "Nan Zhang, Cangjun Gao, Mingzhong Xiao",
        "published": "2021-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ainit54228.2021.00083"
    },
    {
        "id": 7269,
        "title": "An Intrusion Detection Approach Based on Improved Deep Belief Network and LightGBM",
        "authors": "Qiuting Tian",
        "published": "2022-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscsic57216.2022.00020"
    },
    {
        "id": 7270,
        "title": "Flight delay prediction based on LightGBM",
        "authors": "Jiang Tao, Hua Man, Li Yanling",
        "published": "2021-10-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccasit53235.2021.9633431"
    },
    {
        "id": 7271,
        "title": "Human Activity Recognition of Children with Wearable Devices Using LightGBM Machine Learning",
        "authors": "Gábor Csizmadia, Krisztina Liszkai-Peres, Bence Ferdinandy, Ádám Miklósi, Veronika Konok",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nHuman activity recognition (HAR) using machine learning (ML) methods is a relatively new method for collecting and analyzing large amounts of human behavioral data using special wearable sensors. Our main goal was to find a reliable method which could automatically detect various playful and daily routine activities in children. We defined 40 activities for ML recognition, and we collected activity motion data by means of wearable smartwatches with a special SensKid software. We analyzed the data of 34 children (19 girls, 15 boys; age range: 6.59 – 8.38; median age = 7.47). All children were typically developing first graders from three elementary schools. The activity recognition was a binary classification task which was evaluated with a Light Gradient Boosted Machine (LGBM)learning algorithm, a decision based method with a 3-fold cross validation. We used the sliding window technique during the signal processing, and we aimed at finding the best window size for the analysis of each behavior element to achieve the most effective settings. Seventeen activities out of 40 were successfully recognized with AUC values above 0.8. The window size had no significant effect. The overall accuracy was 0.95, which is at the top segment of the previously published similar HAR data. In summary, the LGBM is a very promising solution for HAR. In line with previous findings, our results provide a firm basis for a more precise and effective recognition system that can make human behavioral analysis faster and more objective.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1076792/v1"
    },
    {
        "id": 7272,
        "title": "Detecting Transportation Modes Based on LightGBM Classifier from GPS Trajectory Data",
        "authors": "Bijun Wang, Yulong Wang, Kun Qin, Qizhi Xia",
        "published": "2018-6",
        "citations": 26,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/geoinformatics.2018.8557149"
    },
    {
        "id": 7273,
        "title": "Short-Term Photovoltaic Power Generation Prediction Based on LightGBM-LSTM Model",
        "authors": "Zhen Wang, Li Jia",
        "published": "2020-9-12",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpre51194.2020.9233298"
    },
    {
        "id": 7274,
        "title": "Shayona@SMM4H’23: COVID-19 Self diagnosis classification using BERT and LightGBM models",
        "authors": "Rushi Chavda, Darshan Makwana, Vraj Patel, Anupam Shukla",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThis paper describes approaches and results for shared Task 1 and 4 of SMMH4-23 by Team Shayona. Shared Task-1 was binary classification of english tweets self-reporting a COVID-19 diagnosis, and Shared Task-4 was Binary classification of English Reddit posts self-reporting a social anxiety disorder diagnosis. Our team has achieved the highest f1-score 0.94 in Task-1 among all participants. We have leveraged the Transformer model (BERT) in combination with the LightGBM model for both tasks.",
        "link": "http://dx.doi.org/10.1101/2024.01.04.24300818"
    },
    {
        "id": 7275,
        "title": "A Fault Diagnosis Method for CNC Machine Feed System Based on DoubleEnsemble-LightGBM Model",
        "authors": "Yiming Li, Yize Wang, Liuwei Lu, Lumeng Chen",
        "published": "No Date",
        "citations": 0,
        "abstract": "In order to solve the problem of fault diagnosis for CNC machine feed system under the condition of variable speed conditions, an intelligent fault diagnosis method based on multi-domain feature extraction and ensemble learning model is proposed. First, various monitoring signals including vibration signal, noise signal and current signal are collected. Then, the monitoring signals are preprocessed and the time-domain, frequency-domain and time-frequency domain feature indexes are extracted to construct a multi-dimensional mixed domain feature set. Finally, the feature set is putting into the constructed DoubleEnsemble-LightGBM model to realize the fault diagnosis of the feed system. The experimental results show that the model can achieve good diagnosis results under different working conditions for both the public data set and the feed system test bench data set, and the average overall accuracy is 91.07% and 98.06% respectively. Compared with XGBoost and other advanced ensemble learning models, the method has better accuracy. It provides technical support for the stable operation and intelligent of CNC machine tools..",
        "link": "http://dx.doi.org/10.20944/preprints202403.0857.v1"
    },
    {
        "id": 7276,
        "title": "Forecast of the COVID-19 Epidemic Based on RF-BOA-LightGBM",
        "authors": "Zhe Li, Dehua Hu",
        "published": "2021-9-6",
        "citations": 2,
        "abstract": "In this paper, we utilize the Internet big data tool, namely Baidu Index, to predict the development trend of the new coronavirus pneumonia epidemic to obtain further data. By selecting appropriate keywords, we can collect the data of COVID-19 cases in China between 1 January 2020 and 1 April 2020. After preprocessing the data set, the optimal sub-data set can be obtained by using random forest feature selection method. The optimization results of the seven hyperparameters of the LightGBM model by grid search, random search and Bayesian optimization algorithms are compared. The experimental results show that applying the data set obtained from the Baidu Index to the Bayesian-optimized LightGBM model can better predict the growth of the number of patients with new coronary pneumonias, and also help people to make accurate judgments to the development trend of the new coronary pneumonia.",
        "link": "http://dx.doi.org/10.3390/healthcare9091172"
    },
    {
        "id": 7277,
        "title": "Age Estimation from Pediatric Panoramic Dental Images with CNNs and LightGBM",
        "authors": "Rames Aliyev, Emre Arslanoglu, Yasin Yasa, Ayse Betul Oktay",
        "published": "2022-10-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tiptekno56568.2022.9960211"
    },
    {
        "id": 7278,
        "title": "Predicting Metabolite–Disease Associations Based on LightGBM Model",
        "authors": "Cheng Zhang, Xiujuan Lei, Lian Liu",
        "published": "2021-4-13",
        "citations": 9,
        "abstract": "Metabolites have been shown to be closely related to the occurrence and development of many complex human diseases by a large number of biological experiments; investigating their correlation mechanisms is thus an important topic, which attracts many researchers. In this work, we propose a computational method named LGBMMDA, which is based on the Light Gradient Boosting Machine (LightGBM) to predict potential metabolite–disease associations. This method extracts the features from statistical measures, graph theoretical measures, and matrix factorization results, utilizing the principal component analysis (PCA) process to remove noise or redundancy. We evaluated our method compared with other used methods and demonstrated the better areas under the curve (AUCs) of LGBMMDA. Additionally, three case studies deeply confirmed that LGBMMDA has obvious superiority in predicting metabolite–disease pairs and represents a powerful bioinformatics tool.",
        "link": "http://dx.doi.org/10.3389/fgene.2021.660275"
    },
    {
        "id": 7279,
        "title": "LightGBM and XGBoost Learning Method for Postoperative Critical Illness Key Indicators Analysis",
        "authors": "",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3837/tiis.2023.08.003"
    },
    {
        "id": 7280,
        "title": "Intrusion Detection Method Based on L1-REF and LightGBM",
        "authors": "Dongyuan Xu, Bin Hua",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435571"
    },
    {
        "id": 7281,
        "title": "Optimizing Bank Marketing Strategies Through Analysis Using Lightgbm",
        "authors": "Erindra Reynaldi Diaz Aditya, Dhian Kartika Yudha Satria",
        "published": "2023-7-30",
        "citations": 1,
        "abstract": "Marketing campaigns in a bank are one of the ways for the bank to achieve its organizational goals. Optimal marketing is a crucial factor for a bank's success in attracting and retaining customers. Therefore, if a bank's marketing campaigns are carried out suboptimally, it will be challenging to achieve the goals of those campaigns. In this case study, it can be observed that the number of customers who subscribe to fixed-term deposits is lower, with a proportion of 5289 customers making deposits and 5873 customers not making deposits. This research aims to optimize bank marketing strategies by applying analysis using the LightGBM algorithm, which is a highly effective and efficient Gradient Boosting Decision Tree algorithm. This approach facilitates the design of more optimal marketing strategies. The accuracy score of the predictive model generated is 0.8584, with an F1 score of 0.8564, including 974 true negatives and 943 true positives.",
        "link": "http://dx.doi.org/10.60005/coreid.v1i2.11"
    },
    {
        "id": 7282,
        "title": "Fetal health classification using LightGBM with Grid search based hyper parameter tuning",
        "authors": "Vimala Nagabotu, Anupama Namburu",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "\nBackground:\nFetal health monitoring throughout pregnancy is challenging and complex. Complications in the fetal health not identified at the right time lead to mortality of the fetus as well the pregnant women. Hence, obstetricians check the fetal health state by monitoring the fetal heart rate (FHR). Cardiotocography (CTG) is a technique used by obstetricians to access the physical well-being of fetal during pregnancy. It provides  information on the fetal heart rate and uterine respiration, which can assist in determining whether the fetus is normal or suspected of pathology. CTG data has typically been evaluated using machine learning (ML) algorithms in predicting the wellness of the fetal and speeding up the detection process.\n\n\nMethods:\nIn this work, we developed LightGBM with a Grid search-based hyperparameter tuning model to predict fetal health classification. The classification results are analysed quantitatively using the performance measures, namely, precision, Recall, F1-Score, and Accuracy Comparisons were made between different classification models like Logistic Regression, Decision Tree, Random Forest, k-nearest neighbors, Bagging, ADA boosting, XG boosting, and Light GBM, which were trained with the CTG Dataset obtained by the patented fetal monitoring system of 2,216 data points from pregnant women in their third trimester available in the Kaggle dataset. The dataset contains three classes: normal, suspect, and pathology. Our proposed model will give better results in predicting fetal health classification.\n\n\nResults:\nIn this paper, the performance of the proposed algorithm Light GBM is compared and experimented with various  Machine learning Techniques namely LR, DT, RF, KNN, Boosting, Ada boosting, and XG Boost and the classification accuracy of the respective algorithms are 84%, 94%, 93%, 88%, 94%, 89%,96%.The light GBM achieved a performance of 97% and outperforms the former models.\n\n\nConclusion:\nThe Light GBM-based fetal health classification has been presented. Ensemble models were applied to the FHR dataset and presented the hybrid algorithm, namely Light GBM, and its application to fetal health classification. Light GBM has advantages that include fast training, improved performance, scale-up capabilities, and lesser memory usage than other ensemble models. The proposed model is more consistent and superior to other considered machine learning models and is suitable for the classification of fetal health based on FHR data. Finally, the outcomes of the multiple methods are compared using the same training and test data in order to verify the efficiency of Light GBM. The model can be further enhanced by making it hybrid by combining the advantages of different models and optimization techniques.\n",
        "link": "http://dx.doi.org/10.2174/1872212118666230703155834"
    },
    {
        "id": 7283,
        "title": "Personalized HRTF prediction based on LightGBM using anthropometric data",
        "authors": "Yinliang Qiu, Jing Wang, Zhiyu Li",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/jcc.2023.00.025"
    },
    {
        "id": 7284,
        "title": "Research on Rockdb knob Configuration based on LightGBM and NSGA2",
        "authors": "Yunzhang Hu, Hui Wang",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciibms60103.2023.10347726"
    },
    {
        "id": 7285,
        "title": "Research on LightGBM Default Prediction Algorithm based on the Slice Sampling Process",
        "authors": "Yizhu Jin",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/netcit57419.2022.00035"
    },
    {
        "id": 7286,
        "title": "Prediction of Cable Crosstalk for USV Based on LIGHTGBM",
        "authors": "Lyu Jifang, Ma Siyuan, Huang Dazhi",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccs57501.2023.10150671"
    },
    {
        "id": 7287,
        "title": "An Explainable Artificial Intelligence Based Early Lung Cancer Risk Prediction Using LightGBM",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.59287/as-ijanser.8"
    },
    {
        "id": 7288,
        "title": "Energy Conservation for Indoor Attractions Based on NRBO-LightGBM",
        "authors": "Debin Zhao, Zhengyuan Hu, Yinjian Yang, Qian Chen",
        "published": "2022-9-22",
        "citations": 1,
        "abstract": "In the context of COVID-19, energy conservation is becoming increasingly crucial to the overwhelmed tourism industry, and the heating, ventilation, and air conditioning system (HVAC) is the most energy-consuming factor in the indoor area of scenic spots. As tourist flows are not constant, the intelligent control of an HVAC system is the key to tourist satisfaction and energy consumption management. This paper proposes a noise-reduced and Bayesian-optimized (NRBO) light-gradient-boosting machine (LightGBM) to predict the probability of tourists entering the next scenic spot, hence adopting the feedforward dynamic adaptive adjustment of the ventilation and air conditioning system. The customized model is more robust and effective, and the experimental results in Luoyang City Hall indicate that the proposed system outperforms the baseline LightGBM model and a random-search based method concerning prediction loss by 5.39% and 4.42%, respectively, and saves energy by 23.51%. The study illustrates a promising step in the advancement of tourism energy consumption management and sustainable tourism in the experimental area by improving tourist experiences and conserving energy efficiently, and the software-based system can also be smoothly applied to other indoor scenic spots.",
        "link": "http://dx.doi.org/10.3390/su141911997"
    },
    {
        "id": 7289,
        "title": "Breast cancer prediction based on the machine learning algorithm LightGBM",
        "authors": "Jiayu Zhu",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "Nowadays, the idea of Artificial Intelligence (AI) medical detection has aroused great interest around the world. AI has the potential to strengthen medicine in both observation and operation. For instance, AI could catch crucial details that are not intuitive to humans. Robots controlled by AI could also do micro-operations that are extremely hard on human hands. In this study, the author utilizes one of the most focused traditional machine-learning methods, that is the Light Gradient Boosting Machine (LightGBM) algorithm for breast cancer prediction. The LightGBM performs both well on accuracy and speed in the studys experiment. The study applies the bootstrap aggregating (Bagging) method to cope with the over-fitting problem. As the significance of the study, the study shows that the LightGBM can be utilized in designing accurate, fast and cheap medical detection devices. Nevertheless, programmers should handle the over-fitting problem cautiously while building models based on LightGBM. This could help doctors in impoverished areas realize accurate medical detection. People could also do accurate self-diagnosing with a cheap, portable device at home.",
        "link": "http://dx.doi.org/10.54254/2755-2721/40/20230630"
    },
    {
        "id": 7290,
        "title": "Traffic Congestion Analysis and Prediction Method based on XGBoost and LightGBM",
        "authors": "Shuhua Li",
        "published": "2022-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitbs55627.2022.00080"
    },
    {
        "id": 7291,
        "title": "Study on Influencing Factors of Healing Music Records based on LightGBM",
        "authors": "Jiayu Chen",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "At present, all kinds of music albums have become an indispensable product of spiritual consumption in public life. It can not only ease the pressure of life and work brought by external life, but also add some different interests to people's life. However, high-quality music is more popular with people, such as Dolby sound quality, and the demand for playing different types of high-quality music in different occasions and environments has greatly increased. This study will identify whether there is audience or artificial noise data during the recording of music albums, and explore the characteristics of various music albums, so that later music producers can better improve their music quality. To more specific, this study firstly collected the related dataset from Tianchi Platform. Then, data visualization e.g., correlation analysis is carried out to observe the data before passing it into the model. Subsequently, a typical machine learning algorithm called Light Gradient Boosting Machine is employed to train the dataset. The experimental results demonstrated the effectiveness of the model used in this study.",
        "link": "http://dx.doi.org/10.54097/hset.v39i.6697"
    },
    {
        "id": 7292,
        "title": "Metasurfaces Design Based on Dnn and Lightgbm Algorithms",
        "authors": "Leilei Gu, Yaojun He, Hongzhan Liu, Zhongchao Wei, Jianping Guo",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4091370"
    },
    {
        "id": 7293,
        "title": "Scaling up SMEs’ credit scoring scope with LightGBM",
        "authors": "Bastien Lextrait",
        "published": "2023-2-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/00036846.2022.2095340"
    },
    {
        "id": 7294,
        "title": "JLGBMLoc—A Novel High-Precision Indoor Localization Method Based on LightGBM",
        "authors": "Lu Yin, Pengcheng Ma, Zhongliang Deng",
        "published": "2021-4-13",
        "citations": 4,
        "abstract": "Wi-Fi based localization has become one of the most practical methods for mobile users in location-based services. However, due to the interference of multipath and high-dimensional sparseness of fingerprint data, with the localization system based on received signal strength (RSS), is hard to obtain high accuracy. In this paper, we propose a novel indoor positioning method, named JLGBMLoc (Joint denoising auto-encoder with LightGBM Localization). Firstly, because the noise and outliers may influence the dimensionality reduction on high-dimensional sparseness fingerprint data, we propose a novel feature extraction algorithm—named joint denoising auto-encoder (JDAE)—which reconstructs the sparseness fingerprint data for a better feature representation and restores the fingerprint data. Then, the LightGBM is introduced to the Wi-Fi localization by scattering the processed fingerprint data to histogram, and dividing the decision tree under leaf-wise algorithm with depth limitation. At last, we evaluated the proposed JLGBMLoc on the UJIIndoorLoc dataset and the Tampere dataset, the experimental results show that the proposed model increases the positioning accuracy dramatically compared with other existing methods.",
        "link": "http://dx.doi.org/10.3390/s21082722"
    },
    {
        "id": 7295,
        "title": "Credit Card Fraud Detection Using Lightgbm Model",
        "authors": "Dingling Ge, Jianyang Gu, Shunyu Chang, JingHui Cai",
        "published": "2020-4",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecit50008.2020.00060"
    },
    {
        "id": 7296,
        "title": "Wavelet Denoised-ResNet CNN and LightGBM Method to Predict Forex Rate of Change",
        "authors": "Yiqi Zhao, Matloob Khushi",
        "published": "2020-11",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw51313.2020.00060"
    },
    {
        "id": 7297,
        "title": "An Optimized LightGBM Model for Fraud Detection",
        "authors": "K Huang",
        "published": "2020-11-1",
        "citations": 6,
        "abstract": "Abstract\nThe rapid development of e-commerce and the growing popularity of credit cards have made online transactions smooth and convenient. However, large numbers of online transactions are also the targets of online credit card fraud, which aggregate to enormous losses annually. In response to this trend, many machine learning and deep learning methods have been proposed to solve this problem. Unfortunately, most models have been developed on small datasets and require tedious fine-tuning processes. In this paper, a LightGBM-based method for fraud detection is proposed. The dataset used for this study is the IEEE-CIS Fraud Detection dataset provided by Vesta Corporation, which includes over 1 million samples. Experiments have shown that the LightGBM-based method outperforms most classical methods based on Support Vector Machine, XGBoost, or Random Forest. Besides, effective feature engineering methods for feature selection and Bayesian fine-tuning for automatic hyperparameter searching are also proposed.",
        "link": "http://dx.doi.org/10.1088/1742-6596/1651/1/012111"
    },
    {
        "id": 7298,
        "title": "Detection of Parkinson’s disease using LightGBM Classifier",
        "authors": "G.V. Dhruva Kumar, V. Deepa, N. Vineela, G. Emmanuel",
        "published": "2022-3-29",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccmc53470.2022.9753909"
    },
    {
        "id": 7299,
        "title": "Ship Target Detection Based on LightGBM Algorithm",
        "authors": "Zisen Zhong, Ying Li, Zhouzhou Han, Zhenliu Yang",
        "published": "2020-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cibda50819.2020.00102"
    },
    {
        "id": 7300,
        "title": "Ground subsidence risk mapping and assessment along Shanghai metro lines by PS-InSAR and LightGBM",
        "authors": "Long Chai, Xiongyao Xie, Biao Zhou, Li Zeng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Ground subsidence is a typical geological hazard in urban areas. It endangers the safety of infrastructures, such as subways. In this study, the ground subsidence risk of Shanghai metro lines was mapped and assessed. Firstly, PS-InSAR was used for the ground subsidence survey, and subsidence intensity was divided into five classes according to subsidence velocity. 10 subsidence causal factors were collected and the frequency ratio method was applied to analyze the correlation between subsidence and its causal factors. Then LightGBM model was used to generate a ground subsidence susceptibility map. And receiver operating characteristic curve and area under the curve (AUC) were adopted to assess the model. And AUC is 0.904, which suggests the model's performance is excellent. Finally, a risk matrix was introduced to consider the intensity and susceptibility of ground subsidence. The risk of ground subsidence was mapped and classified into five levels: R1 (very low), R2 (low), R3 (medium), R4 (high), and R5 (very high). The results showed that the risk of subway ground subsidence exhibited a regional-related characteristic. Metro lines located in areas with higher ground subsidence risk levels also had higher ground subsidence risk levels. Meanwhile, the statistical results of subway ground subsidence risk levels showed that subway stations were safer than sections.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-10874"
    }
]