[
    {
        "id": 17671,
        "title": "Multi-task Learning",
        "authors": "",
        "published": "2020-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781139061773.011"
    },
    {
        "id": 17672,
        "title": "Transfer Learning, Multi-task Learning, Continual Learning, and Meta-learning",
        "authors": "",
        "published": "2022-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009072205.018"
    },
    {
        "id": 17673,
        "title": "Multi-Agent Deep Reinforcement Learning for Collaborative Task Scheduling",
        "authors": "Mali Gergely",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012434700003636"
    },
    {
        "id": 17674,
        "title": "CUNI Submission to MRL 2023 Shared Task on Multi-lingual Multi-task Information Retrieval",
        "authors": "Jindřich Helcl, Jindřich Libovický",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.mrl-1.23"
    },
    {
        "id": 17675,
        "title": "Multi Task Deep Learning for Genomic Predictions",
        "authors": "Baohong Guo",
        "published": "No Date",
        "citations": 0,
        "abstract": "ABSTRACTGenomic predictions have been recognized as a new promising technique in animal and plant breeding. Linear mixed model is a widely used statistical technique, but it may not be desirable for large training sets and number of molecular markers, because it is intensive in computation. Deep learning is a subfield of machine learning and it can be used for complex predictions on a large scale. Multi task deep learning (MT-DL) incorporates related tasks(labels or traits) into one learning process to enable the learning model to perform better than single task deep learning (ST-DL). I applied MT-DL to genotype by environment genomic predictions to predict the performances of breeding lines at multiple environments. I compared MT-DL with linear mixed model-based Bayesian genotype × environment method (BGGE) and separate genomic predictions on single environments with widely used rrBLUP, ridge regression and ST-DL using cross validations. Compared with rrBLUP, MT-DL and non-linear BGGE showed a moderate increase of 9.4 and 7.6%, respectively, ST-DL has a small increase of 5.4%, ridge regression had a similar prediction accuracy and linear BGGE had a small decrease of −2.0% for prediction accuracy. I also found that all methods including rrBLUP had an overfitting, this is likely because yield genomic predictions are complex and the data set used in this study are small. rrBLUP, ridge regression, ST-DL and MT-DL has similar overfitting. Difference between training and test set prediction accuracies was between 0.344 and 0. 387. Linear and nonlinear BGGE methods seem to have much worse overfitting than other methods. Difference between training and test set prediction accuracies were 0.429 and 0.472, respectively. I also discussed the potential applications of ST-DL and MT-DL in genomic predictions of hybrid crops such as maize",
        "link": "http://dx.doi.org/10.1101/2021.01.15.426878"
    },
    {
        "id": 17676,
        "title": "Evolutionary Deep Multi-Task Learning",
        "authors": "Oliver Kramer",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14428/esann/2021.es2021-14"
    },
    {
        "id": 17677,
        "title": "Multi-task Deep Reinforcement Learning for IoT Service Selection",
        "authors": "Hiroki Matsuoka, Ahmed Moustafa",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010857800003116"
    },
    {
        "id": 17678,
        "title": "Recurrent Network and Multi-arm Bandit Methods for Multi-task Learning without Task Specification",
        "authors": "Thy Nguyen, Tayo Obafemi-Ajayi",
        "published": "2019-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8851824"
    },
    {
        "id": 17679,
        "title": "Multi-Task Learning for Multi-Dimensional Regression: Application to Luminescence Sensing",
        "authors": "Umberto Michelucci, Francesca Venturini",
        "published": "No Date",
        "citations": 2,
        "abstract": "The classical approach to non-linear regression in physics, is to take a mathematical model describing the functional dependence of the dependent variable from a set of independent variables, and then, using non-linear fitting algorithms, extract the parameters used in the modeling. Particularly challenging are real systems, characterised by several additional influencing factors related to specific components, like electronics or optical parts. In such cases, to make the model reproduce the data, empirically determined terms are built-in the models to compensate for the impossibility of modeling things that are, by construction, impossible to model. A new approach to solve this issue is to use neural networks, particularly feed-forward architectures with a sufficient number of hidden layers and an appropriate number of output neurons, each responsible for predicting the desired variables. Unfortunately, feed-forward neural networks (FFNNs) usually perform less efficiently when applied to multi-dimensional regression problems, that is when they are required to predict simultaneously multiple variables that depend from the input dataset in fundamentally different ways. To address this problem, we propose multi-task learning (MTL) architectures. These are characterized by multiple branches of task-specific layers, which have as input the output of a common set of layers. To demonstrate the power of this approach for multi-dimensional regression, the method is applied to luminescence sensing. Here the MTL architecture allows predicting multiple parameters, the oxygen concentration and the temperature, from a single set of measurements.",
        "link": "http://dx.doi.org/10.20944/preprints201910.0009.v1"
    },
    {
        "id": 17680,
        "title": "LT3 at SemEval-2020 Task 8: Multi-Modal Multi-Task Learning for Memotion Analysis",
        "authors": "Pranaydeep Singh, Nina Bauwelinck, Els Lefever",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.semeval-1.153"
    },
    {
        "id": 17681,
        "title": "Learning Sparse Task Relations in Multi-Task Learning",
        "authors": "Yu Zhang, Qiang Yang",
        "published": "2017-2-13",
        "citations": 37,
        "abstract": "\n      \n        In multi-task learning, when the number of tasks is large, pairwise task relations exhibit sparse patterns since usually a task cannot be helpful to all of the other tasks and moreover, sparse task relations can reduce the risk of overfitting compared with the dense ones. In this paper, we focus on learning sparse task relations. Based on a regularization framework which can learn task relations among multiple tasks, we propose a SParse covAriance based mulTi-taSk (SPATS) model to learn a sparse covariance by using the ℓl regularization. The resulting objective function of the SPATS method is convex, which allows us to devise an alternating method to solve it. Moreover, some theoretical properties of the proposed model are studied. Experiments on synthetic and real-world datasets demonstrate the effectiveness of the proposed method.\n      \n    ",
        "link": "http://dx.doi.org/10.1609/aaai.v31i1.10820"
    },
    {
        "id": 17682,
        "title": "Attentive Task Interaction Network for Multi-Task Learning",
        "authors": "Dimitrios Sinodinos, Narges Armanfard",
        "published": "2022-8-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr56361.2022.9956614"
    },
    {
        "id": 17683,
        "title": "Multi-Modal Embeddings Using Multi-Task Learning for Emotion Recognition",
        "authors": "Aparna Khare, Srinivas Parthasarathy, Shiva Sundaram",
        "published": "2020-10-25",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2020-1827"
    },
    {
        "id": 17684,
        "title": "Multi-Label Multi-Task Learning with Dynamic Task Weight Balancing",
        "authors": "Tianyi Wang, Shu-Ching Chen",
        "published": "2020-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iri49571.2020.00042"
    },
    {
        "id": 17685,
        "title": "Q-Learning Scheduler for Multi Task Learning Through the use of Histogram of Task Uncertainty",
        "authors": "Kourosh Meshgi, Maryam Sadat Mirzaei, Satoshi Sekine",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.repl4nlp-1.2"
    },
    {
        "id": 17686,
        "title": "Facial age estimation based on multi-task learning and label distribution learning",
        "authors": "Jianhui He, Chunlong Hu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFacial age estimation was promising for a wide range of applications in security access control, biometrics, recommender systems, and human-computer interaction.Current age estimation methods based on a priori label distribution learning often used Gaussian distribution as the true distribution of age. However, the Gaussian distribution affects the personalized representation of label classes. In this paper,We proposed an age encoding called MPD (Multi-Peak Distribution) to fuse the prior distributions of apparent and true ages for label distribution learning. Specifically, we used label shifting to construct the apparent age distribution. A lightweight multi-task learning network was designed to perform both label distribution learning and regression learning. Unlike traditional label distribution learning cascade networks, the parallel structure was able to reduce the error propagation from predictive distribution to regression.Extensive experimental analyses on three benchmark datasets demonstrate the superior performance of the proposed method.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1843041/v1"
    },
    {
        "id": 17687,
        "title": "Multi-Scale Feature Based Fashion Attribute Extraction Using Multi-Task Learning for e-Commerce Applications",
        "authors": "Viral Parekh, Karimulla Shaik",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011686700003417"
    },
    {
        "id": 17688,
        "title": "Networked Federated Multi-Task Learning",
        "authors": "Yasmin SarcheshmehPour, Yu Tian, Linli Zhang, Alexander Jung",
        "published": "No Date",
        "citations": 0,
        "abstract": "we characterize the network structure of data such that federated mulit-task learning is possible. <br>",
        "link": "http://dx.doi.org/10.36227/techrxiv.14685696"
    },
    {
        "id": 17689,
        "title": "Multi-agent Deep Reinforcement Learning for Task Allocation in Dynamic Environment",
        "authors": "Dhouha Ben Noureddine, Atef Gharbi, Samir Ben Ahmed",
        "published": "2017",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006393400170026"
    },
    {
        "id": 17690,
        "title": "Networked Federated Multi-Task Learning",
        "authors": "Yasmin SarcheshmehPour, Yu Tian, Linli Zhang, Alexander Jung",
        "published": "No Date",
        "citations": 1,
        "abstract": "we characterize the network structure of data such that federated mulit-task learning is possible. <br>",
        "link": "http://dx.doi.org/10.36227/techrxiv.14685696.v1"
    },
    {
        "id": 17691,
        "title": "Multi-Task Deep Learning for Multi-Parameter Elastic Inversion",
        "authors": "Duo Li, Peng Jiang, Senlin Yang, Fengkai Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nElastic waveform inversion plays a vital role in estimating the Earth's subsurface property. The inversion of multiple elastic parameters from observation data has been regarded as a cutting-edge and challenging issue due to its severe non-linearity and ill-posed nature. Deep learning approaches have recently demonstrated incredible potential in simulating non-linear mapping and made remarkable achievements in geophysical inversion. In this work, we consider multi-parameter elastic inversion as a multi-task learning problem and propose to accomplish the three tasks sequentially by a deep neural network with sequential decoders, which we name ElasInvNet. Specifically, we reconstruct the three elastic parameters, P-velocity, S-velocity, and density, one after the other, and use the features from the former task as the prior information to assist the later tasks' reconstruction. We verified the effectiveness of the proposed ElasInvNet through comprehensive comparisons and ablation studies.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3861992/v1"
    },
    {
        "id": 17692,
        "title": "Multi-task gradient descent for multi-task learning",
        "authors": "Lu Bai, Yew-Soon Ong, Tiantian He, Abhishek Gupta",
        "published": "2020-12",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12293-020-00316-3"
    },
    {
        "id": 17693,
        "title": "Review of: \"Evaluation of multi-task learning in deep learning-based positioning classification of mandibular third molars\"",
        "authors": "József Szalma",
        "published": "2022-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/96pr6r"
    },
    {
        "id": 17694,
        "title": "Deep Learning Solution for Pathological Voice Detection using LSTM-based Autoencoder Hybrid with Multi-Task Learning",
        "authors": "Dávid Sztahó, Kiss Gábor, Tulics Gábriel",
        "published": "2021",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010193101350141"
    },
    {
        "id": 17695,
        "title": "Review of: \"Smart Motorcycle Helmet: A CNN-Based Multi-Task Learning Approach\"",
        "authors": "Karthik Nathan",
        "published": "2024-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/jvygd8"
    },
    {
        "id": 17696,
        "title": "Deep Learning Solution for Pathological Voice Detection using LSTM-based Autoencoder Hybrid with Multi-Task Learning",
        "authors": "Dávid Sztahó, Kiss Gábor, Tulics Gábriel",
        "published": "2021",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010193100002865"
    },
    {
        "id": 17697,
        "title": "Review of: \"Smart Motorcycle Helmet: A CNN-Based Multi-Task Learning Approach\"",
        "authors": "Emimal M",
        "published": "2024-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/lvx8yb"
    },
    {
        "id": 17698,
        "title": "Interdependent Multi-task Learning for Simultaneous Segmentation and Detection",
        "authors": "Mahesh Reginthala, Yuji Iwahori, M. Bhuyan, Yoshitsugu Hayashi, Witsarut Achariyaviriya, Boonserm Kijsirikul",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008949501670174"
    },
    {
        "id": 17699,
        "title": "Multi-Task Distillation: Towards Mitigating the Negative Transfer in Multi-Task Learning",
        "authors": "Ze Meng, Xin Yao, Lifeng Sun",
        "published": "2021-9-19",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip42928.2021.9506618"
    },
    {
        "id": 17700,
        "title": "Learning Gait Representations with Noisy Multi-Task Learning",
        "authors": "Adrian Cosma, Emilian Radoi",
        "published": "2022-9-8",
        "citations": 2,
        "abstract": "Gait analysis is proven to be a reliable way to perform person identification without relying on subject cooperation. Walking is a biometric that does not significantly change in short periods of time and can be regarded as unique to each person. So far, the study of gait analysis focused mostly on identification and demographics estimation, without considering many of the pedestrian attributes that appearance-based methods rely on. In this work, alongside gait-based person identification, we explore pedestrian attribute identification solely from movement patterns. We propose DenseGait, the largest dataset for pretraining gait analysis systems containing 217 K anonymized tracklets, annotated automatically with 42 appearance attributes. DenseGait is constructed by automatically processing video streams and offers the full array of gait covariates present in the real world. We make the dataset available to the research community. Additionally, we propose GaitFormer, a transformer-based model that after pretraining in a multi-task fashion on DenseGait, achieves 92.5% accuracy on CASIA-B and 85.33% on FVG, without utilizing any manually annotated data. This corresponds to a +14.2% and +9.67% accuracy increase compared to similar methods. Moreover, GaitFormer is able to accurately identify gender information and a multitude of appearance attributes utilizing only movement patterns. The code to reproduce the experiments is made publicly.",
        "link": "http://dx.doi.org/10.3390/s22186803"
    },
    {
        "id": 17701,
        "title": "DMTMV: A Unified Learning Framework for Deep Multi-task Multi-view Learning",
        "authors": "Yi-Feng Wu, De-Chuan Zhan, Yuan Jiang",
        "published": "2018-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbk.2018.00015"
    },
    {
        "id": 17702,
        "title": "Multi-Task Learning for Multi-Objective Evolutionary Neural Architecture Search",
        "authors": "Ronghong Cai, Jianping Luo",
        "published": "2021-6-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec45853.2021.9504721"
    },
    {
        "id": 17703,
        "title": "Multi-Task Reinforcement Learning in Humans",
        "authors": "Momchil S. Tomov, Eric Schulz, Samuel J. Gershman",
        "published": "No Date",
        "citations": 3,
        "abstract": "ABSTRACTThe ability to transfer knowledge across tasks and generalize to novel ones is an important hallmark of human intelligence. Yet not much is known about human multi-task reinforcement learning. We study participants’ behavior in a novel two-step decision making task with multiple features and changing reward functions. We compare their behavior to two state-of-the-art algorithms for multi-task reinforcement learning, one that maps previous policies and encountered features to new reward functions and one that approximates value functions across tasks, as well as to standard model-based and model-free algorithms. Across three exploratory experiments and a large preregistered experiment, our results provide strong evidence for a strategy that maps previously learned policies to novel scenarios. These results enrich our understanding of human reinforcement learning in complex environments with changing task demands.",
        "link": "http://dx.doi.org/10.1101/815332"
    },
    {
        "id": 17704,
        "title": "Interactions Modeling in Multi-Task Multi-View Learning with Consistent Task Diversity",
        "authors": "Xiaoli Li, Jun Huan",
        "published": "2018-10-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3269206.3271670"
    },
    {
        "id": 17705,
        "title": "Multi-task Learning Approach for Automatic Modulation and Wireless Signal Classification",
        "authors": "Anu Jagannath, Jithin Jagannath",
        "published": "No Date",
        "citations": 1,
        "abstract": "Wireless signal recognition is becoming increasingly more significant for spectrum monitoring, spectrum management, and secure communications. Consequently, it will become a key enabler with the emerging fifth-generation (5G) and beyond 5G communications, Internet of Things networks, among others. State-of-the-art studies in wireless signal recognition have only focused on a single task which in many cases is insufficient information for a system to act on. In this work, for the first time in the wireless communication domain, we exploit the potential of deep neural networks in conjunction with multi-task learning (MTL) framework to simultaneously learn modulation and signal classification tasks. The proposed MTL architecture benefits from the mutual relation between the two tasks in improving the classification accuracy as well as the learning efficiency with a lightweight neural network model. Additionally, we consider the problem of heterogeneous wireless signals such as radar and communication signals in the electromagnetic spectrum. Accordingly, we have shown how the proposed MTL model outperforms several state-of-the-art single-task learning classifiers while maintaining a lighter architecture and performing two signal characterization tasks simultaneously. Finally, we also release the only known open heterogeneous wireless signals dataset that comprises of radar and communication signals with multiple labels.",
        "link": "http://dx.doi.org/10.36227/techrxiv.15156978"
    },
    {
        "id": 17706,
        "title": "Admet Property Prediction Via Multi-Task Graph Learning Under Adaptive Auxiliary Task Selection",
        "authors": "Bingxue Du, Yi Xu, S.M. Yiu, Hui Yu, Jianyu Shi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4540761"
    },
    {
        "id": 17707,
        "title": "Hierarchical Multi-task Learning via Task Affinity Groupings",
        "authors": "Siddharth Srivastava, Swati Bhugra, Vinay Kaushik, Brejesh Lall",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223053"
    },
    {
        "id": 17708,
        "title": "Multi-task Learning Approach for Automatic Modulation and Wireless Signal Classification",
        "authors": "Anu Jagannath, Jithin Jagannath",
        "published": "No Date",
        "citations": 2,
        "abstract": "Wireless signal recognition is becoming increasingly more significant for spectrum monitoring, spectrum management, and secure communications. Consequently, it will become a key enabler with the emerging fifth-generation (5G) and beyond 5G communications, Internet of Things networks, among others. State-of-the-art studies in wireless signal recognition have only focused on a single task which in many cases is insufficient information for a system to act on. In this work, for the first time in the wireless communication domain, we exploit the potential of deep neural networks in conjunction with multi-task learning (MTL) framework to simultaneously learn modulation and signal classification tasks. The proposed MTL architecture benefits from the mutual relation between the two tasks in improving the classification accuracy as well as the learning efficiency with a lightweight neural network model. Additionally, we consider the problem of heterogeneous wireless signals such as radar and communication signals in the electromagnetic spectrum. Accordingly, we have shown how the proposed MTL model outperforms several state-of-the-art single-task learning classifiers while maintaining a lighter architecture and performing two signal characterization tasks simultaneously. Finally, we also release the only known open heterogeneous wireless signals dataset that comprises of radar and communication signals with multiple labels.",
        "link": "http://dx.doi.org/10.36227/techrxiv.15156978.v1"
    },
    {
        "id": 17709,
        "title": "Learning task-parametrized assistive strategies for exoskeleton robots by multi-task reinforcement learning",
        "authors": "Masashi Hamaya, Takamitsu Matsubara, Tomoyuki Noda, Tatsuya Teramae, Jun Morimoto",
        "published": "2017-5",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2017.7989695"
    },
    {
        "id": 17710,
        "title": "Bridging the Gaps: Multi Task Learning for Domain Transfer of Hate Speech Detection",
        "authors": "Zeerak Talat, James Thorne, Joachim Bingel",
        "published": "2018",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-78583-7_3"
    },
    {
        "id": 17711,
        "title": "Unsupervised Learning of Spatio-Temporal Representation with Multi-Task Learning for Video Retrieval",
        "authors": "Vidit Kumar",
        "published": "2022-5-24",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ncc55593.2022.9806811"
    },
    {
        "id": 17712,
        "title": "5. Semi-supervised multi-task learning based on dynamic fuzzy sets",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9783110520651-005"
    },
    {
        "id": 17713,
        "title": "Improve Convergence Speed of Multi‐Agent Q‐Learning for Cooperative Task Planning",
        "authors": "",
        "published": "2020-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119699057.ch2"
    },
    {
        "id": 17714,
        "title": "Tensor Multi-Task Learning for Multi-View Representation of 3D Shape",
        "authors": "Yan Zhang, Sujia Fu, Yanyun Qu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451409"
    },
    {
        "id": 17715,
        "title": "Multi-Task Music Representation Learning from Multi-Label Embeddings",
        "authors": "Alexander Schindler, Peter Knees",
        "published": "2019-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cbmi.2019.8877462"
    },
    {
        "id": 17716,
        "title": "Neural Architecture Search in the Context of Deep Multi-Task Learning",
        "authors": "Guilherme Gadelha, Herman Gomes, Leonardo Batista",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011696200003417"
    },
    {
        "id": 17717,
        "title": "CT Multi-Task Learning with a Large Image-Text (LIT) Model",
        "authors": "Chuang Niu, Ge Wang",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractLarge language models (LLM) not only empower multiple language tasks but also serve as a general interface across different spaces. Up to now, it has not been demonstrated yet how to effectively translate the successes of LLMs in the computer vision field to the medical imaging field which involves high-dimensional and multi-modal medical images. In this paper, we report a feasibility study of building a multi-task CT large image-text (LIT) model for lung cancer diagnosis by combining an LLM and a large image model (LIM). Specifically, the LLM and LIM are used as encoders to perceive multi-modal information under task-specific text prompts, which synergizes multi-source information and task-specific and patient-specific priors for optimized diagnostic performance. The key components of our LIT model and associated techniques are evaluated with an emphasis on 3D lung CT analysis. Our initial results show that the LIT model performs multiple medical tasks well, including lung segmentation, lung nodule detection, and lung cancer classification. Active efforts are in progress to develop large image-language models for superior medical imaging in diverse applications and optimal patient outcomes.",
        "link": "http://dx.doi.org/10.1101/2023.04.06.535859"
    },
    {
        "id": 17718,
        "title": "Electricity demand forecasting by multi-task learning",
        "authors": "Jean-Baptiste Fiot, Francesco Dinuzzo",
        "published": "2017-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ptc.2017.7980955"
    },
    {
        "id": 17719,
        "title": "A Multi-Task Learning Framework for Image Restoration Using a Novel Generative Adversarial Network",
        "authors": "Rim Walha, Fadoua Drira, Rania Bedhief",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012421000003636"
    },
    {
        "id": 17720,
        "title": "Multi-Task Learning for",
        "authors": "Hikaru Omori, Mamoru Komachi",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/n19-1344"
    },
    {
        "id": 17721,
        "title": "Attention Balanced Multi-Dimension Multi-Task Deep Learning for Alopecia Recognition",
        "authors": "C Saraswathi,  , B Pushpa",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17485/ijst/v16i18.29"
    },
    {
        "id": 17722,
        "title": "Unified Autoencoder with Task Embeddings for Multi-Task Learning in Renewable Power Forecasting",
        "authors": "Chandana Priya Nivarthi, Stephan Vogt, Bernhard Sick",
        "published": "2022-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmla55696.2022.00240"
    },
    {
        "id": 17723,
        "title": "Multi-Objective Multi-Task Learning on RNNLM for Speech Recognition",
        "authors": "Minguang Song, Yunxin Zhao, Shaojun Wang",
        "published": "2018-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/slt.2018.8639649"
    },
    {
        "id": 17724,
        "title": "Jointly Predicting Arousal, Valence and Dominance with Multi-Task Learning",
        "authors": "Srinivas Parthasarathy, Carlos Busso",
        "published": "2017-8-20",
        "citations": 66,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2017-1494"
    },
    {
        "id": 17725,
        "title": "Optimization of Deep Reinforcement Learning with Hybrid Multi-Task Learning",
        "authors": "Nelson Vithayathil Varghese, Qusay H. Mahmoud",
        "published": "2021-4-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/syscon48628.2021.9447080"
    },
    {
        "id": 17726,
        "title": "Multi-task learning, hybrid architectures, and operational reality",
        "authors": "",
        "published": "2021-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789811237461_0011"
    },
    {
        "id": 17727,
        "title": "Domain-Specific Multi-Agent Dialog Policy Learning in Multi-Domain Task-Oriented Scenarios",
        "authors": "Li Tang, Yuke Si, Longbiao Wang, Jianwu Dang",
        "published": "2021-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2021-887"
    },
    {
        "id": 17728,
        "title": "Multi-step Forecasting via Multi-task Learning",
        "authors": "Shayan Jawed, Ahmed Rashed, Lars Schmidt-Thieme",
        "published": "2019-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata47090.2019.9006143"
    },
    {
        "id": 17729,
        "title": "Scale-Aware Task Message Transferring for Multi-Task Learning",
        "authors": "Shalayiding Sirejiding, Yuxiang Lu, Hongtao Lu, Yue Ding",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00319"
    },
    {
        "id": 17730,
        "title": "Evolutionary multi-task learning for modular extremal learning machine",
        "authors": " Zedong Tang,  Maoguo Gong,  Mingyang Zhang",
        "published": "2017-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2017.7969349"
    },
    {
        "id": 17731,
        "title": "A Simple Approach to Balance Task Loss in Multi-Task Learning",
        "authors": "Sicong Liang, Chang Deng, Yu Zhang",
        "published": "2021-12-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata52589.2021.9671640"
    },
    {
        "id": 17732,
        "title": "Explicit Evolutionary Multi-Task Optimization Algorithm",
        "authors": "Liang Feng, Abhishek Gupta, Kay Tan, Yew Ong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-5650-8_5"
    },
    {
        "id": 17733,
        "title": "Warren at SemEval-2020 Task 4: ALBERT and Multi-Task Learning for Commonsense Validation",
        "authors": "Yuhang Wu, Hao Wu",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.semeval-1.79"
    },
    {
        "id": 17734,
        "title": "Learning Task Relatedness in Multi-Task Learning for Images in Context",
        "authors": "Gjorgji Strezoski, Nanne van Noord, Marcel Worring",
        "published": "2019-6-5",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3323873.3325009"
    },
    {
        "id": 17735,
        "title": "Granular Syntax Processing with Multi-task and Curriculum Learning",
        "authors": "Xulang Zhang, Rui Mao, Erik Cambria",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nSyntactic processing techniques are the foundation of Natural Language Processing (NLP), supporting many downstream NLP tasks. In this paper, we conduct pair-wise Multi-Task Learning (MTL) on syntactic tasks with different granularity, namely Sentence Boundary Detection (SBD), text chunking, and Part-of-Speech(PoS) tagging, so as to investigate the extent to which they complement each other. We propose a novel soft parameter sharing mechanism to share local and global dependency information that is learned from both target tasks. We also propose a Curriculum Learning (CL) mechanism to improve MTL with non-parallel labeled data. Using non-parallel labeled data in MTL is a common practice, whereas it has not received enough attention before. For example, our employed PoS tagging data do not have text chunking labels. When learning PoS tagging and text chunking together, the proposed CL mechanism aims to select complementary samples from the two tasks to update the parameters of the MTL model in the same training batch. Such a method yields better performance and learning stability. We conclude that the fine-grained tasks can provide complementary features to coarse-grained ones, while the most coarse-grained task, SBD, provides useful information for the most fine-grained one, PoS tagging. Additionally, the text chunking task achieves state-of-the-art performance when joint learning with PoS tagging. Our analytical experiments also show the effectiveness of the proposed soft parameter sharing and CL mechanisms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3653529/v1"
    },
    {
        "id": 17736,
        "title": "Grape Disease Detection Network Based On Multi Task Learning and Attention Features",
        "authors": "",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48047/nq.2021.19.7.nq21118"
    },
    {
        "id": 17737,
        "title": "Multi-Task Learning using Frequency-Warped Spectrum for Detecting Out-of-breath Speech",
        "authors": "Sibasis Sahoo, Samarendra Dandapat",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper presents methods for detecting out-of-breath speech (OBS) under the shortness-of-breath condition due to physical load. It uses constant Q transform (CQT) for warping frequency spectrum non-linearly, which focuses on spectral saliencies of speech signal under the said condition. The existing works using deep neural networks (DNN) have spectrograms or prosodic features as input to detect the OBS speech. Two target labels, neutral and OBS, are commonly used for training DNN models. The labels, however, do not reflect the true exertion level in a speaker. In this work, a  transfer-learning approach is proposed for estimating the physical exertion level. An open-source DNN model, which is trained on environmental sounds, is used for the same purpose. A multi-task learning (MTL) framework is applied for jointly learning the binary class labels and the exertion levels. The results show that the spectrogram with non-linear  frequency warping performs better than its linear  counterparts. Furthermore, with MTL, the classification performance F1-score improves by 3.54% and 12.67% over the single task learning (STL) using CQT-spectrogram and Mel-spectrogram, respectively.",
        "link": "http://dx.doi.org/10.36227/techrxiv.19494902.v1"
    },
    {
        "id": 17738,
        "title": "Smart Motorcycle Helmet: Utilizing CNN for Multi-Task Learning",
        "authors": "Rodriges Jesan, Kumar Pant",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "Enhancing road safety through education and enforcement relies on automated motorcycle helmet detection via video surveillance. However, existing methods encounter challenges like tracking individual motorcycles and distinguishing riders from passengers. To overcome these limitations, we propose a CNN-based multi-task learning (MTL) method. Our approach focuses on identifying and tracking individual motorcycles, particularly emphasizing rider-specific helmet use. We introduce the HELMET dataset, containing 91,000 annotated frames from 10,006 motorcycles across 12 observation sites in Myanmar, serving as a benchmark for future detection techniques. Leveraging concurrent visual similarity learning and helmet use classification, our MTL approach achieves enhanced efficiency and accuracy, operating at over 8 FPS on consumer hardware. With a weighted average F-measure of 67.3% for detecting riders and helmet use, our method underscores deep learning's accuracy and resource efficiency in gathering critical road safety data. Furthermore, we present an intelligent motorcycle helmet equipped with infrared transceivers, an image sensor, an embedded computation module, a charging module, a microphone, and earphones. Designed for large vehicle approach notification, the helmet utilizes image recognition modes for both day and night conditions. Experimental results demonstrate successful vehicle registration plate recognition for large trucks/buses, achieving up to 75% accuracy during the day and 70% at night. In real-time, the proposed intelligent motorcycle helmet detects approaching large vehicles within a 5-meter distance.\n",
        "link": "http://dx.doi.org/10.32388/inl5ti.2"
    },
    {
        "id": 17739,
        "title": "Robust Lifelong Multi-task Multi-view Representation Learning",
        "authors": "Gan Sun, Yang Cong, Jun Li, Yun Fu",
        "published": "2018-11",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbk.2018.00020"
    },
    {
        "id": 17740,
        "title": "A Multi-Task Learning Framework for Multi-Target Stance Detection",
        "authors": "Yingjie Li, Cornelia Caragea",
        "published": "2021",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.findings-acl.204"
    },
    {
        "id": 17741,
        "title": "Multi-Label Annotation for Visual Multi-Task Learning Models",
        "authors": "Gaurang Sharma, Alexandre Angleraud, Roel Pieters",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/irc59093.2023.00012"
    },
    {
        "id": 17742,
        "title": "Multi-task learning from single-cell multimodal omics with Matilda",
        "authors": "Chunlei Liu, Hao Huang, Pengyi Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractSingle-cell multimodal omics technologies enable multiple molecular programs to be simultaneously profiled at a global scale in individual cells, creating opportunities to study biological systems at a resolution that was previously inaccessible. However, the analysis of single-cell multimodal omics data is challenging due to the lack of methods that can integrate across multiple data modalities generated from such technologies. Here, we present Matilda, a multi-task learning method for integrative analysis of single-cell multimodal omics data. By leveraging the interrelationship among tasks, Matilda learns to perform data simulation, dimension reduction, cell type classification, and feature selection in a single unified framework. We compare Matilda with other state-of-the-art methods on datasets generated from some of the most popular single-cell multimodal omics technologies. Our results demonstrate the utility of Matilda for addressing multiple key tasks on integrative single-cell multimodal omics data analysis.",
        "link": "http://dx.doi.org/10.1101/2022.06.01.494441"
    },
    {
        "id": 17743,
        "title": "Enhancing Stance Detection through Sequential Weighted Multi-task Learning",
        "authors": "Nora Alturayeif, Hamzah Luqman, Moataz Ahmed",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe exponential growth of user-generated content on social media platforms, online news outlets, and digital communication has necessitated the development of automated tools for analyzing opinions and attitudes expressed in text. Stance detection, a critical task in Natural Language Processing (NLP), aims to identify the underlying perspective or viewpoint of an individual or group towards a specific topic or target. This paper explores the challenges of stance detection, particularly in the context of social media, where brevity, informality, and limited contextual information prevail. While sentiment analysis focuses on explicit sentiment polarity, stance detection classifies the stance or viewpoint of a text towards a target, often of an abstract nature. This study introduces two multi-task learning (MTL) models that integrate sentiment analysis and sarcasm detection tasks to enhance stance detection performance. Four task weighting techniques are proposed and evaluated, and their effectiveness in the MTL models is demonstrated. Extensive evaluations on English and Arabic benchmark datasets highlight the advantages of the proposed models. Among them, the multi-target sequential MTL model stands out with its hierarchical weighting approach, as it achieves state-of-the-art performance. The study underscores the potential of MTL in improving stance detection and provides insights into the interaction between sentiment and stance, while considering the impact of sarcasm.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3218743/v1"
    },
    {
        "id": 17744,
        "title": "An End-to-End Multi-Task Learning Model for Image-based Table Recognition",
        "authors": "Nam Ly, Atsuhiro Takasu",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011685000003417"
    },
    {
        "id": 17745,
        "title": "Modular Adaptive Policy Selection for Multi- Task Imitation Learning through Task Division",
        "authors": "Dafni Antotsiou, Carlo Ciliberto, Tae-Kyun Kim",
        "published": "2022-5-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra46639.2022.9811819"
    },
    {
        "id": 17746,
        "title": "Multi-Task Learning using Frequency-Warped Spectrum for Detecting Out-of-breath Speech",
        "authors": "Sibasis Sahoo, Samarendra Dandapat",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper presents methods for detecting out-of-breath speech (OBS) under the shortness-of-breath condition due to physical load. It uses constant Q transform (CQT) for warping frequency spectrum non-linearly, which focuses on spectral saliencies of speech signal under the said condition. The existing works using deep neural networks (DNN) have spectrograms or prosodic features as input to detect the OBS speech. Two target labels, neutral and OBS, are commonly used for training DNN models. The labels, however, do not reflect the true exertion level in a speaker. In this work, a  transfer-learning approach is proposed for estimating the physical exertion level. An open-source DNN model, which is trained on environmental sounds, is used for the same purpose. A multi-task learning (MTL) framework is applied for jointly learning the binary class labels and the exertion levels. The results show that the spectrogram with non-linear  frequency warping performs better than its linear  counterparts. Furthermore, with MTL, the classification performance F1-score improves by 3.54% and 12.67% over the single task learning (STL) using CQT-spectrogram and Mel-spectrogram, respectively.",
        "link": "http://dx.doi.org/10.36227/techrxiv.19494902"
    },
    {
        "id": 17747,
        "title": "Enhancing Mental Health Condition Detection on Social Media Through Multi-Task Learning",
        "authors": "Jiawen Liu, Menglu Su",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4747385"
    },
    {
        "id": 17748,
        "title": "Federated Multi-Task Learning: An Overview and Quantitative Evaluation",
        "authors": "Faisal Ahmed, Shih-Chun Lin, Myungjin Lee",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4442710"
    },
    {
        "id": 17749,
        "title": "Towards Multi-task Learning of Speech and Speaker Recognition",
        "authors": "Nik Vaessen, David A. van Leeuwen",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-353"
    },
    {
        "id": 17750,
        "title": "Personalized Keyword Spotting through Multi-task Learning",
        "authors": "Seunghan Yang, Byeonggeun Kim, Inseop Chung, Simyung Chang",
        "published": "2022-9-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2022-947"
    },
    {
        "id": 17751,
        "title": "Highly Scalable Task Grouping for Deep Multi-Task Learning in Prediction of Epigenetic Events",
        "authors": "Mohammad Shiri, Jiangwen Sun",
        "published": "2022-12-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bibm55620.2022.9994979"
    },
    {
        "id": 17752,
        "title": "HOMADOS at SemEval-2021 Task 6: Multi-Task Learning for Propaganda Detection",
        "authors": "Konrad Kaczyński, Piotr Przybyła",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.semeval-1.141"
    },
    {
        "id": 17753,
        "title": "A Multi-classification Model of Industry Based on Multi-task Learning",
        "authors": "Jiaqi Liu",
        "published": "2022-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccsmt58129.2022.00102"
    },
    {
        "id": 17754,
        "title": "DMMP: A Distillation-Based Multi-Task Multi-Tower Learning Model for Personalized Recommendation",
        "authors": "Qingqing Yi, Jingjing Tang, Yujian Zeng, Xueting Zhang, Weiqi Xu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4467435"
    },
    {
        "id": 17755,
        "title": "Label-Sensitive Task Grouping by Bayesian Nonparametric Approach for Multi-Task Multi-Label Learning",
        "authors": "Xiao Zhang, Wenzhong Li, Vu Nguyen, Fuzhen Zhuang, Hui Xiong, Sanglu Lu",
        "published": "2018-7",
        "citations": 2,
        "abstract": "Multi-label learning is widely applied in many real-world applications, such as image and gene annotation. While most of the existing multi-label learning models focus on the single-task learning problem, there are always some tasks that share some commonalities, which can help each other to improve the learning performances if the knowledge in the similar tasks can be smartly shared. In this paper, we propose a LABel-sensitive TAsk Grouping framework, named LABTAG, based on Bayesian nonparametric approach for multi-task multi-label classification. The proposed framework explores the label correlations to capture feature-label patterns, and clusters similar tasks into groups with shared knowledge, which are learned jointly to produce a strengthened multi-task multi-label model. We evaluate the model performance on three public multi-task multi-label data sets, and the results show that LABTAG outperforms the compared baselines with a significant margin.",
        "link": "http://dx.doi.org/10.24963/ijcai.2018/434"
    },
    {
        "id": 17756,
        "title": "Multi-task Supervised Learning via Cross-learning",
        "authors": "Juan Cervino, Juan Andres Bazerque, Miguel Calvo-Fullana, Alejandro Ribeiro",
        "published": "2021-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco54536.2021.9615939"
    },
    {
        "id": 17757,
        "title": "Multi-task learning with graph attention networks for multi-domain task-oriented dialogue systems",
        "authors": "Meng Zhao, Lifang Wang, Zejun Jiang, Ronghan Li, Xinyu Lu, Zhongtian Hu",
        "published": "2023-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.knosys.2022.110069"
    },
    {
        "id": 17758,
        "title": "Multi-Task Deep Learning as Multi-Objective Optimization",
        "authors": "Giuseppe Di Fatta, Giuseppe Nicosia, Varun Ojha, Panos Pardalos",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-54621-2_827-1"
    },
    {
        "id": 17759,
        "title": "Multi-view visual speech recognition based on multi task learning",
        "authors": "HouJeung Han, Sunghun Kang, Chang D. Yoo",
        "published": "2017-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2017.8297030"
    },
    {
        "id": 17760,
        "title": "MultiNet: Multi-Modal Multi-Task Learning for Autonomous Driving",
        "authors": "Sauhaarda Chowdhuri, Tushar Pankaj, Karl Zipser",
        "published": "2019-1",
        "citations": 39,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wacv.2019.00164"
    },
    {
        "id": 17761,
        "title": "Multi-Task Learning for Multi-Dimensional Regression: Application to Luminescence Sensing",
        "authors": "Umberto Michelucci, Francesca Venturini",
        "published": "2019-11-7",
        "citations": 12,
        "abstract": "The classical approach to non-linear regression in physics is to take a mathematical model describing the functional dependence of the dependent variable from a set of independent variables, and then using non-linear fitting algorithms, extract the parameters used in the modeling. Particularly challenging are real systems, characterized by several additional influencing factors related to specific components, like electronics or optical parts. In such cases, to make the model reproduce the data, empirically determined terms are built in the models to compensate for the difficulty of modeling things that are, by construction, difficult to model. A new approach to solve this issue is to use neural networks, particularly feed-forward architectures with a sufficient number of hidden layers and an appropriate number of output neurons, each responsible for predicting the desired variables. Unfortunately, feed-forward neural networks (FFNNs) usually perform less efficiently when applied to multi-dimensional regression problems, that is when they are required to predict simultaneously multiple variables that depend from the input dataset in fundamentally different ways. To address this problem, we propose multi-task learning (MTL) architectures. These are characterized by multiple branches of task-specific layers, which have as input the output of a common set of layers. To demonstrate the power of this approach for multi-dimensional regression, the method is applied to luminescence sensing. Here, the MTL architecture allows predicting multiple parameters, the oxygen concentration and temperature, from a single set of measurements.",
        "link": "http://dx.doi.org/10.3390/app9224748"
    },
    {
        "id": 17762,
        "title": "Anti-Spoofing Speaker Verification System with Multi-Feature Integration and Multi-Task Learning",
        "authors": "Rongjin Li, Miao Zhao, Zheng Li, Lin Li, Qingyang Hong",
        "published": "2019-9-15",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2019-1698"
    },
    {
        "id": 17763,
        "title": "Decision making on robot with multi-task using deep reinforcement learning for each task",
        "authors": "Yuya Shimoguchi, Kentarou Kurashige",
        "published": "2019-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smc.2019.8914426"
    },
    {
        "id": 17764,
        "title": "Multi-Task Networks with Universe, Group, and Task Feature Learning",
        "authors": "Shiva Pentyala, Mengwen Liu, Markus Dreyer",
        "published": "2019",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/p19-1079"
    },
    {
        "id": 17765,
        "title": "Mitigate Gender Bias using Negative Multi-Task Learning",
        "authors": "Liyuan Gao, Huixin Zhan, Austin Chen, Victor Sheng",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nDeep learning models have shown their great performances in natural language processing tasks. While much attention has been paid towards improvements in utility, privacy leakage and social bias are two major concerns arising in trained models. In this paper, we protect individual privacy and mitigate gender bias on classification models simultaneously. First, we propose a selective privacy-preserving method that only obscure individuals' sensitive information by adding noise on word embeddings. Then we propose a negative multi-task learning framework to mitigate the gender bias which contains a main task and a gender prediction task. The main task uses a positive loss constraint to ensure utility while the gender prediction task applies a negative loss constraint to remove gender-specific features. We analyze two existing word embeddings and evaluate them on sentiment analysis and medical text classification tasks. Our experimental results show that our negative multi-task learning framework can mitigate the gender bias while keeping models’ utility on both sentiment analysis and medical text classification.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2024101/v1"
    },
    {
        "id": 17766,
        "title": "Dynamic Subgraph Reasoning of Knowledge Base Question Answering Based on Multi-Task Learning",
        "authors": "Zhichao Wu, Xuan Tian",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4757418"
    },
    {
        "id": 17767,
        "title": "Multi-task Self-Supervised Visual Learning",
        "authors": "Carl Doersch, Andrew Zisserman",
        "published": "2017-10",
        "citations": 303,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2017.226"
    },
    {
        "id": 17768,
        "title": "Smart Motorcycle Helmet: A CNN-Based Multi-Task Learning Approach",
        "authors": "Rodriges Jesan, Kumar Pant",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Automated motorcycle helmet detection through video surveillance is crucial for enhancing road safety through education and enforcement. Existing approaches face limitations, such as difficulty in tracking individual motorcycles and distinguishing drivers from passengers. To address these challenges, we propose a CNN-based multi-task learning (MTL) method for identifying and tracking individual motorcycles, with a focus on rider-specific helmet use. We introduce the HELMET dataset, comprising 91,000 annotated frames from 10,006 motorcycles across 12 observation sites in Myanmar, providing a benchmark for future detection approaches. Our MTL approach, leveraging concurrent visual similarity learning and helmet use classification, achieves improved efficiency and accuracy. The proposed method operates at over 8 FPS on consumer hardware, yielding a weighted average F-measure of 67.3% for detecting riders and helmet use. Our work showcases deep learning as an accurate and resource-efficient means of collecting critical road safety data. we present an intelligent motorcycle helmet featuring infrared transceivers, an image sensor, an embedded computation module, a charging module, a microphone, and earphones. Designed for large vehicle approach intimation, the helmet uses image recognition modes for day and night conditions. Experimental results demonstrate successful vehicle registration plate recognition for large trucks/buses, achieving up to 75% accuracy during the day and 70% at night. The proposed intelligent motorcycle helmet detects approaching large vehicles in real time within a 5-meter distance.\n",
        "link": "http://dx.doi.org/10.32388/inl5ti"
    },
    {
        "id": 17769,
        "title": "Analyzing Multi-Task-Learning for Abstractive Text Summarization",
        "authors": "Frederic Kirstein, Jan Philip Wahle, Bela Gipp, Terry Ruas",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22541/au.167528155.56390170/v1"
    },
    {
        "id": 17770,
        "title": "Federated Multi-Task Learning: An Overview and Quantitative Evaluation",
        "authors": "Faisal Ahmed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4627317"
    }
]