[
    {
        "id": 1101,
        "title": "Expectation-Maximization (EM): Practice",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526469212"
    },
    {
        "id": 1102,
        "title": "Early Fetal Weight Estimation with Expectation Maximization Algorithm",
        "authors": "Loc Nguyen",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31058/j.em.2018.11002"
    },
    {
        "id": 1103,
        "title": "Expectation Maximization Algorithm",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/vipatq"
    },
    {
        "id": 1104,
        "title": "Expectation Maximization Algorithm with Combinatorial Assumption",
        "authors": "Loc Nguyen",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nExpectation maximization (EM) algorithm is a popular and powerful mathematical method for parameter estimation in case that there exist both observed data and hidden data. The EM process depends on an implicit relationship between observed data and hidden data which is specified by a mapping function in traditional EM and a joint probability density function (PDF) in practical EM. However, the mapping function is vague and impractical whereas the joint PDF is not easy to be defined because of heterogeneity between observed data and hidden data. The research aims to improve competency of EM by making it more feasible and easier to be specified, which removes the vagueness. Therefore, the research proposes an assumption that observed data is the combination of hidden data which is realized as an analytic function where data points are numerical. In other words, observed points are supposedly calculated from hidden points via regression model. Mathematical computations and proofs indicate feasibility and clearness of the proposed method which can be considered as an extension of EM.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1304827/v1"
    },
    {
        "id": 1105,
        "title": "Goldfish (Carassius auratus) Segmentation Using Expectation Maximization (EM) Method",
        "authors": "Yunda Heningtyas, Rico Andrian, Akmal Junaidi, S Susiyani",
        "published": "2020-9-17",
        "citations": 0,
        "abstract": "Carrasius Auratus atau dikenal sebagai ikan Maskoki adalah ikan hias yang paling banyak dipelihara didalam akuarium yang memiliki spesies, bentuk, dan warna yang beragam. Identifikasi ikan Maskoki secara manual sulit dilakukan. Hal ini disebabkan anatomi ikan Maskoki yang hampir serupa. Spesies yang anatominya hampir serupa diperlukan identifikasi ikan secara otomatis. Identifikasi ikan Maskoki memiliki beberapa proses untuk menentukan tingkat keberhasilan. Salah satu proses yang sangat penting untuk identifikasi yaitu segmentasi. Segmentasi merupakan tahapan untuk memisahkan antara objek dan background. Hasil segmentasi yang baik akan memberikan hasil ekstraksi fitur yang maksimal dan pasti berdampak pada hasil identifikasi yang optimal. Penelitian ini bertujuan membuat sebuah sistem yang dapat digunakan  untuk segmentasi objek ikan Maskoki dengan background menggunakan metode Expectation Maximization. Expectation Maximization adalah algoritma untuk menduga suatu parameter dalam suatu fungsi dengan menggunakan Maximum Likelihood Estimation (MLE). Spesies ikan Maskoki masing-masing berjumlah 72 citra total keseluruhan berjumlah 216. Hasil evaluasi segmentasi ikan Maskoki menggunakan metode Expectation Maximization mampu bekerja baik dengan tingkat akurasi mencapai 89,14%. Analisis hasil segmentasi citra ikan yang tidak sempurna dipengaruhi oleh cahaya putih dan warna background hampir serupa dengan objek ikan Maskoki. Hasil segmentasi citra ikan Maskoki terbaik dipengaruhi oleh citra ikan Maskoki yang baik pada saat proses pengambilan citra pada saat screenshot memiliki fokus yang stabil dan tidak blur, sehingga menghasilkan tepian objek ikan Maskoki terlihat jelas dan tajam.",
        "link": "http://dx.doi.org/10.30871/jaic.v4i2.2387"
    },
    {
        "id": 1106,
        "title": "Improved Expectation Maximization (EM) Algorithm based on Initial Parameter Selection",
        "authors": "Maria Lolita G. Masangcap",
        "published": "2018-4-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2018.4446"
    },
    {
        "id": 1107,
        "title": "Expectation Maximization (EM)-based Joint Channel Estimation and Symbol Detection in Doubly Selective Block Transmission Systems",
        "authors": "Manjeer Majumder, Amrita Mishra, Aditya K. Jagannatham",
        "published": "2020-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vtc2020-spring48590.2020.9128441"
    },
    {
        "id": 1108,
        "title": "Expectation Maximization",
        "authors": "",
        "published": "2022-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009218245.007"
    },
    {
        "id": 1109,
        "title": "An Asymmetric Distribution with Heavy Tails and Its Expectation–Maximization (EM) Algorithm Implementation",
        "authors": "Neveka M. Olmos, Osvaldo Venegas, Yolanda M. Gómez, Yuri A. Iriarte",
        "published": "2019-9-10",
        "citations": 2,
        "abstract": "In this paper we introduce a new distribution constructed on the basis of the quotient of two independent random variables whose distributions are the half-normal distribution and a power of the exponential distribution with parameter 2 respectively. The result is a distribution with greater kurtosis than the well known half-normal and slashed half-normal distributions. We studied the general density function of this distribution, with some of its properties, moments, and its coefficients of asymmetry and kurtosis. We developed the expectation–maximization algorithm and present a simulation study. We calculated the moment and maximum likelihood estimators and present three illustrations in real data sets to show the flexibility of the new model.",
        "link": "http://dx.doi.org/10.3390/sym11091150"
    },
    {
        "id": 1110,
        "title": "The Bayesian Expectation-Maximization-Maximization for the 3PLM",
        "authors": "Shaoyang Guo, Chanjin Zheng",
        "published": "2019-5-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3389/fpsyg.2019.01175"
    },
    {
        "id": 1111,
        "title": "Reward Shaping Via Expectation Maximization Method",
        "authors": "Zelin Deng, Xing Liu, Yunlong Dong",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4592179"
    },
    {
        "id": 1112,
        "title": "Parameter estimation of Gaussian mixture models (GMM) with expectation maximization (EM) algorithm",
        "authors": "Wardatul Jannah, Dewi R. S. Saputro",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0117119"
    },
    {
        "id": 1113,
        "title": "Application of Expectation-Maximization (EM) Algorithm in Grouping Popularity Tourism Objects in Malang Raya Based on Indicator of Many Visitors",
        "authors": "Nur Atikah",
        "published": "2019-10-31",
        "citations": 0,
        "abstract": "Malang Metropolitan Area is one of the areas in East Java which is a leading tourism destination in Indonesia with Batu Tourism City (Kota Wisata Batu) as the center. Considering the development of tourism in Malang, it is necessary to do a grouping of the popularity of tourism objects so that it can be used as a reference for making policy by the tourism department and tourism management. In this article, the grouping is analyzed by using the method of grouping the Expectation Maximation (EM) algorithm. The data used is secondary data obtained from BPS data, namely data of many tourism visitors in Malang Raya. The results of the grouping the popularity of leading tourism objects in Malang are based on indicators of the number of visitors divided into five groups, there are Group 1: Selecta; Group 2: Balekambang, Pemandian Wendit and Wisata Oleh-Oleh Brawijaya; Group3: Museum Angkut, Coban Rondo,  Museum Satwa, Jatim Park, BNS, Petik Apel “Makmur Abadi and Agro Kebun Teh Wonosari; Group 4: Kusuma Agro Wisata, Kampoeng Kidz, Air Panas Cangar, Eco Green Park, Predator Fun Park, Wana Wisata Coban Rais, Gunung Banyak, Mahajaya T-Shirt & Oleh-oleh, Ngliyep and Bendungan Selorejo; Group 5: Vihara “Dammadhipa Arama”, Rafting “Kaliwatu”, Batu Rafting, Wana Wisata Coban Talun, Pemandian Tirta Nirwana, Pemandian Air Panas Alam Songgoriti, Wonderland Waterpark, Sahabat Air Rafting, Petik Apel Mandiri, Batu Agro Apel, Kampung Wisata.",
        "link": "http://dx.doi.org/10.15642/mantik.2019.5.2.123-134"
    },
    {
        "id": 1114,
        "title": "Variational Inference and Variational Expectation Maximization",
        "authors": "",
        "published": "2022-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009072205.014"
    },
    {
        "id": 1115,
        "title": "Geom-Spider-EM: Faster Variance Reduced Stochastic Expectation Maximization for Nonconvex Finite-Sum Optimization",
        "authors": "Gersende Fort, Eric Moulines, Hoi-To Wai",
        "published": "2021-6-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp39728.2021.9414271"
    },
    {
        "id": 1116,
        "title": "Parameter Estimation Via Expectation Maximization - Expectation Consistent Algorithm",
        "authors": "Fangqing Xiao, Dirk Slock",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447082"
    },
    {
        "id": 1117,
        "title": "Tutorial on the expectation maximization algorithm for mixture distributions",
        "authors": "Oliver Strebel",
        "published": "No Date",
        "citations": 0,
        "abstract": "A short tutorial on the expectation maximization algorithm for mixture distributions and mixture regressions",
        "link": "http://dx.doi.org/10.31219/osf.io/dnm72"
    },
    {
        "id": 1118,
        "title": "Face pattern recognition using Expectation-Maximization (EM) algorithm",
        "authors": "Joko Purwadi, Julan Hernadi, M. Danang Suryantoro",
        "published": "2022-5-18",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nThis paper discuss about the use face patteren recognition which is now days become popular especialy on smartphone lock screen system. The method used in this research are the Expectation – Maximization (EM) Algorithm. EM Algorithm is an iterative optimization method for the estimation of Maximum Likelihood (ML) which is used in incomplete data problems.  there are 2 stages, namely the Expectation stage E (E-step) and the Maximization stage M (M-step).  These two stages will continue to be carried out until they reach a convergent value. The result of the research shows that EM Algorthm produce high accuracy, it’s about 95% on the data training and 83% accuracy on the data testing.\r\n\r\n\r\n\r\n",
        "link": "http://dx.doi.org/10.12928/bamme.v2i1.5520"
    },
    {
        "id": 1119,
        "title": "The Basic Idea behind Expectation-Maximization",
        "authors": "",
        "published": "2020-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108650212.020"
    },
    {
        "id": 1120,
        "title": "Multilevel Image Thresholding Based on Improved Expectation Maximization (EM) and Differential Evolution Algorithm",
        "authors": "Ehsan Ehsaeyan, Alireza Zolghadrasli",
        "published": "2021-8",
        "citations": 0,
        "abstract": " Multilevel image thresholding is an essential step in the image segmentation process. Expectation Maximization (EM) is a powerful technique to find thresholds but is sensitive to the initial points. Differential Evolution (DE) is a robust metaheuristic algorithm that can find thresholds rapidly. However, it may be trapped in the local optimums and premature convergence occurs. In this paper, we incorporate EM algorithm to DE and introduce a novel algorithm called EM+DE which overcomes these shortages and can segment images better than EM and DE algorithms. In the proposed method, EM estimates Gaussian Mixture Model (GMM) coefficients of the histogram and DE tries to provide good volunteer solutions to EM algorithm when EM converges in local areas. Finally, DE fits GMM parameters based on Root Mean Square Error (RMSE) to reach the fittest curve. Ten standard test images and six famous metaheuristic algorithms are considered and result on global fitness. PSNR, SSIM, FSIM criteria and the computational time are given. The experimental results prove that the proposed algorithm outperforms the EM and DE as well as EM+ other natural-inspired algorithms in terms of segmentation criteria. ",
        "link": "http://dx.doi.org/10.1142/s0219843621500134"
    },
    {
        "id": 1121,
        "title": "Expectation-Maximization Algorithms for Itakura-Saito Nonnegative Matrix Factorization",
        "authors": "Paul Magron, Tuomas Virtanen",
        "published": "2018-9-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2018-1840"
    },
    {
        "id": 1122,
        "title": "Expectation-Maximization Algorithm",
        "authors": "Boris Flach, Vaclav Hlavac",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63416-2_692"
    },
    {
        "id": 1123,
        "title": "Big Data Using Efficient Expectation–Maximization Algorithm in Wireless Sensor Networks",
        "authors": "A. kamalraj,  ",
        "published": "2017-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijetst/v4i9.25"
    },
    {
        "id": 1124,
        "title": "Expectation Maximization Algorithm with Combinatorial Assumption",
        "authors": "Loc Nguyen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3976593"
    },
    {
        "id": 1125,
        "title": "Expectation-Maximization (EM): Theory",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526469038"
    },
    {
        "id": 1126,
        "title": "Clustered Sparse Channel Estimation for Massive MIMO Systems by Expectation Maximization-Propagation (EM-EP)",
        "authors": "Mohammed Rashid, Mort Naraghi-Pour",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tvt.2023.3250399"
    },
    {
        "id": 1127,
        "title": "Privacy Preserving Expectation Maximization (EM) Clustering Construction",
        "authors": "Mona Hamidi, Mina Sheikhalishahi, Fabio Martinelli",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-94649-8_31"
    },
    {
        "id": 1128,
        "title": "An Expectation-Maximization approach for matrix factorization in location-based recommender systems",
        "authors": "Alireza Moayedikia",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nOn Location Based Social Network (LBSN) platforms, users benefit from location recommendation algorithms to find places of interest. Several algorithms have been proposed to accomplish the location recommendation task. However, these algorithms suffer from (i) the lack of trust information consideration and (ii) assuming users’ interest are static and does not change overtime. To overcome these two shortcomings this paper introduces an adaptive probabilistic-based location recommendation algorithm known as EXMAX which uses expectation-maximisation along with matrix factorisation to predict the rating a user may give to the next visit. The predicted rating will be used as a filter to remove any places with a score lower than the user’s predicted rating. EXMAX represents check-in data as a user-location matrix where every time a user checks into a new location check-in along with location information will be appended to the user-location matrix. This representation method ensures EXMAX preserves the most up-to-date users’ preference information. Also, the proposed algorithm exploits friendship network data as well as sentiment of the comments left by the user to label every checkin with either a positive or negative experience. To measure EXMAX efficacy, its performance is tested in several experimentation scenarios and compared against three rival algorithms in terms of root mean square error and Yelp dataset. The results confirm EXMAX robustness and superiority over other probabilistic and statistic location recommendation algorithms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2296826/v1"
    },
    {
        "id": 1129,
        "title": "Design of Radial Basis Function Neural Networks with the Aid of Expectation-Maximization Learning",
        "authors": "Seok-Beom Roh, Sung-Kwun Oh",
        "published": "2020-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5391/jkiis.2020.30.1.1"
    },
    {
        "id": 1130,
        "title": "Expectation Maximization Algorithm and Extensions",
        "authors": "Murray Aitkin",
        "published": "2017-3-31",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b19166-12"
    },
    {
        "id": 1131,
        "title": "EM-detwin: A Program for Resolving Indexing Ambiguity in Serial Crystallography Using the Expectation-Maximization Algorithm",
        "authors": "Yingchen Shi, Haiguang Liu",
        "published": "2020-7-8",
        "citations": 2,
        "abstract": "Serial crystallography (SX), first used as an application of X-ray free-electron lasers (XFELs), is becoming a useful method to determine atomic-resolution structures of proteins from micrometer-sized crystals with bright X-ray sources. Because of unknown orientations of crystals in SX, indexing ambiguity issue arises when the symmetry of Bravais lattice is higher than the space group symmetry, making some diffraction signals wrongly merged to the total intensity in twinned orientations. In this research, we developed a program within the CrystFEL framework, the EM-detwin, to resolve this indexing ambiguity problem based on the expectation-maximization algorithm. Testing results on the performance of the EM-detwin have demonstrated its usefulness in correctly indexing diffraction data as a valuable tool for SX data analysis.",
        "link": "http://dx.doi.org/10.3390/cryst10070588"
    },
    {
        "id": 1132,
        "title": "Expectation-Maximization Algorithm for Autoregressive Models with Cauchy Innovations",
        "authors": "Monika S. Dhull, Arun Kumar",
        "published": "2022-6-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/engproc2022018021"
    },
    {
        "id": 1133,
        "title": "Estimation of the Parameters of Poisson-Exponential Distribution Based on Progressively Type II Censoring Using the Expectation Maximization (Em) Algorithm",
        "authors": "Joseph Nderitu Gitahi",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11648/j.ajtas.20170603.12"
    },
    {
        "id": 1134,
        "title": "Background noise estimation using an expectation maximization algorithm",
        "authors": "Joel N. Bjornstad, Granger W. Hickman",
        "published": "2017-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/oceanse.2017.8084690"
    },
    {
        "id": 1135,
        "title": "Early Fetal Weight Estimation with Expectation Maximization Algorithm",
        "authors": "Loc Nguyen, Thu-Hang T. Ho",
        "published": "No Date",
        "citations": 0,
        "abstract": "Fetal weight estimation before delivery is important in obstetrics, which assists doctors diagnose abnormal or diseased cases. Linear regression based on ultrasound measures such as bi-parietal diameter (bpd), head circumference (hc), abdominal circumference (ac), and fetal length (fl) is common statistical method for weight estimation but the regression model requires that time points of collecting such measures must not be too far from last ultrasound scans. Therefore this research proposes a method of early weight estimation based on expectation maximization (EM) algorithm so that ultrasound measures can be taken at any time points in gestational period. In other words, gestational sample can lack some or many fetus weights, which gives facilities to practitioners because practitioners need not concern fetus weights when taking ultrasound examinations. The proposed method is called dual regression expectation maximization (DREM) algorithm. Experimental results indicate that accuracy of DREM decreases insignificantly when completion of ultrasound sample decreases significantly. So it is proved that DREM withstands missing values in incomplete sample or sparse sample.",
        "link": "http://dx.doi.org/10.20944/preprints201803.0212.v1"
    },
    {
        "id": 1136,
        "title": "Expectation-Maximization Algorithm",
        "authors": "Boris Flach, Vaclav Hlavac",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-03243-2_692-1"
    },
    {
        "id": 1137,
        "title": "Online Blind Audio Source Separation Using Recursive Expectation-Maximization",
        "authors": "Aviad Eisenberg, Boaz Schwartz, Sharon Gannot",
        "published": "2021-8-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2021-662"
    },
    {
        "id": 1138,
        "title": "Expectation-Maximization enables Phylogenetic Dating under a Categorical Rate Model",
        "authors": "Uyen Mai, Eduardo Charvel, Siavash Mirarab",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractDating phylogenetic trees to obtain branch lengths in time unit is essential for many downstream applications but has remained challenging. Dating requires inferring substitution rates that can change across the tree. While we can assume to have information about a small subset of nodes from the fossil record or sampling times (for fast-evolving organisms), inferring the ages of the other nodes essentially requires extrapolation and interpolation. Assuming a clock model that defines a distribution over rates, we can formulate dating as a constrained maximum likelihood (ML) estimation problem. While ML dating methods exist, their accuracy degrades in the face of model misspecification where the assumed parametric statistical clock model vastly differs from the true distribution. Notably, existing methods tend to assume rigid, often unimodal rate distributions. A second challenge is that the likelihood function involves an integral over the continuous domain of the rates and often leads to difficult non-convex optimization problems. To tackle these two challenges, we propose a new method called Molecular Dating using Categorical-models (MD-Cat). MD-Cat uses a categorical model of rates inspired by non-parametric statistics and can approximate a large family of models by discretizing the rate distribution into k categories. Under this model, we can use the Expectation-Maximization (EM) algorithm to co-estimate rate categories and branch lengths time units. Our model has fewer assumptions about the true clock model than parametric models such as Gamma or LogNormal distribution. Our results on two simulated and real datasets of Angiosperms and HIV and a wide selection of rate distributions show that MD-Cat is often more accurate than the alternatives, especially on datasets with nonmodal or multimodal clock models.Code availabilityThe MD-Cat software is available athttps://github.com/uym2/MD-Cat.Data availabilityData are available on Githubhttps://github.com/uym2/MD-Cat-paperand Dryadhttps://doi.org/10.5061/dryad.pk0p2ngs0.",
        "link": "http://dx.doi.org/10.1101/2022.10.06.511147"
    },
    {
        "id": 1139,
        "title": "Expectation Maximization Clustering",
        "authors": "Xin Jin, Jiawei Han",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_344"
    },
    {
        "id": 1140,
        "title": "EXTENDED EXPECTATION MAXIMIZATION FOR UNDER-FITTED MODELS",
        "authors": "Aref Miri Rekavandi, ABD-KRIM SEGHOUANE, Farid Boussaid, Mohammed Bennamoun",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In this paper, we generalize the well-known Expectation Maximization (EM) algorithm using the α− divergence for Gaussian Mixture Model (GMM). This approach is used in robust subspace detection when the number of parameters is kept small to avoid overfitting and large estimation variances. The level of robustness can be tuned by the parameterα. When α→1, our method is equivalent to the standard EM approach and for α <1 the method is robust against potential outliers. Simulation results show that the method outperforms the standard EM when it comes to mismatches between noise models and their realizations. In addition, we use the proposed method to detect active brain areas using collected functional Magnetic Resonance Imaging (fMRI) data during task-related experiments.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21432027"
    },
    {
        "id": 1141,
        "title": "Naturally Constrained Online Expectation Maximization",
        "authors": "Daniela Pamplona, Antoine Manzanera",
        "published": "2021-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr48806.2021.9412474"
    },
    {
        "id": 1142,
        "title": "EXTENDED EXPECTATION MAXIMIZATION FOR UNDER-FITTED MODELS",
        "authors": "Aref Miri Rekavandi, ABD-KRIM SEGHOUANE, Farid Boussaid, Mohammed Bennamoun",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In this paper, we generalize the well-known Expectation Maximization (EM) algorithm using the α− divergence for Gaussian Mixture Model (GMM). This approach is used in robust subspace detection when the number of parameters is kept small to avoid overfitting and large estimation variances. The level of robustness can be tuned by the parameterα. When α→1, our method is equivalent to the standard EM approach and for α <1 the method is robust against potential outliers. Simulation results show that the method outperforms the standard EM when it comes to mismatches between noise models and their realizations. In addition, we use the proposed method to detect active brain areas using collected functional Magnetic Resonance Imaging (fMRI) data during task-related experiments.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21432027.v1"
    },
    {
        "id": 1143,
        "title": "Expectation Maximization",
        "authors": "",
        "published": "2022-4-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119078166.ch10"
    },
    {
        "id": 1144,
        "title": "ESTIMASI PARAMETER REGRESI ZERO-INFLATED NEGATIVE BINOMIAL DENGAN METODE ALGORITMA EXPECTATION MAXIMIZATION (EM) (Studi Kasus: Penyakit Difteri di Jawa Barat Tahun 2016)",
        "authors": "Dimas Adi Pradana, Trianingsih Eni Lestari",
        "published": "2020-6-17",
        "citations": 0,
        "abstract": "This study aims to determine the parameter estimation method of the ZINB model with the Expectation Maximization (EM) algorithm, and also to overcome the case of overdispersion caused by excess zeros in diphtheria cases in West Java in 2016 and to know the factors that significantly influence. Based on the results of the analysis, the factors that significantly influence the number of diphtheria cases in West Java Province in 2016 for the data count are the percentage of DPT immunization (X1), the percentage of residents who have access to safe drinking water (X3) and the percentage of TPM that meet sanitary hygiene requirements (X6). Whereas for zero-inflation data is the percentage of residents who have access to decent drinking water (X3), number of puskesmas (X5) and the percentage of TPM that meet sanitary hygiene requirements (X6).",
        "link": "http://dx.doi.org/10.17977/um055v1i12020p18-26"
    },
    {
        "id": 1145,
        "title": "Data clustering with improved expectation maximization for multiomics data integration",
        "authors": "Joseph Pateras, Musaddiq Lodi, Pratip Rana, Preetam Ghosh",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>For studying cancer biology, multiomics data integration has become an invaluable tool. With the amount of -omics data, its availability and the pace of its acquisition increasing rapidly, multiomics data integration is even more pivotal. This work employs a novel adaptation of the expectation maximization routine for joint latent variable modeling of multiomics patient profiles. Along with traditional methods of biological feature selection, the data-centric approach toward latent distribution optimization can adequately cluster patients from well-studied cancer types and does so with lower computational expense. Crucially, this work modifies the optimization subroutines in the relatively standard joint latent variable -omics workflow for improved survival analysis and run-time performance. This work also provides a framework that identifies distinctions between cancer subtypes and proposes potential biomarkers for breast cancer.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24526672"
    },
    {
        "id": 1146,
        "title": "PENERAPAN ALGORITMA EXPECTATION-MAXIMIZATION (EM) DALAM MENGELOMPOKKAN POPULARITAS OBJEK WISATA DI MALANG RAYA BERDASARKAN INDIKATOR BANYAK PENGUNJUNG",
        "authors": "Nur Atikah, Swasono Rahardjo, Trianingsih Eni Lestari, Lucky Tri Oktoviana",
        "published": "2021-6-11",
        "citations": 0,
        "abstract": "The Malang Raya Area is one of the tourist destinations in East Java..Batu City is an area of Malang Raya which is visited by many for sightseeing. Given the development of tourism in Malang Raya, it is necessary to classify the popularity of tourist objects so that they can be used as a reference in policymaking by the tourism office and tourism object managers. In this study, the Expectation Maximation (EM) algorithm is used to determine the clustering of tourist objects in Malang Raya using data on the number of visitors. The results of grouping the popularity of leading tourist attractions in Malang Raya based on the number of visitors are divided into 5 groups, namely: Group 1: Selecta; Group 2: Balekambang, Wendit Baths, and Brawijaya Souvenir Tour; Group 3: Transport Museum, Coban Rondo, Animal Museum, Jatim Park, BNS, Picking Apples “Makmur Abadi and Agro Wonosari Tea Plantation; Group 4: Kusuma Agro Wisata, Kampoeng Kidz, Cangar Hot Springs, Eco Green Park, Predator Fun Park, Coban Rais Tourism Area, Mount Banyak, Mahajaya T-Shirt & Souvenirs, Ngliyep and Selorejo Dam; Group 5: “Dammadhipa Arama” Temple, “Kaliwatu” Rafting, Batu Rafting, Coban Talun Tourism Wana, Tirta Nirwana Baths, Songgoriti Natural Hot Springs, Wonderland Waterpark, Friends of Water Rafting, Independent Apple Picking, Apple Agro Stone, Tourism Village.",
        "link": "http://dx.doi.org/10.17977/um055v2i22021p14-20"
    },
    {
        "id": 1147,
        "title": "Estimated Missing Data on Multiple Linear Regression Using Algorithm EM (Expectation-Maximization) for Prediction Revenue Company",
        "authors": "Samsul Pahmi, Nunik Destria Arianti, Imam Fahrudin, Ana Zanatun Amalia, Erdi Ardiansyah, Sarah Rahman",
        "published": "2018-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icced.2018.00025"
    },
    {
        "id": 1148,
        "title": "SEM: sized-based expectation maximization for characterizing nucleosome positions and subtypes",
        "authors": "Jianyu Yang, Kuangyu Yen, Shaun Mahony",
        "published": "No Date",
        "citations": 0,
        "abstract": "ABSTRACTGenome-wide nucleosome profiles are predominantly characterized using MNase-seq, which involves extensive MNase digestion and size selection to enrich for mono-nucleosome-sized fragments. Most available MNase-seq analysis packages assume that nucleosomes uniformly protect 147bp DNA fragments. However, some nucleosomes with atypical histone or chemical compositions protect shorter lengths of DNA. The rigid assumptions imposed by current nucleosome analysis packages ignore variation in nucleosome lengths, potentially blinding investigators to regulatory roles played by atypical nucleosomes.To enable the characterization of different nucleosome types from MNase-seq data, we introduce the Size-based Expectation Maximization (SEM) nucleosome calling package. SEM employs a hierarchical Gaussian mixture model to estimate the positions and subtype identity of nucleosomes from MNase-seq fragments. Nucleosome subtypes are automatically identified based on the distribution of protected DNA fragment lengths at nucleosome positions. Benchmark analysis indicates that SEM is on par with existing packages in terms of standard nucleosome-calling accuracy metrics, while uniquely providing the ability to characterize nucleosome subtype identities.Using SEM on a low-dose MNase H2B MNase-ChIP-seq dataset from mouse embryonic stem cells, we identified three nucleosome types: short-fragment nucleosomes, canonical nucleosomes, and dinucleosomes. The short-fragment nucleosomes can be divided further into two subtypes based on their chromatin accessibility. Interestingly, the subset of short-fragment nucleosomes in accessible regions exhibit high MNase sensitivity and display distribution patterns around transcription start sites (TSSs) and CTCF peaks, similar to the previously reported “fragile nucleosomes”. These SEM-defined accessible short-fragment nucleosomes are found not just in promoters, but also in enhancers and other regulatory regions. Additional investigations reveal their co-localization with the chromatin remodelers Chd6, Chd8, and Ep400.In summary, SEM provides an effective platform for distinguishing various nucleosome subtypes, paving the way for future exploration of non-standard nucleosomes.",
        "link": "http://dx.doi.org/10.1101/2023.10.17.562727"
    },
    {
        "id": 1149,
        "title": "Data clustering with improved expectation maximization for multiomics data integration",
        "authors": "Joseph Pateras, Musaddiq Lodi, Pratip Rana, Preetam Ghosh",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>For studying cancer biology, multiomics data integration has become an invaluable tool. With the amount of -omics data, its availability and the pace of its acquisition increasing rapidly, multiomics data integration is even more pivotal. This work employs a novel adaptation of the expectation maximization routine for joint latent variable modeling of multiomics patient profiles. Along with traditional methods of biological feature selection, the data-centric approach toward latent distribution optimization can adequately cluster patients from well-studied cancer types and does so with lower computational expense. Crucially, this work modifies the optimization subroutines in the relatively standard joint latent variable -omics workflow for improved survival analysis and run-time performance. This work also provides a framework that identifies distinctions between cancer subtypes and proposes potential biomarkers for breast cancer.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24526672.v1"
    },
    {
        "id": 1150,
        "title": "God's algorithm: The expectation-maximization algorithm",
        "authors": "Jun Wu",
        "published": "2018-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315169491-26"
    },
    {
        "id": 1151,
        "title": "Expectation maximization algorithm over Fourier series (EMoFS)",
        "authors": "Mürsel Yildiz",
        "published": "2022-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2021.108453"
    },
    {
        "id": 1152,
        "title": "SMOTE Using Border-points and Expectation-maximization Algorithm for Imbalanced Data Classification",
        "authors": "Kang Hyuck Lee, Kang Hoon Lee, Taehoon Ko",
        "published": "2021-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7232/jkiie.2021.47.3.232"
    },
    {
        "id": 1153,
        "title": "Expectation Maximization Clustering",
        "authors": "Xin Jin, Jiawei Han",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7502-7_344-2"
    },
    {
        "id": 1154,
        "title": "Expectation Maximization",
        "authors": "Di Jiang, Chen Zhang, Yuanfeng Song",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2431-8_4"
    },
    {
        "id": 1155,
        "title": "Estimation of the Probability of Informed Trading Models Via an Expectation-Conditional Maximization Algorithm",
        "authors": "Montasser Ghachem, Oguz Ersan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4386172"
    },
    {
        "id": 1156,
        "title": "Applying expectation-maximization evaluation on approximate optimal control",
        "authors": "Songtao Zhang, Rickey Dubay",
        "published": "2018-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/syscon.2018.8369536"
    },
    {
        "id": 1157,
        "title": "Advertisement Recommendations Using Expectation Maximization",
        "authors": "K. R. Venugopal, Sejal Santosh Nimbhorkar",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-2513-1_9"
    },
    {
        "id": 1158,
        "title": "Speech Enhancement Using Deep Mixture of Experts Based on Hard Expectation Maximization",
        "authors": "Pavan Karjol, Prasanta Kumar Ghosh",
        "published": "2018-9-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2018-1730"
    },
    {
        "id": 1159,
        "title": "Estimation of crane load parameters during tracking using expectation-maximization",
        "authors": "Torstein A. Myhre, Olav Egeland",
        "published": "2017-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc.2017.7963658"
    },
    {
        "id": 1160,
        "title": "An Efficient Clustering Algorithm Based on Expectation Maximization Algorithm in Wireless Sensor Network",
        "authors": "",
        "published": "2018-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15242/dirpub.dir1017011"
    },
    {
        "id": 1161,
        "title": "Direct localization of emitters based on expectation-maximization technique",
        "authors": "Minqiu Chen, Xingpeng Mao, Chunlei Zhao",
        "published": "2018-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/radar.2018.8378654"
    },
    {
        "id": 1162,
        "title": "Semi-Supervised Contrastive Outlier Removal for Pseudo Expectation Maximization (Scope)",
        "authors": "Sumeet Menon, David Chapman",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4146348"
    },
    {
        "id": 1163,
        "title": "Unsupervised Radio Scene Analysis Using Neural Expectation Maximization",
        "authors": "Hao Chen, Seung-Jun Kim",
        "published": "2022-11-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/milcom55135.2022.10017594"
    },
    {
        "id": 1164,
        "title": "Do expectation-maximization algorithms have to make use of ‘background distribution’ for de novo motif search?",
        "authors": "Bannikov Artyom Vladimirovich",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nSequence motif search remains an important problem in molecular biology. Many current tools for motif search utilize the expectation –maximization algorithm. Commonly, the algorithm assumes that a sub-sequence is produced by either the background distribution or the motif distribution. Likelihoods of having been sampled from the two distributions are computed for a sub-sequence. The ratio of the likelihoods is the subsequence score. Is background really needed? Definition of motif does not require background. Thus, the existence of background is hypothetical information that can lead the search astray. This work shows that the expectation-maximization algorithm does not have to utilize the background distribution to be practical. The relation between the number of logL minima and the number of sequences is exponential. Nevertheless, the time to find the constant fraction of motifs depends on the number of sequences linearly. Thus, relatively large sequence sets can be analyzed by the EM without the introduction of background.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1725972/v2"
    },
    {
        "id": 1165,
        "title": "Automated Phase-Type Distribution Fitting via Expectation-Maximization",
        "authors": "Marco Mialaret, Paulo Pereira, Antônio Sá Barreto, Thiago Pinheiro, Paulo Maciel",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn numerous practical domains such as reliability and performance engineering, finance, healthcare, and supply chain management, a common and formidable challenge revolves around the accurate modeling of intricate time-based data and event durations. The inherent complexities inherent to real-world systems often render the effective application of conventional statistical distributions a formidable task. Phase-type (PH) distributions emerge as a remarkably adaptable class of distributions ideally suited for modeling scenarios like failure times or response times, thanks to their Markovian representation. These distributions find utility in both analytical and simulation-driven approaches for system evaluation , and they are frequently employed to approximate empirical datasets. This paper introduces an approach that leverages user-friendly tools, graphical adjustment features, and integration with existing tools to streamline the process of fitting PH distributions to empirical data. Simplifying this procedure empowers domain experts to more accurately model complex systems, resulting in enhanced decision-making, more efficient resource allocation, improved reliability assessments, and optimized system performance across an extensive spectrum of practical domains where the analysis of time-based data remains pivotal. Furthermore, this study presents a method for the automated determination of parameters within a fitted Hyper-Erlang distribution. This method utilizes the Bayesian Information Criterion (BIC) within a Bayesian optimization framework integrated into an Expectation-Maximization (EM) algorithm. Consequently , it enables the derivation of the probability density function (pdf) for a given dataset through a combination of Hyper-Erlang distributions. Subsequently, this pdf serves as a critical tool for the assessment of system performance.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3426084/v1"
    },
    {
        "id": 1166,
        "title": "Expectation-Maximization for Adaptive Mixture Models in Graph Optimization",
        "authors": "Tim Pfeifer, Peter Protzel",
        "published": "2019-5",
        "citations": 32,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8793601"
    },
    {
        "id": 1167,
        "title": "Expectation–Maximization (EM) Clustering as a Preprocessing Method for Clinical Pathway Mining",
        "authors": "Shusaku Tsumoto, Tomohiro Kimura, Shoji Hirano",
        "published": "2022-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12626-021-00100-w"
    },
    {
        "id": 1168,
        "title": "Anfis Learning Using Expectation Maximization Based Gaussian Mixture Model and Multilayer Perceptron Learning",
        "authors": "Sadaf Jabeen, mubasher Baig, Mian Muhammad Awais",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4363461"
    },
    {
        "id": 1169,
        "title": "Do expectation-maximization algorithms have to make use of ‘background distribution’ for de novo motif search?",
        "authors": "Bannikov Artyom Vladimirovich",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nSequence motif search remains an important problem in molecular biology. Many current tools for motif search utilize the expectation –maximization algorithm. Commonly, the algorithm assumes that a sub-sequence is produced by either the background distribution or the motif distribution. Likelihoods of having been sampled from the two distributions are computed for a sub-sequence. The ratio of the likelihoods is the subsequence score. Is background really needed? Definition of motif does not require background. Thus, the existence of background is hypothetical information that can lead the search astray. This work shows that the expectation-maximization algorithm does not have to utilize the background distribution to be practical. The relation between the number of logL minima and the number of sequences is exponential. Nevertheless, the time to find the constant fraction of motifs depends on the number of sequences linearly. Thus, relatively large sequence sets can be analyzed by the EM without the introduction of background.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1725972/v1"
    },
    {
        "id": 1170,
        "title": "Soft Labeling and Expectation-Maximization Algorithm to the Learning Problem of Uncertain Labeling in Vehicular Networks",
        "authors": "Bechir ALAYA, Lamaa Sellami",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe supervised and semi-supervised learning framework does not always correspond to the situations encountered in vehicular networks. The labeling work is therefore often laborious and expensive. This is why the development of solutions to deal with imperfect labels was of particular interest to us during this research article. We introduce in this paper the formulation of the classification problem when the information available on the labels of the examples used for learning is imperfect. We also present an efficient way to solve classification problems, even when some of the labels provided to learn the classification function are wrong. Furthermore, we present our work on the extension of statistical learning methods in the environment of vehicular networks. To build an expectation-maximization (EM) algorithm capable of optimizing the marginal log-likelihood of the observed data, the path we will take follows the classic approach encountered in the probabilistic framework. Different experiments were carried out to analyze the behavior of our algorithm when “soft” labels in vehicles are used. These experiences have allowed us in particular to highlight the contribution of \"soft\" labels in this context to represent information on the reliability of the labels and thus significantly improve the performance of vehicular networks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2566124/v1"
    },
    {
        "id": 1171,
        "title": "A Recursive Expectation-Maximization Algorithm for Online Multi-Microphone Noise Reduction",
        "authors": "Ofer Schwartz, Sharon Gannot",
        "published": "2018-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco.2018.8553094"
    },
    {
        "id": 1172,
        "title": "Detection of cooperatively bound transcription factor pairs using ChIP-seq peak intensities and expectation maximization",
        "authors": "Vishaka Datta, Rahul Siddharthan, Sandeep Krishna",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractTranscription factors (TFs) often work cooperatively, where the binding of one TF to DNA enhances the binding affinity of a second TF to a nearby location. Such cooperative binding is important for activating gene expression from promoters and enhancers in both prokaryotic and eukaryotic cells. Existing methods to detect cooperative binding of a TF pair rely on analyzing the sequence that is bound. We propose a method that uses, instead, only ChIP-seq peak intensities and an expectation maximization (CPI-EM) algorithm. We validate our method using ChIP-seq data from cells where one of a pair of TFs under consideration has been genetically knocked out. Our algorithm relies on our observation that cooperative TF-TF binding is correlated with weak binding of one of the TFs, which we demonstrate in a variety of cell types, includingE. coli, S. cerevisiaeandM. musculuscells. We show that this method performs significantly better than a predictor based only on the ChIP-seq peak distance of the TFs under consideration. This suggests that peak intensities contain information that can help detect the cooperative binding of a TF pair. CPI-EM also outperforms an existing sequence-based algorithm in detecting cooperative binding. The CPI-EM algorithm is available athttps://github.com/vishakad/cpi-em.",
        "link": "http://dx.doi.org/10.1101/120113"
    },
    {
        "id": 1173,
        "title": "Constrained Expectation-Maximization Methods for Effective Reinforcement Learning",
        "authors": "Gang Chen, Yiming Peng, Mengjie Zhang",
        "published": "2018-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8488990"
    },
    {
        "id": 1174,
        "title": "MAXIMUM LIKELIHOOD ESTIMATION USING EXPECTATION MAXIMIZATION APPLIED TO AMBIENT DOSE EQUIVALENT MEASUREMENTS",
        "authors": "Néstor Cornejo Díaz",
        "published": "2018-5-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/rpd/ncy064"
    },
    {
        "id": 1175,
        "title": "An Overview of Expectation Maximization and K-Means family Clustering Algorithms in Data Mining Applications",
        "authors": "",
        "published": "2018-1-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15242/dirpub.dir1017002"
    },
    {
        "id": 1176,
        "title": "Fitting Gamma Mixture Density Networks with Expectation-Maximization Algorithm",
        "authors": "Lukasz Delong, Mathias Lindholm, Mario V. Wuthrich",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3705225"
    },
    {
        "id": 1177,
        "title": "Convergence of the Expectation-Maximization Algorithm Through Discrete-Time Lyapunov Stability Theory",
        "authors": "Orlando Romero, Sarthak Chatterjee, Sergio Pequito",
        "published": "2019-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc.2019.8814665"
    },
    {
        "id": 1178,
        "title": "Total variation regularized expectation maximization reconstruction improves 68Ga-FAPI-04 PET/CT image quality as compared to ordered subset expectation maximization reconstruction",
        "authors": "Hanxiang LIU, Lin LIU, Shijie XU, Zhonglin LU, Greta S. MOK, Yingwei WANG, Yi TAO, Yue CHEN",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23736/s1824-4785.22.03409-4"
    },
    {
        "id": 1179,
        "title": "Expectation-maximization algorithm for direct position determination",
        "authors": "Elad Tzoreff, Anthony J. Weiss",
        "published": "2017-4",
        "citations": 58,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2016.10.015"
    },
    {
        "id": 1180,
        "title": "Blind Decoding-Metric Estimation for Probabilistic Shaping via Expectation Maximization",
        "authors": "Fabian Steiner, Patrick Schulte, Georg Bocherer",
        "published": "2018-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecoc.2018.8535375"
    },
    {
        "id": 1181,
        "title": "Slow Expectation-Maximization Convergence in Low-Noise Dynamic Factor Models",
        "authors": "Daan Opschoor, Dick J.C. van Dijk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4408065"
    },
    {
        "id": 1182,
        "title": "Probabilistic Record Linkage (PRL) advances between Surveillance Data and HES datasets using the Expectation-Maximization (EM) algorithm",
        "authors": "Nikolaos Panagiotopoulos, Mehdi Minaji, Richard Pebody",
        "published": "2017-4-19",
        "citations": 0,
        "abstract": "ABSTRACT\r\nObjectivesThis study shows how to improve PRL when using a limited number of personal identifiable information (PIIs) available in HES such as NHS number, DOB, Hospital Number, Gender and Postcode. The focus is on new approaches in categorisation of m-u probabilities for fields related to Postcode. In addition, a brief outline of our procedure to generate an appropriate training dataset will be presented as well as reasons for splitting HES dataset into single and multi-admissions, and proposed techniques to avoid computational cost.\r\nApproachPIIs such as DOB and Postcode can be categorised in order to increase the number of potential comparison vectors which is necessary in order to deal with the multi-million size of the HES dataset. We propose a multinomial approach for comparison between postcodes both for agreement and disagreement case scenarios, based on geographical information and a similarity score resulting from a Probit model. In the absence of a ‘gold-standard’ dataset, generating an appropriate training set is possible by combining two-way Deterministic Linkage (DL) and simple random sampling. Splitting HES into single and multi-admissions is recommended for reasons related to computational performance and demographic differences of the underlying population. Selection of the lower and upper thresholds regarding linkage weights can be done in a practical way by using conditional Normal mixture modelling, or more formally by using sampling techniques based on Fellegi-Sunter decision rule. We show how the latter can be further improved avoiding the computational cost by introducing appropriate mapping functions.\r\nResultsWe show the advantages of PRL over DL between Surveillance Laboratory Flu Data and HES. Preliminary results indicate an additional 10% of matches for < 1% expected false positives. EM convergence problems when treating missing values as separate outcome category will be discussed comparing results with the suggested re-normalisation approach in the bibliography.\r\nConclusionPRL between Laboratory Surveillance Data and Hospital Episode Statistics (HES) is a common practice and performed in a number of epidemiological studies conducted at Public Health England (PHE). Therefore, improving linkage will subsequently benefit those studies. Furthermore, this study proposes new approaches for Postcode comparison, and the utilisation of mapping functions to avoid the computational cost of the Fellegi-Sunter decision rule. These approaches could be used in a wide range of applications. Finally, we suggest a structural way of handling the HES dataset in order to achieve high efficiency and robustness of linkage.",
        "link": "http://dx.doi.org/10.23889/ijpds.v1i1.371"
    },
    {
        "id": 1183,
        "title": "Breast Tumour Detection by using New Expectation Maximization Algorithm",
        "authors": "V Nagi Reddy, P Subba Rao",
        "published": "2020-12-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciss49785.2020.9316034"
    },
    {
        "id": 1184,
        "title": "Joint User Activity and Data Detection for NOMA via the Integrated Framework of Expectation Maximization and Expectation Propagation",
        "authors": "Lei Zhang, Xiangming Meng, Lei Wang, Yan Chen",
        "published": "2019-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/spawc.2019.8815561"
    },
    {
        "id": 1185,
        "title": "Expectation maximization based logistic regression for breast cancer classification",
        "authors": "Harikumar Rajaguru, Sunil Kumar Prabhakar",
        "published": "2017-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca.2017.8203608"
    },
    {
        "id": 1186,
        "title": "Carrier Phase Synchronization in Burst-Type CPM by Means of Expectation Maximization",
        "authors": "Andreas Lang, Berthold Lankl",
        "published": "2019-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vtcfall.2019.8891263"
    },
    {
        "id": 1187,
        "title": "A Generalization of the Maximum Likelihood Expectation Maximization (MLEM) Method: Masked-MLEM",
        "authors": "Yifan Zheng, Emily Frame, Javier Caravaca, Grant Gullberg, Kai Vetter, Youngho Seo",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In our previous work on image reconstruction for single-layer collimatorless scintigraphy, the min-min weighted robust least squares (WRLS) optimization algorithm was proposed to address a general reconstruction problem in which both the system matrix and the projection data are uncertain. Whereas the WRLS algorithm has been successful in two-dimensional (2D) reconstruction, expanding this algorithm to three-dimensional (3D) reconstruction is difficult. To solve the WRLS optimization problem for more robust image reconstruction, we propose a generalized iterative method based on the maximum likelihood expectation maximization (MLEM) algorithm, hereinafter referred to as the Masked-MLEM algorithm. In the Masked-MLEM algorithm, only selected subsets (``masks'') in the system matrix and the projection will contribute to the image update in order to satisfy the constraints on the system uncertainties. We validate the Masked-MLEM algorithm and compare it to the standard MLEM algorithm using data from both collimated and uncollimated imaging instruments, including parallel-hole collimated SPECT, 2D collimatorless scintigraphy, and 3D collimatorless tomography. The results show that in SPECT imaging the Masked-MLEM and standard MLEM reconstructions are similar, and in collimatorless imaging, the Masked-MLEM algorithm outperforms the standard MLEM algorithm. A good choice of system uncertainty can make the Masked-MLEM reconstruction more robust than the standard MLEM reconstruction in both collimated and uncollimated imaging. Furthermore, the computation time of each Masked-MLEM iteration is comparable to that in the standard MLEM algorithm. Although, the memory consumption of the Masked-MLEM algorithm is higher due to the storage of the system matrix uncertainties.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21985577.v1"
    },
    {
        "id": 1188,
        "title": "A Generalization of the Maximum Likelihood Expectation Maximization (MLEM) Method: Masked-MLEM",
        "authors": "Yifan Zheng, Emily Frame, Javier Caravaca, Grant Gullberg, Kai Vetter, Youngho Seo",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In our previous work on image reconstruction for single-layer collimatorless scintigraphy, we introduced the min-min weighted robust least squares (WRLS) optimization algorithm to address the challenge of reconstructing images when both the system matrix and the projection data are uncertain. Whereas the WRLS algorithm has been successful in two-dimensional (2D) reconstruction, expanding it to three-dimensional (3D) reconstruction is difficult since the WRLS optimization problem is neither smooth nor strongly-convex. To overcome these difficulties and achieve robust image reconstruction in the presence of system uncertainties and projection noise, we propose a generalized iterative method based on the maximum likelihood expectation maximization (MLEM) algorithm, hereinafter referred to as the Masked-MLEM algorithm. In the Masked-MLEM algorithm, only selected subsets (``masks'') in the system matrix and the projection contribute to the image update to satisfy the constraints imposed by the system uncertainties. We validate the Masked-MLEM algorithm and compare it to the standard MLEM algorithm using data from both collimated and uncollimated imaging instruments, including parallel-hole collimated SPECT, 2D collimatorless scintigraphy, and 3D collimatorless tomography. The results show that the Masked-MLEM and standard MLEM reconstructions are similar in SPECT imaging, while the Masked-MLEM algorithm outperforms the standard MLEM algorithm in collimatorless imaging. A good choice of system uncertainty can make the Masked-MLEM reconstruction more robust than the standard MLEM reconstruction, effectively reducing the likelihood of reconstructing higher activities in regions without radioactive sources.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21985577"
    },
    {
        "id": 1189,
        "title": "Maximum Likelihood recursive state estimation using the Expectation Maximization algorithm",
        "authors": "Mohammad S. Ramadan, Robert R. Bitmead",
        "published": "2022-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.automatica.2022.110482"
    },
    {
        "id": 1190,
        "title": "Expectation-Maximization Algorithm",
        "authors": "Jaya Sreevalsan-Nair",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-26050-7_103-1"
    },
    {
        "id": 1191,
        "title": "Computationally efficient application of Sequential Monte Carlo expectation maximization to confined single particle tracking",
        "authors": "Ye Lin, Sean B. Andersson",
        "published": "2021-6-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/ecc54610.2021.9655194"
    },
    {
        "id": 1192,
        "title": "Expectation-Maximization Algorithm",
        "authors": "Jaya Sreevalsan-Nair",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-85040-1_103"
    },
    {
        "id": 1193,
        "title": "A Generalization of the Maximum Likelihood Expectation Maximization (MLEM) Method: Masked-MLEM",
        "authors": "Yifan Zheng, Emily Frame, Javier Caravaca, Grant Gullberg, Kai Vetter, Youngho Seo",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In our previous work on image reconstruction for single-layer collimatorless scintigraphy, we introduced the min-min weighted robust least squares (WRLS) optimization algorithm to address the challenge of reconstructing images when both the system matrix and the projection data are uncertain. Whereas the WRLS algorithm has been successful in two-dimensional (2D) reconstruction, expanding it to three-dimensional (3D) reconstruction is difficult since the WRLS optimization problem is neither smooth nor strongly-convex. To overcome these difficulties and achieve robust image reconstruction in the presence of system uncertainties and projection noise, we propose a generalized iterative method based on the maximum likelihood expectation maximization (MLEM) algorithm, hereinafter referred to as the Masked-MLEM algorithm. In the Masked-MLEM algorithm, only selected subsets (``masks'') in the system matrix and the projection contribute to the image update to satisfy the constraints imposed by the system uncertainties. We validate the Masked-MLEM algorithm and compare it to the standard MLEM algorithm using data from both collimated and uncollimated imaging instruments, including parallel-hole collimated SPECT, 2D collimatorless scintigraphy, and 3D collimatorless tomography. The results show that the Masked-MLEM and standard MLEM reconstructions are similar in SPECT imaging, while the Masked-MLEM algorithm outperforms the standard MLEM algorithm in collimatorless imaging. A good choice of system uncertainty can make the Masked-MLEM reconstruction more robust than the standard MLEM reconstruction, effectively reducing the likelihood of reconstructing higher activities in regions without radioactive sources.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21985577.v2"
    },
    {
        "id": 1194,
        "title": "A Stochastic Expectation-Maximization Approach to Shuffled Linear Regression",
        "authors": "Abubakar Abid, James Zou",
        "published": "2018-10",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/allerton.2018.8635907"
    },
    {
        "id": 1195,
        "title": "An Online Expectation-Maximization Algorithm for Tracking Acoustic Sources in Multi-Microphone Devices During Music Playback",
        "authors": "Daniele Giacobello",
        "published": "2018-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco.2018.8553331"
    },
    {
        "id": 1196,
        "title": "Classification of Gasoline Samples using Variable Reduction and Expectation-Maximization Methods",
        "authors": "Nikos Pasadakis, Andreas A. Kardamakis",
        "published": "2019-5-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429070655-104"
    },
    {
        "id": 1197,
        "title": "ON THE BEHAVIOR OF THE EXPECTATION-MAXIMIZATION ALGORITHM FOR MIXTURE MODELS",
        "authors": "Babak Barazandeh, Meisam Razaviyayn",
        "published": "2018-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/globalsip.2018.8646506"
    },
    {
        "id": 1198,
        "title": "Selecting Reviewers for Research by Clustering Proposals Using Expectation Maximization Clustering Algorithm",
        "authors": "S. Rajkamal",
        "published": "2017-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictacc.2017.24"
    },
    {
        "id": 1199,
        "title": "Dynamic Expectation Maximization Algorithm for Estimation of Linear Systems with Colored Noise",
        "authors": "Ajith Anil Meera, Martijn Wisse",
        "published": "2021-10-5",
        "citations": 14,
        "abstract": "The free energy principle from neuroscience has recently gained traction as one of the most prominent brain theories that can emulate the brain’s perception and action in a bio-inspired manner. This renders the theory with the potential to hold the key for general artificial intelligence. Leveraging this potential, this paper aims to bridge the gap between neuroscience and robotics by reformulating an FEP-based inference scheme—Dynamic Expectation Maximization—into an algorithm that can perform simultaneous state, input, parameter, and noise hyperparameter estimation of any stable linear state space system subjected to colored noises. The resulting estimator was proved to be of the form of an augmented coupled linear estimator. Using this mathematical formulation, we proved that the estimation steps have theoretical guarantees of convergence. The algorithm was rigorously tested in simulation on a wide variety of linear systems with colored noises. The paper concludes by demonstrating the superior performance of DEM for parameter estimation under colored noise in simulation, when compared to the state-of-the-art estimators like Sub Space method, Prediction Error Minimization (PEM), and Expectation Maximization (EM) algorithm. These results contribute to the applicability of DEM as a robust learning algorithm for safe robotic applications.",
        "link": "http://dx.doi.org/10.3390/e23101306"
    },
    {
        "id": 1200,
        "title": "Improving expectation maximization algorithm over stellar data",
        "authors": "Hasan Kurban, Can Kockan, Mark Jenne, Mehmet M. Dalkilic",
        "published": "2017-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata.2017.8258215"
    }
]