[
    {
        "id": 16071,
        "title": "A hybrid cancer prediction based on multi-omics data and reinforcement learning state action reward state action (SARSA)",
        "authors": "Mazin Abed Mohammed, Abdullah Lakhan, Karrar Hameed Abdulkareem, Begoña Garcia-Zapirain",
        "published": "2023-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.106617"
    },
    {
        "id": 16072,
        "title": "Currency Investment Strategy Based on State-Action-Reward-State-Action",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajbm.2022.040417"
    },
    {
        "id": 16073,
        "title": "A comparison of eligibility trace and momentum on SARSA in continuous state-and action-space",
        "authors": "Barry D. Nichols",
        "published": "2017-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ceec.2017.8101599"
    },
    {
        "id": 16074,
        "title": "Self-Adaptive Constrained Multi-Objective Differential Evolution Algorithm Based on the State–Action–Reward–State–Action Method",
        "authors": "Qingqing Liu, Caixia Cui, Qinqin Fan",
        "published": "2022-3-3",
        "citations": 7,
        "abstract": "The performance of constrained multi-objective differential evolution algorithms (CMOEAs) is mainly determined by constraint handling techniques (CHTs) and their generation strategies. To realize the adaptive adjustment of CHTs and generation strategies, an adaptive constrained multi-objective differential evolution algorithm based on the state–action–reward–state–action (SARSA) approach (ACMODE) is introduced in the current study. In the proposed algorithm, the suitable CHT and the appropriate generation strategy can be automatically selected via a SARSA method. The performance of the proposed algorithm is compared with four other famous CMOEAs on five test suites. Experimental results show that the overall performance of the ACMODE is the best among all competitors, and the proposed algorithm is capable of selecting an appropriate CHT and a suitable generation strategy to solve a particular type of constrained multi-objective optimization problems.",
        "link": "http://dx.doi.org/10.3390/math10050813"
    },
    {
        "id": 16075,
        "title": "Intelligent Scheduling Based on Reinforcement Learning Approaches: Applying Advanced Q-Learning and State–Action–Reward–State–Action Reinforcement Learning Models for the Optimisation of Job Shop Scheduling Problems",
        "authors": "Atefeh Momenikorbekandi, Maysam Abbod",
        "published": "2023-11-23",
        "citations": 1,
        "abstract": "Flexible job shop scheduling problems (FJSPs) have attracted significant research interest because they can considerably increase production efficiency in terms of energy, cost and time; they are considered the main part of the manufacturing systems which frequently need to be resolved to manage the variations in production requirements. In this study, novel reinforcement learning (RL) models, including advanced Q-learning (QRL) and RL-based state–action–reward–state–action (SARSA) models, are proposed to enhance the scheduling performance of FJSPs, in order to reduce the total makespan. To more accurately depict the problem realities, two categories of simulated single-machine job shops and multi-machine job shops, as well as the scheduling of a furnace model, are used to compare the learning impact and performance of the novel RL models to other algorithms. FJSPs are challenging to resolve and are considered non-deterministic polynomial-time hardness (NP-hard) problems. Numerous algorithms have been used previously to solve FJSPs. However, because their key parameters cannot be effectively changed dynamically throughout the computation process, the effectiveness and quality of the solutions fail to meet production standards. Consequently, in this research, developed RL models are presented. The efficacy and benefits of the suggested SARSA method for solving FJSPs are shown by extensive computer testing and comparisons. As a result, this can be a competitive algorithm for FJSPs.",
        "link": "http://dx.doi.org/10.3390/electronics12234752"
    },
    {
        "id": 16076,
        "title": "Combining Information-Seeking Exploration and Reward Maximization: Unified Inference on Continuous State and Action Spaces Under Partial Observability",
        "authors": "Parvin Malekzadeh, Kostas Plataniotis",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4229967"
    },
    {
        "id": 16077,
        "title": "Computational mechanisms of human state-action-reward contingency learning under perceptual uncertainty",
        "authors": "Dirk Ostwald, Rasmus Bruckner, Hauke Heekeren",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32470/ccn.2018.1078-0"
    },
    {
        "id": 16078,
        "title": "State Action Doctrine",
        "authors": "Jaggi Stephan",
        "published": "2017-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/law-mpeccol/e473.013.473"
    },
    {
        "id": 16079,
        "title": "State Action and Constitutional Containment",
        "authors": "Jud Mathews",
        "published": "2018-4-19",
        "citations": 0,
        "abstract": "This chapter explores the U.S. Supreme Court’s use of, and departures from, the state action rule. It begins by reconstructing the state action rule’s origins in the Civil Rights Cases. From the late nineteenth century onward, the state action rule served as a constitutional containment device, bolstering the Court’s monopoly over constitutional interpretation and eliminating uncomfortable questions about what rights meant for the ordering of American society. A changing political context and the emergence of new normative demands in the twentieth century put this regime under pressure, which the Court managed through a series of strategic evasions of the state action rule, even while pledging fealty to it.",
        "link": "http://dx.doi.org/10.1093/oso/9780190682910.003.0005"
    },
    {
        "id": 16080,
        "title": "The State and\n                              Voluntary Action",
        "authors": "William Beveridge",
        "published": "2021-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003101635-11"
    },
    {
        "id": 16081,
        "title": "World State-dependent Action Graph: A Representation of Action Possibility and Its Variations in Real Space based on World State",
        "authors": "Yosuke Kawasaki, Masaki Takahashi",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011298000003271"
    },
    {
        "id": 16082,
        "title": "State Intervention in Collective Action",
        "authors": "Calla Hummel",
        "published": "2021-11-15",
        "citations": 0,
        "abstract": "Chapter 2 develops a theory of state intervention in collective action. It argues that as unorganized people create negative externalities, officials increasingly have an incentive to encourage people who organize self-regulating organizations. When officials intervene with cash, licenses, and access to the bureaucracy, they lower the barriers that kept people from organizing on their own. Once informal workers take these incentives and start organizations, officials can bargain over regulation and enforcement with representatives instead of a mass of individuals. The theory builds on contributions from Olson (1965), Ostrom (1990), and Holland (2017). The theory is formalized in a game theoretic model to show that officials and informal workers are strategically linked. The chapter uses the model to demonstrate the exact conditions under which we can expect informal workers’ organizations as a result of officials’ encouragement. The model produces multiple equilibria that reflect the different levels of organization that we observe in informal sectors around the world. The equilibrium conditions generate clear expectations for the patterns that we should see in the empirical chapters if the theory is correct.",
        "link": "http://dx.doi.org/10.1093/oso/9780192847812.003.0002"
    },
    {
        "id": 16083,
        "title": "Adolescent dopamine neurons represent reward differently during action and state guided learning",
        "authors": "Aqilah M. McCane, Meredyth A. Wegener, Mojdeh Faraji, Maria T. Rivera Garcia, Kathryn Wallin-Miller, Vincent D. Costa, Bita Moghaddam",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThe neuronal underpinning of learning cause-and-effect associations in the adolescent brain remains poorly understood. Two fundamental forms of associative learning are Pavlovian (classical) conditioning, where a stimulus is followed by an outcome, and operant (instrumental) conditioning, where outcome is contingent on action execution. Both forms of learning, when associated with a rewarding outcome, rely on midbrain dopamine neurons in the ventral tegmental area (VTA) and substantia nigra (SN). We find that in adolescent male rats, reward-guided associative learning is encoded differently by midbrain dopamine neurons in each conditioning paradigm. Whereas simultaneously recorded VTA and SN adult neurons have a similar phasic response to reward delivery during both forms of conditioning, adolescent neurons display a muted reward response during operant but a profoundly larger reward response during Pavlovian conditioning suggesting that adolescent neurons assign a different value to reward when it is not gated by action. The learning rate of adolescents and adults during both forms of conditioning was similar further supporting the notion that differences in reward response in each paradigm are due to differences in motivation and independent of state versus action value learning. Static characteristics of dopamine neurons such as dopamine cell number and size were similar in the VTA and SN but there were age differences in baseline firing rate, stimulated release and correlated spike activity suggesting that differences in reward responsiveness by adolescent dopamine neurons are not due to differences in intrinsic properties of these neurons but engagement of different networks.",
        "link": "http://dx.doi.org/10.1101/2021.07.05.451195"
    },
    {
        "id": 16084,
        "title": "State Action in Action: The Charter’s Application in Criminal Investigations",
        "authors": "Steven Penney",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4473871"
    },
    {
        "id": 16085,
        "title": "Increasing immunisation in Ogun State, Nigeria: a formative evaluation of a participatory action research intervention",
        "authors": "",
        "published": "2019-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23846/tw10fe04"
    },
    {
        "id": 16086,
        "title": "Reasons for State Action",
        "authors": "Nicholas Hatzis",
        "published": "2021-5-6",
        "citations": 0,
        "abstract": "The claim that the government ought to prohibit offensive speech is a form of practical reasoning. It tells us what an agent has reason to do under certain circumstances. The first part of the chapter explores in more detail the structure of that claim and the underlying idea that respect for religious feelings is a value which is realized when insults are censored. The second part explores the types of reasons which can be legitimately invoked to justify the exercise of state coercion. We expect restrictions of liberty to be based on reasons which all citizens can be expected to accept, regardless of their own view about what kind of life is worth living (i.e. a public reason requirement). The fact that an act is incompatible with the teachings of a religion is never an adequate reason for its prohibition. After discussing different versions of public reason theory, I suggest that even those which allow for some reliance on religious justifications cannot support the use of coercion against speakers who hurt their listeners’ religious feelings.",
        "link": "http://dx.doi.org/10.1093/oso/9780198758440.003.0003"
    },
    {
        "id": 16087,
        "title": "Business-State Interactions",
        "authors": "William D. Ferguson",
        "published": "2020-5-5",
        "citations": 0,
        "abstract": "This chapter extends Chapter 8’s political settlement framework by addressing business-state interactions operating within specific types of settlements. Three levels of interaction follow. At the macro level, political settlements shape such interactions. At an intermediate (meso) level, market configurations—that is, their degrees of competitiveness and domestic versus export orientation—affect the demands businesses place on the state. These dynamics influence the accessibility (openness) of micro-level exchange agreements (deals) as well as their credibility—specifically, the degree to which they are ordered, meaning honored and predictable, or disordered. A shift from disordered to ordered deals reflects resolution of second-order CAPs of enforcing agreements. Such a shift can prompt growth accelerations that facilitate escaping poverty traps. More substantial development, however, requires addressing Chapter 4’s complex coordination CAPs.",
        "link": "http://dx.doi.org/10.11126/stanford/9781503604612.003.0010"
    },
    {
        "id": 16088,
        "title": "“On the State as a Kind of Action”",
        "authors": "Oliver Feltham",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5771/9783845275840-169"
    },
    {
        "id": 16089,
        "title": "Semantics and Algebra for Action Logic Monitoring State Transitions",
        "authors": "Susumu Yamasaki",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006345901100115"
    },
    {
        "id": 16090,
        "title": "State Action",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781509967643.ch-002"
    },
    {
        "id": 16091,
        "title": "Efficient Data Offloading Using Markovian Decision on State Reward Action in Edge Computing",
        "authors": "Mingye Li, Haiwei Lei, Huan Guo, Riza Sulaiman, Wejdan Deebani, Meshal Shutaywi",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10723-023-09659-w"
    },
    {
        "id": 16092,
        "title": "Community Action and Civic Dialogue",
        "authors": "Barry Quirk",
        "published": "2019-2-27",
        "citations": 0,
        "abstract": "This chapter, by one of the most experienced local authority chief executives in the UK, looks at how communities can be genuinely empowered through civic dialogues to improve their quality of life. It reviews the approach that supports community action by systematically discussing options with local people, involving them in setting priorities, and enabling them to take control of defined resources and specific public buildings as community assets. Lessons are drawn from initiatives and the experiences of diverse communities, that show that success is only possible with a more participatory and deliberative approach from central and local government. Criticisms are directed at the formulaic and passive arrangements that characterise many existing attempts at community empowerment. The chapter concludes by arguing that, notwithstanding economies of scale and the benefits of standardisation, the design and delivery of services can achieve much more through well-planned community engagement.",
        "link": "http://dx.doi.org/10.1332/policypress/9781529200980.003.0008"
    },
    {
        "id": 16093,
        "title": "The Chomsky Approach: Considering the Limits on State Action",
        "authors": "Robert F. Barsky",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5771/9783748923770-211"
    },
    {
        "id": 16094,
        "title": "Public action, castes, and the state",
        "authors": "Jagpal Singh",
        "published": "2020-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429343063-7"
    },
    {
        "id": 16095,
        "title": "The State and the\n                              Friendly Societies",
        "authors": "William Beveridge",
        "published": "2021-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003101635-2"
    },
    {
        "id": 16096,
        "title": "Epigraph",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0010"
    },
    {
        "id": 16097,
        "title": "The Theories Limiting State Action",
        "authors": "J. D. Mabbott",
        "published": "2021-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003222774-8"
    },
    {
        "id": 16098,
        "title": "Social Action",
        "authors": "Elliott Currie",
        "published": "2020-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003060581-25"
    },
    {
        "id": 16099,
        "title": "Dedication",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0004"
    },
    {
        "id": 16100,
        "title": "Northern Kenya",
        "authors": "Fletcher D. Cox",
        "published": "2019-12-5",
        "citations": 1,
        "abstract": "Chapter 4 presents a critical microlevel case study of civil action in an underanalyzed conflict in Northern Kenya—the Samburu-Turkana Range War. Evidence from the case indicates that civil and uncivil actions co-evolve and coexist. Community-based organizations (CBOs) and traditional authorities effectively use civic action to interrupt violence escalation. At the same time, civic action does not fully eliminate violence, but rather changes the qualities of it. Civil action provides platforms for the coordination of inter- and intragroup relationships, which helps to dampen the frequency of violence and the speed of escalation but also raises the cost of violence. It allows local armed groups to become better armed, better organized, and more capable of accessing detailed, covert information through local relational networks. Violence occurs less often and escalates less rapidly, but when it does occur, it is deadlier. Under conditions of state fragility, civil action plays an unintentional role in increasing militia mobilization and prolonging protracted conflict.",
        "link": "http://dx.doi.org/10.1093/oso/9780190056896.003.0004"
    },
    {
        "id": 16101,
        "title": "Sustainable Development and Participatory Action Research: A Systematic Review",
        "authors": "Jennifer Keahey",
        "published": "2021-6",
        "citations": 33,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11213-020-09535-8"
    },
    {
        "id": 16102,
        "title": "Ethical Reward and Punishment",
        "authors": "Peter Winch",
        "published": "2020-7-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003051138-11"
    },
    {
        "id": 16103,
        "title": "To Сalculation of Shock Vibration Suppressors of Unilateral Action",
        "authors": "G.A. Timofeev,  , I.E. Lyuminarskiy, S.E. Lyuminarskiy,  ,  ",
        "published": "2019-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18698/0236-3941-2019-1-90-100"
    },
    {
        "id": 16104,
        "title": "“Boots on the ground” state-building: Using Action Research to improve local governance in Afghanistan",
        "authors": "Richard Ledet, Pete Turner",
        "published": "2021-9",
        "citations": 1,
        "abstract": " This paper explains how the authors applied Action Research during Operation Enduring Freedom in the course of U.S. Department of Defense operations intended to improve local governance in Afghanistan. Serving as civilian field researchers in 2011–2012, we were tasked, in part, with observing how informal custom and authority interacted with the functioning of local government. Assisted greatly by Action Research’s participatory nature, we were able to systematically develop a crucial relationship with an influential government official in a rural area. The partnership that resulted ultimately led to the implementation of planning procedures that were well suited to meet the needs of the district and more transparent to the Government of the Islamic Republic of Afghanistan and entities working with the U.S. Department of Defense. We argue that adopting and training for Action Research would increase the probability of success for current and future “non-lethal” U.S. Department of Defense activities. ",
        "link": "http://dx.doi.org/10.1177/1476750319859643"
    },
    {
        "id": 16105,
        "title": "Misgivings about Affirmative Action",
        "authors": "",
        "published": "2024-5-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/jj.6380585.8"
    },
    {
        "id": 16106,
        "title": "Voluntary action in the ‘welfare state’: the National Council for the Unmarried Mother and Her Child",
        "authors": "Pat Thane",
        "published": "2017-3-28",
        "citations": 0,
        "abstract": "As state involvement in the provision of social and medical welfare grew during the twentieth-century, it was often seen as antagonistic to the work of voluntary associations which had pioneered many different types of welfare provision. Pat Thane argues that such assumptions are a false dichotomy and develops a case study of the National Council for the Unmarried Mother and Her Child (NCUM), founded in 1918, as a means through which to assess the changing landscape of twentieth-century social welfare and the relationship between voluntary action and public sector welfare. The work of organizations like the NCUM actually intensified with the growth of state welfare provision from the inter-war years onwards; a pattern which was duplicated across the welfare sector more generally Thane contests political arguments that the ‘big society’ should replace the supposed ‘stranglehold’ of state welfare by highlighting the extent to which the historical relationship between voluntary associations and the state has actually been creative and mutually sustaining.",
        "link": "http://dx.doi.org/10.7228/manchester/9780719090356.003.0007"
    },
    {
        "id": 16107,
        "title": "Copyright Page",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0003"
    },
    {
        "id": 16108,
        "title": "Applying blockchain for climate action in agriculture: state of play and outlook",
        "authors": "",
        "published": "2021-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4060/cb3495en"
    },
    {
        "id": 16109,
        "title": "SURROGATE SAFEGUARDS IN ACTION",
        "authors": "",
        "published": "2020-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv2jfvcb2.8"
    },
    {
        "id": 16110,
        "title": "How Are States Driving Climate Action in India? Evaluating the Performance of State-Driven Domestic Climate Action",
        "authors": "Shruti Nagbhushan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3331853"
    },
    {
        "id": 16111,
        "title": "A State Action May Be Nasty But Is Not Likely to Be a Crime",
        "authors": "Ira Sharkansky",
        "published": "2017-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315080376-2"
    },
    {
        "id": 16112,
        "title": "Reward modulates cortical representations of action",
        "authors": "Tyler J. Adkins, Taraz G. Lee",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractPeople are capable of rapid on-line improvements in performance when they are offered a reward. The neural mechanism by which this performance enhancement occurs remains unclear. We investigated this phenomenon by offering monetary reward to human participants, contingent on successful performance in a sequence production task. We found that people performed actions more quickly and accurately when they were offered large rewards. Increasing reward magnitude was associated with elevated activity throughout the brain prior to movement. Multivariate patterns of activity in these reward-responsive regions encoded information about the upcoming action. Follow-up analyses provided evidence that action decoding in pre-SMA and other motor planning areas was improved for large reward trials and successful action decoding was associated with improved performance. These results suggest that reward may enhance performance by enhancing neural representations of action used in motor planning.HighlightsReward enhances behavioral performance.Reward enhances action decoding in motor planning areas prior to movement.Enhanced action decoding coincides with improved behavioral performance.",
        "link": "http://dx.doi.org/10.1101/2020.01.15.907006"
    },
    {
        "id": 16113,
        "title": "Dimensionality Reduction for State-action Pair Prediction based on Tendency of State and Action",
        "authors": "Masashi Sugimoto,  ",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17781/p002307"
    },
    {
        "id": 16114,
        "title": "Is the State the Community?",
        "authors": "George E. G. Catlin",
        "published": "2021-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003139911-8"
    },
    {
        "id": 16115,
        "title": "State Action in Financial Times",
        "authors": "Cornelia Woll",
        "published": "2017-2-23",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198793373.003.0010"
    },
    {
        "id": 16116,
        "title": "Designing the User",
        "authors": "Galo Canizares,  ",
        "published": "2019",
        "citations": 0,
        "abstract": "This paper puts forth a set of criteria for analyzing users. Putting aside the techno-positivism pervading traditional user-centered design, the questions asked here prioritize a narrative approach focusing on conflicts, absurd scenarios, and weird collaborations between software and users. Designing the user thus could be seen as an exercise in creati ng problems as much as solving them.",
        "link": "http://dx.doi.org/10.35483/acsa.fall.19.1"
    },
    {
        "id": 16117,
        "title": "List of Figures",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0007"
    },
    {
        "id": 16118,
        "title": "List of Boxes",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0009"
    },
    {
        "id": 16119,
        "title": "Dollar Diplomacy as Inconspicuous Action",
        "authors": "",
        "published": "2017-4-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781316591260.006"
    },
    {
        "id": 16120,
        "title": "Climate Toolkit: A Resource Manual for Science and Action",
        "authors": "Frank Granshaw,  ",
        "published": "2020-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15760/pdxopen-27"
    },
    {
        "id": 16121,
        "title": "What Did it Cost?",
        "authors": "Ashley Bigham,  ",
        "published": "2019",
        "citations": 0,
        "abstract": "Over drinks and hors d’oeuvres at the 107th Annual ACSA conference in Pittsburgh, an interesting conversation emerged among several young faculty members who teach at different public institutions. While reflecting on presentations of design projects each had seen earlier in the day, a common recurring question emerged: “What did it cost?” While each presentation had beautifully articulated the formal, aesthetic or material ambitions of its project, very few mentioned how much the projects had cost. Actually, none did.",
        "link": "http://dx.doi.org/10.35483/acsa.fall.19.7"
    },
    {
        "id": 16122,
        "title": "T.H. Green and State Action: Liquor Legislation*",
        "authors": "Peter P. Nicholson",
        "published": "2017-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351148245-18"
    },
    {
        "id": 16123,
        "title": "The State",
        "authors": "Bill Jordan",
        "published": "2022-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003307136-11"
    },
    {
        "id": 16124,
        "title": "List of Tables",
        "authors": "",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.002.0008"
    },
    {
        "id": 16125,
        "title": "Managing Contentious Collective Action",
        "authors": "Calla Hummel",
        "published": "2021-11-15",
        "citations": 0,
        "abstract": "Chapter 5 develops an ethnography of street vendors, their organizations, and the city officials who they interact with in the city of La Paz, Bolivia. The chapter is based on 14 months of ethnographic fieldwork in the city over four research trips in 2012, 2014 to 2015, 2018, and 2019 as well as administrative data on 31,906 street vending licenses in the city. Fieldwork included interviews, participant observation at dozens of meetings between bureaucrats and organized vendors, ride-alongs with the Municipal Guard, a street vendor survey, working as a street vendor in a clothing market, and selling wedding services with a street vendor cooperative. The theory’s observable implications are illustrated with ethnographic evidence, survey results, and license data from La Paz. I discuss how street vending has changed in the city and how officials have intervened in collective action decisions as the informal sector grew. The chapter demonstrates that officials increased benefits to organized vendors as the costs of regulating markets increased. Additionally, the leaders that take advantage of these offers tend to have more resources than their colleagues, and as the offers increased, so did the level of organization among the city’s street vendors. The chapter also discusses the many trade-offs that officials make in implementing different policies, and how officials manage the often combative organizations that they encourage.",
        "link": "http://dx.doi.org/10.1093/oso/9780192847812.003.0005"
    },
    {
        "id": 16126,
        "title": "The big stuck in state capability",
        "authors": "Matt Andrews, Lant Pritchett, Michael Woolcock",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "Abstract\nMany developing countries and organizations within them are mired in a “big stuck,” or what we will call a “capability trap”: they cannot perform the tasks asked of them, and doing the same thing day after day is not improving the situation; indeed, it is usually only making things worse. We offer examples of this in the current chapter and use empirics to show that most governments seem especially prone to continued failure, even after decades of efforts to build state capability. We argue that this (and other) evidence suggests the need for deep reflection on past efforts to build state capability, and perhaps even dramatic changes to the way this is done in the future. This discussion lays a foundation for the rest of the book, which offers a diagnosis of the causes of “capability traps” in development and a strategy to escape such traps, using problem-driven iterative adaptation (PDIA).",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.003.0002"
    },
    {
        "id": 16127,
        "title": "Delivering Australian vocational qualifications through action learning",
        "authors": "Robert Cother, Genevieve Cother",
        "published": "2017-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14767333.2017.1358317"
    },
    {
        "id": 16128,
        "title": "The climate regime after Paris: an opportunity for regional leadership beyond the State?",
        "authors": "Ana Dias, Sandrina Antunes",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "AbstractIn the fast-changing landscape of global climate governance, a more polycentric climate regime was recognized with the Paris Agreement. Given the possibility for non-state actors to become agents of change, this paper observes that dynamics of climate leadership are also being defined by regional governments in federal or decentralized systems. Regional governments do so by actively engaging in Paris’ climate efforts by using their self-governing capacities to set their own internal and external climate strategies that may anticipate, bypass, or surpass state action. Although studies have explored leadership dynamics in polycentric structures, the field of climate leadership lacks conceptual and empirical research on regional climate action. Relying on the literature of polycentric governance and climate leadership, our paper (1) articulates the research gap on the phenomenon of regional climate leadership beyond the state and (2) suggests a revised perspective on climate leadership applied to federal or decentralized contexts.",
        "link": "http://dx.doi.org/10.1038/s44168-023-00092-z"
    },
    {
        "id": 16129,
        "title": "StARformer: Transformer with State-Action-Reward Representations for Robot Learning",
        "authors": "Jinghuan Shang, Xiang Li, Kumara Kahatapitiya, Yu-Cheol Lee, Michael S. Ryoo",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tpami.2022.3204708"
    },
    {
        "id": 16130,
        "title": "Building state capability at scale through groups",
        "authors": "Matt Andrews, Lant Pritchett, Michael Woolcock",
        "published": "2017-1-12",
        "citations": 0,
        "abstract": "Abstract\nHow does a policy entrepreneur find a new solution and scale it up when dealing with complexity? This is the subject we address here, which outlines a new way of thinking about scale and sustainability in respect of complex challenges and then focuses on the importance of building broad agency solutions to ensure multidimensional scaling and dynamic sustainability. The idea of multidimensional scaling (or 4-D scaling) reflects various ways in which policymakers could see progress in solving complex problems. The idea of dynamic sustainability suggests an adaptive way of thinking about sustainability (where improvements are made, consolidated, and improved upon; reflecting a progressive and adaptive expansion in capability—rather than the achievement of some apparent premature medium-term end point). We discuss ways to achieve such scaling and sustainability through broad agency, and close by reflecting on the importance of “you” (the reader) using such ideas to rethink how you work.",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.003.0011"
    },
    {
        "id": 16131,
        "title": "Utilitarianism as a Criterion for State Action",
        "authors": "Nicolaus Tideman, Florenz Plassmann",
        "published": "2019-2-28",
        "citations": 0,
        "abstract": "As a criterion for state action, utilitarianism faces the difficulty that it permits the expectations of some to be overridden for the benefit of others. Neither Bentham’s felicific calculus nor the related cost-benefit analysis can justify the coercion needed for state action. Social welfare functions, including those that incorporate Rawls’s difference principle, face the same difficulty as utilitarianism. One way of resolving this problem is to move to a constitutional framework of constrained utilitarianism, under which only policies that violate no one’s reasonable expectations are considered. To ensure that no one will have a reasonable basis for objecting, there must be a Tieboutian opportunity for dissenters to form their own polities.",
        "link": "http://dx.doi.org/10.1093/oxfordhb/9780190469733.013.39"
    },
    {
        "id": 16132,
        "title": "Action-State Orientation",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781483386874.n8"
    },
    {
        "id": 16133,
        "title": "Local Action For Animals As A Stepping Stone To State Protections",
        "authors": " Faunalytics, Precious Hose",
        "published": "No Date",
        "citations": 0,
        "abstract": "Legislation is a key avenue animal advocates use to effect change at scale, but there is not much research about how to choose tractable issues and lobby for them successfully. In this project we reviewed the legal literature for evidence of local action having an influence at higher levels of government.",
        "link": "http://dx.doi.org/10.31234/osf.io/fueak"
    },
    {
        "id": 16134,
        "title": "State and Local Officials Push for Continued Climate Action",
        "authors": "Randy Showstack",
        "published": "2017-6-28",
        "citations": 0,
        "abstract": "Governors, mayors, citizen groups, and others are moving ahead with regional and smaller-scale efforts to counteract climate change in the wake of the U.S. decision to pull out of the Paris climate agreement.",
        "link": "http://dx.doi.org/10.1029/2017eo076997"
    },
    {
        "id": 16135,
        "title": "Obama’s Executive Action on Immigration",
        "authors": "",
        "published": "2017-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315135168-5"
    },
    {
        "id": 16136,
        "title": "Family Math Night K-5",
        "authors": "Jennifer Taylor-Cox",
        "published": "2017-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315690162"
    },
    {
        "id": 16137,
        "title": "9 Business-State Interactions",
        "authors": "",
        "published": "2020-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781503611979-012"
    },
    {
        "id": 16138,
        "title": "Humanitarian action",
        "authors": "Elisabeth Dallas, Tyler Beckelman",
        "published": "2020-8-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4337/9781788971645.00028"
    },
    {
        "id": 16139,
        "title": "Business Action Learning Tasmania (BALT) – an account of practice",
        "authors": "Genevieve Cother, Robert F. Cother",
        "published": "2017-5-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14767333.2017.1310688"
    },
    {
        "id": 16140,
        "title": "Against a nation state of emergency: how climate emergency politics can undermine climate justice",
        "authors": "Natalie Osborne, Anna Carlson",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "AbstractIn recent years, eco-activist groups, academics, industry groups, governments, and other organisations have called for, or declared, a climate emergency. These declarations offer discursive and political consent for emergency climate actions. Without refuting the urgent need to take meaningful action to limit and adapt to climate change, in this paper we argue emergency declarations can have effects that may ultimately work against climate justice. To do this, we contextualise climate injustice as part of a much longer history of colonial racial capitalism, and suggest that discourses and declarations of emergency often serve as tools through which the political conditions and histories that shape and sustain injustices, including environmental and climate injustices, are erased. Working from the present conjuncture and the aftermath of the ‘crisis’ responses to the COVID-19 pandemic, we show how discourses of emergency and crisis serve as tools through which the coercive and controlling powers of the state are sustained, maintained, and legitimised. Reading across a vast history of crisis colonialism, we show how emergency measures enable the expansion, consolidation, and militarisation of colonial settler states, linking existing anticolonial critiques with ideas of disaster capitalism and fossil fascism to offer a cautionary intervention into movements for climate action that persist with logics and discourses of emergency and crisis. We warn that declarations of emergency are not only ineffective tools in the pursuit of climate justice, but may be actively dangerous.",
        "link": "http://dx.doi.org/10.1038/s44168-023-00087-w"
    },
    {
        "id": 16141,
        "title": "Social Engagement and  Non-State Action",
        "authors": "Eduardo Gonçalves Gresse",
        "published": "2022-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003128816-8"
    },
    {
        "id": 16142,
        "title": "Businesses of the State and Climate Action",
        "authors": " ",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1596/978-1-4648-1998-8_ch5"
    },
    {
        "id": 16143,
        "title": "Church-State Tensions Turn into Conflict",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv36tpk36.16"
    },
    {
        "id": 16144,
        "title": "The Risk Of Repeal: Examining The Use Of State-Action Immunity For Hospital Mergers",
        "authors": "",
        "published": "2021-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1377/forefront.20210806.481073"
    },
    {
        "id": 16145,
        "title": "State (In)action and Feminist Resistance to the Denial of Abortion Rights in Northern Ireland",
        "authors": "Maev McDaid, Brian Christopher Nelis",
        "published": "2022-11-17",
        "citations": 0,
        "abstract": "This chapter explores how reproductive rights were denied in both the legal jurisdictions after partition in Ireland and how the state institutions stonewalled legislation. It examines how ‘biopower’ of the Church reached into almost all aspects of life and was thoroughly gendered and served as a disciplining force for the working class. It explores how activists confronted the inaction of the state(s), forcing bodily autonomy onto the legislative agenda. Through a range of methods, many with a focus on personal testimony, campaigns served to neutralize the grip of Church and state institutions. These had previously monopolized debate through narratives of ‘deviance’ and ‘shame’. While abortion was legalized in the south of Ireland and decriminalized in the north of Ireland, the denial of access in many areas remains. At a time when access to abortion is being threatened globally it is clear that only sustained confrontation with the state will secure provision of comprehensive reproductive healthcare services.",
        "link": "http://dx.doi.org/10.1332/policypress/9781529207286.003.0003"
    },
    {
        "id": 16146,
        "title": "Public reason, legitimate state action, and justifiability to all",
        "authors": "Richard Rowland",
        "published": "2020-11-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429491375-9"
    },
    {
        "id": 16147,
        "title": "THE FUNCTIONALIST’S INNER STATE",
        "authors": "",
        "published": "2022-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv2d6jsmj.4"
    },
    {
        "id": 16148,
        "title": "Strike Action And The Academic Performance Of Students In Benue State University, Makurdi, Nigeria",
        "authors": "Emmanuella Gbaa",
        "published": "No Date",
        "citations": 0,
        "abstract": "\n\nAbstract\n\n\n\nThis study was conducted to assess the effects of strike action and the academic performance of students in Benue State University, Makurdi. The study adapted a descriptive design with a sample size of 400 respondents. Six research questions were raised from six purposes which leads to the formulation of three null hypotheses to guide the investigation. The instrument for data collection was the questionnaire which was crafted to suit the purpose of the study and it was administered to the undergraduate and Post-Graduate students. Data collected were analyzed using simple percentages and frequencies as well as mean and standard deviation in answering research questions. χ \n                    2-test was used to test null hypotheses 1, 2 and 3 at 0.05 alpha level of significance. Findings showed that majority of respondents agreed with all the items with regards to students’ perception about strike action carried out by ASUU, strike actions influence students’ CGPA as well as overall academic performance of the students, there is significance relationship between students reading habits and academic activities due to ASUU strike among other influences. Based on the findings of the study, it was established that Government education polices and the associated inactions and the strike embarked upon by members of the Academic Staff Union of Universities (ASUU) have contributed to the poor academic performance of the university students in Nigeria. It was recommended that the avoidable conflict between the government and ASUU must not be allowed to jeopardize the academics and future of Nigerian students, Education in Nigeria must be given its pride of place; the government must strive hard to meet the United Nation’s minimum standard. Nigerian Universities cannot be locked up permanently and government must take moves that will nip this problem of strike permanently into the bud so as to create a conducive learning environment for our students.",
        "link": "http://dx.doi.org/10.14293/s2199-1006.1.sor-.ppf7u5x.v1"
    },
    {
        "id": 16149,
        "title": "State Governments Take Action",
        "authors": "Sanford Gottlieb",
        "published": "2018-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429501081-10"
    },
    {
        "id": 16150,
        "title": "Building State Capability",
        "authors": "Matt Andrews, Lant Pritchett, Michael Woolcock",
        "published": "2017-1-12",
        "citations": 180,
        "abstract": "Abstract\nGovernments play a major role in the development process, and constantly introduce reforms and policies to achieve developmental objectives. Many of these interventions have limited impact, however; schools get built but kids don’t learn, IT systems are introduced but not used, plans are written but not implemented. These achievement deficiencies reveal gaps in capabilities, and weaknesses in the process of building state capability. This book addresses these weaknesses and gaps. It starts by providing evidence of the capability shortfalls that currently exist in many countries, showing that many governments lack basic capacities even after decades of reforms and capacity-building efforts. The book then analyzes this evidence, identifying capability traps that hold many governments back—particularly related to isomorphic mimicry (where governments copy best practice solutions from other countries that make them look more capable even if they are not more capable) and premature load bearing (where governments adopt new mechanisms that they cannot actually make work, given weak extant capacities). The book then describes a process that governments can use to escape these capability traps. Called PDIA (problem-driven iterative adaptation), this process empowers people working in governments to find and fit solutions to the problems they face. The discussion about this process is structured in a practical manner so that readers can actually apply tools and ideas to the capability challenges they face in their own contexts. These applications will help readers devise policies and reforms that have more impact than those of the past.",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.001.0001"
    },
    {
        "id": 16151,
        "title": "Implementation: State Action",
        "authors": "David G. Smith, Judith D. Moore",
        "published": "2017-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351295802-11"
    },
    {
        "id": 16152,
        "title": "Umma and the nation-state: dilemmas in refuge ethics",
        "authors": "Hossameldeen Mohammed, Ray Jureidini",
        "published": "2022-12",
        "citations": 1,
        "abstract": "AbstractThis article addresses the question of the Muslim umma (the universal community of Muslims) which arises within the context of the ongoing debates about the status of refugees and their rights around the world, especially in the Muslim world, where a significant majority of migrants and refugees originate and are hosted. We question the existence of the Muslim umma under contemporary circumstances and discuss the extent to which the modern nation-state has undermined the principles of Muslim unity and solidarity beyond national borders. We also examine how Islamic ethics and law (fiqh) identify the imperatives of providing comfort and protection for refugees (whether they are Muslim or non-Muslim) individuals, groups, and communities when required or requested. We see this in principle, but not always in practice. Are refugee policies applied by Muslim-majority countries today in accordance with the fundamental Islamic teachings and experiences of the original hijra? Or have such principles been made redundant by the political-geographic imperatives of ethnicized nation-states? To what extent can applied policies in Muslim-majority countries be developed and enhanced in the light of umma principles that might alleviate the longstanding refugee crises in this troubled area of the world?The article consists of three main sections. The first provides a theoretical and religious analysis of the idea of the umma as an inclusive entity that encompasses all Muslims, contrasted with the modern nation-state as an exclusive geographically defined political institution. The second looks at three Muslim-majority countries that played a significant hosting role in refugee crises over the past decade, namely Jordan, Bangladesh, and Turkey. We offer some insight in understanding to what extent their policies or behavior were based upon ummatic principles, or secularist notions of national interest and humanitarian aid? The last section summarizes the recent innovation providing for Muslim refugees through a UNHCR arrangement and adaptation with the Islamic charitable obligation of Zakat. It is suggested that the UNHCR Zakat Fund is an ummatic manifestation that has already proved honorable and viable. The conclusion calls for a better understanding of the umma as it is in the Islamic consciousness towards an effective reforming of refugee policies and practices, suggesting a further enhancement of ummatic institutional collaboration between the OIC and UNHCR for refugee integration.",
        "link": "http://dx.doi.org/10.1186/s41018-022-00124-z"
    },
    {
        "id": 16153,
        "title": "The National Transparency Registers in Action",
        "authors": "K. Lillerud",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21552/estal/2019/3/4"
    },
    {
        "id": 16154,
        "title": "Looking like a state",
        "authors": "Matt Andrews, Lant Pritchett, Michael Woolcock",
        "published": "2017-1-12",
        "citations": 4,
        "abstract": "Abstract\nIn this chapter we argue that isomorphic mimicry is a key “technique of successful failure” that perpetuates capability traps in development. In the context of this study, isomorphic mimicry is the tendency of governments to mimic other governments’ successes, replicating processes, systems, and even products of the “best practice” examples. This mimicry often conflates form and function: leading to a situation where “looks like” substitutes for “does”; i.e., governments look capable after the mimicry but are not actually more capable. We argue that this is endemic in development and has become a primary reason why countries do not build real capability even after years of policy and reform engagement and billions of dollars of capacity building work. We suggest that the tendency to so mimic is amplified by the current development ecosystem, especially where public sectors have become closed to novelty but open (and supportive of) agenda conformity. Such characteristics make it very hard for states to build the new capabilities needed, for their contexts, given their realities.",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.003.0003"
    },
    {
        "id": 16155,
        "title": "The challenge of building (real) state capability for implementation",
        "authors": "Matt Andrews, Lant Pritchett, Michael Woolcock",
        "published": "2017-1-12",
        "citations": 2,
        "abstract": "Abstract\nEfforts to build state capability often involve highly designed, best-practice solutions that have worked in some places and are expected to work everywhere. These sometimes work, especially when the treatment addresses problems in the policy context. Where problems are different, however, the treatment is isomorphic mimicry—it looks good but will not solve festering problems. Development organizations often ignore this, however, and offer the same solution repeatedly—hoping for different outcomes but imposing a capability trap on the policy context, which needs a new diagnosis and prescription. In some countries the treatment has a worse impact, fostering premature load bearing—where the context cannot handle what is prescribed. How can development experts identify where they will have such negative impacts, and where they need to do development differently? This chapter addresses such question, and introduces an approach to building state capability in the latter contexts, called problem-driven iterative adaptation.",
        "link": "http://dx.doi.org/10.1093/acprof:oso/9780198747482.003.0007"
    },
    {
        "id": 16156,
        "title": "The Oprichnina in Action",
        "authors": "",
        "published": "2019-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvpbnqkd.20"
    },
    {
        "id": 16157,
        "title": "State Action and the Constitution's Middle Band",
        "authors": "Louis Michael Seidman",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.2962076"
    },
    {
        "id": 16158,
        "title": "State Action",
        "authors": "Christy V. Mitchell, Rachel Woodlee, Diane C. Seibert",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-99993-9.00008-1"
    },
    {
        "id": 16159,
        "title": "MDPs with infinite state and action spaces",
        "authors": "Eitan Altman",
        "published": "2021-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315140223-8"
    },
    {
        "id": 16160,
        "title": "Healthcare Access Barriers: State Policy Action",
        "authors": "",
        "published": "2020-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1081/e-epap3-120053579"
    },
    {
        "id": 16161,
        "title": "The Historical State, Local Collective Action, and Economic Development in Vietnam",
        "authors": "Melissa Dell, Nathaniel Lane, Pablo Querubin",
        "published": "2017-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3386/w23208"
    },
    {
        "id": 16162,
        "title": "From Municipal to Central State Action",
        "authors": "René De La Pedraja",
        "published": "2019-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429042560-10"
    },
    {
        "id": 16163,
        "title": "Performance modulations phase-locked to action depend on internal state",
        "authors": "Tommaso Tosato, Gustavo Rohenkohl, Pascal Fries",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractSeveral studies have probed perceptual performance at different times after a self-paced motor action and found frequency-specific modulations of perceptual performance phase-locked to the action. Such action-related modulation has been reported for various frequencies and modulation strengths. In an attempt to establish a basic effect at the population level, we had a relatively large number of participants (n=50) perform a self-paced button press followed by a detection task at threshold, and we applied both fixed- and random-effects tests. The combined data of all trials and participants surprisingly did not show any significant action-related modulation. However, based on previous studies, we explored the possibility that such modulation depends on the participant’s internal state. Indeed, when we split trials based on performance in neighboring trials, then trials in periods of low performance showed an action-related modulation at ≈17 Hz. When we split trials based on the performance in the preceding trial, we found that trials following a “miss” showed an action-related modulation at ≈17 Hz. Finally, when we split participants based on their false-alarm rate, we found that participants with no false alarms showed an action-related modulation at ≈17 Hz. All these effects were significant in random-effects tests, supporting an inference on the population. Together, these findings indicate that action-related modulations are not always detectable. However, the results suggest that specific internal states such as lower attentional engagement and/or higher decision criterion are characterized by a modulation in the beta-frequency range.",
        "link": "http://dx.doi.org/10.1101/2022.11.28.518242"
    },
    {
        "id": 16164,
        "title": "Family Math Night 6-8",
        "authors": "Jennifer Taylor-Cox, Christine Oberdorf",
        "published": "2018-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315513416"
    },
    {
        "id": 16165,
        "title": "THE STATE ACTION PROBLEM",
        "authors": "",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18574/nyu/9780814707449.003.0022"
    },
    {
        "id": 16166,
        "title": "Business-State Interactions",
        "authors": "",
        "published": "2020-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/jj.8305935.16"
    },
    {
        "id": 16167,
        "title": "Hierarchical Planning in Multilayered State-Action Networks",
        "authors": "Matthias Brucklacher, Hanspeter A. Mallot, Tristan Baumann",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14428/esann/2021.es2021-45"
    },
    {
        "id": 16168,
        "title": "The State and Voluntary Action",
        "authors": " Beveridge",
        "published": "2021-2-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315737300-44"
    },
    {
        "id": 16169,
        "title": "China’s central state corporatism",
        "authors": "Li Chen",
        "published": "2019-8-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429243950-12"
    },
    {
        "id": 16170,
        "title": "State and Church Relationships under the European Convention on Human Rights: A Value Framework for State Action",
        "authors": "Moncef Chaibi",
        "published": "2022-8-29",
        "citations": 1,
        "abstract": "As they impact the condition of religious groups, and in fine that of the very individuals composing them, state-church relationships are an important dimension of religious freedom. The way states interact with religious groups, communities, and associations has a decisive impact on the religious condition of their members, in their effort to develop their religious beliefs or practices. Therefore, the purpose of this article is to explore the European Court of Human Rights’ regulation of state-church relationships. The research focuses on ECtHR’s judgments issued on article 9, either autonomously or in connection with article 11 of the European Convention on Human Rights. It also considers cases adjudicated upon article 2 of Protocol I to the Convention. For optimal consistency with Europe’s social evolution, however, special attention was given to those cases issued from early 2011. The article argues that behind the margin of appreciation granted for states to enact any system they see fit, the Court puts forward limits they cannot trespass. Indeed, the systems adopted have to abide by the values underlying the Convention as a whole. The article argues said values materialize a global framework that unifies states into one European global approach, thus giving a further illustration of the oligopolistic Pluralism that the Court develops in its regulation of individual religious freedom.",
        "link": "http://dx.doi.org/10.3390/rel13090797"
    }
]