[
    {
        "id": 23505,
        "title": "The ambiguity of BERTology: what do large language models represent?",
        "authors": "Tommi Buder-Gröndahl",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "AbstractThe field of “BERTology” aims to locate linguistic representations in large language models (LLMs). These have commonly been interpreted as representing structural descriptions (SDs) familiar from theoretical linguistics, such as abstract phrase-structures. However, it is unclear how such claims should be interpreted in the first place. This paper identifies six possible readings of “linguistic representation” from philosophical and linguistic literature, concluding that none has a straight-forward application to BERTology. In philosophy, representations are typically analyzed as cognitive vehicles individuated by intentional content. This clashes with a prevalent mentalist interpretation of linguistics, which treats SDs as (narrow) properties of cognitive vehicles themselves. I further distinguish between three readings of both kinds, and discuss challenges each brings for BERTology. In particular, some readings would make it trivially false to assign representations of SDs to LLMs, while others would make it trivially true. I illustrate this with the concrete case study of structural probing: a dominant model-interpretation technique. To improve the present situation, I propose that BERTology should adopt a more “LLM-first” approach instead of relying on pre-existing linguistic theories developed for orthogonal purposes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11229-023-04435-5"
    },
    {
        "id": 23506,
        "title": "Chinese text classification by combining Chinese-BERTology-wwm and GCN",
        "authors": "Xue Xu, Yu Chang, Jianye An, Yongqiang Du",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "Text classification is an important and classic application in natural language processing (NLP). Recent studies have shown that graph neural networks (GNNs) are effective in tasks with rich structural relationships and serve as effective transductive learning approaches. Text representation learning methods based on large-scale pretraining can learn implicit but rich semantic information from text. However, few studies have comprehensively utilized the contextual semantic and structural information for Chinese text classification. Moreover, the existing GNN methods for text classification did not consider the applicability of their graph construction methods to long or short texts. In this work, we propose Chinese-BERTology-wwm-GCN, a framework that combines Chinese bidirectional encoder representations from transformers (BERT) series models with whole word masking (Chinese-BERTology-wwm) and the graph convolutional network (GCN) for Chinese text classification. When building text graph, we use documents and words as nodes to construct a heterogeneous graph for the entire corpus. Specifically, we use the term frequency-inverse document frequency (TF-IDF) to construct the word-document edge weights. For long text corpora, we propose an improved pointwise mutual information (PMI*) measure for words according to their word co-occurrence distances to represent the weights of word-word edges. For short text corpora, the co-occurrence information between words is often limited. Therefore, we utilize cosine similarity to represent the word-word edge weights. During the training stage, we effectively combine the cross-entropy and hinge losses and use them to jointly train Chinese-BERTology-wwm and GCN. Experiments show that our proposed framework significantly outperforms the baselines on three Chinese benchmark datasets and achieves good performance even with few labeled training sets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1544"
    },
    {
        "id": 23507,
        "title": "An approach of data augmentation to improve the performance of BERTology models for Vietnamese hate speech detection",
        "authors": "Son T. Luu, Kiet Van Nguyen, Ngan Luu-Thuy Nguyen",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16968-5"
    },
    {
        "id": 23508,
        "title": "Estimating the vertical direction in a photogrammetric 3D model, with application to visualization",
        "authors": "Maxime Lhuillier",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cviu.2023.103814"
    },
    {
        "id": 23509,
        "title": "Student Understanding of Basic Concepts Cost Accounting and Its Application",
        "authors": "Joan Raintung",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4329257"
    },
    {
        "id": 23510,
        "title": "Multi-stage transfer learning with BERTology-based language models for question answering system in vietnamese",
        "authors": "Kiet Van Nguyen, Phong Nguyen-Thuan Do, Nhat Duy Nguyen, Anh Gia-Tuan Nguyen, Ngan Luu-Thuy Nguyen",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13042-022-01735-z"
    },
    {
        "id": 23511,
        "title": "On the questionable utility of color space for understanding perception",
        "authors": "Mark D. Fairchild",
        "published": "2023-5",
        "citations": 1,
        "abstract": "AbstractThe concept of color space is ubiquitous in color science and technology and is applied to a wide variety of stimulus, signal, and perceptual dimensions. This Color Forum paper aims to discuss the concept of representing color in a multidimensional geometric space and whether such a concept is useful in helping us understand human color perception. The conclusion is that the concept of color space might not be of utility, but the hope is that this paper prompts further thoughts and review by others and motivates additional Color Forum papers that either provide examples of the utility of the color space concept or add further support to the idea that it might be time to look at color differently.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/col.22853"
    },
    {
        "id": 23512,
        "title": "Understanding new colors in urban environments: Deciphering colors as semiotic resources",
        "authors": "Beichen Yu",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractSince the start of the new millennium, more diverse color expressions have appeared in the design of urban environments, especially in global cities. In this article, the notion of “new colors” refers to the emergence of saturated colors and new ways of using them in urban environments globally. With the impact of globalization and the disengagement of color from local materials, existing color approaches seem to be insufficient to explain the dynamic changes in color design. To understand the emerging “new colors”, this article proposes viewing environmental color as a social semiotic resource. Adapted from Gunther Kress and Theo van Leeuwen's social semiotic model of color, a model is developed to identify and explain “grammars of color” in environmental color design. With a particular focus on urban and landscape designs completed between 2000 and 2019, five main color practices of saturated colors were identified: branding and communication, urban interventions, sports and recreation, traffic environments, and historical and post‐industrial sites. The analysis of these main color practices and semiotic resources suggests that the saturated color's role in social communication is emphasized in the urban space nowadays. Furthermore, the emergence of saturated colors and the growth of new expressions of color in the urban environment may be driven by the needs and interests of different sociocultural groups.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/col.22871"
    },
    {
        "id": 23513,
        "title": "Improving Mathematical Concept Understanding Ability of Junior High School Students with Conceptual Understanding Procedures Learning Model",
        "authors": "Savitri Wanabuliandari, Rita Aulia Rahmawati, Henry Suryo Bintoro",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Understanding concept material is the basic material for someone to solve problems. The importance of understanding concepts because it is useful in learning, thinking, reading and communicating. This study was conducted to analyze the improvement of mathematical concept understanding ability of experimental class students after using the CUPs learning model. This research was conducted in class VIII Junior high school with 30 experimental class students as research subjects. This research design uses one group ptetest-posttest design. Data collection techniques used include observation, interviews and tests. Initial data analysis used normality test, homogeneity test, and mean similarity test. Meanwhile, the final data analysis used Paired Sample T-test and N-gain test. The results showed that the mathematical concept understanding ability of experimental class students increased after using the CUPs learning model with an average N-gain value of 0.63 in the moderate category. Based on the results of the study, it can be concluded that the CUPs learning model is able to provide an increase in students' mathematical concept understanding ability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/ijeca.v6i2.16251"
    },
    {
        "id": 23514,
        "title": "The Application of Law as a Key to Understanding Judicial Independence",
        "authors": "Tahirih V. Lee",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25148/lawrev.17.1.8"
    },
    {
        "id": 23515,
        "title": "Investigation of the Understanding and Application of Musical Imagery in China University Music Students",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/appep.2023.040308"
    },
    {
        "id": 23516,
        "title": "Application Of Sumpah Pemuda Museum Learning Methods In Improving Historical Understanding",
        "authors": "Ichtiar Wilujeng Margarini",
        "published": "2023-5-27",
        "citations": 0,
        "abstract": "\r\n\r\n\r\nThe purpose of this study was to determine the increase in students' understanding of history in the national movement material through the field trip learning method. This study used a qualitative research type where the research was conducted using observation methods at the Museum Sumpah Pemuda and literature studies on several relevant sources. The results obtained are (1) the history teacher's problems in teaching history to students; (2) knowing the field trip learning method at the Museum Sumpah Pemuda; and (3) the benefits of historical learning methods to improve understanding of history.\r\nKeywords: field trips, museums, youth pledge\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.19184/jh.v7i1.39113"
    },
    {
        "id": 23517,
        "title": "A Theoretical Application for Understanding Spatial (In)Justice in Education: The Making of Spatial Injustice Audits",
        "authors": "Vanessa Pena",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2015581"
    },
    {
        "id": 23518,
        "title": "Supplemental Material for Understanding Queer Asian In/Visibility via Stereotype Application",
        "authors": "",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/aap0000334.supp"
    },
    {
        "id": 23519,
        "title": "UNDERSTANDING FINANCIAL BEHAVIOR IN GENERATION Z",
        "authors": "Aireen Jordan, Kartika Nuringsih",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "As the demographic growth, the presence of Generation Z or Gen-Z reached 27.94 percent in 2020 so that it dominates the demographic structure in Indonesia after the millennial generation. Gen-Z grows along with the development of information technology to form a new lifestyle that is more open to using the internet and social media than previous generations. These conditions affect financial behavior, so it is necessary to conduct a study to determine the effect of financial knowledge, financial attitudes, and self-efficacy on financial behavior. A total of 100 respondents were selected to represent Generation Z. The sample selection technique used purposive sampling with the criteria of being born in 2000-2004, currently pursuing a bachelor's degree and domicile in Jakarta. Testing the validity, reliability and data processing of structural regression equations using Smart-PLS 4. The results show the coefficient values of financial knowledge (0.271), financial attitude (0.273) and self-efficacy (0.262) where the three have a significant positive effect on financial behavior at the 5 percent level. The results of the study serve as a reference for the government in revising policies to improve financial literacy and investment models for Generation Z. Advice for related parties such as banking, insurance, investment institutions, financial services authority, and others to respect with Gen-Z in achieving sustainability in their welfare. The formation of this behavior has an impact on responsible consumption for Gen-Z circles so that long-term commitment and implementation will also support the achievement of sustainable development goals in 2030 to realize sustainable prosperity for future generations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijaeb.v1i4.2535-2546"
    },
    {
        "id": 23520,
        "title": "Head pose estimation with uncertainty and an application to dyadic interaction detection",
        "authors": "Federico Figari Tomenotti, Nicoletta Noceti, Francesca Odone",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cviu.2024.103999"
    },
    {
        "id": 23521,
        "title": "Understanding The Net Benefit of Using a Food Delivery Application: Post Application of Platform Fee",
        "authors": "Arta Moro Sundjaja, Andrean Wangsa",
        "published": "2023",
        "citations": 0,
        "abstract": "This research is conducted to find the factors that affect repurchase intentions in food delivery service applications. The methods used to gather data in this research are questionnaires, interviews, and literature studies, while methods used to analyze data would be the SEM-PLS using the SmartPLS 3.0 software and with the framework “The information systems success model” created by Delone and McLean. Three hundred forty-five responses from the questionnaire were tested for validity and reliability, and the results show that the research data were valid. Based on the results, it is found that some of the variables show significant and insignificant effects. The variables quality information – use of the application, service quality – user satisfaction, system quality – use of the application, system quality – user satisfaction, use of application – net benefit, use of application – user satisfaction, and user satisfaction – net benefit has a significant outcome proofing that these relations between variables have a huge effect on repurchase intention. However, on the other hand, the relationship of variables quality information – user satisfaction, and service quality – use of application does not show a significant effect on their relation between variables.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202342601022"
    },
    {
        "id": 23522,
        "title": "A new scale of mathematical problem complexity and its application to understanding fear of mathematics",
        "authors": "Abhyuday Pandey, Mohan Pandey",
        "published": "2023",
        "citations": 0,
        "abstract": "Fear of mathematics appears to be a global phenomenon. However, it has primarily been studied in isolation despite mathematics being part of a school curriculum with multiple subjects. We reason that the relative difficulty of mathematics compared to other subjects could be a factor behind the fear of mathematics. We explored this line of reasoning by hypothesizing that middle and high school mathematics is more complex than English literature. To enable the testing of this hypothesis, we developed scoring methods for complexity. While the English complexity score was derived from the Flesch reading ease score, we introduced a new way of measuring the complexity of mathematical problems. Using these metrics on samples for English prose and mathematical problems for grades 5 through 11, we then established that mathematical complexity is relatively high. Analysis of intergrade changes in scores showed significant changes in mathematical complexity between grades 5 and 6, and grades 6 and 7. We recommend that mathematics curricula be spread over a more extended period or that the time spent on mathematics in school be increased to address this potential factor behind the fear of mathematics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/23-089"
    },
    {
        "id": 23523,
        "title": "The application of relational theory towards a deeper understanding of emotional variables in language education",
        "authors": "Rui Zhang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e16758"
    },
    {
        "id": 23524,
        "title": "Application of Physics for Understanding the Earth’s Reverse Gravity",
        "authors": "Subhasis Sen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/gep.2023.111007"
    },
    {
        "id": 23525,
        "title": "Understanding and Application of “Necessary Measures” in the “Notice and Necessary Measures” Rule Under Cloud Service Platform Model",
        "authors": "Chen Linbin",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.ijls.20230601.12"
    },
    {
        "id": 23526,
        "title": "Application of Prakriti in Understanding the Cause and Role of Treatment in Surgical Diseases",
        "authors": " Swathi C Nair,  KM Sweta",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Prakriti can be defined as an individual's natural state, which is determined by their genetic constitution. According to Ayurveda, each person possesses a fixed Prakriti that is established at the moment of conception when the sperm and ovum unite in the womb. The predominance of one, two, or all three Doshas (Vata, Pitta, Kapha) in an individual's constitution dictates their Prakriti. As a result, Prakriti encompasses an individual genetically determined anatomical, physiological and psychological changes. It also influences how a person responds to environmental factors, medications, and their susceptibility to diseases. This concept of Prakriti is one of the earliest principles of preventive and personalized or genomic medicine. In contrast to Prakriti, there is Vikriti, which represents the diseased state of an individual. Understanding one's normal Prakriti is crucial for identifying abnormalities, underscoring its significance in the fields of diagnosis, preventive medicine and therapeutic interventions. Although Prakriti assessment should ideally take place at birth, its influence extends far into an individual's life. Within the realm of Shalya tantra, Prakriti plays a pivotal role. Despite limited literature explicitly addressing the significance of Prakriti in Shalya tantra but understanding and considering the Prakriti when determining treatment is particularly crucial in surgical and parasurgical techniques, as these procedures demand greater Manasika bala.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47070/ayushdhara.v10i6.1391"
    },
    {
        "id": 23527,
        "title": "Sustainable application of ML/AI methods in DCW understanding &amp; screening",
        "authors": "Tony Thomas, Pushpa Sharma, D.K. Gupta",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2023.06.010"
    },
    {
        "id": 23528,
        "title": "Understanding the application of genomics knowledge in nursing and midwifery practice: A scoping study",
        "authors": "Jessica E Schluter",
        "published": "2023-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.colegn.2022.09.011"
    },
    {
        "id": 23529,
        "title": "UNDERSTANDING THE DYNAMICS OF ENTREPRENEURIAL PASSION IN ENTREPRENEURSHIP STUDENTS",
        "authors": "Enrita Atlansyah, Kartika Nuringsih",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "The goal of this study is to analyze the shaping of entrepreneurial passion among students in the practice of entrepreneurial learning at the one university in Jakarta, Indonesia. Exploring this passion is based on two exogenous variables namely emotional support and perceived competence. Students of the Management Program at the Faculty of Economics and Business of Universitas Tarumanagara were involved as source persons in this research. The purposive sampling method is considered for the selection of samples. Some testing stages were used to analyze data including validity, reliability, and structural regression by using the software of Smart-Pls. The result shows both exogenous variables giving significantly affect entrepreneurial passion. Further effects establish good reliability on these constructs and most indicators are valid. Otherwise, found some indicators got a less score on the loading factor so three items are not accurate to measure entrepreneurial passion and one item is less useful to indicate perceived competence. Based on these results, the entrepreneurial education ecosystem needs to improve these items, so students will be more understand the dynamics of entrepreneurial passion specifically for inventing, founding, and developing their venture. It is useful as a mechanism for encouraging the desire of students for entrepreneurial activity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/v1i2.781-792"
    },
    {
        "id": 23530,
        "title": "UNDERSTANDING THE DYNAMICS OF ENTREPRENEURIAL PASSION IN ENTREPRENEURSHIP STUDENTS",
        "authors": "Enrita Atlansyah, Kartika Nuringsih",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "The goal of this study is to analyze the shaping of entrepreneurial passion among students in the practice of entrepreneurial learning at the one university in Jakarta, Indonesia. Exploring this passion is based on two exogenous variables namely emotional support and perceived competence. Students of the Management Program at the Faculty of Economics and Business of Universitas Tarumanagara were involved as source persons in this research. The purposive sampling method is considered for the selection of samples. Some testing stages were used to analyze data including validity, reliability, and structural regression by using the software of Smart-Pls. The result shows both exogenous variables giving significantly affect entrepreneurial passion. Further effects establish good reliability on these constructs and most indicators are valid. Otherwise, found some indicators got a less score on the loading factor so three items are not accurate to measure entrepreneurial passion and one item is less useful to indicate perceived competence. Based on these results, the entrepreneurial education ecosystem needs to improve these items, so students will be more understand the dynamics of entrepreneurial passion specifically for inventing, founding, and developing their venture. It is useful as a mechanism for encouraging the desire of students for entrepreneurial activity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijaeb.v1i2.781-792"
    },
    {
        "id": 23531,
        "title": "A New Constitutive Model and Its Application for Understanding the Impacts of Extreme Hydroclimatic Events on Geotechnical Systems",
        "authors": "Tharshikka Vickneswaran, Nadarajah Ravichandran",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484654.057"
    },
    {
        "id": 23532,
        "title": "The Application and Integration of Intangible Tea Culture in Education for International Understanding: A Cross-cultural Education Strategy",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/trance.2024.060124"
    },
    {
        "id": 23533,
        "title": "Understanding Research 2. Theoretical And Conceptual Frameworks And Their Application To Midwifery Knowledge And Research",
        "authors": "Becky Baker",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Understanding Research is a series of articles aimed at dispelling the myths around research theories and practices and exploring just what is meant by the different terminologies encountered when reading and using research articles. On alternate months we explore different aspects of research to make this knowledge accessible and relevant. It forms part of the Evidence Series, and aims to help midwives understand, use and engage with research and consider how research matters to their practice. Originally published in The Practising Midwife September, 2019.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55975/uefe1952"
    },
    {
        "id": 23534,
        "title": "Document Understanding-Based Design Support: Application of Language Model for Design Knowledge Extraction",
        "authors": "Yunjian Qiu, Yan Jin",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nDesign knowledge in the vast amount of design reports and documents can be an excellent resource for designers in their practice. However, capturing such domain-specific information embedded in long-length unstructured texts is always time-consuming and sometimes tricky. Therefore, it is highly desirable for a computer system to automatically extract the main knowledge points and their corresponding inner structures from given documents. In this study of document understanding for design support (DocUDS), a design-perspective knowledge extraction approach is proposed that uses phrase-level domain-specific labeled datasets to finetune a Bidirectional Encoder Representation from Transformers (BERT) model so that it can extract design knowledge from documents. The BERT model finetuning attempts to blend in the domain-specific knowledge of well-recognized domain concepts and is based on the datasets generated from design reports. The model is utilized to map the captured sentences to the main design entities &lt;reguirement&gt;, &lt;function&gt;, and &lt;solution&gt;. In addition, this approach uncovers inner relationships among the sentences and constructs overall structures of documents to enhance understanding. The definitions of design perspectives, inter-perspective relations, and intra-perspective relations are introduced, which together capture the main design knowledge points and their relations and constitute an understanding of the design domain knowledge of a text. The case study results have demonstrated the proposed approach's effectiveness in understanding and extracting relevant design knowledge points.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/1.4063161"
    },
    {
        "id": 23535,
        "title": "Combined Application of Video Semantic Understanding Technology for Music Video Information Learning",
        "authors": "Songhu Liu, Qi Yang, Tianzhuo Gong",
        "published": "2023-4-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.s10.34-44"
    },
    {
        "id": 23536,
        "title": "Application of Deep Semantic Understanding in Civil Aviation Airport",
        "authors": "Weijia Ye, Ning He, Luyi Peng",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnisc60562.2023.00018"
    },
    {
        "id": 23537,
        "title": "Editor's Message to Special Issue of Understanding, Technology, and Application of Interaction",
        "authors": "Yoshinari Takegawa",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2197/ipsjjip.32.195"
    },
    {
        "id": 23538,
        "title": "Understanding the non-passivating behaviour of silicon anodes for application in Li-ion batteries",
        "authors": "Elisabetta Arca",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2647202"
    },
    {
        "id": 23539,
        "title": "UNDERSTANDING RELATIONSHIP INTELLECTUAL CAPITAL AND FINANCIAL PERFORMANCE ON HEALTHCARE SECTOR",
        "authors": "Jovita Jovita, Kartika Nuringsih",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "In the era of knowledge-based economy, companies pay more attention to intellectual capital than managing tangible assets. This study aims to analyze the effect of the components of intellectual capital including human capital, structural capital, relational capital, and capital employed on the achievement of financial performance in the healthcare sector during the period intersecting with the pandemic. The sampling technique using purposive sampling obtained 15 companies during the 2019-2021 period so that the total observations were 45 firm-years. Quantitative research design using multiple regression with random effect model analysis. The results show that structural capital and capital employed have a significant positive effect of 5 percent on financial performance, while relational capital has the opposite effect. Human capital does not have a significant effect on achieving return on asset performance. As a post-pandemic implementation, the four components of intellectual capital should be managed in a balanced way so that they can add value to the sector.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijaeb.v1i3.1740-1748"
    },
    {
        "id": 23540,
        "title": "Editor's Message to Special Issue of Understanding, Technology, and Application of Interaction",
        "authors": "Akihiro Miyata",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2197/ipsjjip.31.33"
    },
    {
        "id": 23541,
        "title": "Analysis of the Application of Animated Video Media on Students' Understanding of Science Learning",
        "authors": "Laura Ariesta, Mega Adyna Movitaria",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "This research was conducted based on field observations on third grade elementary school students. This study aims to increase students' understanding of science learning in class III SD through the learning method of animated video media. The research method used is a qualitative method by making observations in the field by forming two different groups, displaying two different learning methods. The first method is carried out by presenting an animated video related to the material to be delivered and the second method is carried out in a way that is usually done by the teacher when teaching, and then observations are carried out with interview sessions and documentation. The research results obtained are that many children are interested in the video animation method, they are more focused on looking at the screen and actively respond when there are several questions presented in the animation. While the delivery of material carried out by their teachers is more likely to be boring, silent, and not responding to questions posed by the teacher. Thus it can be concluded that children are more interested in the animated video learning method compared to the method that is often taught by teachers at school.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55062//ijr.2023.v1i1/320/1"
    },
    {
        "id": 23542,
        "title": "Understanding Statistical Correlation of Application Security Vulnerability Data from Detection and Monitoring Tools",
        "authors": "Santanam Kasturi, Xiaolong Li, John Pickard, Peng Li",
        "published": "2023-11-29",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itnac59571.2023.10368476"
    },
    {
        "id": 23543,
        "title": "Understanding the Behaviour of Android SMS Malware Attacks With Real Smartphones Dataset",
        "authors": "Atul Kumar, Ishu Sharma, Avinash Sharma",
        "published": "2023-3-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icidca56705.2023.10099595"
    },
    {
        "id": 23544,
        "title": "Project of CPEC on Pakistani TV Channels: Media Preferences and Project Understanding Influence awareness",
        "authors": "Muhammad Waqas Rana, Sufang Zhang, Adnan Yousaf",
        "published": "2023-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsca57840.2023.10087451"
    },
    {
        "id": 23545,
        "title": "Understanding queer Asian in/visibility via stereotype application.",
        "authors": "Madeline Young, Cory L. Pedersen",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/aap0000334"
    },
    {
        "id": 23546,
        "title": "Understanding &amp; Screening of DCW through Application of Data Analysis of Experiments and ML/AI",
        "authors": "Tony Thomas, Pushpa Sharma, Dharmendra Kumar Gupta",
        "published": "2023-4-12",
        "citations": 1,
        "abstract": "An oil recovery technique, different composition waterflooding (DCW), dependent on the varying injected water composition has been the subject of various research work in the past decades. Research work has been carried out at the lab, well and field scale whereby the introduction of different injection water composition vis-a-vis the connate water is seen to bring about improvements in the oil recovery (improvements in both macroscopic and microscopic recoveries) based on the chemical reactions, while being sustainable from ease of implementation and reduced carbon footprint points of view. Although extensive research has been conducted, the main chemical mechanisms behind the oil recovery are not yet concluded upon. This research work performs a data analysis of the various experiments, identifies gaps in existing experimentation and proposes a comprehensive experimentation measurement reporting at the system, rock, brine and oil levels that leads to enhanced understanding of the underlying recovery mechanisms and their associated parameters. Secondly, a sustainable approach of implementing Machine Learning (ML) and Artificial Intelligence Tools (AIT) is proposed and implemented which aids in improving the screening of the value added from this DCW recovery. Two primary interaction mechanisms are identified as part of this research, gaps in current experimentation are identified with recommendations on what other parameters need to be measured and finally the accuracy of application of ML/AI tools is demonstrated. This work also provides for efficient and fast screening before application of more resource and cost intensive modeling of the subsurface earth system. Improved understanding, knowledge and screening enables making better decisions in implementation of DCW, which is a sustainable recovery option given the current state of affairs with zero carbon and net zero initiatives being on the rise.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16083376"
    },
    {
        "id": 23547,
        "title": "Understanding the opportunity and application of synthetic data in healthcare",
        "authors": "Adam Wilcox",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/ppe.12970"
    },
    {
        "id": 23548,
        "title": "The application of dual clumped isotope thermometer (Δ47 and Δ48) to the understanding of dolomite formation",
        "authors": "Chaojin Lu, Peter K. Swart",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nAlthough several studies have shown the possibility of kinetic isotopic effects during the precipitation of carbonates using the dual clumped isotope proxy (Δ47 and Δ48), this approach has not yet been applied to the study of dolomite. We present Δ47 and Δ48 values of two types of Cenozoic Bahamian dolomites formed by distinctly different mechanisms. One dolomite, present in a core drilled on the island of San Salvador, is believed to have formed from normal seawater in the open system, while the other, taken from the Clino core drilled on the margin of the Great Bahama Bank, was precipitated associated with microbial sulfate reduction in the closed system. The Δ48-derived temperatures of San Salvador dolomites are consistent with their Δ47-temperatures, which are in turn close to the expected value of normal seawater. In contrast, dolomites from Clino show slightly elevated Δ47-derived temperatures (~15 °C higher than the expected) and significantly increased Δ48-temperatures (~145 °C) that are positively correlated with the sulfur isotopes of carbonate associated sulfate, in excess of +30‰. Such an association suggests a non-equilibrium process driven by microbial sulfate reduction, which elevates the alkalinity and depresses the pH of dolomitizing fluids. Notably, the greater amplitude of disequilibrium in Δ48 relative to Δ47 values demonstrates the sensitivity of the Δ48 proxy to kinetic isotope effects in dolomite. Conclusively, this study shows the potential of the dual clumped isotope proxy to identify microbial-mediated dolomitization in modern and ancient records.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1130/g51576.1"
    },
    {
        "id": 23549,
        "title": "A Study of Kindergarten Teachers’ Understanding and Application of Learning Community",
        "authors": "Yeon Wook Hwang",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47116/apjcri.2023.12.49"
    },
    {
        "id": 23550,
        "title": "A contribution to understanding the application of Pulsed Electric Fields in liquid food processing",
        "authors": "L.M. Redondo",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.plrev.2023.12.003"
    },
    {
        "id": 23551,
        "title": "An Implementation of Web Based Application which Aims at Deepening Understanding of Key Cryptosystem",
        "authors": "Hiroto Maeda, Yuichi Oie, Kazunari Ito",
        "published": "2023-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imcom56909.2023.10035571"
    },
    {
        "id": 23552,
        "title": "Understanding and Application of Experiential Learning Theory in Medical Education",
        "authors": "Su Jin Chae",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Experiential learning varies greatly depending on how the meaning of experience is construed. In the context of education, experiential learning generally refers to educational activities that are based on the learners’ active participation and implementation of their knowledge, corresponding to the so-called “learning by doing” emphasized by progressive educational philosophy, in contrast to traditional teaching methods where learners passively receive knowledge. This paper examines the principles of experiential learning theory that are relevant to learning from experience, introducing examples applied to medical education to provide a theoretical perspective. Experiential learning theory is explicated on the basis of the theories of Dewey, Kolb, and Schön. Their key ideas are continuity of experience and the interaction between experience and reflection. According to experiential learning theory, growth is education, and education is a reconstruction of experience. Experiential learning is a way of thinking about the educational process, wherein meaningful learning is constructed through reflection-in-action. Medical education is changing rapidly. Medical schools have the mission of preparing physicians who can compete in an unpredictable future and fulfill their roles as professionals. The implications of experiential learning theory for medical education need to be considered and applied to student education. This paper is meaningful in that it suggests the theoretical possibility that experiential learning theory can be used to achieve the educational goals of medical schools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17496/kmer.23.042"
    },
    {
        "id": 23553,
        "title": "The Effectiveness of Learning Google Meet Assisted by the Geogebra Application to Improve Students' Understanding of Mathematical Concepts",
        "authors": "Nina Lisnawati, Rahayu Kariadinata, Yayu Nurhayati Rahayu",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "Due to the Covid-19 pandemic, online learning has decreased the comprehension of students’ mathematical concepts.. It is very important to instill conceptual understanding in students, in order for them to think and solve problems correctly and appropriately. Students experience difficulties in learning and understanding mathematical concepts, especially when the material provides changes to different problems. This paper aims to find out how far the effectiveness of Google Meet learning is achieved with the help of the GeoGebra application to improve students’ understanding of mathematical concepts. This study uses a quasi-experimental method with sampling using a simple random sampling technique. This research was conducted in one of the high schools in the city of Bandung with the selected sample being class XI MIA 5 as the experimental class, while XI MIA 3 as the conventional class. The instrument used was the Mathematics Preliminary Knowledge test, which is a test of the ability to understand mathematical concepts. This shows that there is an increase in the ability to understand students’ mathematical concepts between the experimental class and the control class. Learning mathematics through Google Meet assisted by the GeoGebra application provides opportunities for students to be able to actively participate in mathematics learning activities through graphic visualization media. It also fosters interest, enthusiasm, and motivates the students in improving their conceptual understanding of mathematics.\r\nKeywords: geogebra application, google meet, understanding of mathematical concepts",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/kss.v9i8.15612"
    },
    {
        "id": 23554,
        "title": "The Importance of Understanding Civil Servant Voice Behavior in Preparing to Indonesia's New Capital Relocation",
        "authors": "Dodi Wirawan Irawanto, Khusnul Rofida Novianti, Misbahuddin Azzuhri",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21776/ub.apmba.2023.012.02.6"
    },
    {
        "id": 23555,
        "title": "Application of the Problem-Based Learning Model to Improve Students' Understanding of Welding Defect Material",
        "authors": " Yayan Srinatriyo, Syarif Suhartadi,  Yoto",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "The purpose of the study is to observe the Problem-Based Learning learning model; it is hoped that students, as prospective welding welders, can understand the types and forms of welding defects that arise to assess the quality of welding performed. This research was conducted on grade XI Las 2 students of SMKN 1 Udanawu using the classroom action research method (Classroom Action Research). The results of the research conducted obtained an increase in the average completeness results of students from the precycle, cycle I, and cycle II students of grade XI Las 2 SMKN 1 Udanawu, which initially only reached 30.2 in the precycle to 56.4 in cycle I and in cycle II to 81.3. This happens because, in practice-based learning, students only concentrate on practice and ignore theories related to welding defects. After Problem-Based Learning is carried out, students better understand the causes and effects of welding defects that arise. The factor that increases student understanding in cycles I and II is that learning is made in groups, so students are more active in identifying welding defects. In cycle II, students present the identification results so that students indirectly understand the material related to welding defects. From the increased learning outcomes, students can judge the welding quality performed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24239/pdg.vol12.iss2.444"
    },
    {
        "id": 23556,
        "title": "Understanding the complexity in the behaviour of a nonlinear oscillator",
        "authors": "Ritvik Dobriyal, Matthew Ho, Pushpendra Kumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0115475"
    },
    {
        "id": 23557,
        "title": "Analysis of Students' Relational Understanding Ability Through the Application of Blended Learning Method",
        "authors": "Tsa Litsa Rasyid, Karunia Eka Lestari",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24235/eduma.v12i1.10118"
    },
    {
        "id": 23558,
        "title": "Recognizing Our Biases, Understanding the Evidence, and Responding Equitably: Application of the Socioecological Model to Reduce Racial Disparities in the NICU",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/anc.0000000000001060"
    },
    {
        "id": 23559,
        "title": "Understanding Restaurant Customers' Environmental Behavior in the Social Media Context: An Application of Theory of Planned Behavior",
        "authors": "Unggul Kustiawan, Laksmi Pandansari",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "Social media users are now increasing, this makes social media to become an effective tool for companies to foster intentional consumer intentional behavior. This study uses the model of the theory of planned behavior to see its effect on intentional behavior on social media and also the moderating effect of economic rewards and social rewards and their effect on consumer offilne behavior. This quantitative research using the Structural Equation Model (SEM) method begins in 2023 by focusing on Z generation consumers in the food and beverage industry, especially franchise fast food restaurants in Indonesia. Data collection was carried out by distributing questionnaires online using Google Forms, which resulted in 166 respondents. Data analysis and processing using SmartPLS 3 software. The findings of this study indicate that, the planned behavior theory model consisting of attitude, subjective norm, and Perceived behavioral control can influence consumer intentional behavior even though attitude is proven not to have a significant effect. Economic reward and social reward are also proven to moderate the relationship between intentional behavior and offline consumer behavior. This research provides managerial implications for companies engaged in food and beverage, especially fast food restaurants, that want to contribute to making good changes to the world through the creation of certain activities or regulations published through social media.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56457/jimk.v11i2.441"
    },
    {
        "id": 23560,
        "title": "The Understanding of Customer Satisfaction on A Fintech Application Using A Machine Learning Approach",
        "authors": "Rona Nisa Sofia Amriza, Fajrin Nurhakim, Dwi Januarita",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comnetsat59769.2023.10420815"
    },
    {
        "id": 23561,
        "title": "Understanding Spatial Context in Convolutional Neural Networks Using Explainable Methods: Application to Interpretable GREMLIN",
        "authors": "Kyle A. Hilburn",
        "published": "2023-7",
        "citations": 1,
        "abstract": "Abstract\nConvolutional neural networks (CNNs) are opening new possibilities in the realm of satellite remote sensing. CNNs are especially useful for capturing the information in spatial patterns that is evident to the human eye but has eluded classical pixelwise retrieval algorithms. However, the black-box nature of CNN predictions makes them difficult to interpret, hindering their trustworthiness. This paper explores a new way to simplify CNNs that allows them to be implemented in a fully transparent and interpretable framework. This clarity is accomplished by moving the inner workings of the CNN out into a feature engineering step and replacing the CNN with a regression model. The specific example of the GOES Radar Estimation via Machine Learning to Inform NWP (GREMLIN) is used to demonstrate that such simplifications are possible and to show the benefits of the interpretable approach. GREMLIN translates images of GOES radiances and lightning into images of radar reflectivity, and previous research used explainable artificial intelligence (XAI) approaches to explain some aspects of how GREMLIN makes predictions. However, the Interpretable GREMLIN model shows that XAI missed several strategies, and XAI does not provide guarantees on how the model will respond when confronted with new scenarios. In contrast, the interpretable model establishes well-defined relationships between inputs and outputs, offering a clear mapping of the spatial context utilized by the CNN to make accurate predictions, and providing guarantees on how the model will respond to new inputs. The significance of this work is that it provides a new approach for developing trustworthy artificial intelligence models.\n\nSignificance Statement\nConvolutional neural networks (CNNs) are very powerful tools for interpreting and processing satellite imagery. However, the black-box nature of their predictions makes them difficult to interpret, compromising their trustworthiness when applied in the context of high-stakes decision-making. This paper develops an interpretable version of a CNN model, showing that it has similar performance as the original CNN. The interpretable model is analyzed to obtain clear relationships between inputs and outputs, which elucidates the nature of spatial context utilized by CNNs to make accurate predictions. The interpretable model has a well-defined response to inputs, providing guarantees for how it will respond to novel inputs. The significance of this work is that it provides an approach to developing trustworthy artificial intelligence models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1175/aies-d-22-0093.1"
    },
    {
        "id": 23562,
        "title": "The Application of Education for International Understanding of Chinese Language Teaching: A Critical Study",
        "authors": "Kong Qingqing, Yu Lishen",
        "published": "2023-1-19",
        "citations": 0,
        "abstract": "Education for International Understanding can provide practical paths for Chinese language teachers, teaching materials, and pedagogy to tell China's stories well. In order to improve the dissemination effect of Chinese stories in teaching Chinese as a foreign language， We started with teachers, teaching materials and teaching methods and obtained the following results from the research: Chinese language teachers should improve their intercultural communication skills and become practitioners of international understanding education and tellers of China's stories; international Chinese language teaching materials should be developed by The Framework of Reference for Culture and Society Chinese in International Chinese Language Education and seek to integrate Chinese stories and local stories based on international understanding education; The Chinese pedagogy should gradually adopt a \"Concept-based Teaching and Learning\" pedagogy to promote the construction of learners' conceptual framework and help them understand China's stories.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/bjtep.2023.2.1.3"
    },
    {
        "id": 23563,
        "title": "THE EFFECTIVENESS OF PICTURE STORY BOOK APPLICATION TO WARDS UNDERSTANDING CULTURAL DIVERSITY IN ELEMENTARY SCHOOL LEVEL",
        "authors": "Hendra Prasetia",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "This study is aimed designed to test effectiveness of picture story book towards understanding Cultural diversity. The Research is proceeded as Experimented Research System with pre-test post-test control group design. The Subjects of this research are students grade IV Elementary School.  The Data Collection of the research is used with tests. The Research Instrument is questionnaire with test questions about Cultural diversity. Hypothetical Measurement is applied in Wilcoxon. The Result of this Research states that the application of picture story book towards understanding Cultural Diversity is reached effective. The result is shown by Differentiations Grades by the class used Picture Books and not. The Distinctions received from Significance Test with 0,031 determined lower than 0,05 can be concluded that there are differences in the results of the pre-test and post-test in this experimental class group. Based on the results of the study in the control class, it was obtained that the significance value of 0.055 was greater than 0.05, so it any difference between the pre and post test results. It can be concluded that the use of picture story books is effective in understanding the cultural diversity of fourth grade elementary school students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32934/jmie.v7i1.508"
    },
    {
        "id": 23564,
        "title": "From Detection to Application: Recent Advances in Understanding Scientific Tables and Figures",
        "authors": "Jiani Huang, Haihua Chen, Fengchang Yu, Wei Lu",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "Tables and figures are usually used to present information in a structured and visual way in scientific documents. Understanding the tables and figures in scientific documents is significant for a series of downstream tasks, such as academic search, scientific knowledge graphs, and so on. Existing studies mainly focus on detecting figures and tables from scientific documents, interpreting their semantics, and integrating them into downstream tasks. However, a systematic and comprehensive literature review on the mining and application of tables and figures in academic papers is still missing. In this article, we introduce the research framework and the whole pipeline for understanding tables and figures, including detection, structural analysis, interpretation, and application. We deliver a thorough analysis of benchmark datasets, recent techniques, and their pros and cons. Additionally, a quantitative analysis of the effectiveness of different models on popular benchmarks is presented. We further outline several important applications that exploit the semantics of scientific tables and figures. Finally, we highlight the challenges and some potential directions for future research. We believe this is the first comprehensive survey in understanding scientific tables and figures that covers the landscape from detection to application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3657285"
    },
    {
        "id": 23565,
        "title": "Learning media through mobile application to improve students’ understanding in higher education",
        "authors": "M. Musahrain, S. Sartika, N. Nurhairunnisah, Fahmi Yahya, Wiwi Noviati",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0122962"
    },
    {
        "id": 23566,
        "title": "Application of Qa'ida Al-Kharaj Bal Daman (the Warranty Rule) in the Chapters of Islamic Jurisprudence and Law",
        "authors": "Davood Hassanpoor",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "One of the most important and practical rules in the field of fiqah and Islamic law is the rule of \"Al-Kharaj Bal Daman\". It means that any person who loses property belongs to him, the benefits of that property also belong to him. Narratives, fatwa fame, induction, and the concentration of rational people is one of the reasons for the validity of this rule. There are different opinions about the meaning and scope of this rule. It has been stated by the jurists of different religions that the consensus of opinion in their opinions leads to the conclusion that any person. The guarantee with the property is under his responsibility, provided that it is accompanied by the approval of Shari'ah, the benefits of that property belong to him. In this case, the scope of the rule includes correct contracts and even incidents, but It does not include usurpation and corrupt contracts. In this article, in a descriptive and analytical way, the issues of comparative study between the views of Islamic religions were studied. This article briefly showed us what opinions are around the rule in each religion. Al-Kharaj Bal Daman has existed and definitely, such comparative studies have a great impact on the unity of religions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18415/ijmmu.v10i6.4599"
    },
    {
        "id": 23567,
        "title": "Application of ANN and Equivalent Electrical Circuit for Understanding the Power Transformer Frequency Response Analysis",
        "authors": "Ahmed Allawy Alwady, Salem Mgammal Al-Ameri",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gecost60902.2024.10475087"
    },
    {
        "id": 23568,
        "title": "Learning Music Blind: Understanding the Application of Technology to Support BLV Music Learning",
        "authors": "Leon Lu",
        "published": "2023-1",
        "citations": 0,
        "abstract": "Learning to play a musical instrument and engaging in musical activities have enabled blind and/or low vision people to develop self-identity, find community and pursue music as a career. However, blind and/or low vision music learners face complex obstacles to learn music. They are highly reliant on their learning environment and music teachers for accommodations and flexibility. Prior research has identified the challenges faced by blind and/or low vision musicians and recognized the importance of touch for music reading and physical guidance. However, limited research has addressed these challenges through the development of assistive technology. The development of music computer technologies with haptics and the affordances of wearable technologies provides encouraging opportunities to develop haptic wearable devices to support blind and/or low vision music learning. I identify three unexplored research questions: (1) what design considerations must be addressed in future assistive technologies for BLV music learning, (2) how can wearable technologies with vibrotactile feedback support BLV student-teacher interactions, and (3) what are the long-term benefits and limitations of the use of assistive technologies for BLV music learning? I outline my research to date and highlight my findings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3584732.3584737"
    },
    {
        "id": 23569,
        "title": "Understanding Challenges and Facilitating Knowledge Transfer for Service Innovation: Insights from a Survey of German Service Companies and a Use Case",
        "authors": "Alexander Gorovoj, Juergen Mueller",
        "published": "2023",
        "citations": 0,
        "abstract": "Innovation is one of the key elements for entrepreneurial success. Small and medium-sized service companies in particular continually innovate their offerings to remain competitive. To do this, they must constantly keep abreast of trends, the latest technological developments, and scientific methodologies. Due to a shortage of resources, they are often dependent on external support from information service providers. However, this knowledge transfer is subject to hurdles that are specific to small and medium-sized enterprises. This paper examines the knowledge transfer challenges faced by such service organizations. To this end, it first presents the results of a company survey and derives recommendations for information provision. The paper concludes with a practical example of a company using the latest technologies to innovate its service offering and how such information is made available to other companies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1004319"
    },
    {
        "id": 23570,
        "title": "The Application of Anthony Giddens' Structuration Theory to Rumeksa Dance in Banyumas District",
        "authors": "Indah Sukma Purwaningtyas, Sutiyono Sutiyono, Akbar Bagaskara",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "This study aims to describe the results of the analysis of the Implementation of Anthony Giddens' Structuration theory in Rumeksa Dance in Banyumas Regency.This research uses descriptive qualitative method. The object of research is Rumeksa Dance in Banyumas Regency. The research subjects were DINPORABUDPAR staff and Rumeksa dance choreographers. Data collection techniques by means of observation, in-depth interviews, and documentation. Test the validity of the data using the technique triangulation method.The results showed that: (1) Rumeksa dance is divided into 3 scenes, namely Lenggeran, Baladewa or Kiprahan, and Ebeg. (2) Rumeksa Dance was initiated by Mr. Mardjoko, the choreography used adapted from Lengger Dance with the aim that future generations can learn Lengger dance with a shorter duration. (3) in Anthony Giddens' Structuration Theory, the agent or person who plays a role in creating differences is Mr. Mardjoko. While the agency or event that the agent is responsible for is Rumeksa dance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18415/ijmmu.v10i10.5193"
    },
    {
        "id": 23571,
        "title": "Understanding public responses on vaccine passport as immigration policy using the big data analysis",
        "authors": "Mohammad Thoriq Bahri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0120311"
    },
    {
        "id": 23572,
        "title": "Research on Intelligent Customer Service System for Power Industry Based on Semantic Understanding",
        "authors": "Li Zhong, Su Yu, Kang Ningning, Zhang Weifang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsca59871.2023.10393830"
    },
    {
        "id": 23573,
        "title": "Use of gamification as a pedagogical strategy to strengthen the understanding of application problems with rational numbers",
        "authors": "Ronnie Alexander Alvarado Rodriguez, Kelvin Agustin Rosado Cusme",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Gamification is defined as incorporating game elements in non-traditional academic environments to motivate students and improve their engagement and participation in learning processes. This quali-quantitative study aimed to analyze gamification uses as a teaching strategy to improve the understanding of application problems with rational numbers and its influence on motivation during learning. Twenty-eight students participated in this study. The data analysis showed that students who received instruction with gamification obtained a greater understanding of the content and a more remarkable ability to work individually and in teams. In addition, students expressed greater satisfaction and motivation for mathematics through gamification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47460/minerva.v2023ispecial.118"
    },
    {
        "id": 23574,
        "title": "The Application of Student Worksheets Based on PhET Simulation to Increase the Concept Understanding in Hooke's Law",
        "authors": "Sudirman Sudirman, Muhammad Qaddafi",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "This study aims to find out: 1) the overview of students ' concept understanding before being taught by using student worksheets based on PhET simulation, 2) the overview of students' conceptual understanding after being taught using student worksheets based on PhET simulation, 3) the increase of conceptual understanding before and after being taught using students’ worksheet based on PhET simulation. This pre-experimental study was carried out with one group pretest-posttest design. The subjects of this study were all of the students of class XI MIA 2 Madrasah Aliyah Lita, Bone Regency. The sampling technique used was purposive sampling. The instruments used was a test to measure understanding of the concepts learned. The results of the descriptive analysis show that the average scores of understanding concepts before using the student worksheet based on PhET simulation is 28.10, while the average value after being taught using the students worksheet based on PhET simulation is 75.71. It indicates that there is an improvement in students’ concept understanding before and after using the student worksheet based on PhET simulation. Meanwhile, the t-count obtained is 5.43 and the t-table obtained is 2.08. Thus, there is a significant difference between the understanding of the physics concept of class XI MIA 2 Madrasah Aliyah Lita Bone regency before and after applying PhET-based worksheets simulation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26618/jpf.v11i1.9505"
    },
    {
        "id": 23575,
        "title": "Development of Online NAS Application User Guide Website using NextJS 13 and REST API to Enhance User Understanding",
        "authors": " Hajjul Ikram,  Muhammad Ardiansyah",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "This research focuses on developing a user guide for the Nusantara Certification Application System (NAS) through an online platform, utilizing NextJS 13 technology and REST API to enhance comprehensive understanding and optimal utilization of NAS features. The implementation of NextJS 13 ensures a responsive and adaptive interface, while the REST API optimizes speed and smooth access to required data. Through a combination of structured video tutorials and information sources in PDF format, the objective of this guide is to provide comprehensive insight into each feature offered within the NAS application. Research findings confirm the success of integrating NextJS 13 technology and REST API, significantly enhancing understanding and efficiency in NAS application use. The primary role of this implementation lies in aiding users to deeply comprehend and optimize the benefits of the NAS application while expediting access to necessary information. In conclusion, the utilization of cutting-edge technology in user guide development has proven to have a positive impact by broadening user insights into the application and enhancing productivity and efficiency in its use. This underscores the significance of employing advanced technology in delivering information to modern application users.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31572/inotera.vol9.iss1.2024.id284"
    },
    {
        "id": 23576,
        "title": "Analysis of the effect of user-understanding-based retrieval system improvement on the application of intelligent archive management",
        "authors": "Shouzhong Wang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nAs a precipitation and accumulation of history, archives management has gradually tended to be digitalized and informalized with the continuous updating and development of modern technology. In this paper, we first study the retrieval system and focus on the Boolean model, vector model, and probabilistic model in information retrieval technology. The matching relationship between documents and queries is detected from the document set for the user’s query, and a relevance retrieval system based on user understanding is proposed to solve the matching problem. The amount of information that needs to be retrieved is growing exponentially, and how a user perceives the information is crucial to the process. Then, in order to solve the problem of insufficient retrieval efficiency caused by the explosive growth of wisdom files, the retrieval system is creatively optimized on the basis of the ant colony algorithm, which effectively improves the efficiency of wisdom file management. The efficiency of the optimized retrieval system is verified and analyzed in an experimental simulation environment. The findings demonstrate that when the amount of archives rises, the retrieval effectiveness of the improved ant colony algorithm described in this study marginally improves, but in 10~35s. As the inventory of the Smart Archives increases, the content retrieval of the archives will become more and more frequent. This study improves retrieval efficiency and serves as a good demonstration for the construction of archival management information technology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00469"
    },
    {
        "id": 23577,
        "title": "Teachers  understanding of gender responsive pedagogy and its application in teaching process: Case after teacher training program interventions in Rwanda",
        "authors": "Josiane Mukagiahana, Aimable Sibomana, Joseph Ndiritu",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.33902/jpr.202423067"
    },
    {
        "id": 23578,
        "title": "UNDERSTANDING THE INTELLECTUAL DISABILITY AND PARENTAL EXPECTATIONS",
        "authors": "Susi Safrina Irawati, P. Tommy Y.S. Suyasa, Pamela Hendra Heng",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "This study aims to describe the understanding and expectations of parents towards children with Intellectual Disability (ID). Children with ID have advantages, they have the potential to win, even at the level of world championships, such as the Special Olympics. However, there are still parents of children with ID who do not know their child's potential. They still wonder about what they can expect from children with ID. In addition, although parents of children with ID help their children in therapy, there are still some of them who do not fully understand the concept of ID. To find out aspects of understanding and expectations of parents of children with ID, the researchers conducted interviews with four parents (mothers) of children with ID. Researchers explored the understanding of parents (mothers) regarding what they know about the concept of ID. In addition, researchers also explored their expectations for their children with ID. This research used two questionnaires, namely the Parent’s Understanding of ID Scale and the Parental Expectations on ID Scale. The Parent's Understanding of ID Scale consists of 50 items, while the Parental Expectations on ID Scale consist of 10 items. These two scales were developed by researchers based on various literatures. Based on the interviews related to understanding ID, the results obtained: (a) parents stated that they lack information about ID, (b) parents began to know that their children have ID when their children were unable to speak at the age of 12 months, and (c) parents were told by doctor that if the child is unable to walk until the age of 18 months, it is one of the signs that the child has ID. Regarding the expectations toward children with ID, the results show that parents expect: (a) their children will not experience bullying in the community, (b) their children will easily find schools that are suitable for ID, and (c) parents can accompany their children, especially if they are outside.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijassh.v1i2.26358"
    },
    {
        "id": 23579,
        "title": "Update on the Application of Ultrasonography in Understanding Autosomal Dominant Polycystic Kidney Disease",
        "authors": "Wen-Chin Lee, Ben-Chung Cheng, Chien-Te Lee, Shang-Chih Liao",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Abstract\nWith an estimated prevalence of 1 in 1000 individuals globally, autosomal dominant polycystic kidney disease (ADPKD) stands as the most prevalent inherited renal disorder. Ultrasonography (US) is the most widely used imaging modality in the diagnosis and monitoring of ADPKD. This review discusses the role of US in the evaluation of ADPKD, including its diagnostic accuracy, limitations, and recent advances. An overview of the pathophysiology and clinical manifestations of ADPKD has also been provided. Furthermore, the potential of US as a noninvasive tool for the assessment of disease progression and treatment response is examined. Overall, US remains an essential tool for the management of ADPKD, and ongoing research efforts are aimed at improving its diagnostic and prognostic capabilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/jmu.jmu_77_23"
    },
    {
        "id": 23580,
        "title": "APPLICATION OF HISTORICAL DATA FROM SATELLITE IMAGERY TO IMPROVE UNDERSTANDING OF COMPLEX NEARSHORE DYNAMICS",
        "authors": "Edward Albada, Elisabeth Mondon, Richard Hinds",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "Collection of nearshore data such as bathymetry and benthic surveys are a requirement to all coastal projects. Typically, surveys are conducted in advance of a modelling exercise so as to replicate in-situ and existing conditions. These surveys only show one snapshot in time and as such do not represent conditions that are out of equilibrium from either seasonal or long-term changes. In these locations, an assessment of a timeseries of surveys would benefit the understanding of nearshore coastal dynamics. However, timeseries of nearshore data are seldom available. Traditional coastal survey technology, e.g., bathymetry from acoustic means or airborne lidar, are expensive and time consuming, and as such they are rarely conducted on a regular basis. Satellite data offers a novel solution by allowing access to very high-resolution data generated over a 20-year time period stored in easily accessible archives, including a convenient web-based application. This paper describes the application of historical satellite data to understand coastal change to a dynamic sand spit feature in Pigeon Point in Southwest Tobago.           ",
        "keywords": "",
        "link": "http://dx.doi.org/10.9753/icce.v37.management.149"
    },
    {
        "id": 23581,
        "title": "Web-based Clustering Application for Determining and Understanding Student Engagement Levels in Virtual Learning Environments",
        "authors": "Eli Nimy, Moeketsi Mosia",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "The increasing use of virtual learning environments (VLEs) in recent years has transformed teaching and learning methods. Universities now combine VLEs with traditional classrooms to accommodate hybrid teaching and learning approaches. However, student engagement with VLEs varies, and universities lack the tools to effectively determine and analyse VLE engagement. Consequently, data-driven decision-making regarding VLE usage remains a challenge for universities. This study thus proposed a user-friendly web-based application, using a R shiny framework, to determine and understand student engagement levels in VLEs. In this study, two clustering methods, K-means and Gaussian Mixture Model (GMM) were compared, to identify the most effective method for the proposed application. The results indicated that GMM outperforms K-means by generating more accurate and comprehensive groupings of student engagement levels. One key advantage of the GMM method is its ability to capture uncertainty and provide probabilities of student membership in each level of engagement, which enhances its usefulness for decision-making. Furthermore, the GMM method achieves these outcomes efficiently, saving valuable learning time. This research holds significant implications for education by providing valuable guidance for the development of Educational Data Mining (EDM) applications. Universities can leverage these applications to gain deep insights into VLE usage and enhance their understanding of student engagement. By adopting this web-based application, educators and administrators can make informed decisions and tailor interventions to optimize student learning experiences within VLEs.\n\nKeywords: Virtual Learning Environments, Student Engagement, Clustering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38159/ehass.20234122"
    },
    {
        "id": 23582,
        "title": "Application of Lecture and Group Discussion Methods in Efforts to Increase Students' Understanding of Aqidah and Moral Subjects at MTs Aisyiyah, Binjai City",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30596/arrasyid.v3i2.17713"
    },
    {
        "id": 23583,
        "title": "Understanding individual psychological and behavioral responses during COVID-19: Application of stimulus-organism-response model",
        "authors": "Dušan Mladenović, Nia Todua, Nataša Pavlović-Höck",
        "published": "2023-4",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tele.2023.101966"
    },
    {
        "id": 23584,
        "title": "UNDERSTANDING SUSTAINABLE ENTREPRENEURSHIP STUDY THROUGH BIBLIOMETRIC ANALYSIS (GROUNDED THEORY)",
        "authors": "Kartika Nuringsih, Nuryasman M. N, Haris Maupa, Otto R. Payangan",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "To harmonize sustainable development in the entrepreneurship sector, a study was carried out to get an overview of knowledge mapping and current issues on sustainable entrepreneurship. Qualitative research was conducted through bibliometric analysis using VosViewer on Scopus metadata for exploring a grounded theory. The density of visualization shows that the yellow color gradation on sustainable entrepreneurship is opaquer than the entrepreneurship’s color, so it is new to be developed as a novelty. The visualization overlay captures the linked topics of entrepreneurial studies since 2008. It is looked at some issues e.g., innovation, sustainability and development which are the gradating color of light green that has been published since 2014-2015. Conversely, other topics e.g., sustainable business models, social capital performance, business venture, and social entrepreneur are detected as current issues. On sustainable entrepreneurship, the overlay of visualization depicts the linked among specific topics e.g., entrepreneurial intention, higher education, business model, and SMEs which has been published since 2012. The further study will improve the topic of sustainable entrepreneurial intention by involving the social domain as a novelty. The bibliometric analysis results in science mapping as the basis for building a state of the art so that researchers can elaborate on ontology issues, and build epistemology and axiology in this study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijaeb.v1i2.793-804"
    },
    {
        "id": 23585,
        "title": "Understanding Molecular Transfer between Aqueous Phase and Reverse Micelles and Its Application to Bioassays in Microfluidics",
        "authors": "Mao Fukuyama",
        "published": "2023-11-15",
        "citations": 2,
        "abstract": "Abstract\nMicrometer-sized water-in-oil droplets (microdroplets) are attracting attention as carriers for the high-throughput parallel analysis of trace samples. By confining trace amounts of water-soluble samples or reagents within a microdroplet, reactions and detection can be performed while suppressing diffusion dilution. Although many manipulation methods for droplets, such as mixing, merging, and splitting using microfluidic channels have been reported, concentration enrichment and purification techniques for microdroplet inclusions have been limited. Our recently developed method for selective concentration enrichment of microdroplet contents focuses on molecular transport between microdroplets and reverse micelles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1246/bcsj.20230179"
    },
    {
        "id": 23586,
        "title": "Understanding consumer’s acceptability of the technology behind upcycled foods: An application of the technology acceptance model",
        "authors": "Wajdi Hellali, Bernard Korai",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.foodqual.2023.104943"
    },
    {
        "id": 23587,
        "title": "UNDERSTANDING SUSTAINABLE ENTREPRENEURSHIP STUDY THROUGH BIBLIOMETRIC ANALYSIS (GROUNDED THEORY)",
        "authors": "Kartika Nuringsih, Nuryasman M. N, Haris Maupa, Otto R. Payangan",
        "published": "2023-8-6",
        "citations": 1,
        "abstract": "To harmonize sustainable development in the entrepreneurship sector, a study was carried out to get an overview of knowledge mapping and current issues on sustainable entrepreneurship. Qualitative research was conducted through bibliometric analysis using VosViewer on Scopus metadata for exploring a grounded theory. The density of visualization shows that the yellow color gradation on sustainable entrepreneurship is opaquer than the entrepreneurship’s color, so it is new to be developed as a novelty. The visualization overlay captures the linked topics of entrepreneurial studies since 2008. It is looked at some issues e.g., innovation, sustainability and development which are the gradating color of light green that has been published since 2014-2015. Conversely, other topics e.g., sustainable business models, social capital performance, business venture, and social entrepreneur are detected as current issues. On sustainable entrepreneurship, the overlay of visualization depicts the linked among specific topics e.g., entrepreneurial intention, higher education, business model, and SMEs which has been published since 2012. The further study will improve the topic of sustainable entrepreneurial intention by involving the social domain as a novelty. The bibliometric analysis results in science mapping as the basis for building a state of the art so that researchers can elaborate on ontology issues, and build epistemology and axiology in this study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/v1i2.793-804"
    },
    {
        "id": 23588,
        "title": "Mobile Application for Understanding Nutritional Labeling Focused on The Consumer",
        "authors": "Gisela Yamin Gómez-Mohedano, Yolanda Marysol Escorza-Sánchez, Héctor Eduardo Mendoza-Espinoza",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Objective: In this multidisciplinary study, a mobile application was designed as a technological tool that contributes to the training of informed consumers capable of interpreting the nutritional characteristics of the products they purchase.\r\n \r\nTheoretical Framework: Mobile applications that allow to display the sodium, sugar and fat content of a product in a way that is understandable to the consumer. Additionally, an area of opportunity is evident in the way of presenting this information and in the calculation of daily energy content.\r\n \r\nDesign/Methodology/Approach: The agile Scrum methodology was used. The requirements of the mobile application were obtained through user stories, which allowed two sprints to be done. The application was subjected to unit and integration testing, connectivity and functionality type.\r\n \r\nFindings: Mobile application for users of the Android operating system that allows you to read, through a smartphone, the barcode of a product on the front labeling and display the sugar, sodium and fat content; Moreover, it issues recommendations for their consumption in accordance with the FAO, WHO, UNU.\r\n \r\nResearch, Practical & Social Implications: Contributes to the training of informed consumers capable of having a better interpretation of the nutritional characteristics of the products they purchase.\r\n \r\nOriginality/Value: Mobile application that to scan the barcode of a product and graphically display, through teaspoons, the content in grams of sodium, sugar and calories it contains. Moreover, it calculates the daily energy content according to some variables: sex, age, weight and level of physical activity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24857/rgsa.v18n5-002"
    },
    {
        "id": 23589,
        "title": "Understanding Cu Sintering and Its Role on Corrosion Behaviour for High-Temperature Microelectronic Application",
        "authors": "Hiren R. Kotadia, Juan Ignacio Ahuir-Torres, Sri Krishna Bhogaraju, Geoff West, Gordon Elger",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "There has been a significant rise in interest from academic and industry communities on copper nano and micro-particles-based sinter pastes for harsh environment die attach. However, sintering these particles is a complex process which is affected by many parameters, such as (i) particles size, shape, and distribution, (ii) sintering temperature, pressure, environment, and (iii) organic compounds used for the paste formulation. In literature, various research groups demonstrated that sintered copper layer can achieve good electrical conductivity and high strength. In our previous research [1, 2], we explained that microscale etched flakes are also capable of shear strength >30Mpa while sintering with 10 MPa bonding pressure at 275°C for just 1 minute with negligible paste cost (in comparison to silver paste). However, very limited knowledge exists on literature about corrosion behaviour in sintered copper interconnects. This, from experience in the industry with silver sintering has proven to be critical to applications. For examples in high power LED headlamp applications, minor exposure to residual Sulphur emerging from vulcanized rubber seals has been observed to cause corrosion in silver sintered interconnects. Therefore, corrosion and its impact on performance and reliability must be considered, especially for safety critical applications. For this reason, we have studied the relationship between copper sintered samples and corresponding corrosion behaviours and compared again to pure copper (conventionally produced). The corrosion resistance of the samples in salt water was assessed via various electrochemical analysis techniques and correlated with sintered microstructure. Sample produced better corrosion resistance when fabricated with higher density (less porosity). However, in case of the microscale copper flakes-based interconnects, a pitting behaviour was observed. The sintered copper paste samples showed to be nobler than commercial copper. In addition, copper oxide and its role in accelerating/preventing oxidation is also studied.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4071/001c.94752"
    },
    {
        "id": 23590,
        "title": "When Ai is Perceived to Be Fairer than a Human: Understanding Perceptions of Algorithmic Decisions in a Job Application Context",
        "authors": "Hyesun Choung, John  S. Seberger, Prabu David",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4356855"
    },
    {
        "id": 23591,
        "title": "Editorial: Toward a better understanding and application of benefit sharing in genomic and global health research",
        "authors": "Aminu Yakubu, Ann M. Mc Cartney, Dominique Sprumont",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fgene.2023.1291181"
    },
    {
        "id": 23592,
        "title": "Misconception of Understanding Flat Building Theory with the Application of Polya Theory in Pgmi 3 Uinsu",
        "authors": "Muhammad Falih Daffa,  , Rora Rizki Wandani,  ",
        "published": "2024-1-23",
        "citations": 0,
        "abstract": "Misconceptions are things that must be avoided by teachers and students in learning. The reality in the field shows that there are still many students who experience misconceptions, one of which is in mathematics. This study aims to describe the misconception of PGMI UINSU students on flat building material with the application of Polya Theory. This research is a qualitative descriptive research. The subjects in this study were conducted to several students who had the most misconceptions of all students in UINSU's PGMI class. The cause of misconceptions that occur is the ability to understand the concepts and images given to the problem. Alternatives include re-explaining, class discussion or using cognitive conflict strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58806/ijsshmr.2024.v3i1n09"
    },
    {
        "id": 23593,
        "title": "Utilization of the Kahoot Games Application for Understanding Economic Learning in High School Students",
        "authors": "Grida Saktian Laksito, Rabiu Hamisu Kankarofi",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "Learning Economics is one of the lessons that need to be well understood by students. With the existence of the economy, students will have a basis for starting and managing the economy and businesses that will be built. Still, there are problems with students of SMAN 1 Majalaya, where they lack enthusiasm and feel less active in learning economics lessons. There needs to be an improvement in learning methods so that their interest in and understanding of basic economics increases, one of which is by utilizing the Kahoot Games application. This study used a quantitative approach with the method of testing the oneway ANOVA hypothesis with a total of 42 respondents who were students of class XI IPS 3 at SMAN 1 Majalaya. The results of the study explain that the use of the learning activity application using the Kahoot Games application has increased students' understanding of the importance of the economy in the daily lives of students so that participants who are Majalaya 1 Public High School students will easily understand basic economics lessons and begin to manage their finances properly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46336/ijeer.v3i2.413"
    },
    {
        "id": 23594,
        "title": "A Unified Frequency Understanding of Image Corruptions and its Application to Autonomous Driving",
        "authors": "Zhuang Zhang, Lijun Zhang, Dejian Meng, Wei Tian, Wei Xiao",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "<div class=\"section abstract\"><div class=\"htmlview paragraph\">Image corruptions due to noise, blur, contrast change, etc., could lead to a significant performance decline of Deep Neural Networks (DNN), which poses a potential threat to DNN-based autonomous vehicles. Previous works attempted to explain corruption from a Fourier perspective. By comparing the absolute Fourier spectrum difference between corrupted images and clean images in the RGB color space, they regard the noise from some corruptions (Gaussian noise, defocus blur, etc.) as concentrating on the high-frequency components while others (contrast, fog, etc.) concentrate on the low-frequency components. In this work, we present a new perspective that unifies corruptions as noise from high frequency and thus propose an image augmentation algorithm to achieve a more robust performance against common corruptions. First, we notice the 1/<i>f<sup>α</sup></i> statistical rule of the natural image's spectrum and the channels-wise differential sensitivity on the YCbCr color space of the Human Visual System. Thus we present a new perspective of the relative Fourier spectrum in the YCbCr color space which unifies the noise from all 15 common corruptions as noise concentrating on the high-frequency components. From the new perspective, the SOTA (state-of-the-art) image augmentation algorithm shows insufficient coverage of frequency change compared with common corruptions and an insufficient improvement in robustness against perturbations on the frequency domain. Second, based on the unified understanding of image corruptions and limitations of the SOTA image augmentation algorithm, we present a frequency-based image augmentation that adds noise to the high-frequency components in the YCbCr color space with the amplitude of noise proportional to the spectrum amplitude of the image. Compared with previous works, the proposed method achieves SOTA performance against corruptions on common datasets (CIFAR-10 and tiny-ImageNet) and real-world driving tests.</div></div>",
        "keywords": "",
        "link": "http://dx.doi.org/10.4271/2023-01-0060"
    },
    {
        "id": 23595,
        "title": "Voltaic Cell Practical Guide Application Based on Mobile-Augmented Reality to Improve Student's Understanding Concepts",
        "authors": "Aiza Alya, Achmad Lutfi, Kusumawati Dwiningsih",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "This study aims to analyze the practicality, feasibility, and effectiveness of learning media as an augmented reality-based practicum guide application for students' conceptual understanding of voltaic cells. The application development used the Thiagarajan development method with the 4-D model (Define, Design, Develop, Disseminate), but it was sufficiently developed to be 3-D. A limited trial with seventeen Al-Falah Senior High School students was conducted in August 2021 on students who had been given voltaic cell material. Pretest-posttest sheets, validation-review sheets, and student response questionnaires were used as research instruments. The data analysis technique used quantitative description. Pretest and posttest results were analyzed based on normality, paired sample test, and N-gain. The results of this study indicated that the developed application could improve students' understanding of concepts. The application validation results obtained a content validation score of 94%, a construct validation score of 86%, a presentation-related validation score of 96%, and a language-related validation score of 90%, indicating that it was very valid. The application was practical because the average percentage of responses was 92%. Based on the t-test with a significance value of 5% that yielded the Sig value, the application was reported to be very effective. 0.00 0.05 (2-tailed) and an N-gain analysis score of 0.83 > 0.7.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33394/jp.v10i3.8104"
    },
    {
        "id": 23596,
        "title": "Politics and Education for peace: Understanding and application in public school settings in Valle of Cauca in Colombia",
        "authors": "Ana Isabel Meneses Pardo",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22533/at.ed.5583152304059"
    },
    {
        "id": 23597,
        "title": "Decoding the DNA of scat and the application of genetic methodologies to understanding carnivore diet",
        "authors": "Charlotte Hacker,  ,  ",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "Carnivore species are vital to ecosystem function and maintenance. One key component to understanding carnivore ecology and the most effective means of management is knowledge of dietary resource use. Traditional methods used to study carnivore diet, such as microhistology, have several technical and logistical shortcomings. These have hindered the quality and quantity of data that shape understanding of how carnivores exploit prey. Advances in genetic methodologies and their application to wildlife biology has transformed the manner in which information about species can be gained. DNA metabarcoding is one such example. With this approach, genetic sequences present in scat can be determined via next-generation sequencing and matched to reference databases, revealing the carnivore that deposited the scat and the prey it consumed. DNA metabarcoding has the ability to overcome many of the previous challenges associated with dietary analysis and works to advance and inform current knowledge surrounding carnivore ecology, predatorprey relationships, conflicts between carnivores and humans, and potential adaptability to large-scale landscape shifts. Its use has provided novel insights on numerous carnivore species to help inform research priorities and wildlife policies, including those living in unique fragile environments such as the Qinghai-Tibetan Plateau of China. The continued development and increased capacity of molecular dietary analysis via DNA metabarcoding has the promise to grossly improve carnivore conservation management strategies on a global scale.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57098/scirevs.biology.2.3.1"
    },
    {
        "id": 23598,
        "title": "Understanding the Application of Mechanical Dyssynchrony in Patients with Heart Failure Considered for CRT",
        "authors": "Abhishek Dutta, Rakan Alqabbani, Andreas Hagendorff, Bhupendar Tayal",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "Over the past two decades of CRT use, the failure rate has remained around 30–35%, despite several updates in the guidelines based on the understanding from multiple trials. This review article summarizes the role of mechanical dyssynchrony in the selection of heart failure patients for cardiac resynchronization therapy. Understanding the application of mechanical dyssynchrony has also evolved during these past two decades. There is no role of lone mechanical dyssynchrony in the patient selection for CRT. However, mechanical dyssynchrony can complement the electrocardiogram and clinical criteria and improve patient selection by reducing the failure rate. An oversimplified approach to mechanical dyssynchrony assessment, such as just estimating time-to-peak delays between segments, should not be used. Instead, methods that can identify the underlying pathophysiology of HF and are representative of a substrate to CRT should be applied.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jcdd11020064"
    },
    {
        "id": 23599,
        "title": "Mobile Android-based application as an instructional media for understanding vehicles’ air conditioner system",
        "authors": "Ummar Ismunandar,  Sukaswanto, Afri Yudantoko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0137164"
    },
    {
        "id": 23600,
        "title": "Constructive Learning Models on Students' Understanding and Application of Learning Concepts",
        "authors": " Subaedah, Abdul Wahab, Muh Azhar, Muh Aidil Sudarmono, Abdul Qahar Zainal",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "This study aims to determine the differences between the constructivist learning model and the conventional learning model for 1) the ability to understand and apply science concepts; 2) interest in learning science; and 3) scientific performance in the field of science. Using a quasi-experimental research learning model with independent variables constructivist learning models and conventional learning models, and the dependent variable includes the ability to understand and apply science concepts, interest in learning science, and scientific performance in science. The population in this study were students of SMP Negeri 34 Makassar, as a sample of students in class VII2 and class VII5 who were randomly selected. The results of the descriptive analysis showed that there was a significant difference in scientific performance between the class with the constructivist learning model and the control class with the conventional learning model. The experimental class obtained a mean = 85.94, the control class obtained a mean = 66.09. The results of the data analysis concluded that there were significant differences in the ability to understand and apply science concepts, interest in learning science, and scientific performance in science between students who were given a constructivist learning model and students who were given a conventional learning model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31538/tijie.v4i2.524"
    },
    {
        "id": 23601,
        "title": "Application of the Game Based Learning Model to Improve Students' Concept Understanding Ability at SMP Negeri 35 Medan",
        "authors": "Charral Erikson Sipahutar,  Mukhtar",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "The purpose of this study was to determine the effect of applying a game-based learning model that can improve students' ability to understand mathematical concepts in the matter of number patterns at SMP Negeri 35 Medan. The type of research is classroom action research with 32 students in class VIII-5 SMP Negeri 35 Medan as subjects. From the data analysis, in the first cycle, 18 students (64.28%) achieved completeness, while 14 students (35.72%) did not complete it with an average grade of 73.66. In cycle II, students who had achieved mastery increased to 24 students (85.71%) while 8 students (14.29%) had not completed with an average grade of 86.38. So it can be concluded that the ability to understand mathematical concepts of SMP Negeri 35 Medan students increased by applying the game-based learning model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/fjst.v2i2.2713"
    },
    {
        "id": 23602,
        "title": "Guest Editorial: Understanding low temperature plasmas for device reliability, modulation and application to green energy strategy",
        "authors": "Yangyang Fu, Tao Shao",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/hve2.12390"
    },
    {
        "id": 23603,
        "title": "Protection of housing and home contents: The understanding and application of Micro takaful scheme in Malaysia",
        "authors": "Puteri Nur Farah Naadia Mohd Fauzi, Amera Irrisya Fadzil Akhma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0167657"
    },
    {
        "id": 23604,
        "title": "The s(quad) model, a pattern approach for understanding the individual and their social network relations: application to loneliness",
        "authors": "Oscar Ybarra, Todd Chan",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "The present research presents a model of how individuals relate to their personal social networks (i. e., spouse, children, other family, friends) by considering the degree to which the individual's needs for communion and agency are satisfied by these relations. The model proposes four prototypical configurations of the individual and their social network, which reflect different combinations of the high and low poles of communion and agency. The squad model is then applied to loneliness, an outcome the literature has considered predominantly from the perspective of deficits in the communion and relatedness domain with little attention paid to people's need for agency. Clustering analyses showed that people's networks can be characterized as proposed by the squad model, but also that loneliness varies as a function of both the level of communion and agency represented by each prototype. The findings thus contribute to our understanding of loneliness, but the framework is much broader and can be applied to varied outcomes. The model also has several implications for research on social networks as well as models of relationship processes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frsps.2023.1278671"
    },
    {
        "id": 23605,
        "title": "Understanding and application of Bacillus nitrogen regulation: A synthetic biology perspective",
        "authors": "Hehe He, Youran Li, Liang Zhang, Zhongyang Ding, Guiyang Shi",
        "published": "2023-7",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jare.2022.09.003"
    },
    {
        "id": 23606,
        "title": "Application of Deep Neural Network Structures in Semantic Segmentation for Road Scene Understanding",
        "authors": " Qusay Sellat,  Kanagachidambaresan Ramasubramanian",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020108"
    },
    {
        "id": 23607,
        "title": "A Review on Understanding the Plant’s Secret Language for Communication and its Application",
        "authors": "Chandan Das",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Plants engage in communication through diverse methods, encompassing chemical signals, sound waves, and root networks. These signals serve to convey information about environmental challenges such as drought and disease, and play a role in attracting pollinators or deterring predators. Coined as the \"plant's secret language\" by Tompkins and Bird in 1973 [1] Tompkins, P., & Bird, C. [1973]. Scientists have identified specific compounds that plants use to signal to one another, including volatile organic compounds [VOCs] and herbivore-induced plant volatiles [HIPVs] that can be released into the air and root exudates that are released into the soil. Recent research has shed light on the mechanisms behind this communication, revealing that plants have a sophisticated network of sensory and signalling pathways that allow them to perceive and respond to various stimuli. The review covers a range of topics, including how plants communicate with each other, how they respond to biotic and abiotic stresses, and how they use this communication to defend against pathogens and predators[herbivore]. It also discusses the potential applications of this knowledge in various fields, such as agriculture, medicine, and environmental monitoring. Overall, this review study highlights the importance of understanding the plant's secret language for communication and its potential applications in various fields like agriculture, conservation, and medicine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36348/sjls.2024.v09i01.001"
    },
    {
        "id": 23608,
        "title": "Worth-Conscious theory: Understanding the role of birthright self-worth and application to clinical practice",
        "authors": "Dawna Daigneault, Chris Brown",
        "published": "2023-6",
        "citations": 0,
        "abstract": " In this article, we introduce a theory of worth consciousness that builds on the research from self-worth with attention to the importance of honoring birthright self-worth (BSW), which is foundational to human dignity. This new empirically testable construct, Worth-Conscious theory (WCT), concerns human worth and requires individuals to recognize and acknowledge their value and significance (i.e., worth) even when smaller (e.g., family) and larger (e.g., community and society) systems fail to support them in affirming and repairing their worth. Self-Worth is the birthright of all individuals; hence our central aim is to introduce and explain the four pillars of self-worth, which are major tenets of WCT that align with Erikson’s developmental stages. These four pillars of self-worth (self-awareness, self-respect, self-esteem(ed), and self-confidence) are instrumental in understanding clients’ life challenges, presenting issues, and how to assist them in repairing and maintaining their worth. More specifically, many clients’ mental health issues, interpersonal conflicts, and other concerns can be directly or indirectly related to the experience of negative and critical beliefs about their worth and, more specifically, that their BSW has not been affirmed or realized throughout the lifespan. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/09593543221135559"
    },
    {
        "id": 23609,
        "title": "UNDERSTANDING OF KSHALANA KARMA AND ITS APPLICATION IN THE MANAGEMENT OF BHAGANDARA (FISTULA IN ANO)",
        "authors": "Sandhya Ajith, C.S Sivakumar, Remya V.R",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "Therapeutically the word Kshalana(irrigation) means the irrigation of the affected site using a suitable solution for\nthe purpose of purification[1]. It is mentioned in the classical textbooks of ayurveda as Poorvakarma, Pradhana\nkarma, and Paschath karma. Kshalana is beneficial in controlling foul-smelling and slimy exudating conditions\nlike ulcers, vaginal infections, etc. A fistula in an ano is an abnormal tract or cavity lined with unhealthy granulation\ntissue that connects a primary opening inside the anal canal to a secondary opening in the perianal skin[2]. Its prevalence is the second highest after haemorrhoids among anorectal diseases. In Ayurveda, fistula in ano is correlated\nwith the vyadhi Bhagandara (fistula in ano). Modern medical managements have its own limitations, even with\nvarious surgical modalities. Due to the presence of irritant discharges and non-dependent drainage, fistula in ano\nseldom shows healing intention[3]. Although Ayurvedic classics explain various treatment modalities for the management of fistula in ano, Ksharasuthra therapy owes the glorious part of management. But improper pus drainage,\npus stagnation, and microbial invasion hinder the action of Ksharasuthra. Kshalana is a simple and cost-effective\ntherapeutic technique. The present review focuses on the understanding of Kshalana karma along with its mode of\naction and application in fistula in ano.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46607/iamj03p7052023"
    },
    {
        "id": 23610,
        "title": "Anti-Stokes Photoluminescence in Halide Perovskite Nanocrystals: From Understanding the Mechanism towards Application in Fully Solid-State Optical Cooling",
        "authors": "Nikolay S. Pokryshkin, Vladimir N. Mantsevich, Victor Y. Timoshenko",
        "published": "2023-6-9",
        "citations": 2,
        "abstract": "Anti-Stokes photoluminescence (ASPL) is an up-conversion phonon-assisted process of radiative recombination of photoexcited charge carriers when the ASPL photon energy is above the excitation one. This process can be very efficient in nanocrystals (NCs) of metalorganic and inorganic semiconductors with perovskite (Pe) crystal structure. In this review, we present an analysis of the basic mechanisms of ASPL and discuss its efficiency depending on the size distribution and surface passivation of Pe-NCs as well as the optical excitation energy and temperature. When the ASPL process is sufficiently efficient, it can result in an escape of most of the optical excitation together with the phonon energy from the Pe-NCs. It can be used in optical fully solid-state cooling or optical refrigeration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/nano13121833"
    },
    {
        "id": 23611,
        "title": "APPLICATION OF A NUMERICAL MODEL AND BATHYMETRIC INVERSION ALGORITHMS TO ENHANCE UNDERSTANDING OF NEARSHORE CHANGE",
        "authors": "Elora M. Oades, Ryan P. Mulligan, Margaret L. Palmsten",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "During extreme wave events, shoaling occurs farther from shore, extending the surf zone width and intensifying wave breaking (Thornton and Guza, 1983; Mulligan and Hanson, 2016). Remote sensing using digital cameras is an inexpensive way to gather continuous observations of the surf zone and calculate water depths based on phase speed. This study investigates the robustness of the newly released version of cBathy (Holman et al., 2013; Holman and Bergsma, 2021), a bathymetric inversion algorithm. cBathy is employed in moderate to energetic wave conditions using synthetic water level data generated by the non-hydrostatic numerical phase resolving model, SWASH (Simulating WAves till Shore) (Zijlema et al., 2011; Gomes et al., 2016; Fiedler et al., 2019). The overall performance results are described by the variation in root-mean-squared errors (RMSE) with significant wave height, and with depth. The results show that RMSE are dependent on water depth, significant wave height, and domain coverage by breaking waves. cBathy V2.0 consistently performs better than the preceding version, when comparing depth estimates to survey observations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9753/icce.v37.sediment.55"
    },
    {
        "id": 23612,
        "title": "Understanding Farmers’ Intentions in Pesticide Application: Insights from the Theory of Planned Behavior",
        "authors": "Nugrahini Susantinah Wisnujati, Suwandi S. Sangadji, Gancar Candra Premananto",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ijei.070106"
    },
    {
        "id": 23613,
        "title": "Understanding the Mechanism of Individual Constitutional Complaints in Lithuania: Main Features and Challenges of the First Years of Application",
        "authors": "Dovilė Pūraitė-Andrikienė",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Background: The mechanism of individual constitutional complaints has been in place in most European states. In the constitutional legal practice of European states, constitutional complaints as the specific procedural instrument for protecting a person’s constitutional rights and freedoms have become an increasingly acceptable, applicable, and justifiable measure. However, Lithuania has introduced this mechanism of human rights protection only with constitutional amendments of 2019. This article examines the legal regulation governing the institution of constitutional complaints, as well as the use of this institution in Lithuania in 2019–2022. The research aims to shed light on the choice of the Lithuanian model of constitutional complaints and its main features, as well as to identify the problematic aspects of this model.\nMethods: To reveal theoretical and practical aspects of the question under consideration, this article combines different methods of scientific inquiry, including analysis of documents, as well as the logical, systemic, critical, comparative, teleological, and linguistic methods of analysis. The method of document content analysis was used to analyse the content of relevant normative and jurisprudential research sources. This approach used the text of the analysed documents to identify relevant words and phrases, contextualise their usage, and link the acquired data to statements in specialised literature. The analysis hinged on theoretical methods, particularly systemic and logical analysis, used to analyse virtually all the aspects discussed in the paper. Comparative analysis was used to compare the legal regulation of the constitutional complaint model in other Central and Eastern European countries and the Lithuanian legal regulation on similar issues. Teleological and linguistic methods of analysis have been used to clarify the content of the ambiguously understood provisions governing the individual constitutional com- plaint model, the true intentions of the legislator, and the meaning of the concepts contained in the legislation. The paper also analyses the statistical information on the admissibility of constitutional complaints in Lithuania and other aspects of using this human rights protection mechanism in 2019–2022.\nResults and conclusion. The paper concludes that after the amendments to the Constitution concerning the consolidation of individual constitutional complaints entered into force in 2019, Lithuania can no longer be categorised among the states with a limited scope of entities entitled",
        "keywords": "",
        "link": "http://dx.doi.org/10.33327/ajee-18-6.4-a000475"
    },
    {
        "id": 23614,
        "title": "An Augmented Reality Application and User Study for Understanding and Learning Architectural Representations",
        "authors": "Ziad Ashour, Zohreh Shaghaghian, Wei Yan",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vrw58643.2023.00241"
    },
    {
        "id": 23615,
        "title": "Understanding and application of SMES on sustainable management: A case study in Vietnam",
        "authors": "Vo Phuoc Tai, Le Thanh, Ta Hoang Giang",
        "published": "2024",
        "citations": 0,
        "abstract": "This study investigates the integration and impact of sustainable management practices within Small and Medium-sized Enterprises (SMEs) in Vietnam. SMEs play a crucial role in Vietnam's economy, contributing significantly to employment, GDP, and societal well-being. The research explores the challenges and incentives influencing SMEs' adoption of sustainability practices, drawing on theoretical frameworks, empirical data, and insights from existing literature. Key barriers include financial constraints, limited awareness of sustainability benefits, and regulatory shortcomings. Conversely, drivers include cost savings, enhanced brand image, and increased customer loyalty. Actionable strategies for fostering sustainability in SMEs, including governmental support, education programs, and stakeholder engagement, are proposed. By addressing these challenges and leveraging opportunities, Vietnamese SMEs can contribute to sustainable development and economic resilience.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54660/.ijmrge.2024.5.2.611-616"
    },
    {
        "id": 23616,
        "title": "Analysis of Language Structure and Its Implications in Modern Linguistics: A Study of the Understanding and Application of Structural Linguistic Concepts",
        "authors": "Juanda Juanda",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Structural linguistics is a branch of linguistics which analyzes language from a structural point of view. It focuses on how language is formed and constructed, and how language can be understood structurally. This study analyzes the structure of language and its implications in modern linguistics, examines the understanding and application of structural linguistic concepts, and identifies how these concepts can be used to understand and analyze language. Saussure developed a theory about language as an organized symbolic system. He emphasized that language is a system consisting of components that are interrelated with one another. After Saussure, several other linguists also developed the concept of structural linguistics. Structural Linguistics has developed into one of the most important branches of linguistics. The contributions of Structural Linguistics have had a major impact on various fields. By analyzing the structure of language, linguists can understand how language develops and how language interacts culturally and socially. This has helped teachers, translators and linguists in developing languages and improving the quality of language teaching, translation and analysis. The application of Structural Linguistics has helped linguists a lot in understanding how language develops and changes. This theory has helped linguists to understand how language is influenced by social and cultural contexts, and how language is used to express meaning in different language contexts.\r\n \r\nReceived: 8 September 2023 / Accepted: 27 December 2023 / Published: 5 January 2024",
        "keywords": "",
        "link": "http://dx.doi.org/10.36941/jesr-2024-0019"
    },
    {
        "id": 23617,
        "title": "Understanding the Intention to Use LAPOR Application as e-Democracy in Indonesia: An Integrating ECM and UTAUT Perspective",
        "authors": "Mohammad Nurul Huda, Kholidil Amin",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "The development of ICT enables citizen involvement in the decision-making process and two-way communication between democratic actors in the political sphere through digital e-democracy platforms. Unfortunately, implementing digital platforms faces severe problems on the adoption side. A literature review shows that developing countries are research locations that have been widely studied in recent years, and specific theoretical models were used to explain the critical factors that influence user acceptance of e-democracy. This study investigates the critical factors influencing the adoption of e-democracy to fill the research gap. The conceptual model is proposed by integrating the ECM into UTAUT. A cross-sectional survey was designed and employed to test the conceptual model. Tests were carried out on 355 data samples using SmartPLS software. The PLS algorithm testing and the bootstrapping procedure were carried out. The results found that satisfaction, perceived usefulness, effort expectancy, and facilitation conditions directly influence the intention to use e-democracy. At the same time, social influences do not significantly affect the intention to use e-democracy. In addition, perceived usefulness, facilitation conditions, and expectancy confirmation positively influence user satisfaction. Expectancy confirmation positively influences perceived usefulness. Theoretical and practical implications are discussed. Consequently, some policy recommendations need to be adopted by the Indonesian government to improve the quality of e-democracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29379/jedem.v15i1.786"
    },
    {
        "id": 23618,
        "title": "Application of  Flipped Classroom Model  Assisted Edmodo to Improve Students' Understanding of Concepts in the Material Sound Waves",
        "authors": "Safriana Safriana, Junika Rose, Fajrul Wahdi Ginting",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "The Edmodo-assisted classroom flipped classroom model is a learning process by applying the flipped classroom model with the help of Edmodo to deliver learning materials. This study aims to determine the improvement of students' understanding of concepts in sound wave material. The type of research used is pre-experimental design. The design of this study used the Nonequivalent Control Group Design. The sampling technique that the researchers chose was purposive sampling of 40 students consisting of 20 students’ experimental class and control class. The research instruments used are observation sheets and student concept comprehension tests. The data analysis techniques used are learning implementation analysis, calculating the value of students' concept understanding results and N-gain score. The average N-Gain score for the control class was 0.69 with a moderate category. While the average N-Gain score for the experimental class is 0.77, which is included in the high category. So, it can be known that there is an increase in the understanding of students' concepts in the experimental class who apply the Edmodo-assisted flipped classroom model to sound wave material. This increased understanding of the concept occurred because the experimental class implemented an Edmodo-assisted flipped classroom model. In the flipped classroom model, students first learn to understand the learning materials uploaded by the teacher through Edmodo. Learning materials in the form of videos can be played repeatedly through Edmodo, so that students can learn anywhere and anytime without any time limit according to their respective learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24815/ajse.v5i1.28805"
    },
    {
        "id": 23619,
        "title": "Toward a holistic understanding of cancer cachexia: Application of the human response to illness model",
        "authors": "Susan E. McClement",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apjon.2023.100306"
    },
    {
        "id": 23620,
        "title": "Understanding HIGMill operation at copper regrind application; operating parameters, wear and mineral liberation",
        "authors": "Okay Altun, Özgün Darılmaz, Erdem Karahan, Tolga Sert, Deniz Altun, Alper Toprak, Anıl Hür",
        "published": "2023-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mineng.2022.107964"
    },
    {
        "id": 23621,
        "title": "Profile of Critical Thinking of Elementary School Students and Application of HOTS-Based Worksheets in Science Lessons",
        "authors": "Dyah Retna Sari, Suryanti Suryanti, Elok Sudibyo",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "This research was conducted to analyze the profile of students' critical thinking abilities and the application of HOTS-based LKPD in elementary school science learning. The research method is descriptive preliminary research and does not test the hypothesis with a sample of 20 elementary school students in Magetan, East Java. Data collection techniques used critical thinking skills tests, student response surveys, and teacher interviews whose data results will be analyzed descriptively qualitatively. Based on the results of the research, it was found that 1) students' critical thinking skills were in the low and medium categories. 14 students in the low category, 6 students in the medium category and none of the students in the high category; 2) The lowest indicator of critical thinking skills is evaluation; 3) Teachers still use lecture methods and conventional teaching materials during learning; 4) Implementation of HOTS-based LKPD is expected to improve students' critical thinking skills in science lessons. It can be concluded that students' critical thinking skills are still low, so it is necessary to increase students' critical thinking skills by implementing HOTS-based worksheets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18415/ijmmu.v10i11.5272"
    },
    {
        "id": 23622,
        "title": "An augmented reality application and experiment for understanding and learning spatial transformation matrices",
        "authors": "Zohreh Shaghaghian, Heather Burte, Dezhen Song, Wei Yan",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10055-023-00904-x"
    },
    {
        "id": 23623,
        "title": "Understanding and Intervening with Survivors of Domestic Minor Sex Trafficking: An Application of Social Cognition Theory",
        "authors": "Jennifer O’Brien, Kathleen Preble",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10615-023-00877-z"
    },
    {
        "id": 23624,
        "title": "Application of the Team Assisted Individualization (TAI) Learning Model in Improving Understanding of Mathematical Concepts",
        "authors": "Mia Misastri, Ricky Purnama Wirayuda, Syarbaini Syarbaini",
        "published": "2023-1-31",
        "citations": 3,
        "abstract": "Purpose of the study: Research This done with objective For analyze understanding draft mathematics competence number with using the Learning Model Team Assisted Individualization (TAI) for students class IV Madrasah Ibtidaiyah Al-Hidayah Kebon IX Muaro Jambi.\r\nMethodology: Deep data study This in the form of quantitative and qualitative data which is analyzed in a manner descriptive and data obtained through stages observation as much as 2 cycles with sample as many as 18 students.\r\nMain Findings: After done 2 cycles obtained happen enhancement understanding draft improved mathematic using learning models Team Assisted Individualization (TAI). enhancement results from understanding draft mathematics competence number student by 26.73%.\r\nNovelty/Originality of this study: Updating from study This is related research with enhancement understanding draft mathematics competence number with using the Learning Model The previous Team Assisted Individualization (TAI).",
        "keywords": "",
        "link": "http://dx.doi.org/10.37251/jee.v4i1.308"
    },
    {
        "id": 23625,
        "title": "Application of the Principle of Good Faith in Electronic Transactions (E-Commerce) by Consumers That Use the Cash on Delivery (COD) Method",
        "authors": "Syifa Rana Tsary",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "This study examines the urgency of implementing cash on delivery system in electronic transactions and the good faith of consumers for goods ordered using the cash-on-delivery method. The formulation of the problem discussed is what is the basis for implementing the cash-on-delivery system, and how can consumers application of the principle of good faith to the cash-on-delivery system? The research method used is normative and literature study based on primary materials (laws), secondary materials (scientific works, journals, books, documents, and other literature), and tertiary legal materials (legal dictionaries). The results of the study, namely the urgency of the payment method with Cash on Delivery (COD), are considered very important to give consumer confidence to business actors for the products ordered and make it easier for them to make payments in cash when the product is received. The principle of good faith must be obeyed when implementing e-commerce agreements, especially for consumers who take advantage of the COD feature, so as not to act arbitrarily, which harms business actors. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.18415/ijmmu.v10i10.5098"
    },
    {
        "id": 23626,
        "title": "Project Based Learning: Promoting Cross-Cultural Understanding using Android Application at an Indian University in Gujarat",
        "authors": "Shehrevar Davierwala, Nirav Bhatt",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "Students in a project-based learning environment get experience with actual, hands-on projects. In this article, we present the experience obtained in a Mobile Application Development course. In addition, available multi-country criteria of this research enable us to investigate probable cross-cultural variances. The purpose of this project was to design and create apps (or simply app) for Android-based devices. The chosen methodology, based on Project-Based Learning, boosted both cooperation and rivalry among students. This research offers the outcomes from a heuristic assessment by students at Indian university in Gujarat for the students of three nations. Total 120 students are recruited for this research from a university in Gujarat. \"It was established that a project-based learning approach is an effective and engaging way for translation students to experiment with their translation skills and different translation theories, achieve linguistic and cross-cultural understanding of different cultures while participating actively in various organised learning activities.'' More significantly, they have elevated their intercultural awareness and strengthened their intercultural communication ability. As students engage in this kind of project-based, introspective, and exploratory learning, they grow in their confidence as communicators (both verbally and in writing), their willingness to take intellectual risks, and their awareness of cultural variety. Its educational ramifications are examined.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i8s.7176"
    },
    {
        "id": 23627,
        "title": "Understanding Baby Boomers’ Psychological Contradiction in Adopting Automatic Technology: An Application of Protection Motivation Theory",
        "authors": "Law Ka Yan, Janelle Chan",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/19388160.2024.2311174"
    },
    {
        "id": 23628,
        "title": "Understanding the role of green finance and innovation in achieving the sustainability paradigm: application of system GMM approach",
        "authors": "Deqiang Wu, Weiping Song",
        "published": "2023-1-14",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-022-25079-x"
    },
    {
        "id": 23629,
        "title": "COMPREENSÃO E APLICAÇÃO DO NÚMERO DE EULER: Uma revisão sistemática bibliográfica",
        "authors": "M. A. S. Antoniazzi, E. Z. Godinho",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29367/issn.1809-3957.2023.18.213.139"
    },
    {
        "id": 23630,
        "title": "Understanding Cu Sintering and Its Role on Corrosion Behaviour for High-Temperature Microelectronic Application",
        "authors": "Juan Ignacio Ahuir-Torres, Sri Krishna Bhogaraju, Geoff West, Gordon Elger, Hiren R. Kotadia",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/empc55870.2023.10418365"
    },
    {
        "id": 23631,
        "title": "LAA: Learn the Arabic Alphabet: Integrating Gamification Elements with Touchscreen Based Application to Enhance the Understanding of the Arabic Letters Forms",
        "authors": "Abdullah Al Hejaili, Paul Newbury",
        "published": "2023-10-16",
        "citations": 1,
        "abstract": "Touchscreen devices provide a variety of features and engaging interaction which offer a significant incentive for them to be adopted for learning purposes. They facilitate access to educational resources at any time and broaden the study contents beyond the formal curricula of educational institutions. This is promoted by employing educational applications that stimulate learners to interact effectively with the learning material to gain motivation, influencing their accomplishments in the targeted subject. However, some applications fail to provide a variety of feedback to their stakeholders by relying on evaluating learners either negatively or positively in a simplistic manner and with a lack of reinforcement. This unsuitability and the lack of feedback can lead to a weak level of interaction and decrease students' comprehension levels. In this paper, a multi-platform touchscreen-based application has been developed by adopting gamification to support learners with limited literacy skills in acquiring the Arabic alphabet. A study was conducted on 75 native Arabic learners studying in the first and second year of elementary level in Saudi Arabia to evaluate the system's ability to increase learners’ knowledge of the Arabic alphabet. The sample was divided into three groups; experiment, and control groups (both first-year) and second-year groups. The experimental group utilized the application after taking the pre-test, while the control group interacted with the learning material traditionally with their teachers. The second-year group results assisted the study in investigating the system's ability to rapidly boost the experiment group's comprehension of the targeted subject since the second-year learners were more experienced in Arabic letters than the experiment or control groups. The results of the comparison of the pre-test and post-test showed that the experiment group overtook the control and the second-year group regarding the post-test score, which indicates the system's ability to increase learners’ knowledge level. By providing an interactive and engaging learning experience, the developed application has shown the ability to increase learners' knowledge levels significantly. These research findings have implications for educators, learners with limited literacy skills, curriculum developers, and researchers who are seeking effective tools to improve language learning outcomes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34190/ejel.21.4.3043"
    },
    {
        "id": 23632,
        "title": "Understanding the Effects of Social Value Orientations in Shaping Regulatory Outcomes through Agent-Based Modeling: An Application in Organic Farming",
        "authors": "Saba Siddiki, Christopher Frantz",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4000/irpp.3398"
    },
    {
        "id": 23633,
        "title": "Understanding the food waste behaviour in university students: An application of the theory of planned behaviour",
        "authors": "Shahnaza Akhter, Mohmmad Irshad Rather, Ummer Rashid Zargar",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jclepro.2024.140632"
    },
    {
        "id": 23634,
        "title": "Understanding the Impact of changes in Application Characteristics on SRGM",
        "authors": "Rajat Arora, Rubina Mittal, Sameer Anand, P.K. Kapur",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0218539324500116"
    },
    {
        "id": 23635,
        "title": "Understanding of the Tracking and Adjusting Effect of Deep Profile Control and Flooding Expansion Application Blocks in Pubei Oilfield",
        "authors": "Guoguang Wang",
        "published": "2024",
        "citations": 0,
        "abstract": "In order to explore the development technology of enhancing oil recovery during the ultra-high water cut period in the Pubei Oilfield, deep profile control pilot tests and expanded application tests have been carried out in the Pubei Oilfield. This article mainly starts from the actual production performance of the deep profile control and flooding expansion application test, analyzes the main tracking and adjustment methods and the understanding of the results obtained in the development process of deep profile control and flooding, laying the foundation for the establishment of deep profile control and flooding matching tracking and adjustment technology in Pubei Oilfield.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202447801008"
    },
    {
        "id": 23636,
        "title": "Application of Health Belief Model in Understanding Wash Behaviour Practices among Mothers of U-5 Children in Lagos Urban Slums",
        "authors": "Hope Orivri, Hope Orivri",
        "published": "2023-1-26",
        "citations": 1,
        "abstract": "The poor practice of Water, Sanitation, and Hygiene (WASH) supports the spread of disease burdens causing high U-5 children mortality rates in developing countries like Nigeria. Knowledge, perception, attitude and other influencing factors become important in determining WASH practices. This study, guided by the Health Belief Model, assessed the knowledge, perception, and attitude of mothers of U-5 children in Lagos urban slums to WASH behaviour messages in order to understand their WASH practices. The cross-sectional study involved 361 mothers of U-5 children in selected Lagos urban slums. Applying cluster sampling and purposive sampling techniques, the study used a pre-tested structured questionnaire through interviews to collect data on knowledge, perception, attitude, and practice of WASH. IBM SPSS Version (26) was used to analyse the data collected, and the presentation was in percentages, tables and charts. The main objective was analysed using path analysis of the structural equation model (SEM) and logistic regression model. Only 15.2% used improved water sources, 44.3% stored drinking water safely, and 10.3% did not treat home drinking water. Open defecation was high (61.8%); Only 22.4% washed their hands with water and soap at critical times; 36.6% disposed of waste into the river and canal; open dumpsites (33.8%), and 29.6% used waste to fill marshy areas in the environment. The majority (90%) favourably perceived the susceptibility of children to the dangers of unsafe drinking water. The mothers positively perceived the benefits of good WASH practice for children’s health, but (31.1%) had low knowledge of the severity of the risk resulting from poor WASH. The mothers’ positive perceptions did not necessarily reflect in their WASH practices. Age, level of education, marital status, and occupation significantly influenced the respondents’ WASH practice. Economic reasons and limited WASH facilities were barriers, while contributions of community leaders were supportive. Study recommendations include; the provision of WASH facilities and more WASH behaviour education for mothers through participatory communication approaches. The WASH behaviour sensitisation model should be reviewed to have a distinct identity from routine immunization programmes; to enable mothers to understand WASH messages better.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/jhsss.2023.5.1.13"
    },
    {
        "id": 23637,
        "title": "Application of the Theory of Inventive Problem Solving (TRIZ) to Enhance Understanding of Li-Ion Battery Thermal Runaway in Electric Vehicle Applications",
        "authors": "Seck Mourtada, Mesbahi Tedjani, Dubois Sébastien, Chibane Hicham",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vppc60535.2023.10403228"
    },
    {
        "id": 23638,
        "title": "Application of Theory for Those With Sport-Related Concussion: Understanding the Effect of Athletic Identity on Health Outcomes",
        "authors": "Megan C. Loftin, Tracey Covassin, Shelby Baez",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Athletic identity is a psychological factor of concern for athletes after sport-related concussion (SRC). The integrated model of response to sport injury includes athletic identity as a psychological factor within its model, but it has often been overlooked as a consideration affecting outcomes of SRC. In this review, we applied the integrated model of response to sport injury to the current available evidence about the negative consequences of a stronger athletic identity on health outcomes after SRC. Theory-based research recommendations will be provided to facilitate research in this area. Recommendations for athletic training clinical practice to assess and consider athletic identity as part of routine clinical care for those after SRC will also be discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4085/1062-6050-0420.22"
    },
    {
        "id": 23639,
        "title": "An interdisciplinary course on evolution and sustainability increases acceptance of evolutionary theory and increases understanding of interdisciplinary application of evolutionary theory",
        "authors": "Scott A. Kreher, Ellen McManus",
        "published": "2023-5-24",
        "citations": 2,
        "abstract": "Abstract\nBackground\nAlthough evolutionary theory is foundational and integrative in modern biology, there remains widespread lack of acceptance among U.S. residents. An interdisciplinary approach to teaching evolutionary theory at the undergraduate level has many advantages, such as giving students a context for learning about evolution and application of evolutionary theory to other academic disciplines and everyday life. While there are foundational examples of interdisciplinary approaches to teaching evolutionary theory, there are few examples of courses with application of evolutionary theory to issues of sustainability, such as conservation or global climate change. We build on the practical and theoretical work of others to create an interdisciplinary course on evolutionary theory for non-science majors, with ties to sustainability. Our course is taught in three modules, with extensive readings and hands-on lab activities. The first module is focused on honey bee biology, with hands-on beekeeping experiences; the second module on native plants and community education on sustainability; and the third module on the evolution of the subjective human experience of free will.\n\nResults\nWe found that students in our course experienced an increased acceptance of evolutionary theory. We found that students also met the course leaning objectives, of basic knowledge of evolutionary theory and application of evolutionary theory to other disciplines, assessed through group and individual major assignments. We also found that students had an expanded perspective on interdisciplinary application of evolutionary theory, assessed through closed-ended survey questions and analysis of open-ended writing.\n\nConclusions\nStudents in our course experienced an increase of acceptance of evolutionary theory and an expanded perspective on interdisciplinary application of evolutionary theory, despite the fact that many students were not science majors.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12052-023-00188-4"
    },
    {
        "id": 23640,
        "title": "The Effect of Using the Project Based Learning (PjBL) Learning Model to Increase UPI YPTK Padang Students' Understanding of the Application of Basic Physics Courses",
        "authors": "Zakirman Zakirman",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "The linkage and coherence of Basic Physics material with material applications in real life is a new problem in Basic Physics lectures at Putra Indonesia University YPTK Padang. The purpose of this study was to see the effect of using the PjBL model to increase students' understanding of the application of the Basic Physics course. This type of research was a quasi-experimental involving a research sample of Informatics Engineering students at the Faculty of Computer Science UPI YPTK Padang who took the Basic Physics course in the 2019/2020 academic year. The sampling technique used is random sampling. In this study the sample class was divided into two categories, namely the experimental class of 51 students and the control class of 51 students. The instrument used is a work assessment sheet in the form of a portfolio. The data analysis technique used was an independent sample t-test, with prerequisite tests first being carried out, namely normality and homogeneity tests. Based on the results of the data analysis performed, the sig-2 tailed value for the independent sample t-test was 0.00 < of the value α = 0.05 . The conclusion from this study is that there are differences in student understanding between classes whose lectures use the PjBL model and classes that carry out conventional learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37630/jpm.v13i1.827"
    },
    {
        "id": 23641,
        "title": "Carbon-sequestration geosystems: A new paradigm for understanding geologic storage of CO2, with application to Southwest Ontario, Canada",
        "authors": "Bruce S. Hart",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijggc.2024.104071"
    },
    {
        "id": 23642,
        "title": "The application of new metrics for understanding trends in undiagnosed HIV among key populations",
        "authors": "Richard T. Gray, Hawa Camara, Laila Khawar, Andrew Grulich, Rebecca Guy, Skye McGregor, Nicholas Medland",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "\nObjective:\nInvestigate the utility of novel metrics for understanding trends in undiagnosed HIV.\n\n\nMethods:\nWe produced estimates for the number of people with undiagnosed HIV and the number of new HIV infections using Australian surveillance data and the European Centre for Disease Prevention and Control HIV modelling tool. Using these estimates, we calculated: the total diagnosed fraction, the proportion of all people with HIV diagnosed; the yearly diagnosed fraction, the proportion of people who have not yet received a diagnosis who received a diagnosis during each year; and the case detection rate, which is the annual ratio of new HIV diagnoses to new HIV infections each year; from 2008 to 2019. We report trends in these metrics for Australian-born and overseas-born men who reported male-to-male sex and heterosexual women and men.\n\n\nResults:\nEach metric for the Australian-born male-to-male sexual contact group improved consistently. In contrast, the metrics for the overseas-born group worsened (total diagnosed fraction: 85.0–81.9%, yearly diagnosed fraction: 23.1–17.8%, and case detection rate: 0.74–0.63). In heterosexuals, women and men had consistent increasing trends for the total diagnosed fraction and yearly diagnosed fraction but with women having consistently higher estimates. Heterosexual men had a declining case detection rate, falling to less than one in 2011, compared to an increase for women.\n\n\nConclusions:\nThe additional metrics provided important information on Australia's progress toward HIV elimination. The more dynamic changes in the undiagnosed population seen highlight diverging trends for key populations not seen in the total diagnosed fraction.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/qad.0000000000003630"
    },
    {
        "id": 23643,
        "title": "On the Understanding and Application of the Marital Property Division System",
        "authors": "Yi Wang",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "Article 1066 of the Civil Code of the People’s Republic of China reflects the legislative attitude towards the marital property division system: it provides more room for the application of the system under the premise of maintaining the stability of marital and family relations. Accordingly, the application of Article 1066 can be interpreted as follows: the prerequisite for division, i.e., the second paragraph of the legal grounds, should be expanded to include the case of \"one of the spouses himself or herself\" suffering from a serious illness; the object of division, i.e., the scope of the property to be divided, should be selected according to the plaintiff's claim, and a specific part of joint property or all joint property; after the division, during the marriage, the spouses should be allowed to choose to use the separate property system or continue to use the joint property system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ijeh.v8i2.7495"
    },
    {
        "id": 23644,
        "title": "Understanding the limitations and application of occupational exposure models in a REACH context",
        "authors": "Urs Schlüter, Andrea Spinazzè",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15459624.2023.2208188"
    },
    {
        "id": 23645,
        "title": "Digital Payments in Indonesia: Understanding the Effect of Application Security on User Trust",
        "authors": "Maheswara Rabbani, Juan Daniel Wijaya, Rendy Sanjaya Kusuma, Wilhelmus Billion Pius Purba, Robert Marchelino Tajib",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Technological developments present digital payment innovations for fast and practical transaction processes. Many digital wallets (e-wallet) services have emerged recently, becoming a trend in Indonesia. However, digital payments carry the risk of hacking user accounts, fraud (scams), phishing, and other criminal acts that aim to steal users' personal information. Financial is a sensitive issue; security is essential to digital payments. The research aims to analyze the effect of application security on user trust when making online transactions using digital payment applications. The study used a descriptive statistical method by distributing questionnaires to 50 Indonesians who have made electronic payments at least once for transactions. The study results show that application security significantly affects user trust in digital payments. Research results from various references show that application security influences impulse buying behavior and intentions to use e-wallet platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i5.3426"
    },
    {
        "id": 23646,
        "title": "Understanding Access and Utilization of Healthcare Services Among African Immigrant Women in the United States: the Application of Health Belief Model",
        "authors": "Gashaye Melaku Tefera",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11482-024-10283-3"
    },
    {
        "id": 23647,
        "title": "UNDERSTANDING CULTURAL VALUES IN THE JAVANESE COMMUNITY: KEY MESSAGES FROM UMAR KAYAM'S PARA PRIYAYI NOVEL",
        "authors": "Wijaya Heru Santosa, Anselmus Sudirman, Eka Yesi Yunianti",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "ABSTRACT \r\nThe objective of this research is to describe cultural values in the Javanese community as depicted in Umar Kayam’s novel entitled Para Priyayi. The data were collected through the critical reading of the novel, and the data analysis used Kluckhohn’s preliminary framework as developed further by Koentjaraningrat. The research results show that perceptions of Javanese nobles in the Dutch colonial era (Priyayis) closely relate to the nature of life, the nobles’ resignation to the will of God (rila), patience, and the willingness to accept (narima) because everything in the world is determined by God. Such perceptions deal with the work ethics through which Priyayis worked to find out wealth and power. Their perceptions of the nobility coincide with the sacred place and the place for recreation. In terms of time management, the nobles’ groups worked from morning until afternoon; they had flexi-time to relax on holidays. To build their relationship with superiors, they stayed respectful and loyal. In the royal family, they accommodated families who were economically deprived. Parents and older and younger siblings mutually respected each other. Colleagues kept their guards prosperous. Meanwhile, the Priyayis supported grassroots in need of help considerably.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/ijassh.v1i2.26414"
    },
    {
        "id": 23648,
        "title": "A better understanding of tunnel deformable supports: from analytical model to engineering application",
        "authors": "Kui Wu, Yuzhu Wang, Xiaomeng Zheng, Nannan Zhao",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s43452-024-00929-2"
    },
    {
        "id": 23649,
        "title": "The application of artificial intelligence in waste management: understanding the potential of data-driven approaches for the circular economy paradigm",
        "authors": "Federico Lanzalonga, Roberto Marseglia, Alberto Irace, Paolo Pietro Biancone",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "PurposeOur study examines how artificial intelligence (AI) can enhance decision-making processes to promote circular economy practices within the utility sector.Design/methodology/approachA unique case study of Alia Servizi Ambientali Spa, an Italian multi-utility company using AI for waste management, is analyzed using the Gioia method and semi-structured interviews.FindingsOur study discovers the proactive role of the user in waste management processes, the importance of economic incentives to increase the usefulness of the technology and the role of AI in waste management transformation processes (e.g. glass waste).Originality/valueThe present study enhances the circular economy model (transformation, distribution and recovery), uncovering AI’s role in waste management. Finally, we inspire managers with algorithms used for data-driven decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/md-10-2023-1733"
    },
    {
        "id": 23650,
        "title": "Understanding farmers’ adaptation to climate change: A protection motivation theory application",
        "authors": "Tina Sri Purwanti, Syafrial Syafrial, Wen-Chi Huang, Budi Hartono, Moh. Shadiqur Rahman, Jaisy Aghniarahim Putritamara",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/23311886.2023.2282210"
    },
    {
        "id": 23651,
        "title": "Assessment of undergraduate medical students' understanding and application of ethics: must do better",
        "authors": "Michael Trimble, Zuzana Deans, Greg Moorlock",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": " Current methods used to assess newly qualified doctors have limited ability to assess reasoning about complex issues. This editorial looks at the points this raises in relation to the new medical licensing assessment. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.12968/hmed.2023.0371"
    },
    {
        "id": 23652,
        "title": "Current understanding of disease control and its application in patients with chronic rhinosinusitis",
        "authors": "Jiahui Zhou, Fan Yuan, Tianhao Huang, Li Zhu, Dawei Wu",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "BackgroundDisease control is a primary treatment goal for patients with chronic rhinosinusitis (CRS). This study aims to summarize the evaluation parameters of disease control and then identify predictors of poorly controlled CRS.MethodsA systematic review of the literature was performed on PubMed, Google Scholar, Scopus, and Cochrane databases to identify studies relating to disease control in CRS.ResultsThe concept of disease control in patients with CRS involved the longitudinal assessment of the disease state and was also an important goal of treatment. As a metric of the disease state, the disease control reflected the ability to keep disease manifestations within certain limits, the efficacy after treatment, and the impact on quality of life. Validated measurements, such as EPOS2012 criteria, EPOS2020 criteria, Sinus Control Test, and patient/physician-reported global level of CRS control, have been utilized in clinical practice. These existing disease control instruments incorporated various disease manifestations and categorized patients into two (well-controlled and poor-controlled), three (uncontrolled, partly controlled, and controlled), or five (not at all, a little, somewhat, very, and completely) control categories. Eosinophilia, high computerized tomography score, bilateral sinonasal disease, asthma, allergic rhinitis, female gender, aspirin intolerance, revision surgery, low serum amyloid A, and specific T cell subtype would predict poorly controlled CRS.ConclusionThe concept of disease control and its application were gradually developed in patients with CRS. The existing disease control instruments demonstrated a lack of uniformity regarding the controlled criteria and included parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fcimb.2023.1104444"
    },
    {
        "id": 23653,
        "title": "The Application of Attribution Theory in Understanding Women Workers' Perception of Occupational Health and Safety in the Metal Industry: A Focus Group Investigation",
        "authors": "Serpil Aytac, Gizem Akalp",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "With the advent of the industrial revolution, women have become integral participants in the workforce, facing occupational risks similar to men. However, due to societal gender roles, women often encounter heightened psychosocial risk factors in the workplace, impacting both their attitudes towards work and societal roles. This study explores women workers' awareness of psychosocial risk factors within the Turkish metal industry. Employing attribution theories from social psychology, the study investigates negative attitudes towards occupational health and safety practices. Utilizing qualitative methods, data was gathered through focus group discussions with 155 female members of the Turkish Metal Union in Bursa, Turkey. The study evaluates factors such as job satisfaction, job stress, wellness, and relationships with coworkers and managers. Findings suggest that work stress and communication issues are significant psychosocial risk factors contributing to job dissatisfaction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62693/489zdo53"
    },
    {
        "id": 23654,
        "title": "Towards a Better Understanding of Fractional Brownian Motion and Its Application to Finance",
        "authors": "Yuanying Zhuang, Xiao Song",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractThe aim of this work is to first build the underlying theory behind fractional Brownian motion and applying fractional Brownian motion to financial market. By incorporating the Hurst parameter into geometric Brownian motion in order to characterize the long memory among disjoint increments, geometric fractional Brownian motion model is constructed to model S &P 500 stock price index. The empirical results show that the fitting effect of fractional Brownian motion model is better than ordinary Brownian motion.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40840-023-01546-7"
    },
    {
        "id": 23655,
        "title": "Application of Contextual Problems to Help Students Mathematic Understanding Ability in Science and Social Class Grades XI",
        "authors": "Fendy Reza Anin, Kurnia Putri Sepdikasari Dirgantoro",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "Learning mathematics aims to instill the ability to understand mathematics. This ability is important because it trains students to think deductively and realize the relationship between mathematical concepts in real life. Field facts prove that XI IPA IPS students from a private high school in the Lampung area have difficulty working on contextual questions as a result of their low ability to understand mathematics. The purpose of this research is to analyze the implementation of contextual questions in helping students' mathematical understanding abilities. The subjects in this study were 21 students of class XI IPA IPS at a private school in Lampung. The research method used is descriptive qualitative and data collection through written tests and interviews. The results of the study show that contextual questions can help students' mathematical understanding abilities. Through the results of this study, it is suggested that schools provide training in making contextual questions, teachers need to use contextual questions in learning, and further researchers expand the variables reviewed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31943/mathline.v8i2.376"
    },
    {
        "id": 23656,
        "title": "Extending and understanding: an application of machine learning to the World Bank's logistics performance index",
        "authors": "Ben Shepherd, Tanaporn Sriklay",
        "published": "2023-9-7",
        "citations": 2,
        "abstract": "PurposeThe authors extend the World Bank's Logistics Performance Index (LPI) for 30 additional countries and 13 additional years. The authors develop an inexpensive method for extending survey data when frequent, universal surveys are unavailable. The authors identify groups of country characteristics that influence LPI scores.Design/methodology/approachUsing data from the World Development Indicators—the broadest global dataset of country socioeconomic features—the authors test machine learning algorithms for their ability to predict the LPI. The authors examine importance scores to identify factors that influence LPI scores.FindingsThe best performing algorithm produces predictions on unseen data that account for nearly 90% of observed variation, and are accurate to within 6%. It performs twice as well as an OLS model with per capita income as the only predictor. Explanatory factors are business environment, economic structure, finance, environment, human development, and institutional quality.Practical implicationsMachine learning offers a simple, inexpensive way of extending the coverage of survey data. This dataset provides a richer picture of logistics performance around the world. The factors the authors identify as predicting higher LPI scores can help policymakers and practitioners target interventions.Originality/valueThis paper is one of the first applications of machine learning to extend coverage of an index based on an international survey. The authors use the new data to provide the most wide-ranging analysis of logistics performance across countries and over time. The output is an important resource for policymakers tracking performance, and researchers particularly in smaller and lower income countries. The authors also examine a wider range of explanatory factors for LPI scores than previous work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ijpdlm-06-2022-0180"
    },
    {
        "id": 23657,
        "title": "Development of Learning Animation Videos Using the Sparkol Videoscribe Application to Improve Students' Understanding of Mathematical Concepts at SMPS Sultan Iskandar Muda",
        "authors": " Edwin Gabril Sitepu,  Tiur Malasari Siregar",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "This study aims to obtain learning animation videos using the Sparkol videoscribe application which are valid, practical, effective, and can improve students' understanding of mathematical concepts. The trials carried out were individual, small group and field trials. The results of the study show that: (1) Video learning meets valid criteria with a percentage of 95% for media and 97% for material, (2) Video learning meets practicality criteria with a percentage of 87% for teacher responses and 90% for student responses, ( 3) The learning videos have fulfilled the effective criteria where: a) the learning completeness is 86%; b) more than 65% of students achieve 75% of the learning objectives for each indicator; c) Student response with a positive percentage of 87%. the ability to understand students' mathematical concepts on the gain test increased by 0.77.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/fjmr.v2i1.2592"
    },
    {
        "id": 23658,
        "title": "Application of Criminal Sanctions Against Indonesian National Army Soldiers Perpetrators of the Crime of Desertion",
        "authors": "Sapto Handoyo Djarkasih Putro, Nazaruddin Lathif, John P. Simanjuntak, Lilik Prihatini",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "Soldiers of the Indonesian National Army (abbreviated as TNI) have been specially prepared to guard, protect and defend the security and sovereignty of the Unitary State of the Republic of Indonesia (NKRI). In carrying out their duties, TNI members are limited by military laws and regulations, so that all actions they carry out must be based on applicable laws and regulations. In order to guarantee and support the implementation of the TNI's important roles and tasks, special regulations have been made that apply to TNI members, in addition to general regulations. In carrying out their duties and obligations towards the state, a member of the TNI is not immune from legal problems, for example there are members of the TNI who commit a crime, namely the crime of desertion. Dissertation is an act of withdrawing from carrying out TNI service obligations as regulated in Article 87 of the Military Criminal Code (KUHPM). The application of criminal sanctions in the criminal act of desertion committed by TNI soldiers intentionally in peacetime longer than 30 (thirty) days, then they can be sentenced as regulated in Article 87 paragraph (1) 2nd j uncto paragraph (2) KUHPM with a maximum threat of imprisonment of 2 (two) years and 8 (eight) months.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18415/ijmmu.v10i12.5398"
    },
    {
        "id": 23659,
        "title": "The Effectiveness of the Application of PhET with Inquiry Learning Model to Improve Understanding of the Concept",
        "authors": "U. Umiliya, A. Wati, I. Mahadi",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "PhET has many benefits as a means of instructional technology and media in the learning process, especially in Natural Sciences (IPA) subjects that require experimental activities. The study aimed to determine the effectiveness of using PhET simulations with inquiry learning models to increase students' conceptual understanding of static electricity. This type of research was quasi-experimental with a posttest-only control group design. The subjects were students of class IX at Public Junior High School (SMPN) 1 Tebing Tinggi for the 2022/2023 academic year. Data collection used concept comprehension question sheets that had been prepared by indicators of conceptual understanding and indicators of competency in static electricity material. The study showed the average value of the indicator in the experimental group was higher than the control group. This study concludes that learning using the inquiry learning model assisted by PhET simulation can facilitate students to learn independently, and students can conduct virtual experiments as an alternative solution to the limited facilities of the schools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21831/jser.v7i2.59148"
    },
    {
        "id": 23660,
        "title": "Development of a Web-Based E-Survey Application for Assessing Good Corporate Governance Understanding at PT. XYZ",
        "authors": " Cristian Richardo Anin,  Nia Ambarsari,  Sinung Suakanto",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "PT. XYZ is currently facing challenges in conducting their Good Corporate Governance (GCG) comprehension survey due to the manual distribution and collection of survey data using Google Drive and Microsoft Excel. To address this issue, the researcher proposes the development of a web-based E-Survey application to streamline the survey process. The development follows the waterfall model and utilizes the Laravel framework. To ensure its effectiveness, the application undergoes Load Testing to assess its performance with multiple users and User Acceptance Test (UAT) to evaluate its alignment with company requirements. The results indicate that the system operates optimally with up to 100 users and receives a favorable score on the System Usability Scale (SUS). This application provides a suitable solution for conducting comprehension surveys at PT. XYZ.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31849/digitalzone.v14i2.14792"
    },
    {
        "id": 23661,
        "title": "Socialization of Making Job Application Letters, Curriculum Vitae and Interview Preparation and Understanding Psychological Testing for High School Students",
        "authors": "Devi Marlita, Sinai Handayani, Erni Pratiwi Perwitasari",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "In order to carry out the tri dharma of higher education and As an effort to improve the quality of prospective senior high school graduates, the Trisakti Transportation and Logistics Institute research lecturer team was called upon to carry out this. Community Service by holding events whose topics are tailored to the needs of students as basic knowledge and preparation before entering the world of work. For this reason, educational institutions also pay special attention to prospective high school graduates who are expected to be ready and more confident when they enter the work industry. The method presented in the program above is through offline outreach and education, and the implementation of the activities will be carried out at State High Schools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/ajcs.v3i2.7971"
    },
    {
        "id": 23662,
        "title": "The Effect of Accounting Knowledge and Education Level on MSME Performance with the Application of Accounting Information Systems and Understanding of SAK EMKM as Intervening Variables",
        "authors": "Robiur Rahmat Putra, Syaka Nur Khalisa",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "This research uses accounting information systems and an understanding of SAK EMKM as intervening factors to evaluate and assess the impact of accounting knowledge and education level on the performance of MSMEs. 189 SMEs from the neighborhood of DKI Jakarta, particularly North Jakarta, made up the sample for this research. Hair's plan held that there were enough respondents. By uploading study questionnaires as Google forms and delivering them to MSME participants through social media, the data gathering strategy used simple random selection. The Smart PLS (Partial Least Square) software is employed in this study's data processing technique to evaluate the hypothesis. The findings of this research suggest that MSME actors should learn accounting in order to use accounting information systems to their business continuity in order to enhance their performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/owner.v7i4.1749"
    },
    {
        "id": 23663,
        "title": "A review of driver gaze estimation and application in gaze behavior understanding",
        "authors": "Pavan Kumar Sharma, Pranamesh Chakraborty",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108117"
    },
    {
        "id": 23664,
        "title": "Understanding the Constraints to the Correct Application of the Upward Continuation Operation in Gravity Data Processing",
        "authors": "Oluwatimilehin B. Balogun, Oluwatosin F. Akereke, Akachukwu D. Nwobodo",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00024-023-03348-1"
    },
    {
        "id": 23665,
        "title": "Fathom: Understanding Datacenter Application Network Performance",
        "authors": "Mubashir Adnan Qureshi, Junhua Yan, Yuchung Cheng, Soheil Hassas Yeganeh, Yousuk Seung, Neal Cardwell, Willem De Bruijn, Van Jacobson, Jasleen Kaur, David Wetherall, Amin Vahdat",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3603269.3604815"
    },
    {
        "id": 23666,
        "title": "The effects of flux on the radiation-induced embrittlement of reactor pressure vessel steels: review of current understanding and application to high fluences",
        "authors": "Susan Ortner, Paul Styman, Elliot Long",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "It is necessary to quantify the effects of flux on reactor pressure vessel steel embrittlement under neutron irradiation, if surveillance or high-flux test reactor data is used to predict vessel embrittlement occurring at lower fluxes. This is particularly important when considering embrittlement occurring during extended (60–80 years) operation for which there is no direct experience. Dedicated investigations are time-consuming and expensive even when only small flux-fluence ranges are investigated, so collating data from multiple campaigns is necessary to provide sufficient information to cover the wide range of fluxes required for vessel assessment in the long term. This paper collates and reviews such data. The review finds that flux dependences probably differ in sign and strength in different regimes (low flux and fluence, intermediate flux at low and high fluence, high flux at low and high fluence) with the regime limits affected by composition and temperature. The current understanding of diffusion processes and microstructural development are invaluable in interpreting the trends and limits. Many contradictory data sets were found, however, and not all contradictions could be dismissed as resulting from poor quality data. Suggestions are made for investigations to clarify the uncertainties. One wide-ranging model of flux effects, based on an extensive data set, is used to compare high-fluence data from different sources, to assess whether embrittlement rates accelerate after a high, threshold fluence. The model helps to identify experiments which investigated comparable flux-fluence-temperature regimes. The comparable data are split evenly between data sets supporting acceleration after a particular fluence and data sets contradicting it. The model identifies regimes in which further campaigns would clarify the causes of these contrasting observations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnuen.2024.1339222"
    },
    {
        "id": 23667,
        "title": "Application of a New Temperature Array System During Exploratory DST-TCP Operations for Greater Reservoir Understanding in a Cost-Effective and Environmentally friendly Manner",
        "authors": "H. Inukai, R. Yamada, M. A. Elkhazragi, Y. Kaipov, S. Sarac, F. Hollaender, M. Radwan",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "A new technology consisting of a distributed temperature array system has been deployed for the first-time during exploration drillstem testing (DST). It was successfully used to evaluate fluid movements across and into the tested formation throughout operations and helped characterize vertical heterogeneities in a complex carbonate reservoir without in-well intervention.\nThe distributed temperature array system was deployed to acquire temperature profile data during the entire sequence of drill-stem testing operations, from run in hole through perforation, stimulation, flow, and fluids re-injection operations. The data was acquired across and beyond the entire perforated interval. High-resolution temperature sensors were installed on the tubing conveyed perforating guns to provide an accurate temperature profile across the perforations. The sensors are resistant to high perforation shock and acidizing. The typical sequences of acid injection, subsequent fall-off, production and build-up during well testing create information-rich temperature transient responses in the wellbore that are used to evaluate the flow profile, leading to improved understanding of formation structure and properties.\nThe distributed temperature array system was successfully deployed in an exploration well in UAE to minimize rig time and costs, while providing new type of measurement for interpretation. The lack of well logs because of the drilling and completions approach made the need for additional information critical. Conventional operations would require three separate runs to perforate the reservoir, run the DST string and perform production logging operations. The distributed temperature array system allowed to deploy the DST/TCP string in a single run without having to resort to a dedicated wireline run for PLT, which saved 3 days of rig time as well as an additional flow sequence for PLT data acquisition, thus significantly reducing flared volumes. The temperature profiles acquired during the test showed several interesting characteristics not available before and provided unique insight. It demonstrated perforation success, provided a detailed timeline of acid stimulation operations, and highlighted the presence of a thief zone preventing acid from reaching deeper zones. The existence of that interval was further confirmed by the warmback sequence, showing a slower temperature recovery. The subsequent flowing periods confirmed this interpretation by showing clear temperature inflection points across zones having demonstrated acid intake and complemented the pressure transient analysis highlighting a typical fracture-dominated system response as well as other heterogeneities consistent with the temperature-based observations. The combination of pressure transient data with temperature profile provided insights that would not be obtainable through available data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-24455-ea"
    },
    {
        "id": 23668,
        "title": "Application of Short Video Semantic Understanding Technology Based on Big Data Analysis in Education Management",
        "authors": "Bingbing Yan, Chixiang Ma, Mingfei Wang, Ana Isabel Molina",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "With the emergence of short video and the development of mobile internet, short video software, such as TikTok and Kwai, has emerged. Based on the semantic understanding technology of teaching short videos, a teaching management platform was built to push healthy and positive short video for students' content in a targeted way. Taking the 21st grade students majoring in Chinese in Guizhou Normal University as an example, the authors discusses the effect of teaching management platform on college students. In this process, the following conclusions are drawn: (1) Among college students, the viewing rate of short videos has exceeded 95%, and short videos have become an indispensable entertainment for most college students. (2) Through short video semantic understanding technology and short video screening program, excellent short video can be effectively pushed to students. (3) The actual effect shows that the short video teaching management platform can effectively improve the values of the cultural level of students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijwltt.334708"
    },
    {
        "id": 23669,
        "title": "GC–MS-Olfactometric characterization of key odorants in rainbow trout by the application of aroma extract dilution analysis: Understanding locational and seasonal effects",
        "authors": "Nurten Cengiz, Gamze Guclu, Hasim Kelebek, Serkan Selli",
        "published": "2023-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.foodchem.2022.135137"
    },
    {
        "id": 23670,
        "title": "Impact of Problem-Based Learning on the Perception, Understanding, and Application of Statistical Concepts in Business Administration and Management Students",
        "authors": "Victoria Muerza, Pilar Gargallo, Manuel Salvador, Alberto Turón",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "We investigate the impact of the Problem-Based Learning (PBL) approach supplemented by student-created videos on the teaching of Probability Calculation and Inference Statistics in Business Administration and Management Studies. To that aim, we analyse survey results gathered from a sample of students from the Business Administration and Management and Law-Business Administration and Management degrees at the University of Zaragoza who participated in the PBL experience, focusing on their perceptions, skill development, dynamics of collaboration, and communication with teachers and classmates. Additionally, a comparative study of their final grades is conducted, comparing them with that obtained by students who did not engage in PBL. Our findings reveal that PBL significantly enhances students’ understanding and motivation, along with their communication with teachers, particularly among repeating students, and teamwork skills, particularly among beginners. Furthermore, students participating in PBL activities tended to achieve significantly higher grades than their nonparticipating counterparts did. Moreover, our study contributes to the discourse on sustainable education by highlighting the potential of PBL as a pedagogical approach aligned with the Sustainable Development Goals. By promoting active learning, collaborative problem solving, and communication skills, PBL fosters a culture of lifelong learning and empowers students to address real-world challenges in a sustainable manner. These findings have implications for educators, policymakers, and researchers seeking to promote sustainability in higher education through effective pedagogical practices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su16041591"
    },
    {
        "id": 23671,
        "title": "It “Made Me Who I Am”: Using Interpretive and Narrative Research to Develop a Model for Understanding Associate Deans’ Application and Development of Academic Identity",
        "authors": "Derek Stovin",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Interpretive and narrative research approaches, the experiences of academic administrators other than deans, chairs, and presi-dents, and academic identity work beyond graduate students and beginning professors are all areas that are underrepresented in the literature on higher educational administration. This article builds on recent narrative research by applying higher educational admin-istrative theories as interpretive lenses to propose a model for helping to understand the development and application of associate deans’ academic identities. Among the findings were that academic identities helped explain associate deans’ approaches to their roles, their views of their surrounding organizations, and their reasons for assuming the role. Further, the associate deans who partic-ipated in this research did not experience their transition to the role as an identity crisis in the ways typically described and assumed by higher educational leadership scholars. Instead, they drew upon their well-established academic identities and, in keeping with the nascent research on academic identity work, were intentional in their efforts to maintain their academic identities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47678/cjhe.vi0.189691"
    },
    {
        "id": 23672,
        "title": "Understanding Problem-Based Learning and its Application in Learning Mathematics Concepts Among Pre-Service Teachers",
        "authors": "Eric S. Boye, Douglas D. Agyei",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "Learning to teach mathematics has become crucial since its application in real life cannot go unmentioned. The desire of mathematics education researchers to make mathematics concepts easier for pre-service teachers to easily understand has attracted attention. This has become indispensable since after college, pre-service teachers are deployed from K-12 to assist learners in understanding mathematics concepts. The study aimed to ascertain how improvement in the learning of mathematics concepts using the Problem-based learning (PBL) approach could be understood and/or explained among pre-service teachers. This was viewed in two folds: how improvement in learning outcomes using the PBL approach could be explained; and how pre-service teachers’ disposition about the PBL could be explained/understood. Exploratory case study design involving qualitative and quantitative data was concurrently gathered and used. This involved the use of data collection instruments such as focus group discussion, pre-post-test scores, PBL observation protocol, and PBL disposition questionnaire. The study showed that the PBL method improved the learning of mathematics concepts among pre-service teachers. Pre-service teachers also showed a positive disposition (interest, belief, and attitude) toward the PBL intervention. The authors advocated for the conduct of a longitudinal study to understand the direction of change over time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12973/ejmse.5.1.51"
    },
    {
        "id": 23673,
        "title": "Understanding cancer drug resistance with Sleeping Beauty functional genomic screens: Application to MAPK inhibition in cutaneous melanoma",
        "authors": "Eliot Y. Zhu, Jacob L. Schillo, Sarina D. Murray, Jesse D. Riordan, Adam J. Dupuy",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.isci.2023.107805"
    },
    {
        "id": 23674,
        "title": "Application of exergy analysis in understanding the performance of a coal-fired steam power plant (120 mw) with single reheat and regenerative configuration",
        "authors": "Sankalp ARPIT, Pravin KUMAR, Prasanta Kumar DAS, Sukanta Kumar DASH",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "In the present paper, a rigorous analysis of a sub-critical steam power plant (120 MW) with reheating and regenerative configuration is presented, using energy and exergy analysis. The total work output from the power plant is 121.80 MW, which is close to the real value of 120 MW. The calculated energy efficiency of the steam power plant is 34.7%, while its exergy efficiency is 32%. In addition to it, energy analysis introduces the condenser as a major source of heat loss, on other hand, exergy analysis introduces the boiler as a major source of exergy destruction. Further to understand the effect of main steam temperature, reheating temperature and condenser pressure on the power plant, a parametric study is being conducted.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18186/thermal.1285229"
    },
    {
        "id": 23675,
        "title": "Rhodamine 6G salicylaldehyde hydrazone-Zn complex: Synthesis, characterization, photochromism, understanding, and application",
        "authors": "Ashok Mandi, Nandagopal Bar, Debrupa Biswas, Arindam Ray, Keya Ghosh, Dhrubajyoti Mondal, Gourab Kanti Das, Pranesh Chowdhury",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jlumin.2024.120611"
    },
    {
        "id": 23676,
        "title": "Understanding The Role of Trust Mediation in E-Government Adoption in Citizenship Administration Services Policies in Bantul Regency Using Disdukcapil Smart Application",
        "authors": "Arief Kurniawan, Rudy Hartanto, Achmad Djunaedi",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "<p>This study investigates the role of trust in the acceptance of e-government technologies using a modified Unified Model of Electronic Government Adoption (UMEGA) that includes trust as a mediating variable. This study involved 107 respondents from six subdistricts in Bantul Regency, focusing on the use of the <em>Disdukcapil</em> Smart application in e-government citizenship administration services. The findings indicate that performance expectancy, effort expectancy, and perceived security, which are managed by e-government providers, are the determinants of trust. Meanwhile, social influence and privacy risk, which are not managed by e-government providers, are disregarded. Facilitating conditions like citizen-owned infrastructure ease the use of system. The study confirms that trust level influences public participation in bureaucracy, as shown by behavioral intentions in using e-government.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.14203/stipm.2023.369"
    },
    {
        "id": 23677,
        "title": "Mathematical proving as a way to improve understanding the concepts of integral calculus application in digital era",
        "authors": " Lusiana, Nila Kesumawati",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0142759"
    },
    {
        "id": 23678,
        "title": "The Application of 7E Learning Cycle Model Based on Multiple Representations on Understanding the Concept of Classification and Communication Skills in Protist Learning Material",
        "authors": "Lifa Khalifatunnisa, Ibnul Mubarok",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "      The purpose of this study was to examine the effect of the 7E learning cycle model based on multiple representations on students understanding the concepts of classification and communication skills on Protist learning material. The research method uses a quasi-experimental design with a nonequivalent control group. The research sample is class X MIPA 4 and X MIPA 5 at MAN 02 Brebes. The data analysis technique used independent sample t-test. The results showed that understanding the classification concept and communication skills had a sig (2-tailed) value of 0.000 < 0.05 so that there was a significant difference in the average post-test scores and skill scores between the two classes. The percentage of understanding the concepts of classification in the experimental class was 33.33% (high) and 66.67% (medium), while the control class was 97.14% (medium) and 2.86% (low). The classical completeness of understanding the concept of classification in the experimental class was 16.67 %, while the control class was 0%. The percentage of communication skills in the experimental class is 75% (medium) and 25% (low), while the control class is 20% (medium) and 80% (low). The percentage of the implementation of the learning model in the experimental class based on observation was 100% (high), while the student questionnaire responses were 55.55% (high) and 44.45% (medium). Based on the research data, it can be concluded that the 7E learning cycle model based on multiple representations has a significant effect on understanding the concepts of classification and communication skills in Protist learning material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15294/jbe.v12i2.59432"
    },
    {
        "id": 23679,
        "title": "Cloud-IoT Application for Scene Understanding in Assisted Living: Unleashing the Potential of Image Captioning and Large Language Model (ChatGPT)",
        "authors": "Deema Abdal Hafeth, Gokul Lal, Mohammed Al-Khafajiy, Thar Baker, Stefanos Kollias",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dese60595.2023.10468995"
    },
    {
        "id": 23680,
        "title": "Contextualization of Religious Understanding in Preventing Radical Understanding",
        "authors": "Agus Mahfudin, Mochamad Samsukadi",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.2023.4.32784"
    },
    {
        "id": 23681,
        "title": "I Mind Map Application Needs Analysis to Improve Students' Mathematical Concept Understanding Ability",
        "authors": "Uun Pertiwi, Nanang Khuzaini, Beneditha Beneditha, Angeline Cristin, Felicya Clara",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "The ability to understand concepts is the mastery of the material in which students recognize, know, and are able to re-express concepts in a form that is easier to understand. However, students' conceptual understanding skills still tend to be low. So it takes teaching materials that integrate these abilities. For this reason, this study aims to analyze the need for teaching materials based on mind map applications to improve students' conceptual understanding skills. A mind map is a mind map in the form of a diagram that visually describes ideas, concepts, information, or other things. This type of research is descriptive qualitative. The research was conducted in one of the public junior high schools in Yogyakarta. The subjects in this study were 32 students of class IXA. Data collection techniques used interviews, concept understanding ability tests, and preliminary study questionnaires. While the data analysis technique uses the Miles and Huberman model which consists of data collection, data reduction, data presentation, and drawing conclusions. The results showed that teachers had not implemented mind map-assisted learning, students' conceptual understanding abilities tended to be low, students were interested in learning using mind map applications because students could develop ways of thinking and make them more active during learning",
        "keywords": "",
        "link": "http://dx.doi.org/10.55849/alhijr.v1i4.530"
    },
    {
        "id": 23682,
        "title": "Understanding NFV-Enabled Vehicle Platooning Application: A Dependability View",
        "authors": "Jing Bai, Yaru Li, Xiaolin Chang, Fumio Machida, Kishor S. Trivedi",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcc.2023.3286894"
    },
    {
        "id": 23683,
        "title": "Understanding Contract Cheating Behavior Among Indonesian University Students: An Application of the Theory of Planned Behavior",
        "authors": "Dina Heriyati, Reza Lidia Sari, Wulandari Fitri Ekasari, Sigit Kurnianto",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10805-023-09470-y"
    },
    {
        "id": 23684,
        "title": "HTA316 Understanding the Application of Various Statistical Analysis Methods to Inform Comparative Effectiveness of Ultra Orphan Treatments: A Review of NICE HST Guidance",
        "authors": "M. Siroula, J. Gupta, M.K. Siddiqui, S.K. Nielsen",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jval.2023.09.1999"
    },
    {
        "id": 23685,
        "title": "Effectiveness Test Application Lectora Inspire as Science Learning Media for Upgrade Concept understanding Student",
        "authors": "Agrielsa Alphasati Sinaga, Jumadi Jumadi, Suyanta Suyanta, Nina Khaerunnisa, Sri Rejeki",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "This study aim for test effectiveness application lectora inspire to understanding draft student. Research design this use design study quasi experiment with one group pretest posttest design. Sample in research this that is class VIII C with the number of 29 students and taking sample using cluster sampling technique. Instruments used is an instrument of understanding draft with material system digestion human. Data collection is carried out with use test understanding form concept _ pretest and posttest. Understanding results draft analyzed using paired sample t-test. Research results shows the average obtained of -13,428 that there is enhancement understanding draft participant educate. Then, application lectora inspire very effectiveness as learning media",
        "keywords": "",
        "link": "http://dx.doi.org/10.29303/jppipa.v9i6.2806"
    },
    {
        "id": 23686,
        "title": "The Understanding of Positive Youth Development in Sport and Its Application for Student-athletes",
        "authors": "Chang-Yong Jang Jang",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14385/kssp.34.1.77"
    },
    {
        "id": 23687,
        "title": "Patient-derived iPSC models of Friedreich ataxia: a new frontier for understanding disease mechanisms and therapeutic application",
        "authors": "Saumya Maheshwari, Gabriela Vilema-Enríquez, Richard Wade-Martins",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "AbstractFriedreich ataxia (FRDA) is a rare genetic multisystem disorder caused by a pathological GAA trinucleotide repeat expansion in the FXN gene. The numerous drawbacks of historical cellular and rodent models of FRDA have caused difficulty in performing effective mechanistic and translational studies to investigate the disease. The recent discovery and subsequent development of induced pluripotent stem cell (iPSC) technology provides an exciting platform to enable enhanced disease modelling for studies of rare genetic diseases. Utilising iPSCs, researchers have created phenotypically relevant and previously inaccessible cellular models of FRDA. These models enable studies of the molecular mechanisms underlying GAA-induced pathology, as well as providing an exciting tool for the screening and testing of novel disease-modifying therapies. This review explores how the use of iPSCs to study FRDA has developed over the past decade, as well as discussing the enormous therapeutic potentials of iPSC-derived models, their current limitations and their future direction within the field of FRDA research.\nGraphical abstract",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40035-023-00376-8"
    },
    {
        "id": 23688,
        "title": "Understanding the influence of news on society decision making: application to economic policy uncertainty",
        "authors": "Paul Trust, Ahmed Zahran, Rosane Minghim",
        "published": "2023-7",
        "citations": 1,
        "abstract": "AbstractThe abundance of digital documents offers a valuable chance to gain insights into public opinion, social structure, and dynamics. However, the scale and volume of these digital collections makes manual analysis approaches extremely costly and not scalable. In this paper, we study the potential of using automated methods from natural language processing and machine learning, in particular weak supervision strategies, to understand how news influence decision making in society. Besides proposing a weak supervision solution for the task, which replaces manual labeling to a certain extent, we propose an improvement of a recently published economic index. This index is known as economic policy uncertainty (EPU) index and has been shown to correlate to indicators such as firm investment, employment, and excess market returns. In summary, in this paper, we present an automated data efficient approach based on weak supervision and deep learning (BERT + WS) for identification of news articles about economical uncertainty and adapt the calculation of EPU to the proposed strategy. Experimental results reveal that our approach (BERT + WS) improves over the baseline method centered in keyword search, which is currently used to construct the EPU index. The improvement is over 20 points in precision, reducing the false positive rate typical to the use of keywords.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08438-8"
    },
    {
        "id": 23689,
        "title": "THE EFFECT OF TAXPAYER CONVENIENCE, TAXPAYER COMPLIANCE, AND UNDERSTANDING OF TAX REGULATIONS ON THE USE OF M-TAX APPLICATION SYSTEM SERVICES",
        "authors": "Balqis Alhusna Izzatulislam, Muhammad Nur, Kumba Digdowiseiso, Zaira Aniza Samsudin",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "The purpose of this study was to determine the effect of taxpayer convenience, taxpayer compliance, and understanding of tax regulations on the use of the M-tax application system services for individual taxpayers at the Pratama Jakarta Matraman Tax Service Office. The population in this study are all individual taxpayers who are actively registered and use the M-tax application at the Tax Office Pratama Jakarta Matraman. The sample selection was carried out using the Slovin formula because in this study the total population was known. Based on certain criteria carried out by the author, the total sample obtained was 99.8 which was then rounded up to 100 samples. The primary data collection method in this study used a questionnaire with direct distribution to individual taxpayers at Tax Office Pratama Jakarta Matraman and several taxpayers filled out the questionnaire link that was distributed. This research uses multiple linear regression analysis technique. Based on the results of the study, it is shown that the convenience of taxpayers and understanding of tax regulations affect the use of the M-tax application. While the taxpayer compliance variable has no effect on the use of the M-tax application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46799/jst.v5i2.916"
    },
    {
        "id": 23690,
        "title": "Differential learning assisted with SANTUY mobile application for improving students’ mathematical understanding and ability",
        "authors": "Euis Eti Rohaeti, Brian R. Evans, Toyo Wiyatno, Rully Charitas Indra Prahmana, Wahyu Hidayat",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Equations are often used in mathematics and other subjects, which means that a media can teach students how to solve equations, particularly linear equations of two variables, or Sistem Persamaan Linear Dua Variabel (SPLDV) as it is called in Indonesian, is needed. However, most teachers are still focused on developing the learning process and teaching materials rather than developing an application technology-based learning media. As we know that technology-based learning is currently the focus of teaching and learning activities in the digital era, especially learning after the pandemic. This study aimed to develop an application that can be a reference for teaching media in learning activities to improve students’ mathematical understanding and ability. The developed application is named, Integrated and Convenient Android-based Simulation or Simulasi Android Terpadu dan Nyaman, abbreviated as SANTUY. This development study with Analysis, Design, Development, Implementation, and Evaluation (ADDIE) model, explained in detail in the paper, took seventy-five subjects consisting of six expert validators, nine users, and sixty students. The expert validators comprised three media experts and three material experts. The evaluation stage involved students from two groups, each consisting of thirty students. The results showed that the average percentage of the feasibility of the SANTUY SPLDV solution simulation-assisted application with differential learning nuance was 79.62%, which means the application is adequate. The level of usefulness of the SANTUY SPLDV solution simulation-assisted application with differential learning nuance was 86.11%, which is categorized as “excellent”. In addition, using the SANTUY SPLDV application had a direct positive influence on improving students’ mathematical understanding and ability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22342/jme.v14i2.pp275-292"
    },
    {
        "id": 23691,
        "title": "The Influence of the Application and Understanding of SAK EMKM-Based Accounting on the Financial Statements of UMKM Pempek in Palembang City",
        "authors": "Ira Syafira, Leriza Desitama Anggraini, Andini Utari Putri",
        "published": "2023-3-5",
        "citations": 0,
        "abstract": "This study aims to analyze the influence of the application and understanding of accounting based on SAK EMKM on the financial statements of Small and Medium Enterprise. The data sources were primary data and data collection techniques were observation and questionnaires filled out by 50 units of Small and Medium Enterprise. The data were processed using multiple linear regression analysis. The application and understanding of SAK EMKM-based accounting have a positive effect on financial statement variables.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47747/ijcse.v4i1.1036"
    },
    {
        "id": 23692,
        "title": "Towards Multi-Sweep Ultrasound Video Understanding: Application in Detection of Breech Position Using Statistical Priors",
        "authors": "A. D. Gleed, D. Mishra, V. Chandramohan, Z. Fu, A. Self, S. Bhatnagar, A. T. Papageorghiou, J. A. Noble",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230662"
    },
    {
        "id": 23693,
        "title": "Modern understanding of the application of kinesiotaping in dental surgery",
        "authors": "Mikhail I. Shimorskiy, Natalya B. Korchazhkina, Аndrey M. Panin, Ekaterina V. Volosova",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "Currently, non-drug restorative therapy is becoming more and more popular and in demand. Doctors try to minimize the pharmacological load on the body and replace drugs with physiological analogues that are not inferior to them in effectiveness.\r\nDespite the extensive experience of using kinesiotapes after operations in other sections and areas of surgery, kinesiotaping in dentistry still remains poorly studied and, as a result, little used. There are no clear recommendations on the method of application and the duration of wearing kinesiotapes, as well as on the possibility of combining such applications with other methods of physiotherapy.\r\nThis article provides an overview of the possibility of using kinesiotaping by lymphatic drainage type after various surgical interventions in the oral cavity. This article includes publications from 2013 to 2020, which describe various methods and results of the use of kinesiotapes in dentistry and maxillofacial surgery.\r\nBased on the data of the studied literature and experience of using kinesiotaping by lymphatic drainage type after various surgical interventions in the oral cavity, it can be stated that this technique facilitates the postoperative period, reduces the severity of the pain component and has a good decongestant effect.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17816/rjpbr133604"
    },
    {
        "id": 23694,
        "title": "Utilization of Sky Map Application in Astronomy Learning of  Celestial Coordinates to Improve Students’ Understanding of Concepts and  Digital Literacy for Physics Education Students",
        "authors": "Nurulia Fajriani, Masturi Masturi",
        "published": "2023-3-18",
        "citations": 1,
        "abstract": "Using the Sky Map application in astronomy learning of celestial coordinates is intended to analyze students' level of understanding of concepts and digital literacy. Students' understanding of concepts and digital literacy was measured through tests and questionnaires. The research was focused on students who took astronomy courses in the physics department of Semarang State University, totaling 40 students. The type of research used is quantitative research. The research design carried out was pre-experimentation with one group pretest-posttest. There are two variables used, i.e. the use of Sky Map application media as the independent variable, and the improvement of the understanding of the student concept as the dependent variable. The analysis using the Wilcoxon signed rank test showed a significant increase in students' conceptual understanding after using Sky Map application media in learning with an N-Gain of 0.21, and digital literacy in the use of Sky Map application media has attained 83.47% (excellent). Therefore, it can be concluded that the use of Sky Map application media in celestial coordinates can help students understand the concept of the material as well as increase their digital literacy skills.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20527/bipf.v11i1.15603"
    },
    {
        "id": 23695,
        "title": "Differential and Functional Response Time Item Analysis: An Application to Understanding Paper versus Digital Reading Processes",
        "authors": "Sun‐Joo Cho, Amanda Goodwin, Matthew Naveiras, Jorge Salas",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "AbstractDespite the growing interest in incorporating response time data into item response models, there has been a lack of research investigating how the effect of speed on the probability of a correct response varies across different groups (e.g., experimental conditions) for various items (i.e., differential response time item analysis). Furthermore, previous research has shown a complex relationship between response time and accuracy, necessitating a functional analysis to understand the patterns that manifest from this relationship. In this study, response time data are incorporated into an item response model for two purposes: (a) to examine how individuals' speed within an experimental condition affects their response accuracy on an item, and (b) to detect the differences in individuals' speed between conditions in the presence of within‐condition effects. For these two purposes, by‐variable smooth functions are employed to model differential and functional response time effects by experimental condition for each item. This model is illustrated using an empirical data set to describe the effect of individuals' speed on their reading comprehension ability in two experimental conditions of reading medium (paper vs. digital) by item. A simulation study showed that the recovery of parameters and by‐variable smooth functions of response time was satisfactory, and that the type I error rate and power of the test for the by‐variable smooth function of response time were acceptable in conditions similar to the empirical data set. In addition, the proposed method correctly identified the range of response time where between‐condition differences in the effect of response time on the probability of a correct response were accurate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/jedm.12389"
    },
    {
        "id": 23696,
        "title": "Application of Digital Comic Media to Improve Student Understanding of Pancasila and Citizenship Education Subjects",
        "authors": "Ade Suherman, Mochamad Ghina Robbani, Jamilah Jamilah, Tetep Tetep",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.1-6-2023.2341438"
    },
    {
        "id": 23697,
        "title": "Conceptual Understanding in Static Fluid through the Recitation Program for Students at SMA Ar-Rohmah International Islamic Boarding School",
        "authors": "Alifiyah Nindi Maghfiroh, Febi Dwi Putri, Endang Purwaningsih, Muhammad Reyza Arief Taqwa",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "Conceptual understanding of physics is one of the important factors to improve the quality of learning physics. However, several studies have shown that student’s  conceptual understanding is low, especially in static fluid material. Several studies have attempted to use recitation programs and have succeeded in increasing understanding of the concept. Student's conceptual understanding can be improved through independent learning. Independent learning can use recitation programs, but not many available static fluid recitation programs are equipped with concept explanations and do not yet cover students who study in a formal and boarding school system, such as boarding school students. Existing recitation programs are widely used by students to support independent learning. Recitation of students is still rare because of the lack of independent learning. Therefore, this study aims to improve boarding school student’s conceptual understanding in static fluid material through recitation program. This research is quantitative research with a quasi-experimental and one group pretest-posttest design. The recitation program is given in the form of an interesting computer-assisted animation outside of learning. The subjects of this study were 40 students of class XI Natural Science 1 at the SMA International Islamic Boarding School Ar-Rohmah Dau, Malang. The research instruments included valid recitation programs and pretest-posttest questions. Data obtained from the results of the conceptual understanding test supported by interviews. The results showed that there was an increase in students' understanding of the concept which was calculated through an N-gain of 0.45 in the medium category and an effect-size of 1.68 in the strong category. The findings of this study imply that the recitation program can improve student's understanding of concepts like previous research, and practically that teachers can utilize the recitation program as student learning material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30736/seaj.v5i2.758"
    },
    {
        "id": 23698,
        "title": "DEVELOPING E-NIPA (EDUKASI NILAI PANCASILA) APPLICATION TO IMPROVE THE FIFTH-GRADE STUDENTS’ UNDERSTANDING  OF PANCASILA VALUES",
        "authors": "Sultan Ahmad, Atep Sujana, Rana Gustian Nugraha",
        "published": "2023-2-26",
        "citations": 0,
        "abstract": "This paper discusses the improvement of fifth-grade students’ understanding of Pancasila values by developing the e-NIPA (Edukasi Nilai Pancasila) application, which is an android application that is appropriate for students’ interests and abilities. This application can be operated by students without using an internet network. The research was conducted because the fifth-grade students did not understand Pancasila values in elementary school. The method used in the research is the R&D (Research and Development) method with the ADDIE (Analysis, Design, Development, Implementation, and Evaluation) development model. The research was conducted on fifth-grade students, which consisted of 21 students in one of the elementary schools in Sumedang City. The results of the research indicate that this product is feasible to use after applying the validation by media and material experts in the very good category with a percentage of 95.5%. The results of the research on the research subjects were processed using the Paired Sample T-test by comparing the results of the students’ average pretest and posttest scores, which begins with conducting a normality test on the data. The results imply that the data were normally distributed and there was a difference between the average students’ pretest and posttest scores and it was obtained that the students’ average scores increased at 38% based on N-gain. It implies that the e-NIPA application can improve students’ understanding of the values of Pancasila. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.33578/jpfkip.v12i1.9442"
    },
    {
        "id": 23699,
        "title": "The Understanding and Application of the Fair Responsibility in the Civil Code",
        "authors": "俊 包",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/ojls.2023.115505"
    },
    {
        "id": 23700,
        "title": "Assessing the impact of multimedia application on student conceptual understanding in Quantum Physics at the Rwanda College of Education",
        "authors": "Pascasie Nyirahabimana, Evariste Minani, Mathias Nduwingoma, Imelda Kemeza",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10639-023-11970-8"
    },
    {
        "id": 23701,
        "title": "Implementation of the Use of Social Media Through the Shopee Application in Understanding Consumer Behavior to Increase Sales of MSME Products",
        "authors": "Riya Rahmadani,  Wahyu, Khairin Dinawari Setiawan, Selvia Hernawati, Muhammad Hasan",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "Study This investigate how MSMEs use social media via Shopee for understand behavior consumers and improve sale product they. With approach qualitative and study case, research This use interview in depth and analysis Shopee social media content as tool data collection. Findings main involve variation experience user in shopping, role interaction consumers on Shopee social media, as well impact positive visual content in influence decision purchase. The result highlighting importance review positive and testimonial consumer in push purchase. Discussion study emphasize experience users, interaction strategies on social media, and their importance visual content for interesting interest consumer",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/fjss.v2i4.7178"
    },
    {
        "id": 23702,
        "title": "A Study on the Understanding and Application of White Portland Cement",
        "authors": "Dukyong Lee, Hyeonyeob Na, Suhyeon Park, Juil Eom",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Research direction of Cement manufacturers is that the trend of high-performance clinker production, which has increased the content of Alite (C<sub>3</sub>S) that dominate the initial strength of cement is intensifying. The content of Ferrite(C<sub>4</sub>AF) mineral of White Portland Cement is less than 1%. In the case of White Portland Cement, when applied to concrete, it is free to choose the color of the concrete structure and exhibits excellent aesthetics and reflectance, so it is highly valuable as an architectural and civil engineering material, but it has a disadvantage of being more expensive than Ordinary Portland Cement, and there is a limit to using the circulating resources used in Cement clinker firing process to express white. The characteristics and color differences of cement differ depending on the difference between the raw material and the manufacturing method. When manufacturing white cement, fuel used to implement white and materials with low heavy metals such as Fe, Cr, and Mn in the raw material are used, cooled to a reducing atmosphere and the cooling method produces white cement clinker by water cooling. Even in process facilities, more careful selection is required when selecting materials for grinding facilities and refractories in the firing process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31613/ceramist.2023.26.4.03"
    },
    {
        "id": 23703,
        "title": "Understanding the success of digital application-based postgraduate student independent learning",
        "authors": "Shapiah Shapiah, M. Ramli, Rusdiana Rusdiana, Tarwilah Tarwilah",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "An understanding of independent learning in universities that use technology-based learning is a critical study that must continue to be carried out. So, we have more than 100 further complications after the selection. We get 62 topics of discussion, which we then examine under a phenomenological approach to get relevant answers to problems such as successful learning in digital-based universities. In the study, we use data analysis, comprehensive data evaluation, and drawing valid conclusions in answering the final problem; after we have studied and discussed the results, we can conclude that from the books we have studied, on average, it is stated that the approach greatly assists independent learning among postgraduates with digital application-based learning. In other words, technology has made it easy for students to complete all their tasks and responsibilities while being postgraduate students, so the findings of this study are helpful in future studies of similar discussions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53730/ijssh.v7n1.13835"
    },
    {
        "id": 23704,
        "title": "Application Of Think Talk Write (TTW) Model Assisted By Geogebra To Improve Student’s Ability of Mathematical Concept Understanding In Class X of MAS PAB 2 Helvetia",
        "authors": "Ummu Habibah HK, Dian Armanto",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "The purpose of this study was to improve students' ability to understand mathematical concepts by applying Think Talk Write (TTW) using GeoGebra in class X MAS PAB 2 Helvetia in the 2022/2023 school year. The subjects were 36 students of class X MIA 1 MAS PAB 2 Helvetia. Data collection techniques used are teacher observation sheets, mathematical Concept Understanding ability tests, and documentation. Researcher used type of classroom action research (CAR). Preliminary tests result obtained 5 students (13.89%) completed with an average of 53,99% (lower). In the tests cycle I, 4 students (44,4%) completed with an average of 64,40% (low). In the test cycle II, 33 students (91,67%) were completed with an average of 88,02% (high). It can be concluded that the application of Think Talk Write (TTW) using GeoGebra can improve the ability to understand mathematical concepts of class X MAS PAB 2 Helvetia students",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/ajae.v2i1.2540"
    }
]