[
    {
        "id": 10905,
        "title": "Multivariate Time Series for Customs Revenue Forecasting Using LSTM Neural Networks",
        "authors": "Novan Dwi Cahyono, Surya Sumpeno, Eko Setiiadi",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitcom60176.2023.10442562"
    },
    {
        "id": 10906,
        "title": "Time Series Forecasting of Stock Market Volatility Using LSTM Networks",
        "authors": "D David Winster Praveenraj, Megha Pandey, Melvin Victor",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccakm58659.2023.10449596"
    },
    {
        "id": 10907,
        "title": "Time series forecasting of COVID-19 infections and deaths in Alpha and Delta variants using LSTM networks",
        "authors": "Farnaz Sheikhi, Zahra Kowsari",
        "published": "2023-10-20",
        "citations": 2,
        "abstract": "Since the beginning of the rapidly spreading COVID-19 pandemic, several mutations have occurred in the genetic sequence of the virus, resulting in emerging different variants of concern. These variants vary in transmissibility, severity of infections, and mortality rate. Designing models that are capable of predicting the future behavior of these variants in the societies can help decision makers and the healthcare system to design efficient health policies, and to be prepared with the sufficient medical devices and an adequate number of personnel to fight against this virus and the similar ones. Among variants of COVID-19, Alpha and Delta variants differ noticeably in the virus structures. In this paper, we study these variants in the geographical regions with different size, population densities, and social life styles. These regions include the country of Iran, the continent of Asia, and the whole world. We propose four deep learning models based on Long Short-Term Memory (LSTM), and examine their predictive power in forecasting the number of infections and deaths for the next three, next five, and next seven days in each variant. These models include Encoder Decoder LSTM (ED-LSTM), Bidirectional LSTM (Bi-LSTM), Convolutional LSTM (Conv-LSTM), and Gated Recurrent Unit (GRU). Performance of these models in predictions are evaluated using the root mean square error, mean absolute error, and mean absolute percentage error. Then, the Friedman test is applied to find the leading model for predictions in all conditions. The results show that ED-LSTM is generally the leading model for predicting the number of infections and deaths for both variants of Alpha and Delta, with the ability to forecast long time intervals ahead.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0282624"
    },
    {
        "id": 10908,
        "title": "Time Time Series Forecasting of Stock Price for Maritime Shipping Company in COVID-19 Period Using Multi-Step Long Short-Term Memory (LSTM) Networks",
        "authors": "Ahmad Ghareeb",
        "published": "2023-7-1",
        "citations": 1,
        "abstract": "Abstract\nSea transportation is one of the most critical components of the global economy, where it is the main means of transporting huge quantities of goods across the world. The coronavirus disease (COVID-19) has caused a health-related economic crisis at the global level with widespread repercussions on sea transportation and trade. Several algorithms in machine learning and/or deep learning have been suggested as a simplification of this hard problem of stock price index forecasting, which has been the focus of much study for many years. In this study, I will propose a forecasting method based on Multi-Step Long Short-Term Memory (MS LSTM) networks to predict stock prices for three of the most important companies in the world in maritime transport. A novel optimization method for stock price prediction is proposed. It is based on a Multi-Step Long Short-Term Memory (MS LSTM) model and utilizes the Adam optimizer. Conclusions showed that using the MS LSTM algorithm, 95.44% prediction accuracy on the training data set and 95.11% prediction accuracy on the testing data set were both obtained. For the training set and testing set, respectively, it was observed that the mean absolute percentage error is 4.56% and 4.89%. By running the predictions for five days in the future, it is observed that the model has predicted that the prices would maintain their balance with little downward movement, leading to positive impact on sea shipping with lower prices expected.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/picbe-2023-0154"
    },
    {
        "id": 10909,
        "title": "Analysis of Website Traffic Time Series Forecasting using ARIMA, Prophet, and LSTM RNN",
        "authors": "Suraj Katwal, Rubim Shrestha, Gajendra Sharma",
        "published": "2024-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47119/ijrp1001461420246271"
    },
    {
        "id": 10910,
        "title": "Multivariate Time Series Forecasting Based on Fuzzy Information Granulation and LSTM",
        "authors": "Dan Zhao, Huorong Ren",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicn59530.2023.10393574"
    },
    {
        "id": 10911,
        "title": "Strategies of Multi-Step-ahead Forecasting for Chaotic Time Series using Autoencoder and LSTM Neural Networks: A Comparative Study",
        "authors": "Ngoc Phien Nguyen, Tuan Anh Duong, Platos Jan",
        "published": "2023-1-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3582177.3582187"
    },
    {
        "id": 10912,
        "title": "Forecasting COVID-19 Pandemic using Prophet, LSTM, hybrid GRU-LSTM, CNN-LSTM, Bi-LSTM and Stacked-LSTM for India",
        "authors": "Satya Prakash, Anand Singh Jalal, Pooja Pathak",
        "published": "2023-3-3",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112065"
    },
    {
        "id": 10913,
        "title": "NOA-LSTM: An efficient LSTM cell architecture for time series forecasting",
        "authors": "Hemant Yadav, Amit Thakkar",
        "published": "2024-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122333"
    },
    {
        "id": 10914,
        "title": "Forecasting the Stability of COVID-19 Vaccine Companies Stock Market using LSTM and Time-series Models",
        "authors": "Rahemeen Khan, Safia Baloch",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/c-code58145.2023.10139884"
    },
    {
        "id": 10915,
        "title": "Multivariate Time Series Sensor Feature Forecasting Using Deep Bidirectional LSTM",
        "authors": "B. Sirisha, Surakanti Naveena, Greeshma Palanki, Pottipally Snehaa",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.116"
    },
    {
        "id": 10916,
        "title": "Time Series Forecasting using LSTM and ARIMA",
        "authors": "Khulood Albeladi, Bassam Zafar, Ahmed Mueen",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140133"
    },
    {
        "id": 10917,
        "title": "Forecasting Global Monkeypox Infections Using LSTM: A Non-Stationary Time Series Analysis",
        "authors": "Omnia M. Osama, Khder Alakkari, Mostafa Abotaleb, El-Sayed M. El-Kenawy",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceem58740.2023.10319532"
    },
    {
        "id": 10918,
        "title": "Time series forecasting of precipitation patterns over Lucknow region using LSTM",
        "authors": " Devasheesh Krishan,  Amrendra Singh",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Rainfall forecasting has assumed an important role in recent times due to uncertainities emanating from climate change as a result of environmental phenomenons like El Nino, La Nina, global warming, etc. Agriculture in India is still pretty much dependent upon rains, more so in a state like Uttar Pradesh. So it is imperative that forecasting systems are developed that can analyse the previous trends of rainfall and predict accordingly the future values of rain. The existing statistical models that forecast rain are too complex and also not cost effective. Hence we take the approach of a machine learning model, or to further specify, a deep learning model called Long Short Term Memory (LSTM) to try and predict with some accuracy. This study examines the precipitation patterns over the Lucknow region for a period of 20 years, with the dates ranging from 1st January, 2000 to 31st December, 2019. The accuracy of the LSTM model developed is judged on the basis of Mean Absolute Percentage Error (MAPE), R-square (R2) and Root Mean Squared Error (RMSE) values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30574/wjarr.2023.20.1.2069"
    },
    {
        "id": 10919,
        "title": "Developing An Interactive Web-Based Time Series Forecasting System With Deep Learning And LSTM For Student Enrollment Using Dash",
        "authors": "Hassan Bousnguar, Lotfi Najdi, Amal Battou",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jrtdd.v6i10s(2).2214"
    },
    {
        "id": 10920,
        "title": "Time Series Forecasting Using LSTM Applied for Commodity Futures Price in Latin America",
        "authors": "Gabriel Schneider de Jesus, Aurélio Faustino Hoppe, Andreza Sartori, Anne Carolina Rodrigues Klaar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4352469"
    },
    {
        "id": 10921,
        "title": "Investigation of Load, Solar and Wind Generation as Target Variables in LSTM Time Series Forecasting, Using Exogenous Weather Variables",
        "authors": "Thomas Shering, Eduardo Alonso, Dimitra Apostolopoulou",
        "published": "2024-4-11",
        "citations": 0,
        "abstract": "Accurately forecasting energy metrics is essential for efficiently managing renewable energy generation. Given the high variability in load and renewable energy power output, this represents a crucial area of research in order to pave the way for increased adoption of low-carbon energy solutions. Whilst the impact of different neural network architectures and algorithmic approaches has been researched extensively, the impact of utilising additional weather variables in forecasts have received far less attention. This article demonstrates that weather variables can have a significant influence on energy forecasting and presents methodologies for using these variables within a long short-term memory (LSTM) architecture to achieve improvements in forecasting accuracy. Moreover, we introduce the use of the seasonal components of the target time series, as exogenous variables, that are also observed to increase accuracy. Load, solar and wind generation time series were forecast one hour ahead using an LSTM architecture. Time series data were collected in five Spanish cities and aggregated for analysis, alongside five exogenous weather variables, also recorded in Spain. A variety of LSTM architectures and hyperparameters were investigated. By tuning exogenous weather variables, a 33% decrease in mean squared error was observed for solar generation forecasting. A 22% decrease in mean absolute squared error (MASE), compared to 24-h ahead forecasts made by the Transmission Service Operator (TSO) in Spain, was also observed for solar generation. Compared to using the target variable in isolation, utilising exogenous weather variables decreased MASE by approximately 10%, 15% and 12% for load, solar and wind generation, respectively. By using the seasonal component of the target variables as an exogenous variable itself, we demonstrated decreases in MASE of 19%, 12% and 8% for load, solar and wind generation, respectively. These results emphasise the significant benefits of incorporating weather and seasonal components into energy-related time series forecasts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en17081827"
    },
    {
        "id": 10922,
        "title": "Time-Series Forecasting Using Continuous Variables-Based Quantum Neural Networks",
        "authors": "Prabhat Anand, M Girish Chandra, Ankit Khandelwal",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets59351.2024.10427192"
    },
    {
        "id": 10923,
        "title": "Testing Variants of LSTM Networks for a Production Forecasting Problem",
        "authors": "Nouf Alkaabi, Sid Shakya, Rabeb Mizouni",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012186100003595"
    },
    {
        "id": 10924,
        "title": "Interval Forecasting Method of Aggregate Output for Multiple Wind Farms Using LSTM Networks and Time-Varying Regular Vine Copulas",
        "authors": "Yanwen Wang, Yanying Sun, Yalong Li, Chen Feng, Peng Chen",
        "published": "2023-5-17",
        "citations": 3,
        "abstract": "Interval forecasting has become a research hotspot in recent years because it provides richer uncertainty information on wind power output than spot forecasting. However, compared with studies on single wind farms, fewer studies exist for multiple wind farms. To determine the aggregate output of multiple wind farms, this paper proposes an interval forecasting method based on long short-term memory (LSTM) networks and copula theory. The method uses LSTM networks for spot forecasting firstly and then uses the forecasting error data generated by LSTM networks to model the conditional joint probability distribution of the forecasting errors for multiple wind farms through the time-varying regular vine copula (TVRVC) model, so as to obtain the probability interval of aggregate output for multiple wind farms under different confidence levels. The proposed method is applied to three adjacent wind farms in Northwest China and the results show that the forecasting intervals generated by the proposed method have high reliability with narrow widths. Moreover, comparing the proposed method with other four methods, the results show that the proposed method has better forecasting performance due to the consideration of the time-varying correlations among multiple wind farms and the use of a spot forecasting model with smaller errors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/pr11051530"
    },
    {
        "id": 10925,
        "title": "Technological forecasting based on estimation of word embedding matrix using LSTM networks",
        "authors": "Necip Gozuacik, C. Okan Sakar, Sercan Ozcan",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.techfore.2023.122520"
    },
    {
        "id": 10926,
        "title": "Attention-Ordering LSTM for Financial Time Series Forecasting",
        "authors": "Jincheng Li, Linli Zhou, Liangtu Song",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icemce60359.2023.10490775"
    },
    {
        "id": 10927,
        "title": "Advanced LSTM-Based Time Series Forecasting for Enhanced Energy Consumption Management in Electric Power Systems",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20508/ijrer.v14i1.14561.g8868"
    },
    {
        "id": 10928,
        "title": "LSTM with Bayesian Slide Optimization for Time Series Forecasting in Real Time",
        "authors": "A Poornima, K Archana, P Dhivya, N Sangavi",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscds56580.2023.10104650"
    },
    {
        "id": 10929,
        "title": "Empirical Mode Decomposition with Envelope Extraction and LSTM for univariate time series forecasting",
        "authors": "Mohamed NDIAYE, Mamadou MBOUP",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00070"
    },
    {
        "id": 10930,
        "title": "Time-series forecasting of consolidation settlement using LSTM network",
        "authors": "Seongho Hong, Seok-Jun Ko, Sang Inn Woo, Tae-Young Kwak, Sung-Ryul Kim",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-05219-7"
    },
    {
        "id": 10931,
        "title": "Horizontal Divide and Conquer Methods for Non-Linear Time Series Forecasting Using LSTM-ANN; a Comparative Study Based on Simulated Data",
        "authors": "Navoda Hettige, WMND Basnayake",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12691/ajams-11-2-4"
    },
    {
        "id": 10932,
        "title": "Dynamic personalized human body energy expenditure: Prediction using time series forecasting LSTM models",
        "authors": "Victoria M. Perez Cortes, Arnab Chatterjee, Dolaana Khovalyg",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2023.105381"
    },
    {
        "id": 10933,
        "title": "Forecasting Time Series of Financial Indicators Using Artificial Neural Networks",
        "authors": "Savostyanov Aleksandr, Grineva Natalia, Stroeva Ekaterina",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsd58227.2023.10304040"
    },
    {
        "id": 10934,
        "title": "Time Series Forecasting Based on ARIMA and LSTM Models",
        "authors": "Zhengzhe Cheng, Hanyi Xu, Yuetong Wang, Hao Zhou",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00076"
    },
    {
        "id": 10935,
        "title": "RESEARCH ON METHODS OF FORECASTING TIME SERIES IN TRANSPORT USING RECURRENT NEURAL NETWORKS",
        "authors": "G.M. Lysov, F.N. Prikhodko, A.A. Konovalova, K.A. Timoshenko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.51691/2541-8327_2023_1_6"
    },
    {
        "id": 10936,
        "title": "Combining Forecasts of Time Series with Complex Seasonality Using LSTM-Based Meta-Learning",
        "authors": "Grzegorz Dudek",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039053"
    },
    {
        "id": 10937,
        "title": "Time series forecasting of electricity consumption using hybrid model of recurrent neural networks and genetic algorithms",
        "authors": "Ali Hussein, Mohammed Awad",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.meaene.2024.100004"
    },
    {
        "id": 10938,
        "title": "Time Series Forecasting with Missing Data Using Generative Adversarial Networks and Bayesian Inference",
        "authors": "Xiaoou Li",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "This paper tackles the challenge of time series forecasting in the presence of missing data. Traditional methods often struggle with such data, which leads to inaccurate predictions. We propose a novel framework that combines the strengths of Generative Adversarial Networks (GANs) and Bayesian inference. The framework utilizes a Conditional GAN (C-GAN) to realistically impute missing values in the time series data. Subsequently, Bayesian inference is employed to quantify the uncertainty associated with the forecasts due to the missing data. This combined approach improves the robustness and reliability of forecasting compared to traditional methods. The effectiveness of our proposed method is evaluated on a real-world dataset of air pollution data from Mexico City. The results demonstrate the framework’s capability to handle missing data and achieve improved forecasting accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info15040222"
    },
    {
        "id": 10939,
        "title": "Multi-Step Long-Short Term Memory (LSTM) Time Series Ocean Waves Forecasting Model for Wave Energy Converters (WEC)",
        "authors": "Saqib Iqbal, Kamyar Mehran",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecce53617.2023.10362250"
    },
    {
        "id": 10940,
        "title": "Convolutional and LSTM Neural Networks for Solar Power Forecasting",
        "authors": "Gavin Fungtammasan, Irena Koprinska",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191813"
    },
    {
        "id": 10941,
        "title": "Time Series Forecasting of Air Pollutant PM2.5 Using Transformer Architecture",
        "authors": "K. Azhahudurai, V. Veeramanikandan",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231125192357"
    },
    {
        "id": 10942,
        "title": "Anomaly Detection on Time Series Sensor Data Using Deep LSTM-Autoencoder",
        "authors": "Stephen Githinji, Ciira Wa Maina",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/africon55910.2023.10293676"
    },
    {
        "id": 10943,
        "title": "Forecasting of PM2.5 concentration time series based on SSA-LSTM model",
        "authors": "Yueyi Zhang, Di He, Qingyue Wu",
        "published": "2023-1-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2656939"
    },
    {
        "id": 10944,
        "title": "Time series forecasting of stock market using ARIMA, LSTM and FB prophet",
        "authors": "Asha Sunki, C. SatyaKumar, G. Surya Narayana, Vinith Koppera, Manish Hakeem",
        "published": "2024",
        "citations": 0,
        "abstract": "Considering turbulent character, predicting the future stocks of a company is a difficult endeavor. The goal of this study is to analyze the performance of three widely used forecasting methods: ARIMA, LSTM, and FBProphet. ARIMA is a time series data statistical model that captures linear relationships and stationarity. Recurrent neural networks, such as LSTM, are able to recognize nonlinear patterns and long-term dependencies. FB Prophet is a Facebook-developed time series forecasting library that use an additive regression model to account for trend, seasonality, and holiday impacts. The results show that each strategy has advantages and disadvantages in projecting stock market values. When the underlying data is steady and linear, ARIMA works well. In contrast, LSTM excels in capturing nonlinear and complicated relationships. FB Prophet performs admirably when dealing with trend and seasonality patterns.This study examines the performance of ARIMA, LSTM, and FB Prophet in stock market forecasting, allowing practitioners to choose the best approach depending on the peculiarities of their data and forecasting objectives. Further study might look at ensemble methods or hybrid approaches that combine the capabilities of these techniques to increase stock market forecast accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/matecconf/202439201163"
    },
    {
        "id": 10945,
        "title": "AI-driven improvement of monthly average rainfall forecasting in Mecca using grid search optimization for LSTM networks",
        "authors": "Fehaid Alqahtani",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "Abstract\n\nPredicting the average monthly rainfall in Mecca is crucial for sustainable development, resource management, and infrastructure protection in the region. This study aims to enhance the accuracy of long short-term memory (LSTM) deep regression models used for rainfall forecasting using an advanced grid-search-based hyperparameter optimization technique. The proposed model was trained and validated on a historical dataset of Mecca's monthly average rainfall. The model's performance improved by 5.0% post-optimization, reducing the root-mean-squared error (RMSE) from 0.1201 to 0.114. The results signify the value of grid search optimization in improving the LSTM model's accuracy, demonstrating its superiority over other common hyperparameter optimization techniques. The insights derived from this research provide valuable input for decision-makers in effectively managing water resources, mitigating environmental risks, and fostering regional development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2166/wcc.2024.242"
    },
    {
        "id": 10946,
        "title": "REAL-TIME FORECASTING OF KEY COKING COAL QUALITY PARAMETERS USING NEURAL NETWORKS AND ARTIFICIAL INTELLIGENCE",
        "authors": "Artur Dyczko",
        "published": "2023",
        "citations": 2,
        "abstract": "High quality coke is a key raw material for the metallurgical industry. The characteristics of the coal have a significant influence on the parameters of the coke produced and, consequently, on the valuation of coal deposits and the economic assessment of mining projects. Predicting the quality of coking coal allows for the optimisation of production processes, including the planning and management of operations and the early detection of quality problems. In this study, using the principles of a smart mine, it is proposed to determine the quality of coal based on the combination of mining and geological conditions of mineral deposits and its quality indicators. Possible interrelationships between the quality of the coal in the deposit and the characteristics of the final product have been identified. A neural network is used to determine the priority of individual indicators that have a significant impact on the quality of coking coal. An important part of the research is its practical implementation in the conditions of the Jastrzębska Spółka Węglowa SA. Qualitative and quantitative parameters of coking coals were obtained for each mine of the region by the method of sampling and statistical processing of data such as: degree of metamorphism, thickness, deviation of volatile substances, presence of phosphorus, ash content, etc. For their evaluation, the Group Method of Data Handling was used to compare the factors of quality indicators depending on the priority of influence on the final characteristics of the coking coal. Based on the results obtained, it is shown that not all coal quality indicators have a significant impact on the quality of the final product. The study shows that it is possible to predict the main indicators (CRI – Coke Reactivity Index, CSR – Coke Strength after Reaction) of coke quality using neural networks based on a larger number of coal quality parameters and to eliminate parameters that have virtually no influence on the value of the final product. This method can also be used to improve the results of economic valuation of a deposit and to better plan exploration and mining operations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17794/rgn.2023.3.9"
    },
    {
        "id": 10947,
        "title": "Comparing ARIMA, Linear Regression, Random Forest, and LSTM for Time Series Forecasting: A Study on Item Stock Predictions",
        "authors": "Bommireddi Nagendra, Ghanapriya Singh",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353372"
    },
    {
        "id": 10948,
        "title": "1NN-DTW ARIMA LSTM: A new ensemble for forecasting multi-domain/multi-context time series",
        "authors": "Hadi Fanaee-T",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsaa60987.2023.10302624"
    },
    {
        "id": 10949,
        "title": "Multiple Production Time Series Forecasting Using Deepar and Probabilistic Forecasting",
        "authors": "JiangXia Han, Liang Xue",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Abstract\nThe majority of production forecasting methods currently used are point forecasting methods developed in the setting of individual well forecasting. For an actual oilfield, instead of needing to predict individual production time series, one is faced with forecasting thousands of related time series and the uncertainty can be assessed. The objective of this work is to enable global modeling and probabilistic forecasting of a large number of related production time series using Deep Autoregressive Recurrent Neural Networks (DeepAR). The DeepAR model consists of three parts. First, the auxiliary data such as static classification covariates and dynamic covariates are encoded. Second, establish a forward model based on an autoregressive recurrent neural network. Third, the normal distribution is defined as the output distribution function. And the variance and mean are obtained by solving the maximum log-likelihood function using the gradient descent algorithm. We demonstrate how the application of DeepAR to forecasting can overcome many of the challenges(e.g. frequent well shut-in and opening, probabilistic prediction, classification prediction) that are faced by widely-used classical approaches to the problem. In this work, history fitting and prediction were performed on a dataset from more than 2000 tight gas reservoir wells in the Ordos Basin, China. The DeepAR and conventional methods were tested and compared based on the datasets. We show through extensive empirical evaluation on several real-world forecasting data sets accuracy improvements of around 30% compared to RNN-based networks. In the case of frequent well shut-ins and openings, the RNN-based network structure cannot capture the fast pressure response and extreme fluctuations, which eventually leads to high errors. In contrast, DeepAR is more stable to frequent or significant well variations, can learn different dynamic and static category features, generates calibrated probabilistic forecasts with high accuracy, and can learn complex patterns such as seasonality and uncertainty growth over time from the data. This study provides more general production forecasting and analysis of production dynamics methods from a big data perspective. Instead of performing costly well tests or shut-ins, reservoir engineers can extract valuable long-term reservoir performance information from predictions estimated by DeepAR trained on an extensive collection of related production time series data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/214769-ms"
    },
    {
        "id": 10950,
        "title": "AB-LSTM: Attention Bidirectional Long Short-Term Memory for Multivariate Time-Series Forecasting",
        "authors": "Xiaofeng Zhou, Andri Pranolo, Yingchi Mao",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2e357697.2023.10262559"
    },
    {
        "id": 10951,
        "title": "Network time series forecasting using spectral graph wavelet transform",
        "authors": "Kyusoon Kim, Hee-Seok Oh",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijforecast.2023.08.006"
    },
    {
        "id": 10952,
        "title": "DAFA-BiLSTM: Deep Autoregression Feature Augmented Bidirectional LSTM network for time series prediction",
        "authors": "Heshan Wang, Yiping Zhang, Jing Liang, Lili Liu",
        "published": "2023-1",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.009"
    },
    {
        "id": 10953,
        "title": "Retracted: An Economic Forecasting Method Based on the LightGBM-Optimized LSTM and Time-Series Model",
        "authors": "",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9876321"
    },
    {
        "id": 10954,
        "title": "Incorporating air temperature into mid-term electricity load forecasting models using time-series regressions and neural networks",
        "authors": "Niaz Bashiri Behmiri, Carlo Fezzi, Francesco Ravazzolo",
        "published": "2023-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.127831"
    },
    {
        "id": 10955,
        "title": "SATNet: Upgraded LSTM Network For Mining Time Series Correlation Utilizing The Self-Attention Mechanism",
        "authors": "Xiangyu Dai, Quan Zou",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191490"
    },
    {
        "id": 10956,
        "title": "An adaptive embedding procedure for time series forecasting with deep neural networks",
        "authors": "Federico Succetti, Antonello Rosato, Massimo Panella",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.051"
    },
    {
        "id": 10957,
        "title": "Rainfall Forecasting for Silchar City using Stacked- LSTM",
        "authors": "Sounak Majumdar, Saroj Kr. Biswas, Biswajit Purkayastha, Saptarsi Sanyal",
        "published": "2023-2-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iemecon56962.2023.10092355"
    },
    {
        "id": 10958,
        "title": "Time Series Forecasting Based on Deep Learning CNN-LSTM-GRU Model on Stock Prices",
        "authors": "Ghani Rizky Naufal, Antoni Wibowo",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/22315381/ijett-v71i6p215"
    },
    {
        "id": 10959,
        "title": "Deep belief improved bidirectional LSTM for multivariate time series forecasting",
        "authors": "Keruo Jiang, Zhen Huang, Xinyan Zhou, Chudong Tong, Minjie Zhu, Heshan Wang",
        "published": "2023",
        "citations": 2,
        "abstract": "<abstract> <p>Multivariate time series (MTS) play essential roles in daily life because most real-world time series datasets are multivariate and rich in time-dependent information. Traditional forecasting methods for MTS are time-consuming and filled with complicated limitations. One efficient method being explored within the dynamical systems is the extended short-term memory networks (LSTMs). However, existing MTS models only partially use the hidden spatial relationship as effectively as LSTMs. Shallow LSTMs are inadequate in extracting features from high-dimensional MTS; however, the multilayer bidirectional LSTM (BiLSTM) can learn more MTS features in both directions. This study tries to generate a novel and improved BiLSTM network (DBI-BiLSTM) based on a deep belief network (DBN), bidirectional propagation technique, and a chained structure. The deep structures are constructed by a DBN layer and multiple stacked BiLSTM layers, which increase the feature representation of DBI-BiLSTM and allow for the model to further learn the extended features in two directions. First, the input is processed by DBN to obtain comprehensive features. Then, the known features, divided into clusters based on a global sensitivity analysis method, are used as the inputs of every BiLSTM layer. Meanwhile, the previous outputs of the shallow layer are combined with the clustered features to reconstitute new input signals for the next deep layer. Four experimental real-world time series datasets illustrate our one-step-ahead prediction performance. The simulating results confirm that the DBI-BiLSTM not only outperforms the traditional shallow artificial neural networks (ANNs), deep LSTMs, and some recently improved LSTMs, but also learns more features of the MTS data. As compared with conventional LSTM, the percentage improvement of DBI-BiLSTM on the four MTS datasets is 85.41, 75.47, 61.66 and 30.72%, respectively.</p> </abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023739"
    },
    {
        "id": 10960,
        "title": "Optimizing Coastal Wave Forecasting with LSTM: A Univariate Time Series Approach",
        "authors": "Zaharaddeen Karami Lawal, Hayati Yassin, Daphne Tech Ching Lai, Azam Che Idris",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gecost60902.2024.10475050"
    },
    {
        "id": 10961,
        "title": "NARX and NARMAX Models for Time Series Forecasting Using Shallow and Deep Neural Networks",
        "authors": "Benjamin Cruz, Gonzalo Acuña, Francisco Muñoz",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/chilecon60335.2023.10418665"
    },
    {
        "id": 10962,
        "title": "Time-series forecasting of road distress parameters using dynamic Bayesian belief networks",
        "authors": "Babitha Philip, Hamad AlJassmi",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "\nPurpose\nTo proactively draw efficient maintenance plans, road agencies should be able to forecast main road distress parameters, such as cracking, rutting, deflection and International Roughness Index (IRI). Nonetheless, the behavior of those parameters throughout pavement life cycles is associated with high uncertainty, resulting from various interrelated factors that fluctuate over time. This study aims to propose the use of dynamic Bayesian belief networks for the development of time-series prediction models to probabilistically forecast road distress parameters.\n\n\nDesign/methodology/approach\nWhile Bayesian belief network (BBN) has the merit of capturing uncertainty associated with variables in a domain, dynamic BBNs, in particular, are deemed ideal for forecasting road distress over time due to its Markovian and invariant transition probability properties. Four dynamic BBN models are developed to represent rutting, deflection, cracking and IRI, using pavement data collected from 32 major road sections in the United Arab Emirates between 2013 and 2019. Those models are based on several factors affecting pavement deterioration, which are classified into three categories traffic factors, environmental factors and road-specific factors.\n\n\nFindings\nThe four developed performance prediction models achieved an overall precision and reliability rate of over 80%.\n\n\nOriginality/value\nThe proposed approach provides flexibility to illustrate road conditions under various scenarios, which is beneficial for pavement maintainers in obtaining a realistic representation of expected future road conditions, where maintenance efforts could be prioritized and optimized.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ci-09-2022-0233"
    },
    {
        "id": 10963,
        "title": "Warehouse Product Demand Forecasting Using Time Series Methods",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17756/nwj.2023-s1-002"
    },
    {
        "id": 10964,
        "title": "Individual household load forecasting using bi-directional LSTM network with time-based embedding",
        "authors": "Khursheed Aurangzeb, Syed Irtaza Haider, Musaed Alhussein",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.egyr.2024.03.028"
    },
    {
        "id": 10965,
        "title": "Decompose and Conquer: Time Series Forecasting with Multiseasonal Trend Decomposition Using Loess",
        "authors": "Amirhossein Sohrabbeig, Omid Ardakanian, Petr Musilek",
        "published": "2023-12-12",
        "citations": 1,
        "abstract": "Over the past few years, there has been growing attention to the Long-Term Time Series Forecasting task and solving its inherent challenges like the non-stationarity of the underlying distribution. Notably, most successful models in this area use decomposition during preprocessing. Yet, much of the recent research has focused on intricate forecasting techniques, often overlooking the critical role of decomposition, which we believe can significantly enhance the performance. Another overlooked aspect is the presence of multiseasonal components in many time series datasets. This study introduced a novel forecasting model that prioritizes multiseasonal trend decomposition, followed by a simple, yet effective forecasting approach. We submit that the right decomposition is paramount. The experimental results from both real-world and synthetic data underscore the efficacy of the proposed model, Decompose&Conquer, for all benchmarks with a great margin, around a 30–50% improvement in the error.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/forecast5040037"
    },
    {
        "id": 10966,
        "title": "Call Frequency Time Series Forecasting Based On LSTM",
        "authors": "Jun Gui, Hao Sun, Danping Jia, Jia Zong, Lu Zhao",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciba56860.2023.10165554"
    },
    {
        "id": 10967,
        "title": "Determining the Best Activation Functions for Predicting Stock Prices in Different (Stock Exchanges) Through Multivariable Time Series Forecasting of LSTM",
        "authors": "",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "LSTM (Long Short-Term Memory) has proven its worth in terms of predicting Stock prices through questioning market conditions. This research focuses on the quality of LSTM predictions when various activation functions are applied within the context of noisy market data. In this research, we have used 25 different stocks from diverse stock exchanges and observed the predictions created by different activation functions such as Relu, Elu, and TanH. Our research would involve this accuracy within the context of average loss accumulation and price predictions for the stock sample. The market conditions will imply the features of similar epoch runs, and the same training and testing period, which are irrespective of SE and LSTM feature parameters defined by market-benefitting suggestions. This research has found an accuracy of 80% through the multivariable prediction method derived from the Hyperbolic Tangent activation function, suggesting that this function is the best for price prediction based on LSTM through the multivariable method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34104/ajeit.023.063071"
    },
    {
        "id": 10968,
        "title": "Data-driven decadal climate forecasting using Wasserstein time-series generative adversarial networks",
        "authors": "Ahmed Bouteska, Marco Lavazza Seranto, Petr Hajek, Mohammad Zoynul Abedin",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "AbstractRecent trends in global climate modeling, coupled with the availability of more fine-scale datasets, have opened up opportunities for deep learning-based climate prediction to improve the accuracy of predictions over traditional physics-based models. For this, however, large ensembles of data are needed. Generative models have recently proven to be a suitable solution to this problem. For a sound generative model for time-series forecasting, it is essential that temporal dynamics are preserved in that the generated data obey the original data distributions over time. Existing forecasting methods aided by generative models are not adequate for capturing such temporal relationships. Recently, generative models have been proposed that generate realistic time-series data by exploiting the combinations of unsupervised and supervised learning. However, these models suffer from instable learning and mode collapse problems. To overcome these issues, here we propose Wasserstein Time-Series Generative Adversarial Network (WTGAN), a new forecasting model that effectively imitates the dynamics of the original data by generating realistic synthetic time-series data. To validate the proposed forecasting model, we evaluate it by backtesting the challenging decadal climate forecasting problem. We show that the proposed forecasting model outperforms state-of-the- art generative models. Another advantage of the proposed model is that once WTGAN is tuned, generating time-series data is very fast, whereas standard simulators consume considerable computer time. Thus, a large amount of climate data can be generated, which can substantially improve existing data-driven climate forecasting models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10479-023-05722-7"
    },
    {
        "id": 10969,
        "title": "Using Time-Series Generative Adversarial Networks to Synthesize Sensing Data for Pest Incidence Forecasting on Sustainable Agriculture",
        "authors": "Chen-Yu Tai, Wun-Jhe Wang, Yueh-Min Huang",
        "published": "2023-5-10",
        "citations": 4,
        "abstract": "A sufficient amount of data is crucial for high-performance and accurate trend prediction. However, it is difficult and time-consuming to collect agricultural data over long periods of time; the consequence of such difficulty is datasets that are characterized by missing data. In this study we use a time-series generative adversarial network (TimeGAN) to synthesize multivariate agricultural sensing data and train RNN (Recurrent Neural Network), LSTM (Long Short-Term Memory), and GRU (Gated Recurrent Unit) neural network prediction models on the original and generated data to predict future pest populations. After our experiment, the data generated using TimeGAN and the original data have the smallest EC value in the GRU model, which is 9.86. The results show that the generative model effectively synthesizes multivariate agricultural sensing data and can be used to make up for the lack of actual data. The pest prediction model trained on synthetic data using time-series data generation yields results that are similar to that of the model trained on actual data. Accurate prediction of pest populations would represent a breakthrough in allowing for accurate and timely pest control.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15107834"
    },
    {
        "id": 10970,
        "title": "Markov enhanced I-LSTM approach for effective anomaly detection for time series sensor data",
        "authors": "V. Shanmuganathan, A. Suresh",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijin.2024.02.007"
    },
    {
        "id": 10971,
        "title": "Temporal Spatial Decomposition and Fusion Network for Time Series Forecasting*",
        "authors": "Liwang Zhou, Jing Gao",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191934"
    },
    {
        "id": 10972,
        "title": "Time Series Forecasting Fusion Network Model Based on Prophet and營mproved LSTM",
        "authors": "Weifeng Liu, Xin Yu, Qinyang Zhao, Guang Cheng, Xiaobing Hou, Shengqi He",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.032595"
    },
    {
        "id": 10973,
        "title": "Traffic Prediction Method for Time Series Networks Based on ARIMA-LSTM Model",
        "authors": "Tianhao Hou, Hongyan Xing, Xinyi Liang",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icemi59194.2023.10270072"
    },
    {
        "id": 10974,
        "title": "Financial Time Series Data Prediction by Combination Model Adaboost-KNN-LSTM",
        "authors": "Heng Zhao, Xinran Li, Jiakai Xu, Xianghua Fu, Jiehao Chen",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191419"
    },
    {
        "id": 10975,
        "title": "LSTM-based Forecasting using Policy Stringency and Time-varying Parameters of the SIR Model for COVID-19",
        "authors": "Pavodi Maniamfu, Keisuke Kameyama",
        "published": "2023-3-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cspa57446.2023.10087773"
    },
    {
        "id": 10976,
        "title": "Wind field forecasting using a novel method based on convolutional neural networks and bidirectional LSTM",
        "authors": "Mohammad Reza Khalilabadi",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/17445302.2023.2218323"
    },
    {
        "id": 10977,
        "title": "Image-based time series forecasting: A deep convolutional neural network approach",
        "authors": "Artemios-Anargyros Semenoglou, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.006"
    },
    {
        "id": 10978,
        "title": "Research on Synergistic Enhancement of Sales Forecasting through Time Series and Neural Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/infse.2023.040406"
    },
    {
        "id": 10979,
        "title": "Methodology based on spiking neural networks for univariate time-series forecasting",
        "authors": "Sergio Lucas, Eva Portillo",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106171"
    },
    {
        "id": 10980,
        "title": "Movement forecasting of financial time series based on adaptive LSTM-BN network",
        "authors": "Zhen Fang, Xu Ma, Huifeng Pan, Guangbing Yang, Gonzalo R. Arce",
        "published": "2023-3",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.119207"
    },
    {
        "id": 10981,
        "title": "Forecasting the Monkeypox Outbreak Using ARIMA, Prophet, NeuralProphet, and LSTM Models in the United States",
        "authors": "Bowen Long, Fangya Tan, Mark Newman",
        "published": "2023-1-6",
        "citations": 15,
        "abstract": "Since May 2022, over 64,000 Monkeypox cases have been confirmed globally up until September 2022. The United States leads the world in cases, with over 25,000 cases nationally. This recent escalation of the Monkeypox outbreak has become a severe and urgent worldwide public health concern. We aimed to develop an efficient forecasting tool that allows health experts to implement effective prevention policies for Monkeypox and shed light on the case development of diseases that share similar characteristics to Monkeypox. This research utilized five machine learning models, namely, ARIMA, LSTM, Prophet, NeuralProphet, and a stacking model, on the Monkeypox datasets from the CDC official website to forecast the next 7-day trend of Monkeypox cases in the United States. The result showed that NeuralProphet achieved the most optimal performance with a RMSE of 49.27 and R2 of 0.76. Further, the final trained NeuralProphet was employed to forecast seven days of out-of-sample cases. On the basis of cases, our model demonstrated 95% accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/forecast5010005"
    },
    {
        "id": 10982,
        "title": "Multivariate solar power time series forecasting using multilevel data fusion and deep neural networks",
        "authors": "Sarah Almaghrabi, Mashud Rana, Margaret Hamilton, Mohammad Saiedur Rahaman",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2023.102180"
    },
    {
        "id": 10983,
        "title": "Time Series Classification using Attention-Based LSTM and CNN",
        "authors": "R Vaibhava Lakshmi, S Radha",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452629"
    },
    {
        "id": 10984,
        "title": "Forecasting Necessary Levels Of Bread Stock For \"Direct-To-Shelf\" Delivery Using CNN And LSTM Artificial Neural Networks",
        "authors": "Lily Grogan, Victor Reus, Brian O’Carroll, Sheila Fallon",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieit59852.2023.10335581"
    },
    {
        "id": 10985,
        "title": "Time Series LSTM Prediction of Water Consumption in the Republic of Croatia by Regions",
        "authors": "Tea Polić, Alan Mutka, Martin Žagar",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/softcom58365.2023.10271675"
    },
    {
        "id": 10986,
        "title": "STTRE: A Spatio-Temporal Transformer with Relative Embeddings for multivariate time series forecasting",
        "authors": "Azad Deihim, Eduardo Alonso, Dimitra Apostolopoulou",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.039"
    },
    {
        "id": 10987,
        "title": "HDResNet: Hierarchical-Decomposition Residual Network for Hierarchical Time Series Forecasting",
        "authors": "Yi Xiang, Haoran Sun, Wenting Tu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191455"
    },
    {
        "id": 10988,
        "title": "Wavelet-Seq2Seq-LSTM with attention for time series forecasting of level of dams in hydroelectric power plants",
        "authors": "Stefano Frizzo Stefenon, Laio Oriel Seman, Luiza Scapinello Aquino, Leandro dos Santos Coelho",
        "published": "2023-7",
        "citations": 25,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.127350"
    },
    {
        "id": 10989,
        "title": "Application of the Method of Multivariate Multi-stage Forecasting Based on the LSTM Deep Learning Model for Bitcoin Price Time Series",
        "authors": "Natalia Sizykh, Said Dandamaev, Dmitry Sizykh",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsd58227.2023.10304008"
    },
    {
        "id": 10990,
        "title": "HyBiLSTM: Multivariate Bitcoin Price Forecasting Using Hybrid Time-Series Models With Bidirectional LSTM",
        "authors": "Anny Mardjo, Chidchanok Choksuchat",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3386029"
    },
    {
        "id": 10991,
        "title": "Forecasting Using Point-valued Time Series and Fuzzy-valued Time Series Models",
        "authors": "Rosnalini Mansor, Bahtiar Jamili Zaini",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "The point-valued time series (PTS) is simply about one value in each time or period of the data, but when the data have two values at each time, the suitable time series is called the interval-valued time series (ITS). An example of ITS is the daily close and open stock prices. If the time series data are of typed linguistic data, for example, “low increase”, “medium increase” and “high increase”, the time series data are called a fuzzy-valued time series or being well-known as fuzzy time series (FTS). The aim of this study is to compare the PTS and FTS models for forecasting stock prices in the stock market. The stock market is one of the essential investments in the economy. The movement of stock price can be leading or declining which respectively expands or contracts a country’s economy. The movement may also represent the scenario or event happening in a company. Therefore, forecasting stock price movement is highly important since it will assist investors and sellers to make planning in their investment’s decision. Therefore, the objectives of this study are to identify the best forecasting models in point-valued time series (PTS) and fuzzy time series (FTS) based on forecasting measurement error. Eight stock price forecasting models consisting of four models from PTS and four models from FTS. Meanwhile, four forecasting measurement errors were discussed in the analysis as a criterion for choosing the best forecasting model. A set of daily historical data from the Bursa Malaysia website was used as a basis for analysis. The finding shows the simple exponential smoothing model is the best PTS model. In the meantime, the Cheng model based on Sturges’ rule is the best FTS model. However, among these two types of models, the Cheng model is found to be the best model with forecasting measurement errors of 0.0001 (MSFE), 0.0108 (RMSFE) and 1.1918 (MAPFE). The results reveal that besides the PTS model, the FTS model is an alternative model to forecast stock market movement. Moreover, these FTS and PTS models can also be applied to solving other forecasting problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15379/ijmst.v10i2.1168"
    },
    {
        "id": 10992,
        "title": "Time Series Prediction of Temperature Using Seasonal ARIMA and LSTM Models",
        "authors": "Hakan KOÇAK",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30855/gmbd.0705088"
    },
    {
        "id": 10993,
        "title": "Forecasting Short-Term Indoor Radon: A Machine Learning Approach Using LSTM Networks",
        "authors": "Valdo Mpinga, A. M. Rosado Da Cruz, Sérgio Ivan Lopes",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/cisti58278.2023.10211807"
    },
    {
        "id": 10994,
        "title": "Attention-based LSTM network-assisted time series forecasting models for petroleum production",
        "authors": "Indrajeet Kumar, Bineet Kumar Tripathi, Anugrah Singh",
        "published": "2023-8",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106440"
    },
    {
        "id": 10995,
        "title": "A Path-Depended Passenger Flow Forecasting Model for Metro Rail Systems Using LSTM Neural Network",
        "authors": "Jaison Mulerikkal, Deepa Dixon, Sajanraj Thandassery",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011840800003479"
    },
    {
        "id": 10996,
        "title": "LSTM-Based Time Series Forecasting of Pulmonary Function Test for COPD Early Diagnosis",
        "authors": "Beomseo Choi, Hongjun Kim, Seung-Hyun Jeon",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7840/kics.2024.49.3.346"
    },
    {
        "id": 10997,
        "title": "Elevating Univariate Time Series Forecasting: Innovative SVR-Empowered Nonlinear Autoregressive Neural Networks",
        "authors": "Juan D. Borrero, Jesus Mariscal",
        "published": "2023-9-2",
        "citations": 1,
        "abstract": "Efforts across diverse domains like economics, energy, and agronomy have focused on developing predictive models for time series data. A spectrum of techniques, spanning from elementary linear models to intricate neural networks and machine learning algorithms, has been explored to achieve accurate forecasts. The hybrid ARIMA-SVR model has garnered attention due to its fusion of a foundational linear model with error correction capabilities. However, its use is limited to stationary time series data, posing a significant challenge. To overcome these limitations and drive progress, we propose the innovative NAR–SVR hybrid method. Unlike its predecessor, this approach breaks free from stationarity and linearity constraints, leading to improved model performance solely through historical data exploitation. This advancement significantly reduces the time and computational resources needed for precise predictions, a critical factor in univariate economic time series forecasting. We apply the NAR–SVR hybrid model in three scenarios: Spanish berry daily yield data from 2018 to 2021, daily COVID-19 cases in three countries during 2020, and the daily Bitcoin price time series from 2015 to 2020. Through extensive comparative analyses with other time series prediction models, our results substantiate that our novel approach consistently outperforms its counterparts. By transcending stationarity and linearity limitations, our hybrid methodology establishes a new paradigm for univariate time series forecasting, revolutionizing the field and enhancing predictive capabilities across various domains as highlighted in this study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16090423"
    },
    {
        "id": 10998,
        "title": "Fin-GAN: Forecasting and Classifying Financial Time Series via Generative Adversarial Networks",
        "authors": "Milena Vuletić, Felix Prenzel, Mihai Cucuringu",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4328302"
    },
    {
        "id": 10999,
        "title": "Bitcoin Price Forecasting Using LSTM",
        "authors": "",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets42872"
    },
    {
        "id": 11000,
        "title": "Evaluation of Different Time Series Forecasting Models for 5G V2V Networks",
        "authors": "Jian Liu, Chin-Tser Huang",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074369"
    },
    {
        "id": 11001,
        "title": "FORECASTING NATURAL RUBBER PRODUCTS IN THAILAND USING VARIOUS TIME SERIES TECHNIQUES",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35741/issn.0258-2724.58.3.24"
    },
    {
        "id": 11002,
        "title": "A Combined Model Based on Recurrent Neural Networks and Graph Convolutional Networks for Financial Time Series Forecasting",
        "authors": "Ana Lazcano, Pedro Javier Herrera, Manuel Monge",
        "published": "2023-1-2",
        "citations": 22,
        "abstract": "Accurate and real-time forecasting of the price of oil plays an important role in the world economy. Research interest in forecasting this type of time series has increased considerably in recent decades, since, due to the characteristics of the time series, it was a complicated task with inaccurate results. Concretely, deep learning models such as Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs) have appeared in this field with promising results compared to traditional approaches. To improve the performance of existing networks in time series forecasting, in this work two types of neural networks are brought together, combining the characteristics of a Graph Convolutional Network (GCN) and a Bidirectional Long Short-Term Memory (BiLSTM) network. This is a novel evolution that improves existing results in the literature and provides new possibilities in the analysis of time series. The results confirm a better performance of the combined BiLSTM-GCN approach compared to the BiLSTM and GCN models separately, as well as to the traditional models, with a lower error in all the error metrics used: the Root Mean Squared Error (RMSE), the Mean Squared Error (MSE), the Mean Absolute Percentage Error (MAPE) and the R-squared (R2). These results represent a smaller difference between the result returned by the model and the real value and, therefore, a greater precision in the predictions of this model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11010224"
    },
    {
        "id": 11003,
        "title": "ELECTRICITY DEMAND FORECASTING USING TIME SERIES ANALYSIS",
        "authors": "",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets35708"
    },
    {
        "id": 11004,
        "title": "Forecasting COVID-19 Confirmed Cases Using Time Series Analysis",
        "authors": "أكرم محمد رضوان",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33977/2106-000-006-002"
    },
    {
        "id": 11005,
        "title": "Time Series Weather Data Forecasting Using Deep Learning",
        "authors": "Pau Suan Mung, Sabai Phyu",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca51723.2023.10182058"
    },
    {
        "id": 11006,
        "title": "INTERCITY PASSENGER FLOW FORECASTING AND MTE BUSES OPTIMAL OPERATION USING LSTM NEURAL NETWORK",
        "authors": "L.M. Oleshchenko",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/2663-5941/2024.1.1/40"
    },
    {
        "id": 11007,
        "title": "Prediction of solar activity time series using LSTM artificial neural network",
        "authors": "Boris V. Kozelov,  ",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "A numerical model for predicting the parameters of solar activity — the number of sunspots R and the radioflux at a wave of 10.7 cm F10.7 ahead for 27 days — has been built. The numerical model uses an artificial neural network (NN) with LSTM (Long short-term memory) layers. For both the number of sunspots and the radioflux, the model predicts the levels and limits of variation of the values for 27 days. The average absolute prediction error of the model is less than 6 %. The real-time model is implemented on the site http://aurora.pgia.ru and can be an addition to long-term forecasts of other INTERNET resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37614/2949-1185.2023.2.2.003"
    },
    {
        "id": 11008,
        "title": "DI-ESN: Dual Input-Echo State Network for Time Series Forecasting",
        "authors": "Chafika Ouni, Emna Benmohamed, Hela Ltifi",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323907"
    },
    {
        "id": 11009,
        "title": "Hypergraph Neural Networks for Time-series Forecasting",
        "authors": "Hongjie Chen, Ryan A. Rossi, Kanak Mahadik, Sungchul Kim, Hoda Eldardiry",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386109"
    },
    {
        "id": 11010,
        "title": "Hybrid learning strategies for multivariate time series forecasting of network quality metrics",
        "authors": "Mario Di Mauro, Giovanni Galatro, Fabio Postiglione, Wei Song, Antonio Liotta",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2024.110286"
    },
    {
        "id": 11011,
        "title": "Predicting time series data using Hybrid Hybrid SARIMAX-LSTM algorithm",
        "authors": "Nanyoung Hong, Younjae Lee, Taewook Lee",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7465/jkdi.2023.34.5.697"
    },
    {
        "id": 11012,
        "title": "Classification of Time Series Using FCM-Based Forecasting Models",
        "authors": "Miłosz Wrzesień, Mariusz Wrzesień",
        "published": "2023-8-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/fuzz52849.2023.10309770"
    },
    {
        "id": 11013,
        "title": "Time Series Forecasting Using Ensemble Model",
        "authors": "Mohamed El Mahjouby, Mohamed Elfar",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cist56084.2023.10409946"
    },
    {
        "id": 11014,
        "title": "Time Series Anomaly Detection Embedded Systems By Using LSTM",
        "authors": "Gulsum Akkuzu Kaya, Mehmet Yıldız",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36287/ijmsit.7.2.90"
    },
    {
        "id": 11015,
        "title": "Data augmentation for univariate time series forecasting with neural networks",
        "authors": "Artemios-Anargyros Semenoglou, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-2",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109132"
    },
    {
        "id": 11016,
        "title": "Forecasting the transmission of COVID-19 using long short-term memory (LSTM) networks",
        "authors": "Wei Silu, Adriana IrawatiNur Ibrahim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0109931"
    },
    {
        "id": 11017,
        "title": "Comparative Analysis of Time Series Models for Maternal Mortality Ratio Forecasting",
        "authors": "Shivendra Bharuka, Antara Gupta, Preethiya. T",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370245"
    },
    {
        "id": 11018,
        "title": "Time-Series Forecasting of Seasonal Data Using Machine Learning Methods",
        "authors": "Vadim Kramar, Vasiliy Alchakov",
        "published": "2023-5-10",
        "citations": 2,
        "abstract": "The models for forecasting time series with seasonal variability can be used to build automatic real-time control systems. For example, predicting the water flowing in a wastewater treatment plant can be used to calculate the optimal electricity consumption. The article describes a performance analysis of various machine learning methods (SARIMA, Holt-Winters Exponential Smoothing, ETS, Facebook Prophet, XGBoost, and Long Short-Term Memory) and data-preprocessing algorithms implemented in Python. The general methodology of model building and the requirements of the input data sets are described. All models use actual data from sensors of the monitoring system. The novelty of this work is in an approach that allows using limited history data sets to obtain predictions with reasonable accuracy. The implemented algorithms made it possible to achieve an R-Squared accuracy of more than 0.95. The forecasting calculation time is minimized, which can be used to run the algorithm in real-time control and embedded systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16050248"
    },
    {
        "id": 11019,
        "title": "Forecasting the Maize Export Using Time Series Analysis",
        "authors": "Jakkaphan Whasphuttisit, Watchareewan Jitsakul",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbir57571.2023.10147480"
    },
    {
        "id": 11020,
        "title": "New Developments in Time Series and Forecasting, ITISE-2023",
        "authors": "Olga Valenzuela, Fernando Rojas, Luis Javier Herrera, Hector Pomares, Ignacio Rojas",
        "published": "2023-9-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039101"
    },
    {
        "id": 11021,
        "title": "FORECASTING TIME SERIES OF THE COST OF METALS USING RECURRENT NEURAL NETWORKS",
        "authors": "Антон Викторович Завизин, Галина Борисовна Даныкина",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "В статье рассматривается подход к прогнозированию стоимости металлов на базе машинного обучения с использованием одной из разновидностей рекуррентных нейронных сетей, а именно сети с долговременной и кратковременной памятью (LSTM). \nThe article discusses an approach to predicting the cost of metals based on machine learning using one of the varieties of neural networks, namely a recurrent neural network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58351/230404.2023.31.11.003"
    },
    {
        "id": 11022,
        "title": "Water consumption time series forecasting in urban centers using deep neural networks",
        "authors": "C. G. García-Soto, J. F. Torres, M. A. Zamora-Izquierdo, J. Palma, A. Troncoso",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractThe time series analysis and prediction techniques are highly valued in many application fields, such as economy, medicine and biology, environmental sciences or meteorology, among others. In the last years, there is a growing interest in the sustainable and optimal management of a resource as scarce as essential: the water. Forecasting techniques for water management can be used for different time horizons from the planning of constructions that can respond to long-term needs, to the detection of anomalies in the operation of facilities or the optimization of the operation in the short and medium term. In this paper, a deep neural network is specifically designed to predict water consumption in the short-term. Results are reported using the time series of water consumption for a year and a half measured with 10-min frequency in the city of Murcia, the seventh largest city in Spain by number of inhabitants. The results are compared with K Nearest Neighbors, Random Forest, Extreme Gradient Boosting, Seasonal Autoregressive Integrated Moving Average and two persistence models as naive methods, showing the proposed deep learning model the most accurate results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13201-023-02072-4"
    },
    {
        "id": 11023,
        "title": "Amazon EC2 Spot Price Prediction Using LSTM Time Series Prediction Model",
        "authors": "Veena Khandelwal, Shantanu Khandelwal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcc.2024.10049932"
    },
    {
        "id": 11024,
        "title": "Time Series Prediction of Sea Surface Temperature Using LSTM",
        "authors": "Aditya Saxena, Rishabh Chauhan, Devansh Chauhan, Garima Aggarwal",
        "published": "2023-1-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/confluence56041.2023.10048855"
    },
    {
        "id": 11025,
        "title": "Magnetotelluric Time Series Denoising Using Encoder-Decoder Consisted of LSTM Cells",
        "authors": "Sihao Wang, Lanfang He, Xuben Wang, Liang Li",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nElectromagnetic signals in geophysics are frequently disturbed by various interference in field data acquisition. Denoising for passive electromagnetic methods such as magnetotelluric (MT) or audio magnetotelluric (AMT) data is significant to improve data quality and finally imaging to the geoelectrical structure. Conventionally, most denoising methods are employed in frequency domain and few of them are applied in time domain. However, a great number of irregular noise in the electromagnetic time series prove difficulty to be removed. We propose a denoising method, using Encoder-Decoder consisted of Long Short-Term Memory cells (ED-LSTM), to reduce the effect of the step noise and the random-impulsive noise. Supervised learning and transductive learning are used for the denoising of the step noise and the random-impulsive noise, respectively. Our results indicate that the step and random-impulsive noise could be successfully removed from the raw time series. The result indicate that ED-LSTM could potentially to be wildly used in the electromagnetic time series denoising and then improve data quality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2651/1/012123"
    },
    {
        "id": 11026,
        "title": "Nowcasting growth using Google Trends data: A Bayesian Structural Time Series model",
        "authors": "David Kohns, Arnab Bhattacharjee",
        "published": "2023-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijforecast.2022.05.002"
    },
    {
        "id": 11027,
        "title": "Robust recurrent neural networks for time series forecasting",
        "authors": "Xueli Zhang, Cankun Zhong, Jianjun Zhang, Ting Wang, Wing W.Y. Ng",
        "published": "2023-3",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.01.037"
    },
    {
        "id": 11028,
        "title": "Forecasting USD exchange rate using time-invariant and second-order fuzzy time series",
        "authors": "Lintang Patria",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0182600"
    },
    {
        "id": 11029,
        "title": "Amazon EC2 spot price prediction using LSTM time series prediction model",
        "authors": "Khandelwal Veena, Khandelwal Shantanu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcc.2024.136289"
    },
    {
        "id": 11030,
        "title": "Business Escalation Strategy Using Time Series Forecasting for Hotel X in Yogyakarta",
        "authors": "Muhammad Raidy Prasetiawan,  , Meditya Wasesa,  ",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "Yogyakarta is one of the cities attracting significant foreign and local tourist attention with its beautiful city, culture, education, and traditional cuisine which prospered the hospitality industry in the city. However, since the pandemic Covid-19 hit the global economy in 2020, Hotel X Yogyakarta was also affected. The total occupancy room per year fell ten times lower than usual during the pandemic which jeopardized the business stability. Starting from preliminary interviews and SWOT analysis, this research aims to figure out what strategy needs to be implemented in Hotel X Yogyakarta to escalate the business and stabilize the occupancy room by using a quantitative methodology from a marketing and business analytic perspective. All data provided in this research is based on the internal data and information from the hotel, systematically calculated with Time Series Forecasting Theory using ARMA and ARIMA to provide a comprehensive forecasting result for business escalation strategy that is proposed to be implemented in Hotel X Yogyakarta.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijcsrr/v6-i8-27"
    },
    {
        "id": 11031,
        "title": "Multi-Step Vector Output Prediction of Time Series Using EMA LSTM",
        "authors": "Mohammad Diqi, Ahmad Sahal, Farida Nur Aini",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "This research paper proposes a novel method, Exponential Moving Average Long Short-Term Memory (EMA LSTM), for multi-step vector output prediction of time series data using deep learning. The method combines the LSTM with the exponential moving average (EMA) technique to reduce noise in the data and improve the accuracy of prediction. The research compares the performance of EMA LSTM to other commonly used deep learning models, including LSTM, GRU, RNN, and CNN, and evaluates the results using statistical tests. The dataset used in this study contains daily stock market prices for several years, with inputs of 60, 90, and 120 previous days, and predictions for the next 20 and 30 days. The results show that the EMA LSTM method outperforms other models in terms of accuracy, with lower RMSE and MAPE values. This study has important implications for real-world applications, such as stock market forecasting and climate prediction, and highlights the importance of careful preprocessing of the data to improve the performance of deep learning models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15575/join.v8i1.1037"
    },
    {
        "id": 11032,
        "title": "Forecasting financial time series using singular spectrum analysis",
        "authors": "Anna Zinenko",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Financial time series are big arrays of information on quotes and trading volumes of shares, currencies and other exchange and over-the-counter instruments. The analysis and forecasting of such series has always been of particular interest for both research analysts and practicing investors. However, financial time series have their own features, which do not allow one to choose the only correct and well-functioning forecasting method. Currently, machine-learning algorithms allow one to analyze large amounts of data and test the resulting models. Modern technologies enable testing and applying complex forecasting methods that require volumetric calculations. They make it possible to develop the mathematical basis of forecasting, to combine different approaches into a single method. An example of such a modern approach is the Singular Spectrum Analysis (SSA), which combines the decomposition of a time series into a sum of time series, principal component analysis and recurrent forecasting. The purpose of this work is to analyze the possibility of applying SSA to financial time series. The SSA method was considered in comparison with other common methods for forecasting financial time series: ARIMA, Fourier transform and recurrent neural network. To implement the methods, a software algorithm in the Python language was developed. The method was also tested on the time series of quotes of Russian and American stocks, currencies and cryptocurrencies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17323/2587-814x.2023.3.87.100"
    },
    {
        "id": 11033,
        "title": "Forecasting Cryptocurrency Prices Using LSTM, GRU, and Bi-Directional LSTM: A Deep Learning Approach",
        "authors": "Phumudzo Lloyd Seabe, Claude Rodrigue Bambe Moutsinga, Edson Pindza",
        "published": "2023-2-18",
        "citations": 20,
        "abstract": "Highly accurate cryptocurrency price predictions are of paramount interest to investors and researchers. However, owing to the nonlinearity of the cryptocurrency market, it is difficult to assess the distinct nature of time-series data, resulting in challenges in generating appropriate price predictions. Numerous studies have been conducted on cryptocurrency price prediction using different Deep Learning (DL) based algorithms. This study proposes three types of Recurrent Neural Networks (RNNs): namely, Long Short-Term Memory (LSTM), Gated Recurrent Unit (GRU), and Bi-Directional LSTM (Bi-LSTM) for exchange rate predictions of three major cryptocurrencies in the world, as measured by their market capitalization—Bitcoin (BTC), Ethereum (ETH), and Litecoin (LTC). The experimental results on the three major cryptocurrencies using both Root Mean Squared Error (RMSE) and the Mean Absolute Percentage Error (MAPE) show that the Bi-LSTM performed better in prediction than LSTM and GRU. Therefore, it can be considered the best algorithm. Bi-LSTM presented the most accurate prediction compared to GRU and LSTM, with MAPE values of 0.036, 0.041, and 0.124 for BTC, LTC, and ETH, respectively. The paper suggests that the prediction models presented in it are accurate in predicting cryptocurrency prices and can be beneficial for investors and traders. Additionally, future research should focus on exploring other factors that may influence cryptocurrency prices, such as social media and trading volumes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/fractalfract7020203"
    },
    {
        "id": 11034,
        "title": "Time series data recovery in SHM of large-scale bridges: Leveraging GAN and Bi-LSTM networks",
        "authors": "Thanh Bui Tien, Tuyen Vu Quang, Lan Nguyen Ngoc, Hoa Tran Ngoc",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.istruc.2024.106368"
    },
    {
        "id": 11035,
        "title": "Forecasting Time Series AQI Using Machine learning of Haryana Cities Using Machine Learning",
        "authors": "Reema Gupta, Priti Singla",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "In India and throughout the world, air pollution is becoming a severe worry day by day. Governments and the general public have grown more concerned about how air pollution affects human health. Consequently, it is crucial to forecast the air quality with accuracy. In this paper, Machine learning methods SVR and RFR were used to build the hybrid forecast model to predict the concentrations of Air Quality Index in Haryana Cities. The forecast models were built using air pollutants and meteorological parameters from 2019 to 2021 and testing and validation was conducted on the air quality data for the year 2022 of Jind and Panipat city in the State of Haryana. Further, performance of hybrid forecast model was enhanced using scalar technique and performance was evaluated using various coefficient metrics and other parameters. First, the important factors affecting air quality are extracted and irregularities from the dataset are removed. Second, for forecasting AQI various approaches have been used and evaluation is carried out using performance metrics. The experimental results showed that the proposed hybrid model had a better forecast result than the standard Random forest Regression, Support Vector Regression and Multiple Linear Regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47164/ijngc.v14i4.1267"
    },
    {
        "id": 11036,
        "title": "Daily air temperature forecasting using LSTM-CNN and GRU-CNN models",
        "authors": "Ihsan Uluocak, Mehmet Bilgili",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11600-023-01241-y"
    },
    {
        "id": 11037,
        "title": "Medium Term Wind Speed Forecasting Using LSTM Model",
        "authors": "Dr.A.Shobana Devi, M.K. Sanjana, Ayshwarya S",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.110"
    },
    {
        "id": 11038,
        "title": "Day-Ahead Zonal Electricity Price Forecasting using 1D-LSTM with Neighbouring Zones Data",
        "authors": "Surender Redhu, Bernt A. Bremdal",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/powertech55446.2023.10202771"
    },
    {
        "id": 11039,
        "title": "Retracted: Application of Neural Networks in Financial Time Series Forecasting Models",
        "authors": "",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9819013"
    },
    {
        "id": 11040,
        "title": "A Performance Comparison of Neural Networks and Fuzzy Systems for Time Series Forecasting",
        "authors": "Jeong Hee Woong",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Artificial neural networks and fuzzy structures have gained significant popularity in the last decade for time series forecasting. The objective is to conduct a performance comparison of various strategies to determine which ones are more effective for time series forecasting. The dataset provides instruction and evaluates forecasting models, utilizing artificial neural networks and fuzzy architectures. The observation evaluates the overall effectiveness of the forecasting models and the use of the root mean square error and means absolute error measures. This comparison analysis provides initial insights into the efficacy of artificial neural networks and fuzzy structures for predicting time series data. In predicting time series data, this study examines the precision of two renowned artificial intelligence systems, Neural Networks and Fuzzy structures. To evaluate the two algorithms, two distinct types of time series were utilized: a synthetic dataset consisting of 150 variables and a real-world dataset including 129 data points about monetary forecasts. The models' forecasting accuracy, training duration, and generalization abilities were compared. The findings validated that neural network surpassed fuzzy structures in all performance metrics when handling synthetic data. This research emphasizes the capabilities of artificial neural networks and fuzzy structures in addressing complicated forecasting problems. It demonstrates that both techniques may be utilized for predicting future time series values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/7669/jmc202404010"
    },
    {
        "id": 11041,
        "title": "Anomaly Detection Using Multiscale C-LSTM for Univariate Time-Series",
        "authors": "Yi-Xiang Lu, Xiao-Bo Jin, Dong-Jie Liu, Xin-Chang Zhang, Guang-Gang Geng",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "Computers generate network traffic data when people go online, and devices generate sensor data when they communicate with each other. When events such as network intrusion or equipment failure occur, the corresponding time-series will show abnormal trends. By detecting these time-series, anomalous events can be detected instantly, ensuring the security of network communication. However, existing time-series anomaly detection methods are difficult to deal with sequences with different degrees of correlation in complex scenes. In this paper, we propose three multiscale C-LSTM deep learning models to efficiently detect abnormal time-series: independent multiscale C-LSTM (IMC-LSTM), where each LSTM has an independent scale CNN; combined multiscale C-LSTM (CMC-LSTM), that is, the output of multiple scales of CNN is combined as an LSTM input; and shared multiscale C-LSTM (SMC-LSTM), that is, the output of multiple scales of CNN shares an LSTM model. Comparative experiments on multiple data sets show that the proposed three models have achieved excellent performance on the famous Yahoo Webscope S5 dataset and Numenta Anomaly Benchmark dataset, even better than the existing C-LSTM based latest model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/6597623"
    },
    {
        "id": 11042,
        "title": "Mackey-Glass Time Series Forecasting by Nanowire Networks",
        "authors": "Gianluca Milano, Tushar Chakrabarty, Carlo Ricciardi",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/metroxraine58569.2023.10405786"
    },
    {
        "id": 11043,
        "title": "Bootstrap Decomposition Enhanced Orthogonal-Basis Projection Model for Long-term Time Series Forecasting",
        "authors": "Xiaoyu Wang, Pengyu Xu, Mingyang Song, Liping Jing",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191976"
    },
    {
        "id": 11044,
        "title": "Day-ahead solar photovoltaic energy forecasting based on weather data using LSTM networks: a comparative study for photovoltaic (PV) panels in Turkey",
        "authors": "Zeynep Garip, Ekin Ekinci, Ali Alan",
        "published": "2023-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00202-023-01883-7"
    },
    {
        "id": 11045,
        "title": "Time series prediction of the COVID-19 outbreak in India using LSTM based deep learning models",
        "authors": " Ameet, Chhavi Rana",
        "published": "2023-2-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciptm57143.2023.10118085"
    },
    {
        "id": 11046,
        "title": "Exploring crude oil price movements as a complex time series using recurrent neural networks",
        "authors": "Rida El Abassi, Mohamed Oubraime, Jaafar Idrais, Abderrahim Sabour",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607720.3607731"
    },
    {
        "id": 11047,
        "title": "Time Series Forecasting of Sales Data using Hybrid Analysis",
        "authors": "T Rajasree, R. Ramyadevi",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486340"
    },
    {
        "id": 11048,
        "title": "A Forecasting Model Intuitionistic Fuzzy Time Series Using Distribution Ratio-Based",
        "authors": "Dung Nguyen Thi Thu, Liudmila V. Chernenkaya",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rusautocon58002.2023.10272755"
    },
    {
        "id": 11049,
        "title": "Prediction intervals for time series forecasting using Transformers",
        "authors": "Sebastián Orellana, Gonzalo Acuña",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sccc59417.2023.10315727"
    },
    {
        "id": 11050,
        "title": "Late Meta-learning Fusion Using Representation Learning for Time Series Forecasting",
        "authors": "Terence L. van Zyl",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/fusion52260.2023.10224217"
    },
    {
        "id": 11051,
        "title": "Analysis and Forecasting of Monthly Electricity Demand Time Series Using Pattern-Based Statistical Methods",
        "authors": "Paweł Pełka",
        "published": "2023-1-11",
        "citations": 11,
        "abstract": "This article provides a solution based on statistical methods (ARIMA, ETS, and Prophet) to predict monthly power demand, which approximates the relationship between historical and future demand patterns. The energy demand time series shows seasonal fluctuation cycles, long-term trends, instability, and random noise. In order to simplify the prediction issue, the monthly load time series is represented by an annual cycle pattern, which unifies the data and filters the trends. A simulation study performed on the monthly electricity load time series for 35 European countries confirmed the high accuracy of the proposed models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16020827"
    },
    {
        "id": 11052,
        "title": "Time Series Forecasting of XRP Using Machine Learning Algorithms",
        "authors": "Nayeem Ahmed, Md. Mahbubur Rahman",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicis56802.2023.10430261"
    },
    {
        "id": 11053,
        "title": "Comparative Analysis of LSTM, BILSTM and ARIMA for Time Series Forecasting on 116 years of Temperature and Rainfall Data from Pakistan",
        "authors": " Asif Khokhar,  Shahnawaz Talpur,  Mohsin A. Memon",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "Numerous aspects of human life, including agriculture, transportation, and health, are significantly influenced by weather, both economically and socially. Rain has an impact on landslides, floods, and other natural disasters. We are motivated to create a model for comprehending and forecasting rain in order to provide advanced warning in a spectrum of areas such as transport, agriculture, and so on because of the numerous consequences that rain and temperature have on human survival. In this study, a dataset for temperature and rainfall for Pakistan for 116 years is used. Comparative analysis of ARIMA, LSTM and BILSTM is performed. For this study, 90% of data is used for training and the 10% for testing. Normalization is also performed to clean data. According to the results, LSTM and BILSTM are better than ARIMA but for specific cases of rainfall, BILSTM performed better than LSTM and for Temperature LSTM outperformed BILSTM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32628/cseit2390238"
    },
    {
        "id": 11054,
        "title": "Adversarial self-attentive time-variant neural networks for multi-step time series forecasting",
        "authors": "Changxia Gao, Ning Zhang, Youru Li, Yan Lin, Huaiyu Wan",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120722"
    },
    {
        "id": 11055,
        "title": "A long-term multivariate time series forecasting network combining series decomposition and convolutional neural networks",
        "authors": "Xingyu Wang, Hui Liu, Junzhao Du, Xiyao Dong, Zhihan Yang",
        "published": "2023-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110214"
    },
    {
        "id": 11056,
        "title": "Point and interval wind speed forecasting of multivariate time series based on dual-layer LSTM",
        "authors": "Haipeng Zhang, Jianzhou Wang, Yuansheng Qian, Qiwei Li",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2024.130875"
    },
    {
        "id": 11057,
        "title": "Discharge Forecasting in Coastal Rivers Using CNN-LSTM Hybrid Approach",
        "authors": "Anna Maria Mihel, Kristijan Lenac, Nino Krvavica, Jonatan Lerga",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/elmar59410.2023.10253933"
    },
    {
        "id": 11058,
        "title": "Echo State Networks: Novel reservoir selection and hyperparameter optimization model for time series forecasting",
        "authors": "Cesar H. Valencia, Marley M.B.R. Vellasco, Karla Figueiredo",
        "published": "2023-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126317"
    },
    {
        "id": 11059,
        "title": "Anomaly Detection of Streamflow Time Series Using LSTM Autoencoder",
        "authors": "Arathy Nair G R, Adarsh S",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "Streamflow data obtained from the stream-gauge stations usually comprises of an ample volume of outliers. Anomaly detection is a requisite step in streamflow monitoring and analysis, especially in the context of water resources management, planning and flood risk studies. This study suggests a hybrid deep-learning anomaly detection method that combines an autoencoder and a long-short-term memory (LSTM) network. Multiple LSTM cells that collaborate with one another to understand the long-term dependencies of the data in a time series sequence make up the LSTM network. Based on the reconstruction error of the autoencoder's decoding phase, anomaly identification is accomplished. The applicability of the proposed method is demonstrated by considering the streamflow data (from 1985 to 2015) of Thumpamon streamgauge station of Greater Pamba River basin, Kerala. The hybrid framework exhibits promising results after computing the accuracy, precision, recall and the F1-Scores values as 99.51%, 100%, 89.89% and 94.73% respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21467/proceedings.156.16"
    },
    {
        "id": 11060,
        "title": "Emotional Arousal Estimation by LSTM Model Based on Time-Series Thermal and Visible Images",
        "authors": "Rio Tanabe, Yoichi Kageyama, Min Zou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/icisip2023.008"
    },
    {
        "id": 11061,
        "title": "WEATHER FORECAST FROM TIME SERIES DATA USING LSTM ALGORITHM",
        "authors": "Yoga Estu Nugraha Nugraha, Ishak Ariawan, Willdan Aprizal Arifin",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Accurate weather forecasts play an important role in today's world as various sectors such as marine, navigation, agriculture and industry are basically dependent on weather conditions. Weather forecasts are also used to predict the occurrence of natural disasters. Weather forecasting determines the exact value of weather parameters and then predicts future weather conditions. In this study the parameters used are. Different weather parameters were collected from the Serang Maritime Meteorological Station and then analyzed using a neural network-based algorithm, namely Long-short term memory (LSTM). In predicting future weather conditions using LSTM neural networks are trained using a combination of different weather parameters, the weather parameters used are temperature, humidity, rainfall, and wind speed. After training the LSTM model using these parameters, future weather predictions are performed. The prediction results are then evaluated using RMSE. Prediction results show that the model is more accurate when predicting temperature data with RMSE 0.37, then RMSE wind speed 0.72, RMSE sunlight 2.79, and RMSE humidity 5.05. This means that the model is very good at studying weather data, inversely proportional to humidity data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51903/jtikp.v14i1.531"
    },
    {
        "id": 11062,
        "title": "Forecasting Stock Quotes of the Chinese Company Nio Using Bidirectional LSTM Neural Networks",
        "authors": "Roman S. Kuznetsov,  , Tatiana G. Tumarova, Sergey V. Pilipenko,  ,  ",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "The rapid development of technologies in the field of artificial intelligence and the emergence of new neural network architectures has an impact on companies associated with the stock market. Various neural networks can predict the trend and values of stock quotes with high accuracy. The ability to correctly select the necessary neural networks and their parameters becomes an important competitive advantage for companies operating in the stock market. The study reflects the effectiveness of using bidirectional LSTM neural networks with an additional attention mechanism, and also tested different numbers of previous days taken into account when predicting future values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17586/2713-1874-2023-4-92-101"
    },
    {
        "id": 11063,
        "title": "DA-LSTM: A dynamic drift-adaptive learning framework for interval load forecasting with LSTM networks",
        "authors": "Firas Bayram, Phil Aupke, Bestoun S. Ahmed, Andreas Kassler, Andreas Theocharis, Jonas Forsman",
        "published": "2023-8",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106480"
    },
    {
        "id": 11064,
        "title": "Enhancing Stock Market Forecasting Using Recursive Time Series Decomposition Techniques",
        "authors": "Arnon Bareket, Bazil Pârv",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11159/jmids.2023.06"
    },
    {
        "id": 11065,
        "title": "Time Series Data Forecasting System for Stock using TA and ARIMA Model",
        "authors": "Khin Nyein Myint, Yi Yi Hlaing",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca51723.2023.10181415"
    },
    {
        "id": 11066,
        "title": "APPLICATION OF LONG SHORT-TERM MEMORY (LSTM) NETWORKS APPROACH FOR RIVER WATER LEVEL FORECASTING USING MULTIPLE RIVER BASINS: A CASE STUDY FOR SRI LANKA",
        "authors": "Diani ABEYRATHNE, Ryo KANEKO, Kei YOSHIMURA",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2208/journalofjsce.23-16127"
    },
    {
        "id": 11067,
        "title": "An Extreme-Adaptive Time Series Prediction Model Based on Probability-Enhanced LSTM Neural Networks",
        "authors": "Yanhong Li, Jack Xu, David C. Anastasiu",
        "published": "2023-6-26",
        "citations": 2,
        "abstract": "Forecasting time series with extreme events has been a challenging and prevalent research topic, especially when the time series data are affected by complicated uncertain factors, such as is the case in hydrologic prediction. Diverse traditional and deep learning models have been applied to discover the nonlinear relationships and recognize the complex patterns in these types of data. However, existing methods usually ignore the negative influence of imbalanced data, or severe events, on model training. Moreover, methods are usually evaluated on a small number of generally well-behaved time series, which does not show their ability to generalize. To tackle these issues, we propose a novel probability-enhanced neural network model, called NEC+, which concurrently learns extreme and normal prediction functions and a way to choose among them via selective back propagation. We evaluate the proposed model on the difficult 3-day ahead hourly water level prediction task applied to 9 reservoirs in California. Experimental results demonstrate that the proposed model significantly outperforms state-of-the-art baselines and exhibits superior generalization ability on data with diverse distributions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i7.26045"
    },
    {
        "id": 11068,
        "title": "Rainfall time series forecasting using ARIMA model",
        "authors": "Swagatam Bora, Abhilash Hazarika",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaia57370.2023.10169493"
    },
    {
        "id": 11069,
        "title": "Time Series Forecasting of the Philippine CPI Using an Autoregressive Integrated Moving Average (ARIMA) Model",
        "authors": "Adrianne Maurisen Navarro",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4784200"
    },
    {
        "id": 11070,
        "title": "Analysis of Foreign Direct Investment Net Inflows in the Philippines: Trends, Predictors, and Forecasting Using Time Series and Linear Regression Models",
        "authors": "Jennifer R. Gacad",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.823.50826"
    },
    {
        "id": 11071,
        "title": "Short-Term Forecasting of Rainfall Using Sequentially Deep LSTM Networks: A Case Study on a Semi-Arid Region",
        "authors": "Ilias Chamatidis, Georgios Tzanes, Denis Istrati, Nikos D. Lagaros, Anastasios Stamou",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/environsciproc2023026157"
    },
    {
        "id": 11072,
        "title": "Forecasting Indian Goods and Services Tax revenue using TBATS, ETS, Neural Networks, and hybrid time series models",
        "authors": "P.V. Thayyib, Muhammed Navas Thorakkattle, Faisal Usmani, Ali T Yahya, Najib H.S Farhan",
        "published": "2023-10-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/23322039.2023.2285649"
    },
    {
        "id": 11073,
        "title": "Time-Series Anomaly Detection in Automated Vehicles Using D-CNN-LSTM Autoencoder",
        "authors": "Fatemeh Khanmohammadi, Reza Azmi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tits.2024.3380263"
    },
    {
        "id": 11074,
        "title": "Flood Forecasting Using Hybrid LSTM and GRU Models with Lag Time Preprocessing",
        "authors": "Yue Zhang, Zimo Zhou, Jesse Van Griensven Thé, Simon X. Yang, Bahram Gharabaghi",
        "published": "2023-11-16",
        "citations": 1,
        "abstract": "Climate change and urbanization have increased the frequency of floods worldwide, resulting in substantial casualties and property loss. Accurate flood forecasting can offer governments early warnings about impending flood disasters, giving them a chance to evacuate and save lives. Deep learning is used in flood forecasting to improve the timeliness and accuracy of flood water level predictions. While various deep learning models similar to Long Short-Term Memory (LSTM) have achieved notable results, they have complex structures with low computational efficiency, and often lack generalizability and stability. This study applies a spatiotemporal Attention Gated Recurrent Unit (STA-GRU) model for flood prediction to increase the models’ computing efficiency. Another salient feature of our methodology is the incorporation of lag time during data preprocessing before the training of the model. Notably, for 12-h forecasting, the STA-GRU model’s R-squared (R2) value increased from 0.8125 to 0.9215. Concurrently, the model manifested reduced root mean squared error (RMSE) and mean absolute error (MAE) metrics. For a more extended 24-h forecasting, the R2 value of the STA-GRU model improved from 0.6181 to 0.7283, accompanied by diminishing RMSE and MAE values. Seven typical deep learning models—the LSTM, the Convolutional Neural Networks LSTM (CNNLSTM), the Convolutional LSTM (ConvLSTM), the spatiotemporal Attention Long Short-Term Memory (STA-LSTM), the GRU, the Convolutional Neural Networks GRU (CNNGRU), and the STA-GRU—are compared for water level prediction. Comparative analysis delineated that the use of the STA-GRU model and the application of the lag time pre-processing method significantly improved the reliability and accuracy of flood forecasting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/w15223982"
    },
    {
        "id": 11075,
        "title": "Retail Time Series Forecasting Using An Automated Deep Meta-Learning Framework",
        "authors": "Mohammad Joshaghani, Sasan Barak, Amirabbas Asadi, Ehsan Mirafzali",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4393300"
    },
    {
        "id": 11076,
        "title": "Website Traffic Time Series Forecasting Using Regression Machine Learning",
        "authors": "Dhruv Sikka, C.N.S. Vinoth Kumar",
        "published": "2023-4-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnt57126.2023.10134631"
    },
    {
        "id": 11077,
        "title": "Delhi Air Pollution Prediction: A Comparative Analysis using Time Series Forecasting",
        "authors": "Sparsh Singh, Vidit Kumar, Zaid Ahmed, Kajol Mittal",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt57929.2023.10151445"
    },
    {
        "id": 11078,
        "title": "Forecasting of Short-Term and Long-Term Wind Speed of Ras Gharib Using Time Series Analysis",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20508/ijrer.v13i1.13785.g8680"
    },
    {
        "id": 11079,
        "title": "Analysis and Forecasting of Saudi Stock Market Using Time Series Algorithms",
        "authors": "Razan Ahmed Alasiri, Ayman Qahmash",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccit58132.2023.10273971"
    },
    {
        "id": 11080,
        "title": "Electrical Load Forecasting Using LSTM, GRU, and RNN Algorithms",
        "authors": "Mobarak Abumohsen, Amani Yousef Owda, Majdi Owda",
        "published": "2023-2-27",
        "citations": 31,
        "abstract": "Forecasting the electrical load is essential in power system design and growth. It is critical from both a technical and a financial standpoint as it improves the power system performance, reliability, safety, and stability as well as lowers operating costs. The main aim of this paper is to make forecasting models to accurately estimate the electrical load based on the measurements of current electrical loads of the electricity company. The importance of having forecasting models is in predicting the future electrical loads, which will lead to reducing costs and resources, as well as better electric load distribution for electric companies. In this paper, deep learning algorithms are used to forecast the electrical loads; namely: (1) Long Short-Term Memory (LSTM), (2) Gated Recurrent Units (GRU), and (3) Recurrent Neural Networks (RNN). The models were tested, and the GRU model achieved the best performance in terms of accuracy and the lowest error. Results show that the GRU model achieved an R-squared of 90.228%, Mean Square Error (MSE) of 0.00215, and Mean Absolute Error (MAE) of 0.03266.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16052283"
    },
    {
        "id": 11081,
        "title": "Forecasting the Composite Stock Price Index Using Fuzzy Time Series Type 2",
        "authors": "Arsita Anggraeni Pramesti, Winita Sulandari, Sri Subanti, Yudho Yudhanto",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "The movement and fluctuation of the IHSG are one of the references for investors in making investment decisions for buying, selling, or holding share ownership. Forecasting the value of the IHSG can assist investors in making this decision. This study used the fuzzy time series type 2 method to predict the IHSG. This study uses monthly IHSG data for 2017-2021 with 3 variables, namely close prices, high prices, and low prices. In fuzzy time series forecasting, the length of the interval affects the prediction results. This study uses a distribution and average-based method in determining the length of the interval to obtain optimal forecasting results. Based on the calculation of MAPE, the forecasting using average-based and distribution-based interval lengths had errors of 2.56% and 2.46%. The MAPE value shows that the forecasting results from the two methods of taking the length of the interval are very good. The IHSG forecasting results in January 2022 use a distribution-based interval length is 6450 while the IHSG forecasting results in January 2022 use an average-based interval length is 6510. The results of this study indicate that the interval length affects the forecasting results in fuzzy time series.\r\n \r\nKeywords: IHSG, fuzzy time series type 2, length of the interval, MAPE",
        "keywords": "",
        "link": "http://dx.doi.org/10.52187/rdt.v4i2.167"
    },
    {
        "id": 11082,
        "title": "An air quality forecasting method using fuzzy time series with butterfly optimization algorithm",
        "authors": "Samit Bhanja, Abhishek Das",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00542-023-05591-x"
    },
    {
        "id": 11083,
        "title": "Conditional Temporal Aggregation for Time Series Forecasting Using Feature-Based Meta-Learning",
        "authors": "Anastasios Kaltsounis, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-4-12",
        "citations": 0,
        "abstract": "We present a machine learning approach for applying (multiple) temporal aggregation in time series forecasting settings. The method utilizes a classification model that can be used to either select the most appropriate temporal aggregation level for producing forecasts or to derive weights to properly combine the forecasts generated at various levels. The classifier consists a meta-learner that correlates key time series features with forecasting accuracy, thus enabling a dynamic, data-driven selection or combination. Our experiments, conducted in two large data sets of slow- and fast-moving series, indicate that the proposed meta-learner can outperform standard forecasting approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16040206"
    },
    {
        "id": 11084,
        "title": "Forecasting husbandry development using time series",
        "authors": "Anatolii Kulyk, Kateryna Fokina-Mezentseva, Oksana Piankova, Liudmyla Sierova, Maryna Slokva",
        "published": "2023-9-20",
        "citations": 1,
        "abstract": "Building time series models based on historical data is a pressing challenge in the agricultural sector. This is essential, as analysing and predicting processes related to the food security of the state, region, and business entities are of paramount importance in management. With the help of forecasts, enterprises can adjust their production activities in such a way as to satisfy demand and deliver products to consumers on time. The research aims to predict the trends in the growth of cattle and cow populations and identify the most suitable forecasting timeframe. Statistical methods related to autoregression are used for this type of analysis: autoregressive models, moving average models or a combination of both, integrated variable structure models, and models that include seasonal effects and exogenous factors with an autoregressive and moving average component in the model. Monthly statistical data on the number of cattle and cows are used, among them mean, standard deviation, minimum and maximum values, asymmetry, and kurtosis. The dynamics of the decrease in the number of cattle and cows are shown. The studied series were checked for stationarity. The time series data for the cattle population underwent a Box-Cox transformation. The optimal parameters of the models used are given. Predictive values for periods (months) were obtained and the change in the number of cattle over the last 15 years was analysed. Constructed time series are compared with the actual values, which are illustrated in the graphs. Estimates of rootmean-square deviation, and mean absolute percentage error for different forecasting terms are given. By comparing these estimates for different time intervals, the optimal period for the forecast (24 months) was determined. This study allows farms and enterprises in the industry to predict a possible number of products (milk, meat) that could be collected or obtained in the future. It helps to take the necessary management steps: plan resource needs, improve efficiency, increase profits, reduce costs, and adapt to changes in the market",
        "keywords": "",
        "link": "http://dx.doi.org/10.48077/scihor11.2023.166"
    },
    {
        "id": 11085,
        "title": "Stock Price Prediction Using Time Series Forecasting",
        "authors": "Ashish Kumar",
        "published": "2023-5-31",
        "citations": 1,
        "abstract": "Abstract: Accurately predicting stock market returns is a very difficult task due to the volatile and non-linear nature of financial stock markets. With the advent of artificial intelligence and increasing computing power, programmed forecasting methods have proven to be more efficient in predicting stock prices. In this work, artificial neural networks and random forest techniques are used to, predicted the next day's closing prices for five companies in various industries. Financial Data: Use the opening, high, low and closing prices to create new variables that will be used as inputs to the model. The model is evaluated against the standard strategy metrics RMSE and MAPE. The low values of these two indicators indicate that the model is efficient in predicting the closing price of the stock. Accurately predicting stock market returns is a very difficult task due to the volatile and non-linear nature of financial stock markets. With the advent of artificial intelligence and increasing computing power, programmed forecasting methods have proven to be more efficient in predicting stock prices. In this work, artificial neural networks and random forest techniques are used to, predicted the next day's closing prices for five companies in various industries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.53255"
    },
    {
        "id": 11086,
        "title": "Wearable Data Generation Using Time-Series Generative Adversarial Networks for Hydration Monitoring",
        "authors": "Farida Sabry, Wadha Labda, Tamer Eltaras, Fatima Hamza, Khawla Alzoubi, Qutaibah Malluhi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011757200003414"
    },
    {
        "id": 11087,
        "title": "Air Quality Time Series Forecasting Using Machine Learning Algorithms",
        "authors": "Fernanda Carlés, Carolina Recalde, Carlos Sauer, Luis Bernal, Diego Stalder",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/clei60451.2023.10346175"
    },
    {
        "id": 11088,
        "title": "Robust training of median dendritic artificial neural networks for time series forecasting",
        "authors": "Eren Bas, Erol Egrioglu, Turan Cansu",
        "published": "2024-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122080"
    },
    {
        "id": 11089,
        "title": "Real Time Indian Sign Language Recognition using Deep LSTM Networks",
        "authors": "Jainam Rambhia, Manan Doshi, Rashi Lodha, Stevina Correia",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Abstract: On our planet, people with speech and hearing disabilities are part of society. Communication becomes difficult when it is necessary to interact with survivors and the general public. In some races, people with disabilities practice different sign languages for communication. For people with speech and hearing disabilities, sign language is a basic means of communication in everyday life. However, a large portion of our community is unaware of the sign languages they practice, so bringing them into the mainstream is an incredible challenge. Today, computer vision-based solutions are still well received for helping the general public understand sign language. Many analysts are trying out one of his computer vision-based sign language recognition solutions, Recognition of Hand Gesture. Lately it’s been a popular area of research in various vernacular languages being used across the world. Through this research work, we propose a solution to this problem using Keypoint identification and Neural Network architecture for real time sign language recognition. This architecture uses a Long Short Term Memory architecture (LSTM) giving the best accuracy of 91.5% in prediction of words as well as phrases of Indian Sign Language",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.48695"
    },
    {
        "id": 11090,
        "title": "Time series online forecasting based on sequence decomposition learning networks",
        "authors": "Yunpeng Ma, Chenheng Xu, Hua Wang, Shengkai Liu, Xiaoying Gu",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110907"
    },
    {
        "id": 11091,
        "title": "Near Real-Time Load Forecasting of Power System Using Fuzzy Time Series, Artificial Neural Networks, and Wavelet Transform Models",
        "authors": "Shahida Khatoon,  Ibraheem, Mohammad Shahid, Gulshan Sharma, Emre Çelik, Erdal Bekiroğlu, Mohammad Faraz Ahmer,  Priti",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15325008.2023.2235586"
    },
    {
        "id": 11092,
        "title": "Time Series Dataset Survey for Forecasting with Deep Learning",
        "authors": "Yannik Hahn, Tristan Langer, Richard Meyes, Tobias Meisen",
        "published": "2023-3-3",
        "citations": 2,
        "abstract": "Deep learning models have revolutionized research fields like computer vision and natural language processing by outperforming traditional models in multiple tasks. However, the field of time series analysis, especially time series forecasting, has not seen a similar revolution, despite forecasting being one of the most prominent tasks of predictive data analytics. One crucial problem for time series forecasting is the lack of large, domain-independent benchmark datasets and a competitive research environment, e.g., annual large-scale challenges, that would spur the development of new models, as was the case for CV and NLP. Furthermore, the focus of time series forecasting research is primarily domain-driven, resulting in many highly individual and domain-specific datasets. Consequently, the progress in the entire field is slowed down due to a lack of comparability across models trained on a single benchmark dataset and on a variety of different forecasting challenges. In this paper, we first explore this problem in more detail and derive the need for a comprehensive, domain-unspecific overview of the state-of-the-art of commonly used datasets for prediction tasks. In doing so, we provide an overview of these datasets and improve comparability in time series forecasting by introducing a method to find similar datasets which can be utilized to test a newly developed model. Ultimately, our survey paves the way towards developing a single widely used and accepted benchmark dataset for time series data, built on the various frequently used datasets surveyed in this paper.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/forecast5010017"
    },
    {
        "id": 11093,
        "title": "Outlier detection and imputation of missing data in stock related time series mulitivariate data using LSTM autoencoder",
        "authors": "Swati Jain, Naveen Choudhary, Kalpana Jain",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.62110/sciencein.jist.2024.v12.761"
    },
    {
        "id": 11094,
        "title": "Predicting Bitcoin Prices for the Next 30 Days Using LSTM-Based Time Series Analysis",
        "authors": "M. Vani Pujitha, K. Santan Kumar, D. Igna Sree, P. Yamini Devi",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425597"
    },
    {
        "id": 11095,
        "title": "Combining multiplex networks and time series: A new way to optimize real estate forecasting in New York using cab rides",
        "authors": "Sergio Iglesias Pérez, Santiago Moral-Rubio, Regino Criado",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2022.128306"
    },
    {
        "id": 11096,
        "title": "Solar Photovoltaic Generation Forecasting using LSTM and SARIMAX model",
        "authors": "C Vanlalchhuanawmi, Subhasish Deb",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icidea59866.2023.10295240"
    },
    {
        "id": 11097,
        "title": "Early Prediction of Sepsis Using Time Series Forecasting",
        "authors": "Jinghua Xu, Natalia Minakova, Pablo Ortega Sanchez, Stefan Riezler",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/e-science58273.2023.10254852"
    },
    {
        "id": 11098,
        "title": "Forecasting Time Series Data Using Haar Discrete Wavelet Transformation",
        "authors": "Hartina Husain, Amran Amran",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Discrete Wavelet Transform is a data transformation method that represents data in the time domain and frequency domain. This transformation appears to overcome the weakness of the Fourier transform which is only able to provide one domain information and is limited to certain windowing . The type of wavelet used is the Haar Wavelet. Identification of data periodicity using Periodogram analysis with Fisher's Test statistics. The transformed data is decomposed into two components, namely the Approximation Coefficient and the Detail Coefficient. Both components are predicted using the Box-Jenkins ARIMA method. Model selection was carried out using the Akaike Information Criterion (AIC ) and Mean Square Error (MSE) methods . The forecast obtained is then reconstructed into the time domain (inverse). The application of the ARIMA model through wavelet transformation to Makassar City Air Humidity data for the period September 2006 - December 2012 shows that forecasting on the Approximation Coefficient obtained by the ARIMA model (0,0,3) with AIC = 112.2142 and MSE = 29.673. While forecasting on Detailed Coefficients is obtained by the ARIMA model (2,1,0) with AIC = 89.2 and MSE = 15,989.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20956/j.v19i3.24807"
    },
    {
        "id": 11099,
        "title": "Online time-series forecasting using spiking reservoir",
        "authors": "Arun M. George, Sounak Dey, Dighanchal Banerjee, Arijit Mukherjee, Manan Suri",
        "published": "2023-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2022.10.067"
    },
    {
        "id": 11100,
        "title": "Improving Stock Market Forecasting Using Advanced Time Series Analysis Techniques",
        "authors": "Shivamshu Roy, Vimal Kumar, Umesh Gupta",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvmi59935.2023.10465177"
    },
    {
        "id": 11101,
        "title": "Time series forecasting and anomaly detection using deep learning",
        "authors": "Amjad Iqbal, Rashid Amin",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compchemeng.2023.108560"
    },
    {
        "id": 11102,
        "title": "Time series forecasting on cooling degree-days (CDD) using SARIMA model",
        "authors": "Mehmet Bilgili",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11069-023-06109-4"
    },
    {
        "id": 11103,
        "title": "Assessment of Stacked LSTM, Bidirectional LSTM, ConvLSTM2D, and Auto Encoders LSTM Time Series Regression Analysis at ADITYA-U Tokamak",
        "authors": "Ramesh Joshi, Joydeep Ghosh, Nilesh Kalani, R. L. Tanna",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tps.2024.3355283"
    },
    {
        "id": 11104,
        "title": "Bootstrapping Long-Run Covariance of Stationary Functional Time Series",
        "authors": "Han Lin Shang",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "A key summary statistic in a stationary functional time series is the long-run covariance function that measures serial dependence. It can be consistently estimated via a kernel sandwich estimator, which is the core of dynamic functional principal component regression for forecasting functional time series. To measure the uncertainty of the long-run covariance estimation, we consider sieve and functional autoregressive (FAR) bootstrap methods to generate pseudo-functional time series and study variability associated with the long-run covariance. The sieve bootstrap method is nonparametric (i.e., model-free), while the FAR bootstrap method is semi-parametric. The sieve bootstrap method relies on functional principal component analysis to decompose a functional time series into a set of estimated functional principal components and their associated scores. The scores can be bootstrapped via a vector autoregressive representation. The bootstrapped functional time series are obtained by multiplying the bootstrapped scores by the estimated functional principal components. The FAR bootstrap method relies on the FAR of order 1 to model the conditional mean of a functional time series, while residual functions can be bootstrapped via independent and identically distributed resampling. Through a series of Monte Carlo simulations, we evaluate and compare the finite-sample accuracy between the sieve and FAR bootstrap methods for quantifying the estimation uncertainty of the long-run covariance of a stationary functional time series.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/forecast6010008"
    }
]