[
    {
        "id": 22571,
        "title": "Deep Multiple Instance Learning for Forecasting Stock Trends using Financial NewsDeep Multiple Instance Learning for Forecasting Stock Trends using Financial News",
        "authors": "Yiqi DENG, Siu Ming YIU",
        "published": "2022-6-18",
        "citations": 0,
        "abstract": "A major source of information can be taken from financial news articles, which have some correlations about the fluctuation of stock trends. In this paper, we investigate the influences of financial news on the stock trends, from a multi-instance view. The intuition behind this is based on the news uncertainty of varying intervals of news occurrences and the lack of annotation in every single financial news. Under the scenario of Multiple Instance Learning (MIL) where training instances are arranged in bags, and a label is assigned for the entire bag instead of instances, we develop a flexible and adaptive multi-instance learning model and evaluate its ability in directional movement forecast of Standard & Poor’s 500 index on financial news dataset. Specifically, we treat each trading day as one bag, with certain amounts of news happening on each trading day as instances in each bag. Experiment results demonstrate that our proposed multi-instance-based framework gains outstanding results in terms of the accuracy of trend prediction, compared with other state-of-art approaches and baselines.",
        "link": "http://dx.doi.org/10.5121/csit.2022.121008"
    },
    {
        "id": 22572,
        "title": "Financial Time Series Forecasting – A Deep Learning Approach",
        "authors": "Alexiei Dingli,  , Karl Sant Fournier",
        "published": "2017-10",
        "citations": 61,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijmlc.2017.7.5.632"
    },
    {
        "id": 22573,
        "title": "Comparative Analysis of Machine Learning, Hybrid, and Deep Learning Forecasting Models: Evidence from European Financial Markets and Bitcoins",
        "authors": "Apostolos Ampountolas",
        "published": "2023-6-20",
        "citations": 3,
        "abstract": "This study analyzes the transmission of market uncertainty on key European financial markets and the cryptocurrency market over an extended period, encompassing the pre-, during, and post-pandemic periods. Daily financial market indices and price observations are used to assess the forecasting models. We compare statistical, machine learning, and deep learning forecasting models to evaluate the financial markets, such as the ARIMA, hybrid ETS-ANN, and kNN predictive models. The study results indicate that predicting financial market fluctuations is challenging, and the accuracy levels are generally low in several instances. ARIMA and hybrid ETS-ANN models perform better over extended periods compared to the kNN model, with ARIMA being the best-performing model in 2018–2021 and the hybrid ETS-ANN model being the best-performing model in most of the other subperiods. Still, the kNN model outperforms the others in several periods, depending on the observed accuracy measure. Researchers have advocated using parametric and non-parametric modeling combinations to generate better results. In this study, the results suggest that the hybrid ETS-ANN model is the best-performing model despite its moderate level of accuracy. Thus, the hybrid ETS-ANN model is a promising financial time series forecasting approach. The findings offer financial analysts an additional source that can provide valuable insights for investment decisions.",
        "link": "http://dx.doi.org/10.3390/forecast5020026"
    },
    {
        "id": 22574,
        "title": "Forecasting Stock Market Trends using Deep Learning on Financial and Textual Data",
        "authors": "Georgios-Markos Chatziloizos, Dimitrios Gunopulos, Konstantinos Konstantinou",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010618801050114"
    },
    {
        "id": 22575,
        "title": "Forecasting Stock Market Trends using Deep Learning on Financial and Textual Data",
        "authors": "Georgios-Markos Chatziloizos, Dimitrios Gunopulos, Konstantinos Konstantinou",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010618800002993"
    },
    {
        "id": 22576,
        "title": "Peer Review #1 of \"Empirical mode decomposition using deep learning model for financial market forecasting (v0.2)\"",
        "authors": "",
        "published": "2022-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1076v0.2/reviews/1"
    },
    {
        "id": 22577,
        "title": "Peer Review #2 of \"Empirical mode decomposition using deep learning model for financial market forecasting (v0.2)\"",
        "authors": "",
        "published": "2022-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1076v0.2/reviews/2"
    },
    {
        "id": 22578,
        "title": "Peer Review #2 of \"Empirical mode decomposition using deep learning model for financial market forecasting (v0.1)\"",
        "authors": "",
        "published": "2022-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1076v0.1/reviews/2"
    },
    {
        "id": 22579,
        "title": "Peer Review #3 of \"Empirical mode decomposition using deep learning model for financial market forecasting (v0.1)\"",
        "authors": "",
        "published": "2022-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1076v0.1/reviews/3"
    },
    {
        "id": 22580,
        "title": "Peer Review #1 of \"Empirical mode decomposition using deep learning model for financial market forecasting (v0.1)\"",
        "authors": "",
        "published": "2022-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1076v0.1/reviews/1"
    },
    {
        "id": 22581,
        "title": "Factor Selection with Deep Reinforcement Learning for Financial Forecasting",
        "authors": "Ziwei Wang, Nelson Leung",
        "published": "No Date",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3128678"
    },
    {
        "id": 22582,
        "title": "Enterprise financial forecasting based on machine deep learning",
        "authors": "Qian Gao, Siwei Xia",
        "published": "2022-6-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaica54878.2022.9844609"
    },
    {
        "id": 22583,
        "title": "Forecasting Financial Markets using Deep Learning",
        "authors": "Razvan Zanc, Tudor Cioara, Ionut Anghel",
        "published": "2019-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccp48234.2019.8959715"
    },
    {
        "id": 22584,
        "title": "Deep Learning–Based Financial Forecasting of NSE Using Sentiment Analysis",
        "authors": "Aditya Agarwal, Romit Ganjoo, Harsh Panchal, Suchitra Khojewe",
        "published": "2022-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003307822-18"
    },
    {
        "id": 22585,
        "title": "A Novel Financial Forecasting Approach Using Deep Learning Framework",
        "authors": "Yunus Santur",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10614-023-10403-5"
    },
    {
        "id": 22586,
        "title": "Combining Deep Learning and GARCH Models for Financial Volatility and Risk Forecasting",
        "authors": "Jakub Michańków, Łukasz Kwiatkowski, Janusz Morajda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4589950"
    },
    {
        "id": 22587,
        "title": "FORECASTING FINANCIAL VOLATILITY USING DEEP LEARNING APPROACH",
        "authors": "Yaroslav Verbytskyi,  ",
        "published": "2022-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30525/978-9934-26-269-2-25"
    },
    {
        "id": 22588,
        "title": "Deep Learning-Based Automated Learning Environment Using Smart Data to Improve Corporate Marketing, Business Strategies, Fraud Detection in Financial Services, and Financial Time Series Forecasting",
        "authors": "Zair Bouzidi, Mourad Amad, Abdelmalek Boudries",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-06971-0_26"
    },
    {
        "id": 22589,
        "title": "Cryptocurrency price forecasting – A comparative analysis of ensemble learning and deep learning methods",
        "authors": "Ahmed Bouteska, Mohammad Zoynul Abedin, Petr Hajek, Kunpeng Yuan",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.irfa.2023.103055"
    },
    {
        "id": 22590,
        "title": "Financial Forecasting using Deep Learning with an Optimized Trading Strategy",
        "authors": "Anuar Maratkhan, Ibrakhim Ilyassov, Madiyar Aitzhanov, M. Fatih Demirci, Murat Ozbayoglu",
        "published": "2019-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec.2019.8789932"
    },
    {
        "id": 22591,
        "title": "Empirical mode decomposition using deep learning model for financial market forecasting",
        "authors": "Zebin Jin, Yixiao Jin, Zhiyun Chen",
        "published": "2022-9-14",
        "citations": 5,
        "abstract": "Financial market forecasting is an essential component of financial systems; however, predicting financial market trends is a challenging job due to noisy and non-stationary information. Deep learning is renowned for bringing out excellent abstract features from the huge volume of raw data without depending on prior knowledge, which is potentially fascinating in forecasting financial transactions. This article aims to propose a deep learning model that autonomously mines the statistical rules of data and guides the financial market transactions based on empirical mode decomposition (EMD) with back-propagation neural networks (BPNN). Through the characteristic time scale of data, the intrinsic wave pattern was obtained and then decomposed. Financial market transaction data were analyzed, optimized using PSO, and predicted. Combining the nonlinear and non-stationary financial time series can improve prediction accuracy. The predictive model of deep learning, based on the analysis of the massive financial trading data, can forecast the future trend of financial market price, forming a trading signal when particular confidence is satisfied. The empirical results show that the EMD-based deep learning model has an excellent predicting performance.",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1076"
    },
    {
        "id": 22592,
        "title": "A Hybrid Deep Learning Model for Cryptocurrency Returns Forecasting: Comparison of the Performance of Financial Markets and Impact of External Variables",
        "authors": "Ismail Jirou, Ikram Jebabli, Amine Lahiani",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4727350"
    },
    {
        "id": 22593,
        "title": "Association mining based deep learning approach for financial time-series forecasting",
        "authors": "Tanya Srivastava, Ishita Mullick, Jatin Bedi",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2024.111469"
    },
    {
        "id": 22594,
        "title": "Financial Profitability Evaluation and Forecasting Using the Deep Learning: A Case of the Chinese Petroleum Industry",
        "authors": "Xiaowei Ding",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14254/1800-5845/2023.19-4.5"
    },
    {
        "id": 22595,
        "title": "Financial Forecasting Through Hybrid Algorithms of Machine Learning &amp; Deep Learning",
        "authors": "Ramakrishnan Raman,  Kafila, Anita Gehlot, Heli Shah, Sanjay C. P, R. Ponnusamy",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10183025"
    },
    {
        "id": 22596,
        "title": "An Improved Deep-Learning-Based Financial Market Forecasting Model in the Digital Economy",
        "authors": "Yang Dexiang, Mu Shengdong, Yunjie Liu, Gu Jijian, Lien Chaolung",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "The high-complexity, high-reward, and high-risk characteristics of financial markets make them an important and interesting study area. Elliott’s wave theory describes the changing models of financial markets categorically in terms of wave models and is an advanced feature representation of financial time series. Meanwhile, deep learning is a breakthrough technique for nonlinear intelligent models, which aims to discover advanced feature representations of data and thus obtain the intrinsic laws underlying the data. This study proposes an innovative combination of these two concepts to create a deep learning + Elliott wave principle (DL-EWP) model. This model achieves the prediction of future market movements by extracting and classifying Elliott wave models from financial time series. The model’s effectiveness is empirically validated by running it on financial data from three major markets and comparing the results with those of the SAE, MLP, BP network, PCA-BP, and SVD-BP models. Interestingly, the DL-EWP model based on deep confidence networks outperforms other models in terms of stability, convergence speed, and accuracy and has a higher forecasting performance. Thus, the DL-EWP model can improve the accuracy of financial forecasting models that incorporate Elliott’s wave theory.",
        "link": "http://dx.doi.org/10.3390/math11061466"
    },
    {
        "id": 22597,
        "title": "Deep-learning models for forecasting financial risk premia and their interpretations",
        "authors": "Andrew W. Lo, Manish Singh",
        "published": "2023-6-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2023.2203844"
    },
    {
        "id": 22598,
        "title": "Investigation of hybrid deep learning networks and LSTM in the short term forecasting in financial sphere",
        "authors": "Yuriy Zaychenko, Oleksii Kuzmenko",
        "published": "2022-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csit56902.2022.10000555"
    },
    {
        "id": 22599,
        "title": "Deep learning for ensemble forecasting",
        "authors": "Rüdiger Brecht, Alexander Bihlo",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;div&gt;Ensemble prediction systems are an invaluable tool for weather prediction. Practically, ensemble predictions are obtained by&amp;#160;running several&amp;#160;perturbed numerical simulations. However, these systems are associated with a high computational cost and often involve statistical post-processing steps to improve their qualities.&lt;/div&gt;&lt;div&gt;Here we propose to use a deep-learning-based algorithm to learn the statistical properties of a given ensemble prediction system, such that this&amp;#160;system will not be needed&amp;#160;to simulate&amp;#160;future ensemble forecasts. This way, the high computational costs of the ensemble prediction&amp;#160;system can be avoided&amp;#160;while still obtaining&amp;#160;the statistical properties from a single deterministic forecast.&amp;#160;&lt;span&gt;We show preliminary results where we demonstrate the ensemble &lt;/span&gt;&lt;span&gt;prediction&lt;/span&gt;&lt;span&gt; properties for a shallow water unstable jet simulation on the sphere.&amp;#160;&lt;/span&gt;&lt;/div&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu22-2058"
    },
    {
        "id": 22600,
        "title": "Forecasting the Dubai financial market with a combination of momentum effect with a deep belief network",
        "authors": "Andreas Karathanasopoulos, Mohammed Osman",
        "published": "2019-7",
        "citations": 5,
        "abstract": "AbstractApplying recent advances in machine learning techniques, we propose a hybrid model to forecast the Dubai financial market general index. Particularly, we exploit a deep belief networks model that applies a restricted Boltzmann machine as its main component in combination with momentum effects. We also introduce an innovative way of selecting the inputs by using momentum effects. With this hybrid methodology we generate a prediction model along with a comparison of three different linear models. The results obtained from the hybrid model are better and more stable than the three linear models. The findings support that the hybrid model we applied will find their way into finance because of their reliability and good performance.",
        "link": "http://dx.doi.org/10.1002/for.2560"
    },
    {
        "id": 22601,
        "title": "Financial Market Forecasting using RNN, LSTM, BiLSTM, GRU and Transformer-Based Deep Learning Algorithms",
        "authors": "T.O. Kehinde, Waqar Ahmed Khan, Sai-Ho Chung",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46254/ev01.20230037"
    },
    {
        "id": 22602,
        "title": "Hybrid GMDH deep learning networks – analysis, optimization and applications in forecasting at financial sphere",
        "authors": "Yuriy Zaychenko, Helen Zaychenko, Galib Hamidov",
        "published": "2022-4-25",
        "citations": 2,
        "abstract": "In this paper, the new class of deep learning (DL) neural networks is considered and investigated — so-called hybrid DL networks based on self-organization method Group Method of Data Handling (GDMH). The application of GMDH enables not only to train neural weights, but also to construct the network structure as well. Different elementary neurons with two inputs may be used as nodes of this structure. So the advantage of such a structure is the small number of tuning parameters. In this paper, the optimization of parameters and the structure of hybrid neo-fuzzy networks was performed. The application of hybrid Dl networks for forecasting market indices was considered with various forecasting intervals: one day, one week, and one month. The experimental investigations of hybrid GMDH neo-fuzzy networks were carried out and comparison of its efficiency with FNN ANFIS in the forecasting problem was performed which enabled to estimate their efficiency and advantages.",
        "link": "http://dx.doi.org/10.20535/srit.2308-8893.2022.1.06"
    },
    {
        "id": 22603,
        "title": "Advanced Use of Blockchain And Deep Learning Technologies For Financial Forecasting",
        "authors": " Kafila, Rishi Raj, P. Pavithra, Soyabkhan Mehbubkhan Baloch, Sunil Adhav, Sampathirao Suneetha",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397731"
    },
    {
        "id": 22604,
        "title": "Review for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2020-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v1/review2"
    },
    {
        "id": 22605,
        "title": "Review for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2020-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v1/review1"
    },
    {
        "id": 22606,
        "title": "Review for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2021-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v2/review2"
    },
    {
        "id": 22607,
        "title": "Analysis of Financial Time Series Forecasting using Deep Learning Model",
        "authors": "Raghavendra Kumar, Pardeep Kumar, Yugal Kumar",
        "published": "2021-1-28",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/confluence51648.2021.9377158"
    },
    {
        "id": 22608,
        "title": "Review for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2021-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v2/review1"
    },
    {
        "id": 22609,
        "title": "Mathematical and Deep Learning Models Forecasting for Hydrological Time Series",
        "authors": "Lhoussaine El Mezouary, Bouabid El Mansouri, Samir Kabbaj",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010732000003101"
    },
    {
        "id": 22610,
        "title": "Single-point wind forecasting methods based on deep learning",
        "authors": "Hui Liu",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-823706-9.00004-1"
    },
    {
        "id": 22611,
        "title": "Out of the Box: Deep Learning for Volatility Forecasting",
        "authors": " Castro-Frederick, Omar",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52295/dcc.6639"
    },
    {
        "id": 22612,
        "title": "Forecasting Financial Time Series Using Deep Learning Networks: Evidence from Long-Short Term Memory and Gated Recurrent Unit",
        "authors": "Mohammadreza Ghadimpour, Seyed babak Ebrahimi",
        "published": "2022-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30699/ijf.2022.313164.1286"
    },
    {
        "id": 22613,
        "title": "Deep Learning for Demand Forecasting in the Fashion and Apparel Retail Industry",
        "authors": "Chandadevi Giri, Yan Chen",
        "published": "2022-6-20",
        "citations": 8,
        "abstract": "Compared to other industries, fashion apparel retail faces many challenges in predicting future demand for its products with a high degree of precision. Fashion products’ short life cycle, insufficient historical information, highly uncertain market demand, and periodic seasonal trends necessitate the use of models that can contribute to the efficient forecasting of products’ sales and demand. Many researchers have tried to address this problem using conventional forecasting models that predict future demands using historical sales information. While these models predict product demand with fair to moderate accuracy based on previously sold stock, they cannot fully be used for predicting future demands due to the transient behaviour of the fashion industry. This paper proposes an intelligent forecasting system that combines image feature attributes of clothes along with its sales data to predict future demands. The data used for this empirical study is from a European fashion retailer, and it mainly contains sales information on apparel items and their images. The proposed forecast model is built using machine learning and deep learning techniques, which extract essential features of the product images. The model predicts weekly sales of new fashion apparel by finding its best match in the clusters of products that we created using machine learning clustering based on products’ sales profiles and image similarity. The results demonstrated that the performance of our proposed forecast model on the tested or test items is promising, and this model could be effectively used to solve forecasting problems.",
        "link": "http://dx.doi.org/10.3390/forecast4020031"
    },
    {
        "id": 22614,
        "title": "Curriculum Learning in Deep Neural Networks for Financial Forecasting",
        "authors": "Allison Koenecke, Amita Gajewar",
        "published": "2020",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-37720-5_2"
    },
    {
        "id": 22615,
        "title": "Application of Data-driven Deep Learning Model in Global Precipitation Forecasting",
        "authors": "Wan Liu, Yongqiang Wang",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011176400003440"
    },
    {
        "id": 22616,
        "title": "Time Series Dataset Survey for Forecasting with Deep Learning",
        "authors": "Yannik Hahn, Tristan Langer, Richard Meyes, Tobias Meisen",
        "published": "2023-3-3",
        "citations": 2,
        "abstract": "Deep learning models have revolutionized research fields like computer vision and natural language processing by outperforming traditional models in multiple tasks. However, the field of time series analysis, especially time series forecasting, has not seen a similar revolution, despite forecasting being one of the most prominent tasks of predictive data analytics. One crucial problem for time series forecasting is the lack of large, domain-independent benchmark datasets and a competitive research environment, e.g., annual large-scale challenges, that would spur the development of new models, as was the case for CV and NLP. Furthermore, the focus of time series forecasting research is primarily domain-driven, resulting in many highly individual and domain-specific datasets. Consequently, the progress in the entire field is slowed down due to a lack of comparability across models trained on a single benchmark dataset and on a variety of different forecasting challenges. In this paper, we first explore this problem in more detail and derive the need for a comprehensive, domain-unspecific overview of the state-of-the-art of commonly used datasets for prediction tasks. In doing so, we provide an overview of these datasets and improve comparability in time series forecasting by introducing a method to find similar datasets which can be utilized to test a newly developed model. Ultimately, our survey paves the way towards developing a single widely used and accepted benchmark dataset for time series data, built on the various frequently used datasets surveyed in this paper.",
        "link": "http://dx.doi.org/10.3390/forecast5010017"
    },
    {
        "id": 22617,
        "title": "Research on Intelligent Forecasting of Financial Market Parameter Time Series Based on Deep Learning",
        "authors": "Enyang Zhu",
        "published": "2021-9-30",
        "citations": 0,
        "abstract": "Objectives: Deep learning has become the most representative and potential intelligent system modeling technology in artificial intelligence. However, the complexity of financial markets goes far beyond all economic games. Methods: This paper is devoted to the feasibility\n and efficiency of the deep-integration neural network model as one of the main paradigms of in-depth learning in the intelligent prediction of financial time. A prediction model of stack self-coding neural network composed of bottom stack self-coding and top regression neurons is proposed.\n Results: Firstly, the self-encoder unsupervised learning mechanism is used to identify and learn the time series, and the layers of the neural network are learned greedy layer by layer. Then the stack self-encoder is extended to the SAEP model with supervised mechanism, and the parameters\n learned by SAE are used. Used to initialize the neural network, and finally use the supervised learning to fine-tune the weights. Conclusion: The research results show that the model provides effective financial planning and decision-making basis for financial forecasting, maintains\n the healthy development of financial markets, and maximizes the benefits of profit-making institutions.",
        "link": "http://dx.doi.org/10.18001/trs.7.5.2.26"
    },
    {
        "id": 22618,
        "title": "Review for \"Application of deep learning for power system state forecasting\"",
        "authors": "Nafiu Nawar",
        "published": "2020-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v1/review3"
    },
    {
        "id": 22619,
        "title": "Peer Review #2 of \"Multi-step rainfall forecasting using deep learning approach (v0.1)\"",
        "authors": "",
        "published": "2021-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.514v0.1/reviews/2"
    },
    {
        "id": 22620,
        "title": "Peer Review #2 of \"Multi-step rainfall forecasting using deep learning approach (v0.2)\"",
        "authors": "",
        "published": "2021-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.514v0.2/reviews/2"
    },
    {
        "id": 22621,
        "title": "Deep Learning for Financial Time Series Forecasting in A-Trader System",
        "authors": "Jerzy Korczak, Marcin Hernes",
        "published": "2017-9-24",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15439/2017f449"
    },
    {
        "id": 22622,
        "title": "Deep Learning Approaches to Time Series Forecasting",
        "authors": "Abhishek Sharma, Sachin Kumar Jain",
        "published": "2021-7-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003102281-6"
    },
    {
        "id": 22623,
        "title": "Peer Review #1 of \"Multi-step rainfall forecasting using deep learning approach (v0.2)\"",
        "authors": "",
        "published": "2021-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.514v0.2/reviews/1"
    },
    {
        "id": 22624,
        "title": "Peer Review #1 of \"Multi-step rainfall forecasting using deep learning approach (v0.1)\"",
        "authors": "",
        "published": "2021-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.514v0.1/reviews/1"
    },
    {
        "id": 22625,
        "title": "An Optimization of Machine Learning Approaches in the Forecasting of Global Financial Stability",
        "authors": "Adyant Ranjan",
        "published": "No Date",
        "citations": 1,
        "abstract": "<p>In the current data-driven world, the significance of machine learning as a mechanism for making predictions is vital. This research dives into how supervised learning techniques can be used to predict whether a banking crisis will occur in areas of Africa, which can be generalized to determining the status of financial stability in all areas around the world. By applying different machine learning mechanisms, along with tuning the hyperparameters, the optimal machine learning technique was found to be a neural network with two hidden layers, both hidden layers having the ReLU activation function. These results demonstrate that through widespread implementation of this neural network, governmental and financial organizations can develop significant trends and predict when a state is in economic peril, allowing for sufficient financial, social, or other aid to be administered before situations deteriorate.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21273351"
    },
    {
        "id": 22626,
        "title": "An Optimization of Machine Learning Approaches in the Forecasting of Global Financial Stability",
        "authors": "Adyant Ranjan",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In the current data-driven world, the significance of machine learning as a mechanism for making predictions is vital. This research dives into how supervised learning techniques can be used to predict whether a banking crisis will occur in areas of Africa, which can be generalized to determining the status of financial stability in all areas around the world. By applying different machine learning mechanisms, along with tuning the hyperparameters, the optimal machine learning technique was found to be a neural network with two hidden layers, both hidden layers having the ReLU activation function. These results demonstrate that through widespread implementation of this neural network, governmental and financial organizations can develop significant trends and predict when a state is in economic peril, allowing for sufficient financial, social, or other aid to be administered before situations deteriorate.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21273351.v1"
    },
    {
        "id": 22627,
        "title": "Financial performance evaluation and forecasting of enterprises by the combination of PCA and CNN deep learning",
        "authors": "Ruisong Li, Hongjiu Liu, Yanrong Hu",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11704-023-2494-1"
    },
    {
        "id": 22628,
        "title": "Decision letter for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2020-11-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v1/decision1"
    },
    {
        "id": 22629,
        "title": "Revolutionizing Flood Forecasting with a Generalized Deep Learning Model",
        "authors": "Julian Hofmann, Adrian Holt",
        "published": "No Date",
        "citations": 0,
        "abstract": "The domain of spatial flood prediction is dominated by hydrodynamic models, which, while robust and adaptable, are often constrained by computational requirements and slow processing times. To address these limitations, the integration of Deep Learning (DL) models has emerged as a promising solution, offering the potential for rapid prediction capabilities, while maintaining a high output quality. However, a critical challenge with DL models lies in their requirement for retraining for each new domain area, based on the outputs of hydrodynamic simulations generated for that specific region. This need for domain-specific retraining hampers the scalability and quick deployment of DL models in diverse settings. Our research focuses on bridging this gap by developing a fully generalized DL model for flood prediction.\nFloodWaive's approach pivots on creating a DL model that can predict flood events rapidly and accurately across various regions without requiring retraining for each new domain area. The model is trained on a rich dataset derived from numerous hydrodynamic simulations, encompassing a wide spectrum of topographical conditions. This training is designed to enable the model to generalize its predictive capabilities across different domains and weather patterns, thus overcoming the traditional limitation of DL models in this field.\nInitial findings from the development phase are promising, showcasing the model's capability to process complex data and provide quick, accurate flood predictions. The success of this fully generalized DL modeling approach could revolutionize applications of flood predictions such as flood forecasting and risk analysis. Regarding the later, real-time evaluation of flood protection measures could become a reality. This would empower urban planners, emergency response teams, and environmental agencies with the ability to make informed decisions quickly, potentially saving lives and reducing economic losses.\nWhile this project is still in its developmental stages, the preliminary results point towards a significant leap in flood forecasting technology. The ultimate goal is to offer a universally deployable, real-time flood prediction tool, significantly enhancing our ability to mitigate the impact of floods worldwide.\n&#160;&#160;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-20907"
    },
    {
        "id": 22630,
        "title": "Review for \"Limits to ecological forecasting: Estimating uncertainty for critical transitions with deep learning\"",
        "authors": "",
        "published": "2022-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.14013/v1/review3"
    },
    {
        "id": 22631,
        "title": "Analysis and Forecasting of Financial Time Series Using CNN and LSTM-Based Deep Learning Models",
        "authors": "Sidra Mehtab, Jaydip Sen",
        "published": "2022",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-4807-6_39"
    },
    {
        "id": 22632,
        "title": "A deep learning hierarchical approach to road traffic forecasting",
        "authors": "Redouane Benabdallah Benarmas, Kadda Beghdad Bey",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "AbstractTraffic forecasting is a crucial task of an Intelligent Transportation System (ITS), which remains very challenging as it is affected by the complexity and depth of the road network. Although the decision‐makers focus on the accuracy of the top‐level roads, the forecasts on the lower levels also improve the overall performance of ITS. In such a situation, a hierarchical forecasting strategy is more appropriate as well as a more accurate prediction methods to reach an efficient forecast. In this paper, we present a deep learning (DL) approach for hierarchical forecasting of traffic flow by exploring the hierarchical structure of the road network. The proposed approach is considered an improved variation on the top‐down strategy for the reconciliation process. We propose a model based on two deep neural network components to generate a coherent forecast for the total number of road segments. We use N‐BEATS, a pure deep learning forecasting method, at the highest levels for traffic time series, then disaggregate these downwards to get coherent forecasts for each series of the hierarchy using a combination of CNN and LSTM. Experiments were carried out using Beijing road traffic dataset to demonstrate the effectiveness of the approach.",
        "link": "http://dx.doi.org/10.1002/for.3075"
    },
    {
        "id": 22633,
        "title": "Probabilistic streamflow forecasting using generative deep learning models",
        "authors": "Mohammad Sina Jahangir, John Quilty",
        "published": "No Date",
        "citations": 0,
        "abstract": "The significance of probabilistic hydrological forecasting has grown in recent years, offering crucial insights for risk-based decision-making and effective flood management. This study explores generative deep learning models, specifically the conditional variational autoencoder (CVAE), for probabilistic streamflow forecasting. This innovative approach is applied for forecasting streamflow one to seven days (s) ahead in 75 Canadian basins included in the open-source Canadian model parameter experiment (CANOPEX) database. CVAE is compared against two benchmark quantile-based deep learning models: the quantile-based encoder-decoder (ED) and the quantile-based CVAE (QCVAE).\nOver 9000 deep learning models are developed based on different input variables, basin characteristics, and model structures and evaluated regarding point forecast accuracy and forecast reliability. Results highlight CVAE&#8216;s superior reliability, showing a median reliability of 92.49% compared to 87.35% for ED and 84.59% for QCVAE (considering a desired 90% confidence level). However, quantile-based forecast models exhibit marginally better point forecasts, as evidenced by Kling-Gupta efficiency (KGE), with a median KGE of 0.90 for ED and QCVAE (compared to 0.88 for CVAE). Notably, the CVAE model provides reliable probabilistic forecasts in basins with low point forecast accuracy.\nThe developed generative deep learning models can be used as a benchmark for probabilistic streamflow forecasting due to the use of the open-source CANOPEX dataset. Overall, the results of this study contribute to the expanding field of generative deep learning models in hydrological forecasting, offering a general framework that applies to forecasting other hydrological variables as well (precipitation and soil moisture).",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-2939"
    },
    {
        "id": 22634,
        "title": "Decision letter for \"Application of deep learning for power system state forecasting\"",
        "authors": "",
        "published": "2021-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/2050-7038.12901/v2/decision1"
    },
    {
        "id": 22635,
        "title": "Review for \"Limits to ecological forecasting: Estimating uncertainty for critical transitions with deep learning\"",
        "authors": "",
        "published": "2022-6-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.14013/v1/review2"
    },
    {
        "id": 22636,
        "title": "Is Deep-Learning and Natural Language Processing Transcending the Financial Forecasting? Investigation Through Lens of News Analytic Process",
        "authors": "Faisal Khalil, Gordon Pipa",
        "published": "2022-6",
        "citations": 6,
        "abstract": "AbstractThis study tries to unravel the stock market prediction puzzle using the textual analytic with the help of natural language processing (NLP) techniques and Deep-learning recurrent model called long short term memory (LSTM). Instead of using count-based traditional sentiment index methods, the study uses its own sum and relevance based sentiment index mechanism. Hourly price data has been used in this research as daily data is too late and minutes data is too early for getting the exclusive effect of sentiments. Normally, hourly data is extremely costly and difficult to manage and analyze. Hourly data has been rarely used in similar kinds of researches. To built sentiment index, text analytic information has been parsed and analyzed, textual information that is relevant to selected stocks has been collected, aggregated, categorized, and refined with NLP and eventually converted scientifically into hourly sentiment index. News analytic sources include mainstream media, print media, social media, news feeds, blogs, investors’ advisory portals, experts’ opinions, brokers updates, web-based information, company’ internal news and public announcements regarding policies and reforms. The results of the study indicate that sentiments significantly influence the direction of stocks, on average after 3–4 h. Top ten companies from High-tech, financial, medical, automobile sectors are selected, and six LSTM models, three for using text-analytic and other without analytic are used. Every model includes 1, 3, and 6 h steps back. For all sectors, a 6-hour steps based model outperforms the other models due to LSTM specialty of keeping long term memory. Collective accuracy of textual analytic models is way higher relative to non-textual analytic models.",
        "link": "http://dx.doi.org/10.1007/s10614-021-10145-2"
    },
    {
        "id": 22637,
        "title": "Stock Volatility Forecasting: Adopting LSTM Deep Learning Method and Comparing the Results with GARCH Family Model",
        "authors": "Tian Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4108/eai.28-10-2022.2328447"
    },
    {
        "id": 22638,
        "title": "Deep Reinforcement Learning and Transfer Learning Methods Used in Autonomous Financial Trading Agents",
        "authors": "Ciprian Paduraru, Catalina Patilea, Stefan Iordache",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012194000003636"
    },
    {
        "id": 22639,
        "title": "Forecasting COVID-19 Spreading in Canada using Deep Learning",
        "authors": "Fadoua Khennou, Moulay A. Akhloufi",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractThe novel coronavirus disease 2019 (COVID-19) is disrupting all aspects of our lives as the global spread of the virus continues. In this difficult period, various research projects are taking place to study and analyse the dynamics of the pandemic. In the present work, we firstly present a deep overview of the main forecasting models to predict the new cases of COVID-19. In this context, we focus on univariate time series models in order to analyze the dynamic change of this pandemic through time. We secondly shed light on multivariate time series forecasting models using weather and daily tests data, to study the impact of exogenous features on the progression of COVID-19. In the final stage of this paper, we present our proposed approach based on LSTM and GRU ensemble learning model and evaluate the results using the MAE, RMSE and MAPE for the prediction of new cases. The results of our experiments using the Canadian dataset show that the ensemble model performs well in comparison to other models. In addition, this research provides us with a new outcome regarding the dynamic correlation between temperature, humidity and daily test data and its impact on the new contaminated cases.",
        "link": "http://dx.doi.org/10.1101/2021.05.01.21256447"
    },
    {
        "id": 22640,
        "title": "A Study on Stock Forecasting Using Deep Learning and Statistical Models",
        "authors": "Aditya Jaiswal",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPredicting a fast and accurate model for stock price forecasting is been a challenging task and this is an active area of research where it is yet to be found which is the best way to forecast the stock price. Machine learning, deep learning and statistical analysis techniques are used here to get the accurate result so the investors can see the future trend and maximize the return of investment in stock trading. This paper will review many deep learning algorithms for stock price forecasting. We use a record of s&p 500 index data for training and testing. The survey motive is to check various deep learning and statistical model techniques for stock price forecasting that are Moving Averages, ARIMA which are statistical techniques and LSTM, RNN, CNN, and FULL CNN which are deep learning models. It will discuss various models, including the Auto regression integration moving average model, the Recurrent neural network model, the long short-term model which is the type of RNN used for long dependency for data, the convolutional neural network model, and the full convolutional neural network model, in terms of error calculation or percentage of accuracy that how much it is accurate which measures by the function like Root mean square error, mean absolute error, mean squared error. The model can be used to predict the stock price by checking the low MAE value as lower the MAE value the difference between the predicting and the actual value will be less and this model will predict the price more accurately than other models.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3918203/v1"
    },
    {
        "id": 22641,
        "title": "Intelligent Pest Forecasting with Meteorological Data：An Explainable Deep Learning Approach",
        "authors": "Jiale Wang, Dong Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4385488"
    },
    {
        "id": 22642,
        "title": "Employing Google Trends and Deep Learning in Forecasting Financial Market Turbulence",
        "authors": "Anastasios Petropoulos, Vasileios Siakoulis, Evangelos Stavroulakis, Panagiotis Lazaris, Nikolaos Vlachogiannakis",
        "published": "2022-7-3",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/15427560.2021.1913160"
    },
    {
        "id": 22643,
        "title": "Deep learning stacking for financial time series forecasting: an analysis with synthetic and real-world time series",
        "authors": "Eder F. Urbinate, Leonardo K. Felizardo, Emilio Del-Moral-Hernandez",
        "published": "2022-11-28",
        "citations": 1,
        "abstract": "The forecasting problem is one of the main applications arising from the synergy between finance and artificial intelligence. With the advancement in the field of deep learning, some ANN achieved very satisfactory results and gained more attention. One approach to increase the time series forecasting model’s performance is ensemble models, combining each model’s prediction (stacking). However, there are some difficulties in combining and evaluating these models for a good performance in financial time series. We use synthetic and real-world time series to evaluate the model stacking, trying to understand the main financial time series components. Using this ensemble method, we reduced the prediction error for both scenarios.",
        "link": "http://dx.doi.org/10.5753/eniac.2022.227540"
    },
    {
        "id": 22644,
        "title": "Enhancing Agricultural Productivity Monitoring and Forecasting through Deep Transfer Learning",
        "authors": "Robin Young, Rachel Fan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Agriculture is increasingly threatened by climate change impacts, especially in lower-income nations where traditional paper survey-based data collection for detailed agricultural reporting can be impractical. Leveraging advancements in remote sensing and machine learning, we propose a Convolutional Neural Network-Long Short-Term Memory model designed to infer farm-level crop yields from one year of high-resolution weather data. We also propose assessing the potential of predicting based on forecasted weather data and implementing transfer learning to predict crop yield in regions outside the US with sparse data collection. If successful, this approach would offer a detailed and adaptive tool for countries with all levels of monitoring resources.",
        "link": "http://dx.doi.org/10.22541/essoar.169903626.61386533/v1"
    },
    {
        "id": 22645,
        "title": "A Statistics and Deep Learning Hybrid Method for Multivariate Time Series Forecasting and Mortality Modeling",
        "authors": "Thabang Mathonsi, Terence L. van Zyl",
        "published": "2021-12-22",
        "citations": 14,
        "abstract": "Hybrid methods have been shown to outperform pure statistical and pure deep learning methods at forecasting tasks and quantifying the associated uncertainty with those forecasts (prediction intervals). One example is Exponential Smoothing Recurrent Neural Network (ES-RNN), a hybrid between a statistical forecasting model and a recurrent neural network variant. ES-RNN achieves a 9.4% improvement in absolute error in the Makridakis-4 Forecasting Competition. This improvement and similar outperformance from other hybrid models have primarily been demonstrated only on univariate datasets. Difficulties with applying hybrid forecast methods to multivariate data include (i) the high computational cost involved in hyperparameter tuning for models that are not parsimonious, (ii) challenges associated with auto-correlation inherent in the data, as well as (iii) complex dependency (cross-correlation) between the covariates that may be hard to capture. This paper presents Multivariate Exponential Smoothing Long Short Term Memory (MES-LSTM), a generalized multivariate extension to ES-RNN, that overcomes these challenges. MES-LSTM utilizes a vectorized implementation. We test MES-LSTM on several aggregated coronavirus disease of 2019 (COVID-19) morbidity datasets and find our hybrid approach shows consistent, significant improvement over pure statistical and deep learning methods at forecast accuracy and prediction interval construction.",
        "link": "http://dx.doi.org/10.3390/forecast4010001"
    },
    {
        "id": 22646,
        "title": "Probabilistic Geomagnetic Storm Forecasting via Deep Learning",
        "authors": "Adrian Tasistro-Hart, Alexander Grayver, Alexey Kuvshinov",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;By causing time variation in Earth's external magnetic field, geomagnetic storms can induce damaging currents in ground-based conducting infrastructure, such as power and communication lines.&amp;#160; The physical link between solar activity and Earth's magnetosphere, while complicated, provides the basis for attempts to forecast geomagnetic storms. Fortunately, we have abundant observational data of both the solar disk and solar wind, which are ameable to the application of data-hungry neural networks to the forecasting problem. To date, almost all neural networks trained for geomagnetic storm forecasting have utilized solar wind observations from the Earth-Sun first Lagrangian point (L1) or closer and have generated deterministic output without uncertainty estimates. Furthermore, existing models generate forecasts for indices that are also sensitive to induced internal magnetic fields, complicating the forecasting problem with another layer of non-linearity. In this work, we present neural networks trained on observations from both the solar disk and the L1 point. Our architecture generates reliable probabilistic forecasts over Est, the external component of the disturbance storm time index, showing that neural networks can learn measures of confidence in their output.&amp;#160;&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu21-10501"
    },
    {
        "id": 22647,
        "title": "A deep learning LSTM forecasting approach for renewable energy systems",
        "authors": "Petrina Papazek, Irene Schicker",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;In this study, we address point-forecasting using a deep learning LSTM-approach for renewable energy systems with focus on the short- to medium-range. Hourly resolution (medium-range) as well as 10-minute resolution (nowcasting) are the anticipated forecasting frequency. The forecasting approach is applied to: (i) wind speed at 10 meters height (observation sites), (ii) wind speed at hub-height of wind turbines, and (iii) solar power forecasts for selected solar power plants.&lt;/p&gt;&lt;p&gt;As input to the proposed method numerical weather prediction (NWP) data, gridded observations (analysis and/or reanalysis), and point data are used. The data of studied test-cases is extracted from the Austrian TAWES system (Teilautomatische Wetterstationen, meteorological observations in 10-minute intervals), &amp;#160;SCADA data of wind farms, solar power output of a solar power plant, INCA's (Integrated Nowcasting through Comprehensive Analysis) gridded observation fields, reanalysis fields from Merra2 and Era5-land, as well as, NWP data from the ECMWF IFS (European Center for Medium-Range Weather Forecast&amp;#8217;s Integrated Forecasting System). These data-sources embrace very different temporal and spatial semantics, thus, careful pre-processing was carried out. Four daily runs over the course of one year for 12 synoptic sites + 38 wind turbines + 1 solar power plant test locations are conducted.&lt;/p&gt;&lt;p&gt;The advantage of an LSTM architecture is that it includes recurrent steps in the ANN and, thus, is useful especially for time-series, such as meteorological observations or NWP forecasts. So far, comparatively few attempts have been made to integrate time-series with different semantics of a sensor network and physical models in one LSTM. We tackle this issue by conserving the time-steps of the delayed NWP along with their difference to recently observed time-series and, additionally, separate them into forecasting-intervals (e.g., of 3 to 12 subsequent forecasting hours being shortest in nowcasting). This enables us to employ a sequence-to-sequence LSTM based artificial neural network (ANN). The benefit of a sequence-to-sequence setup is to match an input- and output time-series in each sample, thereby, learning complex temporal relationships. To fully use the advantage of the diverse data a tailored pre- and post-processing of these heterogenous data sources in the renewable energy applications is needed.&lt;/p&gt;&lt;p&gt;The ANN&amp;#8217;s results yield, in general, high forecast-skills, indicating a successful learning based on the used training data. Different combinations of inputs and processing-steps were investigated. It is shown that combining various data sources and implement an adequate pre- and post-processing yields the most promising results in the case studies (e.g.: a heuristic to estimate produced power based on the meteorological parameters and prediction of the offset to NWPs tailored to the studied location). Results are compared to traditional forecast methods and statistical methods such as a random forest and multiple-linear-regression.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu21-9910"
    },
    {
        "id": 22648,
        "title": "An Optimization of Machine Learning Approaches in the Forecasting of Global Financial Stability",
        "authors": "Adyant Ranjan",
        "published": "No Date",
        "citations": 0,
        "abstract": "In the current data-driven world, the significance of machine learning as a mechanism for making predictions is vital. This research dives into how supervised learning techniques can be used to predict whether a banking crisis will occur in areas of Africa, which can be generalized to determining the status of financial stability in all areas around the world. By applying different machine learning mechanisms, along with tuning the hyperparameters, the optimal machine learning technique was found to be a neural network with two hidden layers, both hidden layers having the ReLU activation function. These results demonstrate that through widespread implementation of this neural network, governmental and financial organizations can develop significant trends and predict when a state is in economic peril, allowing for sufficient financial, social, or other aid to be administered before situations deteriorate.",
        "link": "http://dx.doi.org/10.33774/coe-2022-6xk2w"
    },
    {
        "id": 22649,
        "title": "Forecasting Financial Innovation Fund Prices: Machine Learning Approach",
        "authors": "Yosuke Kakinuma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4495829"
    },
    {
        "id": 22650,
        "title": "Correction to: A Machine Learning Approach to Volatility Forecasting",
        "authors": "",
        "published": "2022-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/jjfinec/nbac032"
    },
    {
        "id": 22651,
        "title": "Realised Volatility Forecasting: Machine Learning Via Financial Word Embedding",
        "authors": "Eghbal Rahimikia, Stefan Zohren, Ser-Huang Poon",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4754276"
    },
    {
        "id": 22652,
        "title": "Forecasting Stock Market Prices Using Machine Learning and Deep Learning Models: A Systematic Review, Performance Analysis and Discussion of Implications",
        "authors": "Gaurang Sonkavde, Deepak Sudhakar Dharrao, Anupkumar M. Bongale, Sarika T. Deokate, Deepak Doreswamy, Subraya Krishna Bhat",
        "published": "2023-7-26",
        "citations": 8,
        "abstract": "The financial sector has greatly impacted the monetary well-being of consumers, traders, and financial institutions. In the current era, artificial intelligence is redefining the limits of the financial markets based on state-of-the-art machine learning and deep learning algorithms. There is extensive use of these techniques in financial instrument price prediction, market trend analysis, establishing investment opportunities, portfolio optimization, etc. Investors and traders are using machine learning and deep learning models for forecasting financial instrument movements. With the widespread adoption of AI in finance, it is imperative to summarize the recent machine learning and deep learning models, which motivated us to present this comprehensive review of the practical applications of machine learning in the financial industry. This article examines algorithms such as supervised and unsupervised machine learning algorithms, ensemble algorithms, time series analysis algorithms, and deep learning algorithms for stock price prediction and solving classification problems. The contributions of this review article are as follows: (a) it provides a description of machine learning and deep learning models used in the financial sector; (b) it provides a generic framework for stock price prediction and classification; and (c) it implements an ensemble model—“Random Forest + XG-Boost + LSTM”—for forecasting TAINIWALCHM and AGROPHOS stock prices and performs a comparative analysis with popular machine learning and deep learning models.",
        "link": "http://dx.doi.org/10.3390/ijfs11030094"
    },
    {
        "id": 22653,
        "title": "Forecasting Museum Visitor Behaviors Using Deep Learning",
        "authors": "Shiyou Wu",
        "published": "2019-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlbdbi48998.2019.00042"
    },
    {
        "id": 22654,
        "title": "Deep Learning–based Time Series Forecasting",
        "authors": "Akshay R Kulkarni, Adarsha Shivananda, Anoosh Kulkarni, V Adithya Krishnan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8978-5_5"
    },
    {
        "id": 22655,
        "title": "Deep Learning in Solar Forecasting Tasks",
        "authors": "Long Xu, Yihua Yan, Xin Huang",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-2746-1_6"
    },
    {
        "id": 22656,
        "title": "Probabilistic Geomagnetic Storm Forecasting via Deep Learning",
        "authors": "Adrian Tasistro-Hart, Alexander V Grayver, Alexey Kuvshinov",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10502879.2"
    },
    {
        "id": 22657,
        "title": "A spatiotemporal deep learning forecasting model for long-term drought prediction",
        "authors": "Athanasios Loukas, Lampros Vasiliades",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;Droughts are slow-moving natural hazards that comes with high hazardous impacts on the society. Early and timelines forecasting of a drought event can help to take proactive measures and set out drought mitigation strategies to alleviate the impacts of drought. Traditionally, forecasting techniques have used various time-series and/or machine learning methods. However, the use of deep learning methods has not been tested extensively despite its potential to improve our understanding of drought characteristics. This study develops a hybrid spatiotemporal scheme for integrated spatial and temporal forecasting. Temporal forecasting is achieved using a deep feed-forward neural network (DFFN and the temporal forecasts are extended to the spatial dimension using a deep learning approach the Long Short-Term Memory (LSTM) to forecast an operational meteorological drought index the Standardized Precipitation Index (SPI) calculated at multiple timescales. The temporal input variable determination is achieved with the use of the Gamma test that estimates the minimum mean square error (MSE) that can be achieved when modelling the unseen data using any continuous non-linear models. 48 precipitation stations and 18 independent precipitation stations, located at Pinios river basin in Thessaly region, Greece, are used for the development and spatiotemporal validation of the hybrid deep learning forecasting model. Several drought characteristics (drought severity and duration, drought category and spatial extent) are analysed to better understand how drought forecasting was improved. Several quantitative temporal and spatial statistical indices are considered for the performance evaluation of the models. Furthermore, qualitative statistical criteria based on contingency tables between observed and forecasted drought episodes are calculated. The results show that the lead time of forecasting for operational use depends on the SPI timescale. The hybrid spatiotemporal deep learning forecasting model could be operationally used for predicting up to three months ahead for SPI short timescales (e.g. 3-6 months) up to six months ahead for large SPI timescales (e.g. 12-24 months). The above findings could be useful in developing a drought preparedness plan in the region and for drought mitigation purposes.&lt;/p&gt;&lt;p&gt;&amp;#160;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key words: &lt;/strong&gt;deep learning, drought, Standardized Precipitation Index, drought forecasting, spatiotemporal droughts, DFNN, LSTM.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu22-11509"
    },
    {
        "id": 22658,
        "title": "Review for \"Limits to ecological forecasting: Estimating uncertainty for critical transitions with deep learning\"",
        "authors": " Heather Lynch",
        "published": "2022-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/2041-210x.14013/v1/review1"
    },
    {
        "id": 22659,
        "title": "High-frequency ensemble wind speed forecasting using deep learning",
        "authors": "Irene Schicker, Petrina Papazek, Rosmarie DeWit",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;In this study, we present a deep learning-based method to provide seamless high-frequency wind speed forecasts for up to 30 hours ahead. For each selected site, our method generates an ensemble forecast with an update frequency of 10 to 15 minutes(depending on the observation site&amp;#8217;s update-frequency). The main objective in this machine learning based post-processing method is to optimally exploit highly resolved NWP models and particularly utilize their multi-level meteorological parameters to integrate the three-dimensionality of weather processes. Further key objectives of this research are to consider different spatial and temporal resolutions and different topographic characteristics of the selected sites. We evaluate the best praxis for efficiently post-processing both the 10-meter wind speed at selected Austrian meteorological observation sites and wind speed on hub height of wind turbines in wind farms.&lt;/p&gt;&lt;p&gt;The method is based on an artificial neural network (ANN), particularly a long-short-term-memory (LSTM) adopted to process several differently structured inputs simultaneously (i.e., different gridded inputs along with observed time-series) and generate ensemble output. An LSTM layer models recurrent steps in the ANN and is, thus, useful for time-series, such as meteorological observations.&lt;/p&gt;&lt;p&gt;Our ensemble forecast method is evaluated for a case study in 2021 using several years of training, including extreme weather event for the selection of sites. The utilized data includes the meteorological observations, gridded nowcasting data as well as NWP data from ECMWF IFS and AROME at several pressure/altitude levels. Hourly runs for 12 test locations (selected TAWES sites covering different topographic situations in Austria) and two wind turbine sites in different seasons are conducted. The obtained results indicate that the model succeeds in learning from inputs while remaining computationally efficient. In most cases the ANN method yields high forecast-skills and is compared to available methods such as the raw NWP model output, climatology, and persistence.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu22-11240"
    },
    {
        "id": 22660,
        "title": "Two Physics-informed Enso Deep Learning Forecasting Models: ENSO-ASC and ENSO-GTC",
        "authors": "Bo Qin",
        "published": "No Date",
        "citations": 0,
        "abstract": "El Ni&#241;o-Southern Oscillation (ENSO) events have significant impacts on global climate change, and the research on their accurate forecasting and dynamic predictability holds remarkable scientific and engineering values. Recent years, we have constructed two ENSO deep learning forecasting models, ENSO-ASC and ENSO-GTC, which are both incorporated with prior ENSO dynamic mechanisms. Specifically, the former possesses the multivariate air-sea coupler (ASC), which can simulate the occurrence and decay of ENSO events, accompanied by concurrent energy interactions among multiple physical variables in the Pacific Ocean. The latter possesses the global teleconnection coupler (GTC), which can modulate the significant teleconnections of global ocean basins rather than the isolated interactions in the Pacific Ocean. From the perspective of forecasting skill, the Ni&#241;o 3.4 index correlation skills of these two models can reach 0.78/0.65/0.50 (0.79/0.66/0.51) in 6/12/18 lead-month prediction, which means they exhibit an effective forecasting lead month of more than 18, outperforming the Ham et al.'s Nature-published ENSO forecasting model. The test of the past year's (2022) forecast results shows that the average forecast error of these two models is 0.156, which is less than 10% of the actual ENSO amplitudes. It is worth noting that these two models also encounter the spring presistence barrier (SPB), but indicates a profound improvement compared to the numerical models. From the perspective of ENSO predictability, zonal and meridional winds are two sensitive predictors for ENSO forecasting besides sea surface temperature (SST), which greatly contribute to the Bjerknes positive feedback mechanism and WES mechanism. Walker circulation, acting as the \"atmpsphric bridge\", induces the teleconnections of the three oceans, which can derive the easterly wind anomalies in the equatorial western Pacific from the Indian Ocean and North Pacific meridional mode in the northeastern Pacific from the Atlantic Ocean, promoting ENSO event development and decay.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-3372"
    },
    {
        "id": 22661,
        "title": "A Comparison of Recurrent and Convolutional Deep Learning Architectures for EEG Seizure Forecasting",
        "authors": "Sina Shafiezadeh, Marco Pozza, Alberto Testolin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012311800003657"
    },
    {
        "id": 22662,
        "title": "Deep Learning for Higher-Order Aftershock Forecasting in Near-Real-Time",
        "authors": "Leila Mizrahi, Dario Jozinović",
        "published": "No Date",
        "citations": 0,
        "abstract": "The use of machine learning (ML) methods for earthquake forecasting has recently emerged as a promising avenue, with several recent publications exploring the application of neural point processes. Such models, in contrast to those currently applied in practice, offer the flexibility to incorporate additional datasets alongside earthquake catalogs, indicating potential for enhanced earthquake forecasting capabilities in the future. However, with a forecasting performance that currently remains similar to that of the agreed-upon benchmark, the Epidemic-Type Aftershock Sequence (ETAS) model, the black-box nature of ML models poses a challenge in communicating forecasts to lay audiences. The ETAS model has stood the test of time and is relatively simple and comprehensively understood, with few empirically derived laws describing aftershock triggering behavior. A main drawback of ETAS is its reliance on large numbers of simulations of possible evolutions of ongoing earthquake sequences, which is typically associated with long computation times or resources required for parallelization.\nIn this study, we propose a deep learning approach to emulate the output of the well-established ETAS model, bridging the gap between traditional methodologies and the potential advantages offered by machine learning. By focusing on modeling the temporal behavior of higher-order aftershocks, our approach aims to combine the interpretability of the ETAS model with the computational efficiency intrinsic to deep learning.\nEvaluated using commonly applied metrics of both the ML and earthquake forecasting communities, our approach and the traditional, simulation-based approach are shown to perform very similarly in describing synthetic datasets generated with the simulation-based approach. Our method has two major benefits over the traditional approach. It is faster by several orders of magnitude, and it is not susceptible to being influenced by the presence (or absence) of individual 'extreme' realizations of the process, and thus enables accurate earthquake forecasting in near-real-time.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-9366"
    },
    {
        "id": 22663,
        "title": "Referee Comment on \"HIDRA 1.0: Deep-Learning-Based Ensemble Sea Level Forecasting in the Northern Adriatic\"",
        "authors": "",
        "published": "2020-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/gmd-2020-355-rc2"
    },
    {
        "id": 22664,
        "title": "Probabilistic Geomagnetic Storm Forecasting via Deep Learning",
        "authors": "Adrian Tasistro-Hart, Alexander V Grayver, Alexey Kuvshinov",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10502879.1"
    },
    {
        "id": 22665,
        "title": "Machine learning approaches for financial time series forecasting",
        "authors": "Vasily Derbentsev, Andriy Matviychuk, Nataliia Datsenko, Vitalii Bezkorovainyi, Albert Azaryan",
        "published": "2020-10-26",
        "citations": 4,
        "abstract": "This paper is discusses the problems of the short-term forecasting of financial time series using supervised machine learning (ML) approach. For this goal, we applied several the most powerful methods including Support Vector Machine (SVM), Multilayer Perceptron (MLP), Random Forests (RF) and Stochastic Gradient Boosting Machine (SGBM). As dataset were selected the daily close prices of two stock index: SP 500 and NASDAQ, two the most capitalized cryptocurrencies: Bitcoin (BTC), Ethereum (ETH), and exchange rate of EUR-USD. As features we used only the past price information. To check the efficiency of these models we made out-of-sample forecast for selected time series by using one step ahead technique. The accuracy rates of the forecasted prices by using ML models were calculated. The results verify the applicability of the ML approach for the forecasting of financial time series. The best out of sample accuracy of short-term prediction daily close prices for selected time series obtained by SGBM and MLP in terms of Mean Absolute Percentage Error (MAPE) was within 0.46-3.71 %. Our results are comparable with accuracy obtained by Deep learning approaches.",
        "link": "http://dx.doi.org/10.31812/123456789/4478"
    },
    {
        "id": 22666,
        "title": "Downscaling Hydrodynamic Outputs using Deep Learning for Operational Flood Inundation Forecasting",
        "authors": "Chanyu Yang, Fiachra O'Loughlin",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;Floods can have significant impacts on communities, properties, and critical infrastructure. To reduce these impacts, it is necessary to either protect them via the construction of flood defenses or through developing flood forecasting systems. Previous studies have shown the potential of applying hydrodynamic models for fine spatial resolution inundation modeling; however, such models are computationally demanding (depending on spatial resolution) and are therefore not suitable to meet the need for operational flood forecasting. This study looks at ways to reduce the computational cost of flood inundation forecasting through a combination of hydrodynamic models and machine learning approaches. We propose a deep learning (DL) based approach to downscale coarse resolution hydrodynamic outputs for use in operational flood inundation forecasting. This method was applied to outputs from the LISFLOOD-FP model for a reach of the river Dodder in Dublin City, Ireland, where a 2 m LiDAR DTM and hourly discharge and water levels were available. Three different DL methods were tested: Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), and Generative Adversarial Networks (GANs). Initial results indicate that GANs outperformed the other two algorithms.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-6788"
    },
    {
        "id": 22667,
        "title": "Cryptocurrency Trading-Pair Forecasting, Using Machine Learning and Deep Learning Technique",
        "authors": "Ernest Osifo, Ritabrata Bhattacharyya",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3610340"
    },
    {
        "id": 22668,
        "title": "Financial time series forecasting with deep learning : A systematic literature review: 2005–2019",
        "authors": "Omer Berat Sezer, Mehmet Ugur Gudelek, Ahmet Murat Ozbayoglu",
        "published": "2020-5",
        "citations": 512,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2020.106181"
    },
    {
        "id": 22669,
        "title": "Deep Learning and Its Application to Credit Card Delinquency Forecasting",
        "authors": "John Lee, Jow-Ran Chang, Lie-Jane Kao, Cheng-Few Lee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-14283-3_15"
    },
    {
        "id": 22670,
        "title": "Examining Deep Learning Architectures for Crime Classification and Prediction",
        "authors": "Panagiotis Stalidis, Theodoros Semertzidis, Petros Daras",
        "published": "2021-10-12",
        "citations": 16,
        "abstract": "In this paper, a detailed study on crime classification and prediction using deep learning architectures is presented. We examine the effectiveness of deep learning algorithms in this domain and provide recommendations for designing and training deep learning systems for predicting crime areas, using open data from police reports. Having time-series of crime types per location as training data, a comparative study of 10 state-of-the-art methods against 3 different deep learning configurations is conducted. In our experiments with 5 publicly available datasets, we demonstrate that the deep learning-based methods consistently outperform the existing best-performing methods. Moreover, we evaluate the effectiveness of different parameters in the deep learning architectures and give insights for configuring them to achieve improved performance in crime classification and finally crime prediction.",
        "link": "http://dx.doi.org/10.3390/forecast3040046"
    }
]