[
    {
        "id": 1001,
        "title": "FPPR: Fast Pessimistic (dynamic) PageRank to Update PageRank in Evolving Directed Graphs on Network Changes",
        "authors": "Suman Kundu, Rohith Parjanya Pashikanti",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe paper presents a new algorithm FPPR which updates PageRanks of a directed network after topological changes in the graphs. The algorithm is capable of regenerating scores on node and link addition/deletion. The changes in the expected value of random surfers are used for updating the scores of the newly added nodes as well as the impacted chain where the nodes/links are added or removed. The complexity of the algorithm for k new node addition is O(k ×davg(k) ) where davg(k) is the average degree of k nodes added. On the other hand for node deletion, the complexity is O(|Vs  | + |Es  |) where Vs and Es are the set of nodes and edges updated using Selective Breadth-First Update. Extensive experiments have been performed on different synthetic and real-world networks. The experimental result shows that the rank generated by the proposed method is highly correlated with that of the recalculation on changes, using the benchmark Power Iteration algorithm.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1512145/v1"
    },
    {
        "id": 1002,
        "title": "PageRank",
        "authors": "",
        "published": "2020-8-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/11884.003.0008"
    },
    {
        "id": 1003,
        "title": "About the power law of the PageRank vector distribution. Part 1. Numerical methods for finding the PageRank vector",
        "authors": "",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15372/sjnm20170402"
    },
    {
        "id": 1004,
        "title": "Contrastive study of Simple PageRank, HITS and Weighted PageRank algorithms: Review",
        "authors": "Tuhena Sen, Dev Kumar Chaudhary",
        "published": "2017-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/confluence.2017.7943245"
    },
    {
        "id": 1005,
        "title": "Exploring The Relationship Between Ordinary PageRank, Lazy PageRank and Random Walk with Backstep PageRank for Different Graph Structures",
        "authors": "Pitos Seleka Biganda, Benard Abola, Christopher Engström, John Magero Mango, Godwin Kakuba, Sergei Silvestrov",
        "published": "2020-4-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119721871.ch3"
    },
    {
        "id": 1006,
        "title": "Pagerank-index",
        "authors": "Upul Senanayake, Mahendra Piraveenan, Albert Zomaya",
        "published": "2019-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/850189"
    },
    {
        "id": 1007,
        "title": "An Unplugged Activity to Understand the PageRank Algorithm",
        "authors": "Youngki Park,  ",
        "published": "2018-8-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14352/jkaie.2018.22.4.409"
    },
    {
        "id": 1008,
        "title": "On the initial value of PageRank",
        "authors": "Krishanu Deyasi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPageRank is used by Google for ranking web pages to present search results for a user query. \n Here, we have shown that the PageRank of a vertex depends on its initial value which is also known as an intrinsic, non-network contribution. We analytically proved that PageRank value of vertices become proportional to their degrees if the intrinsic, non-network contributions of the vertices are proportional to their degrees or zeros. Simulated and empirical data are used to support our study. In addition, we have shown that localization of \n PageRank depends on the intrinsic, non-network contribution.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2210385/v1"
    },
    {
        "id": 1009,
        "title": "A novel approximate PageRank computation: QEGauss-Seidel PageRank",
        "authors": "Atul Kumar Srivastava, Mitali Srivastava",
        "published": "2022-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s41870-021-00854-0"
    },
    {
        "id": 1010,
        "title": "PageRank of Linked Open Vocabularies (LOV)",
        "authors": "Donny Winston",
        "published": "No Date",
        "citations": 0,
        "abstract": "Datasets are easier to reuse if they use standards that are well-established, particularly in a given domain. A first approach is to ask around – ask people with whom you coauthor , people you trust in your field, etc. A follow-on approach is to examine the “graph reputation” of relevant standards, particularly if they may be represented as resources with outbound links.",
        "link": "http://dx.doi.org/10.59350/7fx2v-8f226"
    },
    {
        "id": 1011,
        "title": "Experimental comparison of PageRank vector calculation algorithms",
        "authors": "Daniel  A Skachkov, Sergey  I Gladyshev, Andrei Mikhailovich Raigorodsky",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20537/2076-7633-2023-15-2-369-379"
    },
    {
        "id": 1012,
        "title": "Monitoring Second Language Learning with PageRank-Based Student Performance Analysis",
        "authors": "Iñigo Parra",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>The use of technology has permeated all aspects of modern society, including education. Within pedagogy, computer- assisted language learning (CALL) has gained popularity as a result of technological advancements. The potential for combining this sub-field of L2 learning and algorithm-driven approaches to monitor in-class performance has remained unexplored. This study draws on PageRank (PR) and social network analysis (SNA) to monitor student interactions in an SLA environ- ment. This study compares the effectiveness of PageRank and eigenvector centrality in reflecting student in-class performance using data from an L2 Spanish lecture. The results suggest that PageRank outperforms other metrics at abstracting in-class performance, showing 91% of score uniqueness against the 33% obtained by eigenvector centrality.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22775606.v1"
    },
    {
        "id": 1013,
        "title": "Progress of Studies of Citations and PageRank",
        "authors": "Wataru Souma, Mari Jibu",
        "published": "2018-7-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.77389"
    },
    {
        "id": 1014,
        "title": "Monitoring Second Language Learning with PageRank-Based Student Performance Analysis",
        "authors": "Iñigo Parra",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>The use of technology has permeated all aspects of modern society, including education. Within pedagogy, computer- assisted language learning (CALL) has gained popularity as a result of technological advancements. The potential for combining this sub-field of L2 learning and algorithm-driven approaches to monitor in-class performance has remained unexplored. This study draws on PageRank (PR) and social network analysis (SNA) to monitor student interactions in an SLA environ- ment. This study compares the effectiveness of PageRank and eigenvector centrality in reflecting student in-class performance using data from an L2 Spanish lecture. The results suggest that PageRank outperforms other metrics at abstracting in-class performance, showing 91% of score uniqueness against the 33% obtained by eigenvector centrality.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22775606"
    },
    {
        "id": 1015,
        "title": "The PageRank Algorithm",
        "authors": "Hang Li",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-3917-6_21"
    },
    {
        "id": 1016,
        "title": "FPPR: fast pessimistic (dynamic) PageRank to update PageRank in evolving directed graphs on network changes",
        "authors": "Rohith Parjanya Pashikanti, Suman Kundu",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s13278-022-00968-8"
    },
    {
        "id": 1017,
        "title": "Comparison of methods of ranking scientists based on the Hirsch and PageRank indices: contradictory situations",
        "authors": "Hryhorii Hnatiienko, Oleksiy Oletsky",
        "published": "2021",
        "citations": 0,
        "abstract": "Experiments aimed at comparing different methods of estimating and ranking scientists and researchers on the base of their publication activity are reported. Scientometric indicators based on h-index and PageRank are being compared. For such a comparison, a graph of citations represented by a matrix was applied. An example when different methods lead to opposite results was described. For example, authors having the best PageRank-based estimations may have the least h-indices. Such a situation is possible when a high-cited author managed to obtain a key result cited by all the other authors but this author has few papers. A comparison with methods of expert estimations was carried out, which appears to be very useful for building automated systems combining various methods of algorithmic estimating and ranking. The Analytic Hierarchy Process was applied. For building pairwise comparison matrices, transitive scales with a parameter representing how much times the next level of advantage is bigger than the previous one were harnessed.",
        "link": "http://dx.doi.org/10.17721/ait.2021.1.05"
    },
    {
        "id": 1018,
        "title": "Identifying Critical Transition with PageRank Algorithm in a Biological Process",
        "authors": "阳开 王",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12677/aam.2020.92026"
    },
    {
        "id": 1019,
        "title": "Extrapolation methods for multilinear PageRank",
        "authors": "Abdeslem Hafid Bentbib, Maryam Boubekraoui, Khalide Jbilou",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nMultilinear PageRank is a variant of the PageRank algorithm that takes into account multiple relationships among nodes in a network. This algorithm can make web page ranking more efficient and accurate by considering multiple types of connections at once. The higher-order power method is commonly used to calculate the multilinear PageRank vector due to its ease of implementation, low storage needs, and because it is a natural extension of the traditional power method used in the PageRank algorithm. However, the convergence of this method is not always guaranteed, and even if it is, it is slow. In this paper, we show how some vector extrapolation methods such as minimal polynomial extrapolation (MPE) and reduced rank extrapolation (RRE), could be used for accelerating the computation of the fixed-point multilinear PageRank.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3610759/v1"
    },
    {
        "id": 1020,
        "title": "Using the PageRank Algorithm to Rank Football Players in a Game",
        "authors": "Aditya Iyer",
        "published": "No Date",
        "citations": 0,
        "abstract": "There are many methods to rank football players based on their performance in a game or series of games. However, since most methods are subjective, this paper proposes the PageRank algorithm as an objective method to rank players in a football team, where players can be considered as the nodes, and the passes made between them as the edges of a graph. To achieve this, we consider weighting functions, which are based on parameters which consider the number and quality of passes as well as the actions of individual players in the game. The models generated by these weighting functions are compared with the official rankings of players using the Kendall's Tau Correlation Coefficient in order to find the distance between the two ranking vectors. This paper shows that the PageRank algorithm can be a promising and objective tool for ranking football players in a game.",
        "link": "http://dx.doi.org/10.33774/coe-2022-86jt3"
    },
    {
        "id": 1021,
        "title": "Ranking Calculation of Youth Badminton Single Players and Teams in Korea: Adaptation for PageRank Algorithm",
        "authors": "Kyung-Min Ra, Mi-Sook Lee, Eun-Hye Jo",
        "published": "2019-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46394/iss.37.1.11"
    },
    {
        "id": 1022,
        "title": "The Landau Legacy: From Chess to Pagerank",
        "authors": "Nicolas Boccard",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.2945389"
    },
    {
        "id": 1023,
        "title": "Simple Hierarchical PageRank Graph Neural Networks",
        "authors": "Fei yang, Huyin Zhang, Shiming Tao, Xiying Fan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nGraph neural networks (GNNs) have many variants for graph representation learning. Several works introduce PageRank into GNNs to improve its neighborhood aggregation capabilities. However, these methods leverage the general PageRank to perform complex neighborhood aggregation to obtain the final feature representation, which leads to high computational cost and oversmoothing. In this paper, we propose simple hierarchical PageRank graph neural networks (SHP-GNNs), which first utilize the simple PageRank to aggregate different neighborhood ranges of each node, and then leverage a jumping architecture to combine these aggregated features to enable hierarchical structure-aware representation. In this case, first, the simple PageRank turns the neighborhood aggregation process to no-learning, thereby reducing the computational complexity of the model. Then, the jumping structure combines the aggregation features of each node's different hierarchy (neighborhood range) to learn more informative feature representation. Finally, the successful combination of the above methods alleviate the oversmoothing problem of deep GNNs. Our experimental evaluation demonstrates that SHP-GNNs achieve or match state-of-the-art results in node classification tasks, text classification tasks, and community prediction tasks. Moreover, since SHP-GNNs' neighborhood aggregation is a no-learning process, SHP-GNNs are successfully extended to node clustering tasks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2638974/v1"
    },
    {
        "id": 1024,
        "title": "Calculating Networks:",
        "authors": "",
        "published": "2020-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv12sdvf1.11"
    },
    {
        "id": 1025,
        "title": "PageRank in Google",
        "authors": "Parisa Fatheddin",
        "published": "2022-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003299073-9"
    },
    {
        "id": 1026,
        "title": "Extending the Adapted PageRank Algorithm Centrality to Multiplex Networks with Data Using the PageRank Two-Layer Approach",
        "authors": "Taras Agryzkov, Manuel Curado, Francisco Pedroche, Leandro Tortosa, José Vicent",
        "published": "2019-2-22",
        "citations": 17,
        "abstract": "Usually, the nodes’ interactions in many complex networks need a more accurate mapping than simple links. For instance, in social networks, it may be possible to consider different relationships between people. This implies the use of different layers where the nodes are preserved and the relationships are diverse, that is, multiplex networks or biplex networks, for two layers. One major issue in complex networks is the centrality, which aims to classify the most relevant elements in a given system. One of these classic measures of centrality is based on the PageRank classification vector used initially in the Google search engine to order web pages. The PageRank model may be understood as a two-layer network where one layer represents the topology of the network and the other layer is related to teleportation between the nodes. This approach may be extended to define a centrality index for multiplex networks based on the PageRank vector concept. On the other hand, the adapted PageRank algorithm (APA) centrality constitutes a model to obtain the importance of the nodes in a spatial network with the presence of data (both real and virtual). Following the idea of the two-layer approach for PageRank centrality, we can consider the APA centrality under the perspective of a two-layer network where, on the one hand, we keep maintaining the layer of the topological connections of the nodes and, on the other hand, we consider a data layer associated with the network. Following a similar reasoning, we are able to extend the APA model to spatial networks with different layers. The aim of this paper is to propose a centrality measure for biplex networks that extends the adapted PageRank algorithm centrality for spatial networks with data to the PageRank two-layer approach. Finally, we show an example where the ability to analyze data referring to a group of people from different aspects and using different sets of independent data are revealed.",
        "link": "http://dx.doi.org/10.3390/sym11020284"
    },
    {
        "id": 1027,
        "title": "PageRank: Google's democratic ranking technology",
        "authors": "Jun Wu",
        "published": "2018-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315169491-10"
    },
    {
        "id": 1028,
        "title": "Localization in Seeded PageRank",
        "authors": "David Gleich, Huda Nassar, Kyle Kloster",
        "published": "2017-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24166/im.001.2017"
    },
    {
        "id": 1029,
        "title": "Recursive module extraction using Louvain and PageRank",
        "authors": "Dimitri Perrin, Guido Zuccon",
        "published": "2018-8-14",
        "citations": 9,
        "abstract": "Biological networks are highly modular and contain a large number of clusters, which are often associated with a specific biological function or disease. Identifying these clusters, or modules, is therefore valuable, but it is not trivial. In this article we propose a recursive method based on the Louvain algorithm for community detection and the PageRank algorithm for authoritativeness weighting in networks. PageRank is used to initialise the weights of nodes in the biological network; the Louvain algorithm with the Newman-Girvan criterion for modularity is then applied to the network to identify modules. Any identified module with more than k nodes is further processed by recursively applying PageRank and Louvain, until no module contains more than k nodes (where k is a parameter of the method, no greater than 100). This method is evaluated on a heterogeneous set of six biological networks from the Disease Module Identification DREAM Challenge. Empirical findings suggest that the method is effective in identifying a large number of significant modules, although with substantial variability across restarts of the method.",
        "link": "http://dx.doi.org/10.12688/f1000research.15845.1"
    },
    {
        "id": 1030,
        "title": "A weighted Arnoldi-Extrapolation algorithm for computing PageRank",
        "authors": "Qian Ying Hu, Chun Wen, Bing Yuan Pu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22541/au.159576123.34511361"
    },
    {
        "id": 1031,
        "title": "Two Parallel PageRank Algorithms via Improving Forward Push",
        "authors": "Qi Zhang, Rongxia Tang, Zhengan Yao, Jun Liang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPageRank, originally designed to rank web pages, has been widely applied in various fields. With the increasing scale of graphs, accelerating PageRank computation has become an urgent need, and designing parallel algorithms is a feasible solution. In this paper, we propose two parallel PageRank algorithms, IFP1 and IFP2, which are improvements upon the state-of-the-art Personalized PageRank algorithm, Forward Push. Theoretical analysis indicates that IFP1 can take advantage of the DAG structure of a graph, where dangling vertices can improve convergence rates and unreferenced vertices can decrease computation amount. IFP2 further improves upon IFP1 by pushing mass to dangling vertices only once but rather many times, decreasing computation amount even further. Experiments on six datasets illustrate that both IFP1 and IFP2 outperform the Power method, with IFP2 reaching up to 49 times faster than Power method with 38 parallelism.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2624542/v1"
    },
    {
        "id": 1032,
        "title": "About the Power Law of the PageRank Vector Component Distribution. Part 1. Numerical Methods for Finding the PageRank Vector",
        "authors": "A. V. Gasnikov, E. V. Gasnikova, P. E. Dvurechensky, A. A. M. Mohammed, E. O. Chernousova",
        "published": "2017-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1134/s1995423917040024"
    },
    {
        "id": 1033,
        "title": "Trustworthiness and Pagerank on the Ethereum Blockchain: Technical Report",
        "authors": "Scott Imig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4590362"
    },
    {
        "id": 1034,
        "title": "Evaluation of Taekwondo Players' Ranking Using the PageRank Algorithm",
        "authors": "Hai-Lian Sun, Seong-no Lee, Man-Keun Kim,  ",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "The purpose of this study is to apply the Olympic Kyorugi Ranking system and PageRank algorithm to the results of four world-class taekwondo competitions held from 2020 to 2023, including G20, G14, G10, and G6, to calculate the rankings. Based on the results, a comparison between the two algorithms is conducted to provide basic information for taekwondo ranking calculation methods. For the purpose of this study, information was collected from the official website of the World Taekwondo Federation. Use MS-Excel, PyCharm, and IBM SPSS (ver. 27) programs to process data. The results of this study are as follows. Firstly, using the PageRank algorithm, the gender and weight rankings of taekwondo athletes can be calculated. Secondly, using the PageRank system for ranking calculation is more suitable for considering the relative performance of players than using the Olympic Kyorugi Ranking system for ranking calculation. Thirdly, the ranking consistency calculated using the Olympic Kyorugi Ranking system and PageRank system is relatively low.",
        "link": "http://dx.doi.org/10.18789/jwstc.2023.40.19"
    },
    {
        "id": 1035,
        "title": "Scaling PageRank to 100 Billion Pages",
        "authors": "Stergios Stergiou",
        "published": "2020-4-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3366423.3380035"
    },
    {
        "id": 1036,
        "title": "Extrapolated splitting methods for multilinear PageRank computations",
        "authors": "Maryam Boubekraoui",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.apnum.2023.11.019"
    },
    {
        "id": 1037,
        "title": "Evaluating nodes importance in complex network based on PageRank algorithm",
        "authors": "Kai Li, Yongfeng He",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5033786"
    },
    {
        "id": 1038,
        "title": "PageRank in undirected random graphs",
        "authors": "Konstantin Avrachenkov, Arun Kadavankandy, Liudmila Ostroumova, Andrei Raigorodskii",
        "published": "2017-1-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24166/im.09.2017"
    },
    {
        "id": 1039,
        "title": "Two-hop walks indicate PageRank order",
        "authors": "Ying Tang",
        "published": "2019-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patcog.2019.06.010"
    },
    {
        "id": 1040,
        "title": "PageRank–Based Extractive Text Summarization",
        "authors": "Supriya Gupta, Aakanksha Sharaff, Naresh Kumar Nagwani",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003102380-16"
    },
    {
        "id": 1041,
        "title": "Learn About PageRank in Python With Data From the Florentine Family Dataset (1994)",
        "authors": "Feng Shi,  ",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526499042"
    },
    {
        "id": 1042,
        "title": "A PageRank-based Collaborative Design Team Member Influence Study",
        "authors": "Xue Mengjia, Ji Yang",
        "published": "2022-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iset55194.2022.00012"
    },
    {
        "id": 1043,
        "title": "Calculating Networks: From Sociometry to PageRank",
        "authors": "Bernhard Rieder",
        "published": "2020",
        "citations": 1,
        "abstract": "This chapter ventures into the field of network algorithms, using the\n\t\t\t\t\tprehistory of Google’s PageRank algorithm to discuss yet another way to\n\t\t\t\t\tthink about information ordering. The chapter shows how algorithmic\n\t\t\t\t\tordering techniques exploit and integrate knowledge from areas other\n\t\t\t\t\tthan information retrieval – in particular the social sciences and citation\n\t\t\t\t\tanalysis – and demonstrates how the ‘politics’ of an algorithm can depend\n\t\t\t\t\ton small variations that lead to radically different outcomes. The context\n\t\t\t\t\tof web search means that the various techniques covered in the second\n\t\t\t\t\tpart of the book are brought together into a shared application space,\n\t\t\t\t\tallowing for a more concrete return to earlier discussions of variation\n\t\t\t\t\tand combination in software.",
        "link": "http://dx.doi.org/10.5117/9789462986190_ch07"
    },
    {
        "id": 1044,
        "title": "Spatial Community Search Using PageRank Vector",
        "authors": "Haoran Mo, JooYoung Lee",
        "published": "2019-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccnc.2019.8685541"
    },
    {
        "id": 1045,
        "title": "The Field-Dependent Nature of PageRank Values in Citation Networks",
        "authors": "Benjamin J. Heil, Casey S. Greene",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThe value of scientific research can be easier to assess at the collective level than at the level of individual contributions. Several journal-level and article-level metrics aim to measure the importance of journals or individual manuscripts. However, many are citation-based and citation practices vary between fields. To account for these differences, scientists have devised normalization schemes to make metrics more comparable across fields. We use PageRank as an example metric and examine the extent to which field-specific citation norms drive estimated importance differences. In doing so, we recapitulate differences in journal and article PageRanks between fields. We also find that manuscripts shared between fields have different PageRanks depending on which field’s citation network the metric is calculated in. We implement a degree-preserving graph shuffling algorithm to generate a null distribution of similar networks and find differences more likely attributed to field-specific preferences than citation norms. Our results suggest that while differences exist between fields’ metric distributions, applying metrics in a field-aware manner rather than using normalized global metrics avoids losing important information about article preferences. They also imply that assigning a single importance value to a manuscript may not be a useful construct, as the importance of each manuscript varies by the reader’s field.",
        "link": "http://dx.doi.org/10.1101/2023.01.05.522943"
    },
    {
        "id": 1046,
        "title": "Perception, prestige and PageRank",
        "authors": "David Zeitlyn, Daniel W. Hook",
        "published": "2019-5-28",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1371/journal.pone.0216783"
    },
    {
        "id": 1047,
        "title": "No More Leaky PageRank",
        "authors": "Scott Sallinen, Matei Ripeanu",
        "published": "2021-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ia354616.2021.00011"
    },
    {
        "id": 1048,
        "title": "Efficient Incremental Pagerank of Evolving Graphs on GPU",
        "authors": "Tao Zhang",
        "published": "2017-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccsec.2017.8446842"
    },
    {
        "id": 1049,
        "title": "A Parameterized Multisplitting Iterative Method for Solving the PageRank Problem",
        "authors": "Yajun Xie, Lihua Hu, Changfeng Ma",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this paper, a new multi parameter iterative algorithm is proposed to address the PageRank problem based on the multi-splitting iteration method described by Gu et al . The proposed method in each iteration needs to solve two linear subsystems by splitting the coefficient matrix, therefore, we consider inner and outer iteration to find the approximate solutions of these linear subsystems. It can be shown that the iterative sequence generated by the multi parameter iterative algorithm finally converges to the PageRank vector when the parameters satisfy the certain conditions. Numerical experiments show that the proposed algorithm has better convergence and numerical stability than the existing algorithms.",
        "link": "http://dx.doi.org/10.20944/preprints202306.1917.v1"
    },
    {
        "id": 1050,
        "title": "Link-Based Weighted PageRank",
        "authors": "BING-YUAN PU, CHAO WANG",
        "published": "2018-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12783/dtetr/ecame2017/18445"
    },
    {
        "id": 1051,
        "title": "Calculating PageRank in a changing network with added or removed edges",
        "authors": "Christopher Engström, Sergei Silvestrov",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.4972644"
    },
    {
        "id": 1052,
        "title": "Axiomatization of the PageRank Centrality",
        "authors": "Tomasz Wąs, Oskar Skibski",
        "published": "2018-7",
        "citations": 3,
        "abstract": "We propose an axiomatization of PageRank. Specifically, we introduce five simple axioms—Foreseeability, Outgoing Homogeneity, Monotonicity, Merging, and Dummy Node—and show that PageRank is the only centrality measure that satisfies all of them. Our axioms give a new conceptual and theoretical underpinnings of PageRank and show how it differs from other centralities.",
        "link": "http://dx.doi.org/10.24963/ijcai.2018/542"
    },
    {
        "id": 1053,
        "title": "Non-Stationary Acceleration Strategies for PageRank Computing",
        "authors": "Héctor Migallón, Violeta Migallón, José Penadés",
        "published": "2019-10-1",
        "citations": 0,
        "abstract": "In this work, a non-stationary technique based on the Power method for accelerating the parallel computation of the PageRank vector is proposed and its theoretical convergence analyzed. This iterative non-stationary model, which uses the eigenvector formulation of the PageRank problem, reduces the needed computations for obtaining the PageRank vector by eliminating synchronization points among processes, in such a way that, at each iteration of the Power method, the block of iterate vector assigned to each process can be locally updated more than once, before performing a global synchronization. The parallel implementation of several strategies combining this novel non-stationary approach and the extrapolation methods has been developed using hybrid MPI/OpenMP programming. The experiments have been carried out on a cluster made up of 12 nodes, each one equipped with two Intel Xeon hexacore processors. The behaviour of the proposed parallel algorithms has been studied with realistic datasets, highlighting their performance compared with other parallel techniques for solving the PageRank problem. Concretely, the experimental results show a time reduction of up to     58.4 %     in relation to the parallel Power method, when a small number of local updates is performed before each global synchronization, outperforming both the two-stage algorithms and the extrapolation algorithms, more sharply as the number of processes increases.",
        "link": "http://dx.doi.org/10.3390/math7100911"
    },
    {
        "id": 1054,
        "title": "Distributed Randomized Algorithms for PageRank Based on a Novel Interpretation",
        "authors": "Atsushi Suzuki, Hideaki Ishii",
        "published": "2018-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc.2018.8430939"
    },
    {
        "id": 1055,
        "title": "Google's PageRank and the Pedagogy of Linear Dynamic Systems",
        "authors": "Babak Ayazifar",
        "published": "2020-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscas45731.2020.9181125"
    },
    {
        "id": 1056,
        "title": "<i>DomainRank</i>: Improving Biological Data Sets With Domain Knowledge and Google’s PageRank",
        "authors": "Michael Schneider, Juri Rappsilber, Oliver Brock",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractMotivationThe quality of biological data crucially affects progress in science. This quality can be improved with better measurement devices, more sophisticated experimental designs, or repetitious measurements. Each of these options is associated with substantial costs. We present a simple computational tool as an alternative. This algorithmic tool, called DomainRank, leverages simple domain knowledge and overlapping information content in biological network data to improve measurement quality at a negligible cost. Following the simple computational template of Domain-Rank, researchers can boost the confidence of their own data with little effort.ResultsWe demonstrate the performance of DomainRank in three test cases: DomainRank finds 14.9% more interactions in quantitative proteomics experiments, improves the precision of predicted residue-residue contacts from co-evolutionary data by up to 11.6% (averaged over 882 proteins), and identifies 89.2% more cross-links in photo-crosslinking/mass spectrometry (photo-CLMS) experiments. Although our proposed template is specialized on biological network data, we view this approach as an universal computational tool for data improvement that could be routinely applied in many disciplines.AvailabilityAn implementation of DomainRank is freely available: https://github.com/Rappsilber-Laboratory/pagerank-refine",
        "link": "http://dx.doi.org/10.1101/2022.09.26.509059"
    },
    {
        "id": 1057,
        "title": "Personalized Pagerank Graph Attention Networks",
        "authors": "Julie Choi",
        "published": "2022-5-23",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp43922.2022.9746788"
    },
    {
        "id": 1058,
        "title": "Using PageRank Algorithm to Predict and Prevent Congestion in Software Defined Networking",
        "authors": "Jian-Bo Chen Jian-Bo Chen, Wei-Kang Cheng Jian-Bo Chen",
        "published": "2021-11",
        "citations": 0,
        "abstract": "\n",
        "link": "http://dx.doi.org/10.53106/160792642021112206006"
    },
    {
        "id": 1059,
        "title": "A Before-and-After Study in Changes of the Railway Network Centrality on Dongdaegu Multi-Modal Transit Hub: Focused on PageRank Centrality",
        "authors": "Jiyun SHIM, Kyounga PARK, Jae Hyun LEE",
        "published": "2022-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7470/jkst.2022.40.5.669"
    },
    {
        "id": 1060,
        "title": "A Weighted PageRank for Scientific Paper Ranking",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/wcse.2018.06.024"
    },
    {
        "id": 1061,
        "title": "Damping Effect on PageRank Distribution",
        "authors": "Tiancheng Liu, Yuchen Qian, Xi Chen, Xiaobai Sun",
        "published": "2018-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/hpec.2018.8547555"
    },
    {
        "id": 1062,
        "title": "Learn About PageRank in R With Data From the Florentine Family Dataset (1994)",
        "authors": "Feng Shi,  ",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526477972"
    },
    {
        "id": 1063,
        "title": "Pagerank and Mutual Information-Based Multi-Label Classifier Chains Algorithm",
        "authors": "Jiaman Ding, Shuang Hu, Lianyin Jia, Xiaodong Fu, Ying Jiang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4399134"
    },
    {
        "id": 1064,
        "title": "Node importance evaluation in multi-platform avionics architecture based on TOPSIS and PageRank",
        "authors": "Liu Chang, Wang JinYan, Xia Rui",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn this paper, a node importance evaluation method for multi-platform avionics architecture oriented to collaborative task capability is proposed, aiming at the evaluation problem of node contribution under the air combat collaborator, focusing on the influence brought by collaborative task information activities, considering the charged relationship between nodes, link networking relationship, collaborative task style relationship, data information processing, storage mode, and other factors. The evaluation results mainly reflect the contribution and importance of nodes to collaborative tasks. First, the TOPSIS method was used to evaluate the overall contribution of nodes under different indicator scales. 2) Secondly, a PageRank evaluation method is proposed to reflect the node-pointing relationship. The comprehensive weight of nodes considers the rationality of TOPSIS and PageRank algorithms. 3) Finally, the information entropy method is used to evaluate the overall combat capability.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2404837/v1"
    },
    {
        "id": 1065,
        "title": "A PageRank Algorithm based on Asynchronous Gauss-Seidel Iterations",
        "authors": "Daniel Silvestre, Joao Hespanha, Carlos Silvestre",
        "published": "2018-6",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc.2018.8431212"
    },
    {
        "id": 1066,
        "title": "Multilingual Text Summarization Based On LDA And Modified Pagerank",
        "authors": "Zuhair Hussein Ali, Suhad Malallah",
        "published": "2019",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.34279/0923-009-003-013"
    },
    {
        "id": 1067,
        "title": "Reducing Pagerank Communication via Propagation Blocking",
        "authors": "Scott Beamer, Krste Asanovic, David Patterson",
        "published": "2017-5",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipdps.2017.112"
    },
    {
        "id": 1068,
        "title": "Network Essence: PageRank Completion and Centrality-Conforming Markov Chains",
        "authors": "Shang-Hua Teng",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-44479-6_31"
    },
    {
        "id": 1069,
        "title": "PageRank Algorithm",
        "authors": "Albi Dode, Silvester Hasani",
        "published": "2017-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.9790/0661-1901030107"
    },
    {
        "id": 1070,
        "title": "A Data-Driven Strategy for Online Hate Speech Spreader Identification using Modified Pagerank",
        "authors": "Smita Ghosh, Shiv Jhalani",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Social media platforms have become breeding grounds for the dissemination of misinformation and harmful content, including hate speech. This research paper aims to tackle the urgent problem of hate speech circulation on Online Social Networks by primarily focusing on the early identification of users who are prone to spreading it. To achieve this objective, a novel data-driven metric is introduced, referred to as ’Hate Speech Potential’. Additionally, an innovative approach is proposed that leverages a modified version of the PageRank algorithm, termed the ’Hate Speech Potential Rank’ algorithm, to effectively detect and identify malicious users within a network. In a vast network with billions of nodes, the rapid spread of content makes timely detection and mitigation crucial. By assessing a user’s past behaviour of sharing or publishing hate speech, their ’Hate Speech Potential’ can be determined, enabling the identification of sources and spreaders of such content. The modified PageRank algorithm considers both the user’s individual characteristics and the influence of their neighbourhood, thereby capturing a more comprehensive picture of their sharing patterns. A pre-trained machine learning model was employed to accurately classify hate speech posts. By combining the predicted labels and user characteristics and implementing the modified PageRank algorithm, this paper aims to gain deeper insights into the dynamics of information dissemination within a social network, thereby contributing to a better understanding of user sharing behaviour and facilitating the development of effective strategies for addressing hate speech. K-Means clustering was used in experimental evaluations, demonstrating the effectiveness of the proposed approach.",
        "link": "http://dx.doi.org/10.5121/csit.2023.131916"
    },
    {
        "id": 1071,
        "title": "Multi-Objectives Nonlinear Interval PageRank Algorithm Based on the Constrained Interval Arithmetic",
        "authors": "Chin-Yi Chen, Jih-Jeng Huang",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper presents a novel algorithm, the multi-objective nonlinear interval PageRank (MONIPR) Algorithm. This algorithm extends the conventional PageRank (PR) algorithm, integrating nonlinear interval computation and multi-objective considerations into the computation process. The MONIPR algorithm bridges a research gap in integrating nonlinear interval approaches and multi-objective problems into the PR algorithm, which were traditionally treated separately. In addition, this research adopts the constrained interval arithmetic proposed to address the limitations of the conventional PR algorithm, which tends to overlook uncertainties and results in deterministic outcomes. In addition, we use a numerical example to demonstrate the proposed algorithm, contrasting it with the conventional approaches. A numerical example demonstrates the algorithm's performance by comparing the rank intervals obtained with the traditional crisp Markov chain and PR algorithm. The results highlight the ability of the proposed algorithm to provide a range of possible rank intervals, considering both uncertainty and multi-objectives. The findings suggest potential applications in decision-making, uncertainty quantification, and systems analysis.",
        "link": "http://dx.doi.org/10.20944/preprints202307.1392.v1"
    },
    {
        "id": 1072,
        "title": "Distributed Algorithms for Fully Personalized PageRank on Large Graphs",
        "authors": "Wenqing Lin",
        "published": "2019-5-13",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3308558.3313555"
    },
    {
        "id": 1073,
        "title": "7. Calculating Networks: From Sociometry to PageRank",
        "authors": "",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9789048537419-009"
    },
    {
        "id": 1074,
        "title": "PageRank:",
        "authors": "",
        "published": "2020-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvz938zn.6"
    },
    {
        "id": 1075,
        "title": "Revisiting the sensitivity analysis of Google’s PageRank",
        "authors": "Hirotada Honda",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1587/comex.2018xbl0116"
    },
    {
        "id": 1076,
        "title": "Taipei Metro Network Centrality Analysis Using Pagerank Algorithm",
        "authors": "Chien-Cheng Tseng, Su-Ling Lee",
        "published": "2022-11-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tencon55691.2022.9977741"
    },
    {
        "id": 1077,
        "title": "Realtime personalized PageRank query for social network search",
        "authors": "Jiang Wu",
        "published": "2017-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iaeac.2017.8054096"
    },
    {
        "id": 1078,
        "title": "Deriving Highly Efficient Implementations of Parallel PageRank",
        "authors": "Bart van Strien, Kristian Rietveld, Harry Wijshoff",
        "published": "2017-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icppw.2017.26"
    },
    {
        "id": 1079,
        "title": "Identifying Critical Projects via PageRank and Truck Factor",
        "authors": "Rolf-Helge Pfeiffer",
        "published": "2021-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/msr52588.2021.00017"
    },
    {
        "id": 1080,
        "title": "Algorithm Analysis of Trade Gravity Model Based on PageRank Algorithm",
        "authors": "Jiayi Chen",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00043"
    },
    {
        "id": 1081,
        "title": "PRESERVING PRIVACY FOR PAGERANK ALGORITHM",
        "authors": "Tho Thi Ngoc Le",
        "published": "2020-3-3",
        "citations": 0,
        "abstract": "Data mining has been emergingly applied in many fields to discover the knowledge from the huge data. To do that, information has been sent forward and backward among data owners, users, and maybe third parties. In this situation, it is necessary to design systems to exchange the data between the data owner, the client and third parties during data mining process without scarifying the sensitiveness of data. Hence, we need a privacy preserving mechanism while mining to protect the data as in the situation of sophisticated cyber-attack. In this work, we describe a model for ensuring the privacy in ranking on the graph using PageRank and Shamir Secure Sharing scheme. Specifically, Shamir Secure Sharing scheme has been applied to share the information of graph from the data owner to many servers (i.e. third party). Then, the share of graph on each server will be ranked separately. When the users need the results of ranking and make a request, the information from servers will be combined for the users. Doing this way, the third party doesn’t know the meaning of data but still run analyzing the data. Hence, data owner preserves the privacy of his data while users still retrieve a piece of the information as needed.",
        "link": "http://dx.doi.org/10.26480/jtin.02.2021.58.60"
    },
    {
        "id": 1082,
        "title": "A Weakness Relevance Evaluation Method Based on PageRank",
        "authors": "Yanan Du, Yueming Lu",
        "published": "2019-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dsc.2019.00070"
    },
    {
        "id": 1083,
        "title": "Pagerank Algorithm for Directed Hypergraph",
        "authors": "Loc Tran",
        "published": "2019-11-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26782/jmcms.spl.4/2019.11.00004"
    },
    {
        "id": 1084,
        "title": "Efficient Parallel PageRank Algorithm for Network Analysis",
        "authors": "Maxence Vandromme, Serge G. Petiton",
        "published": "2022-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipdpsw55747.2022.00188"
    },
    {
        "id": 1085,
        "title": "PageRank Computation via Web Aggregation in Distributed Randomized Algorithms",
        "authors": "Atsushi Suzuki, Hideaki Ishii",
        "published": "2019-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cdc40024.2019.9029680"
    },
    {
        "id": 1086,
        "title": "Half-Precision Floating-Point Formats for PageRank: Opportunities and Challenges",
        "authors": "Amir Sabbagh Molahosseini, Hans Vandierendonck",
        "published": "2020-9-22",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/hpec43674.2020.9286179"
    },
    {
        "id": 1087,
        "title": "A PageRank-based collaborative filtering recommendation approach in digital libraries",
        "authors": "",
        "published": "2017-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17559/tv-20160602011232"
    },
    {
        "id": 1088,
        "title": "Enhancing Recommendation System using Adapted Personalized PageRank Algorithm",
        "authors": "Ghaidaa A. Al-Sultany",
        "published": "2022-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iiceta54559.2022.9888678"
    },
    {
        "id": 1089,
        "title": "An Improved PageRank Algorithm for Multilayer Networks",
        "authors": "Jo Cheriyan, G P Sajeev",
        "published": "2020-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/conecct50063.2020.9198566"
    },
    {
        "id": 1090,
        "title": "A Speedup Method for Iterative Computation of Pagerank Centrality",
        "authors": "Chien-Cheng Tseng, Su-Ling Lee",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226913"
    },
    {
        "id": 1091,
        "title": "Dynamic Batch Parallel Algorithms for Updating PageRank",
        "authors": "Subhajit Sahu, Kishore Kothapalli, Dip Sankar Banerjee",
        "published": "2022-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ipdpsw55747.2022.00186"
    },
    {
        "id": 1092,
        "title": "Eigenvector Pagerank difference as a measure to reveal topological characteristics of the brain connectome for neurosurgery",
        "authors": "Michael Sughrue, Stephane Doyen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52843/cassyni.x2dwjs"
    },
    {
        "id": 1093,
        "title": "Node-Centric Random Walk for Fast Index-Free Personalized PageRank",
        "authors": "Kohei Tsuchida, Naoki Matsumoto, Kunitake Kaneko",
        "published": "2023-1-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoin56518.2023.10049056"
    },
    {
        "id": 1094,
        "title": "Retracted: Internet Tourism Resource Retrieval Using PageRank Search Ranking Algorithm",
        "authors": " Complexity",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "link": "http://dx.doi.org/10.1155/2024/9758761"
    },
    {
        "id": 1095,
        "title": "Estimating PageRank deviations in crawled graphs",
        "authors": "Helge Holzmann, Avishek Anand, Megha Khosla",
        "published": "2019-12",
        "citations": 3,
        "abstract": "AbstractMost real-world graphs collected from the Web like Web graphs and social network graphs are partially discovered or crawled. This leads to inaccurate estimates of graph properties based on link analysis such asPageRank. In this paper we focus on studying such deviations in ordering/ranking imposed byPageRankover crawled graphs. We first show that deviations in rankings induced byPageRankare indeed possible. We measure how much a ranking, induced byPageRank, on an input graph could deviate from the original unseen graph. More importantly, we are interested in conceiving a measure that approximates the rank correlation among them without any knowledge of the original graph. To this extent we formulate theHAKmeasure that is based on computing the impact redistribution ofPageRankaccording to the local graph structure. We further propose an algorithm that identifies connected subgraphs over the input graph for which the relative ordering is preserved. Finally, we perform extensive experiments on both real-world Web and social network graphs with more than 100M vertices and 10B edges as well as synthetic graphs to showcase the utility ofHAKand ourHigh-fidelity Component Selectionapproach.",
        "link": "http://dx.doi.org/10.1007/s41109-019-0201-9"
    },
    {
        "id": 1096,
        "title": "PageRank asymptotics on directed preferential attachment networks",
        "authors": "Sayan Banerjee, Mariana Olvera–Cravioto",
        "published": "2022-8-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/21-aap1757"
    },
    {
        "id": 1097,
        "title": "Rank NBA teams with Event-Driven PageRank Algorithm",
        "authors": "Liyuan Fan, Liming He",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3624288.3624292"
    },
    {
        "id": 1098,
        "title": "A modified PageRank algorithm for biological pathway ranking",
        "authors": "Qingyang Zhang",
        "published": "2018-1",
        "citations": 3,
        "abstract": "Pathways are the functional building blocks of complex diseases such as cancer. Identifying disease‐associated pathways is of great importance to the development of novel therapeutics, as it provides functional insights into the pathogenesis of a disease. Existing methods for pathway ranking, however, are mostly based on an enrichment score assigned to each pathway independently, which could be biased by overlooking the interactions between pathways. In this paper, we consider a modification of Google's PageRank algorithm in order to fully incorporate the pathway dependencies into the pathway ranking. The proposed measurement is a trade‐off between two important aspects, namely, the phenotype–pathway association and pathway coexpression. We propose to use a projection correlation to quantify pathway coexpression, and a generalized R2 for phenotype–pathway association. Our simulation study on real pathways shows the competitive performance of the new measure compared with enrichment‐based analyses in pathway ranking.",
        "link": "http://dx.doi.org/10.1002/sta4.204"
    },
    {
        "id": 1099,
        "title": "Informationssuche im Web: Google’s PageRank",
        "authors": "Frank Haußer, Yuri Luchko",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-662-59744-6_7"
    },
    {
        "id": 1100,
        "title": "Keyphrase Extraction Using PageRank and Word Features",
        "authors": "Huong T. Le, Que X. Bui",
        "published": "2021-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/rivf51545.2021.9642124"
    }
]