[
    {
        "id": 30705,
        "title": "Deep Learning for Active Robotic Perception",
        "authors": "Nikolaos Passalis, Pavlos Tosidis, Theodoros Manousis, Anastasios Tefas",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012295800003595"
    },
    {
        "id": 30706,
        "title": "Image Reconstruction from Visual Perception and Visual Imagery for BMI Systems",
        "authors": "Yuma Sugimoto, Goragod Pongthanisorn, Genci Capi",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rose60297.2023.10410800"
    },
    {
        "id": 30707,
        "title": "Characterization of Soft Robotic Antenna for Close-Proximity Distance Perception",
        "authors": "Ozan Demir, Emre Öztürk, Engincan Sayar, İsmail Uyanik, Şölen Kumbay Yildiz",
        "published": "2023-7-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223777"
    },
    {
        "id": 30708,
        "title": "Hybrid 5G Positioning Systems with Applications to Mobile Robot Technology",
        "authors": "Chen HY",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "A new concept of 5G/INS integration of artificial intelligence-based systems is proposed, namely the Recurrent Neural Networkbased Fuzzy Inference System (RNNFIS). The 5G system with fuzzy logic was used as a reference during its availability. Data from the 5G system and the inertial navigation system (INS) are used to build a structured knowledge base consisting of the behavior of the INS system in some special scenarios of robotic technology. Using the same data, the proposed fuzzy system is trained to obtain corrected navigation data. In the absence of 5G system information, the system will only utilize data from the INS system and blur correction algorithms to perform its tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/art-16000106"
    },
    {
        "id": 30709,
        "title": "Soft Manipulator for Soft Robotic Applications: a Review",
        "authors": "Dhruba Jyoti Sut, Prabhu Sethuramalingam",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01877-4"
    },
    {
        "id": 30710,
        "title": "Geometry perception and motion planning in robotic assembly based on semantic segmentation and point clouds reconstruction",
        "authors": "Yuze Jiang, Guanghui Liu, Zhouzhou Huang, Bin Yang, Wenyu Yang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.107678"
    },
    {
        "id": 30711,
        "title": "Cyber Security for Surgical Remote Intelligent Robotic Systems",
        "authors": "Alexandra Bernadotte",
        "published": "2023-2-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icara56516.2023.10126050"
    },
    {
        "id": 30712,
        "title": "Simultaneous allocation and sequencing of orders for robotic mobile fulfillment system using reinforcement learning algorithm",
        "authors": "Saravana Perumaal Subramanian, Selva Kumar Chandrasekar",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122262"
    },
    {
        "id": 30713,
        "title": "Container loading problem based on robotic loader system: An optimization approach",
        "authors": "Guoshuai Jiao, Min Huang, Yang Song, Haobin Li, Xingwei Wang",
        "published": "2024-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121222"
    },
    {
        "id": 30714,
        "title": "A review on positioning techniques of mobile robots",
        "authors": "Jakub Semborski, Adam Idzkowski",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "In this article, we have reviewed the available positioning, localization and navigation techniques for mobile robots. Different localization techniques based on diverse technologies are compared with one another, along with diverse algorithms and techniques for analyzing this information. The article highlights algorithms based on odometry, triangulation, visual analysis, and marker detection. The analysis included global, local, and personal location. One acquires knowledge on which method is suitable for indoor use and which for outdoor use, as well as the appropriate environmental conditions for each. The accuracy of the individual methods was compared with that of integrated systems consisting of several methods. For practical knowledge, it is possible to determine whether a particular method is cost-effective for a particular solution and to compare the expenses involved. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2024.23893"
    },
    {
        "id": 30715,
        "title": "Beyond Shared Autonomy: Joint Perception and Action for Human-In-The-Loop Mobile Robot Navigation Systems",
        "authors": "Hamed Bozorgi, Trung Dung Ngo",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01942-y"
    },
    {
        "id": 30716,
        "title": "Adaptive Perception and Manipulation for Autonomous Robotic Kitting in Dynamic Warehouse Environments",
        "authors": "Philip Lund Møller, Milad Jami, Karl Damkjær Hansen, Dimitrios Chrysostomou",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ist59124.2023.10355656"
    },
    {
        "id": 30717,
        "title": "Neuromorphic electronics for robotic perception, navigation and control: A survey",
        "authors": "Yi Yang, Chiara Bartolozzi, Haiyan H. Zhang, Robert A. Nawrocki",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106838"
    },
    {
        "id": 30718,
        "title": "Autonomous control of shore robotic charging systems based on computer vision",
        "authors": "Emin Güney, Cüneyt Bayılmış, Serap Çakar, Erdeniz Erol, Özhan Atmaca",
        "published": "2024-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122116"
    },
    {
        "id": 30719,
        "title": "A reliable stochastic computational procedure to solve the mathematical robotic model",
        "authors": "Zulqurnain Sabir, Salem Ben Said, Qasem Al-Mdallal, Shahid Ahmad Bhat",
        "published": "2024-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122224"
    },
    {
        "id": 30720,
        "title": "Online modeling and prediction of weld bead geometry in robotic gas metal arc based additive manufacturing using grey prediction model",
        "authors": "K. Venkata Rao",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121284"
    },
    {
        "id": 30721,
        "title": "Applications of collaborative robots in agile manufacturing: a review",
        "authors": "Siddhant Kakade, Bhumeshwar Patle, Ashish Umbarkar",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "Collaborative robots are machines that work hand in hand with humans; or as the name suggests, collaborate with them in a specific workspace. These robots are not enclosed in confined safety zones like traditional robots, as they interact very closely with humans. Though this is the case, appropriate measures are captivated while designing these robots considering human safety. These robots are well-versed in adapting to changes and frequent upgrades. They are flexible enough to carry out complex tasks. Due to these abilities, they become a significant asset in the manufacturing field. It’s been many years now since cobots are introduced in the industry sector. So, this is the right time to review various applications of cobots in manufacturing. First, the paper starts with a brief introduction followed by an extensive literature review which was structured after reviewing 76 research papers and articles. It ends with some essential conclusions. This paper discusses the diverse applications of cobots used in the manufacturing sector and their advantages. Further, it highlights the future of cobots and how they will be a boon for a technology-driven world.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23238"
    },
    {
        "id": 30722,
        "title": "Artificial Intelligence (AI)-Enhanced E-Skin with Artificial Synapse Sensory Output for Humanoid Robotic Finger of Multimodal Perception",
        "authors": "Xinge Guo, Chengkuo Lee",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mems49605.2023.10052121"
    },
    {
        "id": 30723,
        "title": "Rethinking scene representation: A saliency-driven hierarchical multi-scale resampling for RGB-D scene point cloud in robotic applications",
        "authors": "Xurui Li, Guangshuai Liu, Si Sun, Bailin Li, Wenyu Yi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122881"
    },
    {
        "id": 30724,
        "title": "Intelligent Escape of Robotic Systems: A Survey of Methodologies, Applications, and Challenges",
        "authors": "Junfei Li, Simon X. Yang",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01996-y"
    },
    {
        "id": 30725,
        "title": "Enhanced encoder–decoder architecture for visual perception multitasking of autonomous driving",
        "authors": "Muhammad Usman, Muhammad Zaka-Ud-Din, Qiang Ling",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123249"
    },
    {
        "id": 30726,
        "title": "Hierarchical reasoning based on perception action cycle for visual question answering",
        "authors": "Safaa Abdullahi Moallim Mohamud, Amin Jalali, Minho Lee",
        "published": "2024-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122698"
    },
    {
        "id": 30727,
        "title": "Knowledge-guided robot learning on compliance control for robotic assembly task with predictive model",
        "authors": "Quan Liu, Zhenrui Ji, Wenjun Xu, Zhihao Liu, Bitao Yao, Zude Zhou",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121037"
    },
    {
        "id": 30728,
        "title": "The use of unmanned ground vehicles (mobile robots) and unmanned aerial vehicles (drones) in the civil infrastructure asset management sector: Applications, robotic platforms, sensors, and algorithms",
        "authors": "Xi Hu, Rayan H. Assaad",
        "published": "2023-12",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120897"
    },
    {
        "id": 30729,
        "title": "Recursive forecasting for vaccination demand with hybrid feature LSTM considering heterogeneous policies and risk perception",
        "authors": "Qinkai Luo, Chao Yang, Jun Yang",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119545"
    },
    {
        "id": 30730,
        "title": "SOPRANO: Seamless Sales Order Management Robotic Process Automation Experience at SAP",
        "authors": "Görkem Özkan, Eren Esgin",
        "published": "2023-10-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296770"
    },
    {
        "id": 30731,
        "title": "Incremental accelerated gradient descent and adaptive fine-tuning heuristic performance optimization for robotic motion planning",
        "authors": "Shengjie Li, Jin Wang, Haiyun Zhang, Yichang Feng, Guodong Lu, Anbang Zhai",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122794"
    },
    {
        "id": 30732,
        "title": "Development of a Soft Pneumatic Actuator with In-built Flexible Sensing Element for Soft Robotic Applications",
        "authors": "Narendra Gariya, Pushpendra Kumar, Brijesh Prasad",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01955-7"
    },
    {
        "id": 30733,
        "title": "EDSV-Net: An efficient defect segmentation network based on visual attention and visual perception",
        "authors": "Yanqing Huang, Junfeng Jing, Siyu Sheng, Zhen Wang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121529"
    },
    {
        "id": 30734,
        "title": "Enhancing detection performance for robotic harvesting systems through RandAugment",
        "authors": "Giwan Lee, Phayuth Yonrith, Doyeob Yeo, Ayoung Hong",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106445"
    },
    {
        "id": 30735,
        "title": "Realistic feature perception for face frontalization with dual-mode face transformation",
        "authors": "Huanjie He, Jiuzhen Liang, Zhenjie Hou, Hao Liu, Zhuomin Yang, Yunfei Xia",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121344"
    },
    {
        "id": 30736,
        "title": "Perception of robotic-assisted surgery (RAS) among medical students: a systematic review and meta-analysis",
        "authors": "Gyan Chand, Suyash Singh, Sanjay Dhiraaj, Basant Kumar, Asha Shetty, Kurvatteppa Halemani, Tanmoy Ghatak",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-024-01847-4"
    },
    {
        "id": 30737,
        "title": "Specification, stochastic modeling and analysis of interactive service robotic applications",
        "authors": "Livia Lestingi, Davide Zerla, Marcello M. Bersani, Matteo Rossi",
        "published": "2023-5",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104387"
    },
    {
        "id": 30738,
        "title": "A sensor review for human detection with robotic systems in regular and smoky environments",
        "authors": "Sebastian Gelfert",
        "published": "2023-5-1",
        "citations": 1,
        "abstract": " Search and rescue robots gained a significant attention in the past, as they assist firefighters during their rescue missions. The opportunity to move autonomously or remotely controlled with intelligent sensor technology, to detect victims in unknown fire smoke environments, introduces a growing technology in fire engineering. Since sensor systems are a component of mobile robots, there is a demand for intelligent robot vision, especially for human detection in fire smoke environments. In this article, an overview of sensor technologies and their algorithms for human detection in regular and smoky environments is presented. These sensor technologies are categorized into single sensor and multi-sensor systems. Novel sensor approaches are led by artificial intelligence, 3D mapping and multi-sensor fusion. The article provides a contribution for future research directions in algorithms and applications and supports decision-makers in fire engineering to get knowledge in trends, novel applications and challenges in this field of research. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231175238"
    },
    {
        "id": 30739,
        "title": "Investigating Requirements and Expectations of Wearable Telexistence Robotic Systems",
        "authors": "Abdullah Iskandar, Mohammed Al-Sada, Osama Halabi, Tatsuo Nakajima",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rtcsa58653.2023.00040"
    },
    {
        "id": 30740,
        "title": "A sentiment analysis approach for understanding users’ perception of metaverse marketplace",
        "authors": "Ahmed Al-Adaileh, Mousa Al-Kfairy, Mohammad Tubishat, Omar Alfandi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2024.200362"
    },
    {
        "id": 30741,
        "title": "IFPS-RPA: Interface-based Frequent Pattern Segmentation for Robotic Process Automation",
        "authors": "Aya Taha, Sherif A. Mazen, Iman M. A. Helal",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imsa58542.2023.10217426"
    },
    {
        "id": 30742,
        "title": "Integration of robotics and automation in supply chain: a comprehensive review",
        "authors": "Om Mohan Banur, B. K. Patle, Sachin Pawar",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "Robotics and automation have developed as key technologies for supply chain management as a result of the increased demand for quicker and more effective supply chains. Robotics and automation improve supply chain management by lowering long-haul expenses, boosting work and usage strength, reducing errors, declining repetitive stock checks, updating orchestrating, taking care of times, and assembling induction to the problematic and hazardous places. Robotics aids in design, creation, etc. Automation helps to do tasks that are often done by people through the use of self-operating physical machines, computer software, and other technology. Despite being widely accepted as a tool to aid in decision-making, supply chain management (SCM) has very seldom used AI and ML. This article investigates several AI and ML sub-fields that are best suited for resolving real-world SCM-related issues in order to fully realize the potential benefits of AI and Ml for SCM. In doing so, this article examines the track record of successful AI and ML applications to supply chain management and highlights the most fruitful SCM domains to apply AI and ML. And also find out the how robotics and automations helps in warehouse management. The most recent developments in robotics and automation for supply chain management are thoroughly reviewed in this paper. We first give a general overview of the difficulties that supply chain management faces before going over the many ways that robotics and automation are used at various points along the supply chain. Additionally, we go over the advantages of robots and automation in supply chain management, including higher efficiency, accuracy, lower costs, and improved safety. Lastly, we discuss some of the present drawbacks and difficulties associated with robots and automation in supply chain management and suggest some possible directions for further investigation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23349"
    },
    {
        "id": 30743,
        "title": "UPFormer: U-sharped Perception lightweight Transformer for segmentation of field grape leaf diseases",
        "authors": "Xinxin Zhang, Fei Li, Haiying Zheng, Weisong Mu",
        "published": "2024-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123546"
    },
    {
        "id": 30744,
        "title": "Enhancing Robotic Performance: Analyzing Force and Torque Measurements for Predicting Execution Failures",
        "authors": "Amal Hatira, Huseyin Fuat Alsan, Taner Arsan",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296588"
    },
    {
        "id": 30745,
        "title": "ALNet: An adaptive channel attention network with local discrepancy perception for accurate indoor visual localization",
        "authors": "Hongbo Gao, Kun Dai, Ke Wang, Ruifeng Li, Lijun Zhao, Mengyuan Wu",
        "published": "2024-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123792"
    },
    {
        "id": 30746,
        "title": "A Study on Human Perception of Document Paragraph Layout",
        "authors": "Benjamin Aziz, Aysha Bukhelli",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iisa59645.2023.10345961"
    },
    {
        "id": 30747,
        "title": "Consideration of skewness in designing robotic compact storage and retrieval systems",
        "authors": "Mahmut Tutam, Jingming Liu, John A. White",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123361"
    },
    {
        "id": 30748,
        "title": "7 DOF Robotic Arm Inverse Kinematic Analysis with Cuckoo and Whale Algorithms",
        "authors": "Nisa Koban, Nazlıcan Çavli, Hülya Doğan, Emrah Benli",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296820"
    },
    {
        "id": 30749,
        "title": "Deep Learning Models for Video-based Hand Gesture Recognition in Robotic Applications",
        "authors": "Rinki Gupta, Pranavi Madan, Gowri Srinivasan",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10113132"
    },
    {
        "id": 30750,
        "title": "Employees’ perception of value-added activity increase of Robotic Process Automation with time and cost efficiency: a case study",
        "authors": "Arafat Salih Aydıner, Selman Ortaköy, Zehra Özsürünç",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "Implementation of Robotic Process Automation (RPA) is ubiquitous in the financial industry. However, the consequences are not clear enough in terms of strategic perspective. Drawing upon the theory of Task-Technology Fit, this study explores the emerging consequences with the exploratory sequential method. Data related to the time and cost of processes before and after the RPA implementation were collected and descriptively analyzed. Even though time and cost efficiency improvements occurred in 50 out of 54 of the processes, the results indicated no labor reduction after the RPA implementation and no cost reduction in some business units, contrary to reports in the literature. To investigate what happened to the human resource environment, we surveyed 106 employees who were affected by the implementation of RPA. No variance was found between the characteristics of the employees and the changes in the working environment. However, the descriptive results of the survey revealed that employees’ perception of value-added activities increased. These results provided that considering RPA as a routine process without calculating the strategic value creates process-oriented transformation with a lack of time and cost-efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12821/ijispm110102"
    },
    {
        "id": 30751,
        "title": "Increasing Order of Digital Filters of the Same Type in Robotic Systems",
        "authors": "Tykhon Sytnikov, Valerii Sytnikov, Oleh Streltsov, Pavlo Stupen",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idaacs58523.2023.10348806"
    },
    {
        "id": 30752,
        "title": "Active Electric Perception-Based Haptic Modality with Applications to Robotics",
        "authors": "Michael Zechmair, Yannick Morel",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341465"
    },
    {
        "id": 30753,
        "title": "BPFAaC: A radar intelligent perception algorithm in 6G integrated sensing and communications scenarios",
        "authors": "Buhua Chen, Hanjiang Liu, Xuefeng Zhang, Buyang Shen, Chen Li, Honglei Xu, Kunlun Li, Yongbing Fan",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121547"
    },
    {
        "id": 30754,
        "title": "Advancements in Learning-Based Navigation Systems for Robotic Applications in MRO Hangar: Review",
        "authors": "Ndidiamaka Adiuku, Nicolas P. Avdelidis, Gilbert Tang, Angelos Plastropoulos",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "The field of learning-based navigation for mobile robots is experiencing a surge of interest from research and industry sectors. The application of this technology for visual aircraft inspection tasks within a maintenance, repair, and overhaul (MRO) hangar necessitates efficient perception and obstacle avoidance capabilities to ensure a reliable navigation experience. The present reliance on manual labour, static processes, and outdated technologies limits operation efficiency in the inherently dynamic and increasingly complex nature of the real-world hangar environment. The challenging environment limits the practical application of conventional methods and real-time adaptability to changes. In response to these challenges, recent years research efforts have witnessed advancement with machine learning integration aimed at enhancing navigational capability in both static and dynamic scenarios. However, most of these studies have not been specific to the MRO hangar environment, but related challenges have been addressed, and applicable solutions have been developed. This paper provides a comprehensive review of learning-based strategies with an emphasis on advancements in deep learning, object detection, and the integration of multiple approaches to create hybrid systems. The review delineates the application of learning-based methodologies to real-time navigational tasks, encompassing environment perception, obstacle detection, avoidance, and path planning through the use of vision-based sensors. The concluding section addresses the prevailing challenges and prospective development directions in this domain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24051377"
    },
    {
        "id": 30755,
        "title": "Towards Better Perception Quality Index",
        "authors": "Oleg Kravchuk, Galyna Kriukova",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idaacs58523.2023.10348901"
    },
    {
        "id": 30756,
        "title": "Dense frustum-aware fusion for 3D object detection in perception systems",
        "authors": "Yuanzhi Deng, Jianhao Shen, Huajie Wen, Cheng Chi, Yang Zhou, Gang Xu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122061"
    },
    {
        "id": 30757,
        "title": "Robotic Orchard : A Smart and Efficient Solution for Fruit Harvesting",
        "authors": " Amisha, Babli Kumari,  Priya, Shambhavi Kumari, Srividya B. V",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsses58299.2023.10200335"
    },
    {
        "id": 30758,
        "title": "Evaluation of Urban Perception Using Only Image Segmentation Features",
        "authors": "Xinyi Li, Benjamin Beaucamp, Vincent Tourre, Thomas Leduc, Myriam Servières",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011969700003473"
    },
    {
        "id": 30759,
        "title": "Research on environmental adaptability of AI-based visual perception system under the perspective of vibration",
        "authors": "Xingge Li, Shufeng Zhang, Xun Chen, Yashun Wang, Zhengwei Fan, Xiaofei Pang, Jingwen Hu, Kaihong Hou",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120636"
    },
    {
        "id": 30760,
        "title": "Revolutionizing urology: the advancements and applications of robotic platforms",
        "authors": "Kinju Adhikari, Gowtham Krishna Penmetsa, Deepak Krishnappa, Ravi Taori, S. K. Raghunath",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-023-01758-w"
    },
    {
        "id": 30761,
        "title": "A review on path planning ai techniques for mobile robots",
        "authors": "Shrinivas Deshpande, Abhishek Kumar Kashyap, Bhumeshwar K. Patle",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "An Industrial Robot is used in industries for transporting, assembly, manufacturing and many more applications. Industrial robots include manufacturing robots, material handling robots, robotic arm and manipulator, mobile robots, assembly robots, etc. In this paper, Mobile Robots are further being discussed. One of the tools that a Mobile Robot uses to function is all with the help of Artificial Intelligence (AI) for performing several tasks autonomously. AI works as the intelligence of the human body for robots. AI is the technology that made it possible for robots to be capable of being totally autonomous. AI marks its presence in the Manufacturing Industry with the 4th Industrial Revolution. AI has several algorithms that help in collecting and analyzing data in order to help robots to function in specific ways. These techniques include Fuzzy Logic, Genetic Algorithm, Neural Network, etc. In this paper, the role of these algorithms in Mobile Robots is discussed. Based on the review of 74 papers and articles, it is observed that there are no review papers discussing the role of nature-based and conventional algorithms used for navigation in Mobile Robots. The use of different AI techniques for specific applications has been discussed in tabular form in this paper.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23090"
    },
    {
        "id": 30762,
        "title": "A Flexible Framework for Robotic Post-Processing of 3D Printed Components",
        "authors": "Albin Bajrami, Matteo Claudio Palpacelli",
        "published": "2023-8-20",
        "citations": 1,
        "abstract": "Abstract\nThree-dimensional (3D) printing has revolutionized the production of mechanical components by enabling the creation of objects of complex geometry, but at the same time it has introduced new issues related to post-processing operations. Similarly, robotics has seen an evolution with the emergence of collaborative robots, which can support the operator in human-centric applications. This work aims to bring these two technologies together by presenting a flexible framework for processing raw products obtained through 3D printing technology with the support of collaborative robotics. This framework lays the foundation for the subsequent development of a human-robot cooperation protocol with the aim of simplifying post-processing and particularly finishing operations of metal-printed 3D objects. In this paper, an initial integrated solution is proposed that can address the post-processing needs of objects from 3D printing, providing guidance on the software and hardware tools to be used and the process to be followed to achieve a quality product in compliance with the relevant standards. Verifications in a simulation environment and through algorithms based on the kinematics and statics of a Fanuc collaborative robot implemented in a numerical environment allow verification of the feasibility of several operations. The result is a comprehensive framework that starts from the feasibility study and reaches the completion of the 3D printed component through finishing and post-processing operations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-109746"
    },
    {
        "id": 30763,
        "title": "Human Factor Analysis in Robotic and Autonomous Systems for Military Applications",
        "authors": "Hae-In Lee, Seokwon Lee, Hyo-Sang Shin, Antonios Tsourdos, Sarah Fletcher",
        "published": "2023",
        "citations": 0,
        "abstract": "This paper aims to provide a human factor guidance for developing robotic and autonomous systems (RAS) in military applications. A systematic literature review was conducted to identify key aspects to characterise RAS teamed up with human operators, answering the two research questions: i) what the various characteristics of RAS that involve human roles are, and ii) how the characteristics of RAS affect human requirements. Using Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA) framework, state-of-the-art researches on RAS are classified based on different characteristics, such as application context, RAS type, level of autonomy, network architecture, operational environment, and interface. Then, the effect of the RAS characteristics on human requirements is analysed by identifying their relationships. Direct relationship is established with respect to the level of autonomy, requiring trust, intelligibility, understandability, and obtrusiveness for human requirements. RAS application context and other characteristics indirectly contribute to different human requirements, by requiring or supporting different levels of autonomy. This study concludes with discussion points to be taken forward, identifies research gaps in current methodologies, and suggests future research directions. Key challenges identified for future research include interactions with human, integration to existing systems, asymmetries in level of autonomy, and validation and verification of different subsystems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1003520"
    },
    {
        "id": 30764,
        "title": "Improving ride comfort and road friendliness of heavy truck using semi-active suspension system",
        "authors": "Hao Li, Vanliem Nguyen",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "To enhance the ride comfort and improve the road friendliness of the heavy truck, based on the dynamic model of the heavy truck, the semi-active suspension system of the vehicle is proposed and controlled based on the fuzzy logic control and Matlab/Simulink software. The efficiency of the semi-active suspension system is then evaluated based on the indexes of the root mean square acceleration of the driver’s seat, the root mean square acceleration of the cab's pitching angle, and the dynamic load coefficient of the wheel axles. The results show that with the semi-active suspension system of the heavy truck controlled by the fuzzy logic control, the acceleration responses of the heavy truck and the dynamic forces of the wheel axles are greatly reduced in comparison with the passive suspension system under various operating conditions of the loads and speeds. Especially, with the semi-active suspension system controlled by the fuzzy logic control, the root mean square accelerations of the driver’s seat and cab pitch angle; and the dynamic load coefficient at 2nd axle of the wheel are clearly reduced by 23.7 %, 27.2 %, and 20.9 % in comparison with the passive suspension system, respectively. Thus, both ride comfort and road friendliness of the heavy truck are improved by the semi-active suspension system. In addition, the vehicle load insignificantly affects ride comfort. However, it greatly affects the road damage, especially with the half load condition of the vehicle. Thus, to improve road friendliness, the full load condition of the vehicle should be used.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23021"
    },
    {
        "id": 30765,
        "title": "Evaluating AI-UAV Systems: A Combined Approach with Operator Group Comparison",
        "authors": "Omar Alharasees, Muftah S. M. Abdalla, Utku Kale",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156755"
    },
    {
        "id": 30766,
        "title": "Clinical applications of artificial intelligence in robotic surgery",
        "authors": "J. Everett Knudsen, Umar Ghaffar, Runzhuo Ma, Andrew J. Hung",
        "published": "2024-3-1",
        "citations": 1,
        "abstract": "AbstractArtificial intelligence (AI) is revolutionizing nearly every aspect of modern life. In the medical field, robotic surgery is the sector with some of the most innovative and impactful advancements. In this narrative review, we outline recent contributions of AI to the field of robotic surgery with a particular focus on intraoperative enhancement. AI modeling is allowing surgeons to have advanced intraoperative metrics such as force and tactile measurements, enhanced detection of positive surgical margins, and even allowing for the complete automation of certain steps in surgical procedures. AI is also Query revolutionizing the field of surgical education. AI modeling applied to intraoperative surgical video feeds and instrument kinematics data is allowing for the generation of automated skills assessments. AI also shows promise for the generation and delivery of highly specialized intraoperative surgical feedback for training surgeons. Although the adoption and integration of AI show promise in robotic surgery, it raises important, complex ethical questions. Frameworks for thinking through ethical dilemmas raised by AI are outlined in this review. AI enhancements in robotic surgery is some of the most groundbreaking research happening today, and the studies outlined in this review represent some of the most exciting innovations in recent years.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-024-01867-0"
    },
    {
        "id": 30767,
        "title": "Universal nonlinear disturbance observer for robotic manipulators",
        "authors": "Feilong Zhang, Xin Zhang, Qingxin Li, Hualiang Zhang",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": " Dynamic uncertainties and unknown disturbances will degrade the tracking performance of robots. When using a disturber observer-based controller, the key to effectively compensate for these uncertainties is to measure or estimate as accurately as possible any disturbance. To relax restrictions on the design of the current nonlinear disturbance observer for the robot, a universal nonlinear disturbance observer is proposed for higher estimation performance. The stability of the proposed universal nonlinear disturbance observer is theoretically analyzed and the boundaries of estimation error are proven according to the vector differential equation. Finally, the proposed universal nonlinear disturbance observer is evaluated via simulation by comparison to the nonlinear disturbance observer. The result shows a faster estimation speed and a higher estimation accuracy of the universal nonlinear disturbance observer. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231167669"
    },
    {
        "id": 30768,
        "title": "Medicaroid robotic assisted surgery system: A feasibility study",
        "authors": "Giovanni Capovilla, Evangelos Tagkalos, Caterina Froiio, Edin Hadzijusufovic, Felix Berlth, Peter Philipp Grimminger",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": " The hinotori™ surgical robotic system, by Medicaroid (Medicaroid Corporation, Kobe, Japan), is a new robotic system for minimally invasive surgery. We aimed at evaluating its usability and accessibility in a preclinical setting. This was a preclinical feasibility study. Two groups of surgeons, one with three experienced robotic surgeons (group 1) and one with three robotic-surgery naive participants (group 2), performed the following tasks using the hinotori™ system in a simulated preclinical setting: console setup, docking, instrument exchange, undocking, and suturing. Each participant repeated each task three times. The time required for performing each repetition and the count of failed repetitions were the primary outcomes of the study. The subjectively perceived workload in performing the tasks, as measured by the NASA-TLX score, was the secondary outcome. The improvement of participants within the three repetitions as well as a comparison between the performances of group 1 and 2 were evaluated. The time required to perform each task decreased with repetitions for both groups, so did the subjective workload score. The time measures required to perform the tasks and the mental effort scores were comparable between the two groups for the console setup, docking, instrument exchange, and undocking tasks. The NASA-TLX score was also comparable between the two groups for the console setup and the emergency undocking tasks and decreased significantly within all tasks after the third repetition. The incidence of failed repetitions was higher in group 2 for the suturing task, however the difference was not statistically significant. The results confirmed the usability of the hinotori™ system in a preclinical setting for both highly trained surgeons and nonexperienced operators and its accessibility for both long-time users of other systems and first-time users. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231152704"
    },
    {
        "id": 30769,
        "title": "Deep Active Robotic Perception for Improving Face Recognition Under Occlusions",
        "authors": "Valia Dimaridou, Nikolaos Passalis, Anastasios Tefas",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10372039"
    },
    {
        "id": 30770,
        "title": "Robotic Defect Inspection with Visual and Tactile Perception for Large-Scale Components",
        "authors": "Arpit Agarwal, Abhiroop Ajith, Chengtao Wen, Veniamin Stryzheus, Brian Miller, Matthew Chen, Micah K. Johnson, Jose Luis Susa Rincon, Justinian Rosca, Wenzhen Yuan",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341590"
    },
    {
        "id": 30771,
        "title": "Development and Comparative Study of Advanced Distributed Electronic Control System for Robotic Applications",
        "authors": "Shashank Babu Nair, Sushma Patil, Piyush Mathurkar, Srinivas S Chippalkatti",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciics59993.2023.10421663"
    },
    {
        "id": 30772,
        "title": "Minimizing torque requirements in robotic manipulation through elastic elements optimization in a physics engine",
        "authors": "Maxime Marchal, Dries Marzougui, Raphaël Furnémont, Tom Verstraten, Francis wyffels",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": " The increasing number of robots and the rising cost of electricity have spurred research into energy-reducing concepts in robotics. One such concept, elastic actuation, introduces compliant elements such as springs into the robot structure. This article presents a comparative analysis between two types of elastic actuation, namely, monoarticular parallel elastic actuation and biarticular parallel elastic actuation, and demonstrates an end-to-end pipeline for their optimization. Starting from the real-world system identification of an RRR robotic arm, we calibrate a simulation model in a general-purpose physics engine and employ in silico evolutionary optimization to co-optimize spring configurations and trajectories for a pick-and-place task. Finally, we successfully transfer the in silico optimized elastic elements and trajectory to the real-world prototype. Our results substantiate the ability of elastic actuation to reduce the actuators’ torque requirements heavily. In contrast to previous work, we highlight the superior performance of the biarticular variant over the monoarticular configuration. Furthermore, we show that a combination of both proves most effective. This work provides valuable insights into the torque-reducing use of elastic actuation and demonstrates an actuator-invariant in silico optimization methodology capable of bridging the sim2real gap. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241228371"
    },
    {
        "id": 30773,
        "title": "Force Perception Instrument for Robotic Flexible Micro-Catheter Delivery in Glaucoma Surgery",
        "authors": "Ming-Jun Li, Gui-Bin Bian, Qiang Ye",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450660"
    },
    {
        "id": 30774,
        "title": "Large-scale point cloud semantic segmentation via local perception and global descriptor vector",
        "authors": "Ziyin Zeng, Yongyang Xu, Zhong Xie, Wei Tang, Jie Wan, Weichao Wu",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123269"
    },
    {
        "id": 30775,
        "title": "Outdoor mobility aid for people with visual impairment: Obstacle detection and responsive framework for the scene perception during the outdoor mobility of people with visual impairment",
        "authors": "Wasiq Khan, Abir Hussain, Bilal Muhammad Khan, Keeley Crockett",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120464"
    },
    {
        "id": 30776,
        "title": "Position and Torque Joint Control for Precision Drilling in Robotic Manufacturing Applications",
        "authors": "Mohamed A. Khalifa, Samir N. Mekid, Zeashan H. Khan",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetsis61505.2024.10459489"
    },
    {
        "id": 30777,
        "title": "An MCTS-DRL Based Obstacle and Occlusion Avoidance Methodology in Robotic Follow-Ahead Applications",
        "authors": "Sahar Leisiazar, Edward J. Park, Angelica Lim, Mo Chen",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342150"
    },
    {
        "id": 30778,
        "title": "Development of a Pillow Placement Process for Robotic Bed-Making",
        "authors": "Chi-Hong Cheung, Aaron Hao Tan, Andrew Goldenberg",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "Abstract\nBed-making is a common chore completed in various living environments to promote user comfort, hygiene, and well-being. Unfortunately, the physical and tedious nature of the act makes it challenging for segments of the elderly community to complete the chore, and thus the opportunity arises to develop robots to automate the task. However, despite the opportunity’s importance and positive impact, there is limited research on developing robotic bed-making systems. The aim of this research is to start addressing this gap by proposing methods for accomplishing pillow placement, a major part of the bed-making task. This paper introduces a pillow placement process to be used by a static 6-DOF (degree of freedom) one-armed robotic manipulator equipped with a 2-finger gripper. The process uses YOLOv4-tiny, image transformations, and principal component analysis (PCA) to infer pillow poses in a transformed RGB image, as well as a set of manipulator macro-actions to move pillows to their goal pose. We evaluated the proposed methodology in a real-world setting, where it enabled the robot to place pillows at desired poses on a miniature bed successfully in 89% of the experimental runs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-114747"
    },
    {
        "id": 30779,
        "title": "Autonomous Vehicles for Healthcare Applications: A Review on Mobile Robotic Systems and Drones in Hospital and Clinical Environments",
        "authors": "Paolo Marmaglio, Davide Consolati, Cinzia Amici, Monica Tiboni",
        "published": "2023-11-27",
        "citations": 1,
        "abstract": "The development of autonomous vehicles, both ground and airborne, for hospitals and clinical settings is an extremely interesting topic that has developed rapidly in recent years. Given their significant potential to improve operational efficiency and safety protocols, these devices are gradually gaining an important place in the healthcare industry. This is true for both in-hospital and out-of-hospital functions. The integration of autonomous vehicles into these environments will greatly increase operational efficiency and enrich the experience for both medical staff and patients. This document provides an updated and comprehensive overview of the current state-of-the-art in the development of autonomous vehicles for the healthcare sector. Particular emphasis is placed on design, functionality, and level of autonomy. The review is organized on two levels: a prospective review highlights the main trends in the design and application of autonomous vehicles, and an analytical review performs an in-depth analysis of the main aspects of the technical solutions developed and implemented in the scientific research reviewed. The results are presented in a schematic approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12234791"
    },
    {
        "id": 30780,
        "title": "The Beyond 5G (B5G) Era of Next-Generation Digital Networks: Preliminary Study of a Task-Technology Fit (TTF) Model for Remote Robotic Surgery Applications",
        "authors": "Maradona Gatara, Mjumo Mzyece, Sijo Parekattil",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012384400003657"
    },
    {
        "id": 30781,
        "title": "Average-rendezvous with connectivity preservation for first-order multiagent systems with constant reference signals",
        "authors": "Wei Jiang, Cheng-Lin Liu",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " Average-rendezvous problem with connectivity preservation of constant reference signals is investigated for first-order multiagent systems. According to a constructive potential function, a proportional–integral average-rendezvous algorithm is proposed to make agents converge to the average value of constant reference signals as well as the network connectivity is preserved all the time. Sufficient convergence conditions are obtained for the algorithm by designing the proper Lyapunov functions. Numerical examples illustrate the correctness of theoretical results. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241233850"
    },
    {
        "id": 30782,
        "title": "Perception of robotic actions and the influence of gender",
        "authors": "Miriam Abel, Giovanni Buccino, Ferdinand Binkofski",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "In our society interaction with robots is becoming more and more frequent since robots are not only used in the industry, but increasingly often in assistance and in health system. Perception of robots and their movements is crucial for their acceptance. Here we shortly review basic mechanisms of perception of actions, and then of perception of robotic and human movements. The literature demonstrates that there are commonalities, but also differences in the perception of human and robotic movements. Especially interesting are biologic gender differences in the perception of robotic movements. The results show that males seem to be more sensitive to the differences between robotic and anthropomorphic movements, whereas females seem not to perceive such differences. However, females transfer more anthropomorphic features to robotic movements. While looking at the brain activation during perception of humanoid and robotic movements in different genders one can conclude that different strategies are used; female seem to analyse robotic movements online, while male seem to use previous knowledge from interaction with robots. Further research is needed to specify more such gender differences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpsyg.2024.1295279"
    },
    {
        "id": 30783,
        "title": "Robotic Simulator with High-Precision Perception of Contact Dynamics",
        "authors": "Yongcan Zhou, Yang Pan, Tianjian Lei, Junpeng Chen",
        "published": "2023-11-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdl55364.2023.10364550"
    },
    {
        "id": 30784,
        "title": "Multimodal robotic music performance art based on GRU-GoogLeNet model fusing audiovisual perception",
        "authors": "Lu Wang",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "The field of multimodal robotic musical performing arts has garnered significant interest due to its innovative potential. Conventional robots face limitations in understanding emotions and artistic expression in musical performances. Therefore, this paper explores the application of multimodal robots that integrate visual and auditory perception to enhance the quality and artistic expression in music performance. Our approach involves integrating GRU (Gated Recurrent Unit) and GoogLeNet models for sentiment analysis. The GRU model processes audio data and captures the temporal dynamics of musical elements, including long-term dependencies, to extract emotional information. The GoogLeNet model excels in image processing, extracting complex visual details and aesthetic features. This synergy deepens the understanding of musical and visual elements, aiming to produce more emotionally resonant and interactive robot performances. Experimental results demonstrate the effectiveness of our approach, showing significant improvements in music performance by multimodal robots. These robots, equipped with our method, deliver high-quality, artistic performances that effectively evoke emotional engagement from the audience. Multimodal robots that merge audio-visual perception in music performance enrich the art form and offer diverse human-machine interactions. This research demonstrates the potential of multimodal robots in music performance, promoting the integration of technology and art. It opens new realms in performing arts and human-robot interactions, offering a unique and innovative experience. Our findings provide valuable insights for the development of multimodal robots in the performing arts sector.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnbot.2023.1324831"
    },
    {
        "id": 30785,
        "title": "Su1029 PATIENT PERCEPTION OF ROBOTIC SURGERY",
        "authors": "Arpit Aggarwal, Saakshi Joshi, Ernesto Drelichman, Vijay Mittal, Jasneet Bhullar",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0016-5085(23)04644-9"
    },
    {
        "id": 30786,
        "title": "A general method for the manipulability analysis of serial robot manipulators",
        "authors": "Zhihong Zou",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": " Manipulability quantification and evaluation of robot manipulators plays an important role in robotic mechanism design, motion planning, and control. In this article, a general methodology of using manipulability polytopes to characterize the manipulator’s capability to generate velocities, forces, and accelerations at the end-effector is proposed. This methodology can be used to determine the kinematic, mechanical, and dynamic manipulability of both redundant and nonredundant serial manipulators, where influences of gravity, joint velocities and accelerations, and end-effector payload on the dynamic manipulability are incorporated into the derivation of the manipulability polytopes. Since the manipulability polytope is the feasible region defined by all the joint constraints, the proposed method is suitable for solving the problems including both symmetric and asymmetric joint constraints. Furthermore, a systematic architecture and detailed procedures for performance computation with respect to different types of manipulability of serial robot manipulators are presented. Two typical application examples, respectively, for two and three degree-of-freedom planar manipulators are given to illustrate the correctness and capability of the proposed methodology. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231210665"
    },
    {
        "id": 30787,
        "title": "Towards a second-generation robotic telescope mount for the air-LUSI instrument",
        "authors": "Andrew Newton, Alex McCafferty-Leroux, Stephen Andrew Gadsden, Kevin R. Turpie",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663887"
    },
    {
        "id": 30788,
        "title": "A guide for construction practitioners to integrate robotic systems in their construction applications",
        "authors": "Samuel A. Prieto, Xinghui Xu, Borja García de Soto",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "Introduction: The use of robots can boost productivity and reduce costs in construction projects. However, choosing the right robotic platform for the right application can be challenging, costly, and time-consuming. This paper presents a guide for researchers and construction practitioners interested in using robotic systems.Methods: A methodology covering the different aspects to be considered when it comes to a robotic platform, such as the framework (both hardware and software), the environment the robot is going to be operating, the level of supervision (i.e., autonomy) the robot requires, different hardware required on board (i.e., sensors and computers), and the control strategies and systems and communication network, is presented. The methodology is implemented with a practical application where a semi-autonomous robotic system is designed and developed with the simple goal of data collection on construction sites, making sure that all the steps covered in the methodology are addressed.Results: The results show that the methodology is applicable to a wide range of solutions, with a focus on the development of the platform itself and not the final application.Discussion: This guide is meant to assist in developing a flexible open platform that can be customized to the specific requirements needed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fbuil.2024.1307728"
    },
    {
        "id": 30789,
        "title": "Generating Event-Based Datasets for Robotic Applications using MuJoCo-ESIM",
        "authors": "Gintautas Palinauskas, Camilo Amaya, Evan Eames, Michael Neumeier, Axel Von Arnim",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589737.3605984"
    },
    {
        "id": 30790,
        "title": "Integrating Virtual, Mixed, and Augmented Reality into Remote Robotic Applications: A Brief Review of Extended Reality-Enhanced Robotic Systems for Intuitive Telemanipulation and Telemanufacturing Tasks in Hazardous Conditions",
        "authors": "Yun-Peng Su, Xiao-Qi Chen, Cong Zhou, Lui Holder Pearson, Christopher G. Pretty, J. Geoffrey Chase",
        "published": "2023-11-8",
        "citations": 2,
        "abstract": "There is an increasingly urgent need for humans to interactively control robotic systems to perform increasingly precise remote operations, concomitant with the rapid development of space exploration, deep-sea discovery, nuclear rehabilitation and management, and robotic-assisted medical devices. The potential high value of medical telerobotic applications was also evident during the recent coronavirus pandemic and will grow in future. Robotic teleoperation satisfies the demands of the scenarios in which human access carries measurable risk, but human intelligence is required. An effective teleoperation system not only enables intuitive human-robot interaction (HRI) but ensures the robot can also be operated in a way that allows the operator to experience the “feel” of the robot working on the remote side, gaining a “sense of presence”. Extended reality (XR) technology integrates real-world information with computer-generated graphics and has the potential to enhance the effectiveness and performance of HRI by providing depth perception and enabling judgment and decision making while operating the robot in a dynamic environment. This review examines novel approaches to the development and evaluation of an XR-enhanced telerobotic platform for intuitive remote teleoperation applications in dangerous and difficult working conditions. It presents a strong review of XR-enhanced telerobotics for remote robotic applications; a particular focus of the review includes the use of integrated 2D/3D mixed reality with haptic interfaces to perform intuitive remote operations to remove humans from dangerous conditions. This review also covers primary studies proposing Virtual Reality (VR), Augmented Reality (AR), and Mixed Reality (MR) solutions where humans can better control or interact with real robotic platforms using these devices and systems to extend the user’s reality and provide a more intuitive interface. The objective of this article is to present recent, relevant, common, and accessible frameworks implemented in research articles published on XR-enhanced telerobotics for industrial applications. Finally, we present and classify the application context of the reviewed articles in two groups: mixed reality–enhanced robotic telemanipulation and mixed reality–enhanced robotic tele-welding. The review thus addresses all elements in the state of the art for these systems and ends with recommended research areas and targets. The application range of these systems and the resulting recommendations is readily extensible to other application areas, such as remote robotic surgery in telemedicine, where surgeons are scarce and need is high, and other potentially high-risk/high-need scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132212129"
    },
    {
        "id": 30791,
        "title": "Multicriteria Analysis of the Robotic Systems Autonomy Using Fuzzy Calculations",
        "authors": "Sergey Sokolov, Vladimir Sudakov",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012418200003636"
    },
    {
        "id": 30792,
        "title": "Model-free sliding mode prescribed performance control of robotic manipulator based on new reaching law",
        "authors": "Fuwei Deng, Quanwei Wen, Li Yang",
        "published": "2023-7-1",
        "citations": 1,
        "abstract": " The article proposes a model-free sliding mode prescribed performance control method for robotic manipulator. For accelerating the errors converging rate as well as bringing down the real-time control torque, an error-driven nonsingular fast terminal sliding mode is employed in this control method. Besides, a modified power reaching law is newly designed, which is able to offer better chattering elimination performance than traditional power reaching law. To solve the problem that the controller’s performance highly relies on the accuracy of robotic model, a model-free control idea is introduced where an ultra-local model is established and the estimation of time delay is used to approximate the unknown part of the ultra-local model. Considering the transient performance is a significant element that effects the using security and system stability, the technique of prescribed performance control is introduced to limit the state errors in a prescribed region. The closed-loop stability proof of the whole system is achieved according to Lyapunov’s stability theorem. The proposed controller’s superiority and feasibility compared with other controllers are demonstrated by numerical simulations. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231191002"
    },
    {
        "id": 30793,
        "title": "Neural Network-Based Low-Frequency Perception Enhancement Used in Biomedical Hearing Applications",
        "authors": "Tsung-Han Tsai, Xuan-Yu Chou, Shang-Chia Liao, Kenneth Luk",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/biocas58349.2023.10388524"
    },
    {
        "id": 30794,
        "title": "Sarcomere‐Inspired Multilayer Artificial Muscle Units for Hyperconfigurable Robotic Applications",
        "authors": "Jonathan William Ambrose, Gavril Yong En Tan, Nicholas Zhang Rong Chiang, Dylan Sin You Cheah, Quan Xiong, Chen-Hua Yeow",
        "published": "2023-12",
        "citations": 0,
        "abstract": "Soft pneumatic biomimetic robotic systems excel at the specific application they are designed for, often to interact or navigate unstructured environments safely. However, redeployment to new purposes requires substantial resources, from redesign to revalidation. Despite most pneumatic artificial muscles surpassing the power and contraction performance of natural muscles, natural muscles largely remain unmatched in terms of their versatility and complex performance. This is likely due to artificial muscle's low effective strain and high radial expansion, limiting parallel operating efficiencies. To address these challenges, a class of compact versatile pneumatic actuators, called multilayer artificial muscle (MAM), that are capable of deployment to different applications through configurable modularity, is presented. The MAMs are biomimetically inspired by the sarcomere, the building block for natural muscle architecture. Similarly, MAM can extend and contract as well as be rearranged to mimic muscle‐like actions and functions, such as a caterpillar locomotion robot and an entire robotic arm. The MAMs are fabricated through multilayer, multimaterial, low‐cost additive manufacturing, which offers certain advantages such as higher extension, contraction force, and durability. MAMs have the potential to provide a crucial fundamental building block toward future versatile reconfigurable architecture.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/aisy.202300410"
    },
    {
        "id": 30795,
        "title": "The perception systems used in fully automated vehicles: a comparative analysis",
        "authors": "Kritika Rana, Gaurav Gupta, Pankaj Vaidya, Manju Khari",
        "published": "2023-4-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15090-w"
    },
    {
        "id": 30796,
        "title": "Demo: Attention and Mobility-Aware On-Device Perception for Mobile Augmented Reality",
        "authors": "Mayooran Thavendra, Kasthuri Jayarajah",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3638550.3643634"
    },
    {
        "id": 30797,
        "title": "Proceedings",
        "authors": "",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156735"
    },
    {
        "id": 30798,
        "title": "Online Motion Analyzer (OMA): A Software Service for Runtime Verification of Robotic Systems' Safety",
        "authors": "Serhat Kahraman, Mert Bulut, Elif Deirmenci, Yunus Sabri Kirca, Metin Ozkan, Ahmet Yazici",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223793"
    },
    {
        "id": 30799,
        "title": "RoboMind: Supporting Older Adults Through Robotic Web Applications",
        "authors": "Omid Veisi, Maryam Akbarinigjeh, Saeed Motaee, Claudia Müller, Rainer Wieching, Volker Wulf",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/irc59093.2023.00065"
    },
    {
        "id": 30800,
        "title": "Software Synthesis From High-level Specification for Swarm Robotic Applications",
        "authors": "Woosuk Kang, EunJin Jeong, Kyonghwan Yoon, Soonhoi Ha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/les.2023.3339159"
    },
    {
        "id": 30801,
        "title": "Neural ordinary differential gray algorithm to forecasting models of controlled systems",
        "authors": "ZY Chen, YH Meng, Rong Jiang, Ruei-Yuan Wang, Timothy Chen",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": " Due to the feasibility of the gray model for predicting time series with small samples, the gray theory is well investigated since it is presented and is currently evolved in an important manner for forecasting small samples. This study proposes a new gray prediction criterion based on the neural ordinary differential equation, which is named the neural ordinary differential gray mode. This neural ordinary differential gray mode permits the forecasting model to be learned by a training process which contains a new whitening equation. It is needed to prepare the structure and time series, compared with other models, according to the regularity of actual specimens in advance, therefore this model of neural ordinary differential gray mode can provide comprehensive applications as well as learning the properties of distinct data specimens. To acquire a better model which has highly predictive efficiency, afterward, this study trains the model by neural ordinary differential gray mode using the Runge–Kutta method to obtain the prediction sequence and solve the model. The controller establishes an advantageous theoretical foundation in adapting to novel wheels and comprehensively spreads the utilize extent of mechanical elastic vehicle wheel. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231171244"
    },
    {
        "id": 30802,
        "title": "RU-FEMOIN—A database of facial expressions: Utilization for robotic mood transition of patient robots",
        "authors": "Miran Lee, Joo-Ho Lee, Minjeong Lee",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120907"
    },
    {
        "id": 30803,
        "title": "Data-driven robotic visual grasping detection for unknown objects: A problem-oriented review",
        "authors": "Hongkun Tian, Kechen Song, Song Li, Shuai Ma, Jing Xu, Yunhui Yan",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118624"
    },
    {
        "id": 30804,
        "title": "Driving Perception in Challenging Road Scenarios: An Empirical Study",
        "authors": "Mourad A. Kenk, Mona Elsaidy, M. Hassaballah, Mahmoud B. A. Mansour",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiccsa59173.2023.10479343"
    },
    {
        "id": 30805,
        "title": "Guest Editorial to the Special Section on Composite Adaptive and Learning Control With Robotic Applications",
        "authors": "Yongping Pan, Simone Baldi, Chenguang Yang, Radu-Emil Precup",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcsys.2024.3367048"
    },
    {
        "id": 30806,
        "title": "A Versatile Reconfigurable Mechanisms Framework for Applications in Architecture",
        "authors": "Eftychios G. Christoforou, Marios C. Phocas, Andreas Müller, Loukas Georgiou",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01841-2"
    },
    {
        "id": 30807,
        "title": "Multiagent robotic systems and exploration algorithms: Applications for data collection in construction sites",
        "authors": "Samuel A. Prieto, Nikolaos Giakoumidis, Borja García de Soto",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "AbstractThe construction industry has been notoriously slow to adopt new technology and embrace automation. This has resulted in lower efficiency and productivity compared to other industries where automation has been widely adopted. However, recent advancements in robotics and artificial intelligence offer a potential solution to this problem. In this study, a methodology is proposed to integrate multirobotic systems in construction projects with the aim of increasing efficiency and productivity. The proposed approach involves the use of multiple robot and human agents (HA) working collaboratively to complete a construction task. The methodology was tested through a case study that involved 3D digitization of a small, occluded space using two robots and one HA. The results show that integrating multiagent robotic systems (MARS) in construction can effectively overcome challenges and complete tasks efficiently. The implications of this study suggest that MARS could revolutionize the industry.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/rob.22316"
    },
    {
        "id": 30808,
        "title": "Copyright Notice",
        "authors": "",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156703"
    },
    {
        "id": 30809,
        "title": "The visual-based robotic language for industry 4.0 applications: Robotic U Language",
        "authors": "Ufuk Sakarya",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11760-023-02713-w"
    },
    {
        "id": 30810,
        "title": "Author Index",
        "authors": "",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156760"
    },
    {
        "id": 30811,
        "title": "A suggestion method for urban perception improvement using street-view images",
        "authors": "Jinhao Sun, Yi Zhang, Xi Yang",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2683558"
    },
    {
        "id": 30812,
        "title": "A Dual-Band High Efficiency Fractal Rectenna for RF Energy Harvesting Systems",
        "authors": "Tamam Sameer AbdulAzeez Al-Rawe, Taha A. Elwi, Ögr. Üyesi Didem Kivanç Türeli",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156661"
    },
    {
        "id": 30813,
        "title": "Modeling variability in self-adapting robotic systems",
        "authors": "Davide Brugali",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104470"
    },
    {
        "id": 30814,
        "title": "Comprehensive research and analysis on obstacle–singularity–joint limit avoidance of redundant robot",
        "authors": "Yu Li, Liang Wang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": " Redundant robots can complete other tasks while performing main task and have excellent motion performance. Although redundant robots have redundancy characteristics, they may still fall into singular configuration or cannot overcome joint limits due to the limitation of their own structure and motion law. Besides, currently, most of the research mainly focus on obstacle avoidance at the end of the robot. So comprehensive study is conducted on avoidance of obstacle, singularity, and joint limit of redundant robot. Firstly, the kinematics model of robot is obtained by D-H matrix method. Space vector distance method is proposed to calculate the position relationship between robot and obstacle, and potential function is constructed. Based on gradient projection method, using the damped generalized inverse and the weighted norm method, the mathematical models of obstacle avoidance, singularity avoidance, and joint limit avoidance are constructed. The simulation results show that the robot can avoid the obstacle in three-dimensional redundant space. At the same time, manipulability and minimum singular value of the robot are always positive. After adding the function of avoiding joint limit, during the whole control process, the motion range of joint angle is reduced and the angular velocity is relatively small, which ensure the motion stability of robot. Namely, the singular configuration and joint limit of robot are avoided. The research is of great significance for practical application of redundant robot. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241233910"
    },
    {
        "id": 30815,
        "title": "Modelling and Stability Analysis of 100kW Modular Dual Active Bridge Converter for Robotic Arm-based Charging Systems",
        "authors": "Ramy Kotb, Haaris Rasool, Sajib Chakraborty, Omar Hegazy",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/epe23ecceeurope58414.2023.10264303"
    },
    {
        "id": 30816,
        "title": "Supplementation of synthetic object replicas for increasing precision of microrobot trajectory keypoints",
        "authors": "Modris Laizans, Janis Arents, Oskars Vismanis, Vytautas Bučinskas, Andrius Dzedzickis, Modris Greitans",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Artificial neural networks are becoming more popular with the development of artificial intelligence. These networks require large amounts of data to function effectively, especially in the field of computer vision. The quality of an object detector is primarily determined by its architecture, but the quality of the data it uses is also important. In this study, we explore the use of novel data set enhancement technique to improve the performance of the YOLOv5 object detector. Overall, we investigate three methods: first, a novel approach using synthetic object replicas to augment the existing real data set without changing the size of the data set; second - rotation augmentation data set propagating technique and their symbiosis, third, only one required class is supplemented. The solution proposed in this article improves the data set with a help of supplementation and augmentation. Lower the influence of the imbalanced data sets by data supplementation with synthetic yeast cell replicas. We also determine the average supplementation values for the data set to determine how many percent of the data set is most effective for the supplementation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23128"
    },
    {
        "id": 30817,
        "title": "Reward Planning for Underactuated Robotic Systems: A Study on Pendubot with Parameters Uncertainty",
        "authors": "Sinan Ibrahim, Ramil Khusainov, Ali Jnadi, S. M. Ahsan Kazmi",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dcna59899.2023.10290178"
    },
    {
        "id": 30818,
        "title": "Robot service failure and recovery: Literature review and future directions",
        "authors": "Dewen Liu, Changfei Li, Jieqiong Zhang, Weidong Huang",
        "published": "2023-7-1",
        "citations": 1,
        "abstract": " Robot service failure and subsequent user behavioral responses have emerged as a prominent scientific issue, warranting attention from multiple disciplines. A review of existing literature is crucial to synthesizing and comprehensively evaluating these studies. To this end, the present study undertook a structured systematic literature review to assess the relevant research on the concepts, dimensions, user response (including cognitional and behavioral), and recovery strategies related to service robot failure. Prior studies have largely followed interpersonal service interaction concepts and have identified several major consequences of service robot failure, including emotional and cognitive responses, negative attitudes, attributions of failure, and related behavioral and action-based responses. Notably, recovery strategies for robot service failure can be categorized into two main types: robot-initiated strategy and human intervention strategy. Further research on robot service failure is recommended in five key areas, including exploring the uniqueness of robot service failure, psychologically investigating user responses to robot failure, identifying novel remedy strategies for robot service failures, evolving the concepts of robot service failure and its remedies, and employing mixed-method and complementary research approaches. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231191606"
    },
    {
        "id": 30819,
        "title": "Curve Fitting-Based Deformation Tracking for Vision-Based Robotic Applications",
        "authors": "Abhaya Pal Singh, Dmytro Romanov, Ekrem Misimi, Alex Mason",
        "published": "2024",
        "citations": 0,
        "abstract": "Application of robotics on production lines often involves handling flexible objects (such as items of natural origin or plastic bags containing liquid/bulk substances), which makes it crucial to consider the shape of an item before and after it has been affected by robotic manipulation. Most of the time deformable items are challenging for the robot in such operations as grasping, cutting, or packaging. The objective of this paper is to track object deformations and perform a task based on this information. The paper addresses issues in tracking object deformation and proposes a solution for deformation tracking to form preliminary knowledge and scene awareness on the robot side. A curve-fitting-based method was implemented to define a region of interest using images from a RealSense D415 camera. The developed approach identifies the maximum number of aligned points and uses it to determine where the deformation occurred. The results of this research show that the deformations are efficiently tracked. Utilising the algorithm proposed in this paper, an efficient method capable of making the robot aware of the deformation present in the scene is demonstrated. This approach is applicable in domains such as food processing, healthcare, and other fields where gentle and precise manipulations are required. The method is useful in industrial applications in which deformation cannot be completely avoided but still needs to be tracked.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijmerr.13.2.190-195"
    },
    {
        "id": 30820,
        "title": "Fish peduncle response during forward and backward propulsion",
        "authors": "Md. Mahbub Alam",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": " Fish is the master of fluid control, with high propulsive efficiency and great maneuverability. Carps are chosen for observations since they are the typical carangiform fish. We add some external stimuli on the fish and observe their responses. It is found that a fish attempts to escape backward or forward depending on the stimuli. The fish tries a greater number of its tail oscillations in a forward escape than in a backward escape. In the case of a forward escape, the retract stroke where the tail gets a concave shape (suitable for higher thrust generation) is faster than the forward stroke where the tail takes a convex shape (suitable for smaller drag), while vice versa in the case of a backward escape. Becoming concave or convex shapes of the tail and being faster or slower strokes all correspond to enhancing fluid momentum in the forward or backward directions where appropriate. The traveling wave of the body propagates backward and forward for the forward and backward escapes, respectively. The results provide a reference for bionic fish design and simulation. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231151792"
    },
    {
        "id": 30821,
        "title": "Expanded photo-model-based stereo vision pose estimation using a shooting distance unknown photo",
        "authors": "Hongzhi Tian, Jirong Wang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": " Model-based stereo vision pose estimation depends on the establishment of the model. The photo-model-based method simplifies the model-building process with just one photo. Programming languages do not predefine the shapes, colors, and patterns of objects. In the past, however, it was necessary to calculate a pixel per metric ratio, that is, the number of pixels per millimeter of the object, based on the photo’s shooting distance to generate a photo-model with the same size (length and width) as the actual object. It restricts the real application. The proposed method extends the traditional photo-modeling algorithm and relaxes the photo prerequisite for target pose determination. Various pixel per metric ratios will be assumed to generate 3D photo-models of different sizes. These models will then be employed in stereo vision image matching techniques to detect the pose of the target object. Since it is not a data-driven method, it does not require many pictures and pretraining time. This article applies the algorithm to the cleaning of seaports and aquaculture, aiming to locate dead or diseased marine life on the water surface before collection. Pose estimation experiments have been conducted to detect an object’s pose and a prepared photo’s pixel per metric ratio in real application scenarios. The results show that the expanded photo-model stereo vision method can estimate the pose of a target with one pixel per metric ratio unknown photo. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231218789"
    },
    {
        "id": 30822,
        "title": "A planning method for chemical plume tracking and source localization with autonomous underwater vehicle",
        "authors": "Haifeng Jiu, Wei Deng",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " Underwater target detection technology is an important mean for the development and utilization of marine environment, which has important value in commercial and military fields, and is valued by more and more experts, scholars, and production technicians. A set of behavior-based autonomous underwater vehicle online task planning algorithm is proposed in this article, including the searching behavior based on changing Z-shape, tracking behavior based on an improved artificial potential field theory with likelihood map, rediscovering behavior, and source declare behavior. The proposed algorithm can improve the accuracy and success rate of autonomous underwater vehicle to the source positionficient. The physical experiment results verify the effectiveness of the proposed method. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241233909"
    },
    {
        "id": 30823,
        "title": "Multiple chromosomes particle swarm optimization-based coverage path planning for complex surfaces spray painting",
        "authors": "Hui Gao, Xin Ma",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " Coverage path planning for complex three-dimensional surfaces spray painting is one of the challenging problems in robotics. In this article, we propose a multiple chromosomes particle swarm optimization approach to address the coverage path planning problem for complex three-dimensional surfaces spray painting. Firstly, a layered segmentation method, which is composed of three-dimensional hole identification and region partition, is proposed to divide the complex surface into multiple simple regions with little curvature change and no holes. Secondly, a zigzag path is determined in each region by considering the practical aspects for spray painting. Thirdly, by taking short distance, few turns and high coverage rate into account, a multiple chromosomes particle swarm optimization algorithm is presented to connect the zigzag paths of the regions. Experimental tests are carried out on a complex surface, and the results validate the effectiveness of the proposed approach. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241238980"
    },
    {
        "id": 30824,
        "title": "Table of Contents",
        "authors": "",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156754"
    },
    {
        "id": 30825,
        "title": "Feature extraction and matching combined with depth information in visual simultaneous localization and mapping",
        "authors": "Yunpeng Sun, Xiaoli Li",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": " Estimating the camera trajectories is very important for the performance of visual simultaneous localization and mapping. However, visual simultaneous localization and mapping systems based on RGB image are generally not robust in complex situations such as low-textures or large illumination variations. In order to solve this problem, more environmental information is added by introducing depth information, and a feature extraction and matching algorithm combining depth information is proposed. In this article, firstly, the intrinsic mechanism that depth image is used to extract and match feature points is discussed. Then depth information and appearance information are comprehensively considered to extract and describe feature points. Finally, the matching problem of feature points is transformed into a regression and classification problem, with which a matching model is presented in a data-driven way. Experimental results show that our algorithm has better distribution uniformity and matching accuracy and can effectively improve the trajectory accuracy and drift degree of the simultaneous localization and mapping system. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231158298"
    },
    {
        "id": 30826,
        "title": "An Anomaly Behavior Analysis Framework for Securing Autonomous Vehicle Perception",
        "authors": "Murad Mehrab Abrar, Salim Hariri",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiccsa59173.2023.10479322"
    },
    {
        "id": 30827,
        "title": "A Design Flow based on Docker and Kubernetes for ROS-based Robotic Software Applications",
        "authors": "Francesco Lumpp, Marco Panato, Nicola Bombieri, Franco Fummi",
        "published": "2023-4-25",
        "citations": 1,
        "abstract": "Human-centered robotic applications are becoming pervasive in the context of robotics and smart manufacturing and such a pervasiveness is even more expected with the shift to Industry 5.0. The always increasing level of autonomy of modern robotic platforms requires the integration of software applications from different domains to implement artificial intelligence, cognition, and human-robot/robot-robot interaction. Developing and (re)configuring such a multi-domain software to meet functional constraints is a challenging task. Even more challenging is customizing the software to satisfy non-functional requirements such as real-time, reliability, and energy efficiency. In this context, the concept of Edge-Cloud continuum is gaining consensus as a solution to address functional and non-functional constraints in a seamless way. Containerization and orchestration are becoming a standard practice as they allow for better information flow among different network levels as well as increased modularity in the use of multi-domain software components. Nevertheless, the adoption of such a practice along the design flow, from simulation to the deployment of complex robotic applications by addressing the de-facto development standards (e.g., ROS - Robotic Operating System) is still an open problem. We present a design methodology based on Docker and Kubernetes that enables containerization and orchestration of ROS-based robotic SW applications for heterogeneous and hierarchical HW architectures. The methodology aims at (i) integrating and verifying multi-domain components since early in the design flow, (ii) mapping software tasks to containers to minimize the performance and memory footprint overhead, (iii) clustering containers to efficiently distribute load across the edge-cloud architecture by minimizing resource utilization, and (iv) enabling multi-domain verification of functional and non-functional constraints before deployment. The article presents the results obtained with a real case of study, in which the design methodology has been applied to program the mission of a Robotnik RB-Kairos mobile robot in an industrial agile production chain. We have obtained reduced load on the robot’s HW with minimal performance and network overhead thanks to the optimized distributed system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3594539"
    },
    {
        "id": 30828,
        "title": "Unknown Input Nonlinear Observer for a Soft Pneumatic Robotic Gripper Application",
        "authors": "Patchara Pitchayawetwongsa, Nattaphat Boonchumanee, Saravut Lin, Ratchathin Chancharoen",
        "published": "2023-6-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156668"
    },
    {
        "id": 30829,
        "title": "Area reconnaissance modeling of modular reconnaissance robotic systems",
        "authors": "Jan Nohel, Petr Stodola, Jan Zezula, Pavel Zahradníček, Zdeněk Flasar",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": " In terms of deploying forces and assets in different domains, the conduct of contemporary military operations can be characterized as complex. Information obtained from a wide range of sources and sensors is thus a crucial factor influencing the course and outcome of an operation. It must be robust, variably deployable, sustainable long-term, modular, and flexible when performing reconnaissance tasks in the rear of enemy forces or in areas threatened by, for example, chemical, biological, radiological, and/or nuclear (CBRN) threats. This paper describes the requirements of commanders for the capabilities of autonomous modular robotic systems performing reconnaissance tasks to support their units. It characterizes the possibilities of using mathematical-algorithmic models in planning the operation of robotic systems. The computational capabilities of tactical decision support system models are demonstrated on two scenarios for the reconnaissance of an area of interest. The partial calculations of the different parts of the reconnaissance task are performed in a logical sequence. Field tests practically verified the variants of performing reconnaissance tasks by robotic systems. The use of digital terrain and relief models, mathematical-algorithmic models, and variant modeling has increased the efficiency of the planning and deployment of a group of robotic systems in the reconnaissance of an area of interest. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/15485129231210302"
    },
    {
        "id": 30830,
        "title": "PourIt!: Weakly-supervised Liquid Perception from a Single Image for Visual Closed-Loop Robotic Pouring",
        "authors": "Haitao Lin, Yanwei Fu, Xiangyang Xue",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00029"
    },
    {
        "id": 30831,
        "title": "Robotic Perception-Motion Synergy for Novel Rope Wrapping Tasks",
        "authors": "Zhaoyuan Ma, Jing Xiao",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lra.2023.3280808"
    },
    {
        "id": 30832,
        "title": "Antipodal-points-aware dual-decoding network for robotic visual grasp detection oriented to multi-object clutter scenes",
        "authors": "Hongkun Tian, Kechen Song, Jing Xu, Shuai Ma, Yunhui Yan",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120545"
    },
    {
        "id": 30833,
        "title": "Robotic tactile object perception based on adaptive multikernel sparse representation",
        "authors": "XiaoBao TONG, PengWen XIONG, ZhiYuan CHEN, AiGuo SONG, Peter X. LIU",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1360/sst-2022-0242"
    },
    {
        "id": 30834,
        "title": "Comparative analysis of radiation exposure in robot-assisted total knee arthroplasty using popular robotic systems",
        "authors": "Ahmed Saad, Alistair Mayne, Joseph Pagkalos, Matthieu Ollivier, Rajesh Botchu, Edward Davis, Akash Sharma",
        "published": "2024-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-024-01896-9"
    },
    {
        "id": 30835,
        "title": "Design, simulation, and experiment for the end effector of a spherical fruit picking robot",
        "authors": "Ziyue Li, Xianju Yuan, Zhanpeng Yang",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": " The end effector characterizing a flipping–cutting way is designed firstly for picking spherical fruits with a good universality, which is mainly composed of three parts such as a clamping mechanism, a flipping mechanism, and a cutting mechanism. Subsequently, the kinematics simulation for the clamping mechanism, flipping mechanism, and cutting mechanism will be implemented by mathematical models and the ADAMS software, and results reflected through them are consistent with each other, thus presenting the feasibility of the structural scheme and two models. On the basis of scheme and results of models, the sample of the end effector is manufactured. Finally, picking experiments in a lab will be also conducted in view of diverse indexes, such as the successful grabbing action, flipping–cutting action, flipping–breaking action, average fruit picking time, success rate, and damage rate. It is drawn from experimental results that the success rate of grabbing is 100%, and a success rate for picking is over 80%. An average picking time is about 9.6s, and very few fruits are damaged. Therefore, such a scheme is feasible, further presenting a good reference for designing the entire robot in a field of picking diverse spherical fruits. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231213442"
    },
    {
        "id": 30836,
        "title": "A heuristic autonomous exploration method based on environmental information gain during quadrotor flight",
        "authors": "Tong Zhang, Jiajie Yu, Jiaqi Li, Minghui Pang",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " Autonomous exploration is a widely studied fundamental application in the field of quadrotor, which requires them to automatically explore unknown space to obtain complete information about the environment. The frontier-based method, one of the representative works on autonomous exploration, drives autonomous determination by the definition of frontier information so that complete information about the environment is available to the quadrotor. However, existing frontier-based methods are able to accomplish the task but still suffer from inefficient exploration, and how to improve the efficiency of autonomous exploration is the focus of research nowadays. Slow frontier generation affecting real-time viewpoint determination and insufficient determination methods affecting the quality of viewpoints are typical of these problems. Therefore, to overcome the aforementioned problems, this article proposes a two-level viewpoint determination method for frontier-based autonomous exploration. First, a sampling-based frontier detection method is presented for faster frontier generation, improving the immediacy of environmental representation compared to traditional traversal-based methods. Second, the access to environmental information during flight is considered for the first time, and an innovative heuristic evaluation function is designed to decide on high-quality viewpoint as the next local navigation target in each exploration iteration. Extensive benchmark and real-world tests are conducted to validate our method. The results confirm that our method optimizes the frontier search time by 85%, the exploration time by around 20%–30%, and the exploration path by 25%–35%. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241235517"
    },
    {
        "id": 30837,
        "title": "Manipulate mechanism design and synchronous motion application for driving simulator",
        "authors": "Shuangji Yao, Zhilong Wang, Marco Ceccarelli, Haojie Yang, Ding Xuan Zhao",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": " The manipulate load system of a helicopter driving simulator is a complex mechatronic system. To simulate the load system of the joystick more effectively, this study provides a new manipulate mechanism with automatic position reset function that integrates a spring system within the joystick. The load simulation of this manipulate mechanism can be achieved by designing the nonlinear coefficient of the spring in a reasonable manner, thereby eliminating the need for complex control of motor simulation and system time delay. This greatly simplifies the complexity of the system and effectively meets the requirements of real-time and accuracy. Initially, the new manipulate mechanism is described in detail through kinematic analysis. Then, dynamic simulation is conducted in ADAMS software to simulate the motion of the operation mechanism. Considering the active–passive relationships between the manipulate mechanism and the driving simulator, a mapping is established to achieve synchronized motion. The synchronized motion is subsequently evaluated and verified in MATLAB/Simulink. The results reveal that this new manipulate mechanism has high reliability and can effectively achieve synchronized motion with the driving simulator. The new manipulate mechanism will be useful in advancing research into the design of manipulate mechanism processes. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231216798"
    },
    {
        "id": 30838,
        "title": "Solving large-scale multi-agent tasks via transfer learning with dynamic state representation",
        "authors": "Lintao Dou, Zhen Jia, Jian Huang",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": " Many research results have emerged in the past decade regarding multi-agent reinforcement learning. These include the successful application of asynchronous advantage actor-critic, double deep Q-network and other algorithms in multi-agent environments, and the more representative multi-agent training method based on the classical centralized training distributed execution algorithm QMIX. However, in a large-scale multi-agent environment, training becomes a major challenge due to the exponential growth of the state-action space. In this article, we design a training scheme from small-scale multi-agent training to large-scale multi-agent training. We use the transfer learning method to enable the training of large-scale agents to use the knowledge accumulated by training small-scale agents. We achieve policy transfer between tasks with different numbers of agents by designing a new dynamic state representation network, which uses a self-attention mechanism to capture and represent the local observations of agents. The dynamic state representation network makes it possible to expand the policy model from a few agents (4 agents, 10 agents) task to large-scale agents (16 agents, 50 agents) task. Furthermore, we conducted experiments in the famous real-time strategy game Starcraft II and the multi-agent research platform MAgent. And also set unmanned aerial vehicles trajectory planning simulations. Experimental results show that our approach not only reduces the time consumption of a large number of agent training tasks but also improves the final training performance. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231162440"
    },
    {
        "id": 30839,
        "title": "A hybrid thrusting system for increasing the endurance time of multirotor unmanned aerial vehicles",
        "authors": "Jawad Bdour, Belal H Sababha",
        "published": "2023-5-1",
        "citations": 1,
        "abstract": "One of the most significant disadvantages of electric multirotor unmanned aerial vehicles is their short flight time compared to fuel-powered unmanned aerial vehicles. This is mainly due to the low energy density of electric batteries. Fuel has much more energy density when compared to batteries. Electric-powered motors in multirotor unmanned aerial vehicles cannot be replaced with fuel-based engines because the stability and control of multirotor unmanned aerial vehicles rely on the high response rates of electric motors. One of the possible solutions to overcome this problem of short endurance times is by using hybrid thrusting systems that combine the advantages of both fuel and electrical propulsion systems, where high maneuverability and long endurance flight time could be achieved. In this work, hybrid thrusting and power systems for multirotor unmanned aerial vehicles are studied. Targeted hybrid thrusting systems consist of combustion engines, electric motors, and their power sources. Then a hybrid thrusting system-based quadrotor unmanned aerial vehicle model is developed. The article presents the altitude and attitude control systems of the developed hybrid thrusting system-based unmanned aerial vehicle. The presented hybrid quadcopter model comprises four electric motors and one fuel engine. The fuel engine used in this work is a 4.07 cc internal combustion engine targeting 2–3 kg unmanned aerial vehicles with up to 5 kg maximum takeoff weight. The developed hybrid quadrotor unmanned aerial vehicle achieved a 139% improvement in flight time when compared with traditional electric-based quadrotor unmanned aerial vehicles. The article also reports on other flight time-related issues such as the optimal fuel mass to battery size ratio to maximize the endurance time of the quadrotor unmanned aerial vehicles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231172335"
    },
    {
        "id": 30840,
        "title": "Enhanced lightweight deep network for efficient livestock detection in grazing areas",
        "authors": "Xiaoxu Du, Yongsheng Qi, Junfeng Zhu, Yongting Li, Liqiang Liu",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": " There are problems in the special pastoral environment, including large changes in target size and serious interference from light and environmental factors. To solve the above problems, an enhanced YOLOv4-tiny target detection network is proposed in this study. This network first solves the problem of livestock size fluctuation in pastoral areas, uses a pyramid network with multiscale feature fusion, and considers shallow local detail features and deep semantic information. Subsequently, a novel compound multichannel attention mechanism is proposed to increase the accuracy of the target detection network for the pastoral environment. The problem of poor accuracy of target detection network is solved. The algorithm is ported to Jetson AGX embedded platform for validation to examine the real-time performance of the algorithm. As revealed by the experimental results, enhanced YOLOv4-tiny achieves 89.77% detection accuracy and 30 frames/second detection speed, which increases the average detection accuracy by 11.67% compared with the conventional YOLOv4-tiny while maintaining almost the same detection rate. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231218865"
    },
    {
        "id": 30841,
        "title": "Research on configuration design and intelligent compliance control of reconfigurable modular flexible upper limb rehabilitation robot",
        "authors": "Kunming Zheng, Qiuju Zhang",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": " The upper limb exoskeleton rehabilitation robot can realize the partial functional compensation of upper limb and complete the various types of rehabilitation training for each joint of upper limb. However, the existing upper limb exoskeleton rehabilitation robots are lack of flexible reconfigurability, which are difficult to meet the diversified patient objects and rehabilitation needs, and have some problems, such as insufficient motion compliance, poor portability, and wearing comfort. To effectively solve the above problems and improve the effect of upper limb rehabilitation training, this project plans to carry out the following research: Firstly, analyze the structural characteristic and movement mechanism of upper limb, clarify the configuration theory of the modular flexible upper limb exoskeleton rehabilitation robot with reconfigurable, and design and optimize the mechanism form and structural parameters of the reconfigurable modular flexible upper limb exoskeleton rehabilitation robot. Secondly, based on the perspective of rigid–flexible coupling integration of bone–muscle–robot, the integrated equivalent mechanism model is constructed and the integrated dynamics model is established to plan compliance motion and develop intelligent compliance control strategy. Finally, the simulation experimental platform is built for simulation experimental demonstration of upper limb rehabilitation training. The implementation of this study will provide new idea and method for realizing the effect of flexible, compliance, light, and comfortable of upper limb rehabilitation training. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231175600"
    },
    {
        "id": 30842,
        "title": "Smart perception for situation awareness in robotic manipulation tasks",
        "authors": "Oriol Ruiz-Celada, Albert Dalmases, Isiah Zaplana, Jan Rosell",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3389091"
    },
    {
        "id": 30843,
        "title": "Operative efficiency: a comparative analysis of Versius and da Vinci robotic systems in abdominal surgery",
        "authors": "Mouhammad Halabi, Kayanne Khoury, Abdulrahman Alomar, Joseph El Dahdah, Obai Hassan, Khadija Hayyan, Engy Bishara, Hatem Moussa",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "AbstractRobotic-assisted surgery has gained momentum in the pursuit of improved minimally invasive procedures. The adoption of new robotic platforms, such as the Versius, raises concerns about safety, efficacy, and learning curves. This study compares the Versius to the well-established da Vinci in terms of operative time and patient population. Retrospective data collection was conducted on patient data from inguinal hernia surgery, ventral hernia surgery, and cholecystectomies performed between February 2022 and March 2023 at the American Hospital of Dubai. Only experienced cases were included, ensuring proficiency with robotic technology. Versius had longer procedure times in inguinal and ventral hernia surgeries but not in cholecystectomy. No intraoperative complications were observed in either system. This study demonstrates that Versius can provide comparable outcomes to the da Vinci in abdominal surgery, with no observed intraoperative complications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-023-01806-5"
    },
    {
        "id": 30844,
        "title": "Motion-Tracking Control of Mobile Manipulation Robotic Systems Using Artificial Neural Networks for Manufacturing Applications",
        "authors": "Daniel Galvan-Perez, Francisco Beltran-Carbajal, Ivan Rivas-Cambero, Hugo Yañez-Badillo, Antonio Favela-Contreras, Ruben Tapia-Olvera",
        "published": "2023-8-12",
        "citations": 1,
        "abstract": "Robotic systems have experienced exponential growth in their utilization for manufacturing applications over recent decades. Control systems responsible for executing desired robot motion planning face increasingly stringent performance requirements. These demands encompass high precision, efficiency, stability, robustness, ease of use, and simplicity of the user interface. Furthermore, diverse modern manufacturing applications primarily employ robotic systems within disturbed operating scenarios. This paper presents a novel neural motion-tracking control scheme for mobile manipulation robotic systems. Dynamic position output error feedback and B–Spline artificial neural networks are integrated in the design process of the introduced adaptive robust control strategy to perform efficient and robust tracking of motion-planning trajectories in robotic systems. Integration of artificial neural networks demonstrates performance improvements in the control scheme while effectively addressing common issues encountered in manufacturing environments. Parametric uncertainty, unmodeled dynamics, and unknown disturbance torque terms represent some adverse influences to be compensated for by the robust control scheme. Several case studies prove the robustness of the adaptive neural control scheme in highly coupled nonlinear six-degree-of-freedom mobile manipulation robotic systems. Case studies provide valuable insights and validate the efficacy of the proposed adaptive multivariable control scheme in manufacturing applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11163489"
    },
    {
        "id": 30845,
        "title": "Cast Silicone Robotic Gripper in Underwater Applications",
        "authors": "Wen Liu, Minchul Shin",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Abstract\nThe robotic gripper is widely used in manufacturing and other areas in modern society. Robotic grippers have the advantage of providing precise control and a wide range of torque output and size for different applications. Power sources of robotic gripers are variable like pneumatic, hydraulic, electric, or mechanical systems. Pneumatics gripper is one of the most common and popular types; Pneumatics robotic grippers have advantages of providing wide range of power output, low cost, easy to maintain, and more. At the same time, the pneumatic gripper is more flexible for different sizes. The small pneumatic gripper will still be able to provide strong gripping force and precise control.\nRobotic grippers come more in a solid form that is construed by metal or other solid material. The soft robotic gripper is another form of robotic gripper that has the advantages of adapting to irregular shapes, able to withstand blunt force trauma, and able to grip fragile objects. Silicone rubber pneumatic soft robotic gripper combined advantages of pneumatic system and soft robotic to provide a precise control, strong gripping force, adapting to irregular shape, and more.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/imece2023-113331"
    },
    {
        "id": 30846,
        "title": "Feedback hybrid force and position control of an upper limb exoskeleton to support human movement",
        "authors": "Thang Cao Nguyen, Anh Dong Nguyen, Manukid Parnichkun, My Thi Tra Phan",
        "published": "2023-12-31",
        "citations": 1,
        "abstract": "In the paper, a feedback hybrid control including a force feedback control and a position control is proposed to control a four degree of freedom (4-dof) upper limb exoskeleton for supporting human movement at the shoulder, elbow and wrist joints. The novelty of the paper is that it has been able to control all the interaction forces at all links in the exoskeleton robot by using the proposed control. The desired interaction forces at the links and desired position are compared with the measured interaction forces and position, respectively. Then the torque at the shoulder, the torque elbow and the torque wrist joints are controlled to compensate the force error and the position error. The gains of the proposed controller are optimized by using the Balancing Composite Motion Optimization (BCMO). The simulation and control of the 4-dof upper limb exoskeleton using the proposed control is carried out in the paper to show that the interaction forces and the position of the exoskeleton track their desired values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/rsa.2023.23623"
    },
    {
        "id": 30847,
        "title": "Trading-Off Safety with Agility Using Deep Pose Error Estimation and Reinforcement Learning for Perception-Driven UAV Motion Planning",
        "authors": "Mehmetcan Kaymaz, Recep Ayzit, Onur Akgün, Kamil Canberk Atik, Mustafa Erdem, Baris Yalcin, Gürkan Cetin, Nazım Kemal Ure",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "AbstractNavigation and planning for unmanned aerial vehicles (UAVs) based on visual-inertial sensors has been a popular research area in recent years. However, most visual sensors are prone to high error rates when exposed to disturbances such as excessive brightness and blur, which can lead to catastrophic performance drops in perception and motion planning systems. This study proposes a novel framework to address the coupled perception-planning problem in high-risk environments. This achieved by developing algorithms that can automatically adjust the agility of the UAV maneuvers based on the predicted error rate of the pose estimation system. The fundamental idea behind our work is to demonstrate that highly agile maneuvers become infeasible to execute when visual measurements are noisy. Thus, agility should be traded-off with safety to enable efficient risk management. Our study focuses on navigating a quadcopter through a sequence of gates on an unknown map, and we rely on existing deep learning methods for visual gate-pose estimation. In addition, we develop an architecture for estimating the pose error under high disturbance visual inputs. We use the estimated pose errors to train a reinforcement learning agent to tune the parameters of the motion planning algorithm to safely navigate the environment while minimizing the track completion time. Simulation results demonstrate that our proposed approach yields significantly fewer crashes and higher track completion rates compared to approaches that do not utilize reinforcement learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-024-02085-4"
    },
    {
        "id": 30848,
        "title": "Stakeholders’ perspectives on safety-related human–robot collaborative scenarios",
        "authors": "Nicole Berx, Anita Brescia, Rhea Aqamarina, Elio Matteo Curcio, Liliane Pintelon, Giuseppe Carbone",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": " Safety plays a key role when implementing collaborative robots (cobots) in human-shared workspace scenarios. Nevertheless, the significance and understanding of safety-related aspects may significantly vary with different stakeholders’ perspectives. In particular, there is often a misconception that cobots are inherently safe with the result of significantly underestimating the need of adopting adequate safety measures and features for the deployment of collaborative robots in industrial and non-industrial frames. Accordingly, this article develops an in-depth analysis of the stakeholders and their stakes in human–robot collaboration in the manufacturing industry with particular attention to the safety aspects. The proposed approach consists of a field study, with an online questionnaire and structured interviews, directed at the main stakeholders. The field study results are presented and compared with insights from two recent explorative studies. Finally, careful analysis and discussion is provided. This research focuses on three topics: (i) the specific phases in the collaborative robot application cycle, (ii) the stakeholders that are involved in each phase, and (iii) the stakes that affect the stakeholders in general, and specifically the role of safety within these stakes. The findings show that awareness of safety issues is still jeopardized between stakeholders. In addition, key stakeholders still significantly underestimate safety-related issues when implementing cobots in new production lines. This implies the need for objective assessment tools that can systematically address and assess all safety-related aspects. This study provides industry practitioners with a broader view of how different stakeholders regard safety-related aspects in the cobot life cycle. This will enable more informed decision-making when implementing cobot solutions and potentially avoid unconsidered safety risks later on. This article also adds to the scant research on the role of each stakeholder in human–robot collaboration. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231200095"
    },
    {
        "id": 30849,
        "title": "Lifelong Visual-Tactile Spectral Clustering for Robotic Object Perception",
        "authors": "Yuyang Liu, Yang Cong, Gan Sun, Zhengming Ding",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcsvt.2022.3206865"
    },
    {
        "id": 30850,
        "title": "Real-time marine target recognition method of underwater inspection robot based on computer vision",
        "authors": "Qing Yang, Jili Zhou, Huijuan Meng, Dexin Gao",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": " In the complex marine environment, target recognition is difficult, and the real-time detection has a slow speed. In this article, a target recognition method combining underwater generative adversarial network and improved YOLOv4 is proposed, which is named M-YOLOv4. Firstly, the images collected by the underwater inspection robot are enhanced using the underwater generative adversarial network algorithm to obtain the training datasets. Secondly, the YOLOv4 target detection algorithm combines the feature extraction network of MoblieNetv3 for lightweight processing, which reduces the network model size, and reduces the number of algorithm calculations and parameters. Then, change the size of the spatial pyramid pooling module pooling kernel, which can enlarge receptive field and integrate characteristics of different receptive fields. Finally, the processed datasets are transferred to the improved M-YOLOv4 algorithm for training, and the trained model is transplanted to the Jetson Nano hardware device for real-time detection. The results of experiments show that the mean average precision value of the improved M-YOLOv4 recognition is 90.77%, which is 2.02% higher than that of the unimproved one. The frame per second value of the lightweight YOLOv4 algorithm with MobileNetv3 is 27, an increase of 12 compared with YOLOv4. The improved M-YOLOv4 algorithm can perform accurate detection of marine multi-targets on embedded devices. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231199845"
    },
    {
        "id": 30851,
        "title": "Design of a new Robot Operating System-MATLAB-based autonomous robot system and trajectory tracking experiment",
        "authors": "Zhenning Yu, Fengxiang Ge, Seng Fat Wong",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " The trajectory tracking performance of an actual robot is usually used as an important standard to evaluate a nonlinear controller algorithm. The aim of this article is to design a new experimental robot system based on the Robot Operating System-MATLAB framework. To validate the performance, a nonlinear tracking controller includes the following features. Firstly, the surface robot model is in Lie algebra [Formula: see text] format, which keeps the potential of cooperation control between space vehicles. Secondly, the nonlinear controller has good robustness under unknown disturbances. Thirdly, the control algorithm focuses on the practical robot, Turtlebot2. The robot system experimental results demonstrate the effectiveness of the proposed controller for trajectory tracking under unknown disturbance. The controller’s potential applications include autonomous robots for indoor examination, extreme condition rescuing, and cooperation between unmanned aerial vehicle and unmanned surface vehicle autodrives. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241229257"
    },
    {
        "id": 30852,
        "title": "Consideration of Autonomous Decentralized Coordination of Electric Balancer and Robotic Arm With Inertia Compensation for Larger Payload Manipulation",
        "authors": "Hiroaki Hanai, Mikio Ozawa, Toshiki Hirogaki, Eiichi Aoyama",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "Abstract\nThis study proposes an autonomous decentralized coordination of a robotic arm with an electric balancer to achieve larger payload manipulation. The characteristic feature of this research is that the robotic arm performs only position control, while the electric balancer performs only weight compensation in a decentralized manner. The electric balancer is a device that assists a person’s gravity-directional transfer operation. It detects the weight of the object to be transported and generates a torque that balances the weight. Accordingly, the person performs the conveyance manipulation. When a person manipulates the electric balancer, the person learns the characteristics of the balancer to achieve the manipulation. In this study, this is presented using a learning curve. However, the robotic arm manipulates the balancer according to position control; therefore, control interference may occur. Previous studies have focused on viscosity and friction in impedance control of electric balancers. The electric balancer used in this research can modify the magnitude of inertia compensation. Consequently, the influence of the inertia compensation on the coordination assist provided to the robotic arm is discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-115166"
    },
    {
        "id": 30853,
        "title": "An intelligent multi-sensor cooperative perception framework for situational awareness enhancement",
        "authors": "Qi Zhao, Yi Li, Hang Liu, Erik Blasch, Khanh D. Pham, Genshe Chen",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2665078"
    },
    {
        "id": 30854,
        "title": "Ergonomic hand positioning overcomes visual perception mismatch in nonsimulated robotic colorectal surgery",
        "authors": "Shing Wai Wong, Ranah Lim, Xiuling Jasmine Wong, Philip Crowe",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "Abstract\nThe aim of the study was to compare the internal instrument and external surgeon hand positions to determine whether visual perception mismatch (VPM) is a factor during robotic colorectal surgery. Continuous video footage of 24 consecutive robotic colorectal surgery cases were analysed concurrently with sagittal video recordings of surgeon hand positions. Separated sagittal hand positions would indicate nonergonomic positioning without clutching of the robotic controls, either matching the on-screen up/down instrument tip positions (no VPM) or in the opposite direction (true VPM). Variables (30-min surgery time blocks, anatomic target, and task performed), which resulted in hand separation or VPM, were analysed. Operating with the presence of VPM for more than one duration occurred 51 times and nonergonomic sagittal hand positioning occurred 22 times. For an experienced robotic surgeon, ergonomic positioning of the hands is favoured over adjustment for VPM despite the potential higher mental workload.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jscr/rjae143"
    },
    {
        "id": 30855,
        "title": "Singularity avoidance method for dual-arm closed-chain system based on damped least squares",
        "authors": "Qin Zhang, Zhenyu Liu, Hui Chai, Yueyang Li",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": " When two manipulators cooperate to clamp a rigid object, a closed chain with both ends fixed is formed. The singularity of a single manipulator causes the closed chain to be at a singularity, which results in uncertainty in the velocity mapping between the terminal and joint space. This study proposes a closed-chain singularity processing method for dual-arm collaboration, adopting the Jacobian pseudoinverse method based on damped least squares to obtain an approximate solution. During the solution process, the adaptive damping factor is improved by cubic polynomials, and the optimal damping factor is determined by quadratic sequence programming. Furthermore, this study analyzes the kinematic constraints of the closed-chain system and constructs a closed-chain Jacobian to judge whether the system is in a singular region. Finally, the effectiveness of the proposed method is verified through simulations. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231206940"
    },
    {
        "id": 30856,
        "title": "Knowledge-based Visual Context-Aware Framework for Applications in Robotic Services",
        "authors": "Doosoo Chang, Bohyung Han",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw58289.2023.00012"
    },
    {
        "id": 30857,
        "title": "Clinical applications of robotic surgery platforms: a comprehensive review",
        "authors": "Ahmed Gamal, Marcio Covas Moschovas, Abdel Rahman Jaber, Shady Saikali, Roshane Perera, Chris Headley, Ela Patel, Travis Rogers, Martin W. Roche, Raymond J. Leveillee, David Albala, Vipul Patel",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-023-01815-4"
    },
    {
        "id": 30858,
        "title": "Robotic Object Perception Based on Multispectral Few-Shot Coupled Learning",
        "authors": "Pengwen Xiong, Xiaobao Tong, Peter X. Liu, Aiguo Song, Zhijun Li",
        "published": "2023-10",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tsmc.2023.3279023"
    },
    {
        "id": 30859,
        "title": "Editorial commentary: Robotic applications for intracardiac and endovascular procedures: Are we ready for robotic takeover?",
        "authors": "Fengwei Zou, Luigi Di Biase",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tcm.2023.03.002"
    },
    {
        "id": 30860,
        "title": "LASER RANGE FINDER AND VISION SENSORS FOR ROBOTIC APPLICATIONS",
        "authors": "Hossein Golnabi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1615/faim1997.390"
    },
    {
        "id": 30861,
        "title": "RGB-D datasets for robotic perception in site-specific agricultural operations—A survey",
        "authors": "Polina Kurtser, Stephanie Lowry",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compag.2023.108035"
    },
    {
        "id": 30862,
        "title": "Analysis of the results of using gesture recognition in software applications",
        "authors": "Ivan Ralev, Georgi Krastev",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156801"
    },
    {
        "id": 30863,
        "title": "Dynamic movement primitives based on positive and negative demonstrations",
        "authors": "Shuai Dong, Zhihua Yang, Weixi Zhang, Kun Zou",
        "published": "2023-1-1",
        "citations": 2,
        "abstract": " Dynamic motion primitive has been the most prevalent model-based imitation learning method in the last few decades. Gaussian mixed regression dynamic motion primitive, which draws upon the strengths of both the motion model and the probability model to cope with multiple demonstrations, is a very practical and conspicuous branch in the dynamic motion primitive family. As Gaussian mixed regression dynamic motion primitive only learns from expert demonstrations and requires full environmental information, it is incapable of handling tasks with unmodeled obstacles. Aiming at this problem, we proposed the positive and negative demonstrations-based dynamic motion primitive, for which the introduction of negative demonstrations can bring additional flexibility. Positive and negative demonstrations-based dynamic motion primitive extends Gaussian mixed regression dynamic motion primitive in three aspects. The first aspect is a new maximum log-likelihood function that balances the probabilities on positive and negative demonstrations. The second one is the positive and negative demonstrations-based expectation–maximum, which involves iteratively calculating the lower bound of a new Q-function. And the last is the application framework of data set aggregation for positive and negative demonstrations-based dynamic motion primitive to handle unmodeled obstacles. Experiments on several typical robot manipulating tasks, which include letter writing, obstacle avoidance, and grasping in a grid box, are conducted to validate the performance of positive and negative demonstrations-based dynamic motion primitive. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231152997"
    },
    {
        "id": 30864,
        "title": "Enhancing Perception in Robot-Guided Vehicle Tests: A Rapid Long-Range Obstacle Detector",
        "authors": "D. Hermann, C. Wei, C. Marina Martínez, G. Hinz, A. Knoll",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/irc59093.2023.00057"
    },
    {
        "id": 30865,
        "title": "Enhancing Robotic Perception through Synchronized Simulation and Physical Common-Sense Reasoning",
        "authors": "Guillermo Trinidad Barnech, Gonzalo Tejera, Juan Valle-Lisboa, Pedro Núñez, Pilar Bachiller, Pablo Bustos",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "We introduce both conceptual and empirical findings arising from the amalgamation of a robotics cognitive architecture with an embedded physics simulator, aligning with the principles outlined in the intuitive physics literature. The employed robotic cognitive architecture, named CORTEX, leverages a highly efficient distributed working memory known as deep state representation. This working memory inherently encompasses a fundamental ontology, state persistency, geometric and logical relationships among elements, and tools for reading, updating, and reasoning about its contents. Our primary objective is to investigate the hypothesis that the integration of a physics simulator into the architecture streamlines the implementation of various functionalities that would otherwise necessitate extensive coding and debugging efforts. Furthermore, we categorize these enhanced functionalities into broad types based on the nature of the problems they address. These include addressing challenges related to occlusion, model-based perception, self-calibration, scene structural stability, and human activity interpretation. To demonstrate the outcomes of our experiments, we employ CoppeliaSim as the embedded simulator and both a Kinova Gen3 robotic arm and the Open-Manipulator-P as the real-world scenarios. Synchronization is maintained between the simulator and the stream of real events. Depending on the ongoing task, numerous queries are computed, and the results are projected into the working memory. Participating agents can then leverage this information to enhance overall performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24072249"
    },
    {
        "id": 30866,
        "title": "Structural design and research of a novel lower limb rehabilitation robot for human–robot coupling",
        "authors": "Zhiqiang Wang, Jianhai Han, Bingjing Guo, Xiangpan Li, Ganqin Du",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " A bedside rehabilitation robot is developed to address the challenge of motor rehabilitation for patients with lower limb paralysis. Firstly, based on the principles of physical rehabilitation, a two-link planar robot model is used to simulate both the robot and human lower limbs, and the coupling characteristics between the human and robot are thoroughly analyzed. Then, the lower limb rehabilitation robot, fitted with an end-effector and ankle wearable feature, is designed according to the structural parameters. To enhance patient safety during rehabilitation, the device incorporates a freely rotating leg support mechanism that reduces the load on the ankle due to gravitational forces, and a two-stage series elastic mechanism is integrated below the foot support to provide a passive compliant output of robot power, allowing for more natural movement and reducing the risk of injury. Secondly, dynamic modeling is used to determine the dynamic parameters of the robot by conducting simulation calculations based on the inertia parameters of the human body and the robot model design parameters. Finally, an experimental platform is established using the structural and dynamic parameters, and the robot’s reliability is validated through experimentation. Results indicate that the robot can accurately complete passive rehabilitation training tasks, and the dynamic parameters meet the expected requirements. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806241238992"
    },
    {
        "id": 30867,
        "title": "An improved numerical model for locomotive tensegrity systems based on vector form intrinsic finite element",
        "authors": "Xian Xu, Meijia Wang, Yanfeng Zheng, Chunlin Zhou, Yaozhi Luo",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": " Locomotive robot based on tensegrity has recently drawn much attention due to its lightweight and flexibility. This article presents an improved numerical model for locomotive tensegrities. The previously used bar element for struts is replaced by beam element, and rigid joint element is used to consider more details of the tendon–strut connections. The vector form intrinsic finite element (VFIFE) method is adopted to formulate the numerical model and carry out the simulation. The improvement of the proposed model on the prediction of feasible rolling gaits is quantitatively verified by experiments on a six-strut locomotive tensegrity. Mann–Whitney U test is adopted, and the p value between the experimental success rates of the gait primitives generated by the improved model and the rates of the gait primitives generated by the previous model is [Formula: see text]. It is shown that the improved model is more consistent with the experiment by considering the details of the tendon–strut connection. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231162442"
    },
    {
        "id": 30868,
        "title": "The motion reliability analysis of a series system with multiple coordinated manipulators",
        "authors": "Wei Wang, Zequan Xu, Qinchuan Li, Jin Wang, Ran Huo, Guodong Lu",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": " Coordinated manipulators can construct a series system, such that all the position error of the end-effector is required to remain within the permissible limit. This article proposed a new method to handle the problem of reliability analysis involving in multiple failure modes. The extreme value of the position error is introduced to construct a surrogate model to replace the original failure event, the moment with fraction order instead of the traditional integer is applied to derive the best-fit distribution of the extreme value based on the maximum entropy principle. The innovations mainly include: (1) the high efficient dimension reduction via the surrogate model constructed with the extreme value and (2) a better probability density function is derived through the fractional moment. A series system consists of three manipulators is used as an example to demonstrate the efficiency and accuracy of the proposed method. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231198936"
    },
    {
        "id": 30869,
        "title": "Research on the influence of the baby schema effect on the cuteness and trustworthiness of social robot faces",
        "authors": "Chien-Hsiung Chen, Xiaoyu Jia",
        "published": "2023-5-1",
        "citations": 1,
        "abstract": " Exploring people’s attitudes toward the appearance design of social robots in a low-cost and efficient way, and enhancing the experience of human–robot interaction have always been topics of concern for robot developers and interaction designers. This study aimed to explore the influence of the baby schema effect on users’ perceptions of cuteness and trustworthiness pertinent to social robot faces through two experiments. Experiment 1 used 100 uniformly processed pictures of robot faces in the real world to help explore the linear relationship among the degree of baby face, cuteness, and trustworthiness, and received a total of 98 valid questionnaires via the Internet. Experiment 2 was a 5 × 3 within-subjects factorial design. The research variables were robot type (i.e. MAKI, RoboThespian, Flobi, Pepper, and iCat) and baby schema (low schema, uncontrolled, and high schema); their impact on users’ perceptions of cuteness and trustworthiness was investigated. A total of 175 valid questionnaires were collected via the Internet. The generated results are as follows: (1) The degree of baby face and perceived emotion of social robot faces had a positive impact on trustworthiness for most real-world robots. (2) This study obtained the correlation formula of baby face, cuteness, and trustworthiness from a quantitative point of view, thus providing a reference for research on the related credibility of communication robots. (3) In general, baby schema effect also existed in the cuteness evaluation of most real-world robots. Faces with high schema were considered cuter and more trustworthy than uncontrolled or low schema faces. (4) Robot type and baby schema had a significant interaction with cuteness and trustworthiness. (5) However, for certain types of robots, baby schema effect may also have a counter-effect, that is, an overly high baby schema may reduce users’ perceptions of the cuteness and trustworthiness of social robots. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231168486"
    },
    {
        "id": 30870,
        "title": "Visual application of navigation framework in cyber-physical system for mobile robot to prevent disease",
        "authors": "Thanh Phuong Nguyen, Hung Nguyen, Ha Quang Thinh Ngo",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": "In this article, we propose the visual application of a navigation framework for a wheeled robot to disinfect surfaces. Since dynamic environments are complicated, advanced sensors are integrated into the hardware platform to enhance the navigation task. The 2D lidar UTM-30LX from Hokuyo attached to the front of the robot can cover a wide scanning area. To provide better results in laser scan matching, an inertial measurement unit was integrated into the robot’s body. The output of this combination feeds into a global costmap for monitoring and navigation. Additionally, incremental encoders that obtain high-resolution position data are connected to the rear wheels. The role of the positioning sensor is to identify the existing location of the robot in a local costmap. To detect the appearance of a human, a Kinect digital camera is fixed to the top of the robot. All feedback signals are combined in the host computer to navigate the autonomous robot. For disinfection missions, the robot must carry several ultraviolet lamps to autonomously patrol in unknown environments. To visualize the robot’s effectiveness, our approach was validated using both a virtual simulation and an experimental test. The contributions of this work are summarized as follows: (i) a structure for ultraviolet-based hardware was first established; (ii) the theoretical computations for the robot’s localization in the 3D workspace will play a fundamental role in further developments; and (iii) data fusion from advanced sensing devices was integrated to enable navigation in uncertain environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231162202"
    },
    {
        "id": 30871,
        "title": "Kinematic analysis and development of cable-driven rehabilitation robot for cerebral palsy patients",
        "authors": "H Partovi Aria, M Ahrabi, F Allahverdi, M Habibnejad Korayem",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": " This study aimed to analyze the kinematic development of a rehabilitation cable robot for patients with cerebral palsy problems. For this purpose, the walking pattern of a healthy person was analyzed in the robot by extracting his kinematic model. Therefore, a seven-link model was considered, and changes in the mass center of the links and then movements during the gait cycle were obtained with the angles related to joint changes. Next, the person’s integration with the rehabilitation cable robot was investigated with the resolution of the direct kinematic problem. In addition, the change-related outputs of the cables were obtained by the person’s movement and the attached belt. The robot was further proposed because the specific change diagram of the cables facilitates understanding how much motor torque is needed to change the length of the cable. It is noteworthy that the static person balance is provided in the existing rehabilitation robots. However, in this structure, the balance is done by the six degrees of freedom robot so that the robot can return the person to the original path when he loses his balance. Cable systems for the lower limbs (thighs and shanks) are also simulated to rehabilitate the patient. The obtained results from the simulation and the obtained output from kinematic equations for lower limb movements were also compared, and the highest deference was 2.2, 1.8, 1.8, and 1.5% for shank-back, shank-front, thigh-back, and thigh-front of the leg in the corresponding points in the outputs of both software, respectively. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231157342"
    },
    {
        "id": 30872,
        "title": "Decision Making in Managing the Choice of UAV Threat Detection Systems in the Protection of Critical Infrastructure Facilities",
        "authors": "Serhii Pohasii, Roman Korolov, Nataliia Dzheniuk, Alla Jammine, Tetiana Andriushchenko, Tetiana Milevska",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10155776"
    },
    {
        "id": 30873,
        "title": "Towards Safe Robotic Agricultural Applications: Safe Navigation System Design for a Robotic Grass-Mowing Application through the Risk Management Method",
        "authors": "José Carlos Mayoral Baños, Pål Johan From, Grzegorz Cielniak",
        "published": "2023-4-23",
        "citations": 1,
        "abstract": "Safe navigation is a key objective for autonomous applications, particularly those involving mobile tasks, to avoid dangerous situations and prevent harm to humans. However, the integration of a risk management process is not yet mandatory in robotics development. Ensuring safety using mobile robots is critical for many real-world applications, especially those in which contact with the robot could result in fatal consequences, such as agricultural environments where a mobile device with an industrial cutter is used for grass-mowing. In this paper, we propose an explicit integration of a risk management process into the design of the software for an autonomous grass mower, with the aim of enhancing safety. Our approach is tested and validated in simulated scenarios that assess the effectiveness of different custom safety functionalities in terms of collision prevention, execution time, and the number of required human interventions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics12030063"
    },
    {
        "id": 30874,
        "title": "Modeling of quality control management processes in the development and operation of VLC systems",
        "authors": "K. Alibekkyzy, S. Belginova, M. Batalova",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156686"
    },
    {
        "id": 30875,
        "title": "New Applications of Wire Suspension Mechanisms to Robotic Systems",
        "authors": "Hisashi Osumi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7210/jrsj.41.821"
    },
    {
        "id": 30876,
        "title": "Robust Motion Control for Aerial Robotic Systems in Monitoring Applications",
        "authors": "Hugo Yañez-Badillo, Francisco Beltran-Carbajal, Irvin Lopez-Garcia, Daniel Galvan-Perez, Alejandro Alvarez-Diaz, Jose Luis Hernandez-Avila, Ivan Rivas-Cambero",
        "published": "2023-8-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sege59172.2023.10274590"
    },
    {
        "id": 30877,
        "title": "Emerging multi-port soft tissue robotic systems: a systematic review of clinical outcomes",
        "authors": "Yit J. Leang, Joseph C. H. Kong, Zahin Mosharaf, Chrys S. Hensman, Paul R. Burton, Wendy A. Brown",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "AbstractMultiple novel multi-port robotic surgical systems have been introduced into clinical practice. This systematic review aims to evaluate the clinical outcomes of these novel robotic systems to conventional laparoscopic technique and established da Vinci robotic surgical platforms. A literature search of Embase, Medline, Pubmed, Cochrane library, and Google Scholar was performed according to the PRISMA guidelines from 2012 to May 2023. Studies comparing clinical outcomes of novel multi-port robotic surgical systems with laparoscopic or the da Vinci platforms were included. Case series with no comparison groups were excluded. Descriptive statistics were used to report patient and outcome data. A systematic narrative review was provided for each outcome. Twelve studies comprised of 1142 patients were included. A total of 6 novel multi-port robotic systems: Micro Hand S, Senhance, Revo-i MSR-5000, KangDuo, Versius, and Hugo™ RAS were compared against the laparoscopic or the da Vinci robotic platforms. Clinical outcomes of these novel robotic platforms were comparable to the established da Vinci platforms. When compared against conventional laparoscopic approaches, the robotic platforms demonstrated lower volume of blood loss, shorter length of stay but longer operative time. This systematic review highlighted the safe implementation and efficacy of 6 new robotic systems. The clinical outcomes achieved by these new robotic systems are comparable to the established da Vinci robotic system in simple to moderate case complexities. There is emerging evidence that these new robotic systems provide a viable alternative to currently available robotic platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-024-01887-w"
    },
    {
        "id": 30878,
        "title": "Learning curves and perioperative outcomes of single-incision robotic sacrocolpopexy on two different da Vinci® surgical systems",
        "authors": "Sumin Oh, Nayoung Bae, Hyun-Woong Cho, Yoon Jeong Park, Yong Jin Kim, Jung-Ho Shin",
        "published": "2023-2-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11701-023-01541-x"
    },
    {
        "id": 30879,
        "title": "Static group-bipartite consensus in networked robot systems with integral action",
        "authors": "Zhaoyan Wang, Hengyu Li, Jun Liu, Tiehui Zhang, Xinru Ma, Shaorong Xie, Jun Luo",
        "published": "2023-5-1",
        "citations": 1,
        "abstract": " With the increasing complexity of modern industry, the traditional single-target control of swarm robots can no longer meet application requirements. Hence, this article addresses compound task control for swarm robot systems, where the control aim and the dynamics of the robot are modeled by static group-bipartite consensus and Euler–Lagrange systems, respectively. After introducing the concept of static group-bipartite consensus in networked Euler–Lagrange systems, a distributed group-bipartite consensus control protocol with integral action is designed, and the criterion that ensures that static group-bipartite consensus is reached is presented. The most remarkable feature of the proposed algorithm is that it can accurately calculate the final state of system convergence. Finally, simulation examples are presented to verify the theoretical results. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231177148"
    },
    {
        "id": 30880,
        "title": "Robotic haptic adjective perception based on coupled sparse coding",
        "authors": "Pengwen Xiong, Kongfei He, Aiguo Song, Peter X. Liu",
        "published": "2023-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11432-021-3512-6"
    },
    {
        "id": 30881,
        "title": "Design and Development of an Adaptive Robotic Gripper",
        "authors": "Sainul Islam Ansary, Sankha Deb, Alok Kanti Deb",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01948-6"
    },
    {
        "id": 30882,
        "title": "A novel recurrent self-evolving fuzzy neural network for consensus decision-making of unmanned aerial vehicles",
        "authors": "ZY Chen, Yahui Meng, Ruei-Yuan Wang, Rong Jiang, Timothy Chen",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": " Currently, for years, unmanned aerial vehicles have been widely applied in a comprehensive realm. By enhancing computer photography and artificial intelligence, it can automatically discriminate against environmental objectives and detect events that occur in the real scene. The application of collaborative unmanned aerial vehicles will offer diverse interpretations which support a multiperspective view of the scene. Due to diverse interpretations of unmanned aerial vehicles usually deviates, thus, unmanned aerial vehicles require a consensus interpretation for the scenario. To previous purposes, this study presents an original consensus-based method to pilot multi-unmanned aerial vehicle systems for achieving consensus on their observation as well as constructing a group situation-based depiction of the scenario. Further, a fuzzy neural network generalized prediction control system known as a recurrent self-evolving fuzzy neural network is mainly used to ensure stability through the use of a descending gradient online learning rule. At the same time, users can think along the lines of evolutionary biological design. Unmanned aerial vehicles can be modeled as system experts for solving group problems that require the definition of conditions that best describe the scene. First, this method allows each unmanned aerial vehicle to set high-level conditions for detection events by aggregating events based on fuzzy information. These aggregated events are modeled by a fuzzy system ontology, which allows each unmanned aerial vehicle to report its preferences in conditions. Therefore, the interpretation of each drone is compressed to achieve a collective interpretation of the state. The final polls, consent and affinity polls confirmed the final decision group’s reliability ratings. The rated consensus indicates how well the collective interpretation of the scene matches each drone’s point of view. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231190960"
    },
    {
        "id": 30883,
        "title": "Patient Knowledge and Perception about Antibiotics in Community Pharmacy",
        "authors": "",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "There is a global concern regarding the emergence of antibiotic resistance. This has warranted a behavior diagnostic study to determine what patients visiting the community pharmacy in Nausori, Fiji understand regarding antibiotics and antibiotic resistance. This was a cross-sectional survey which enrolled 200 consenting participants by convenience sampling strategy visiting the pharmacy with prescription for antibiotics from July to September 2021. A validated questionnaire was constructed for data collection. Data collected were analyzed to determine predictors of antibiotic knowledge at 5% level of significance. Findings showed that 70.5% respondents reported an average level of knowledge about antibiotics. 83.5% respondents had misconceptions that antibiotics would work on viral infections while 82% correctly identified misuse of antibiotics can result in antibiotic resistance. The age (p value 0.0005), educational level (p value– 0.000007), and whether or not the participants were studying or working in medical field (p value– 0.016) were found to be important predictors of antibiotic knowledge. The public surveyed had misunderstandings and lack of knowledge in some crucial aspects of prudent antibiotic use. Also, negative attitudes regarding rational use of antibiotics were evident. Educational interventions are required to promote rationale use of antibiotics among the public.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jtma.02.01.04"
    },
    {
        "id": 30884,
        "title": "Robotization and intelligent digital systems in the meat cutting industry: From the perspectives of robotic cutting, perception, and digital development",
        "authors": "Weidong Xu, Yingchao He, Jiaheng Li, Jianwei Zhou, Enbo Xu, Wenjun Wang, Donghong Liu",
        "published": "2023-5",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tifs.2023.03.018"
    },
    {
        "id": 30885,
        "title": "Audio Perception in Robotic Assistance for Human Space Exploration: A Feasibility Study",
        "authors": "Marco Sewtz, Werner Friedl, Adrian Bauer, Anne Köpken, Florian Lay, Nicolai Bechtel, Peter Schmaus, Rudolph Triebel, Neal Y. Lii",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10116018"
    },
    {
        "id": 30886,
        "title": "A Review of Electrical Network Frequency (ENF) Based Applications in Media Forensics",
        "authors": "Ahmet Seyfullah GÜNEŞ, Saffet VATANSEVER",
        "published": "2023-6-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156714"
    },
    {
        "id": 30887,
        "title": "10GHz Printed Circuit Antenna for Wireless Power Transfer Applications",
        "authors": "Yaser Amer Jassim, Mesut Çevik, Taha A. Elwi",
        "published": "2023-6-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156795"
    },
    {
        "id": 30888,
        "title": "Awareness and Perception of certified librarians of Nigeria towards the use of robotic technologies in the libraries",
        "authors": "Atanda Saliu Sambo, Gloria Oyovwe-Tinuoye",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "The study adopted the social survey technique and the population of the study comprised 452 certified librarians of Nigeria libraries that were certified by the Librarians’ Registration Council of Nigeria (LRCN) on November, 24th, 2021. The librarians who took part in the survey were chosen using a random sampling method. One out of every three librarians being admitted on the day was given the questionnaire. The researcher used Statistical Package for the Social Sciences (SPSS version 20.0) application software with simple percentages chosen for easier analysis and interpretation. The findings of this study revealed that certified librarians are averagely aware of the existence of robotic technologies usage for library services and the anxiety of employee retrenchment is the major anxiety, despite they are aware that, the innovative apparatuses will increase global recognition and enhance library services. It shows that certified librarians are faced challenges towards the use of robotic technologies such as potential job loss, inadequate funding and epileptic among others. The study recommended that certified librarians should keep up with modern trends in information dissemination by learning fundamental skills that are technologically compatible among others.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4314/glj.v28i1.3"
    },
    {
        "id": 30889,
        "title": "EnveRob: Integration of an Intelligent Robotic Arm System for Mail Delivery Applications",
        "authors": "Shih-Huai Kao, Wei-Lin Pai, Feng-En Yeh, Jr-Jen Chen, Yu-Wei Lin, Pei-Chun Lin",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268516"
    },
    {
        "id": 30890,
        "title": "Cost-effective Robotic Arm Simulation and System Verification",
        "authors": "Apostolos Tsagaris,  , Charalampos Polychroniadis, Anastasios Tzotzis, Panagiotis Kyratsis",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "In recent years, the utilization of virtual environments in industry 4.0 has witnessed significant growth, particularly in the design, implementation, and management of robotic systems. This paper addresses the need for enhanced control in robotic arms by presenting the design and implementation of a 5DoF robotic arm transformed into a digital platform through specialized software. The methods employed involve detailed direct and inverse kinematic modeling to replicate the physical arm in a digital environment. Our measurements indicate an impressive accuracy ranging from 97% to 100% in the movements of the digital model, closely mirroring its physical counterpart. This research not only contributes to the development of simulation systems but also holds promise for the broader adoption of digital twins. The paper discusses the background, outlines the methodology, highlights key findings, and concludes with the potential future impact of this work on the advancement of robotic systems and simulation technologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5815/ijisa.2024.02.01"
    },
    {
        "id": 30891,
        "title": "Temporal automata for robotic scenario modeling with CIT framework",
        "authors": "Damien Mondou",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-18051-5"
    },
    {
        "id": 30892,
        "title": "An Infrastructure-Enabled-Perception System for High-Precision Vehicle Perception",
        "authors": "Shuyuan Luo, Jia Hu, Jintao Lai",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422662"
    },
    {
        "id": 30893,
        "title": "A Low-Cost Printed Circuit Board Design for External Force Measuring in Robotic Applications",
        "authors": "H. Meneses, V. Jarquin, Y. Miranda, C. Cordero, N. Delgado, K. Vargas, F. Ruíz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012238800003543"
    },
    {
        "id": 30894,
        "title": "A Review of Farming Aerial Mobile Robotic Systems and Proposal for Space Bio-Automation and Agriculture Applications",
        "authors": "Ricardo Barreto, José Cornejo, Mario Arbulú Saavedra, Johan Sebastian Cabrera Palencia, Ricardo Palomares",
        "published": "2023-10-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/amitic60194.2023.10366361"
    },
    {
        "id": 30895,
        "title": "Soft Normal and Shear Force Sensor for Underwater Robotic Applications",
        "authors": "David Kamp, Rafsan Al Shafatul Islam Subad, Kihan Park",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/fleps57599.2023.10220421"
    },
    {
        "id": 30896,
        "title": "Progress on flexible tactile sensors in robotic applications on objects properties recognition, manipulation and human-machine interactions",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20517/ss.2022.34"
    },
    {
        "id": 30897,
        "title": "Gesture Controlled Mobile Robot",
        "authors": "Edward Solly, Ahmed Aldabbagh",
        "published": "2023-6-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hora58378.2023.10156800"
    },
    {
        "id": 30898,
        "title": "Design of girth welding system based on tungsten inert gas welding",
        "authors": "Lei Chen, Jizhong Liu, Lei Hu",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": " This article studies the multi-layer and multi-pass welding of the circumferential weld in the thick pipe welding of an aviation enterprise, based on the static characteristics of the welding arc, through data calculations and experiments to verify the relationship between arc voltage and arc length, proposes to use the arc voltage controller to accurately adjust the arc voltage in real time, improve the welding stability, use the welding torch wiggler to expand the welding fusion width, meet the adaptive adjustment of the wide weld, and build the main control system based on programmable logic controller (PLC) control. Integrating all subsystems and put them into the actual production of the enterprise, significantly improves the production efficiency of parts welding, reduces welding defects, and improves the quality of aviation parts. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231181966"
    },
    {
        "id": 30899,
        "title": "Learning Occlusions in Robotic Systems: How to Prevent Robots from Hiding Themselves",
        "authors": "Jakob Nazarenus, Simon Reichhuber, Manuel Amersdorfer, Lukas Elsner, Reinhard Koch, Sven Tomforde, Hossam Abbas",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012431000003636"
    },
    {
        "id": 30900,
        "title": "Visual localization with a monocular camera for unmanned aerial vehicle based on landmark detection and tracking using YOLOv5 and DeepSORT",
        "authors": "Liqun Ma, Dongyuan Meng, Shuaihe Zhao, Binbin An",
        "published": "2023-5-1",
        "citations": 4,
        "abstract": " Absolute visual localization is of significant importance for unmanned aerial vehicles when the satellite-based localization system is not available. With the rapid evolution in the field of deep learning, the real-time visual detection and tracking of landmarks by an unmanned aerial vehicle could be implemented onboard. This study demonstrates a landmark-based visual localization framework for unmanned aerial vehicles flying at low altitudes. YOLOv5 and DeepSORT are used for multi-object detection and tracking, respectively. The unmanned aerial vehicle localization is achieved according to the geometric similarity between the geotagged transmission towers and the annotated images captured by a monocular camera. The validation is accomplished both in the Rflysim-based simulation and the quadrotor-based real flight. The localization precision is about 10 m, and the location update frequency reaches 5 Hz with a commercially available entry-level edge artificial intelligence platform. The proposed visual localization strategy needs no satellite image as a reference map, which saves a significant amount of the GPU memory and makes possible the end-to-end implementation on small unmanned aerial vehicles. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231164831"
    },
    {
        "id": 30901,
        "title": "Retraction Note: A New Viewpoint on Control Algorithms for Anthropomorphic Robotic Arms",
        "authors": "Tim Chen, J. C-y Chen",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01949-5"
    },
    {
        "id": 30902,
        "title": "Epistemic Planning for Heterogeneous Robotic Systems",
        "authors": "Lauren Bramblett, Nicola Bezzo",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341352"
    },
    {
        "id": 30903,
        "title": "A Mixed Reality System for Interaction with Heterogeneous Robotic Systems",
        "authors": "Valeria Villani, Beatrice Capelli, Lorenzo Sabattini",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394172"
    },
    {
        "id": 30904,
        "title": "Asymptotically Optimal Path Planning for Robotic Manipulators: Multi-Directional, Multi-Tree Approach",
        "authors": "Nermin Covic, Dinko Osmankovic, Bakir Lacevic",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10846-023-01893-4"
    }
]