[
    {
        "id": 7305,
        "title": "Comparison of Regression Analysis with Machine Learning Supervised  Predictive Model Techniques",
        "authors": "Pardomuan Robinson Sihombing, Sigit Budiantono, Ade Marsinta Arsani, Triana  Mauliasih Aritonang, Mohamad Arif Kurniawan",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "The happiness index is a parameter used to measure the level of happiness and well-being of people in a particular country or region. This research aims to determine the factors that contribute to people's happiness. In terms of modelling, this study will compare several regressions modelling using machine learning, including regression trees, random forests and Support Vector Regression (SVR). The SVR model has a minor error value in terms of MSE, RMSE and MAE compared to the other three models. The same thing happened when viewed from the value of R2 that the SVR model has an enormous value. This result indicates that SVR modelling is the best of the four models. A comprehensive policy is needed to increase a country's happiness index.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11594/jesi.03.02.03"
    },
    {
        "id": 7306,
        "title": "To predict the characteristic impedance of the microstrip transmission line using supervised machine learning regression techniques",
        "authors": "Mohammad Ahmad Ansari, Krishnan Rajkumar, Poonam Agarwal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcat.2023.133037"
    },
    {
        "id": 7307,
        "title": "To predict the characteristic impedance of the microstrip transmission line using supervised machine learning regression techniques",
        "authors": "Poonam Agarwal, Krishnan Rajkumar, Mohammad Ahmad Ansari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcat.2023.10058669"
    },
    {
        "id": 7308,
        "title": "Supervised Learning Regression for Sensor Calibration",
        "authors": "H. Shoushtari, T. Willemsen, H. Sternberg",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iss58390.2023.10361922"
    },
    {
        "id": 7309,
        "title": "Crop Recommendation Using Supervised Learning Techniques",
        "authors": "J. Ramya, M. Sankar",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276199"
    },
    {
        "id": 7310,
        "title": "Classification of Assamese Folk Songs’ Melody using Supervised Learning Techniques",
        "authors": "Krishnarjun Bora,  , Manash Pratim Barman, Arnab N Patowary, Toralima Bora",
        "published": "2023-1-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i2.1686"
    },
    {
        "id": 7311,
        "title": "Semi-Supervised Fuzzy C-Means for Regression",
        "authors": "Gabriella Casalino, Giovanna Castellano, Corrado Mencar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012195100003595"
    },
    {
        "id": 7312,
        "title": "Phase Retrieval Based on Supervised Machine Learning Regression Algorithms",
        "authors": "Helton A. Azevedo, Rafael R.L Benevides, Sébastien R.M.J Rondineau",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wcnps60622.2023.10345110"
    },
    {
        "id": 7313,
        "title": "Gully erosion prediction method from geoenvironmental data and supervised machine learning techniques",
        "authors": "Julio Cesar Lana",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mex.2023.102059"
    },
    {
        "id": 7314,
        "title": "Classification of Iris Flowers Using Supervised Learning Techniques: Review",
        "authors": "Kuruva Rahul Sai`, Aman Patra, Rajan Kakkar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4485285"
    },
    {
        "id": 7315,
        "title": "ACCURATE PREDICTION OF DRILL BIT PENETRATION RATE IN ROCK USING SUPERVISED MACHINE LEARNING TECHNIQUES BASE ON LABORATORY TEST DATA",
        "authors": "Shahrokh Khosravimanesh, Akbar Esmaeilzadeh, Masoud Akhyani, Reza Mikaeil, Mojtaba Mokhtarian Asl",
        "published": "2024",
        "citations": 0,
        "abstract": "Knowing the rate of penetration of a drill bit in rocks is among the most important parameters in their behaviour measurement. However, the direct measurement of ROP in rocks is a high-cost and time-intensive process. Therefore, obtaining the ROP parameter through a method other than direct measurement can be very useful and effective. Predictive machine learning methods are among the strong and precise techniques for the indirect measurement of ROP. To this end, 492 samples were tested under different UCS, µ, WOB, and ω conditions to obtain the corresponding ROP. To achieve an accurate model, three methods of linear regression analysis, lasso regression, and ridge regression were compared in terms of prediction accuracy. These models were compared through performance criteria of the prediction process and error-based charts. The performance criteria were measured using three measures: mean absolute percentage error, D-squared pinball score, and mean Poisson deviance error. For the MAPE index, the Lasso and Ridge models performed the best with values of 0.2557. Concerning the D2PS index, the linear regression model and Ridge performed better with values of 0.4083 and 0.4025, respectively. Finally, for the MPDE index, the Ridge model provided a more accurate performance with a value of 0.0105. For a better comparison, an objective function was created and calculated by combining these three indicators. The results showed the best rank for the Ridge model with an estimated value of 659.475. Finally, it was concluded that the Ridge model is a reliable and accurate model for predicting the ROP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17794/rgn.2024.1.10"
    },
    {
        "id": 7316,
        "title": "Employing Supervised Learning Techniques for DDoS Attack Detection",
        "authors": "Atul Kumar, Ishu Sharma",
        "published": "2023-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icidca56705.2023.10099834"
    },
    {
        "id": 7317,
        "title": "Supervised and Unsupervised Learning Techniques Utilizing Malware Datasets",
        "authors": "Daryle Smith, Sajad Khorsandroo, Kaushik Roy",
        "published": "2023-2-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaic57335.2023.10044169"
    },
    {
        "id": 7318,
        "title": "Parkinson’s Disease Diagnosis using Supervised Machine Learning Techniques",
        "authors": "Shikha Prasher, Leema Nelson, Vasantha Sandhya",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353401"
    },
    {
        "id": 7319,
        "title": "Tackle balancing constraints in semi-supervised ordinal regression",
        "authors": "Chenkang Zhang, Heng Huang, Bin Gu",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-024-06518-x"
    },
    {
        "id": 7320,
        "title": "Self-Supervised Learning for Scanned Halftone Classification with Novel Augmentation Techniques",
        "authors": "Jing-Ming Guo, Sankarasrinivasan Seshathiri",
        "published": "2023-10-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222434"
    },
    {
        "id": 7321,
        "title": "A Machine Learning-Based Comparative Approach to Predict the Crop Yield Using Supervised Learning With Regression Models",
        "authors": "Bharati Panigrahi, Krishna Chaitanya Rao Kathala, M. Sujatha",
        "published": "2023",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.241"
    },
    {
        "id": 7322,
        "title": "Prediction of movies popularity in supervised learning techniques",
        "authors": "Yizhen Zhang, Zejun Bai",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "When movies industry gradually become heavy capital, the prediction of movies popularity as well as their commercial potentiality based on historical data has become a popular research topic in the field of data analysis using machine learning models. In this paper, researchers trained three supervised machine learning models (Random Forest, Naive Bayesian Model and Support Vector Regression) using IMBD dataset to predict a movies popularity. This research has two outcomes: (1) the Random Forest Model has the highest accuracy rate; (2) the number of Oscar-winner included in both cast and crew is most positively related to a movies popularity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/29/20230742"
    },
    {
        "id": 7323,
        "title": "Uncertainty-Guided Cross-Modality Semi-Supervised Learning for MRI Segmentation",
        "authors": "Chaoyi Li, Brian C. Lovell",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00018"
    },
    {
        "id": 7324,
        "title": "Software Bugs Detection Using Supervised Machine Learning Techniques",
        "authors": "Manthan Shah, Ayushi Sharma, Rizon Kumar",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "A software bug is some sort of a fault in the source code or a computer program. These bugs work in unusual and unintended ways which is a serious problem for a programmer and the company. Detecting bugs in software has been tried and tested through multiple means, the most recent of which is Machine Learning algorithms. Using a revolutionary dataset consisting of real software code snippets of the C language into key values, we were able to train the algorithms based on numerical parameters. This in turn simplified our algorithmic process. Furthermore, we run multiple classification algorithms to gain precision, recall and Fn scores, and improve upon these scores using key hyperparameter tuning techniques. Our observations revealed an increase in accuracy and were able to create an end module which can directly take the source code as an input from which the metrics and features are extracted and give the output if the code has a software bug or not.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4028/p-of2831"
    },
    {
        "id": 7325,
        "title": "Semi-supervised regression with adaptive graph learning for EEG-based emotion recognition",
        "authors": "Tianhui Sha, Yikai Zhang, Yong Peng, Wanzeng Kong",
        "published": "2023",
        "citations": 6,
        "abstract": "<abstract><p>Electroencephalogram (EEG) signals are widely used in the field of emotion recognition since it is resistant to camouflage and contains abundant physiological information. However, EEG signals are non-stationary and have low signal-noise-ratio, making it more difficult to decode in comparison with data modalities such as facial expression and text. In this paper, we propose a model termed semi-supervised regression with adaptive graph learning (SRAGL) for cross-session EEG emotion recognition, which has two merits. On one hand, the emotional label information of unlabeled samples is jointly estimated with the other model variables by a semi-supervised regression in SRAGL. On the other hand, SRAGL adaptively learns a graph to depict the connections among EEG data samples which further facilitates the emotional label estimation process. From the experimental results on the SEED-IV data set, we have the following insights. 1) SRAGL achieves superior performance compared to some state-of-the-art algorithms. To be specific, the average accuracies are 78.18%, 80.55%, and 81.90% in the three cross-session emotion recognition tasks. 2) As the iteration number increases, SRAGL converges quickly and optimizes the emotion metric of EEG samples gradually, leading to a reliable similarity matrix finally. 3) Based on the learned regression projection matrix, we obtain the contribution of each EEG feature, which enables us to automatically identify critical frequency bands and brain regions in emotion recognition.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023505"
    },
    {
        "id": 7326,
        "title": "A COMPARISON OF RECENT SUPERVISED AND UNSUPERVISED LEARNING TECHNIQUES FOR DETECTING FAKE REVIEWS",
        "authors": "",
        "published": "2023-5-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets38313"
    },
    {
        "id": 7327,
        "title": "Supervised learning of process discovery techniques using graph neural networks",
        "authors": "Dominique Sommers, Vlado Menkovski, Dirk Fahland",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.is.2023.102209"
    },
    {
        "id": 7328,
        "title": "Thyroid Disease Detection Using Supervised Machine Learning Techniques",
        "authors": "Aryan Tiwari, Gaurav Singh, Shailja Singh, Tarun Jain",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cisct57197.2023.10351305"
    },
    {
        "id": 7329,
        "title": "Robust embedding regression for semi-supervised learning",
        "authors": "Jiaqi Bao, Mineichi Kudo, Keigo Kimura, Lu Sun",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109894"
    },
    {
        "id": 7330,
        "title": "Stokes Shift Prediction of Fluorescent Organic Dyes Using Machine Learning Regression Techniques",
        "authors": "Kapil  Dev Mahato",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4667356"
    },
    {
        "id": 7331,
        "title": "Supervised Machine Learning and Bayesian Regression Kriging with Application to COVID-19 Incidences in Sub-Saharan Africa",
        "authors": "Safari Godfrey Lyece, Samuel Mwalili, Joseph Kyalo Mung’atu",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.ajtas.20231203.11"
    },
    {
        "id": 7332,
        "title": "FireRisk: A Remote Sensing Dataset for Fire Risk Assessment with Benchmarks Using Supervised and Self-supervised Learning",
        "authors": "Shuchang Shen, Sachith Seneviratne, Xinye Wanyan, Michael Kirley",
        "published": "2023-11-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00034"
    },
    {
        "id": 7333,
        "title": "Intelligent Machine Fault Detection in Industries using Supervised Machine Learning Techniques",
        "authors": "Suresh Kumar Perumal, S Meenakshi",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452465"
    },
    {
        "id": 7334,
        "title": "Supervised machine learning model builder for regression and classification analysis featured as a web application",
        "authors": "Shital Sobale, Harshwardhan More, Shubham Mulay, Malhar Kshirsagar",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incacct57535.2023.10141809"
    },
    {
        "id": 7335,
        "title": "Forecasting Number of Indian Startups using Supervised Learning Regression Models",
        "authors": "Darshanaben Dipakkumar Pandya, Amitkumar Kantilal Patel, Janki Manishkumar Purohit, Madhavi Nandlal Bhuptani, Sheshang Degadwala, Dhairya Vyas",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134480"
    },
    {
        "id": 7336,
        "title": "Defect detection using weakly supervised learning",
        "authors": "Vasileios Sevetlidis, George Pavlidis, Vasiliki Balaska, Athanasios Psomoulis, Spyridon Mouroutsos, Antonios Gasteratos",
        "published": "2023-10-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ist59124.2023.10355716"
    },
    {
        "id": 7337,
        "title": "Universal relations for rapidly rotating neutron stars using supervised machine-learning techniques",
        "authors": "Grigorios Papigkiotis, George Pappas",
        "published": "2023-5-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevd.107.103050"
    },
    {
        "id": 7338,
        "title": "Crop Recommendation System using Supervised Learning Techniques",
        "authors": "M Disha, Satya Ranjan Dash, Debasish Mohapatra, Damodar Jena, Paola Barra",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/esic60604.2024.10481591"
    },
    {
        "id": 7339,
        "title": "Exploring Novel Self-Supervised Learning Techniques for Image Reconstruction Tasks",
        "authors": " Rupesh Devidas Sushir",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "Image reconstruction tasks, such as super-resolution, inpainting, and denoising, play a crucial role in various computer vision applications. Traditional methods often rely heavily on large labeled datasets for training, which can be costly and time-consuming to acquire. Self-supervised learning has emerged as a promising alternative, aiming to reduce this dependency by leveraging the inherent structures within the data itself. In this paper, we explore novel self-supervised learning techniques tailored specifically for image reconstruction tasks. We propose approaches that exploit the inherent relationships between low and high-resolution images, utilize context-aware information for inpainting, and incorporate generative adversarial networks for denoising. Through extensive experimentation, we demonstrate the efficacy of our methods in achieving competitive performance compared to supervised approaches while significantly reducing the need for labeled data. Our findings pave the way for more efficient and scalable solutions in image reconstruction, offering practical benefits across a wide range of applications",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-15608"
    },
    {
        "id": 7340,
        "title": "Machine Learning Techniques For Stock Price Prediction - A Comparative Analysis Of Linear Regression, Random Forest, And Support Vector Regression",
        "authors": "Shital Sameer Pashankar, Jyoti Dashrath Shendage, Dr. Janardan Pawar",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jaz.v45is4.4164"
    },
    {
        "id": 7341,
        "title": "Optimizing nailing parameters for hybrid retaining systems using supervised learning regression models",
        "authors": "Varun Menon, Sreevalsa Kolathayar",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41939-024-00417-3"
    },
    {
        "id": 7342,
        "title": "Play Store App Rating Prediction Using Machine Learning &amp; Deep Learning Regression Techniques",
        "authors": "Bhramara Bar Biswal, Satya Narayan Das, Satyanarayan Sahu, Shobhan Banerjee",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425706"
    },
    {
        "id": 7343,
        "title": "A Short Review on Supervised Machine Learning and Deep Learning Techniques in Computer Vision",
        "authors": "Ahmed Adil Nafea, Saeed Amer Alameri, Russel R Majeed, Meaad Ali Khalaf, Mohammed M AL-Ani",
        "published": "2024-2-11",
        "citations": 0,
        "abstract": "In last years, computer vision has shown important advances, mainly using the application of supervised machine learning (ML) and deep learning (DL) techniques. The objective of this review is to show a brief review of the current state of the field of supervised ML and DL techniques, especially on computer vision tasks. This study focuses on the main ideas, advantages, and applications of DL in computer vision and highlights their main concepts and advantages. This study showed the strengths, limitations, and effects of computer vision supervised ML and DL techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2024/004"
    },
    {
        "id": 7344,
        "title": "Modelling Stock Prices of Energy Sector using Supervised Machine Learning Techniques",
        "authors": "Mimoun Benali, Karima Lahboub",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "This paper aims at comparing the performance of the different state-of-the-art machine learning techniques in anticipating the performance of stock prices of the energy sector. The data collected cover the period  from January 2020 to February 2023 with a daily frequency for the three most imported refined petroleum products in Morocco and trained four regression machines learning (linear regression, lasso regression, ridge regression, and SVR) and four classifiers machine learning (logistic regression, decision tree, extra tree and Random Forest) so that anticipating one day ahead prices direction can take place no matter whether they are negative or positive prices. The performance of regression algorithm is then evaluated using different evaluation metrics, especially MSE, RMSE, MAE, MAPE and R2 to evaluate the performance of regression algorithm while precision, recall and F1 scores are used to evaluate the performance of classifiers algorithm. The outcomes propose that the performance of linear regression and ridge regression takes place equally and outperform other single regression that is lasso regression and SVR for-one-day predictions as a whole. In addition to that, we have come to find that in the classifiers, algorithms group all machine learning display similar predictive accuracy, this is on one hand. On the other hand, the best of them is the logistic regression. In brief, this study suggests that all performance metrics are significantly improved by ensemble learning. Therefore, this study proves that critical information affecting stock movement can be captured by utilizing historical transactions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32479/ijeep.15553"
    },
    {
        "id": 7345,
        "title": "Multi-mode Summarization of Surveillance Videos using Supervised Learning techniques",
        "authors": "Ranjitha M, Aruna Devi, Divya MO",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10083764"
    },
    {
        "id": 7346,
        "title": "Image Retargeting Techniques Identification Using Supervised Deep Learning",
        "authors": "Ruba Kharsa, Rouaa Alzoubi, Mohammad Alsmirat, Mahmoud Al-Ayyoub",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idsta58916.2023.10317851"
    },
    {
        "id": 7347,
        "title": "Diabetes Mellitus Prediction using Supervised Machine Learning Techniques",
        "authors": "Srishti Mahajan, Pradeepta Kumar Sarangi, Ashok Kumar Sahoo, Mukesh Rohra",
        "published": "2023-5-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incacct57535.2023.10141734"
    },
    {
        "id": 7348,
        "title": "Supervised Machine Learning Techniques to Calculate the Robustness of Networks",
        "authors": "Jordi Paillisse, Sergi Bergillos, Martí Madrenys, Eusebi Calle",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rndm59149.2023.10293137"
    },
    {
        "id": 7349,
        "title": "A supervised deep learning-based sentiment analysis by the implementation of Word2Vec and GloVe Embedding techniques",
        "authors": "Pranati Rakshit, Avik Sarkar",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-19045-7"
    },
    {
        "id": 7350,
        "title": "Retracted: Appropriate Supervised Machine Learning Techniques for Mesothelioma Detection and Cure",
        "authors": "BioMed Research International",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9861926"
    },
    {
        "id": 7351,
        "title": "Supervised Deep Learning Techniques for Image Description: A Systematic Review",
        "authors": "Marco López-Sánchez, Betania Hernández-Ocaña, Oscar Chávez-Bosquez, José Hernández-Torruco",
        "published": "2023-3-23",
        "citations": 2,
        "abstract": "Automatic image description, also known as image captioning, aims to describe the elements included in an image and their relationships. This task involves two research fields: computer vision and natural language processing; thus, it has received much attention in computer science. In this review paper, we follow the Kitchenham review methodology to present the most relevant approaches to image description methodologies based on deep learning. We focused on works using convolutional neural networks (CNN) to extract the characteristics of images and recurrent neural networks (RNN) for automatic sentence generation. As a result, 53 research articles using the encoder-decoder approach were selected, focusing only on supervised learning. The main contributions of this systematic review are: (i) to describe the most relevant image description papers implementing an encoder-decoder approach from 2014 to 2022 and (ii) to determine the main architectures, datasets, and metrics that have been applied to image description.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25040553"
    },
    {
        "id": 7352,
        "title": "Supervised machine learning with regression for the IRT-T reactor cooling system",
        "authors": "Maxim Kublinskiy, Nikita Smolnikov, Artem Naymushin",
        "published": "2024",
        "citations": 0,
        "abstract": "The purpose of this study is to create a machine learning model for the IRT-T reactor cooling system, which can estimate and predict the temperature difference in the secondary circuit. To do this, data was downloaded from the SCADA system, then an application was developed for converting and preprocessing this data. Then regression and classification models were constructed that evaluated the efficiency of the cooling system and its ability to predict changes in the temperature drop on heat exchangers. The main technical characteristics of the IRT-T reactor include a thermal power of 6 MW, the use of UO2 nuclear fuel in an aluminum matrix with an enrichment of 90.1%, a coolant in the form of desalinated water, tubular square-section fuel rods with external cooling, the fuel element shell material is SAV-1 alloy, and the use of five 5 IRT-1000 type heat exchangers with a total area of heat exchange of 1000 m2.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/itmconf/20245903007"
    },
    {
        "id": 7353,
        "title": "Comparing quantile regression spline analyses and supervised machine learning for environmental quality assessment at coastal marine aquaculture installations",
        "authors": "Kleopatra Leontidou, Verena Rubel, Thorsten Stoeck",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "Organic enrichment associated with marine finfish aquaculture is a local stressor of marine coastal ecosystems. To maintain ecosystem services, the implementation of biomonitoring programs focusing on benthic diversity is required. Traditionally, impact-indices are determined by extracting and identifying benthic macroinvertebrates from samples. However, this is a time-consuming and expensive method with low upscaling potential. A more rapid, inexpensive, and robust method to infer the environmental quality of marine environments is eDNA metabarcoding of bacterial communities. To infer the environmental quality of coastal habitats from metabarcoding data, two taxonomy-free approaches have been successfully applied for different geographical regions and monitoring goals, namely quantile regression splines (QRS) and supervised machine learning (SML). However, their comparative performance remains untested for monitoring the impact of organic enrichment introduced by aquaculture on marine coastal environments. We compared the performance of QRS and SML using bacterial metabarcoding data to infer the environmental quality of 230 aquaculture samples collected from seven farms in Norway and seven farms in Scotland along an organic enrichment gradient. As a measure of environmental quality, we used the Infaunal Quality Index (IQI) calculated from benthic macrofauna data (reference index). The QRS analysis plotted the abundance of amplicon sequence variants (ASVs) as a function to the IQI from which the ASVs with a defined abundance peak were assigned to eco-groups and a molecular IQI was subsequently calculated. In contrast, the SML approach built a random forest model to directly predict the macrofauna-based IQI. Our results show that both QRS and SML perform well in inferring the environmental quality with 89% and 90% accuracy, respectively. For both geographic regions, there was high correspondence between the reference IQI and both the inferred molecular IQIs (p < 0.001), with the SML model showing a higher coefficient of determination compared to QRS. Among the 20 most important ASVs identified by the SML approach, 15 were congruent with the good quality spline ASV indicators identified via QRS for both Norwegian and Scottish salmon farms. More research on the response of the ASVs to organic enrichment and the co-influence of other environmental parameters is necessary to eventually select the most powerful stressor-specific indicators. Even though both approaches are promising to infer environmental quality based on metabarcoding data, SML showed to be more powerful in handling the natural variability. For the improvement of the SML model, addition of new samples is still required, as background noise introduced by high spatio-temporal variability can be reduced. Overall, we recommend the development of a powerful SML approach that will be onwards applied for monitoring the impact of aquaculture on marine ecosystems based on eDNA metabarcoding data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj.15425"
    },
    {
        "id": 7354,
        "title": "Enhancing Wave Energy Conversion Efficiency through Supervised Regression Machine Learning Models",
        "authors": "Sunny Kumar Poguluri, Yoon Hyeok Bae",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "The incorporation of machine learning (ML) has yielded substantial benefits in detecting nonlinear patterns across a wide range of applications, including offshore engineering. Existing ML works, specifically supervised regression models, have not undergone exhaustive scrutiny, and there are no potential or concurrent models for improving the performance of wave energy converter (WEC) devices. This study employs supervised regression ML models, including multi-layer perceptron, support vector regression, and XGBoost, to optimize the geometric aspects of an asymmetric WEC inspired by Salter’s duck, based on key parameters. These important parameters, the ballast weight and its position, vary along a guided line within the available geometric resilience of the asymmetric WEC. Each supervised regression ML model was fine-tuned through hyperparameter optimization using Grid cross-validation. When evaluating the performance of each ML model, it became evident that the tuned hyperparameters of XGBoost led to predictions that strongly aligned with the actual values compared to other models. Furthermore, the study extended to assess the performance of the optimized WEC at the designated deployment test site location.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse12010153"
    },
    {
        "id": 7355,
        "title": "Gamma-ray blazar classification using machine learning with advanced weight initialization and self-supervised learning techniques",
        "authors": "Gopal Bhatta, Sarvesh Gharat, Abhimanyu Borthakur, Aman Kumar",
        "published": "2024-1-13",
        "citations": 0,
        "abstract": "ABSTRACT\nMachine learning has emerged as a powerful tool in the field of gamma-ray astrophysics. The algorithms can distinguish between different source types, such as blazars and pulsars, and help uncover new insights into the high-energy universe. The Large Area Telescope onboard the Fermi gamma-ray telescope has significantly advanced our understanding of the Universe. The instrument has detected a large number of gamma-ray-emitting sources, among which a significant number of objects have been identified as active galactic nuclei. The sample is primarily composed of blazars; however, more than one-third of these sources are either of an unknown class or lack a definite association with a low-energy counterpart. In this work, we employ multiple machine learning algorithms to classify the sources based on their other physical properties. In particular, we utilized smart initialization techniques and self-supervised learning for classifying blazars into BL Lacertae (BL Lac, also BLL) objects and flat-spectrum radio quasars (FSRQs). The core advantage of the algorithm is its simplicity, usage of minimum number of features and easy deployment due to lesser number of parameters without compromising on the performance along with increase in inference speed (at least seven times more than existing algorithms). As a result, the best-performing model is deployed on multiple platforms so that any user irrespective of their coding background can use the tool. The model predicts that out of the 1115 sources of uncertain type in the 4FGL-DR3 catalogue, 820 can be classified as BL Lacs and 295 can be classified as FSRQs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/mnras/stae028"
    },
    {
        "id": 7356,
        "title": "A Comparison Between Supervised Learning Techniques for Predictive Maintenance in Twin Screw Air Compressors",
        "authors": "Silvia Maria Zanoli, Crescenzo Pepe, Mahmoud Sfar Hancha",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/induscon58041.2023.10374593"
    },
    {
        "id": 7357,
        "title": "Fake Review Detection using Supervised and Semi-Supervised Learning with Natural Language Processing Techniques in Python",
        "authors": " K. Mahesh,  K. Hari Priya,  K. V. S Meghana,  K. Om Sai Vinay,  N. Anil Chakravarthy",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "This research paper explores the use of supervised and semi-supervised learning techniques along with natural language processing in Python for detecting fake reviews. The study discusses the importance of detecting fake reviews and its impact on businesses and customers. The proposed approach involves extracting relevant features from text data using various natural language processing techniques and training supervised learning models such as logistic regression, support vector machines, and random forests. Additionally, a semi-supervised learning technique called self-training is employed to improve the model's performance using unlabeled data. The effectiveness of the proposed approach is evaluated on a dataset of reviews from Amazon and Yelp, and the results show that the models achieve high accuracy in detecting fake reviews. The study concludes that the proposed approach can be a useful tool for businesses and customers to identify and filter out fake reviews.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-9269"
    },
    {
        "id": 7358,
        "title": "E-Commerce Product Review Classification based on Supervised Machine Learning Techniques",
        "authors": "Deepak Dharrao, Sarika Deokate, Anupkumar M Bongale, Siddhaling Urolagin",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10112717"
    },
    {
        "id": 7359,
        "title": "Building a Classification Model based on Feature Engineering for the Prediction of Wine Quality by Employing Supervised Machine Learning and Ensemble Learning Techniques",
        "authors": "Mauparna Nandan, Harsh Raj Gupta, Moutusi Mondal",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccece51049.2023.10085272"
    },
    {
        "id": 7360,
        "title": "Heart disease diagnosis Performance evaluation of supervised machine learning and feature selection techniques",
        "authors": "Prof Ravinder",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Heart disease diagnosis is a critical task in modern healthcare, demanding accurate and efficient methods. This study focuses on evaluating the performance of various supervised machine learning algorithms and feature selection techniques for the diagnosis of heart disease. The algorithms considered include Naïve Bayes, Decision Tree, KNN, SVM, and Logistic Regression. Additionally, different feature selection techniques are employed to identify the most relevant features for improved diagnostic accuracy. Furthermore, the study investigates the impact of feature selection on algorithm performance. Feature selection techniques are applied to identify the subset of attributes that contribute most effectively to heart disease diagnosis. The combination of various algorithms and feature selection methods yields insights into which approaches are most suitable for accurate and efficient heart disease diagnosis",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem27385"
    },
    {
        "id": 7361,
        "title": "MOORA MCDM based Optimal Machine Learning Regression Techniques for Breast Cancer Prediction",
        "authors": "Apurba Debnath, Anirban Tarafdar, Paritosh Bhattacharya, Azharuddin Shaikh",
        "published": "2023-11-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/silcon59133.2023.10404380"
    },
    {
        "id": 7362,
        "title": "Discriminative sparse least square regression for semi-supervised learning",
        "authors": "Zhonghua Liu, Zhihui Lai, Weihua Ou, Kaibing Zhang, Hua Huo",
        "published": "2023-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2023.03.128"
    },
    {
        "id": 7363,
        "title": "Refining Ground Classification for the Distribution of LTE Users Using Supervised Learning Techniques",
        "authors": "Kodjo E. F. Tossou, Sid Lamrous, Laurent Moalic, Tchamye Boroze, Oumaya Baala",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437630"
    },
    {
        "id": 7364,
        "title": "Application of Supervised Learning Techniques for Sports and Daily Activities Identification Using Accelerometer Data",
        "authors": "Pamela Zontone, Antonio Affanni, Davide Pin, Roberto Rinaldo",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/star58331.2023.10302440"
    },
    {
        "id": 7365,
        "title": "Supervised learning techniques for dairy cattle body weight prediction from 3D digital images",
        "authors": "Grum Gebreyesus, Viktor Milkevych, Jan Lassen, Goutam Sahana",
        "published": "2023-1-5",
        "citations": 9,
        "abstract": "Introduction: The use of automation and sensor-based systems in livestock production allows monitoring of individual cows in real-time and provides the possibility of early warning systems to take necessary management actions against possible anomalies. Among the different RT monitoring parameters, body weight (BW) plays an important role in tracking the productivity and health status.Methods: In this study, various supervised learning techniques representing different families of methods in the machine learning space were implemented and compared for performance in the prediction of body weight from 3D image data in dairy cows. A total of 83,011 records of contour data from 3D images and body weight measurements taken from a total of 914 Danish Holstein and Jersey cows from 3 different herds were used for the predictions. Various metrics including Pearson’s correlation coefficient (r), the root mean squared error (RMSE), and the mean absolute percentage error (MAPE) were used for robust evaluation of the various supervised techniques and to facilitate comparison with other studies. Prediction was undertaken separately within each breed and subsequently in a combined multi-breed dataset.Results and discussion: Despite differences in predictive performance across the different supervised learning techniques and datasets (breeds), our results indicate reasonable prediction accuracies with mean correlation coefficient (r) as high as 0.94 and MAPE and RMSE as low as 4.0 % and 33.0 (kg), respectively. In comparison to the within-breed analyses (Jersey, Holstein), prediction using the combined multi-breed data set resulted in higher predictive performance in terms of high correlation coefficient and low MAPE. Additional tests showed that the improvement in predictive performance is mainly due to increase in data size from combining data rather than the multi-breed nature of the combined data. Of the different supervised learning techniques implemented, the tree-based group of supervised learning techniques (Catboost, AdaBoost, random forest) resulted in the highest prediction performance in all the metrics used to evaluate technique performance. Reported prediction errors in our study (RMSE and MAPE) are one of the lowest in the literature for prediction of BW using image data in dairy cattle, highlighting the promising predictive value of contour data from 3D images for BW in dairy cows under commercial farm conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fgene.2022.947176"
    },
    {
        "id": 7366,
        "title": "Text Categorization using Supervised Machine Learning Techniques",
        "authors": "Ishaan Dawar, Narendra Kumar, Sakshi Negi, Sayeedakhanum Pathan, Shirshendu Layek",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wids-psu57071.2023.00046"
    },
    {
        "id": 7367,
        "title": "Machine Learning for Rental Price Prediction: Regression Techniques and Random Forest Model",
        "authors": "Raju Raju, Arham Neyaz, Aleem Ahmed, Annu Singh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4587725"
    },
    {
        "id": 7368,
        "title": "Hybrid Feature Selection (RFEMI) Techniques and Intrusion Detection Systems for Web Attacks Detection Using Supervised Machine Learning Algorithms.",
        "authors": "Ibrahim Abobaker",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ficloud58648.2023.00020"
    },
    {
        "id": 7369,
        "title": "A hybrid semi-supervised regression based machine learning method for predicting peak wind loads on a group of buildings",
        "authors": "Kun Du, Bo Chen",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2022.115245"
    },
    {
        "id": 7370,
        "title": "A Study in Analysing the Factors Influencing Job Satisfaction through Supervised Machine Learning Methods",
        "authors": "Chandra Mouli Venkata Srinivas Akana, Sphurti Birajdar, Prakash Bethapudi, K. Soujanya, L. Chandra Sekhar Reddy, M Anusuya",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icotl59758.2023.10435218"
    },
    {
        "id": 7371,
        "title": "Hand Sign Classification Techniques Using Supervised And Unsupervised Learning Algorithms",
        "authors": "J L V Sri Harshitha, N Saranya, Yekkitilli Sruthi, S Srithar, J Vijaya Chandra",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128426"
    },
    {
        "id": 7372,
        "title": "Telecom Customer Churn Prediction Using Supervised Machine Learning Techniques",
        "authors": "O. Pandithurai, H. Humaid Ahmed, Hrudhai Narayan. S, B. Sriman, Seetha R",
        "published": "2023-5-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10200429"
    },
    {
        "id": 7373,
        "title": "Supervised Learning for Untangling Braids",
        "authors": "Alexei Lisitsa, Mateo Salles, Alexei Vernitski",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011775900003393"
    },
    {
        "id": 7374,
        "title": "Depression detection using semantic representation based semi-supervised deep learning",
        "authors": "Gaurav Kumar Gupta, Dilip Kumar Sharma",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdats.2023.133012"
    },
    {
        "id": 7375,
        "title": "Chronic Kidney Disease (Ckd) Prediction by Supervised Machine Learning Techniques",
        "authors": "Abhijaat Pandey, Neeli Sandeep Kumar, Harshita Sadadekar, Anita Shrotriya, Tarun Jain",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442781"
    },
    {
        "id": 7376,
        "title": "Depression detection using semantic representation based semi-supervised deep learning",
        "authors": "Dilip Kumar Sharma, Gaurav Kumar Gupta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdats.2023.10058464"
    },
    {
        "id": 7377,
        "title": "Opinion Mining on Amazon Musical Product Reviews using Supervised Machine Learning Techniques",
        "authors": "Aryan Kumar, Tarun Jain, Priyesh Tiwari, Rakesh Sharma",
        "published": "2023-2-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iemecon56962.2023.10092288"
    },
    {
        "id": 7378,
        "title": "Hate Speech Analysis using Supervised Machine Learning Techniques",
        "authors": "M Pyingkodi, K Thenmozhi, K Chitra, M Karthikeyan, M Pradeep, Prakash T D Suriya, T J Viswanathan",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128591"
    },
    {
        "id": 7379,
        "title": "A Study to Analyse Covid-19 Outbreak Using Multiple Linear Regression: A Supervised Machine Learning Approach",
        "authors": "Jayanti Semwal, Abhinav Bahuguna, Akanksha Uniyal, Shaili Vyas",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Introduction: Globally, COVID-19 have impacted people's quality of life Machine learning have recently become popular for making predictions because of their precision and adaptability in identifying diseases. This study aims to identify significant predictors for daily active cases and to visualise trends in daily active, positive cases, and immunisations.\nMaterial and methods: This paper utilized secondary data from Covid-19 health bulletin of Uttarakhand and multiple linear regression as a part of supervised machine learning is performed to analyse dataset.\nResults: Multiple Linear Regression model is more accurate in terms of greater score of R2 (=0.90) as compared to Linear Regression model with R2=0.88. The daily number of positive, cured, deceased cases are significant predictors for daily active cases (p <0.001). Using time series linear regression approach, cumulative number of active cases is forecasted to be 6695 (95% CI: 6259 - 7131) on 93rd day since 18 Sep 2022, if similar trend continues in upcoming 3 weeks in Uttarakhand.\nConclusion: Regression models are useful for forecasting COVID-19 instances, which will help governments and health organisations address this pandemic in future and establish appropriate policies and recommendations for regular prevention.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55489/njcm.140220232656"
    },
    {
        "id": 7380,
        "title": "Evaluating expressway traffic crash severity by using logistic regression and explainable &amp; supervised machine learning classifiers",
        "authors": "J.P.S. Shashiprabha Madushani, R.M. Kelum Sandamal, D.P.P. Meddage, H.R. Pasindu, P.I. Ayantha Gomes",
        "published": "2023-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.treng.2023.100190"
    },
    {
        "id": 7381,
        "title": "Autoencoding slow representations for semi-supervised data-efficient regression",
        "authors": "Oliver Struckmeier, Kshitij Tiwari, Ville Kyrki",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractThe slowness principle is a concept inspired by the visual cortex of the brain. It postulates that the underlying generative factors of a quickly varying sensory signal change on a different, slower time scale. By applying this principle to state-of-the-art unsupervised representation learning methods one can learn a latent embedding to perform supervised downstream regression tasks more data efficient. In this paper, we compare different approaches to unsupervised slow representation learning such as $$L_p$$\n\nL\np\n\n norm based slowness regularization and the SlowVAE, and propose a new term based on Brownian motion used in our method, the S-VAE. We empirically evaluate these slowness regularization terms with respect to their downstream task performance and data efficiency in state estimation and behavioral cloning tasks. We find that slow representations show great performance improvements in settings where only sparse labeled training data is available. Furthermore, we present a theoretical and empirical comparison of the discussed slowness regularization terms. Finally, we discuss how the Fréchet Inception Distance (FID), commonly used to determine the generative capabilities of GANs, can predict the performance of trained models in supervised downstream tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-022-06299-1"
    },
    {
        "id": 7382,
        "title": "Supervised Machine Learning and Multiple Regression Approach to Predict Successfulness of Matrix Acidizing in Hydraulic Fractured Sandstone Formation",
        "authors": "Candra Kurniawan, Muhammad Mufti Azis, Teguh Ariyanto",
        "published": "2023-4-29",
        "citations": 1,
        "abstract": "The success rate of matrix acidizing in hydraulic fractured sandstone formation is less than 55%, much lower compared to the more than 91% success rate in carbonate formation. The need for alternative approaches to help the success ratio in matrix acidizing is crucial. This paper demonstrates a modeling technique to improve the success ratio of matrix acidizing in a hydraulic fractured sandstone formation. Supervised machine learning with 4 models of a neural network, logistic regression, tree, and random forest was selected to predict the successfulness of matrix acidizing in hydraulic fracturing. In parallel, multivariate analysis of principal component regression and partial least square regression approach were utilized to predict the oil gain of the job. For qualitative prediction, the results showed that the random forest was the best model to predict the successfulness of the job with the area under the curve (AUC) of 0.68 and precision of 0.73 in the training model with 70% of the data. Subsequently, the validation test with the rest of the data (30% data) gave 0.51 AUC and 61% precision. For quantitative prediction, the net oil gain was evaluated by using principal component regression (PCR) and partial least square regression (PLS-R). The PCR and PLS-R model gave a coefficient of determination (Rsquare) of 0.22 and 0.35, respectively. The p-value of PLS-R was 0.047 (95% confidence interval) which indicates that the model is significant. The results of this work demonstrate the potential application of supervised machine learning, principal component regression, and partial least square regression to improve candidate selection of oil wells for matrix acidizing especially in hydraulic fractured wells with limited design data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ajche.78255"
    },
    {
        "id": 7383,
        "title": "Customer Segmentation Using Supervised and Unsupervised Machine Learning Techniques",
        "authors": "P. Nagaraj, C Bharath Kumar, K Charan Kumar, B Venu, R.Raja Sekar, T.Diliphan Rajkumar",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452643"
    },
    {
        "id": 7384,
        "title": "Robot Arm Movement Control by Model-based Reinforcement Learning using Machine Learning Regression Techniques and Particle Swarm Optimization",
        "authors": "Meta Mueangprasert, Pisak Chermprayong, Kittipong Boonlong",
        "published": "2023-1-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ica-symp56348.2023.10044940"
    },
    {
        "id": 7385,
        "title": "Classification of Stellar Using Supervised Machine Learning Techniques",
        "authors": "Prabhu V, Kirubakaran D, Notam Kedari, Peddamallu Sai Divya, Kaluva Vandana",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rmkmate59243.2023.10369915"
    },
    {
        "id": 7386,
        "title": "Predicting Credit Risk in European P2P Lending: A Case Study of “Bondora” Using Supervised Machine Learning Techniques",
        "authors": "Sampurna Mondal, Sahil K. Shah, Vidya Kumbhar",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353353"
    },
    {
        "id": 7387,
        "title": "An Exploratory Study of Factors Affecting Research Productivity in Higher Educational Institutes Using Regression and Deep Learning Techniques",
        "authors": "Rasha Gaffer M. Helali",
        "published": "2023-6-16",
        "citations": 1,
        "abstract": "Higher education is grappling with challenges from globalization. The competition between worldwide universities depends not only on the availability of infrastructure and faculty members' teaching quality, but also on their research performance. The research produced by faculty members has a significant impact on a university's standing, ability to acquire funds, and ability to enroll both domestic and international students. The objective of this paper is to identify factors affecting scientific research productivity in selected higher educational institutes. The paper reports the views of academic staff from different educational institutes on such issues as the determinants of research performance. A quantitative analysis approach, including correlation and regression, in addition to deep learning, was utilized to achieve the aim of the paper. The findings of this research demonstrate that the support of academic institutes for enhancing research and providing facilities and funds for such purpose has a great impact on research performance. The allocation of hours of scientific research to the faculty member also had a positive impact on the improvement of scientific research. Linking career promotion and scientific research encourages faculty members to publish more papers. Moreover, the level of qualification for faculty members has a great impact on their rate of publishing papers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47852/bonviewaia3202660"
    },
    {
        "id": 7388,
        "title": "Movies Rating Prediction using Supervised Machine Learning Techniques",
        "authors": " Ayesha Siddique,  M Kamran Abid,  Muhammad Fuzail,  Naeem Aslam",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "Social media are the most enormous and fast data technology on the internet. A massive amount of data is generated from the internet day by day. The efficient processing of such massive records is hard, so we require a system that learns from these facts and makes a useful prediction like machine learning. Machine learning strategies make the systems learn it. Applying K-nearest neighbors (KNN), Support Vector Machine (SVM), as well as Random Forest Model (RF), three supervised machine learning approaches, we attempted to develop a model for a movie recommendation system. This research not only compares the three models but also assesses how they compare favorably against one another in the areas of accuracy, accuracy, recalls, and F1 score. First of all, we discuss a summary of machine learning techniques used for recommendations of items in the past. We subsequently detail the most effective machine learning model for making predictions and recommendations about movie ratings. Predictions of movie reviews are made using K-nearest neighbor (KNN) and Support Vector Machine (SVM) models as well as the Random Forest Model (RF). The efficacy of all models was tested with Movie Lens 100k and 1M dataset. The random forest Model performs better as compared to other models. Furthermore, we summarize the current challenges based on state of art approaches. Finally, we present open issues and future directions for further research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58325/ijisct.003.01.0062"
    },
    {
        "id": 7389,
        "title": "Using Semi-supervised Learning for Monaural Time-domain Speech Separation with a Self-supervised Learning-based SI-SNR Estimator",
        "authors": "Shaoxiang Dang, Tetsuya Matsumoto, Yoshinori Takeuchi, Hiroaki Kudo",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-85"
    },
    {
        "id": 7390,
        "title": "Weekly Load Demand Forecasting using Supervised Deep Learning Techniques: A Case Study of Suranaree University of Technology",
        "authors": "Waranyu Sarapan, Nonthawat Khotsriwong, Nonthakorn Boonrakchat, Promphak Boonraksa, Terapong Boonraksa, Boonruang Marungsri",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieecon56657.2023.10126612"
    },
    {
        "id": 7391,
        "title": "Optimizing Hypothyroid Diagnosis with Physician-Supervised Feature Reduction using Machine Learning Techniques",
        "authors": "Priyanshu Rawat, Madhvan Bajaj, Satvik Vats, Vikrant Sharma, Lisa Gopal, Rakesh Kumar",
        "published": "2023-4-20",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cictn57981.2023.10140459"
    },
    {
        "id": 7392,
        "title": "Study of Spam Email Filtering Methods using Supervised Machine Learning Techniques",
        "authors": "Mallikarjuna Rao Ch, Sahithi Reddy S, Sathvika Konlyada, Vineela Konagala, Vanditha Das Chenda",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoei56765.2023.10125624"
    },
    {
        "id": 7393,
        "title": "An Evaluation of Stock Market Prediction using Supervised Machine Learning Techniques",
        "authors": "P. Lakshmi Sagar, Chennappagari Maheshbabu, Gilaka Venkata Siva Teja, Chalichimala Vishnu, Derangula Venkat Sai, Chukka Mahesh",
        "published": "2023-4-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10133970"
    },
    {
        "id": 7394,
        "title": "Supervised Classification of Groundwater Potential Mapping Using Integrated Machine Learning and GIS-Based Techniques",
        "authors": "Marwah Abdullah Shlash, Imad Habeeb Obead",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/mmep.100313"
    },
    {
        "id": 7395,
        "title": "Supervised and unsupervised machine learning techniques for predicting mechanical properties of coconut fiber reinforced concrete",
        "authors": "Veena Kashyap, Ahmad Alyaseen, Arunava Poddar",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42107-024-01018-8"
    },
    {
        "id": 7396,
        "title": "A Supervised Learning Approach to Robust Reinforcement Learning for Job Shop Scheduling",
        "authors": "Christoph Schmidl, Thiago Simão, Nils Jansen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012473600003636"
    },
    {
        "id": 7397,
        "title": "Predicting total sediment load transport in rivers using regression techniques, extreme learning and deep learning models",
        "authors": "Deepti Shakya, Vishal Deshpande, Bimlesh Kumar, Mayank Agarwal",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10462-023-10422-6"
    },
    {
        "id": 7398,
        "title": "Regression-based Sound Event Detection with Semi-supervised Learning",
        "authors": "Chia-Chuan Liu, Chia-Ping Chen, Chung-Li Lu, Bo-Cheng Chan, Yu-Han Cheng, Hsiang-Feng Chuang, Wei-Yu Chen",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apsipaasc58517.2023.10317136"
    },
    {
        "id": 7399,
        "title": "A Supervised Machine Learning Model for Regression to Predict Melt Pool Formation and Morphology in Laser Powder Bed Fusion",
        "authors": "Niccolò Baldi, Alessandro Giorgetti, Alessandro Polidoro, Marco Palladino, Iacopo Giovannetti, Gabriele Arcidiacono, Paolo Citti",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "In the additive manufacturing laser powder bed fusion (L-PBF) process, the optimization of the print process parameters and the development of conduction zones in the laser power (P) and scanning speed (V) parameter spaces are critical to meeting production quality, productivity, and volume goals. In this paper, we propose the use of a machine learning approach during the process parameter development to predict the melt pool dimensions as a function of the P/V combination. This approach turns out to be useful in speeding up the identification of the printability map of the material and defining the conduction zone during the development phase. Moreover, a machine learning method allows for an accurate investigation of the most promising configurations in the P-V space, facilitating the optimization and identification of the P-V set with the highest productivity. This approach is validated by an experimental campaign carried out on samples of Inconel 718, and the effects of some additional parameters, such as the layer thickness (in the range of 30 to 90 microns) and the preheating temperature of the building platform, are evaluated. More specifically, the experimental data have been used to train supervised machine learning models for regression using the KNIME Analytics Platform (version 4.7.7). An AutoML (node for regression) tool is used to identify the most appropriate model based on the evaluation of R2 and MAE scores. The gradient boosted tree model also performs best compared to Rosenthal’s analytical model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14010328"
    },
    {
        "id": 7400,
        "title": "Short-term Load Demand Forecasting using Supervised Deep Learning Techniques: A Case Study of Suranaree University of Technology",
        "authors": "Nonthawat Khotsriwong, Promphak Boonraksa, Waranyu Sarapan, Terapong Boonraksa, Nonthakorn Boonrakchat, Boonruang Marungsri",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieecon56657.2023.10126570"
    },
    {
        "id": 7401,
        "title": "Non-intrusive Status Prediction of Residential Appliances using Supervised Learning Techniques",
        "authors": "Muhammad Zaigham Abbas, Intisar Ali Sajjad, Rehan Liaqat, Tanveer Khursheed, Muhammad Awais, Muhammad Saqib Javed",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icece58062.2023.10092511"
    },
    {
        "id": 7402,
        "title": "Supervised machine learning techniques for predicting multiple damage classes in bridges",
        "authors": "Valentina Giglioni, Ilaria Venanzi, Filippo Ubertini",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2664359"
    },
    {
        "id": 7403,
        "title": "Soil liquefaction in seismic events: pioneering predictive models using machine learning and advanced regression techniques",
        "authors": "Pouyan Abbasimaedeh",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12665-024-11480-x"
    },
    {
        "id": 7404,
        "title": "Estimating the photometric redshifts of galaxies and QSOs using regression techniques in machine learning",
        "authors": "A. Momtaz, M. H. Salimi, S. Shakeri",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/9789811269776_0027"
    },
    {
        "id": 7405,
        "title": "Investigation of optimal feature for milling chatter identification using supervised machine learning techniques",
        "authors": "Rohit Mishra, Matta S.N.S. Kiran, Manikantadhar Maheswaram, Akshat Upadhyay, Bhagat Singh",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jer.2023.100138"
    },
    {
        "id": 7406,
        "title": "Comparing and evaluating supervised and unsupervised machine learning techniques for IoT security",
        "authors": "El Mahdi Boumait, Ahmed Habbani, Reda Mastouri, Mohamed Khalifa Boutahir",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0151229"
    },
    {
        "id": 7407,
        "title": "Multi-Key Privacy-Preserving Training and Classification using Supervised Machine Learning Techniques in Cloud Computing",
        "authors": "R. Hari Kishore, A. Chandra Sekhar, Pramoda Patro, Debabrata Swain",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10200291"
    },
    {
        "id": 7408,
        "title": "Diverse and consistent multi-view networks for semi-supervised regression",
        "authors": "Cuong Nguyen, Arun Raja, Le Zhang, Xun Xu, Balagopal Unnikrishnan, Mohamed Ragab, Kangkang Lu, Chuan-Sheng Foo",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06305-0"
    },
    {
        "id": 7409,
        "title": "Prediction of groundwater quality index in the Gaza coastal aquifer using supervised machine learning techniques",
        "authors": "Adnan M. Aish, Hossam Adel Zaqoot, Waqar Ahmed Sethar, Diana A. Aish",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Abstract\nThis paper investigates the performance of five supervised machine learning algorithms, including support vector machine (SVM), logistic regression (LogR), decision tree (DT), multiple perceptron neural network (MLP-NN), and K-nearest neighbours (KNN) for predicting the water quality index (WQI) and water quality class (WQC) in the coastal aquifer of the Gaza Strip. A total of 2,448 samples of groundwater were collected from the coastal aquifer of the Gaza Strip, and various physical and chemical parameters were measured to calculate the WQI based on weight. The prediction accuracy was evaluated using five error measures. The results showed that MLP-NN outperformed other models in terms of accuracy with an R value of 0.9945–0.9948, compared with 0.9897–0.9880 for SVM, 0.9784–0.9800 for LogR, 0.9464–0.9247 for KNN, and 0.9301–0.9064 for DT. SVM classification showed that 78.32% of the study area fell under poor to unsuitable water categories, while the north part of the region had good to excellent water quality. Total dissolved solids (TDS) was the most important parameter in WQI predictions while and were the least important. MLP-NN and SVM were the most accurate models for the WQI prediction and classification in the Gaza coastal aquifer.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2166/wpt.2023.028"
    },
    {
        "id": 7410,
        "title": "Fake news detection using supervised learning techniques",
        "authors": "S. Sangeetha, B. Sangeetha, Darshan Sasikumar, M. Gayathri, Gowtham Sriram, Kevin Nelson, H. Lavaniya, Saaketh Kopuru",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0135005"
    },
    {
        "id": 7411,
        "title": "Enhancing Energy Efficiency in Residential Buildings: A Comparative Analysis of Supervised and Unsupervised Learning Techniques",
        "authors": "Reji K, Resmi R, Rohini S, Padmavathi S, Sreevidya C, Rekha P Vishwanathan",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i-pact58649.2023.10434391"
    },
    {
        "id": 7412,
        "title": "Investigating factors influencing pedestrian crosswalk usage behavior in Dhaka city using supervised machine learning techniques",
        "authors": "Nazmus Sakib, Tonmoy Paul, Md. Tawkir Ahmed, Khondhaker Al Momin, Saurav Barua",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.multra.2023.100108"
    },
    {
        "id": 7413,
        "title": "Integration of PSO-based advanced supervised learning techniques for classification data mining to predict heart failure",
        "authors": "Mesran Mesran, Remuz Mb Kmurawak, Agus Perdana Windarto",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12928/telkomnika.v22i1.25357"
    },
    {
        "id": 7414,
        "title": "Global and local interpretability techniques of supervised machine learning black box models for numerical medical data",
        "authors": "Hajar Hakkoum, Ali Idri, Ibtissam Abnane",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.107829"
    },
    {
        "id": 7415,
        "title": "An Efficient Noisy Label Learning Method with Semi-supervised Learning",
        "authors": "Jihee Kim, Sangki Park, Si-Dong Roh, Ki-Seok Chung",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589572.3589596"
    },
    {
        "id": 7416,
        "title": "Groundwater Quality Analysis by Integrating Water Quality Index, GIS Techniques and Supervised Machine Learning: A Case Study in Duhok Province, Iraq",
        "authors": "Hindreen Nazif",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24271/psr.2024.188474"
    },
    {
        "id": 7417,
        "title": "Study on predicting compressive strength of concrete using supervised machine learning techniques",
        "authors": "B. Vamsi Varma, E. V. Prasad, Sudhakar Singha",
        "published": "2023-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42107-023-00662-w"
    },
    {
        "id": 7418,
        "title": "Classifications on wine informatics using PCA, LDA, and supervised machine learning techniques",
        "authors": "Swarna Prabha Jena, Bijay Kumar Paikaray, Jitendra Pramanik, Rishi Thapa, Abhaya Kumar Samal",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwi.2023.130444"
    },
    {
        "id": 7419,
        "title": "Supervised Machine Learning Techniques for Power Consumption Usage Level Prediction",
        "authors": "Yi-Fei Tan, Ge-Zhi Zhao, Tze-Hang Cheeng, Chee-Pun Ooi, Wooi-Haw Tan, Soon-Nyean Cheong",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csecs60003.2023.10428312"
    },
    {
        "id": 7420,
        "title": "ABDpred: Prediction of active antimicrobial compounds using supervised machine learning techniques",
        "authors": "Santasabuj Das, Tanmoy Jana, Debasree Sarkar, Debayan Ganguli, SandipKumar Mukherjee, RahulShubhra Mandal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/ijmr.ijmr_1832_22"
    },
    {
        "id": 7421,
        "title": "A Review on IoT Intrusion Detection Systems Using Supervised Machine Learning: Techniques, Datasets, and Algorithms",
        "authors": "Azeez Rahman Abdulla, Noor Ghazi M. Jameel",
        "published": "2023-3-1",
        "citations": 5,
        "abstract": "Physical objects that may communicate with one another are referred to “things” throughout the Internet of Things (IoT) concept. It introduces a variety of services and activities that are both available, trustworthy and essential for human life. The IoT necessitates multifaceted security measures that prioritize communication protected by confidentiality, integrity and authentication services; data inside sensor nodes are encrypted and the network is secured against interruptions and attacks. As a result, the issue of communication security in an IoT network needs to be solved. Even though the IoT network is protected by encryption and authentication, cyber-attacks are still possible. Consequently, it’s crucial to have an intrusion detection system (IDS) technology. In this paper, common and potential security threats to the IoT environment are explored. Then, based on evaluating and contrasting recent studies in the field of IoT intrusion detection, a review regarding the IoT IDSs is offered with regard to the methodologies, datasets and machine learning (ML) algorithms. In This study, the strengths and limitations of recent IoT intrusion detection techniques are determined, recent datasets collected from real or simulated IoT environment are explored, high-performing ML methods are discovered, and the gap in recent studies is identified.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21928/uhdjst.v7n1y2023.pp53-65"
    },
    {
        "id": 7422,
        "title": "Classifications on wine informatics using PCA, LDA, and supervised machine learning techniques",
        "authors": "Rishi Thapa, Jitendra Pramanik, Bijay Kumar Paikaray, Swarna Prabha Jena, Abhaya Kumar Samal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwi.2023.10055314"
    },
    {
        "id": 7423,
        "title": "Breast cancer prediction using supervised machine learning techniques",
        "authors": "Pankaj Dadheech, Vijay Kalmani, Sanwta Ram Dogiwal, Vijay Kumar Sharma, Ankit Kumar, Saroj Kumar Pandey",
        "published": "2023",
        "citations": 0,
        "abstract": "Breast cancer is one of the most prevalent diseases in India’s urban regions and the second most common in the country’s rural parts. In India, a woman is diagnosed with breast cancer growth every four minutes, and a woman dies from breast cancer sickness every thirteen minutes. Over half of breast cancer patients in India are diagnosed with stage 3 or 4 illness, which has extremely low survival rates; hence, an urgent need exists for a rapid detection strategy. To forecast if a patient is at risk for breast cancer, we utilise the classification techniques of machine learning, in which the machine learning model learns from the previous information and can anticipate on the new information that is generated by the data. To create a model using Logistic Regression, Support Vector Machines, and Random Forests, this dataset was collected from the UCI repository and studied in this study. The primary goal is to improve the accuracy, precision, and sensitivity of all the algorithms that are used to categorise data in terms of the competency and viability of each and every algorithm. Random Forest has been shown to be the most accurate in classifying breast cancer, with a precision of 98.60 percent in tests. The Scientific Python Development Environment is used to carry out this machine learning study, which is written in the python programming language. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jios-1348"
    },
    {
        "id": 7424,
        "title": "A Comparison of Semi-Supervised Learning Techniques for Streaming ASR at Scale",
        "authors": "Cal Peyser, Michael Picheny, Kyunghyun Cho, Rohit Prabhavalkar, W. Ronny Huang, Tara N. Sainath",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095838"
    },
    {
        "id": 7425,
        "title": "A study on a semi-supervised learning using self-supervised learning",
        "authors": "Daehak Kim",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7465/jkdi.2023.34.6.967"
    },
    {
        "id": 7426,
        "title": "Naïve Bayes Supervised Learning based Physical Layer Authentication: Anti-Spoofing techniques for Industrial Radio Systems",
        "authors": "Andreas Weinand, Christoph Lipps, Michael Karrenbauer, Hans Dieter Schotten",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Physical Layer Security (PLS) based authentication schemes are an alternative to conventional security schemes such as e.g. certificates or Message Authentication Codes (MACs). They can provide a more lightweight solution compared to traditional cryptography in order to meet the requirement of secure data transmission. However, errors in Physical Layer Authentication (PLA) techniques can occur due to adverse influences resulting from PLS schemes such as receiver noise or fading channels. Skillfull methods are therefore required in order to detect anormal system behaviour. One promising solution are supervised classification schemes. The application of Naïve Bayes (NB) classifiers for PLA is therefore proposed and evaluated within this work. Prior to that, we analyse the resource efficiency within typical Ultra Reliable Low Latency Communication (URLLC) applications and conduct a security overhead analysis. We propose strategies in order to overcome the problem of missing training data from either the URLLC user or attacker node. A real world Software Defined Radio (SDR) based testbed using OFDM (Orthogonal Frequency Division Multiplexing) is implemented in order to evaluate the performance of NB based PLA. The measurements are conducted within the german campus network frequency band (LTE band 43). Further, we conduct a hyperparameter optimization (HPO) based on random search. The investigated classifiers show promising results in terms of authentication accuracy and Receiver Operating Characteristic (ROC) curve performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34190/iccws.18.1.983"
    },
    {
        "id": 7427,
        "title": "Supervised learning techniques for detection of Lung Carcinoma",
        "authors": "S K Jalall, K Harsha, K K Dutta, K Sarita, S Banik, N P Sakambari",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Abstract\nLung diseases are the most common ailments seen among people with the history of smoking. Prompt and timely recognition and diagnosis may help in saving many lives. In order to detect cancer at early stages machine learning algorithms can be employed. Use of simple machine learning algorithms will help identify the carcinoma faster with high accuracy and lesser expense. This work shows the use three of simple machine learning (ML) algorithms like Logistic Regression, Support Vector Machine (SVM), and K-Nearest Neighbours (KNN). ML models were built using lung cancer patients’ dataset. The dataset was used to train the model as well as test the model. The three classifiers will detect the presence of lung cancer. For each classifier the Accuracy, Mean Square Error(MSE), precision, and Recall (R2) was calculated. A comparative study of the classifiers was done to identify which among the three was the best one. The main objective of the paper is to identify the best efficient machine-learning algorithm in terms of confusion matrices, accuracy, and precision for the prediction and diagnosis of lung cancer",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2571/1/012004"
    },
    {
        "id": 7428,
        "title": "Analyzing credit card fraud cases with supervised machine learning methods: logistic regression and Naive Bayes",
        "authors": "Naila Habibullayeva,  , Behnam Kalejahi,  ",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "Frauds involving credit cards are simple and effortless to target. With the rise of online payment credit cards have had a huge role in our daily life and economy for the past two decades and it is an important task for companies to identify fraud and non-fraud transactions. As the number of credit cards grows every day and the volume of transactions increases quickly in tandem, fraudsters who wish to exploit this market for illegitimate gains have come to light. Nowadays, it’s quite easy to access anyone’s credit card information, which makes it simpler for card fraudsters to do their crimes. Thanks to advances in technology, it is now possible to determine whether information gained with malicious intent has been used by looking at the costs and time involved in altering account transactions. The Credit Card Fraud analysis data set, which is obtained from the Kaggle database, is used in the modeling process together with The Logistic regression method and Naive Bayes algorithms. Using the Knime platform, we are going to apply machine learning techniques to practical data in this study. The goal of this study is to identify who performed the transaction by examining the periods when people use their credit cards. The Logistic regression approach and the Naive Bayes method both had success rates of 99.83%, which is the highest. The two methods’ results are based on Cohen’s kappa, accuracy, precision, recall, and other metrics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25045/jpis.v15.i1.06"
    },
    {
        "id": 7429,
        "title": "Enhancing Time Series Classification with Self-Supervised Learning",
        "authors": "Ali Ismail-Fawaz, Maxime Devanne, Jonathan Weber, Germain Forestier",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011611300003393"
    },
    {
        "id": 7430,
        "title": "Comparative Analysis of Regression Techniques for Accurate House Price Prediction Using Machine Learning: A Statistical Analysis Method",
        "authors": "Tanu Patel, Jyoti Sahu, Malikharjuna Rao K",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbds58040.2023.10346417"
    },
    {
        "id": 7431,
        "title": "Semi-supervised estimation for the varying coefficient regression model",
        "authors": "Peng Lai, Wenxin Tian, Yanqiu Zhou",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract><p>In many cases, the 'labeled' outcome is difficult to observe and may require a complicated or expensive procedure, and the predictor information is easy to be obtained. We propose a semi-supervised estimator for the one-dimensional varying coefficient regression model which improves the conventional supervised estimator by using the unlabeled data efficiently. The semi-supervised estimator is proposed by introducing the intercept model and its asymptotic properties are proven. The Monte Carlo simulation studies and a real data example are conducted to examine the finite sample performance of the proposed procedure.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024004"
    },
    {
        "id": 7432,
        "title": "Telecom Churn Prediction Using Voting Classifier Ensemble Method and Supervised Machine Learning Techniques",
        "authors": "O. Pandithurai, Sriman B, Hrudhai Narayan S, Humaid Ahmed H",
        "published": "2023",
        "citations": 0,
        "abstract": "In the current fast-paced world, there are a lot of changes and developments in the telecom sector, due to which the telecom companies find themselves in difficulties in retaining the customers who have availed of their services. In order to solve this problem, churn prediction system is needed to predict customer churn. So far, there are many supervised machine learning churn prediction models that compare various machine learning and deep learning models, select one model, and create a whole churn prediction model. The solution proposed has various supervised machine learning models like Support Vector Machine (SVM), Random Forest Classifier, Decision Tree Classifier, and Logistic Regression Classifier and combine all the models together using an ensemble method called Voting Classifier to produce a single model that considers all the mentioned algorithms and produces an optimum result. The above-mentioned model will be trained by the telecom dataset containing the records of 7043 customers, and the target field is classified into churned and stayed. The machine learning algorithm is evaluated using various performance metrics such as the F1 score, precision, confusion matrix, classification report, and accuracy.As the result the churn prediction model has shown 84% accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/itmconf/20235605012"
    },
    {
        "id": 7433,
        "title": "Acoustic Sensing and Supervised Machine Learning for In Situ Classification of Semi-Autogenous (SAG) Mill Feed Size Fractions Using Different Feature Extraction Techniques",
        "authors": "Kwaku Boateng Owusu, William Skinner, Richmond K. Asamoah",
        "published": "2023-4-11",
        "citations": 4,
        "abstract": "The harsh and hostile internal environment of semi-autogenous (SAG) mills renders real-time monitoring of some critical variables practically unmeasured. Typically, feed size fractions are known to cause mill fluctuations and impede the consistent processing behaviour of ores. There is, therefore, the need for continuous monitoring of mill parameters for optimal operation. In this paper, an acoustic-based sensing method is employed to estimate, in real time, a snapshot of the different feed size fractions presented to a laboratory-scale SAG mill. Employing the MATLAB 2020b programme, the mill acoustic signal is processed using various transform techniques such as power spectral density estimate (PSDE) by Welch’s method, discrete wavelet transform (DWT), wavelet packet transform (WPT), empirical mode decomposition (EMD), and variational mode decomposition (VMD). Different fractional bandpowers are obtained from the PSDE spectrum, while the statistical root mean square values are further extracted from DWT, WPT, EMD, and VMD as feature vectors. The features are used as input features in different machine-learning classification algorithms for different mill feed size fractions predictions. The various transform techniques and feed size fraction predictions are evaluated using the various performance indicators obtained from the confusion matrix such as accuracy, precision, sensitivity and F1 score. The study showed that the acoustic signal feature extraction techniques used in conjunction with the Support Vector Machine (SVM), linear discriminant analysis (LDA), and ensemble with subclass discriminant machine learning algorithms demonstrated improved performance for predicting feed size variations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/powders2020018"
    },
    {
        "id": 7434,
        "title": "SupCon-ViT: Supervised contrastive learning for ultra-fine-grained visual categorization",
        "authors": "Xiaowei Lu, Xiaohan Yu, Kanqi Wang, Ying Wang, Peiyu Wang, Gang Liu, Yang Zhao, Yunhui Xiang, Yongsheng Gao, Xiaoyu Wu",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00046"
    },
    {
        "id": 7435,
        "title": "Towards Predicting Student’s Dropout in Higher Education Using Supervised Machine Learning Techniques",
        "authors": "Raven Miguel M. Capuno, Chester Juliane M. Ferrer, Brian Troy L. Manaloto, Sean Redd Villafria, James A. Esquivel",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/an13.20230654"
    },
    {
        "id": 7436,
        "title": "An analytical study on the detection of liver and liver tumors using supervised deep learning techniques",
        "authors": "N. Nanda Prakash, V. Rajesh, Sk Hasane Ahammad, Ali Badr Roomi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0185620"
    },
    {
        "id": 7437,
        "title": "A Supervised Machine Learning Approach for the Vehicle Routing Problem",
        "authors": "Sebastian Ammon, Frank Phillipson, Rui Almeida",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012430000003639"
    },
    {
        "id": 7438,
        "title": "Investigation of Machine Learning Regression Techniques to Predict Critical Heat Flux over a Large Parameter Space",
        "authors": "Emil Grosfilley, Gustav Robertson, Jerol Soibam, Jean-Marie Corre",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13182/nureth20-39985"
    },
    {
        "id": 7439,
        "title": "Optimisation and cross-validation of an e-hailing hybrid pricing algorithm using a supervised learning classification and regression tree model: a heuristic approach",
        "authors": "Mohammed Naeem Qureshi, Nor Azlinah Md. Lazam",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jksus.2024.103107"
    },
    {
        "id": 7440,
        "title": "Detection Of Fake Online Reviews Using Semi-Supervised And Supervised Learning",
        "authors": "G.Shaheen Firdous, G.Prathibha Priyadarshini, K.Bindu Sree, K. Yeshaswi",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jrtdd.v6i10s.2437"
    },
    {
        "id": 7441,
        "title": "Exposure on Semi-Supervised Regression with Generative Adversarial Networks",
        "authors": "M. Rajeswari, P Shyamala, P. Chitra",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452577"
    },
    {
        "id": 7442,
        "title": "A local spline regression-based framework for semi-supervised sparse feature selection",
        "authors": "Razieh Sheikhpour",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110265"
    },
    {
        "id": 7443,
        "title": "Count Regression and Machine Learning Techniques for Zero-Inflated Overdispersed Count Data: Application to Ecological Data",
        "authors": "Bonelwa Sidumo, Energy Sonono, Isaac Takaidza",
        "published": "2023-4-13",
        "citations": 2,
        "abstract": "AbstractThe aim of this study is to investigate the overdispersion problem that is rampant in ecological count data. In order to explore this problem, we consider the most commonly used count regression models: the Poisson, the negative binomial, the zero-inflated Poisson and the zero-inflated negative binomial models. The performance of these count regression models is compared with the four proposed machine learning (ML) regression techniques: random forests, support vector machines, $$k-$$\n\nk\n-\n\nnearest neighbors and artificial neural networks. The mean absolute error was used to compare the performance of count regression models and ML regression models. The results suggest that ML regression models perform better compared to count regression models. The performance shown by ML regression techniques is a motivation for further research in improving methods and applications in ecological studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40745-023-00464-6"
    },
    {
        "id": 7444,
        "title": "A Classification System of Career Guidance Questions Based on Natural Language Processing and Supervised Machine Learning Techniques",
        "authors": "Mohamed Amine Ouassil, Mouaad Errami, Rabia Rachidi, Soufiane Hamida, Bouchaib Cherradi, Abdelhadi Raihani",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iraset57153.2023.10152874"
    },
    {
        "id": 7445,
        "title": "Estimating plastic waste generation using supervised time-series learning techniques in Johannesburg, South Africa",
        "authors": "Olusola Olaitan Ayeleru, Lanre Ibrahim Fajimi, Matthew Adah Onu, Tarhemba Tobias Nyam, Sisanda Dlova, Victor Idankpo Ameh, Peter Apata Olubambi",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e28199"
    },
    {
        "id": 7446,
        "title": "Predicting Life Expectancy using Machine Learning Approach through Linear Regression and Decision Tree Classification Techniques",
        "authors": "Kanwarpartap Singh Gill, Vatsala Anand, Rahul Chauhan, Manish Sharma",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10441837"
    },
    {
        "id": 7447,
        "title": "PCIe Gen6 Physical Layer Equalization Tuning by Using Unsupervised and Supervised Machine Learning Techniques",
        "authors": "Francisco E. Rangel-Patiño, Andres Viveros-Wacher, Sofia D. Rodriguez-Saenz, José E. Rayas-Sánchez, Edgar A. Vega-Ochoa, Hemanth Shival",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lamc59011.2023.10375599"
    },
    {
        "id": 7448,
        "title": "Comparison of Regression Techniques and Integration Models Using Machine Learning",
        "authors": "Ashwani Kumar, Kavita Devi, Munish Katoch, Anup Sharma, Prikshat Kumar Angra, Siddhartha Bose, Mohd. Farhan, Pritpal Singh",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397945"
    },
    {
        "id": 7449,
        "title": "Android Ransomware Detection Using Supervised Machine Learning Techniques Based on Traffic Analysis",
        "authors": "Amnah Albin Ahmed, Afrah Shaahid, Fatima Alnasser, Shahad Alfaddagh, Shadha Binagag, Deemah Alqahtani",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "In today’s digitalized era, the usage of Android devices is being extensively witnessed in various sectors. Cybercriminals inevitably adapt to new security technologies and utilize these platforms to exploit vulnerabilities for nefarious purposes, such as stealing users’ sensitive and personal data. This may result in financial losses, discredit, ransomware, or the spreading of infectious malware and other catastrophic cyber-attacks. Due to the fact that ransomware encrypts user data and requests a ransom payment in exchange for the decryption key, it is one of the most devastating types of malicious software. The implications of ransomware attacks can range from a loss of essential data to a disruption of business operations and significant monetary damage. Artificial intelligence (AI)-based techniques, namely machine learning (ML), have proven to be notable in the detection of Android ransomware attacks. However, ensemble models and deep learning (DL) models have not been sufficiently explored. Therefore, in this study, we utilized ML- and DL-based techniques to build efficient, precise, and robust models for binary classification. A publicly available dataset from Kaggle consisting of 392,035 records with benign traffic and 10 different types of Android ransomware attacks was used to train and test the models. Two experiments were carried out. In experiment 1, all the features of the dataset were used. In experiment 2, only the best 19 features were used. The deployed models included a decision tree (DT), support vector machine (SVM), k-nearest neighbor (KNN), ensemble of (DT, SVM, and KNN), feedforward neural network (FNN), and tabular attention network (TabNet). Overall, the experiments yielded excellent results. DT outperformed the others, with an accuracy of 97.24%, precision of 98.50%, and F1-score of 98.45%. Whereas, in terms of the highest recall, SVM achieved 100%. The acquired results were thoroughly discussed, in addition to addressing limitations and exploring potential directions for future work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24010189"
    },
    {
        "id": 7450,
        "title": "Early prediction of chronic heart disease with recursive feature elimination and supervised learning techniques",
        "authors": "Komal Kumar Napa, Angati Kalyan Kumar, Sangeetha Murugan, Kamaluru Mahammad, Tsehay Admassu Assegie",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "<p>Chronic heart disease (CHD) is a common complication among patients suffering in the cardiological intensive care unit, often resulting in poor prognosis and high mortality. Early prediction of CHD can reduce mortality by preventing the severity of the disease. This study evaluated the efficacy of on recursive feature elimination for predicting CHD using supervised learning techniques for predicting CHD. The study employed 1190 Cleveland Hungarian CHD dataset. Different supervised learning techniques (support vector machine, decision tree, k-nearest neighbor, Naive Bayes, stochastic gradient descent, adaptive boosting, and multilayer perceptron) were used to study the efficacy of the recursive feature elimination. Chest pain type, sex, blood sugar level, angina, depression, and slope were associated with CHD occurrence. The accuracy of the K-nearest neighbor and decision tree model was 89.91% for the feature-selected dataset indicating good predictive ability. Ultimately, the support vector machine and logistic regression with the selected features exhibited good discriminatory ability for early prediction of CHD. Thus, the recursive feature elimination is a good approach to develop a a model with higher accuracy to predict CHD.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijai.v13.i1.pp730-736"
    },
    {
        "id": 7451,
        "title": "Human activity recognition using supervised machine learning techniques",
        "authors": "Marc Gelian E. Ante, Reggie Gustilo, Anna Sheila I. Crisostomo, Shakir Al Balushi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0194457"
    },
    {
        "id": 7452,
        "title": "An extensive survey on the use of supervised machine learning techniques in the past two decades for prediction of drug side effects",
        "authors": "Pranab Das, Dilwar Hussain Mazumder",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10462-023-10413-7"
    },
    {
        "id": 7453,
        "title": "Combining Self-Supervised and Supervised Learning with Noisy Labels",
        "authors": "Yongqi Zhang, Hui Zhang, Quanming Yao, Jun Wan",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10221957"
    },
    {
        "id": 7454,
        "title": "Seismic data denoising by combining self-supervised and supervised learning",
        "authors": "Yen Sun, Paul Williamson",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1190/image2023-3909418.1"
    },
    {
        "id": 7455,
        "title": "Safe co-training for semi-supervised regression",
        "authors": "Liyan Liu, Peng Huang, Hong Yu, Fan Min",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "Co-training is a popular semi-supervised learning method. The learners exchange pseudo-labels obtained from different views to reduce the accumulation of errors. One of the key issues is how to ensure the quality of pseudo-labels. However, the pseudo-labels obtained during the co-training process may be inaccurate. In this paper, we propose a safe co-training (SaCo) algorithm for regression with two new characteristics. First, the safe labeling technique obtains pseudo-labels that are certified by both views to ensure their reliability. It differs from popular techniques of using two views to assign pseudo-labels to each other. Second, the label dynamic adjustment strategy updates the previous pseudo-labels to keep them up-to-date. These pseudo-labels are predicted using the augmented training data. Experiments are conducted on twelve datasets commonly used for regression testing. Results show that SaCo is superior to other co-training style regression algorithms and state-of-the-art semi-supervised regression algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/ida-226718"
    },
    {
        "id": 7456,
        "title": "Semi-supervised Variational Autoencoders for Regression: Application to Soft Sensors",
        "authors": "Yilin Zhuang, Zhuobin Zhou, Burak Alakent, Mehmet Mercangöz",
        "published": "2023-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indin51400.2023.10218227"
    },
    {
        "id": 7457,
        "title": "Can deep neural networks outperform Fama-MacBeth regression and other supervised learning approaches in stock returns prediction with asset-pricing factors?",
        "authors": "Huei-Wen Teng, Yu-Hsien Li",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42521-023-00076-y"
    },
    {
        "id": 7458,
        "title": "Noise-Robust Semi-Supervised Learning for Distantly Supervised Relation Extraction",
        "authors": "Xin Sun, Qiang Liu, Shu Wu, Zilei Wang, Liang Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.876"
    },
    {
        "id": 7459,
        "title": "Comparison Slice Inverse Regression Method with Machine Learning Techniques in Multivariate Data",
        "authors": "Omar A. abd Alwahab,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "In this study, the research aims to use some methods that deal with several independent variables with a dependent variable, where two methods were used to deal with, which is the method of slice inverse regression (SIR), which is considered a non-classical method, and two methods of machine learning, which is (TLBO, PSO), which is most popular of the teaching methods machine learning, the work of (SIR), (TLBO, PSO) is based on making reduced linear combinations of a partial set of the original explanatory variables, which may suffer from the problem of heterogeneity and the problem of multicollinearity between most of the explanatory variables. These new combinations of linear compounds resulting from the two methods will reduce the largest number of explanatory variables to reach one or more new dimensions called the effective dimension. The root mean square error criterion will be used to compare the two methods to indicate the preference of the methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54216/ijns.200204"
    },
    {
        "id": 7460,
        "title": "Penerapan Algoritma Supervised Learning untuk Klasifikasi Program Keluarga Harapan",
        "authors": "Muhammad Syarif Hartawan, Moh. Erkamim, Sitti Rachmawati, Nirma Ceisa Santi, Legito Legito, Sepriano Sepriano",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Penelitian ini dimaksudkan untuk melakukan klasifikasi terhadap penerima bantuan Program Keluarga Harapan (PKH) Kota Pekanbaru dengan membandingkan tiga metode sekaligus yaitu K-Nearest Neighbor (KNN), Probalistic Neural Network (PNN) dan Naive Bayes Classifier (NBC).Atribut yang digunakan dalam proses klasifikasi adalah Jumlah Anak SD, Jumlah Anak SMP, Jumlah Ibu Hamil, dan Jumlah Anak dibawah lima tahun (Balita), atribut ini berdasarkan panduan Tim Nasional Penangulangan dan Penanganan Kemiskinan (TNP2K) Kementrian Sosial Republik Indonesia. Proses klasifikasi dilakukan terhadap Rumah Tangga Sangat Miskin (RTSM) sebagai data training dengan jumlah 450 data sebagai data testing dengan jumlah 10 data, sehingga dengan melakukan perbandingan didapatlah hasil akurasi yang bervariasi diantara ke-tiga metode. Metode Nave Bayes (NBC) memiliki hasil akurasi yanng paling tinggi dengan hasil akurasi 80%, yang dibandingkan dengan metode KNN 20% dan PNN 10% maka Metode Nave Bayes(NBC) ditetapkan menjadi metode terbaik untuk kasus pengklasifikasian program keluarga  harapan (PKH) Kota Pekanbaru.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v3i2.873"
    },
    {
        "id": 7461,
        "title": "Online Semi-supervised Pairwise Learning",
        "authors": "Majdi Khalid",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191489"
    },
    {
        "id": 7462,
        "title": "CoBERT: Self-Supervised Speech Representation Learning Through Code Representation Learning",
        "authors": "Chutong Meng, Junyi Ao, Tom Ko, Mingxuan Wang, Haizhou Li",
        "published": "2023-8-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1390"
    },
    {
        "id": 7463,
        "title": "Semantic Segmentation by Semi-Supervised Learning Using Time Series Constraint",
        "authors": "Takahiro Mano, Sota Kato, Kazuhiro Hotta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011721800003417"
    },
    {
        "id": 7464,
        "title": "Combined Unsupervised and Supervised Learning for Improving Chest X-Ray Classification",
        "authors": "Anca Ignat, Robert-Adrian Găină",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011793000003417"
    },
    {
        "id": 7465,
        "title": "Developing and microsimulating demographic dynamics for an integrated urban model: a comparison between logistic regression and machine learning techniques",
        "authors": "Mohamad Ali Khalil, Mahmudur Rahman Fatmi, Muntahith Orvin",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11116-024-10468-7"
    },
    {
        "id": 7466,
        "title": "Improving in-text citation reason extraction and classification using supervised machine learning techniques",
        "authors": "Imran Ihsan, Hameedur Rahman, Asadullah Shaikh, Adel Sulaiman, Khairan Rajab, Adel Rajab",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csl.2023.101526"
    },
    {
        "id": 7467,
        "title": "Surface response regression and machine learning techniques to predict the characteristics of pervious concrete using non-destructive measurement: Ultrasonic pulse velocity and electrical resistivity",
        "authors": "Navaratnarajah Sathiparan, Pratheeba Jeyananthan, Daniel Niruban Subramaniam",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2023.114006"
    },
    {
        "id": 7468,
        "title": "Comparative diesel engine performance and emission forecasting using extreme learning and quadratic regression techniques burning waste cooking biodiesel",
        "authors": "M.S. Gad, Ahmed Alenany",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijhydene.2024.02.099"
    },
    {
        "id": 7469,
        "title": "Scalable Semi-Supervised Graph Learning Techniques for Anti Money Laundering",
        "authors": "Md. Rezaul Karim, Felix Hermsen, Sisay Adugna Chala, Paola De Perthuis, Avikarsha Mandal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3383784"
    },
    {
        "id": 7470,
        "title": "Supervised machine learning-based multivariate regression of parallel closures for a high-collisionality deuterium-carbon plasma",
        "authors": "Min Uk Lee, Jeong-Young Ji, Hae June Lee",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Many plasmas of interest in laboratory experiments and space consist of multiple ion species. In tokamak edge plasmas, for instance, ionized impurities expelled from the vessel wall influence plasma transport. When describing multi-species plasmas using fluid equations, we need accurate closure relations to close the set of fluid equations. In this study, we introduce the development of fitting formulas for parallel closures using supervised machine learning, in conjunction with the recent closure theory [J.-Y. Ji, Plasma Phys. Controlled Fusion 65, 075014 (2023)], considering multi-ion collisions and arbitrary ion temperatures. We apply this approach to a high-collisionality deuterium-carbon plasma and demonstrate its effectiveness. The machine learning-based method for developing practical and accurate closures can be extended to a wider range of plasmas.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0167904"
    },
    {
        "id": 7471,
        "title": "A supervised learning regression method for the analysis of oral sensitivity of healthy individuals and patients with chemosensory loss",
        "authors": "Lala Chaimae Naciri, Mariano Mastinu, Melania Melis, Tomer Green, Anne Wolf, Thomas Hummel, Iole Tomassini Barbarossa",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "AbstractThe gustatory, olfactory, and trigeminal systems are anatomically separated. However, they interact cognitively to give rise to oral perception, which can significantly affect health and quality of life. We built a Supervised Learning (SL) regression model that, exploiting participants’ features, was capable of automatically analyzing with high precision the self-ratings of oral sensitivity of healthy participants and patients with chemosensory loss, determining the contribution of its components: gustatory, olfactory, and trigeminal. CatBoost regressor provided predicted values of the self-rated oral sensitivity close to experimental values. Patients showed lower predicted values of oral sensitivity, lower scores for measured taste, spiciness, astringency, and smell sensitivity, higher BMI, and lower levels of well-being. CatBoost regressor defined the impact of the single components of oral perception in the two groups. The trigeminal component was the most significant, though astringency and spiciness provided similar contributions in controls, while astringency was most important in patients. Taste was more important in controls while smell was the least important in both groups. Identifying the significance of the oral perception components and the differences between the two groups provide important information to allow for more targeted examinations supporting both patients and healthcare professionals in clinical practice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-44817-w"
    },
    {
        "id": 7472,
        "title": "IPCL: Iterative Pseudo-Supervised Contrastive Learning to Improve Self-Supervised Feature Representation",
        "authors": "Sonal Kumar, Anirudh Phukan, Arijit Sur",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447607"
    },
    {
        "id": 7473,
        "title": "Addressing data scarcity in protein fitness landscape analysis: A study on semi-supervised and deep transfer learning techniques",
        "authors": "José A. Barbero-Aparicio, Alicia Olivares-Gil, Juan J. Rodríguez, César García-Osorio, José F. Díez-Pastor",
        "published": "2024-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2023.102035"
    },
    {
        "id": 7474,
        "title": "Speech-Based Supervised Learning Towards the Diagnosis of Amyotrophic Lateral Sclerosis",
        "authors": "Ricardo Cebola, Duarte Folgado, André Carreiro, Hugo Gamboa",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011694700003414"
    },
    {
        "id": 7475,
        "title": "Forecasting Rice Production in Indonesia using Regression Techniques: A Comparative Analysis of Support Vector Machine, Linear Regression, and XGBoost Regression",
        "authors": "Erio Yoshino, Felix Indra Kurniadi, Budi Juarto",
        "published": "2023-9-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciss59129.2023.10291271"
    },
    {
        "id": 7476,
        "title": "Functional Validation of Supervised Learning Tasks for Reproducible Machine Learning",
        "authors": "Ayush Patel, Ramazan Aygun",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc59802.2024.00032"
    },
    {
        "id": 7477,
        "title": "Self-supervised Pre-training and Semi-supervised Learning for Extractive Dialog Summarization",
        "authors": "Yingying Zhuang, Jiecheng Song, Narayanan Sadagopan, Anurag Beniwal",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3543873.3587680"
    },
    {
        "id": 7478,
        "title": "Temporally Averaged Regression for Semi-Supervised Low-Light Image Enhancement",
        "authors": "Sunhyeok Lee, Donggon Jang, Dae-Shik Kim",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00443"
    },
    {
        "id": 7479,
        "title": "Penerapan Algoritma Supervised Learning untuk Klasifikasi Data Music Listening",
        "authors": "Eri Mardiani, Nur Rahmansyah, Ira Kurniati, Andy Setiawan, Diah Widiastuti, Muhammad Ridwan, Muhammad Zidan Rosyid, Ari Febriansyah",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "Perkembangan teknologi informasi semakin pesat hingga saat ini terus dikembangkan teknologi-teknologi terbaru, penggunaan data sebagai pengolahan kini semakin banyak diterapkan pada berbagai bidang, dengan penggunaan data dapat dilakukan perkembangan teknologi yang dapat meningkatkankan kualitas dan efisiensi, pengolahan data dapat diterapkan di semua bidang dan salah satunya adalah di bidang musik. Musik sudah menjadi bagian dari kehidupan manusia sehari-hari. Sudah banyak media-media yang menyajikan berbagai macam lagu dengan genre yang beragam pula mulai dari Pop, Jazz, Rock, R&B, dan genre-genre lainnya. Dengan  menggunakan data mining untuk mengolah data maupun menganalisis data-data musik kita dapat memprediksi keanekaragaman preferensi mendengarkan musik dan dengan menggunakan tools aplikasi Orange Data Mining dapat membantu masyarakat untuk mengetahui musik apa saja yang diminat dengan memprediksi melalui beberapa metode dalam tools orange, dengan Algoritma Naive Bayes memiliki tingkat akurasi yang lebih baik.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v3i2.879"
    },
    {
        "id": 7480,
        "title": "An active-learning-based, semi-supervised, support-vector-machine-learning algorithm",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/7-5-201"
    },
    {
        "id": 7481,
        "title": "Semi-supervised Review-Aware Rating Regression (Student Abstract)",
        "authors": "Xiangkui Lu, Jun Wu",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Semi-supervised learning is a promising solution to mitigate data sparsity in review-aware rating regression (RaRR), but it bears the risk of learning with noisy pseudo-labelled data. In this paper, we propose a paradigm called co-training-teaching (CoT2), which integrates the merits of both co-training and co-teaching towards the robust semi-supervised RaRR. Concretely, CoT2 employs two predictors and each of them alternately plays the roles of  \"labeler\" and \"validator\" to generate and validate pseudo-labelled instances. Extensive experiments show that CoT2 considerably outperforms state-of-the-art RaRR techniques, especially when training data is severely insufficient.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i13.26996"
    },
    {
        "id": 7482,
        "title": "Supervised Machine Learning for Recovering Implicit Implementation of Singleton Design Pattern",
        "authors": "Abir Nacef, Sahbi Bahroun, Adel Khalfallah, Samir Ben Ahmed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011836100003464"
    },
    {
        "id": 7483,
        "title": "LiDAR and Camera Based 3D Object Classification in Unknown Environments Using Weakly Supervised Learning",
        "authors": "Siva Bairaju, Srinivas Yalagam, Krishna Konda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011657700003411"
    },
    {
        "id": 7484,
        "title": "Speech Recognition for Indigenous Language Using Self-Supervised Learning and Natural Language Processing",
        "authors": "Satoshi Tamura, Tomohiro Hattori, Yusuke Kato, Naoki Noguchi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012396300003654"
    },
    {
        "id": 7485,
        "title": "Experimenting with Supervised Drift Detectors in Semi-supervised Learning",
        "authors": "José Luis Martínez Pérez, Roberto Souto Maior de Barros, Silas Garrido Teixeira de Carvalho Santos",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10371933"
    },
    {
        "id": 7486,
        "title": "Speech Emotion Recognition Using Transfer Learning and Self-Supervised Speech Representation Learning",
        "authors": "Babak Nasersharif, Marziye Azad",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icee59167.2023.10334799"
    },
    {
        "id": 7487,
        "title": "SSL2 Self-Supervised Learning meets semi-supervised learning: multiple clerosis segmentation in 7T-MRI from large-scale 3T-MRI",
        "authors": "Jiacheng Wang, Hao Li, Han Liu, Dewei Hu, Daiwei Lu, Keejin Yoon, Kelsey Barter, Francesca Bagnato, Ipek Oguz",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654522"
    },
    {
        "id": 7488,
        "title": "Exploring the Efficacy of Natural Language Processing and Supervised Learning in the Classification of Fake News Articles",
        "authors": "Jain R",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "This research article investigates the effectiveness of natural language processing (NLP) and supervised learning in classifying fake news articles. With the increasing prevalence of fake news in online media, it has become critical to identify and categorize such articles accurately. In this study, we apply NLP techniques to extract features from textual data, and use a supervised learning algorithm to train a classification model. We use a dataset of fake news articles to evaluate the performance of our model in terms of accuracy, precision, recall, and F1 score. Our results demonstrate that our approach achieved high accuracy and robustness in the classification of fake news articles. Furthermore, we perform a feature importance analysis to identify the most significant features that contribute to the classification of fake news. The findings of this study have practical implications for identifying and combating fake news in online media, and also provide insights into the effectiveness of NLP and supervised learning for text classification tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/art-16000108"
    },
    {
        "id": 7489,
        "title": "Wind turbine fault detection: a semi-supervised learning approach with two different dimensionality reduction techniques",
        "authors": "Rodrigo F. Toso, Eduardo Ogasawara, Fernando P.G. De Sá, Rafaelli De C. Coutinho, Diego Brand�ão",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijica.2023.10054513"
    },
    {
        "id": 7490,
        "title": "Self-Supervised Skill Learning for Semi-Supervised Long-Horizon Instruction Following",
        "authors": "Benhui Zhuang, Chunhong Zhang, Zheng Hu",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "Language as an abstraction for hierarchical agents is promising to solve compositional long-time horizon decision-making tasks. The learning of the agent poses significant challenges, as it typically requires plenty of trajectories annotated with languages. This paper addresses the challenge of learning such an agent under the scarcity of language annotations. One approach for leveraging unannotated data is to generate pseudo-labels for unannotated trajectories using sparse seed annotations. However, as the scenes of the environment and tasks assigned to the agent are diverse, the inference of language instructions is sometimes incorrect, causing the policy to learn to ground incorrect instructions to actions. In this work, we propose a self-supervised language-conditioned hierarchical skill policy (SLHSP) which utilizes unannotated data to learn reusable and general task-related skills to facilitate learning from sparse annotations. We demonstrate that the SLHSP that learned with less than 10% of annotated trajectories has a comparable performance to one that learned with 100% of annotated data. Our approach to the challenging ALFRED benchmark leads to a notable improvement in the success rate over a strong baseline also optimized for sparsely annotated data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12071587"
    },
    {
        "id": 7491,
        "title": "A Supervised Learning Regression Method for the Analysis of the Taste Functions of Healthy Controls and Patients with Chemosensory Loss",
        "authors": "Lala Chaimae Naciri, Mariano Mastinu, Melania Melis, Tomer Green, Anne Wolf, Thomas Hummel, Iole Tomassini Barbarossa",
        "published": "2023-7-28",
        "citations": 1,
        "abstract": "In healthy humans, taste sensitivity varies widely, influencing food selection and nutritional status. Chemosensory loss has been associated with numerous pathological disorders and pharmacological interventions. Reliable psychophysical methods are crucial for analyzing the taste function during routine clinical assessment. However, in the daily clinical routine, they are often considered too time-consuming. We used a supervised learning (SL) regression method to analyze with high precision the overall taste statuses of healthy controls (HCs) and patients with chemosensory loss, and to characterize the combination of responses that would best predict the overall taste statuses of the subjects in the two groups. The random forest regressor model allowed us to achieve our objective. The analysis of the order of importance of each parameter and their impact on the prediction of the overall taste statuses of the subjects in the two groups showed that salty (low-concentration) and sour (high-concentration) stimuli specifically characterized healthy subjects, while bitter (high-concentration) and astringent (high-concentration) stimuli identified patients with chemosensory loss. Although the present results require confirmation in studies with larger samples, the identification of such distinctions should be of interest to the health system because they may justify the use of specific stimuli during the routine clinical assessments of taste function and thereby reduce time and cost commitments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/biomedicines11082133"
    },
    {
        "id": 7492,
        "title": "Learning sample-aware threshold for semi-supervised learning",
        "authors": "Qi Wei, Lei Feng, Haoliang Sun, Ren Wang, Rundong He, Yilong Yin",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06425-7"
    },
    {
        "id": 7493,
        "title": "Assessing the impact of soiling on photovoltaic efficiency using supervised learning techniques",
        "authors": "Luiza Araujo Costa Silva, Luis Gonzaga Baca Ruiz, David Criado-Ramón, Joao Gabriel Bessa, Leonardo Micheli, María del Carmen Pegalajar Jiménez",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120816"
    },
    {
        "id": 7494,
        "title": "Soft computing techniques for predicting the properties of raw rice husk concrete bricks using regression-based machine learning approaches",
        "authors": "Nakkeeran Ganasen, L. Krishnaraj, Kennedy C. Onyelowe, George Uwadiegwu Alaneme, Obeten Nicholas Otu",
        "published": "2023-9-4",
        "citations": 10,
        "abstract": "AbstractIn this study, the replacement of raw rice husk, fly ash, and hydrated lime for fine aggregate and cement was evaluated in making raw rice husk-concrete brick. This study optimizes compressive strength, water absorption, and dry density of concrete brick containing recycled aggregates via Response Surface Methodology. The optimized model's accuracy is validated through Artificial Neural Network and Multiple Linear Regression. The Artificial Neural Network model captured the 100 data's variability from RSM optimization as indicated by the high R threshold- (R > 0.9997), (R > 0.99993), (R > 0.99997). Multiple Linear Regression model captured the data's variability the decent R2 threshold confirming- (R2 > 0.9855), (R2 > 0.9768), (R2 > 0.9155). The raw rice husk-concrete brick 28-day compressive strength, water absorption, and density prediction were more accurate when using Response Surface Methodology and Artificial Neural Network compared to Multiple Linear Regression. Lower MAE and RMSE, coupled with higher R2 values, unequivocally indicate the model's superior performance. Additionally, employing sensitivity analysis, the influence of the six input parameters on outcomes was assessed. Machine learning aids efficient prediction of concrete's mechanical properties, conserving time, labor, and resources in civil engineering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-41848-1"
    },
    {
        "id": 7495,
        "title": "NLP-LTU at SemEval-2023 Task 10: The Impact of Data Augmentation and Semi-Supervised Learning Techniques on Text Classification Performance on an Imbalanced Dataset",
        "authors": "Sana Al-Azzawi, György Kovács, Filip Nilsson, Tosin Adewumi, Marcus Liwicki",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.196"
    },
    {
        "id": 7496,
        "title": "Scalable Label-efficient Footpath Network Generation Using Remote Sensing Data and Self-supervised Learning",
        "authors": "Xinye Wanyan, Sachith Seneviratne, Kerry Nice, Jason Thompson, Marcus White, Nano Langenheim, Mark Stevenson",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00027"
    },
    {
        "id": 7497,
        "title": "Distributed Energy Resources Electric Profile Identification in Low Voltage Networks Using Supervised Machine Learning Techniques",
        "authors": "Andres F. Moreno Jaramillo, Javier Lopez-Lorente, David M. Laverty, Paul V. Brogan, Santiago H. Hoyos Velasquez, Jesus Martinez-Del-Rincón, Aoife M. Foley",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3247977"
    },
    {
        "id": 7498,
        "title": "Optimal Prediction of Heart Disease Using Machine Learning Techniques with Logistic Regression Model",
        "authors": "Ghulab Ahmad, Hira Fatima, Shafiullah Shafiullah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.24-3-2022.2318558"
    },
    {
        "id": 7499,
        "title": "Data-driven reference evapotranspiration (ET0) estimation: a comparative study of regression and machine learning techniques",
        "authors": "Jitendra Rajput, Man Singh, K. Lal, Manoj Khanna, A. Sarangi, J. Mukherjee, Shrawan Singh",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10668-023-03978-4"
    },
    {
        "id": 7500,
        "title": "Crop mapping using supervised machine learning and deep learning: a systematic literature review",
        "authors": "Mouad Alami Machichi, loubna El mansouri, yasmina imani, Omar Bourja, Ouiam Lahlou, Yahya Zennayi, François Bourzeix, Ismaguil Hanadé Houmma, Rachid Hadria",
        "published": "2023-4-18",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01431161.2023.2205984"
    },
    {
        "id": 7501,
        "title": "Semi-supervised visual anomaly detection based on convolutional autoencoder and transfer learning",
        "authors": "Jamal Saeedi, Alessandro Giusti",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100451"
    },
    {
        "id": 7502,
        "title": "Poster: BugOss: A Regression Bug Benchmark for Empirical Study of Regression Fuzzing Techniques",
        "authors": "Jeewoong Kim, Shin Hong",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icst57152.2023.00053"
    },
    {
        "id": 7503,
        "title": "Class Imbalanced Semi-Supervised Learning With Meta-Learning",
        "authors": "Yunyi Shi, Ming Zhang, Xin Zheng, Hongyu Chen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsi58851.2023.10303813"
    },
    {
        "id": 7504,
        "title": "Dynamic Spatio-temporal Access Queries using Semi-Supervised Regression",
        "authors": "Chris Conlan, Teddy Cunningham, Hakan Ferhatosmanoglu",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdew58674.2023.00031"
    }
]