[
    {
        "id": 21371,
        "title": "Understanding How Video Quality Affects Object Detection Algorithms",
        "authors": "Miloud Aqqa, Pranav Mantini, Shishir Shah",
        "published": "2019",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007401600002108"
    },
    {
        "id": 21372,
        "title": "Understanding How Video Quality Affects Object Detection Algorithms",
        "authors": "Miloud Aqqa, Pranav Mantini, Shishir Shah",
        "published": "2019",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007401600960104"
    },
    {
        "id": 21373,
        "title": "An Overview of Object Detection and Tracking Algorithms",
        "authors": "Kehao Du, Alexander Bobkov",
        "published": "2023-6-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/engproc2023033022"
    },
    {
        "id": 21374,
        "title": "Stereo 3D Object Detection Using a Feature Attention Module",
        "authors": "Kexin Zhao, Rui Jiang, Jun He",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Stereo 3D object detection remains a crucial challenge within the realm of 3D vision. In the pursuit of enhancing stereo 3D object detection, feature fusion has emerged as a potent strategy. However, the design of the feature fusion module and the determination of pivotal features in this fusion process remain critical. This paper proposes a novel feature attention module tailored for stereo 3D object detection. Serving as a pivotal element for feature fusion, this module not only discerns feature importance but also facilitates informed enhancements based on its conclusions. This study delved into the various facets aided by the feature attention module. Firstly, a interpretability analysis was conducted concerning the function of the image segmentation methods. Secondly, we explored the augmentation of the feature fusion module through a category reweighting strategy. Lastly, we investigated global feature fusion methods and model compression strategies. The models devised through our proposed design underwent an effective analysis, yielding commendable performance, especially in small object detection within the pedestrian category.",
        "link": "http://dx.doi.org/10.3390/a16120560"
    },
    {
        "id": 21375,
        "title": "Analysis of Object detection Method using Open CV – Python",
        "authors": "",
        "published": "2020-4-30",
        "citations": 1,
        "abstract": "Object detection is a very well-known computer technology connected with computer vision, image processing, data collection and character recognition that focuses on detection of any object or its instances of a certain class (such as humans, flowers, animals, number plates, vehicles etc.) presented in the form of digital images and videos. There are various applications on object detection that have been well researched including face detection & recognition, character recognition and prediction, and number plate detection. Object detection and recognition are used in very vast cases and scenarios including retrieval, surveillance, detection of over speeding of vehicles and a lot\nmore cases . In this research, various basic concepts used in object recognition and detection while making use of OpenCV library of python 3.8, increasing and improvising the efficiency & accuracy of object recognition and detection are presented",
        "link": "http://dx.doi.org/10.35291/2454-9150.2020.0326"
    },
    {
        "id": 21376,
        "title": "Enhanced 3D Point Cloud Object Detection with Iterative Sampling and Clustering Algorithms",
        "authors": "Shane Ward, Hossein Malekmohamadi",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010910600003124"
    },
    {
        "id": 21377,
        "title": "3D object detection",
        "authors": "Jianfeng Ren",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-8041-3_2"
    },
    {
        "id": 21378,
        "title": "Application of Split Coordinate Channel Attention Embedding U2Net in Salient Object Detection",
        "authors": "Yuhuan Wu, Yonghong Wu",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "Salient object detection (SOD) aims to identify the most visually striking objects in a scene, simulating the function of the biological visual attention system. The attention mechanism in deep learning is commonly used as an enhancement strategy which enables the neural network to concentrate on the relevant parts when processing input data, effectively improving the model’s learning and prediction abilities. Existing saliency object detection methods based on RGB deep learning typically treat all regions equally by using the extracted features, overlooking the fact that different regions have varying contributions to the final predictions. Based on the U2Net algorithm, this paper incorporates the split coordinate channel attention (SCCA) mechanism into the feature extraction stage. SCCA conducts spatial transformation in width and height dimensions to efficiently extract the location information of the target to be detected. While pixel-level semantic segmentation based on annotation has been successful, it assigns the same weight to each pixel which leads to poor performance in detecting the boundary of objects. In this paper, the Canny edge detection loss is incorporated into the loss calculation stage to improve the model’s ability to detect object edges. Based on the DUTS and HKU-IS datasets, experiments confirm that the proposed strategies effectively enhance the model’s detection performance, resulting in a 0.8% and 0.7% increase in the F1-score of U2Net. This paper also compares the traditional attention modules with the newly proposed attention, and the SCCA attention module achieves a top-three performance in prediction time, mean absolute error (MAE), F1-score, and model size on both experimental datasets.",
        "link": "http://dx.doi.org/10.3390/a17030109"
    },
    {
        "id": 21379,
        "title": "Object detection techniques and algorithms",
        "authors": "Shajulin Benedict",
        "published": "2022-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/978-0-7503-4024-3ch5"
    },
    {
        "id": 21380,
        "title": "Advanced Meteorite Identification through YOLO Object Detection Algorithms",
        "authors": "Aisha Alowais, Munya Alkhalifa, Salma Subhi, Ilias Fernini",
        "published": "No Date",
        "citations": 0,
        "abstract": "This study addresses the challenge of visually identifying meteorites from terrestrial rocks, traditionally a task for experts followed by chemical analysis. We propose a transformative approach using computer vision and machine learning, employing YOLO (You Only Look Once) object detection algorithms (versions 5, 6, 7, and 8), to overcome the bottleneck in expert availability for instantaneous classification. Leveraging a curated selection from the Sharjah Academy for Astronomy, Space Sciences, and Technology (SAASST) unique meteorite collection, we aim to differentiate meteorites from terrestrial rocks based on their surface features and characteristics. The collection comprises a diverse assemblage of approximately 8,000 objects such as iron meteorites, Martian meteorites, tektites, fulgurites, and more. Our methodology includes a comparative analysis of YOLO versions, focusing on precision, recall, and F1 scores to assess each algorithm's adaptability to the unique features of meteoritic material. Preliminary results indicate YOLOv5 as the most efficient compared to its previous versions, achieving a maximum mAP of 0.995 and correctly classifying 93% of test samples. This study aims to determine the optimal YOLO version for enhancing the accuracy and efficiency of meteorite classification. In addition, the selected optimal model will be deployed on a Jetson Nano processor aboard a drone, significantly enhancing onsite meteorite detection capabilities.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-14995"
    },
    {
        "id": 21381,
        "title": "Research Review of Object Detection Algorithms in Vehicle Detection",
        "authors": "Hao An, Kai Liu, Zhihong Liang, Mingming Qin, Yuxiang Huang, Zhichang Guo",
        "published": "2022-2-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eebda53927.2022.9744735"
    },
    {
        "id": 21382,
        "title": "Analyzing Object Detection Algorithms for Cyber Threat Scenario",
        "authors": "Aditya Kapoor",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4284372"
    },
    {
        "id": 21383,
        "title": "Moving Object Detection Using Deep Learning Algorithms",
        "authors": "Fareeha Mumtaz, Humaira Ashraf, NZ Jhanjhi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Moving object detection plays a crucial role in various applications, particularly in traffic surveillance and collision warning systems. However, the high cost of training and slow detection pose significant challenges to the practicality and real-time performance of existing methods. These challenges hinder the practicality and real-time performance of existing methods. The need for a reliable and efficient moving object detection system prompts the search for cost-effective strategies. Enhancing detection speed without sacrificing accuracy is crucial for real-time applications. Overcoming these challenges is essential to advance the field of moving object detection and improve its applicability in various domains. This paper presents a comprehensive review of the literature on moving object detection, proposes novel strategies to overcome the challenges of high training costs and slow detection. The study emphasizes the importance of reliable speed monitoring systems and advancements in control systems to enhance driver assistance on urban highways. Each frame in the dataset undergoes YOLOv6 processing to detect and classify objects, generating bounding box predictions and class probabilities. Optical flow, specifically the Lucas-Kanade method, is then utilized to compute motion vectors between consecutive frames. These motion vectors facilitate object tracking across frames, enabling refined bounding box positions and improving overall object tracking accuracy. The results demonstrate the effectiveness of the proposed technique in reducing training costs, improving detection speed, and maintaining a high level of accuracy when compared to existing methods. The paper concludes by summarizing the findings and highlighting the potential of the proposed strategy for precise and reliable moving object recognition in real-world traffic scenarios",
        "link": "http://dx.doi.org/10.20944/preprints202312.1589.v1"
    },
    {
        "id": 21384,
        "title": "USE OF YOLOV5 OBJECT DETECTION ALGORITHMS FOR INSECT DETECTION",
        "authors": "",
        "published": "2022-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33965/ac_icwi2022_202208c028"
    },
    {
        "id": 21385,
        "title": "Object Detection using Open CV and Deep Learning",
        "authors": "Channakeshnava Gowda S V",
        "published": "2022-5-18",
        "citations": 0,
        "abstract": "Object Detection using SSD (Single Shot Detector) and MobileNets is efficient because this technique detects objects quickly with fewer resources without sacrificing performance. In this, every class of item for which the classification algorithm has been trained generates a bounding box and an annotation describing that class of object. This provides the foundation for creating several types of analytical features such as the volume of traffic in a certain area over time or the entire population in an area is real-time detection and categorization of objects from video data. Keywords: Object Detection, OpenCV, SSD.",
        "link": "http://dx.doi.org/10.55041/ijsrem13199"
    },
    {
        "id": 21386,
        "title": "Comparative study of subset selection methods for rapid prototyping of 3D object detection algorithms",
        "authors": "Konrad Lis, Tomasz Kryjak",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Object detection in 3D is a crucial aspect in the context of autonomous vehicles and drones. However, prototyping detection algorithms is time-consuming and costly in terms of energy and environmental impact. To address these challenges, one can check the effectiveness of different models by training on a subset of the original training set. In this paper, we present a comparison of three algorithms for selecting such a subset - random sampling,  random per class sampling, and our proposed MONSPeC (Maximum Object Number Sampling per Class). We provide empirical evidence for the superior effectiveness of random per class sampling and MONSPeC over basic random sampling. By replacing random sampling with one of the more efficient algorithms, the results obtained on the subset are more likely to transfer to the results on the entire dataset. The code is available at: https://github.com/vision-agh/monspec.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23608335"
    },
    {
        "id": 21387,
        "title": "Comparative study of subset selection methods for rapid prototyping of 3D object detection algorithms",
        "authors": "Konrad Lis, Tomasz Kryjak",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Object detection in 3D is a crucial aspect in the context of autonomous vehicles and drones. However, prototyping detection algorithms is time-consuming and costly in terms of energy and environmental impact. To address these challenges, one can check the effectiveness of different models by training on a subset of the original training set. In this paper, we present a comparison of three algorithms for selecting such a subset - random sampling,  random per class sampling, and our proposed MONSPeC (Maximum Object Number Sampling per Class). We provide empirical evidence for the superior effectiveness of random per class sampling and MONSPeC over basic random sampling. By replacing random sampling with one of the more efficient algorithms, the results obtained on the subset are more likely to transfer to the results on the entire dataset. The code is available at: https://github.com/vision-agh/monspec.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23608335.v1"
    },
    {
        "id": 21388,
        "title": "Object detection algorithms",
        "authors": "Rafael G González-Acuña, Héctor A Chaparro-Romo, Israel Melendez-Montoya",
        "published": "2021-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/978-0-7503-3707-6ch4"
    },
    {
        "id": 21389,
        "title": "Real-Time Object Detection using Deep Learning and Open CV",
        "authors": "",
        "published": "2019-12-26",
        "citations": 3,
        "abstract": "The object detection is used in almost every realworld application such as autonomous traversal, visual system, face detection and even more. This paper aims at applying object detection technique to assist visually impaired people. It helps visually impaired people to know about the objects around them to enable them to walk free. A prototype has been implemented on a Raspberry PI 3 using OpenCV libraries, and satisfactory performance is achieved. In this paper, detailed review has been carried out on object detection using region – conventionaal neural network (RCNN) based learning systems for a real-world application. This paper explores the various process of detecting objects using various object detections methods and walks through detection including a deep neural network for SSD implemented using Caffe model.",
        "link": "http://dx.doi.org/10.35940/ijitee.l1103.10812s19"
    },
    {
        "id": 21390,
        "title": "An Analysis on Deep Learning Algorithms for Object Detection",
        "authors": "",
        "published": "2020-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.7/094"
    },
    {
        "id": 21391,
        "title": "3D Object Detection",
        "authors": "Jianfeng Ren, Dong Xia",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2897-2_2"
    },
    {
        "id": 21392,
        "title": "Study on Object Detection using Open CV - Python",
        "authors": "Bhumika Gupta, Ashish Chaube, Ashish Negi, Umang Goel",
        "published": "2017-3-15",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2017913391"
    },
    {
        "id": 21393,
        "title": "Comparison on Object Detection Algorithms: A Taxonomy",
        "authors": "Yi Han",
        "published": "2022-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iwecai55315.2022.00047"
    },
    {
        "id": 21394,
        "title": "Object Detection Algorithms: A Comparison",
        "authors": "Zhengkun Shi",
        "published": "2022-10-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccasit55263.2022.9986730"
    },
    {
        "id": 21395,
        "title": "Object Detection: Algorithms and Prospects",
        "authors": "Yinuo Cao, Haochen Wang",
        "published": "2022-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdacai57211.2022.00031"
    },
    {
        "id": 21396,
        "title": "Review Paper on Object Detection using Deep Learning- Understanding different Algorithms and Models to Design Effective Object Detection Network",
        "authors": "Prof. Jogi John",
        "published": "2019-3-31",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2019.3313"
    },
    {
        "id": 21397,
        "title": "Comparative Study of the Different Object Detection Algorithms: YOLOv4, SSD, and RCNN based on Accuracy and Speed",
        "authors": "Saurish Reddy Dirisala, Dileepkumar Padidem",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/sr231020230143"
    },
    {
        "id": 21398,
        "title": "A Comparative Study of Small Object Detection Algorithms",
        "authors": "Jianhang Wang, Sitan Jiang, Wenjie Song, Yi Yang",
        "published": "2019-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/chicc.2019.8865157"
    },
    {
        "id": 21399,
        "title": "Analysis based on object detection algorithms",
        "authors": "Puran Lyu",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "With the increasing demand for intelligent systems capable of comprehending visual information, the discipline of image object detection has experienced rapid expansion. Despite the fact that numerous methods have been proposed, the existing literature lacks exhaustive analyses and summaries of these methods. This paper seeks to address this deficiency by providing a thorough overview and analysis of image object detection techniques. This paper analyzes and discusses traditional methods and deep learning-based methods, with a focus on analyzing the current state and shortcomings of traditional methods. Further discussion is given to deep network-based object detection methods, mainly through a comparative analysis of two-stage and one-stage methods. The basic performance of the You Look Only Once (YOLO) series methods is highlighted. The contribution of large-scale datasets and evaluation metrics to the advancement of the state of the art is also examined. This comprehensive analysis is a useful reference for researchers who aim to contribute to the continual progress of image object detection.",
        "link": "http://dx.doi.org/10.54254/2755-2721/20/20231066"
    },
    {
        "id": 21400,
        "title": "Combination of Algorithms for Object Detection in Videos on Basis of Background Subtraction and Color Histograms: A Case Study",
        "authors": "Theo Gabloffsky, Ralf Salomon",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009832904640470"
    },
    {
        "id": 21401,
        "title": "Object detection and object classification using machine learning Algorithms",
        "authors": "Dora Racheed, Rahmatullah Muin, Ahmed Jaylan",
        "published": "2020-7-31",
        "citations": 0,
        "abstract": "Urban objects are characterized by a very variable representation in terms of shape, texture and color. In addition, they are present multiple times on the images to be analyzed and can be stuck to each other. To carry out the automatic localization and recognition of the different objects we propose to use supervised learning approaches. Due to their characteristics, urban objects are difficult to detect and conventional detection approaches do not offer satisfactory performance. We proposed the use of a wide margin separator network (SVM) in order to better merge the information from the different resolutions and therefore to improve the representativeness of the urban object. The use of an SVM network makes it possible to improve performance but at a significant computational cost. We then proposed to use an activation path making it possible to reduce complexity without losing efficiency. This path will activate the network sequentially and stop the exploration when the probability of detecting an object is high. In the case of a location based on the extraction of characteristics then the classification, the computational reduction is a factor of five. Subsequently, we have shown that we can combine the SVM network with feature maps from convolutional neural networks.",
        "link": "http://dx.doi.org/10.52502/ijitas.v2i3.12"
    },
    {
        "id": 21402,
        "title": "Moving Object Detection and Tracking",
        "authors": "Yu-Jin Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-7580-6_5"
    },
    {
        "id": 21403,
        "title": "Comparative Analysis and Evaluation of Single vs Multi-Detector Object Detection Algorithms for Abandoned Pet Detection in Natural Environments",
        "authors": "Oluwakemi Akinwehinmi, Pedro Arnau del Amo, Franscesc Solsona",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4496307"
    },
    {
        "id": 21404,
        "title": "A Fast Approach to Texture-Less Object Detection Based on Orientation Compressing Map and Discriminative Regional Weight",
        "authors": "Hancheng Yu, Haibao Qin, Maoting Peng",
        "published": "2018-12-12",
        "citations": 2,
        "abstract": "This paper presents a fast algorithm for texture-less object recognition, which is designed to be robust to cluttered backgrounds and small transformations. At its core, the proposed method demonstrates a two-stage template-based procedure using an orientation compressing map and discriminative regional weight (OCM-DRW) to effectively detect texture-less objects. In the first stage, the proposed method quantizes and compresses all the orientations in a neighborhood to obtain the orientation compressing map which then is used to generate a set of possible object locations. To recognize the object in these possible object locations, the second stage computes the similarity of each possible object location with the learned template by using discriminative regional weight, which can effectively distinguish different categories of objects with similar parts. Experiments on publiclyavailable, texture-less object datasets indicate that apart from yielding efficient computational performance, the proposed method also attained remarkable recognition rates surpassing recent state-of-the-art texture-less object detectors in the presence of high-clutter, occlusion and scale-rotation changes. It improves the accuracy and speed by 8% and 370% respectively, relative to the previous best result on D-Textureless dataset.",
        "link": "http://dx.doi.org/10.3390/a11120201"
    },
    {
        "id": 21405,
        "title": "Two novel graph theory based algorithms for salient object detection",
        "authors": "Subhashree Abinash",
        "published": "2018-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccaa.2018.8777626"
    },
    {
        "id": 21406,
        "title": "A Comparative Analysis of Object Detection Algorithms in Naturalistic Driving Videos",
        "authors": "Ce Zhang, Azim Eskandarian",
        "published": "2021-11-1",
        "citations": 3,
        "abstract": "Abstract\nIntelligent vehicle research has been rapidly developing. Object detection is one of the most critical study areas for intelligent vehicle’s driving safety. This paper conducts a comparative analysis for two popular real-time object detection algorithms: Yolo-v4 and deconvolutional single shot multibox detector (DSSD) under a naturalistic driving environment. An 80-classes COCO dataset trains each neural network at first, then fine-tuned by the BDD100k dataset. The detection results are compared by True/False Positive Results, Precision-Recall Curve, and average precision @ intersection of union 50 and average precision @ intersection of union 75 results. According to the analysis results, the Yolo-v4 outperforms the DSSD algorithm in bad weather, nighttime conditions, and small object detections. The Yolo-v4 and DSSD mean average precision for the BDD dataset is 22.63 and 11.86, respectively. The Yolo-v4 precision is 90.81% better than the DSSD algorithm, proving that the Yolo-v4 is a better fit for real-world driving environment studies.",
        "link": "http://dx.doi.org/10.1115/imece2021-69975"
    },
    {
        "id": 21407,
        "title": "Research on algorithms based on object detection",
        "authors": "Zeshun Zhang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Object detection technology is a hot research direction in computer vision field technology, which is broadly used in face recognition, vehicle navigation, aviation and other important fields, with broad development prospects. In recent years, object detection algorithms based on deep learning have also appeared as computer science technology has advanced quickly. Comparing modern object detecting algorithms to conventional ones, this algorithm has gradually highlighted the advantages of high precision and good real-time performance. This article reviews traditional object detection algorithms, and focuses on the HOG algorithm of traditional object detection, reviews deep learning-based two-stage and one-stage object identification systems and weighs the benefits and drawbacks of each. A summary and outlook for the future object detection algorithm development is also provided.",
        "link": "http://dx.doi.org/10.54254/2755-2721/19/20231024"
    },
    {
        "id": 21408,
        "title": "Object Detection Algorithms - A Review",
        "authors": "Marek Letavay, Michael Bažant, Pavel Tuček",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccairo58903.2023.00014"
    },
    {
        "id": 21409,
        "title": "A Review: Object Detection Algorithms",
        "authors": "Simranjit Bhumbla, D K Gupta,  Nisha",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176865"
    },
    {
        "id": 21410,
        "title": "Performance Analysis of Edge Detection Algorithms for Object Detection in Accident Images",
        "authors": "P. Joyce Beryl Princess, Salaja Silas, Elijah Blessing Rajsingh",
        "published": "2019-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gcat47503.2019.8978438"
    },
    {
        "id": 21411,
        "title": "Uncertainty Characterization for 3D Object Detection Algorithms",
        "authors": "Bao Ming Ding, Yixin Huangfu, Saeid Habibi",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itec55900.2023.10186985"
    },
    {
        "id": 21412,
        "title": "Object Fetching UAV using Autonomous Flight and Object Detection Algorithms",
        "authors": "Aarya Harkare, Dr. Rupesh C. Jaiswal",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Abstract: Autonomous UAVs (Unmanned Aerial Vehicles) are being used in various applications around the world like surveillance and aerial security, construction, agriculture, delivery, etc. These applications require heavy duty UAVs with high payload capacity and long battery life. The aim of this project is to use the principles of autonomous flight and object detection for indoor autonomous flight with the target to fetch and deliver lightweight objects with minimum energy and time consumption to create a viable prototype for indoor applications like delivering objects to bedridden patients, smart home applications, warehouse management and more.",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.55692"
    },
    {
        "id": 21413,
        "title": "Survey on Object Detection Framework: Evolution of Algorithms",
        "authors": "Yogitha. R, G. Mathivanan",
        "published": "2021-12-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca52323.2021.9675888"
    },
    {
        "id": 21414,
        "title": "A REVIEW OF OBJECT DETECTION ALGORITHMS BASED ON DEEP LEARNING",
        "authors": "",
        "published": "2023-5-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets39161"
    },
    {
        "id": 21415,
        "title": "Algorithms for Flying Object Detection",
        "authors": "J. Janousek, J. Novotny, P. Marcon, A. Siruckova, R. Kadlec",
        "published": "2018-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/piers.2018.8598196"
    },
    {
        "id": 21416,
        "title": "Exploration on Computer Vision Object Detection Algorithms Under Artificial Intelligence",
        "authors": "Wei Qian",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmnwc60182.2023.10435813"
    },
    {
        "id": 21417,
        "title": "Advances in Object Detection Algorithms – A Brief Survey",
        "authors": "Santosh Kumar Jha",
        "published": "2022-1-19",
        "citations": 0,
        "abstract": "One of the key senses mankind has always desired to impart to an Intelligent system is Computer Vision, as it enables the system to sense its environment, automatically understand the context and decide whether to take the next action or not. This action can be observation, navigation, motion, manoeuvre, etc., Over the last few decades, we have seen tremendous advances in object detection, and with the advent of Deep learning it is possible to accurately process images/videos, classify, segment, and detect all the objects in the environment, leading to contextual understanding of the image/video for further actions to be taken based on the context. In this paper I explore the various advances made in Object Detection and present how algorithms have evolved over time, giving us near accurate outcomes. In this I evaluate key algorithms before the invent of CNNs and then few after them. I also explore the one-stage and two-stage algorithms including R-CNN family of algorithms, YOLO algorithms, and few others. I start with an overview of object detection and the stages involved, discuss a brief working of the algorithm and showcase its detection accuracy results, offering the advantages and disadvantages of a specific algorithm. Post 2014, with deep learning coming to the fore, object detection has transformed computer’s ability to classify, and today’s algorithms offer very high accuracy in detection as they heavily deploy selective search algorithms combining multiple low-level image features with high-level context. Selective search algorithms assist in extracting ROI (Region of Interest) creating a boundary around the object and for each ROI, SVM (Support Vector Machine) classifiers are used to determine the type of object in the ROI. R-CNN and YOLO models have varied applications in the field of tracking",
        "link": "http://dx.doi.org/10.55041/ijsrem11467"
    },
    {
        "id": 21418,
        "title": "COMPARISON OF VARIOUS DEEP LEARNING ALGORITHMS USED FOR OBJECT DETECTION",
        "authors": "",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets40073"
    },
    {
        "id": 21419,
        "title": "Drone Object Detection Using Deep Learning Algorithms",
        "authors": "Aswini N, Uma S V",
        "published": "2021-9-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icirca51532.2021.9544983"
    },
    {
        "id": 21420,
        "title": "Video Compression for Object Detection Algorithms",
        "authors": "Leonardo Galteri, Marco Bertini, Lorenzo Seidenari, Alberto Del Bimbo",
        "published": "2018-8",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr.2018.8546064"
    },
    {
        "id": 21421,
        "title": "Performance metrics with operational context for video object detection algorithms",
        "authors": "Yoldas Ataseven",
        "published": "2022-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2636106"
    },
    {
        "id": 21422,
        "title": "Drone-View Object Detection Based on the Improved YOLOv5",
        "authors": "Yanzhao Yang",
        "published": "2022-2-25",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eebda53927.2022.9744741"
    },
    {
        "id": 21423,
        "title": "Performance Analysis of Various Algorithms In 2D Dynamic Object Detection",
        "authors": "Sarath Mohan, Adarsh S",
        "published": "2022-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iprecon55716.2022.10059528"
    },
    {
        "id": 21424,
        "title": "A Review on Object Detection Algorithms for Ship Detection",
        "authors": "Safa Mohammed Sali, N L Manisha, Gnana King, K Vidya Mol",
        "published": "2021-3-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaccs51430.2021.9441801"
    },
    {
        "id": 21425,
        "title": "Enhanced Safety Implementation in 5S+1 via Object Detection Algorithms",
        "authors": "Mohammad Shahin, F. Frank Chen, Ali Hosseinzadeh, Hamid Khodadadi Koodiani, Hamed Bouzary",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nScholarly work points to 5S+1, a simple yet powerful method of initiating quality in manufacturing, as one of the foundations of Lean manufacturing and the Toyota Production Systems. The 6th S, safety, is often used to prevent future occupational hazards, therefore, reducing the loss of time, money, and human resources.\nThis paper aims to show how Industry 4.0 technologies such as computer-based vision and object detection algorithms can help implement the 6th S in 5S+1 through monitoring and detecting workers who fail to adhere to standard safety practices such as wearing Personal Protective Equipment (PPE). The paper evaluated and analyzed three different detection approaches and compared their performance metrics. In total, seven models were proposed to perform such a task. All the proposed models utilized You-Only-Look-Once (YOLO v7) architecture to verify workers' PPE compliance. In approach I, three models were used to detect workers, safety helmets and safety vests. Then, a machine learning algorithm was used to verify if each detected worker is in PPE compliance. In approach II, the model simultaneously detects individual workers and verifies PPE compliance. In approach III, three different models were used to detect workers in the input feed. Then, a deep learning algorithm was used to verify the safety. All models were trained on Pictor-v3 dataset. It is found that the third approach, when utilizing VGG-16 algorithm, achieves the best performance, i.e., 80% F1 score, and can process 11.79 Frames per Second (FPS), making it suitable for real-time detection.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2222994/v1"
    },
    {
        "id": 21426,
        "title": "Object Detection in Fog Computing Using Machine Learning Algorithms",
        "authors": "Peyakunta Bhargavi, Singaraju Jyothi",
        "published": "2022-5-13",
        "citations": 0,
        "abstract": "The moment we live in today demands the convergence of the cloud computing, fog computing, machine learning, and IoT to explore new technological solutions. Fog computing is an emerging architecture intended for alleviating the network burdens at the cloud and the core network by moving resource-intensive functionalities such as computation, communication, storage, and analytics closer to the end users. Machine learning is a subfield of computer science and is a type of artificial intelligence (AI) that provides machines with the ability to learn without explicit programming. IoT has the ability to make decisions and take actions autonomously based on algorithmic sensing to acquire sensor data. These embedded capabilities will range across the entire spectrum of algorithmic approaches that is associated with machine learning. Here the authors explore how machine learning methods have been used to deploy the object detection, text detection in an image, and incorporated for better fulfillment of requirements in fog computing. ",
        "link": "http://dx.doi.org/10.4018/978-1-6684-6291-1.ch026"
    },
    {
        "id": 21427,
        "title": "Object Detection Algorithms Based on Convolutional Neural Networks",
        "authors": "Zihan Deng, Ang Li",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "Object detection is a fundamental and challenging task in computer vision, and it has attracted much attention from researchers worldwide. In recent years, deep learning technology has made remarkable progress and enabled new possibilities for object detection. Convolutional neural networks (CNNs), which are powerful tools for feature extraction and representation learning, have become the dominant approach for object detection, surpassing the traditional methods. This article reviews the development history of CNNs and their applications to object detection. It also introduces and compares two main branches of CNN-based object detection algorithms: region-based methods, which use a two-stage pipeline to first generate candidate regions and then classify them, and regression-based methods, which directly predict the bounding boxes and labels of objects in a single stage. Finally, it summarizes the current state-of-the-art and discusses the future directions of object detection research.",
        "link": "http://dx.doi.org/10.54097/vyfg4e34"
    },
    {
        "id": 21428,
        "title": "COMPARATIVE ANALYSIS OF OBJECT DETECTION ALGORITHMS FOR SIGN LANGUAGE RECOGNITION SYSTEM",
        "authors": "",
        "published": "2022-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets30269"
    },
    {
        "id": 21429,
        "title": "Computational Comparison of Deep Learning Algorithms for Object Detection",
        "authors": "Vasileios Balafas, Nikolaos Ploskas",
        "published": "2021-11-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3503823.3503838"
    },
    {
        "id": 21430,
        "title": "Task Distribution of Object Detection Algorithms in Fog-Computing Framework",
        "authors": "Sia Hee Nee, Hermawan Nugroho",
        "published": "2020-9-27",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/scored50371.2020.9251038"
    },
    {
        "id": 21431,
        "title": "Object Detection Algorithms Compression CNN, YOLO and SSD",
        "authors": "Shreyas Pagare, Rakesh Kumar",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2023922726"
    },
    {
        "id": 21432,
        "title": "Research on Novel Lightweight Object Detection and Recognition Algorithms",
        "authors": "Qi He, Hao Shen, Yang Jin",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00100"
    },
    {
        "id": 21433,
        "title": "Application of Computer Vision Algorithms in Image Recognition and Object Detection",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajcis.2024.070109"
    },
    {
        "id": 21434,
        "title": "Polycythemia with testosterone therapy increases CV risk",
        "authors": "Tim Dean",
        "published": "2022-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/tre.0030073"
    },
    {
        "id": 21435,
        "title": "Automatic Threat Object Detection from THz Images using Artificial Intelligence Algorithms",
        "authors": "A. Mercy Latha, A. S. Nirmala Devi",
        "published": "2023-4-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ivec56627.2023.10156906"
    },
    {
        "id": 21436,
        "title": "Improving Deep Object Detection Algorithms for Game Scenes",
        "authors": "Minji Jung, Heekyung Yang, Kyungha Min",
        "published": "2021-10-17",
        "citations": 0,
        "abstract": "The advancement and popularity of computer games make game scene analysis one of the most interesting research topics in the computer vision society. Among the various computer vision techniques, we employ object detection algorithms for the analysis, since they can both recognize and localize objects in a scene. However, applying the existing object detection algorithms for analyzing game scenes does not guarantee a desired performance, since the algorithms are trained using datasets collected from the real world. In order to achieve a desired performance for analyzing game scenes, we built a dataset by collecting game scenes and retrained the object detection algorithms pre-trained with the datasets from the real world. We selected five object detection algorithms, namely YOLOv3, Faster R-CNN, SSD, FPN and EfficientDet, and eight games from various game genres including first-person shooting, role-playing, sports, and driving. PascalVOC and MS COCO were employed for the pre-training of the object detection algorithms. We proved the improvement in the performance that comes from our strategy in two aspects: recognition and localization. The improvement in recognition performance was measured using mean average precision (mAP) and the improvement in localization using intersection over union (IoU).",
        "link": "http://dx.doi.org/10.3390/electronics10202527"
    },
    {
        "id": 21437,
        "title": "Performance Evaluation of Real-Time Object Detection Algorithms",
        "authors": "Sanun Srisuk, Chanwit Suwannapong, Songrit Kitisriworapan, Apiwut Kaewsong, Surachai Ongkittikul",
        "published": "2019-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ieecon45304.2019.8938687"
    },
    {
        "id": 21438,
        "title": "Efficient pedestrian detection with enhanced object segmentation in far IR night vision",
        "authors": "Karol Piniarski, Pawel Pawlowski",
        "published": "2017-9",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/spa.2017.8166857"
    },
    {
        "id": 21439,
        "title": "Physically realizable adversarial examples for convolutional object detection algorithms",
        "authors": "David R. Chambers, Harold A. Garza",
        "published": "2019-5-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2520166"
    },
    {
        "id": 21440,
        "title": "Regression Classification",
        "authors": "",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781394209118.ch8"
    },
    {
        "id": 21441,
        "title": "OkkhorNama: BdSL Image Dataset For Real Time Object Detection Algorithms",
        "authors": "Dipon Talukder, Fatima Jahara, Suvadra Barua, Md. Mokammel Haque",
        "published": "2021-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tensymp52854.2021.9550907"
    },
    {
        "id": 21442,
        "title": "Detecting Criminal Activities From CCTV by using Object Detection and machine Learning Algorithms",
        "authors": "Surbhi Singla, Raman Chadha",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205699"
    },
    {
        "id": 21443,
        "title": "Understanding Deep Learning Algorithms for Object Detection and Recognition",
        "authors": "S Suriya, Rajesh Harinarayanan Rajasekar, S. Mercy Shalinie",
        "published": "2019-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoac48765.2019.247137"
    },
    {
        "id": 21444,
        "title": "Object Detection Algorithms for Video Surveillance Applications",
        "authors": "Apoorva Raghunandan,  Mohana, Pakala Raghav, H. V. Ravish Aradhya",
        "published": "2018-4",
        "citations": 101,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccsp.2018.8524461"
    },
    {
        "id": 21445,
        "title": "Object Detection in Autonomous Vehicles under Adverse Weather: A Review of Traditional and Deep Learning Approaches",
        "authors": "Noor Ul Ain Tahir, Zuping Zhang, Muhammad Asim, Junhong Chen, Mohammed ELAffendi",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Enhancing the environmental perception of autonomous vehicles (AVs) in intelligent transportation systems requires computer vision technology to be effective in detecting objects and obstacles, particularly in adverse weather conditions. Adverse weather circumstances present serious difficulties for object-detecting systems, which are essential to contemporary safety procedures, infrastructure for monitoring, and intelligent transportation. AVs primarily depend on image processing algorithms that utilize a wide range of onboard visual sensors for guidance and decisionmaking. Ensuring the consistent identification of critical elements such as vehicles, pedestrians, and road lanes, even in adverse weather, is a paramount objective. This paper not only provides a comprehensive review of the literature on object detection (OD) under adverse weather conditions but also delves into the ever-evolving realm of the architecture of AVs, challenges for automated vehicles in adverse weather, the basic structure of OD, and explores the landscape of traditional and deep learning (DL) approaches for OD within the realm of AVs. These approaches are essential for advancing the capabilities of AVs in recognizing and responding to objects in their surroundings. This paper further investigates previous research that has employed both traditional and DL methodologies for the detection of vehicles, pedestrians, and road lanes, effectively linking these approaches with the evolving field of AVs. Moreover, this paper offers an in-depth analysis of the datasets commonly employed in AV research, with a specific focus on the detection of key elements in various environmental conditions, and then summarizes the evaluation matrix. We expect that this review paper will help scholars to gain a better understanding of this area of research.",
        "link": "http://dx.doi.org/10.3390/a17030103"
    },
    {
        "id": 21446,
        "title": "Artificial Intelligence Algorithms For Object Detection and Recognition In video and Images",
        "authors": "Prabakar Dakshinamoorthy, Gnanajeyaraman Rajaram, Shruti garg, Prabhu Murugan, A. Manimaran, Ramesh Sundar",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe usage of machine learning and deep learning algorithms have necessitated Artificial Intelligence'. AI is aimed at automating things by limiting human interference. It is widely used in IT, healthcare, finance, and agriculture. It is achieved through several deep learning algorithms that reflect the human brain's intelligence. These AI algorithms can be manipulated according to changing needs and improved efficiency. This paper tries to utilize the developments made in AI technology to classify the images and recognize the objects present in them. One widely used AI algorithm is CNN (Convolutional Neural Networks). The CNN is a deep learning-based algorithm that consists of various layers that extract and filters the parameters present in the images. Some additional layers of ResNet50 and the CNN algorithm are used to extract the parameters to improve image recognition accuracy. The image dataset taken for training and testing the proposed model is imageNet. The images are initially processed before sending them to the proposed model. The proposed model is trained, validated, and tested through the images obtained after the initial processing. The same process is repeated several times until getting the maximum accuracy. The accuracy of the proposed model in terms of image recognition is recorded. The obtained results are compared with other image classification algorithms like VGG16 and VGG19. It is concluded that the proposed model outperforms other traditional methods in terms of accuracy.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3849848/v1"
    },
    {
        "id": 21447,
        "title": "Object detection algorithms applied on low voltage grid equipment",
        "authors": "M. El Harras, C. Birkle, S. Sallaud, J. Bruschi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/icp.2023.1083"
    },
    {
        "id": 21448,
        "title": "Traffic Scene Object Detection Algorithm Based on Improved SSD",
        "authors": "Jiaming Mao, Hongwei Gao",
        "published": "2022-10-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ahpcai57455.2022.10087787"
    },
    {
        "id": 21449,
        "title": "Object Detection Technology of Substation Patrol Robot Based on mYOLO Algorithms",
        "authors": "Yonggang Zhang, Wenqiang Li, Feng Shen",
        "published": "2020-10-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icma49215.2020.9233751"
    },
    {
        "id": 21450,
        "title": "H-YoLov3: High performance object detection applied to assisted driving",
        "authors": "Liang Li, Xiaoli Li",
        "published": "2022-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cacml55074.2022.00084"
    },
    {
        "id": 21451,
        "title": "Measuring Reliability of Object Detection Algorithms for Automated Driving Perception Tasks",
        "authors": "Huanzhong Xu, Jose Blanchet, Marcos Paul Gerardo-Castro, Shreyasha Paudel",
        "published": "2021-12-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wsc52266.2021.9715295"
    },
    {
        "id": 21452,
        "title": "A Detailed Review on Object Detection Algorithms",
        "authors": "Sonia Setia, Akshat Shukla, Amartya Raj, Abhimanyu Rathore",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoei56765.2023.10125764"
    },
    {
        "id": 21453,
        "title": "2D and 3D object detection algorithms from images: A Survey",
        "authors": "Wei Chen, Yan Li, Zijian Tian, Fan Zhang",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.array.2023.100305"
    },
    {
        "id": 21454,
        "title": "Object detection algorithm based on lightweight convolutional neural networks for mobile devices",
        "authors": "Xuan Chen",
        "published": "2022-5-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2636421"
    },
    {
        "id": 21455,
        "title": "Motion Images Object Detection Over Voice Using Deep Learning Algorithms",
        "authors": "P. L. Chithra, J. Yasmin Banu",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003424550-5"
    },
    {
        "id": 21456,
        "title": "UAS-Based Real-Time Detection of Red-Cockaded Woodpecker Cavities in Heterogeneous Landscapes Using YOLO Object Detection Algorithms",
        "authors": "Brett Lawrence, Emerson de Lemmus, Hyuk Cho",
        "published": "2023-2-5",
        "citations": 3,
        "abstract": "In recent years, deep learning-based approaches have proliferated across a variety of ecological studies. Inspired by deep learning’s emerging prominence as the preferred tool for analyzing wildlife image datasets, this study employed You Only Look Once (YOLO), a single-shot, real-time object detection algorithm, to effectively detect cavity trees of Red-cockaded Woodpeckers or RCW (Dryobates borealis). In spring 2022, using an unmanned aircraft system (UAS), we conducted presence surveys for RCW cavity trees within a 1264-hectare area in the Sam Houston National Forest (SHNF). Additionally, known occurrences of RCW cavity trees outside the surveyed area were aerially photographed, manually annotated, and used as a training dataset. Both YOLOv4-tiny and YOLOv5n architectures were selected as target models for training and later used for inferencing separate aerial photos from the study area. A traditional survey using the pedestrian methods was also conducted concurrently and used as a baseline survey to compare our new methods. Our best-performing model generated an mAP (mean Average Precision) of 95% and an F1 score of 85% while maintaining an inference speed of 2.5 frames per second (fps). Additionally, five unique cavity trees were detected using our model and UAS approach, compared with one unique detection using traditional survey methods. Model development techniques, such as preprocessing images with tiling and Sliced Aided Hyper Inferencing (SAHI), proved to be critical components of improved detection performance. Our results demonstrated the two YOLO architectures with tiling and SAHI strategies were able to successfully detect RCW cavities in heavily forested, heterogenous environments using semi-automated review. Furthermore, this case study represents progress towards eventual real-time detection where wildlife managers are targeting small objects. These results have implications for more achievable conservation goals, less costly operations, a safer work environment for personnel, and potentially more accurate survey results in environments that are difficult using traditional methods.",
        "link": "http://dx.doi.org/10.3390/rs15040883"
    },
    {
        "id": 21457,
        "title": "A Review and Evaluation of Novel Object Detection Algorithms for Autonomous Driving",
        "authors": "Ketan Anand, Kanupriya Anand",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306906"
    },
    {
        "id": 21458,
        "title": "A Comparative Study of Object Detection using YOLO and SSD Algorithms",
        "authors": "Dinesh Suryavanshi",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "One of the most significant and difficult areas of computer vision is object detection, which is used in many aspects of daily life, including security monitoring, autonomous vehicle operation, and so on, to find instances of semantic objects belonging to a particular class. In this survey, we first look at the current approaches of typical detection models and discuss the benchmark datasets in order to comprehensively and deeply comprehend the major development status of the object detection pipeline. This project explains how convolutional neural network-based deep learning techniques are used for object detection. In this study, deep learning methods for cutting-edge object identification systems are evaluated. Any kind of visual medium is represented by a computer as a collection of numerical numbers. In order to inspect the contents of images, they need image processing techniques. In order to determine which is the quickest and most effective object detection algorithm, this research analyzes two popular algorithms: Single Shot Detection (SSD) and You Only Look Once (YOLO). The COCO (Common Object in Context) dataset is used in this comparative research to assess the effectiveness of the two algorithms and to analyze their strengths and weaknesses in terms of factors like accuracy, precision, and speed. Based on the findings analysis, it can be said that YOLO-v3 outperforms SSD in the same testing scenario. Keywords- Object Detection, Deep learning, CNN, COCO, YOLO, SSD",
        "link": "http://dx.doi.org/10.55041/ijsrem25639"
    },
    {
        "id": 21459,
        "title": "Wheat ear detection based on one-stage object detector",
        "authors": "Jing Zhan",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.3006000"
    },
    {
        "id": 21460,
        "title": "An Extensive Review on Recent Evolutions in Object Detection Algorithms",
        "authors": "Nandhini S",
        "published": "2020-7-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30534/ijeter/2020/140872020"
    },
    {
        "id": 21461,
        "title": "Survey of Real-Time Object Detection for Logo Detection System",
        "authors": "Amarja Indapwar, Jaytrilok Choudhary, Dhirendra Pratap Singh",
        "published": "2021",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-2248-9_7"
    },
    {
        "id": 21462,
        "title": "Survey of Object Detection Algorithms and Techniques",
        "authors": "Kamya Desai, Siddhanth Parikh, Kundan Patel, Pramod Bide, Sunil Ghane",
        "published": "2020",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-1632-0_23"
    },
    {
        "id": 21463,
        "title": "Guideline update says no to aspirin in primary CV prevention",
        "authors": "Tim Dean",
        "published": "2023-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/tre.0030138"
    },
    {
        "id": 21464,
        "title": "YOLO: A Competitive Analysis of Modern Object Detection Algorithms for Road Defects Detection Using Drone Images",
        "authors": "Amit Hasan Sadhin, Siti Zaiton Mohd Hashim, Hussein Samma, Nurulaqilla Khamis",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": " \nEfficient identification of road defects is a critical concern for road safety and infrastructure upkeep. This research employs drone-captured imagery and advanced object detection algorithms to expedite defect recognition, with a specific focus on determining the optimal algorithm for prompt and precise detection. The importance of timely road defect detection, crucial for mitigating potential hazards, remains central. A comprehensive comparative analysis of contemporary object detection algorithms, encompassing YOLOv5s, YOLOv5m, YOLOv5l, YOLOv5x, and YOLOv7. The results of this study highlight YOLOv7 as the most efficient, with a notable mAP of 68.3%, closely followed by YOLOv5l (66.8%), YOLOv5m (66.3%), YOLOv5x (66%), and YOLOv5s (63%). The integration of drone-derived imagery, capturing distinct gradients, significantly enhances defect detection accuracy. Beyond road safety, this study offers valuable insights to computer vision and machine learning practitioners. By bridging technological innovation with practical implementation, it holds potential to advance road safety and transportation infrastructure quality and the use of revolutionary drone technology.",
        "link": "http://dx.doi.org/10.21123/bsj.2023.9027"
    },
    {
        "id": 21465,
        "title": "Three Applications of Deep Learning Algorithms for Object Detection in Satellite Imagery",
        "authors": "Milena Napiorkowska, David Petit, Paula Marti",
        "published": "2018-7",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/igarss.2018.8518102"
    },
    {
        "id": 21466,
        "title": "Object Detection Algorithms with Deep Learning: An Overview",
        "authors": "Wei Tang, Jinlong Chen, Yi Ning, Kejian Xu",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435579"
    },
    {
        "id": 21467,
        "title": "Memory-Efficient Graph Convolutional Networks for Object Classification and Detection with Event Cameras",
        "authors": "Kamil Jeziorek, Andrea Pinna, Tomasz Kryjak",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/spa59660.2023.10274464"
    },
    {
        "id": 21468,
        "title": "Parametric Object Detection Using Estimation of Distribution Algorithms",
        "authors": "Ivan Cruz-Aceves, Jesus Guerrero-Turrubiates, Juan Manuel Sierra-Hernandez",
        "published": "2017-10-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315154152-4"
    },
    {
        "id": 21469,
        "title": "Abundant Semantic Information Module for Object Detection",
        "authors": "Taida Wu, Qishen Li, Qiufeng Li, Jun Gao",
        "published": "2022-10-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ahpcai57455.2022.10087653"
    },
    {
        "id": 21470,
        "title": "Edge Computing-Based Crime Scene Object Detection from Surveillance Video Using Deep Learning Algorithms",
        "authors": "R J Anandhi",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220800"
    }
]