[
    {
        "id": 6305,
        "title": "Special Issue: Intelligent Healthcare and Biometric Applications using Deep Learning",
        "authors": "",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/idt-230001"
    },
    {
        "id": 6306,
        "title": "A comprehensive survey of deep learning algorithms and applications in dental radiograph analysis",
        "authors": "Suvarna Bhat, Gajanan K. Birajdar, Mukesh D. Patil",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100282"
    },
    {
        "id": 6307,
        "title": "Deep Reinforcement Learning in Healthcare and Bio-Medical Applications",
        "authors": "Payal Thakur, Navjot Singh Talwandi",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486549"
    },
    {
        "id": 6308,
        "title": "A survey on deep learning for medical healthcare: Techniques and applications",
        "authors": "Kumari Archana, Amandeep Kaur",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0179980"
    },
    {
        "id": 6309,
        "title": "Intelligent data deduplication with Deep Transfer Learning Enabled Classification Model for Cloud-based Healthcare System",
        "authors": "N. Mageshkumar, L. Lakshmanan",
        "published": "2023-4",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.119257"
    },
    {
        "id": 6310,
        "title": "Deep learning-based network intrusion detection in smart healthcare enterprise systems",
        "authors": "Vinayakumar Ravi",
        "published": "2023-10-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17300-x"
    },
    {
        "id": 6311,
        "title": "Deep Federated Learning for IoT to Improve Healthcare Operations",
        "authors": "Haya Elayan, Moayad Aloqaily, Mohsen Guizani",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idsta58916.2023.10317828"
    },
    {
        "id": 6312,
        "title": "A Survey of the Interpretability Aspect of Deep Learning Models",
        "authors": "Eliot Spitzer, Rona Miles",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "Deep neural networks have attained near-human degree of quality in images, textual, audio, and video recording categorization and predictions tasks. The networks, on the other hand, are still typically thought of as black-box functional probabilistic models that transfer an input data to a trained classifier. Integrating these systems into mission-critical activities like clinical diagnosis, scheduling, and management is the next stage in this human-machine evolutionary change, and it necessitates a degree of confidence in the technology output. Statistical measures are often employed to estimate an output's volatility. The idea of trust, on the other hand, is dependent on a human's sight into a machine's inner workings. To put it another way, the neural networks must justify its outputs in a way that is intelligible to humans, leading to new insights into its internal workings. \"Interpretable deep networks\" is the name we give to such networks. The concept of interpretability is not one-dimensional. Indeed, the variability of an interpretation owing to varying degrees of human comprehension necessitates the existence of a plethora of characteristics that together define interpretability. Furthermore, the model's interpretations may be expressed in terms of low-level network variables or input properties. We describe several of the variables that are helpful for model interpretability in this study, as well as previous work on those dimensions. We do a gap analysis to determine what remains to be improved to increase models interpretability as step of the procedure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/0088/jbsha202303006"
    },
    {
        "id": 6313,
        "title": "Applications of Deep Learning and Machine Learning in Healthcare Domain – A Literature Review",
        "authors": "Et al. Beschi I S",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "In recent years, Artificial Intelligence (AI) has advanced rapidly in terms of software algorithms, hardware implementation, and implementations in a wide range of fields. The latest advances in AI applications in biomedicine, such as disease diagnostics, living assistance, biomedical information processing, and biomedical science, are summarised in this study. Brain-Computer Interfaces (BCIs), Arterial Spin Labeling (ASL) imaging, ASL-MRI, biomarkers, Natural Language Processing (NLP), and various algorithms all help to reduce errors and monitor disease progression. Computer-assisted diagnosis, decision support systems, expert systems, and software implementation can help doctors reduce intra- and inter-observer variability. In this paper, numerous researchers conduct a systematic literature review on the application and implementation of Machine Learning, Deep Learning, and Artificial Intelligence in the healthcare industry.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i11.9107"
    },
    {
        "id": 6314,
        "title": "Innovative feature-driven machine learning and deep learning for finance, education, and healthcare",
        "authors": "Luca Parisi, Marianne Lyne Manaog",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08543-8"
    },
    {
        "id": 6315,
        "title": "Deep Learning and Medical Image Processing Techniques for Diabetic Retinopathy: A Survey of Applications, Challenges, and Future Trends",
        "authors": "Posham Uppamma, Sweta Bhattacharya",
        "published": "2023-2-2",
        "citations": 12,
        "abstract": "Diabetic retinopathy (DR) is a common eye retinal disease that is widely spread all over the world. It leads to the complete loss of vision based on the level of severity. It damages both retinal blood vessels and the eye’s microscopic interior layers. To avoid such issues, early detection of DR is essential in association with routine screening methods to discover mild causes in manual initiation. But these diagnostic procedures are extremely difficult and expensive. The unique contributions of the study include the following: first, providing detailed background of the DR disease and the traditional detection techniques. Second, the various imaging techniques and deep learning applications in DR are presented. Third, the different use cases and real-life scenarios are explored relevant to DR detection wherein deep learning techniques have been implemented. The study finally highlights the potential research opportunities for researchers to explore and deliver effective performance results in diabetic retinopathy detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/2728719"
    },
    {
        "id": 6316,
        "title": "iSmartYog: A Real Time Yoga Pose Recognition and Correction Feedback Model Using Deep Learning for Smart Healthcare",
        "authors": "Hukam Chand Saini",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsses58299.2023.10201061"
    },
    {
        "id": 6317,
        "title": "Machine Learning and Deep Learning Transforming Healthcare: An Extensive Exploration of Applications, Algorithms, and Prospects",
        "authors": "L.A. Anto Gracious, R. Megiba Jasmine, E. Pooja, T.P. Anish, G. Johncy, R. Siva Subramanian",
        "published": "2023-10-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353476"
    },
    {
        "id": 6318,
        "title": "A comparative study of retrieval-based and generative-based chatbots using Deep Learning and Machine Learning",
        "authors": "Sumit Pandey, Srishti Sharma",
        "published": "2023-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100198"
    },
    {
        "id": 6319,
        "title": "Retracted: Deep Learning in Healthcare System for Quality of Service",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9781931"
    },
    {
        "id": 6320,
        "title": "Big data analytics in healthcare environment using chaotic red deer optimizer with deep learning for disease classification model",
        "authors": "R. Hendra Kumar, Gurram Sunitha",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18239-3"
    },
    {
        "id": 6321,
        "title": "Deep Learning Applications and Challenges for Healthcare System: A Review",
        "authors": "Shuaib Ahmed, Arifa Bhutto, Farhan Bashir",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Deep Learning is recent biz word in artificial intelligent as well as it is the third wave of artificial intelligence research. World is rapidly growing toward the automation almost every sector is going automated their services, products and industry through AI. The recent research is indicating that deep learning application and challenges for healthcare system is big challenge although so many improvement and advancement in healthcare system in the past few decades. In the recent covid_19 pandemic has indicated so many loop holes in the healthcare automation system worldwide. Our discussion focused on deep learning automation healthcare system. This paper aims to provide to identify the more challenges and application of deep learning in healthcare system, as automation and ease of system is forever directly comparative to success of any system. Our work will enable researchers and professionals to know deep learning application challenges in healthcare system critical analysis on tools proposed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58921/ijaims.v1i2.34"
    },
    {
        "id": 6322,
        "title": "Bringing intelligence to Edge/Fog in Internet of Things‐based healthcare applications: Machine learning/deep learning‐based use cases",
        "authors": "Hela Makina, Asma Ben Letaifa",
        "published": "2023-6",
        "citations": 3,
        "abstract": "SummaryInternet of things and smart medical applications are deeply changing the way healthcare is delivered worldwide. A typical Internet of Things (IoT)‐based eHealth system includes medical sensors for data collection, access network to transmit data, and Cloud servers for data processing and storage. Machine learning/deep learning (ML/DL) have proven to be a powerful tool for data classification, disease prognosis, and diagnosis and even medication prescription. ML/DL models need a large amount of data and significant computational and storage capacities especially for the training phase. Deploying ML/DL algorithms in the Cloud can be effectively done due to the processing and storage power of Cloud data centers. However, it raises many issues related to the availability, latency, energy consumption, bandwidth, security, and privacy. Recently, there is a growing interest to run as much processing as possible nearer the data sources, in the Edge, to compensate the Cloud‐based solutions limitations. In this paper, we propose to investigate the benefits of using IoT, ML/DL, and Edge Computing to enhance healthcare applications. Then, we are going to review the main approaches and trends for executing ML/DL in the Edge, to give their benefits and limitations, and draw finally conclusions about existing research issues.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/dac.5484"
    },
    {
        "id": 6323,
        "title": "Deep reinforcement learning for multi-class imbalanced training: applications in healthcare",
        "authors": "Jenny Yang, Rasheed El-Bouri, Odhran O’Donoghue, Alexander S. Lachapelle, Andrew A. S. Soltan, David W. Eyre, Lei Lu, David A. Clifton",
        "published": "2023-11-28",
        "citations": 3,
        "abstract": "AbstractWith the rapid growth of memory and computing power, datasets are becoming increasingly complex and imbalanced. This is especially severe in the context of clinical data, where there may be one rare event for many cases in the majority class. We introduce an imbalanced classification framework, based on reinforcement learning, for training extremely imbalanced data sets, and extend it for use in multi-class settings. We combine dueling and double deep Q-learning architectures, and formulate a custom reward function and episode-training procedure, specifically with the capability of handling multi-class imbalanced training. Using real-world clinical case studies, we demonstrate that our proposed framework outperforms current state-of-the-art imbalanced learning methods, achieving more fair and balanced classification, while also significantly improving the prediction of minority classes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06481-z"
    },
    {
        "id": 6324,
        "title": "Detection of Adversarial Attacks against the Hybrid Convolutional Long Short-Term Memory Deep Learning Technique for Healthcare Monitoring Applications",
        "authors": "Albatul Albattah, Murad A. Rassam",
        "published": "2023-6-3",
        "citations": 2,
        "abstract": "Deep learning (DL) models are frequently employed to extract valuable features from heterogeneous and high-dimensional healthcare data, which are used to keep track of patient well-being via healthcare monitoring systems. Essentially, the training and testing data for such models are collected by huge IoT devices that may contain noise (e.g., incorrect labels, abnormal data, and incomplete information) and may be subject to various types of adversarial attacks. Therefore, to ensure the reliability of the various Internet of Healthcare Things (IoHT) applications, the training and testing data that are required for such DL techniques should be guaranteed to be clean. This paper proposes a hybrid convolutional long short-term memory (ConvLSTM) technique to assure the reliability of IoHT monitoring applications by detecting anomalies and adversarial content in the training data used for developing DL models. Furthermore, countermeasure techniques are suggested to protect the DL models against such adversarial attacks during the training phase. An experimental evaluation using the public PhysioNet dataset demonstrates the ability of the proposed model to detect anomalous readings in the presence of adversarial attacks that were introduced in the training and testing stages. The evaluation results revealed that the model achieved an average F1 score of 97% and an accuracy of 98%, despite the introduction of adversarial attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13116807"
    },
    {
        "id": 6325,
        "title": "A deep neural network and machine learning approach for retinal fundus image classification",
        "authors": "Rohit Thanki",
        "published": "2023-11",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100140"
    },
    {
        "id": 6326,
        "title": "A Comprehensive Review of Healthcare Prediction using Data Science with Deep Learning",
        "authors": "Asha Latha Thandu, Pradeepini Gera",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141268"
    },
    {
        "id": 6327,
        "title": "HealthCare Chatbot Using NLP Techniques and Deep Learning Algorithm",
        "authors": "Narayana Darapaneni, Deepthi V, Divya Chowdaiah, Anwesh Reddy Paduri, Shashank P Raikar, Ramyasri R, Sunil Bhagwat, Mahesh Deshpande",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.102"
    },
    {
        "id": 6328,
        "title": "Optimizing healthcare system by amalgamation of text processing and deep learning: a systematic review",
        "authors": "Somiya Rani, Amita Jain",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15539-y"
    },
    {
        "id": 6329,
        "title": "Artificial Rabbits Optimizer with Deep Learning Model for Blockchain-Assisted Secure Smart Healthcare System",
        "authors": "Mousa Mohammed Khubrani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140998"
    },
    {
        "id": 6330,
        "title": "Detecting Data Poisoning Attacks in Federated Learning for Healthcare Applications Using Deep Learning",
        "authors": " Alaa Hamza Omran,  Sahar Yousif Mohammed, Mohammad Aljanabi",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "This work presents a novel method for securing federated learning in healthcare applications, focusing on skin cancer classification. The suggested solution detects and mitigates data poisoning attacks using deep learning and CNN architecture, specifically VGG16. In a federated learning architecture with ten healthcare institutions, the approach ensures collaborative model training while protecting sensitive medical data. Data is meticulously prepared and preprocessed using the Skin Cancer MNIST: HAM10000 dataset. The federated learning approach uses VGG16's powerful feature extraction to classify skin cancer. A robust strategy for spotting data poisoning threats in federated learning is presented in the study. Outlier detection techniques and strict criteria flag andevaluate problematic model modifications. Performance evaluation proves the model's accuracy, privacy, and datapoisoning resilience. This research presents federated learning-based skin cancer categorization for healthcareapplications that is secure and accurate. The suggested approach improves healthcare diagnostics and emphasizesdata security and privacy in federated learning settings by tackling data poisoning attacks. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.52866/ijcsm.2023.04.04.018"
    },
    {
        "id": 6331,
        "title": "A Cloud Collaborative Healthcare Platform Based on Deep Learning in The Segmentation of Maxillary Sinus",
        "authors": "Yen-Hsun Li, Zheng-You Huang, Yen-Kun Lin",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.847-858"
    },
    {
        "id": 6332,
        "title": "Deep Learning Based Diabetes Classification and Prediction for Healthcare Applications Using Advanced Genetic Optimization",
        "authors": "V. Selvi, G. Saraswathi, R. Indumathi, N. Palanivel, S. Reshma, R. Subiksha",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscan58655.2023.10394940"
    },
    {
        "id": 6333,
        "title": "A novel deep learning graph attention network for Alzheimer’s disease image segmentation",
        "authors": "Md Easin Hasan, Amy Wagler",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100310"
    },
    {
        "id": 6334,
        "title": "Retracted: Spine Medical Image Segmentation Based on Deep Learning",
        "authors": "",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9810950"
    },
    {
        "id": 6335,
        "title": "Data Sensitive Safety Framework for Big data analysis in Healthcare using Deep Learning",
        "authors": "",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.4.nq22338"
    },
    {
        "id": 6336,
        "title": "A forecasting approach for hospital bed capacity planning using machine learning and deep learning with application to public hospitals",
        "authors": "Younes Mahmoudian, Arash Nemati, Abdul Sattar Safaei",
        "published": "2023-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100245"
    },
    {
        "id": 6337,
        "title": "Deep Learning in Healthcare",
        "authors": "Shengkun Hu",
        "published": "2023-7-11",
        "citations": 1,
        "abstract": "This article aims to discuss and demonstrate deep learning techniques used in healthcare. After introducing the feasibility of deep learning in the medical field, the article discussed the opportunities and challenges of deep learning in healthcare from different perspectives. Then, the article showed the current implementations and applications of deep learning in the medical healthcare system. Finally, the article summarizes deep learning techniques and applications in healthcare.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v57i.10014"
    },
    {
        "id": 6338,
        "title": "A secured energy aware resource allocation and task scheduling based on improved cuckoo search algorithm and deep reinforcement learning for e-healthcare applications",
        "authors": "S. Palani, K. Rameshbabu",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100988"
    },
    {
        "id": 6339,
        "title": "A real-time deep learning approach for classifying cervical spine fractures",
        "authors": "Showmick Guha Paul, Arpa Saha, Md Assaduzzaman",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100265"
    },
    {
        "id": 6340,
        "title": "Retracted: Application of Deep Learning in Lung Cancer Imaging Diagnosis",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9796232"
    },
    {
        "id": 6341,
        "title": "Retracted: Deep Learning-Based Detection and Diagnosis of Subarachnoid Hemorrhage",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9856842"
    },
    {
        "id": 6342,
        "title": "Retracted: Footballer Action Tracking and Intervention Using Deep Learning Algorithm",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9768638"
    },
    {
        "id": 6343,
        "title": "Retracted: Deep Learning-Based Diagnosis Method of Emergency Colorectal Pathology",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9815256"
    },
    {
        "id": 6344,
        "title": "An intelligent healthcare monitoring system-based novel deep learning approach for detecting covid-19 from x-rays images",
        "authors": "Shadi AlZu’bi, Amjed Zreiqat, Worood Radi, Ala Mughaid, Laith Abualigah",
        "published": "2024-1-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-18056-0"
    },
    {
        "id": 6345,
        "title": "A review of deep learning approaches in clinical and healthcare systems based on medical image analysis",
        "authors": "Hadeer A. Helaly, Mahmoud Badawy, Amira Y. Haikal",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16605-1"
    },
    {
        "id": 6346,
        "title": "Tuberculosis chest x-ray image retrieval system using deep learning based biomarker predictions",
        "authors": "Bradley Lowekamp, Andrei Gabrielian, Darrell Hurt, Alex Rosenthal, Ziv R. Yaniv",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006848"
    },
    {
        "id": 6347,
        "title": "Deep Learning Approach for Hand Gesture Recognition: Applications in Deaf Communication and Healthcare",
        "authors": "Khursheed Aurangzeb, Khalid Javeed, Musaed Alhussein, Imad Rida, Syed Irtaza Haider, Anubha Parashar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.042886"
    },
    {
        "id": 6348,
        "title": "Retracted: Deep Learning Technology in Pathological Image Analysis of Breast Tissue",
        "authors": "",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9842624"
    },
    {
        "id": 6349,
        "title": "A novel epilepsy seizure prediction model using deep learning and classification",
        "authors": "B. Jaishankar, Ashwini A.M., Vidyabharathi D., L. Raja",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100222"
    },
    {
        "id": 6350,
        "title": "A novel hybrid deep learning method for early detection of lung cancer using neural networks",
        "authors": "Shalini Wankhade, Vigneshwari S.",
        "published": "2023-11",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100195"
    },
    {
        "id": 6351,
        "title": "Retracted: A Deep Learning-Based Text Classification of Adverse Nursing Events",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9797848"
    },
    {
        "id": 6352,
        "title": "Deep Learning-Based Yoga Posture Recognition Using the Y_PN-MSSD Model for Yoga Practitioners",
        "authors": "Aman Upadhyay, Niha Kamal Basha, Balasundaram Ananthakrishnan",
        "published": "2023-2-17",
        "citations": 7,
        "abstract": "In today’s digital world, and in light of the growing pandemic, many yoga instructors opt to teach online. However, even after learning or being trained by the best sources available, such as videos, blogs, journals, or essays, there is no live tracking available to the user to see if he or she is holding poses appropriately, which can lead to body posture issues and health issues later in life. Existing technology can assist in this regard; however, beginner-level yoga practitioners have no means of knowing whether their position is good or poor without the instructor’s help. As a result, the automatic assessment of yoga postures is proposed for yoga posture recognition, which can alert practitioners by using the Y_PN-MSSD model, in which Pose-Net and Mobile-Net SSD (together named as TFlite Movenet) play a major role. The Pose-Net layer takes care of the feature point detection, while the mobile-net SSD layer performs human detection in each frame. The model is categorized into three stages. Initially, there is the data collection/preparation stage, where the yoga postures are captured from four users as well as an open-source dataset with seven yoga poses. Then, by using these collected data, the model undergoes training where the feature extraction takes place by connecting key points of the human body. Finally, the yoga posture is recognized and the model assists the user through yoga poses by live-tracking them, as well as correcting them on the fly with 99.88% accuracy. Comparatively, this model outperforms the performance of the Pose-Net CNN model. As a result, the model can be used as a starting point for creating a system that will help humans practice yoga with the help of a clever, inexpensive, and impressive virtual yoga trainer.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11040609"
    },
    {
        "id": 6353,
        "title": "Machine learning and deep learning-based approach in smart healthcare: Recent advances, applications, challenges and opportunities",
        "authors": "Anichur Rahman, Tanoy Debnath, Dipanjali Kundu, Md. Saikat Islam Khan, Airin Afroj Aishi, Sadia Sazzad, Mohammad Sayduzzaman, Shahab S. Band",
        "published": "2024",
        "citations": 2,
        "abstract": "<abstract>\n<p>In recent years, machine learning (ML) and deep learning (DL) have been the leading approaches to solving various challenges, such as disease predictions, drug discovery, medical image analysis, etc., in intelligent healthcare applications. Further, given the current progress in the fields of ML and DL, there exists the promising potential for both to provide support in the realm of healthcare. This study offered an exhaustive survey on ML and DL for the healthcare system, concentrating on vital state of the art features, integration benefits, applications, prospects and future guidelines. To conduct the research, we found the most prominent journal and conference databases using distinct keywords to discover scholarly consequences. First, we furnished the most current along with cutting-edge progress in ML-DL-based analysis in smart healthcare in a compendious manner. Next, we integrated the advancement of various services for ML and DL, including ML-healthcare, DL-healthcare, and ML-DL-healthcare. We then offered ML and DL-based applications in the healthcare industry. Eventually, we emphasized the research disputes and recommendations for further studies based on our observations.</p>\n</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/publichealth.2024004"
    },
    {
        "id": 6354,
        "title": "A Comparative Study on Deep Learning Models for COVID-19 Forecast",
        "authors": "Ziyuan Guo, Qingyi Lin, Xuhui Meng",
        "published": "2023-8-26",
        "citations": 1,
        "abstract": "The COVID-19 pandemic has led to a global health crisis with significant morbidity, mortality, and socioeconomic disruptions. Understanding and predicting the dynamics of COVID-19 are crucial for public health interventions, resource allocation, and policy decisions. By developing accurate models, informed public health strategies can be devised, resource allocation can be optimized, and virus transmission can be reduced. Various mathematical and computational models have been developed to estimate transmission dynamics and forecast the pandemic’s trajectories. However, the evolving nature of COVID-19 demands innovative approaches to enhance prediction accuracy. The machine learning technique, particularly the deep neural networks (DNNs), offers promising solutions by leveraging diverse data sources to improve prevalence predictions. In this study, three typical DNNs, including the Long Short-Term Memory (LSTM) network, Physics-informed Neural Network (PINN), and Deep Operator Network (DeepONet), are employed to model and forecast COVID-19 spread. The training and testing data used in this work are the global COVID-19 cases in the year of 2021 from the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University. A seven-day moving average as well as the normalization techniques are employed to stabilize the training of deep learning models. We systematically investigate the effect of the number of training data on the predicted accuracy as well as the capability of long-term forecast in each model. Based on the relative L2 errors between the predictions from deep learning models and the reference solutions, the DeepONet, which is capable of learning hidden physics given the training data, outperforms the other two approaches in all test cases, making it a reliable tool for accurate forecasting the dynamics of COVID-19.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11172400"
    },
    {
        "id": 6355,
        "title": "Why complete medical data curation matters: challenges faced while comparing two deep-learning-based CT segmentation methods",
        "authors": "Haoqi Wang, Mia Markey, Nicolas Pannetier, Mehul Sampat",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3009174"
    },
    {
        "id": 6356,
        "title": "Recent Advances, Challenges, and Applications of Deep Learning in Healthcare Systems for Medical Diagnosis and Treatment",
        "authors": "Ramesh Chandra Patra, G. Saritha, G. Ashish Raghuwanshi, P. Parthiban, V. Ashok",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390124"
    },
    {
        "id": 6357,
        "title": "GUEST EDITORIAL — DEEP LEARNING IN BIOMEDICAL AND HEALTHCARE: EMERGING TRENDS, APPLICATIONS AND RESEARCH CHALLENGES",
        "authors": "Mu-Yen Chen, Mary Gladence",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0219519423020025"
    },
    {
        "id": 6358,
        "title": "Retracted: A Real-Time Crowd Monitoring and Management System for Social Distance Classification and Healthcare Using Deep Learning",
        "authors": "",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9832757"
    },
    {
        "id": 6359,
        "title": "Big Data Analytics with Wild Horse Optimizer based Deep Learning Model for Healthcare Management",
        "authors": "M. Vamsikrishna, Rajasree RS, Gopika G S, D. Suganthi, Md. Abul Ala Walid, Ramu Kuchipudi",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220710"
    },
    {
        "id": 6360,
        "title": "A Smartphone-Enabled Deep Learning Approach for Myocardial Infarction Detection Using ECG Traces for IoT-Based Healthcare Applications",
        "authors": "Visweswar Sirish Parupudi, Amit Kumar Panda, Rajesh Kumar Tripathy",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lsens.2023.3328593"
    },
    {
        "id": 6361,
        "title": "Deep echo state networks in data marketplaces",
        "authors": "Will Serrano",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100456"
    },
    {
        "id": 6362,
        "title": "Retracted: Research on Chest Disease Recognition Based on Deep Hierarchical Learning Algorithm",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9840965"
    },
    {
        "id": 6363,
        "title": "Retracted: Research and Analysis of Brain Glioma Imaging Based on Deep Learning",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9846726"
    },
    {
        "id": 6364,
        "title": "Deep Learning on Ultrasound Images Visualizes the Femoral Nerve with Good Precision",
        "authors": "Johan Berggreen, Anders Johansson, John Jahr, Sebastian Möller, Tomas Jansson",
        "published": "2023-1-7",
        "citations": 3,
        "abstract": "The number of hip fractures per year worldwide is estimated to reach 6 million by the year 2050. Despite the many advantages of regional blockades when managing pain from such a fracture, these are used to a lesser extent than general analgesia. One reason is that the opportunities for training and obtaining clinical experience in applying nerve blocks can be a challenge in many clinical settings. Ultrasound image guidance based on artificial intelligence may be one way to increase nerve block success rate. We propose an approach using a deep learning semantic segmentation model with U-net architecture to identify the femoral nerve in ultrasound images. The dataset consisted of 1410 ultrasound images that were collected from 48 patients. The images were manually annotated by a clinical professional and a segmentation model was trained. After training the model for 350 epochs, the results were validated with a 10-fold cross-validation. This showed a mean Intersection over Union of 74%, with an interquartile range of 0.66–0.81.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11020184"
    },
    {
        "id": 6365,
        "title": "A survey of malware detection using deep learning",
        "authors": "Ahmed Bensaoud, Jugal Kalita, Mahmoud Bensaoud",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100546"
    },
    {
        "id": 6366,
        "title": "The Future of Healthcare: A Machine Learning Revolution",
        "authors": "Navneet Kumar Rajpoot, Prabh Deep Singh, Bhaskar Pant, Vikas Tripathi",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489320"
    },
    {
        "id": 6367,
        "title": "Retracted: Deep Learning-Based Three-Dimensional Oral Conical Beam Computed Tomography for Diagnosis",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9859708"
    },
    {
        "id": 6368,
        "title": "Retracted: Analysis of Cardiac Ultrasound Images of Critically Ill Patients Using Deep Learning",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9856298"
    },
    {
        "id": 6369,
        "title": "Retracted: Deep Learning and Microscopic Imaging in the Nursing Process of Neurosurgery Operation",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9757351"
    },
    {
        "id": 6370,
        "title": "An investigation of multivariate data-driven deep learning models for predicting COVID-19 variants",
        "authors": "Akhmad Dimitri Baihaqi, Novanto Yudistira, Edy Santoso",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100331"
    },
    {
        "id": 6371,
        "title": "Retracted: A Novel Hybrid Deep Learning Approach for Skin Lesion Segmentation and Classification",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9832712"
    },
    {
        "id": 6372,
        "title": "Improving Equity in Deep Learning Medical Applications with the Gerchberg-Saxton Algorithm",
        "authors": "Seha Ay, Michael Cardei, Anne-Marie Meyer, Wei Zhang, Umit Topaloglu",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00123"
    },
    {
        "id": 6373,
        "title": "Modeling of Metaheuristics with Deep Transfer Learning Based Visual Data Mining for the Healthcare Sector",
        "authors": "Z. Abed, Ammar H. Shnawa, M. R. Hadi, Karrar Ibrahim, Myasar Mundher Adnan, Waleed Hameed",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iiceta57613.2023.10351274"
    },
    {
        "id": 6374,
        "title": "Retracted: Prediction Algorithm of Young Students’ Physical Health Risk Factors Based on Deep Learning",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9848620"
    },
    {
        "id": 6375,
        "title": "Hybrid deep learning and GARCH-family models for forecasting volatility of cryptocurrencies",
        "authors": "Bahareh Amirshahi, Salim Lahmiri",
        "published": "2023-6",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100465"
    },
    {
        "id": 6376,
        "title": "Voice spoofing detection for multiclass attack classification using deep learning",
        "authors": "Jason Boyd, Muhammad Fahim, Oluwafemi Olukoya",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100503"
    },
    {
        "id": 6377,
        "title": "Retracted: A Data-Efficient Framework for the Identification of Vaginitis Based on Deep Learning",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9792184"
    },
    {
        "id": 6378,
        "title": "Retracted: ResNet-BiLSTM: A Multiscale Deep Learning Model for Heartbeat Detection Using Ballistocardiogram Signals",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9809587"
    },
    {
        "id": 6379,
        "title": "Deep Learning and Explainable Machine Learning on Hair Disease Detection",
        "authors": "Wei Wei Heng, N. A. Abdul-Kadir",
        "published": "2023-6-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecbios57802.2023.10218472"
    },
    {
        "id": 6380,
        "title": "Retracted: Joint Deep-Learning-Enabled Impact of Holistic Care on Line Coagulation in Hemodialysis",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9836198"
    },
    {
        "id": 6381,
        "title": "DNN MODEL USING DEEP LEARNING TECHNIQUES FOR HEALTHCARE DATA",
        "authors": "",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46795"
    },
    {
        "id": 6382,
        "title": "Deep Learning based Spectrum predictions for Cognitive Healthcare system",
        "authors": "Parnika Kansal",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307849"
    },
    {
        "id": 6383,
        "title": "INVESTIGATING ISSUES &amp; CHALLENGES OF DEEP LEARNING IN HEALTHCARE",
        "authors": "",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets45938"
    },
    {
        "id": 6384,
        "title": "Retracted: Performance Analysis of Deep Learning Models for Binary Classification of Cancer Gene Expression Data",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9816823"
    },
    {
        "id": 6385,
        "title": "A deep learning architecture with an object-detection algorithm and a convolutional neural network for breast mass detection and visualization",
        "authors": "Steven J. Frank",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100186"
    },
    {
        "id": 6386,
        "title": "Retracted: Evaluation of Ischemic Penumbra in Stroke Patients Based on Deep Learning and Multimodal CT",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9851918"
    },
    {
        "id": 6387,
        "title": "Comparing deep reinforcement learning architectures for autonomous racing",
        "authors": "Benjamin David Evans, Hendrik Willem Jordaan, Herman Arnold Engelbrecht",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100496"
    },
    {
        "id": 6388,
        "title": "Retracted: Magnetic Resonance Imaging Images under Deep Learning in the Identification of Tuberculosis and Pneumonia",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9801964"
    },
    {
        "id": 6389,
        "title": "Retracted: Adaptive Diagnosis of Lung Cancer by Deep Learning Classification Using Wilcoxon Gain and Generator",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9765029"
    },
    {
        "id": 6390,
        "title": "The Role of Machine Learning and Deep Learning Approaches for the Detection of Skin Cancer",
        "authors": "Tehseen Mazhar, Inayatul Haq, Allah Ditta, Syed Agha Hassnain Mohsan, Faisal Rehman, Imran Zafar, Jualang Azlan Gansau, Lucky Poh Wah Goh",
        "published": "2023-2-1",
        "citations": 18,
        "abstract": "Machine learning (ML) can enhance a dermatologist’s work, from diagnosis to customized care. The development of ML algorithms in dermatology has been supported lately regarding links to digital data processing (e.g., electronic medical records, Image Archives, omics), quicker computing and cheaper data storage. This article describes the fundamentals of ML-based implementations, as well as future limits and concerns for the production of skin cancer detection and classification systems. We also explored five fields of dermatology using deep learning applications: (1) the classification of diseases by clinical photos, (2) der moto pathology visual classification of cancer, and (3) the measurement of skin diseases by smartphone applications and personal tracking systems. This analysis aims to provide dermatologists with a guide that helps demystify the basics of ML and its different applications to identify their possible challenges correctly. This paper surveyed studies on skin cancer detection using deep learning to assess the features and advantages of other techniques. Moreover, this paper also defined the basic requirements for creating a skin cancer detection application, which revolves around two main issues: the full segmentation image and the tracking of the lesion on the skin using deep learning. Most of the techniques found in this survey address these two problems. Some of the methods also categorize the type of cancer too.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11030415"
    },
    {
        "id": 6391,
        "title": "Retracted: The Effect of Deep Learning-Based QSM Magnetic Resonance Imaging on the Subthalamic Nucleus",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9790180"
    },
    {
        "id": 6392,
        "title": "Deep learning and ensemble deep learning for circRNA-RBP interaction prediction in the last decade: A review",
        "authors": "Dilan Lasantha, Sugandima Vidanagamachchi, Sam Nallaperuma",
        "published": "2023-8",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106352"
    },
    {
        "id": 6393,
        "title": "A deep learning knowledge graph neural network for recommender systems",
        "authors": "Gurinder Kaur, Fei Liu, Yi-Ping Phoebe Chen",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100507"
    },
    {
        "id": 6394,
        "title": "Unsupervised deep learning for clustering tumor subcompartments in histopathological images of non-small cell lung cancer",
        "authors": "Matheus de Freitas Oliveira Baffa, Nadine S. Schaadt, Friedrich Feuerhake, Thomas M. Deserno",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3009180"
    },
    {
        "id": 6395,
        "title": "Deep learning for anomaly detection in log data: A survey",
        "authors": "Max Landauer, Sebastian Onder, Florian Skopik, Markus Wurzenberger",
        "published": "2023-6",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100470"
    },
    {
        "id": 6396,
        "title": "Application of the convolutional neural networks and supervised deep-learning methods for osteosarcoma bone cancer detection",
        "authors": "Sushopti Gawade, Ashok Bhansali, Kshitij Patil, Danish Shaikh",
        "published": "2023-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100153"
    },
    {
        "id": 6397,
        "title": "Retracted: Automated System for Identifying COVID-19 Infections in Computed Tomography Images Using Deep Learning Models",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9812058"
    },
    {
        "id": 6398,
        "title": "Automated segmentation of polyps by 3D deep learning in photon-counting CT colonography",
        "authors": "Janne J. Näppi, Toru Hironaka, Dufan Wu, Rajiv Gupta, Rie Tachibana, Katsuyuki Taguchi, Masaki Okamoto, Hiroyuki Yoshida",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3007290"
    },
    {
        "id": 6399,
        "title": "A novel Deep Learning architecture for lung cancer detection and diagnosis from Computed Tomography image analysis",
        "authors": "Lavina Jean Crasta, Rupal Neema, Alwyn Roshan Pais",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100316"
    },
    {
        "id": 6400,
        "title": "Retracted: Imaging Manifestations and Evaluation of Postoperative Complications of Bone and Joint Infections under Deep Learning",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9858320"
    },
    {
        "id": 6401,
        "title": "Retracted: Models of Artificial Intelligence-Assisted Diagnosis of Lung Cancer Pathology Based on Deep Learning Algorithms",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9874292"
    },
    {
        "id": 6402,
        "title": "Retracted: Application of Artificial Intelligence Nuclear Medicine Automated Images Based on Deep Learning in Tumor Diagnosis",
        "authors": "",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9815723"
    },
    {
        "id": 6403,
        "title": "Retracted: Study on Automatic Multi-Classification of Spine Based on Deep Learning and Postoperative Infection Screening",
        "authors": "",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9861723"
    },
    {
        "id": 6404,
        "title": "Retracted: Application of Deep Learning Technology in Predicting the Risk of Inpatient Death in Intensive Care Unit",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9782704"
    },
    {
        "id": 6405,
        "title": "Retracted: Financial Fraud Detection in Healthcare Using Machine Learning and Deep Learning Techniques",
        "authors": "",
        "published": "2023-12-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9758612"
    },
    {
        "id": 6406,
        "title": "Deep Learning-based Cluster Analysis for Healthcare Data Classification",
        "authors": "M. Gayathri, V. Kavitha",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452610"
    },
    {
        "id": 6407,
        "title": "Smart Education &amp; Healthcare: Deep learning‐based <scp>Cross‐Domain</scp> English data translation for <scp>Real‐Time</scp> Mobile healthcare",
        "authors": "Xinli Zhang",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "Internet technology and smart medical equipment have been rapidly developed and widely popularized. Telemedicine can improve the efficiency of patients' medical treatment and can facilitate patients to receive doctor's diagnosis and treatment, which saves medical resources and facilitate the monitoring of patients suffering from geriatric diseases and chronic diseases. In this work, we adopt the deep learning model to form a medical‐oriented English translation mechanism, based on which we can improve diagnostic efficiency and promote the development of smart telemedicine systems. We combine the recurrent neural network and attention mechanism to design an English translation model, which can solve the language barrier in the cross‐domain medical diagnosis process and improve the diagnosis efficiency. Specifically, first, we design a RNN translation model based on the encoder‐decoder structure. Second, we incorporate an attention mechanism into the designed translation model to improve the translation performance of the model. The experimental results show that the proposed mechanism is efficient.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/itl2.418"
    },
    {
        "id": 6408,
        "title": "Retracted: Prediction of Hearing Prognosis of Large Vestibular Aqueduct Syndrome Based on the PyTorch Deep Learning Model",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9868495"
    },
    {
        "id": 6409,
        "title": "Retracted: Evaluation of the Effectiveness of Artificial Intelligence Chest CT Lung Nodule Detection Based on Deep Learning",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9876380"
    },
    {
        "id": 6410,
        "title": "Retracted: Deep Personal Multitask Prediction of Diabetes Complication with Attentive Interactions Predicting Diabetes Complications by Multitask-Learning",
        "authors": "",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9891682"
    },
    {
        "id": 6411,
        "title": "Retracted: Design of Optimal Deep Learning-Based Pancreatic Tumor and Nontumor Classification Model Using Computed Tomography Scans",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9878512"
    },
    {
        "id": 6412,
        "title": "Retracted: Construction and Implementation of Procedural Nursing System for General Surgery Laparoscopic Surgery Based on Deep Learning",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9825047"
    },
    {
        "id": 6413,
        "title": "Retracted: Automated Diagnosis and Localization of Melanoma from Skin Histopathology Slides Using Deep Learning: A Multicenter Study",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9847323"
    },
    {
        "id": 6414,
        "title": "Advances in Artificial Intelligence, Machine Learning and Deep Learning Applications",
        "authors": "Muhammad Salman Haleem",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "Recent advances in the field of artificial intelligence (AI) have been pivotal in enhancing the effectiveness and efficiency of many systems and in all fields of knowledge, including medical diagnosis [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12183780"
    },
    {
        "id": 6415,
        "title": "Explainable Deep Learning Models for Healthcare Decision Support",
        "authors": "",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "Deep learning has recently become a potent tool in healthcare, excelling at tasks like analyzing medical images, diagnosing diseases, and predicting patient outcomes. The Second Chapter's Literature Review explained Deep Learning in Healthcare: Current Applications and Challenges or Interpretable Techniques in Deep Learning along with Performance Evaluation of Deep Learning Models in Healthcare. It has also done Clinical Standards and Decision Support Systems. The Third Chapter Methodology discusses comprehending the subjective perceptions and interpretations of healthcare professionals regarding Explainable Deep Learning Models (EDLMs) in clinical decision-making, this study employs an interpretive research philosophy",
        "keywords": "",
        "link": "http://dx.doi.org/10.30534/ijacst/2023/0112102023"
    },
    {
        "id": 6416,
        "title": "Gradient Clipping in Deep Learning: A Dynamical Systems Perspective",
        "authors": "Arunselvan Ramaswamy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011678000003411"
    },
    {
        "id": 6417,
        "title": "Applications of Deep Learning and Deep Reinforcement Learning in 6G Networks",
        "authors": "Tri-Hai Nguyen, Heejae Park, Kihyun Seol, Seonghyeon So, Laihyuk Park",
        "published": "2023-7-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10200390"
    },
    {
        "id": 6418,
        "title": "A Practical Hybrid IoT Architecture with Deep Learning Technique for Healthcare and Security Applications",
        "authors": "Viet Q. Vu, Minh-Quang Tran, Mohammed Amer, Mahesh Khatiwada, Sherif S. M. Ghoneim, Mahmoud Elsisi",
        "published": "2023-7-3",
        "citations": 2,
        "abstract": "Facial mask detection technology has become increasingly important even beyond the context of the COVID-19 pandemic. Along with the advancement in facial recognition technology, face mask detection has become a crucial feature for various applications. This paper introduces an Internet of Things (IoT) architecture based on a developed deep learning algorithm named You Only Look Once (YOLO) to keep society healthy, and secured, and collect data for future research. The proposed paradigm is built on the basis of economic consideration and is easy to implement. Yet, the used YOLOv4-tiny is one of the fastest object detection models to exist. A mask detection camera (MaskCam) that leverages the computing power of NVIDIA’s Jetson Nano edge nanodevices was built side by side with a smart camera application to detect a mask on the face of an individual. MaskCam distinguishes between mask wearers, those who are not wearing masks, and those who are not wearing masks properly according to MQTT protocol. Furthermore, a self-developed web browsing application comes with the MaskCam system to collect and visualize statistics for qualitative and quantitative analysis. The practical results demonstrate the superiority and effectiveness of the proposed smart mask detection system. On the one hand, YOLOv4-full obtained the best results even at smaller resolutions, although the frame rate is too small for real-time use. On the other hand, it is twice as fast as the other detection models, regardless of the quality of detection. Consequently, inferences may be run more frequently over the entire video sequence, resulting in more accurate output.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14070379"
    },
    {
        "id": 6419,
        "title": "Ostrich Detection based on Deep Learning",
        "authors": "",
        "published": "2024-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1303.1006"
    },
    {
        "id": 6420,
        "title": "Retracted: Deep Learning-Based Computed Tomography Imaging to Diagnose the Lung Nodule and Treatment Effect of Radiofrequency Ablation",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9895709"
    },
    {
        "id": 6421,
        "title": "Retracted: Brain Tumor Detection and Classification by MRI Using Biologically Inspired Orthogonal Wavelet Transform and Deep Learning Techniques",
        "authors": "",
        "published": "2023-5-24",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9845732"
    },
    {
        "id": 6422,
        "title": "Rumor Detection on Social Media Using Deep Learning Algorithms with Fuzzy Inference System for Healthcare Analytics System Using COVID-19 Dataset",
        "authors": "Akila Rathakrishnan, Revathi Sathiyanarayanan",
        "published": "2023-3",
        "citations": 4,
        "abstract": " Spreading rumors on social media is a phenomenon that has destructive implication of societal interaction, diverts attention toward destructive behavior. The impact will be more influenced in healthcare management. This research aims to detect the rumors and identify the sources using deep learning algorithms. In our proposed system, after pre-processing, the tweet comments are extracted from topics and ranked as deny, support, query and comment. Then the comments are classified as positive, negative and neutral using Artificial Neural Network Neuro-fuzzy Inference System Spline-based pi-shaped Membership Function (ANISPIMF). Then the negative comments are classified into offensive, violence, misogyny and hate mongering by using Improved Deep Learning Neural Network (IDLNN) which is the combination of Deep Neural Network with Cuckoo Search–Flower Pollination Algorithm to optimize the weight values. The optimized ANISPIMF performs very well for the COVID-19 dataset in terms of Accuracy, Precision and Recall. The proposed system attains better performance and efficiency when weighted against prevailing methodologies — regarding the performance measures, there is an improvement of accuracy by 0.6%, recall by 0.7%, and precision by 1%, together with an [Formula: see text]1-score of 1.2% than the Multiloss Hierarchical Bi-LSTM with Attenuation Factor (MHA). ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1469026823410080"
    },
    {
        "id": 6423,
        "title": "Back Cover: Deep‐learning enabled smart insole system aiming for multifunctional foot‐healthcare applications (EXP2 1/2024)",
        "authors": "Yu Tian, Lei Zhang, Chi Zhang, Bo Bao, Qingtong Li, Longfei Wang, Zhenqiang Song, Dachao Li",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/exp.20240104"
    },
    {
        "id": 6424,
        "title": "Retracted: Research on DCE-MRI Images Based on Deep Transfer Learning in Breast Cancer Adjuvant Curative Effect Prediction",
        "authors": "",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9836414"
    },
    {
        "id": 6425,
        "title": "Retracted: Deep Learning-Based Real-Time AI Virtual Mouse System Using Computer Vision to Avoid COVID-19 Spread",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9804176"
    },
    {
        "id": 6426,
        "title": "Retracted: Research on the Improved CNN Deep Learning Method for Motion Intention Recognition of Dynamic Lower Limb Prosthesis",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9810474"
    },
    {
        "id": 6427,
        "title": "Deep VULMAN: A deep reinforcement learning-enabled cyber vulnerability management framework",
        "authors": "Soumyadeep Hore, Ankit Shah, Nathaniel D. Bastian",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119734"
    },
    {
        "id": 6428,
        "title": "Learning Sub-Dimensional HRTF Representations Towards Individualization Applications - Traditional and Deep Learning Approaches",
        "authors": "Devansh Zurale, Shlomo Dubnov",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/waspaa58266.2023.10248076"
    },
    {
        "id": 6429,
        "title": "Attention-Guided Deep Learning Texture Feature for Object Recognition Applications",
        "authors": "Sachinkumar Veerashetty",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059051"
    },
    {
        "id": 6430,
        "title": "Fake news detection on Pakistani news using machine learning and deep learning",
        "authors": "Azka Kishwar, Adeel Zafar",
        "published": "2023-1",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118558"
    },
    {
        "id": 6431,
        "title": "Deep Fakes in Healthcare: How Deep Learning Can Help to Detect Forgeries",
        "authors": "Alaa Alsaheel, Reem Alhassoun, Reema Alrashed, Noura Almatrafi, Noura Almallouhi, Saleh Albahli",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.040257"
    },
    {
        "id": 6432,
        "title": "Standard-based personalized healthcare delivery for kidney illness using deep learning",
        "authors": "Shelly Sachdeva",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\n\nMotivation and objective. Predictive analytics is an active area of research in healthcare. It aims to provide better services to the patient and helps the medical practitioners to know what particular treatment would be suitable for a patient based on their past data. Deep learning is an emerging branch of machine learning in which deep artificial neural networks are used to learn a specific pattern for mapping input to output. It has revolutionized predictive analytics by achieving far better accuracy than conventional learning models. This paper aims to analyze the effect of deep learning on a standardized electronic health records dataset by diagnosing kidney-related diseases. Approach. The current study uses a general modularized deep learning architecture called encoder-combiner-decoder (ECD), which offers a robust framework. The model’s performance is enhanced by the availability of variations and extensions to the basic ECD architecture, corresponding to respective input and output feature types. The openEHR benchmark dataset (ORBDA) is used to train the model. It is a real-world dataset that has been provided by the Brazilian Public Health System through the SUS (DATASUS) Database Department of Informatics. Results. In the current research, the model trained using deep learning on the part of this benchmark dataset can help in diagnosing kidney-related illnesses. The evaluation metrics show high precision, recall, and F1 score for kidney-related diseases, meaning that they can be identified almost every time. Significance. The model is a novel attempt to analyze a standardized healthcare dataset that can be deployed in medical institutions in order for its performance to be evaluated by a medical professional.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6579/ace09f"
    },
    {
        "id": 6433,
        "title": "Towards Secure IoMT: Attack Detection Using Deep Q-Learning in Healthcare Networks",
        "authors": "Layal Abu Daher",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dese60595.2023.10468942"
    },
    {
        "id": 6434,
        "title": "Deep learning‐based image processing for financial audit risk quantification in healthcare",
        "authors": "Yanzhe Ma",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "AbstractRecently, deep learning technology has gradually penetrated various fields. Today, the field of healthcare is also closely linked to deep learning technology. Image processing technology based on deep learning can accurately segment medical images, which is convenient for medical research and pathological analysis. Accurate distribution of images can effectively save medical resources. Therefore, image processing techniques can contribute to the quantification and assessment of economic audit risks. In recent years, medical image segmentation has achieved many research results. However, with the improvement of accuracy, the segmentation standards of medical images are also becoming more and more stringent. For medical images, they tend to have rough and fuzzy boundaries and noise disturbances of different shapes. The above problems pose challenges for accurate localization and segmentation of lesion regions. On the other hand, in the field of medical images, there are also problems such as unbalanced number of samples and scarcity of large medical image datasets. In response to these problems, this paper conducts research work and proposes an Attention Mechanism and Multi‐Scale spatial Pooling‐based conditional Adversarial Network (AM‐MSP‐cGAN) model to achieve automatic segmentation of medical images. AM‐MSP‐cGAN can learn more detailed features from fuzzy boundaries, and effectively solve the problem of data lack, thereby promoting economic audit risk quantification and assessment in the healthcare field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/exsy.13355"
    },
    {
        "id": 6435,
        "title": "A Cloud Collaborative Healthcare Platform Based on Deep Learning in The Segmentation of Maxillary Sinus",
        "authors": "Yen Li, Zheng Huang, Yen Lin",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadconfp.2023.211-215"
    },
    {
        "id": 6436,
        "title": "Enhancing Service Quality in Healthcare Systems Through Deep Learning",
        "authors": "Alireza Nobakht, Mohadeseh Gholamhosseinzadeh",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp61396.2024.10475204"
    },
    {
        "id": 6437,
        "title": "Intelligent Energy-Aware Thermal Exchange Optimization with Deep Learning Model for IoT-Enabled Smart Healthcare",
        "authors": "Mahmoud Ragab, Sami Saeed Binyamin",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "In recent years, Internet of Things (IoT) and advanced sensor technologies have gained considerable interest in linking different medical devices, patients, and healthcare professionals to improve the quality of medical services in a cost-effective manner. The evolution of the smart healthcare sector has considerably enhanced patient safety, accessibility, and operational competence while minimizing the costs incurred in healthcare services. In this background, the current study develops intelligent energy-aware thermal exchange optimization with deep learning (IEA-TEODL) model for IoT-enabled smart healthcare. The aim of the proposed IEA-TOEDL technique is to group the IoT devices into clusters and make decisions in the smart healthcare sector. The proposed IEA-TEODL technique constructs clusters using the energy-aware chaotic thermal exchange optimization-based clustering (EACTEO-C) scheme. In addition, the disease diagnosis model also intends to classify the collected healthcare data as either presence or absence of the disease. To accomplish this, the proposed IEA-TODL technique involves several subprocesses such as preprocessing, K-medoid clustering-based outlier removal, multihead attention bidirectional long short-term memory (MHA-BLSTM), and weighted salp swarm algorithm (WSSA). The utilization of outlier removal and WSSA-based hyperparameter tuning process assist in achieving enhanced classification outcomes. In order to demonstrate the enhanced outcomes of the IEA-TEODL approach, a wide range of simulations was conducted against benchmark datasets. The simulation results inferred the enhanced outcomes of the IEA-TEODL technique over recent techniques under distinct evaluation metrics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/3830857"
    },
    {
        "id": 6438,
        "title": "Continual Learning with Deep Neural Networks in Physiological Signal Data: A Survey",
        "authors": "Ao Li, Huayu Li, Geng Yuan",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "Deep-learning algorithms hold promise in processing physiological signal data, including electrocardiograms (ECGs) and electroencephalograms (EEGs). However, healthcare often requires long-term monitoring, posing a challenge to traditional deep-learning models. These models are generally trained once and then deployed, which limits their ability to adapt to the dynamic and evolving nature of healthcare scenarios. Continual learning—known for its adaptive learning capabilities over time—offers a promising solution to these challenges. However, there remains an absence of consolidated literature, which reviews the techniques, applications, and challenges of continual learning specific to physiological signal analysis, as well as its future directions. Bridging this gap, our review seeks to provide an overview of the prevailing techniques and their implications for smart healthcare. We delineate the evolution from traditional approaches to the paradigms of continual learning. We aim to offer insights into the challenges faced and outline potential paths forward. Our discussion emphasizes the need for benchmarks, adaptability, computational efficiency, and user-centric design in the development of future healthcare systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare12020155"
    },
    {
        "id": 6439,
        "title": "Deep Learning-assisted Retinopathy of Prematurity (ROP) Screening",
        "authors": "Vijay Kumar, Het Patel, Kolin Paul, Shorya Azad",
        "published": "2023-7-31",
        "citations": 1,
        "abstract": "Retinopathy of prematurity (ROP) is a leading cause of blindness in premature infants worldwide, particularly in developing countries. In this research, we propose a Deep Convolutional Neural Network (DCNN) and image processing-based approach for the automatic detection of retinal features, including the optical disc (OD) and retinal blood vessels (BV), as well as disease classification using a rule-based method for ROP patients. Our DCNN model uses YOLO-v5 for OD detection and either Pix2Pix or a U-Net for BV segmentation.\nWe trained our DCNN models on publicly available fundus image datasets of size 1,117 and 288 for OD detection and BV segmentation, respectively. We evaluated our approach on a dataset of 439 preterm neonatal retinal images, testing for ROP Zone and 6 BV masks. Our proposed system achieved excellent results, with the OD detection module achieving an overall accuracy of 98.94% (when IoU 0.5) and the BV segmentation module achieving an accuracy of 96.69% and a Dice coefficient between 0.60 and 0.64. Moreover, our system accurately diagnosed ROP in Zone-1 with 88.23% accuracy. Our approach offers a promising solution for accurate ROP screening and diagnosis, particularly in low-resource settings, where it has the potential to improve healthcare outcomes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3596223"
    },
    {
        "id": 6440,
        "title": "An Enhanced Analysis of Cloud-Based Deep Learning Model in Smart Healthcare Management",
        "authors": "Tejaswi Khanna, Sonali Mathur",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489824"
    },
    {
        "id": 6441,
        "title": "Retracted: Prediction Value of Epilepsy Secondary to Inferior Cavity Hemorrhage Based on Scalp EEG Wave Pattern in Deep Learning",
        "authors": "",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9768716"
    },
    {
        "id": 6442,
        "title": "Data Augmentation with Generative Adversarial Networks for Deep Learning in Healthcare",
        "authors": "Krishna Kant Dixit, Upendra Singh Aswal, V. Saravanan, Manishn Sararswat, N Shalini, Amit Srivastava",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489462"
    },
    {
        "id": 6443,
        "title": "Retracted: Literature Review on the Applications of Machine Learning and Blockchain Technology in Smart Healthcare Industry: A Bibliometric Analysis",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9805790"
    },
    {
        "id": 6444,
        "title": "A deep learning framework for audio restoration using Convolutional/Deconvolutional Deep Autoencoders",
        "authors": "Alberto Nogales, Santiago Donaher, Álvaro García-Tejedor",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120586"
    },
    {
        "id": 6445,
        "title": "Distributed Deep Reinforcement Learning for Autonomous Iot Healthcare Devices in the Cloud",
        "authors": "Aasheesh Shukla, Hemant Singh Pokhariya, Jacob Michaelson, K Laxminarayanamma, Mukesh Kumar, Om Krishna",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10488976"
    },
    {
        "id": 6446,
        "title": "Deep Learning-Based Spatial-Temporal Graph Neural Networks for Price Movement Classification in Crude Oil and Precious Metal Markets",
        "authors": "Parisa Foroutan, Salim Lahmiri",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100552"
    },
    {
        "id": 6447,
        "title": "Retracted: Joint Detection of Tap and CEA Based on Deep Learning Medical Image Segmentation: Risk Prediction of Thyroid Cancer",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9872960"
    },
    {
        "id": 6448,
        "title": "An Intensive Learning of Deep Learning in Alzheimer's Disease Prediction",
        "authors": "G.Anbu Selvi, Dr.T. Karthick",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.011"
    },
    {
        "id": 6449,
        "title": "Pneumonia Classification Using Deep Learning VGG19 Model",
        "authors": "Shannar Phine",
        "published": "2023-2-27",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca51723.2023.10181954"
    },
    {
        "id": 6450,
        "title": "Retracted: Deep Learning Enabled Diagnosis of Children’s ADHD Based on the Big Data of Video Screen Long-Range EEG",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9856982"
    },
    {
        "id": 6451,
        "title": "Retracted: Deep Learning-Based Cervical Spine Posterior Percutaneous Endoscopic Disc Nucleus Resection for the Treatment of Cervical Spondylotic Radiculopathy",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9810452"
    },
    {
        "id": 6452,
        "title": "A Systematic Review on Deep Structured Learning for COVID-19 Screening Using Chest CT from 2020 to 2022",
        "authors": "KC Santosh, Debasmita GhoshRoy, Suprim Nakarmi",
        "published": "2023-8-24",
        "citations": 6,
        "abstract": "The emergence of the COVID-19 pandemic in Wuhan in 2019 led to the discovery of a novel coronavirus. The World Health Organization (WHO) designated it as a global pandemic on 11 March 2020 due to its rapid and widespread transmission. Its impact has had profound implications, particularly in the realm of public health. Extensive scientific endeavors have been directed towards devising effective treatment strategies and vaccines. Within the healthcare and medical imaging domain, the application of artificial intelligence (AI) has brought significant advantages. This study delves into peer-reviewed research articles spanning the years 2020 to 2022, focusing on AI-driven methodologies for the analysis and screening of COVID-19 through chest CT scan data. We assess the efficacy of deep learning algorithms in facilitating decision making processes. Our exploration encompasses various facets, including data collection, systematic contributions, emerging techniques, and encountered challenges. However, the comparison of outcomes between 2020 and 2022 proves intricate due to shifts in dataset magnitudes over time. The initiatives aimed at developing AI-powered tools for the detection, localization, and segmentation of COVID-19 cases are primarily centered on educational and training contexts. We deliberate on their merits and constraints, particularly in the context of necessitating cross-population train/test models. Our analysis encompassed a review of 231 research publications, bolstered by a meta-analysis employing search keywords (COVID-19 OR Coronavirus) AND chest CT AND (deep learning OR artificial intelligence OR medical imaging) on both the PubMed Central Repository and Web of Science platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11172388"
    },
    {
        "id": 6453,
        "title": "Photo Face Detection Based on Deep Learning",
        "authors": "",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1303.1001"
    },
    {
        "id": 6454,
        "title": "Enhancing Healthcare Predictions with Deep Learning Models",
        "authors": "Adam Baji",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "This study leverages Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs) to enhance diagnostics and predictions in healthcare. By training on extensive healthcare datasets, this project aims to improve early disease detection and health risk assessments. Evaluation emphasizes accuracy, reliability, and ethical considerations, including bias mitigation. This research promises to bridge AI advancements and clinical applications, offering significant improvements in diagnostic capabilities and healthcare accessibility.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i21.30543"
    },
    {
        "id": 6455,
        "title": "Diabetes Detection Using Deep Learning",
        "authors": "Deepak Rao Khadatkar, Aayush Agrawal, Alveera Parveen, Mohammad Kaif",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10488978"
    },
    {
        "id": 6456,
        "title": "Classification of Chest CT Lung Nodules Using Collaborative Deep Learning Model",
        "authors": "Khalaf Alshamrani, Hassan Alshamrani",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2147/jmdh.s456167"
    },
    {
        "id": 6457,
        "title": "Emotional Intelligence Through Artificial Intelligence: NLP and Deep Learning in the Analysis of Healthcare Texts",
        "authors": "Prashant Kumar Nag, Amit Bhagat, R. Vishnu Priya, Deepak Kumar Khare",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489117"
    },
    {
        "id": 6458,
        "title": "Retracted: Neuronal Apoptosis in Patients with Liver Cirrhosis and Neuronal Epileptiform Discharge Model Based upon Multi-Modal Fusion Deep Learning",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9868954"
    },
    {
        "id": 6459,
        "title": "Effective cyber security system to secure optical data based on deep learning approach for healthcare application",
        "authors": "Praneeth Kanagala",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijleo.2022.170315"
    },
    {
        "id": 6460,
        "title": "Deep‐learning enabled smart insole system aiming for multifunctional foot‐healthcare applications",
        "authors": "Yu Tian, Lei Zhang, Chi Zhang, Bo Bao, Qingtong Li, Longfei Wang, Zhenqiang Song, Dachao Li",
        "published": "2024-2",
        "citations": 1,
        "abstract": "AbstractReal‐time foot pressure monitoring using wearable smart systems, with comprehensive foot health monitoring and analysis, can enhance quality of life and prevent foot‐related diseases. However, traditional smart insole solutions that rely on basic data analysis methods of manual feature extraction are limited to real‐time plantar pressure mapping and gait analysis, failing to meet the diverse needs of users for comprehensive foot healthcare. To address this, we propose a deep learning‐enabled smart insole system comprising a plantar pressure sensing insole, portable circuit board, deep learning and data analysis blocks, and software interface. The capacitive sensing insole can map both static and dynamic plantar pressure with a wide range over 500 kPa and excellent sensitivity. Statistical tools are used to analyze long‐term foot pressure usage data, providing indicators for early prevention of foot diseases and key data labels for deep learning algorithms to uncover insights into the relationship between plantar pressure patterns and foot issues. Additionally, a segmentation method assisted deep learning model is implemented for exercise‐fatigue recognition as a proof of concept, achieving a high classification accuracy of 95%. The system also demonstrates various foot healthcare applications, including daily activity statistics, exercise injury avoidance, and diabetic foot ulcer prevention.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/exp.20230109"
    },
    {
        "id": 6461,
        "title": "An intelligent SDN-IoT enabled intrusion detection system for healthcare systems using a hybrid deep learning and machine learning approach",
        "authors": "R. Arthi, S. Krishnaveni, Sherali Zeadally",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/jcc.ja.2022-0681"
    },
    {
        "id": 6462,
        "title": "Retracted: Evaluation Analysis of the Nephrotoxicity of <i>Tripterygium wilfordii</i> Preparations with CONSORT Harms Statement Based on Deep Learning",
        "authors": "",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9830834"
    },
    {
        "id": 6463,
        "title": "Deep Learning-Based Prediction of Diabetic Retinopathy Using CLAHE and ESRGAN for Enhancement",
        "authors": "Ghadah Alwakid, Walaa Gouda, Mamoona Humayun",
        "published": "2023-3-15",
        "citations": 17,
        "abstract": "Vision loss can be avoided if diabetic retinopathy (DR) is diagnosed and treated promptly. The main five DR stages are none, moderate, mild, proliferate, and severe. In this study, a deep learning (DL) model is presented that diagnoses all five stages of DR with more accuracy than previous methods. The suggested method presents two scenarios: case 1 with image enhancement using a contrast limited adaptive histogram equalization (CLAHE) filtering algorithm in conjunction with an enhanced super-resolution generative adversarial network (ESRGAN), and case 2 without image enhancement. Augmentation techniques were then performed to generate a balanced dataset utilizing the same parameters for both cases. Using Inception-V3 applied to the Asia Pacific Tele-Ophthalmology Society (APTOS) datasets, the developed model achieved an accuracy of 98.7% for case 1 and 80.87% for case 2, which is greater than existing methods for detecting the five stages of DR. It was demonstrated that using CLAHE and ESRGAN improves a model’s performance and learning ability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11060863"
    },
    {
        "id": 6464,
        "title": "Automatic Detection and Measurement of Renal Cysts in Ultrasound Images: A Deep Learning Approach",
        "authors": "Yurie Kanauchi, Masahiro Hashimoto, Naoki Toda, Saori Okamoto, Hasnine Haque, Masahiro Jinzaki, Yasubumi Sakakibara",
        "published": "2023-2-7",
        "citations": 3,
        "abstract": "Ultrasonography is widely used for diagnosis of diseases in internal organs because it is nonradioactive, noninvasive, real-time, and inexpensive. In ultrasonography, a set of measurement markers is placed at two points to measure organs and tumors, then the position and size of the target finding are measured on this basis. Among the measurement targets of abdominal ultrasonography, renal cysts occur in 20–50% of the population regardless of age. Therefore, the frequency of measurement of renal cysts in ultrasound images is high, and the effect of automating measurement would be high as well. The aim of this study was to develop a deep learning model that can automatically detect renal cysts in ultrasound images and predict the appropriate position of a pair of salient anatomical landmarks to measure their size. The deep learning model adopted fine-tuned YOLOv5 for detection of renal cysts and fine-tuned UNet++ for prediction of saliency maps, representing the position of salient landmarks. Ultrasound images were input to YOLOv5, and images cropped inside the bounding box and detected from the input image by YOLOv5 were input to UNet++. For comparison with human performance, three sonographers manually placed salient landmarks on 100 unseen items of the test data. These salient landmark positions annotated by a board-certified radiologist were used as the ground truth. We then evaluated and compared the accuracy of the sonographers and the deep learning model. Their performances were evaluated using precision–recall metrics and the measurement error. The evaluation results show that the precision and recall of our deep learning model for detection of renal cysts are comparable to standard radiologists; the positions of the salient landmarks were predicted with an accuracy close to that of the radiologists, and in a shorter time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11040484"
    },
    {
        "id": 6465,
        "title": "CryptonDL: Encrypted Image Classification Using Deep Learning Models",
        "authors": "Adham Helbawy, Mahmoud Bahaa, Alia El Bolock",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012088000003541"
    },
    {
        "id": 6466,
        "title": "IoT-based pest detection and classification using deep features with enhanced deep learning strategies",
        "authors": "Prasath B., M. Akila",
        "published": "2023-5",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.105985"
    },
    {
        "id": 6467,
        "title": "Combining Deep Learning with Signal-image Encoding for Multi-Modal Mental Wellbeing Classification",
        "authors": "Kieran Woodward, Eiman Kanjo, Athanasios Tsanas",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "The quantification of emotional states is an important step to understanding wellbeing. Time series data from multiple modalities such as physiological and motion sensor data have proven to be integral for measuring and quantifying emotions. Monitoring emotional trajectories over long periods of time inherits some critical limitations in relation to the size of the training data. This shortcoming may hinder the development of reliable and accurate machine learning models. To address this problem, this article proposes a framework to tackle the limitation in performing emotional state recognition: (1) encoding time series data into coloured images; (2) leveraging pre-trained object recognition models to apply a Transfer Learning (TL) approach using the images from step 1; (3) utilising a 1D Convolutional Neural Network (CNN) to perform emotion classification from physiological data; (4) concatenating the pre-trained TL model with the 1D CNN. We demonstrate that model performance when inferring real-world wellbeing rated on a 5-point Likert scale can be enhanced using our framework, resulting in up to 98.5% accuracy, outperforming a conventional CNN by 4.5%. Subject-independent models using the same approach resulted in an average of 72.3% accuracy (SD 0.038). The proposed methodology helps improve performance and overcome problems with small training datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3631618"
    },
    {
        "id": 6468,
        "title": "A hybrid Grasshopper optimization algorithm for skin lesion segmentation and melanoma classification using deep learning",
        "authors": "Puneet Thapar, Manik Rakhra, Mahmood Alsaadi, Aadam Quraishi, Aniruddha Deka, Janjhyam Venkata Naga Ramesh",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100326"
    },
    {
        "id": 6469,
        "title": "YOLO-Based Deep Learning Model for Pressure Ulcer Detection and Classification",
        "authors": "Bader Aldughayfiq, Farzeen Ashfaq, N. Z. Jhanjhi, Mamoona Humayun",
        "published": "2023-4-25",
        "citations": 16,
        "abstract": "Pressure ulcers are significant healthcare concerns affecting millions of people worldwide, particularly those with limited mobility. Early detection and classification of pressure ulcers are crucial in preventing their progression and reducing associated morbidity and mortality. In this work, we present a novel approach that uses YOLOv5, an advanced and robust object detection model, to detect and classify pressure ulcers into four stages and non-pressure ulcers. We also utilize data augmentation techniques to expand our dataset and strengthen the resilience of our model. Our approach shows promising results, achieving an overall mean average precision of 76.9% and class-specific mAP50 values ranging from 66% to 99.5%. Compared to previous studies that primarily utilize CNN-based algorithms, our approach provides a more efficient and accurate solution for the detection and classification of pressure ulcers. The successful implementation of our approach has the potential to improve the early detection and treatment of pressure ulcers, resulting in better patient outcomes and reduced healthcare costs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11091222"
    },
    {
        "id": 6470,
        "title": "Anomaly Detection in Healthcare: A Deep Learning Approach with Autoencoders",
        "authors": "Arti Badhoutiya, Durgeshwar Pratap Singh, J. Relin Francis Raj, Arun Pratap Srivastava, S Lakshmana Chari, Akhilesh Kumar Khan",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489790"
    },
    {
        "id": 6471,
        "title": "Understanding of Machine Learning with Deep Learning: Architectures, Workflow, Applications and Future Directions",
        "authors": "Mohammad Mustafa Taye",
        "published": "2023-4-25",
        "citations": 81,
        "abstract": "In recent years, deep learning (DL) has been the most popular computational approach in the field of machine learning (ML), achieving exceptional results on a variety of complex cognitive tasks, matching or even surpassing human performance. Deep learning technology, which grew out of artificial neural networks (ANN), has become a big deal in computing because it can learn from data. The ability to learn enormous volumes of data is one of the benefits of deep learning. In the past few years, the field of deep learning has grown quickly, and it has been used successfully in a wide range of traditional fields. In numerous disciplines, including cybersecurity, natural language processing, bioinformatics, robotics and control, and medical information processing, deep learning has outperformed well-known machine learning approaches. In order to provide a more ideal starting point from which to create a comprehensive understanding of deep learning, also, this article aims to provide a more detailed overview of the most significant facets of deep learning, including the most current developments in the field. Moreover, this paper discusses the significance of deep learning and the various deep learning techniques and networks. Additionally, it provides an overview of real-world application areas where deep learning techniques can be utilised. We conclude by identifying possible characteristics for future generations of deep learning modelling and providing research suggestions. On the same hand, this article intends to provide a comprehensive overview of deep learning modelling that can serve as a resource for academics and industry people alike. Lastly, we provide additional issues and recommended solutions to assist researchers in comprehending the existing research gaps. Various approaches, deep learning architectures, strategies, and applications are discussed in this work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12050091"
    },
    {
        "id": 6472,
        "title": "IoT-enabled image captioning with deep learning for healthcare domain",
        "authors": "P. Steffy Sherly, P. Velvizhy",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "<p>The ever-increasing volume of medical images greatly strains clinicians who are in the process of reviewing it and writing reports. It would be more efficient and cost-effective if an image captioning model could automatically create report drafts from matching photos, thereby relieving physicians from this tedious work. The Internet of things (IoT) has switched its emphasis from its initial binary concept to that of the Internet of multimedia things (IoMT) because of the explosive rise of multilingual-on-demand data in various sound, footage, picture forms. This work proposed a deep learning-based image caption network (DL-ICN) for healthcare domain. The work originality is shown using DL to identify various class labels of the patient X-ray and ECG images. With the help of bilateral encoder representations from transformers (BERT) method for captioning pictures, a detailed written summary of a person’s medical picture may be generated automatically. Results of simulations showed that the proposed model achieved good compression performance, good quality reconstruction and good classification results for image captioning.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v7i5.1542"
    },
    {
        "id": 6473,
        "title": "Advanced Privacy Preserving Model for Smart Healthcare Using Deep Learning",
        "authors": "Pinkal Jain, Harish Kumar Shakya, Ajay Lala",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397954"
    },
    {
        "id": 6474,
        "title": "Implemented classification techniques for osteoporosis using deep learning from the perspective of healthcare analytics",
        "authors": "Lili Liu",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "BACKGROUND: Osteoporosis is a medical disorder that causes bone tissue to deteriorate and lose density, increasing the risk of fractures. Applying Neural Networks (NN) to analyze medical imaging data and detect the presence or severity of osteoporosis in patients is known as osteoporosis classification using Deep Learning (DL) algorithms. DL algorithms can extract relevant information from bone images and discover intricate patterns that could indicate osteoporosis. OBJECTIVE: DCNN biases must be initialized carefully, much like their weights. Biases that are initialized incorrectly might affect the network’s learning dynamics and hinder the model’s ability to converge to an ideal solution. In this research, Deep Convolutional Neural Networks (DCNNs) are used, which have several benefits over conventional ML techniques for image processing. METHOD: One of the key benefits of DCNNs is the ability to automatically Feature Extraction (FE) from raw data. Feature learning is a time-consuming procedure in conventional ML algorithms. During the training phase of DCNNs, the network learns to recognize relevant characteristics straight from the data. The Squirrel Search Algorithm (SSA) makes use of a combination of Local Search (LS) and Random Search (RS) techniques that are inspired by the foraging habits of squirrels. RESULTS: The method made it possible to efficiently explore the search space to find prospective values while using promising areas to refine and improve the solutions. Effectively recognizing optimum or nearly optimal solutions depends on balancing exploration and exploitation. The weight in the DCNN is optimized with the help of SSA, which enhances the performance of the classification. CONCLUSION: The comparative analysis with state-of-the-art techniques shows that the proposed SSA-based DCNN is highly accurate, with 96.57% accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/thc-231517"
    },
    {
        "id": 6475,
        "title": "Retracted: Deep Learning-Based Emergency Care Process Reengineering of Interventional Data for Patients with Emergency Time-Series Events of Myocardial Infarction",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9892624"
    },
    {
        "id": 6476,
        "title": "Application of Deep Learning in Computer Aided Vocal Tasks Learning",
        "authors": "Tianming Xu, Tianzhuo Gong",
        "published": "2023-1-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.s7.25-35"
    },
    {
        "id": 6477,
        "title": "Human activity classification using deep learning based on 3D motion feature",
        "authors": "Endang Sri Rahayu, Eko Mulyanto Yuniarno, I. Ketut Eddy Purnama, Mauridhi Hery Purnomo",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100461"
    },
    {
        "id": 6478,
        "title": "Healthcare Data Analysis using Competitive Ensemble Deep Learning Model",
        "authors": "K Gunavathy, Megha Pandeya, R Sekar",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraset59632.2023.10420381"
    },
    {
        "id": 6479,
        "title": "Deep Learning-Assisted Lung Cancer Diagnosis from Histopathology Images",
        "authors": "Chun-Cheng Peng, Jia-Wei Wu",
        "published": "2023-6-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecbios57802.2023.10218594"
    },
    {
        "id": 6480,
        "title": "Experimental Research of RFID Aided Healthcare Management Approach using IOT with Deep Learning Paradigms",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/7-4-239"
    },
    {
        "id": 6481,
        "title": "Pre-trained Deep learning model for Monkeypox Prediction using Dermoscopy Images in Healthcare",
        "authors": "Shikha Prasher, Leema Nelson, S. Gomathi",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10234989"
    },
    {
        "id": 6482,
        "title": "Empowering Healthcare with Deep Learning for Oral Cancer Prevention",
        "authors": "Akshitha K, Ashwini Kodipalli, Trupthi Rao",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10389950"
    },
    {
        "id": 6483,
        "title": "Retracted: Optimization and Evaluation of an Intelligent Short-Term Blood Glucose Prediction Model Based on Noninvasive Monitoring and Deep Learning Techniques",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9832729"
    },
    {
        "id": 6484,
        "title": "Tolstoy’s Genius Explored by Deep Learning using Transformer Architecture",
        "authors": "Shahriyar Guliyev",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "Artificial Narrow Intelligence is in the phase of moving towards the AGN, which will attempt to decide as a human being. We are getting closer to it by each day, but AI actually is indefinite to many, although it is no different than any other set of mathematically defined computer operations in its core. Generating new data from a pre-trained model introduces new challenges to science & technology. In this work, the design of such an architecture from scratch, solving problems, and introducing alternative approaches are what has been conducted. Using a deep thinker, Tolstoy, as an object of study is a source of motivation for the entire research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.132306"
    },
    {
        "id": 6485,
        "title": "Heart Rhythm Abnormal Signal Diagnosis Based on Neural Network Deep Learning",
        "authors": "Wang Jiao, Wei Wei",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecbios57802.2023.10218532"
    },
    {
        "id": 6486,
        "title": "Enhancing Healthcare Analytics: A Multiclass Supervised Learning Approach Approach for Disease Classification",
        "authors": "Deep Ajabani",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smart59791.2023.10428521"
    },
    {
        "id": 6487,
        "title": "Precision Enhanced Breast Cancer Prediction Using Deep Learning Models",
        "authors": "Abhiram Kunchapu, I.R. Oviya, Balu Bhasuran",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489171"
    },
    {
        "id": 6488,
        "title": "Augmenting roadway safety with machine learning and deep learning: Pothole detection and dimension estimation using in-vehicle technologies",
        "authors": "Cuthbert Ruseruka, Judith Mwakalonge, Gurcan Comert, Saidi Siuhi, Frank Ngeni, Quincy Anderson",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100547"
    },
    {
        "id": 6489,
        "title": "Data Preprocessing For Machine Learning Applications in Healthcare: A Review",
        "authors": "Ismail Chahid, Aissa Kerkour Elmiad, Mohammed Badaoui",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sita60746.2023.10373591"
    },
    {
        "id": 6490,
        "title": "Optimizing Naval Movement Using Deep Reinforcement Learning",
        "authors": "Joseph Coble, Armon Barton, Chris Darken, Scotty Black",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00062"
    },
    {
        "id": 6491,
        "title": "Data-driven Energy-efficient Adaptive Sampling Using Deep Reinforcement Learning",
        "authors": "Berken Utku Demirel, Luke Chen, Mohammad Abdullah Al Faruque",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "\n            This article presents a resource-efficient adaptive sampling methodology for classifying electrocardiogram (ECG) signals into different heart rhythms. We present our methodology in two folds: (\n            i\n            ) the design of a novel real-time adaptive neural network architecture capable of classifying ECG signals with different sampling rates and (\n            ii\n            ) a runtime implementation of sampling rate control using deep reinforcement learning (DRL). By using essential morphological details contained in the heartbeat waveform, the DRL agent can control the sampling rate and effectively reduce energy consumption at runtime. To evaluate our adaptive classifier, we use the MIT-BIH database and the recommendation of the AAMI to train the classifiers. The classifier is designed to recognize three major types of arrhythmias, which are supraventricular ectopic beats (SVEB), ventricular ectopic beats (VEB), and normal beats (N). The performance of the arrhythmia classification reaches an accuracy of 97.2% for SVEB and 97.6% for VEB beats. Moreover, the designed system is 7.3× more energy-efficient compared to the baseline architecture, where the adaptive sampling rate is not utilized. The proposed methodology can provide reliable and accurate real-time ECG signal analysis with performances comparable to state-of-the-art methods. Given its time-efficient, low-complexity, and low-memory-usage characteristics, the proposed methodology is also suitable for practical ECG applications, in our case for arrhythmia classification, using resource-constrained devices, especially wearable healthcare devices and implanted medical devices.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3598301"
    },
    {
        "id": 6492,
        "title": "An Image Classification and Retrieval Hybrid Model for Larger Healthcare Datasets using Deep Learning",
        "authors": "R Vasudeva,  , S N Chandrashekara",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i35.945"
    },
    {
        "id": 6493,
        "title": "Deep Learning Approach for Non-Alcoholic Fatty Liver Recognition",
        "authors": "Chun-Cheng Peng, Jian-Min Lin",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecbios57802.2023.10218601"
    },
    {
        "id": 6494,
        "title": "AI, MACHINE LEARNING, AND DEEP LEARNING: ADVANCES AND APPLICATIONS FOR EMC",
        "authors": "",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lemcpa.2023.3325491"
    },
    {
        "id": 6495,
        "title": "Deep learning in stock portfolio selection and predictions",
        "authors": "Chaher Alzaman",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121404"
    },
    {
        "id": 6496,
        "title": "AI, MACHINE LEARNING, AND DEEP LEARNING: ADVANCES AND APPLICATIONS FOR EMC",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lemcpa.2024.3362692"
    },
    {
        "id": 6497,
        "title": "Revolutionizing Healthcare with AI: Predicting Future Medication Models and Improving Patient Outcomes",
        "authors": "James Wang, Ang Li",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "This paper addresses the problem of predicting future medication models in a database using a powerful AI system [1][2]. The background highlights the importance of accurate predictions in healthcare for effective decision-making and improved patient outcomes. The proposed solution involves the development of an AI model trained on a diverse dataset of historical medication models, incorporating advanced machine learning algorithms and techniques.  The key technologies and components of the program include data preprocessing, feature selection, algorithm comparison, and performance evaluation [3]. Challenges encountered during the project, such as data quality and model generalizability, were mitigated through careful data cleaning and fine-tuning of the AI model [4][5]. The application of the system to various scenarios during experimentation demonstrated its robustness and versatility.  The most important results include high prediction accuracy, precision, and recall in forecasting future medication models. The system showed promising performance across different patient populations, suggesting its potential for personalized treatment planning and decision-making. The idea presented in this paper offers a valuable solution for healthcare professionals and researchers seeking accurate predictions in medication modeling, facilitating better patient care and optimized treatment strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131003"
    },
    {
        "id": 6498,
        "title": "A Two-Stage Deep Learning Framework for Enhanced Waste Detection and Classification",
        "authors": "Hongbo Pang, Changcheng Huang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00304"
    },
    {
        "id": 6499,
        "title": "Deep Learning for Diagonal Earlobe Crease Detection",
        "authors": "Sara Almonacid-Uribe, Oliverio Santana, Daniel Hernández-Sosa, David Freire-Obregón",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011644400003411"
    },
    {
        "id": 6500,
        "title": "A hybrid framework of traditional and deep learning segmentation methods with feature detection for optical coherence tomography (OCT) images",
        "authors": "Anshu Goyal, Sachi Pawooskar-Almeida, Muhammad W. Wahi-Anwar, Benjamin Xu, Matthew Brown, Brent J. Liu",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2656170"
    },
    {
        "id": 6501,
        "title": "Utilizing data-mining and deep learning methods on retrospective head and neck radiation therapy cases for decision support of individualized treatment planning",
        "authors": "Trent Benedick, Mengxuan Li, Emilio Wang, Sachi Pawooskar-Almeida, Anh Le, Brent Liu",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2656180"
    },
    {
        "id": 6502,
        "title": "Deep generative modelling of aircraft trajectories in terminal maneuvering areas",
        "authors": "Timothé Krauth, Adrien Lafage, Jérôme Morio, Xavier Olive, Manuel Waltert",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2022.100446"
    },
    {
        "id": 6503,
        "title": "Role of Data Sets in Analyzing the Accuracy of Deep Learning Methods Applications",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.1.nq22355"
    },
    {
        "id": 6504,
        "title": "Integrating deep learning algorithm for the lung segmentation with body-part-specific anatomical classification of medical imaging data hosted by Medical Imaging and Data Resource Center (MIDRC)",
        "authors": "Nadya Shusharina, Deepa Krishnaswamy, Paul Kinahan, Andrey Fedorov",
        "published": "2023-4-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2653606"
    }
]