[
    {
        "id": 19105,
        "title": "Overcoming Supply Chain Challenges with Advanced Machine Learning: Exploring the Potential of Deep Meta-Learning and Multi-Task Learning",
        "authors": "Beilei Zhu, Chandrasekar Vuppalapati",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csce60160.2023.00044"
    },
    {
        "id": 19106,
        "title": "Multi-Agent Deep Reinforcement Learning for Collaborative Task Scheduling",
        "authors": "Mali Gergely",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012434700003636"
    },
    {
        "id": 19107,
        "title": "CUNI Submission to MRL 2023 Shared Task on Multi-lingual Multi-task Information Retrieval",
        "authors": "Jindřich Helcl, Jindřich Libovický",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.mrl-1.23"
    },
    {
        "id": 19108,
        "title": "Multi-Scale Feature Based Fashion Attribute Extraction Using Multi-Task Learning for e-Commerce Applications",
        "authors": "Viral Parekh, Karimulla Shaik",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011686700003417"
    },
    {
        "id": 19109,
        "title": "Correlation learning based multi-task model and its application",
        "authors": "Wei XU, Jianping LUO, Xia LI, Wenming CAO",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3724/sp.j.1249.2023.04494"
    },
    {
        "id": 19110,
        "title": "Hierarchical Multi-task Learning via Task Affinity Groupings",
        "authors": "Siddharth Srivastava, Swati Bhugra, Vinay Kaushik, Brejesh Lall",
        "published": "2023-10-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223053"
    },
    {
        "id": 19111,
        "title": "Tensor Multi-Task Learning for Multi-View Representation of 3D Shape",
        "authors": "Yan Zhang, Sujia Fu, Yanyun Qu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451409"
    },
    {
        "id": 19112,
        "title": "Neural Architecture Search in the Context of Deep Multi-Task Learning",
        "authors": "Guilherme Gadelha, Herman Gomes, Leonardo Batista",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011696200003417"
    },
    {
        "id": 19113,
        "title": "A Multi-Task Learning Framework for Image Restoration Using a Novel Generative Adversarial Network",
        "authors": "Rim Walha, Fadoua Drira, Rania Bedhief",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012421000003636"
    },
    {
        "id": 19114,
        "title": "Attention Balanced Multi-Dimension Multi-Task Deep Learning for Alopecia Recognition",
        "authors": "C Saraswathi,  , B Pushpa",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i18.29"
    },
    {
        "id": 19115,
        "title": "Scale-Aware Task Message Transferring for Multi-Task Learning",
        "authors": "Shalayiding Sirejiding, Yuxiang Lu, Hongtao Lu, Yue Ding",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00319"
    },
    {
        "id": 19116,
        "title": "An End-to-End Multi-Task Learning Model for Image-based Table Recognition",
        "authors": "Nam Ly, Atsuhiro Takasu",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011685000003417"
    },
    {
        "id": 19117,
        "title": "Grape Disease Detection Network Based On Multi Task Learning and Attention Features",
        "authors": "",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2021.19.7.nq21118"
    },
    {
        "id": 19118,
        "title": "Smart Motorcycle Helmet: Utilizing CNN for Multi-Task Learning",
        "authors": "Rodriges Jesan, Kumar Pant",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "Enhancing road safety through education and enforcement relies on automated motorcycle helmet detection via video surveillance. However, existing methods encounter challenges like tracking individual motorcycles and distinguishing riders from passengers. To overcome these limitations, we propose a CNN-based multi-task learning (MTL) method. Our approach focuses on identifying and tracking individual motorcycles, particularly emphasizing rider-specific helmet use. We introduce the HELMET dataset, containing 91,000 annotated frames from 10,006 motorcycles across 12 observation sites in Myanmar, serving as a benchmark for future detection techniques. Leveraging concurrent visual similarity learning and helmet use classification, our MTL approach achieves enhanced efficiency and accuracy, operating at over 8 FPS on consumer hardware. With a weighted average F-measure of 67.3% for detecting riders and helmet use, our method underscores deep learning's accuracy and resource efficiency in gathering critical road safety data. Furthermore, we present an intelligent motorcycle helmet equipped with infrared transceivers, an image sensor, an embedded computation module, a charging module, a microphone, and earphones. Designed for large vehicle approach notification, the helmet utilizes image recognition modes for both day and night conditions. Experimental results demonstrate successful vehicle registration plate recognition for large trucks/buses, achieving up to 75% accuracy during the day and 70% at night. In real-time, the proposed intelligent motorcycle helmet detects approaching large vehicles within a 5-meter distance.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/inl5ti.2"
    },
    {
        "id": 19119,
        "title": "Multi-Label Annotation for Visual Multi-Task Learning Models",
        "authors": "Gaurang Sharma, Alexandre Angleraud, Roel Pieters",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/irc59093.2023.00012"
    },
    {
        "id": 19120,
        "title": "Towards Multi-task Learning of Speech and Speaker Recognition",
        "authors": "Nik Vaessen, David A. van Leeuwen",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-353"
    },
    {
        "id": 19121,
        "title": "Multi-task learning with graph attention networks for multi-domain task-oriented dialogue systems",
        "authors": "Meng Zhao, Lifang Wang, Zejun Jiang, Ronghan Li, Xinyu Lu, Zhongtian Hu",
        "published": "2023-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2022.110069"
    },
    {
        "id": 19122,
        "title": "Federated Multi-Task Learning: An Overview and Quantitative Evaluation",
        "authors": "Faisal Ahmed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4627317"
    },
    {
        "id": 19123,
        "title": "Smart Motorcycle Helmet: A CNN-Based Multi-Task Learning Approach",
        "authors": "Rodriges Jesan, Kumar Pant",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Automated motorcycle helmet detection through video surveillance is crucial for enhancing road safety through education and enforcement. Existing approaches face limitations, such as difficulty in tracking individual motorcycles and distinguishing drivers from passengers. To address these challenges, we propose a CNN-based multi-task learning (MTL) method for identifying and tracking individual motorcycles, with a focus on rider-specific helmet use. We introduce the HELMET dataset, comprising 91,000 annotated frames from 10,006 motorcycles across 12 observation sites in Myanmar, providing a benchmark for future detection approaches. Our MTL approach, leveraging concurrent visual similarity learning and helmet use classification, achieves improved efficiency and accuracy. The proposed method operates at over 8 FPS on consumer hardware, yielding a weighted average F-measure of 67.3% for detecting riders and helmet use. Our work showcases deep learning as an accurate and resource-efficient means of collecting critical road safety data. we present an intelligent motorcycle helmet featuring infrared transceivers, an image sensor, an embedded computation module, a charging module, a microphone, and earphones. Designed for large vehicle approach intimation, the helmet uses image recognition modes for day and night conditions. Experimental results demonstrate successful vehicle registration plate recognition for large trucks/buses, achieving up to 75% accuracy during the day and 70% at night. The proposed intelligent motorcycle helmet detects approaching large vehicles in real time within a 5-meter distance.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/inl5ti"
    },
    {
        "id": 19124,
        "title": "Multi-View Multi-Task Representation Learning for Mispronunciation Detection",
        "authors": "Yassine EL Kheir, Shammur Chowdhury, Ahmed Ali",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/slate.2023-18"
    },
    {
        "id": 19125,
        "title": "Active Learning with Task Consistency and Diversity in Multi-Task Networks",
        "authors": "Aral Hekimoglu, Michael Schmidt, Alvaro Marcos-Ramiro",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00249"
    },
    {
        "id": 19126,
        "title": "Forward Diffusion Guided Reconstruction as a Multi-Modal Multi-Task Learning Scheme",
        "authors": "Najibul Haque Sarker, M. Sohel Rahman",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222929"
    },
    {
        "id": 19127,
        "title": "Dealing with Negative Samples with Multi-Task Learning on Span-Based Joint Entity-Relation Extraction",
        "authors": "Jiamin Lu, Chenguang Xue",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Recent span-based joint extraction models have demonstrated significant advantages in both entity recognition and relation extraction. These models treat text spans as candidate entities, and span pairs as candidate relationship tuples, achieving state-of-the-art results on datasets like ADE. However, these models encounter a significant number of non-entity spans or irrelevant span pairs during the tasks, impairing model performance significantly. To address this issue, this paper introduces a span-based multitask entity-relation joint extraction model. This approach employs the multitask learning to alleviate the impact of negative samples on entity and relation classifiers. Additionally, we leverage the Intersection over Union(IoU) concept to introduce the positional information into the entity classifier, achieving a span boundary detection. Furthermore, by incorporating the entity Logits predicted by the entity classifier into the embedded representation of entity pairs, the semantic input for the relation classifier is enriched. Experimental results demonstrate that our proposed SpERT.MT model can effectively mitigate the adverse effects of excessive negative samples on the model performance. Furthermore, the model demonstrated commendable F1 scores of 73.61%, 53.72%, and 83.72% on three widely employed public datasets, namely CoNLL04, SciERC, and ADE, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131604"
    },
    {
        "id": 19128,
        "title": "PingAnLifeInsurance at SemEval-2023 Task 10: Using Multi-Task Learning to Better Detect Online Sexism",
        "authors": "Mengyuan Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.304"
    },
    {
        "id": 19129,
        "title": "SynMotor: A Benchmark Suite for Object Attribute Regression and Multi-Task Learning",
        "authors": "Chengzhi Wu, Linxi Qiu, Kanran Zhou, Julius Pfrommer, Jürgen Beyerer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011718400003417"
    },
    {
        "id": 19130,
        "title": "Research on multi-task learning method based on causal features",
        "authors": "Lei Huang, Hui Guo",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424760"
    },
    {
        "id": 19131,
        "title": "Dysarthria severity classification using multi-head attention and multi-task learning",
        "authors": "Amlu Anna Joshy, Rajeev Rajan",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.specom.2022.12.004"
    },
    {
        "id": 19132,
        "title": "Application of Knowledge Distillation to Multi-Task Speech Representation Learning",
        "authors": "Mine Kerpicci, Van Nguyen, Shuhua Zhang, Erik Visser",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-2011"
    },
    {
        "id": 19133,
        "title": "Human Multi-Task Learning: the Why and What",
        "authors": "Tobias Ludwig, Markus Siegel, Eric Schulz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1528-0"
    },
    {
        "id": 19134,
        "title": "T3S: Improving Multi-Task Reinforcement Learning with Task-Specific Feature Selector and Scheduler",
        "authors": "Yuanqiang Yu, Tianpei Yang, Yongliang Lv, Yan Zheng, Jianye Hao",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191536"
    },
    {
        "id": 19135,
        "title": "Adaptive and robust multi-task learning",
        "authors": "Yaqi Duan, Kaizheng Wang",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aos2319"
    },
    {
        "id": 19136,
        "title": "System Strength Assessment Based on Multi-task Learning",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17775/cseejpes.2023.00440"
    },
    {
        "id": 19137,
        "title": "Lazybob at SemEval-2023 Task 9: Quantifying Intimacy of Multilingual Tweets with Multi-Task Learning",
        "authors": "Mengfei Yuan, Cheng Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.128"
    },
    {
        "id": 19138,
        "title": "DynaShare: Task and Instance Conditioned Parameter Sharing for Multi-Task Learning",
        "authors": "Elahe Rahimian, Golara Javadi, Frederick Tung, Gabriel Oliveira",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00477"
    },
    {
        "id": 19139,
        "title": "A Multi-Task Learning and Transfer Learning-Based Model for Crop Leaf Disease Identification",
        "authors": "Juyuan Wang",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isctis58954.2023.10213197"
    },
    {
        "id": 19140,
        "title": "Multi-Task Representation Learning for Renewable-Power Forecasting: A Comparative Analysis of Unified Autoencoder Variants and Task-Embedding Dimensions",
        "authors": "Chandana Priya Nivarthi, Stephan Vogt, Bernhard Sick",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "Typically, renewable-power-generation forecasting using machine learning involves creating separate models for each photovoltaic or wind park, known as single-task learning models. However, transfer learning has gained popularity in recent years, as it allows for the transfer of knowledge from source parks to target parks. Nevertheless, determining the most similar source park(s) for transfer learning can be challenging, particularly when the target park has limited or no historical data samples. To address this issue, we propose a multi-task learning architecture that employs a Unified Autoencoder (UAE) to initially learn a common representation of input weather features among tasks and then utilizes a Task-Embedding layer in a Neural Network (TENN) to learn task-specific information. This proposed UAE-TENN architecture can be easily extended to new parks with or without historical data. We evaluate the performance of our proposed architecture and compare it to single-task learning models on six photovoltaic and wind farm datasets consisting of a total of 529 parks. Our results show that the UAE-TENN architecture significantly improves power-forecasting performance by 10 to 19% for photovoltaic parks and 5 to 15% for wind parks compared to baseline models. We also demonstrate that UAE-TENN improves forecast accuracy for a new park by 19% for photovoltaic parks, even in a zero-shot learning scenario where there is no historical data. Additionally, we propose variants of the Unified Autoencoder with convolutional and LSTM layers, compare their performance, and provide a comparison among architectures with different numbers of task-embedding dimensions. Finally, we demonstrate the utility of trained task embeddings for interpretation and visualization purposes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5030062"
    },
    {
        "id": 19141,
        "title": "GYM at Qur’an QA 2023 Shared Task: Multi-Task Transfer Learning for Quranic Passage Retrieval and Question Answering with Large Language Models",
        "authors": "Ghazaleh Mahmoudi, Yeganeh Morshedzadeh, Sauleh Eetemadi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.79"
    },
    {
        "id": 19142,
        "title": "A Framework for Multi-Task Learning in Dynamic Adaptive Streaming Over HTTP",
        "authors": "Koffka Khan,  ",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "This paper presents a framework with a taxonomy for multi-task learning in the context of Dynamic Adaptive Streaming over HTTP (DASH). DASH is a widely used technology for video streaming, and multi-task learning has emerged as a promising approach to enhance the performance and user experience of DASH systems by jointly optimizing multiple related tasks. The framework provides a structured approach to design, train, and evaluate multi-task learning models in DASH, while the taxonomy categorizes the key components and approaches within the framework. The taxonomy includes task types, multitask learning approaches, input features, and training strategies. Task types encompass video quality adaptation, buffer management, bandwidth estimation, content pre-fetching, and resource allocation, representing the specific tasks involved in DASH. Multi-task learning approaches encompass methodologies such as shared representation learning, task-specific layers, multi-head architectures, knowledge distillation, and reinforcement learning, offering flexibility in model design and optimization. Input features cover video characteristics, network conditions, device capabilities, and user preferences, providing the necessary information for informed decision-making across tasks. Training strategies include joint training, alternate training, hierarchical training, task weighting, and task balancing, determining how the multi-task learning model is trained and optimized. By following the presented framework and taxonomy, researchers and practitioners can systematically approach the design, training, and evaluation of multi-task learning models in DASH. The framework enables the development of efficient and adaptive video streaming systems by leveraging the interdependencies among tasks. The taxonomy helps organize the components and approaches within the framework, aiding in a better understanding of the various aspects of multi-task learning in the DASH context. Overall, this framework and taxonomy provide a valuable resource for advancing the field of multitask learning in the dynamic and complex domain of video streaming over HTTP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijmra/v6-i6-14"
    },
    {
        "id": 19143,
        "title": "Speech Emotion Recognition using Decomposed Speech via Multi-task Learning",
        "authors": "Jia-Hao Hsu, Chung-Hsien Wu, Yu-Hung Wei",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-396"
    },
    {
        "id": 19144,
        "title": "Additive multi-task learning models and task diagnostics",
        "authors": "Nikolay Miller, Guoyi Zhang",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/03610918.2023.2212430"
    },
    {
        "id": 19145,
        "title": "Multi-Agent Reinforcement Learning Assisted Multi-Task Decision Making for UAV Swarm",
        "authors": "Wenlong Li, Yifan Zhou, Jia Shi",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicn59530.2023.10393695"
    },
    {
        "id": 19146,
        "title": "Dual adaptive learning multi-task multi-view for graph network representation learning",
        "authors": "Beibei Han, Yingmei Wei, Qingyong Wang, Shanshan Wan",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.02.026"
    },
    {
        "id": 19147,
        "title": "Multi-Task Learning and Gender-Aware Fashion Recommendation System Using Deep Learning",
        "authors": "Al-Zuhairi Naham, Jiayang Wang, Al-Sabri Raeed",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "Many people wonder, when they look at fashion models on social media or on television, whether they could look like them by wearing similar products. Furthermore, many people suffer when they sometimes find fashion models in e-commerce, and they want to obtain similar products, but after clicking on the fashion model, they receive unwanted products or products for the opposite gender. To address these issues, in our work, we built a multi-task learning and gender-aware fashion recommendation system (MLGFRS). The proposed MLGFRS can increase the revenue of the e-commerce fashion market. Moreover, we realized that people are accustomed to clicking on that part of the fashion model, which includes the product they want to obtain. Therefore, we classified the query image into many cropped products to detect the user’s click. What makes this paper novel is that we contributed to improving the efficiency performance by detecting the gender from the query image to reduce the retrieving time. Second, we effectively improved the quality of results by retrieving similarities for each object in the query image to recommend the most relevant products. The MLGFRS consists of four components: gender detection, object detection, similarity generation, and recommendation results. The MLGFRS achieves better performance compared to the state-of-the-art baselines.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12163396"
    },
    {
        "id": 19148,
        "title": "EMS2L: Enhanced Multi-Task Self-Supervised Learning for 3D Skeleton Representation Learning",
        "authors": "Lilang Lin, Jiaying Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/116.00000022"
    },
    {
        "id": 19149,
        "title": "MMER: Multimodal Multi-task Learning for Speech Emotion Recognition",
        "authors": "Sreyan Ghosh, Utkarsh Tyagi, S Ramaneswaran, Harshvardhan Srivastava, Dinesh Manocha",
        "published": "2023-8-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-2271"
    },
    {
        "id": 19150,
        "title": "Multi-Modal Medical Image Matching Based on Multi-Task Learning and Semantic-Enhanced Cross-Modal Retrieval",
        "authors": "Yilin Zhang",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "With the continuous advancement of medical imaging technology, a vast amount of multi-modal medical image data has been extensively utilized for disease diagnosis, treatment, and research. Effective management and utilization of these data becomes a pivotal challenge, particularly when undertaking image matching and retrieval. Although numerous methods for medical image matching and retrieval exist, they primarily rely on traditional image processing techniques, often limited to manual feature extraction and singular modality handling. To address these limitations, this study introduces an algorithm for medical image matching grounded in multi-task learning, further investigating a semantic-enhanced technique for cross-modal medical image retrieval. By deeply exploring complementary semantic information between different modality medical images, these methods offer novel perspectives and tools for the domain of medical image matching and retrieval.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ts.400522"
    },
    {
        "id": 19151,
        "title": "Graph-Based Multi-Task Learning For Fault Detection In Smart Grid",
        "authors": "Dibaloke Chanda, Nasim Yahya Soltani",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285865"
    },
    {
        "id": 19152,
        "title": "Simultaneous Action and Grasp Feasibility Prediction for Task and Motion Planning Through Multi-Task Learning",
        "authors": "Smail Ait Bouhsain, Rachid Alami, Thierry Siméon",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341257"
    },
    {
        "id": 19153,
        "title": "DH-FBK at SemEval-2023 Task 10: Multi-Task Learning with Classifier Ensemble Agreement for Sexism Detection",
        "authors": "Elisa Leonardelli, Camilla Casula",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.261"
    },
    {
        "id": 19154,
        "title": "Multi-Task Deep Learning with Task Attention for Post-Click Conversion Rate Prediction",
        "authors": "Hongxin Luo, Xiaobing Zhou, Haiyan Ding, Liqing Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.036622"
    },
    {
        "id": 19155,
        "title": "Cross-task Attention Mechanism for Dense Multi-task Learning",
        "authors": "Ivan Lopes, Tuan-Hung Vu, Raoul de Charette",
        "published": "2023-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00236"
    },
    {
        "id": 19156,
        "title": "UM6P &amp; UL at WojoodNER shared task: Improving Multi-Task Learning for Flat and Nested Arabic Named Entity Recognition",
        "authors": "Abdelkader Mahdaouy, Salima Lamsiyah, Hamza Alami, Christoph Schommer, Ismail Berrada",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.87"
    },
    {
        "id": 19157,
        "title": "Multi-Task Multi-Fidelity Machine Learning for Reliability-Based Design With Partially Observed Information",
        "authors": "Yanwen Xu, Hao Wu, Zheng Liu, Pingfeng Wang",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "Abstract\nIn complex engineering systems, assessing system performance and underlying failure mechanisms with respect to uncertain variables requires repeated testing, which is often limited by test capacity and computational budget and fails to accurately capture the complex system’s high-dimensional nature. A method that can efficiently use information that is partially available from various sources is thus urgently needed for complex system design. This paper presents a multi-fidelity surrogate modeling strategy that efficiently utilizes partially observed information (POI) from various sources, including data with different fidelity and dimensionality. Additionally, in reliability analysis and design optimization tasks, multiple constraints must be evaluated concurrently for each design point. However, as the complexity of systems increases, the number of constraints grows, resulting in a rapid increase in computational effort. Therefore, a multi-fidelity multi-task surrogate modeling framework with POI was proposed to aid in the development of surrogate models, which increases the effectiveness of reliability analysis. The proposed multi-fidelity multi-task machine learning (MFMT-ML) model utilizes a Bayesian framework, which significantly improves the predictive model’s performance and provides uncertainty quantification of the prediction. It also offers premium features such as using multi-fidelity sources of data points and POI, allowing simultaneous evaluation of multiple constraints through a single test, and offering a highly accurate and efficient reliability-based design optimization framework through knowledge sharing. By incorporating partially observed information from various sources, our approach offers a promising avenue for improving system performance prediction accuracy and efficiency while reducing the cost and complexity of complex system design.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-117032"
    },
    {
        "id": 19158,
        "title": "Multimodal Sentiment Analysis Method Based on Multi-task Learning",
        "authors": "Jie Li, Hongwei Zhao",
        "published": "2023-7-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3614008.3614055"
    },
    {
        "id": 19159,
        "title": "Target Vocabulary Recognition Based on Multi-Task Learning with Decomposed Teacher Sequences",
        "authors": "Aoi Ito, Tatsuya Komatsu, Yusuke Fujita, Yusuke Kida",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-2257"
    },
    {
        "id": 19160,
        "title": "Cascaded Multi-task Adaptive Learning Based on Neural Architecture Search",
        "authors": "Yingying Gao, Shilei Zhang, Zihao Cui, Chao Deng, Junlan Feng",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-341"
    },
    {
        "id": 19161,
        "title": "Coded Distributed Computing for Hierarchical Multi-task Learning",
        "authors": "Haoyang Hu, Songze Li, Minquan Cheng, Youlong Wu",
        "published": "2023-4-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itw55543.2023.10161632"
    },
    {
        "id": 19162,
        "title": "Advances and Challenges in Multi-Domain Task-Oriented Dialogue Policy Optimization",
        "authors": "Mahdin Rohmatillah, Jen-Tzung Chien",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/116.00000132"
    },
    {
        "id": 19163,
        "title": "Intelligent Online Routing in SDN via Multi-Task Multi-Agent Reinforcement Learning",
        "authors": "Wu Tong, Wu Lijun",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccwamtip60502.2023.10387119"
    },
    {
        "id": 19164,
        "title": "Improving Speech Emotion Recognition with Data Expression Aware Multi-Task Learning",
        "authors": "Pooja Kumawat, Aurobinda Routray",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289986"
    },
    {
        "id": 19165,
        "title": "MT-SLVR: Multi-Task Self-Supervised Learning for Transformation In(Variant) Representations",
        "authors": "Calum Heggan, Tim Hospedales, Sam Budgett, Mehrdad Yaghoobi",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1064"
    },
    {
        "id": 19166,
        "title": "Achievement-based Training Progress Balancing for Multi-Task Learning",
        "authors": "Hayoung Yun, Hanjoo Cho",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01553"
    },
    {
        "id": 19167,
        "title": "MTSTR: Multi-task learning for low-resolution scene text recognition via dual attention mechanism and its application in logistics industry",
        "authors": "Herui Heng, Si Li, Peiji Li, Qianfeng Lin, Yufen Chen, Lei Zhang",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Recognizing texts in images plays an important role in many applications, such as industrial intelligence, robot vision, automatic driving, command assistance, and scene understanding. Although great progress has been achieved in various fields, research on complex systems modeling using text recognition technology requires further attention. To address this, we propose a new end-to-end multi-task learning method, which includes a super-resolution branch (SRB) and a recognition branch. To effectively learn the semantic information of images, we utilize the feature pyramid network (FPN) to fuse high- and low-level semantic information. The feature map generated by FPN is then delivered separately to the super-resolution branch and the recognition branch. We introduce a novel super-resolution branch, the SRB based on the proposed dual attention mechanism (DAM), designed to enhance the capability of learning low-resolution text features. The DAM incorporates the residual channel attention to enhance channel dependencies and the character attention module to focus on context information. For the recognition branch, the feature map generated by FPN is fed into an RNN sequence module, and an attention-based decoder is constructed to predict the results. To address the issue of low-resolution text recognition in numerous Chinese scenes, we propose the Chinese super-resolution datasets instead of relying on traditional down-sampling techniques to generate training datasets. Experiments demonstrate that the proposed method performs robustly on low-resolution text images and achieves competitive results on benchmark datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0294943"
    },
    {
        "id": 19168,
        "title": "CL-UZH at SemEval-2023 Task 10: Sexism Detection through Incremental Fine-Tuning and Multi-Task Learning with Label Descriptions",
        "authors": "Janis Goldzycher",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.216"
    },
    {
        "id": 19169,
        "title": "Fallen apple detection as an auxiliary task: Boosting robotic apple detection performance through multi-task learning",
        "authors": "Jiayi Zhao, Aldo Lipani, Calogero Schillaci",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.atech.2024.100436"
    },
    {
        "id": 19170,
        "title": "Few-Shot Structured Policy Learning for Multi-Domain and Multi-Task Dialogues",
        "authors": "Thibault Cordier, Tanguy Urvoy, Fabrice Lefèvre, Lina M. Rojas Barahona",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.32"
    },
    {
        "id": 19171,
        "title": "Multi-Adaptive Optimization for multi-task learning with deep neural networks",
        "authors": "Álvaro S. Hervella, José Rouco, Jorge Novo, Marcos Ortega",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.038"
    },
    {
        "id": 19172,
        "title": "An AGV Task Scheduling Method Based on Multi-Agent Reinforcement Learning",
        "authors": "Yuxin Zhao, Ke Zhu, Xueming Song, Jianming Zhang",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ddcls58216.2023.10166593"
    },
    {
        "id": 19173,
        "title": "Learning to rank and predict: Multi-task learning for ad hoc retrieval and query performance prediction",
        "authors": "Maryam Khodabakhsh, Ebrahim Bagheri",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2023.119015"
    },
    {
        "id": 19174,
        "title": "A Multi-task Learning Based Interest Fusion Model for Recommendation",
        "authors": "Yang Zhou, Hoiio Kong",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosse58936.2023.00021"
    },
    {
        "id": 19175,
        "title": "Adversarial Multi-task Learning for End-to-end Metaphor Detection",
        "authors": "Shenglong Zhang, Ying Liu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.96"
    },
    {
        "id": 19176,
        "title": "Multi-Task Learning for Suicide Risk Detection on Chinese Dialogue",
        "authors": "Yu Yan, Dongchen Jiang",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibm58861.2023.10385863"
    },
    {
        "id": 19177,
        "title": "Multi-Task Learning for Screen Content Image Coding",
        "authors": "Rashid Zamanshoar Heris, Ivan V. Bajić",
        "published": "2023-5-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscas46773.2023.10182105"
    },
    {
        "id": 19178,
        "title": "A Multi-Task Deep Learning Model for Inflation Forecasting: Dynamic Phillips Curve Neural Network",
        "authors": "Robert Proner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4454118"
    },
    {
        "id": 19179,
        "title": "Personalized Decentralized Multi-Task Learning Over Dynamic Communication Graphs",
        "authors": "Matin Mortaheb, Sennur Ulukus",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciss56502.2023.10089777"
    },
    {
        "id": 19180,
        "title": "A Joint Model for Pronunciation Assessment and Mispronunciation Detection and Diagnosis with Multi-task Learning",
        "authors": "Hyungshin Ryu, Sunhee Kim, Minhwa Chung",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-337"
    },
    {
        "id": 19181,
        "title": "A Multi-Task Learning Framework for Sound Event Detection using High-level Acoustic Characteristics of Sounds",
        "authors": "Tanmay Khandelwal, Rohan Kumar Das",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-909"
    },
    {
        "id": 19182,
        "title": "ADMET property prediction via multi-task graph learning under adaptive auxiliary task selection",
        "authors": "Bing-Xue Du, Yi Xu, Siu-Ming Yiu, Hui Yu, Jian-Yu Shi",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.isci.2023.108285"
    },
    {
        "id": 19183,
        "title": "Multi-Wavelength Diffractive Photonic Neural Network for Multi-Task Learning",
        "authors": "Zhengyang Duan, Hang Chen, Xing Lin",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oecc56963.2023.10209650"
    },
    {
        "id": 19184,
        "title": "Multi-scale and multi-task learning for human audio forensics based on convolutional networks",
        "authors": "Congrui Yin",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2681344"
    },
    {
        "id": 19185,
        "title": "Multi-Modal Multi-Task Learning for Semantic Segmentation of Land Cover Under Cloudy Conditions",
        "authors": "Fang Xu, Yilei Shi, Wen Yang, Xiaoxiang Zhu",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10281865"
    },
    {
        "id": 19186,
        "title": "Machine Learning for Fuel Property Predictions: A Multi-Task and Transfer Learning Approach",
        "authors": "Tara Larsson, Florence Vermeire, Sebastian Verhelst",
        "published": "2023-4-11",
        "citations": 2,
        "abstract": "<div class=\"section abstract\"><div class=\"htmlview paragraph\">Despite the increasing number of electrified vehicles the transportation system still largely depends on the use of fossil fuels. One way to more rapidly reduce the dependency on fossil fuels in transport is to replace them with biofuels. Evaluating the potential of different biofuels in different applications requires knowledge of their physicochemical properties. In chemistry, message passing neural networks (MPNNs) correlating the atoms and bonds of a molecule to properties have shown promising results in predicting the properties of individual chemical components. In this article a machine learning approach, developed from the message passing neural network called Chemprop, is evaluated for the prediction of multiple properties of organic molecules (containing carbon, nitrogen, oxygen and hydrogen). A novel approach using transfer learning based on estimated property values from theoretical estimation methods is applied. Moreover, the effect of multi-task learning (MTL) on the predictions of fuel properties is evaluated. The result show that both transfer learning and multi-task learning are good strategies to improve the accuracy of the predicted values, and that accurate predictions for multiple fuel properties can be obtained using this approach.</div></div>",
        "keywords": "",
        "link": "http://dx.doi.org/10.4271/2023-01-0337"
    },
    {
        "id": 19187,
        "title": "ASAP: Accurate Synthesis Analysis and Prediction with Multi-Task Learning",
        "authors": "Yikang Ouyang, Sicheng Li, Dongsheng Zuo, Hanwei Fan, Yuzhe Ma",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcad58807.2023.10299840"
    },
    {
        "id": 19188,
        "title": "Learning Conflict-Noticed Architecture for Multi-Task Learning",
        "authors": "Zhixiong Yue, Yu Zhang, Jie Liang",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Multi-task learning has been widely used in many applications to enable more efficient learning by sharing part of the architecture across multiple tasks. However, a major challenge is the gradient conflict when optimizing the shared parameters, where the gradients of different tasks could have opposite directions. Directly averaging those gradients will impair the performance of some tasks and cause negative transfer. Different from most existing works that manipulate gradients to mitigate the gradient conflict, in this paper, we address this problem from the perspective of architecture learning and propose a Conflict-Noticed Architecture Learning (CoNAL) method to alleviate the gradient conflict by learning architectures. By introducing purely-specific modules specific to each task in the search space, the CoNAL method can automatically learn when to switch to purely-specific modules in the tree-structured network architectures when the gradient conflict occurs. To handle multi-task problems with a large number of tasks, we propose a progressive extension of the CoNAL method. Extensive experiments on computer vision, natural language processing, and reinforcement learning benchmarks demonstrate the effectiveness of the proposed methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i9.26312"
    },
    {
        "id": 19189,
        "title": "Research on Face Attribute Privacy Protection Method Based on Multi task Learning",
        "authors": "Fenfei Gu, Eric Blancaflor, Mideth Abisado",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlbdbi60823.2023.10482278"
    },
    {
        "id": 19190,
        "title": "Dr. MTL: Driver Recommendation using Federated Multi-Task Learning",
        "authors": "Jayant Vyas,  Bhumika, Debasis Das, Santanu Chaudhury",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-fall60731.2023.10333791"
    },
    {
        "id": 19191,
        "title": "Learning Multi-Granularity Task Primitives from Construction Videos for Human-Robot Collaboration",
        "authors": "Zaolin Pan, Yantao Yu",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485224.081"
    },
    {
        "id": 19192,
        "title": "A Multi-Task Learning and Data Augmentation-Based Pose Estimation Algorithm",
        "authors": "Hui Li, Jiangyuan Qi",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00082"
    },
    {
        "id": 19193,
        "title": "Multi Task Learning for Plant Leaf Segmentation and Counting",
        "authors": "Bharathi Chaudhury, Vasudha Joshi, Pabitra Mitra, Anand S Sahadevan",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apscon56343.2023.10101308"
    },
    {
        "id": 19194,
        "title": "Intrusion Detection with Uncertainty Based Loss Optimized Multi-Task Learning",
        "authors": "Huiyao Dong, Igor V. Kotenko",
        "published": "2023-11-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/istp60767.2023.10427065"
    },
    {
        "id": 19195,
        "title": "Design of Efficient Speech Emotion Recognition Based on Multi Task Learning",
        "authors": "Liu Yunxiang, Zhang Kexin",
        "published": "2023",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3237268"
    },
    {
        "id": 19196,
        "title": "Task complexity and task type",
        "authors": "Mahnaz Entezari, Mojtaba Tadayonifar",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Abstract\nIn Task-Based Language Teaching (TBLT), there is clearly a need\n                    for a balanced and flexible view of L1 use. Considering this, a matter of\n                    concern in TBLT is that learners might overuse their first language (L1) while\n                    performing complex tasks. To test this speculation, the present study\n                    investigated the effects of manipulating task complexity along\n                    resource-directing variables (+/− reasoning demands) of the Cognition Hypothesis\n                    on L1 use and its functions. Further it aimed to test the impacts of task type\n                    on L1 use and its functions. To do so, the interaction of 24 intermediate EFL\n                    learners while completing two different task types with two levels of task\n                    complexity was analyzed. The analysis of L1 words and turns indicated that both\n                    task complexity and task type affected L1 use significantly. The results further\n                    indicated that L1 was employed for a variety of purposes which were mainly\n                    affected by task complexity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.22008.ent"
    },
    {
        "id": 19197,
        "title": "AdaTask: A Task-Aware Adaptive Learning Rate Approach to Multi-Task Learning",
        "authors": "Enneng Yang, Junwei Pan, Ximei Wang, Haibin Yu, Li Shen, Xihua Chen, Lei Xiao, Jie Jiang, Guibing Guo",
        "published": "2023-6-26",
        "citations": 5,
        "abstract": "Multi-task learning (MTL) models have demonstrated impressive results in computer vision, natural language processing, and recommender systems. Even though many approaches have been proposed, how well these approaches balance different tasks on each parameter still remains unclear. In this paper, we propose to measure the task dominance degree of a parameter by the total updates of each task on this parameter. Specifically, we compute the total updates by the exponentially decaying Average of the squared Updates (AU) on a parameter from the corresponding task. Based on this novel metric, we observe that many parameters in existing MTL methods, especially those in the higher shared layers, are still dominated by one or several tasks. The dominance of AU is mainly due to the dominance of accumulative gradients from one or several tasks. Motivated by this, we propose a Task-wise Adaptive learning rate approach, AdaTask in short, to separate the accumulative gradients and hence the learning rate of each task for each parameter in adaptive learning rate approaches (e.g., AdaGrad, RMSProp, and Adam). Comprehensive experiments on computer vision and recommender system MTL datasets demonstrate that AdaTask significantly improves the performance of dominated tasks, resulting SOTA average task-wise performance.  Analysis on both synthetic and real-world datasets shows AdaTask  balance parameters in every shared layer well.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i9.26275"
    },
    {
        "id": 19198,
        "title": "Generalized Zero-Shot Image Classification via Partially-Shared Multi-Task Representation Learning",
        "authors": "Gerui Wang, Sheng Tang",
        "published": "2023-5-3",
        "citations": 0,
        "abstract": "Generalized Zero-Shot Learning (GZSL) holds significant research importance as it enables the classification of samples from both seen and unseen classes. A prevailing approach for GZSL is learning transferable representations that can generalize well to both seen and unseen classes during testing. This approach encompasses two key concepts: discriminative representations and semantic-relevant representations. “Semantic-relevant” facilitates the transfer of semantic knowledge using pre-defined semantic descriptors, while “discriminative” is crucial for accurate category discrimination. However, these two concepts are arguably inherently conflicting, as semantic descriptors are not specifically designed for image classification. Existing methods often struggle with balancing these two aspects and neglect the conflict between them, leading to suboptimal representation generalization and transferability to unseen classes. To address this issue, we propose a novel partially-shared multi-task representation learning method, termed PS-GZSL, which jointly preserves complementary and sharable knowledge between these two concepts. Specifically, we first propose a novel perspective that treats the learning of discriminative and semantic-relevant representations as optimizing a discrimination task and a visual-semantic alignment task, respectively. Then, to learn more complete and generalizable representations, PS-GZSL explicitly factorizes visual features into task-shared and task-specific representations and introduces two advanced tasks: an instance-level contrastive discrimination task and a relation-based visual-semantic alignment task. Furthermore, PS-GZSL employs Mixture-of-Experts (MoE) with a dropout mechanism to prevent representation degeneration and integrates a conditional GAN (cGAN) to synthesize unseen features for estimating unseen visual features. Extensive experiments and more competitive results on five widely-used GZSL benchmark datasets validate the effectiveness of our PS-GZSL.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12092085"
    },
    {
        "id": 19199,
        "title": "Multi-task and multi-domain learning with tensor networks",
        "authors": "Yash Garg, Ashley Prater-Bennette, Salman Asif",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663623"
    },
    {
        "id": 19200,
        "title": "A Multi-Head Ensemble Multi-Task Learning Approach for Dynamical Computation Offloading",
        "authors": "Ruihuai Liang, Bo Yang, Zhiwen Yu, Xuelin Cao, Derrick Wing Kwan Ng, Chau Yuen",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437346"
    },
    {
        "id": 19201,
        "title": "Task Sharing and Task Shifting (TSTS) in the Management of Africans with Hypertension: A Call For Action-Possibilities and Its Challenges",
        "authors": "Oluseyi Ademola Adejumo, Reuben Mutagaywa, Florence Koryo Akumiah, Adeseye Abiodun Akintunde",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5334/gh.1301"
    },
    {
        "id": 19202,
        "title": "Abstractive Summarization for the Ukrainian Language: Multi-Task Learning with Hromadske.ua News Dataset",
        "authors": "Svitlana Galeshchuk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.unlp-1.6"
    },
    {
        "id": 19203,
        "title": "Multi-Task Learning Based on Log Dynamic Loss Weighting for Sex Classification and Age Estimation on Panoramic Radiographs",
        "authors": "Igor Prado, David Lima, Julian Liang, Ana Hougaz, Bernardo Peters, Luciano Oliveira",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012317100003660"
    },
    {
        "id": 19204,
        "title": "MarsEclipse at SemEval-2023 Task 3: Multi-lingual and Multi-label Framing Detection with Contrastive Learning",
        "authors": "Qisheng Liao, Meiting Lai, Preslav Nakov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.10"
    },
    {
        "id": 19205,
        "title": "Multi-Task Learning for Design Under Uncertainty With Multi-Fidelity Partially Observed Information",
        "authors": "Yanwen Xu, Hao Wu, Zheng Liu, Pingfeng Wang, Yumeng Li",
        "published": "2024-8-1",
        "citations": 0,
        "abstract": "Abstract\nThe assessment of system performance and identification of failure mechanisms in complex engineering systems often requires the use of computation-intensive finite element software or physical experiments, which are both costly and time-consuming. Moreover, when accounting for uncertainties in the manufacturing process, material properties, and loading conditions, the process of reliability-based design optimization (RBDO) for complex engineering systems necessitates the repeated execution of expensive tasks throughout the optimization process. To address this problem, this paper proposes a novel methodology for RBDO. First, a multi-fidelity surrogate modeling strategy is presented, leveraging partially observed information (POI) from diverse sources with varying fidelity and dimensionality to reduce computational cost associated with evaluating expensive high-dimensional complex systems. Second, a multi-task surrogate modeling framework is proposed to address the concurrent evaluation of multiple constraints for each design point. The multi-task framework aids in the development of surrogate models and enhances the effectiveness of reliability analysis and design optimization. The proposed multi-fidelity multi-task machine learning model utilizes a Bayesian framework, which significantly improves the performance of the predictive model and provides uncertainty quantification of the prediction. Additionally, the model provides a highly accurate and efficient framework for reliability-based design optimization through knowledge sharing. The proposed method was applied to two design case studies. By incorporating POI from various sources, the proposed approach improves the accuracy and efficiency of system performance prediction, while simultaneously addressing the cost and complexity associated with the design of complex systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/1.4064492"
    },
    {
        "id": 19206,
        "title": "Deep Multi-task Learning for Animal Chest Circumference Estimation from Monocular Images",
        "authors": "Hongtao Zhang, Dongbing Gu",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "AbstractThe applications of deep learning algorithms with images to various scenarios have attracted significant research attention. However, application scenarios in animal breeding managements are still limited. In this paper we propose a new deep learning framework to estimate the chest circumference of domestic animals from images. This parameter is a key metric for breeding and monitoring the quality of animal in animal husbandry. We design a set of feature extraction methods based on a multi-task learning framework to address the challenging issues in the main estimation task. The multiple tasks in our proposed framework include object segmentation, keypoint estimation, and depth estimation of cow from monocular images. The domain-specific features extracted from these tasks improve upon our main estimation task. In addition, we also attempt to reduce unnecessary computations during the framework design to reduce the cost of subsequent practical implementation of the developed system. Our proposed framework is tested on our own collected dataset to evaluate its performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12559-024-10250-y"
    },
    {
        "id": 19207,
        "title": "3D Hand Pose Estimation and Shape Reconstruction based on Multi-task Learning",
        "authors": "Jiye Wang, Xiaoming Luan",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icma57826.2023.10215729"
    },
    {
        "id": 19208,
        "title": "Multi-task Learning with Self-defined Tasks for Adversarial Robustness of Deep Networks",
        "authors": "Changhun Hyun, Hyeyoung Park",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3355924"
    },
    {
        "id": 19209,
        "title": "Online Knowledge Distillation for Multi-task Learning",
        "authors": "Geethu Miriam Jacob, Vishal Agarwal, Bjorn Stenger",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00239"
    },
    {
        "id": 19210,
        "title": "Single-image super-resolution via dynamic multi-task learning and multi-level mutual feature fusion",
        "authors": "Yaofang Zhang, Yuchun Fang, Qicai Ran, Jiahua Wu",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.3.033011"
    },
    {
        "id": 19211,
        "title": "Preface",
        "authors": "Kris Van den Branden, Koen Van Gorp",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00020.bra"
    },
    {
        "id": 19212,
        "title": "Preface",
        "authors": "Koen Van Gorp, Kris Van den Branden",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00017.gor"
    },
    {
        "id": 19213,
        "title": "GC-Hunter at ImageArg Shared Task: Multi-Modal Stance and Persuasiveness Learning",
        "authors": "Mohammad Shokri, Sarah Ita Levitan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.argmining-1.17"
    },
    {
        "id": 19214,
        "title": "Multi-Task Learning based Video Anomaly Detection with Attention",
        "authors": "Mohammad Baradaran, Robert Bergevin",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00290"
    },
    {
        "id": 19215,
        "title": "An effective multi-task learning framework for drug repurposing based on graph representation learning",
        "authors": "Shengwei Ye, Weizhong Zhao, Xianjun Shen, Xingpeng Jiang, Tingting He",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ymeth.2023.07.008"
    },
    {
        "id": 19216,
        "title": "Exploring task effects on register variation in second language learners’ writing",
        "authors": "Khaled Barkaoui",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Abstract\nTask-based research often focuses on the main effects of task variables on measures of complexity, accuracy, and\n\t\t\t\t\tfluency of second language (L2) writing performance. This study aimed to extend this line of research by examining the main and\n\t\t\t\t\tinteraction effects of task type, learner L2 proficiency, and L2 study on register variation in L2 learners’ writing. Each of 42\n\t\t\t\t\tChinese learners of English as a foreign language responded to independent and integrated writing tasks before and after nine\n\t\t\t\t\tmonths of English language study. Each essay (N = 168) was rated on level of formality and tagged for various\n\t\t\t\t\tlexico-syntactic features. Overall, integrated essays were judged to use more formal language and were more informationally dense\n\t\t\t\t\tthan were the independent essays. More proficient students were judged to use more formal language than did less proficient\n\t\t\t\t\tstudents. After instruction, students’ writing became more formal, more informationally dense, and more narrative. The findings\n\t\t\t\t\tand their implications for the teaching and assessment of L2 writing are discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.22009.bar"
    },
    {
        "id": 19217,
        "title": "Task weighting based on particle filter in deep multi-task learning with a view to uncertainty and performance",
        "authors": "Emad Aghajanzadeh, Tahereh Bahraini, Amir Hossein Mehrizi, Hadi Sadoghi Yazdi",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109587"
    },
    {
        "id": 19218,
        "title": "Adversarial Learning Guided Task Relatedness Refinement for Multi-Task Deep Learning",
        "authors": "Yuchun Fang, Sirui Cai, Yiting Cao, Zhengchen Li, Zhaoxiang Zhang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmm.2022.3216460"
    },
    {
        "id": 19219,
        "title": "Bangladeshi EAP teachers’ perspectives on task-based language\n\t\t\t\t\tteaching",
        "authors": "Tamoha Siddiqui, Paula Winke",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Abstract\nWe explored the extent to which academic English teachers from\n\t\t\t\t\tan English-as-a-Foreign-Language (EFL) context held beliefs that aligned with\n\t\t\t\t\tTask-Based Language Teaching (TBLT) principles, as well as their levels of\n\t\t\t\t\treceptiveness to using tasks in the classroom. In this mixed methods study, 41\n\t\t\t\t\ttertiary-level EFL teachers from Bangladesh were invited to take a survey on TBLT and\n\t\t\t\t\tparticipate in follow-up interviews. We used convergent mixed methods analysis\n\t\t\t\t\tto triangulate the data and verify the findings. Results showed that\n\t\t\t\t\tparticipants agreed with TBLT principles from a moderate to high level, and\n\t\t\t\t\tconsistently favored use of tasks over traditional activities, which included\n\t\t\t\t\taudio-lingual and form-based instruction. Moreover, teacher beliefs and\n\t\t\t\t\tpractices seemed to have become further aligned with TBLT tenets in light of the\n\t\t\t\t\tCOVID-19 pandemic and its consequential shift to online teaching.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00023.sid"
    },
    {
        "id": 19220,
        "title": "Multi-Task Time Series Forecasting Based on Graph Neural Networks",
        "authors": "Xiao Han, Yongjie Huang, Zhisong Pan, Wei Li, Yahao Hu, Gengyou Lin",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "Accurate time series forecasting is of great importance in real-world scenarios such as health care, transportation, and finance. Because of the tendency, temporal variations, and periodicity of the time series data, there are complex and dynamic dependencies among its underlying features. In time series forecasting tasks, the features learned by a specific task at the current time step (such as predicting mortality) are related to the features of historical timesteps and the features of adjacent timesteps of related tasks (such as predicting fever). Therefore, capturing dynamic dependencies in data is a challenging problem for learning accurate future prediction behavior. To address this challenge, we propose a cross-timestep feature-sharing multi-task time series forecasting model that can capture global and local dynamic dependencies in time series data. Initially, the global dynamic dependencies of features within each task are captured through a self-attention mechanism. Furthermore, an adaptive sparse graph structure is employed to capture the local dynamic dependencies inherent in the data, which can explicitly depict the correlation between features across timesteps and tasks. Lastly, the cross-timestep feature sharing between tasks is achieved through a graph attention mechanism, which strengthens the learning of shared features that are strongly correlated with a single task. It is beneficial for improving the generalization performance of the model. Our experimental results demonstrate that our method is significantly competitive compared to baseline methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25081136"
    },
    {
        "id": 19221,
        "title": "Multi-TransPathoNet: a transfer learning-based neural network for pathology image classification with multi-task learning",
        "authors": "Xin Deng, Min Li, Xiaojun Ren, Xiuyan Zheng, Fei Liang, Liang He, Min Zhu",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005930"
    },
    {
        "id": 19222,
        "title": "A conversation between task-based researchers, language teachers, and teacher trainers",
        "authors": "Laura Gurzynski-Weiss",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00024.gur"
    },
    {
        "id": 19223,
        "title": "Supporting TBLT through teacher education",
        "authors": "Martin East",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Abstract\nTask-based language teaching (TBLT) is becoming increasingly accepted in a range of contexts across the globe as a\n\t\t\t\t\tviable learner-centred alternative to more traditional teacher-fronted approaches. In theory, TBLT has a lot to commend it.\n\t\t\t\t\tHowever, since its inception TBLT has moved and developed in a variety of directions and has been subject to a host of\n\t\t\t\t\tinterpretations and orientations. In several cases, teachers hold onto teacher-fronted practices that clash with the philosophy\n\t\t\t\t\tand rationale of TBLT. These are complicating factors that can make TBLT implementation in classrooms problematic. This critical\n\t\t\t\t\tposition paper considers teacher education as a mediating and supporting variable in the successful design and implementation of\n\t\t\t\t\tTBLT and tasks in classrooms. It begins with a summary of the benefits and limitations of TBLT. It goes on to present an overview\n\t\t\t\t\tof some of the challenges that have emerged from accounts of different contexts where attempts have been made to enact TBLT ideas,\n\t\t\t\t\tincluding the role of teacher education and a comparison of a pre-service and in-service teacher education initiative in one\n\t\t\t\t\tspecific context. The paper concludes with proposing ten guiding principles for effective TBLT-oriented teacher education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.23004.eas"
    },
    {
        "id": 19224,
        "title": "Speech MOS Multi-Task Learning and Rater Bias Correction",
        "authors": "Haleh Akrami, Hannes Gamper",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096572"
    },
    {
        "id": 19225,
        "title": "Split Learning Assisted Multi-UAV System for Image Classification Task",
        "authors": "Tingkai Sun, Xiaoyan Wang, Masahiro Umehira, Yusheng Ji",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-spring57618.2023.10200607"
    },
    {
        "id": 19226,
        "title": "MT-DST: Multi-Task Strategy for Few-shot Dialog State Tracking",
        "authors": "Jingyao Tang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlbdbi60823.2023.10482155"
    },
    {
        "id": 19227,
        "title": "Interpreting and Exploiting Functional Specialization in Multi-Head Attention under Multi-task Learning",
        "authors": "Chong Li, Shaonan Wang, Yunhao Zhang, Jiajun Zhang, Chengqing Zong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.1026"
    },
    {
        "id": 19228,
        "title": "Group Buying Recommendation Model Based on Multi-task Learning",
        "authors": "Shuoyao Zhai, Baichuan Liu, Deqing Yang, Yanghua Xiao",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00080"
    },
    {
        "id": 19229,
        "title": "The Entity Relationship Extraction Method Using Improved RoBERTa and Multi-Task Learning",
        "authors": "Chaoyu Fan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.041395"
    },
    {
        "id": 19230,
        "title": "Multi-Task Self-Supervised Learning Based Tibetan-Chinese Speech-to-Speech Translation",
        "authors": "Rouhe Liu, Yue Zhao, Xiaona Xu",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ialp61005.2023.10337040"
    },
    {
        "id": 19231,
        "title": "LCT-1 at SemEval-2023 Task 10: Pre-training and Multi-task Learning for Sexism Detection and Classification",
        "authors": "Konstantin Chernyshev, Ekaterina Garanina, Duygu Bayram, Qiankun Zheng, Lukas Edman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.217"
    },
    {
        "id": 19232,
        "title": "Independent Component Alignment for Multi-Task Learning",
        "authors": "Dmitry Senushkin, Nikolay Patakin, Arseny Kuznetsov, Anton Konushin",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01923"
    },
    {
        "id": 19233,
        "title": "Enhancing Demand Prediction: A Multi-Task Learning Approach for Taxis and TNCs",
        "authors": "Yujie Guo, Ying Chen, Yu Zhang",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Taxis and Transportation Network Companies (TNCs) are important components of the urban transportation system. An accurate short-term forecast of passenger demand can help operators better allocate taxi or TNC services to achieve supply–demand balance in real time. As a result, drivers can improve the efficiency of passenger pick-ups, thereby reducing traffic congestion and contributing to the overall sustainability of the program. Previous research has proposed sophisticated machine learning and neural-network-based models to predict the short-term demand for taxi or TNC services. However, few of them jointly consider both modes, even though the short-term demand for taxis and TNCs is closely related. By enabling information sharing between the two modes, it is possible to reduce the prediction errors for both. To improve the prediction accuracy for both modes, this study proposes a multi-task learning (MTL) model that jointly predicts the short-term demand for taxis and TNCs. The model adopts a gating mechanism that selectively shares information between the two modes to avoid negative transfer. Additionally, the model captures the second-order spatial dependency of demand by applying a graph convolutional network. To test the effectiveness of the technique, this study uses taxi and TNC demand data from Manhattan, New York, as a case study. The prediction accuracy of single-task learning and multi-task learning models are compared, and the results show that the multi-task learning approach outperforms single-task learning and benchmark models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su16052065"
    },
    {
        "id": 19234,
        "title": "Multi-Task Deep Learning Games: Investigating Nash Equilibria and Convergence Properties",
        "authors": "Minhyeok Lee",
        "published": "2023-6-8",
        "citations": 2,
        "abstract": "This paper conducts a rigorous game-theoretic analysis on multi-task deep learning, providing mathematical insights into the dynamics and interactions of tasks within these models. Multi-task deep learning has attracted significant attention in recent years due to its ability to leverage shared representations across multiple correlated tasks, leading to improved generalization and reduced training time. However, understanding and examining the interactions between tasks within a multi-task deep learning system poses a considerable challenge. In this paper, we present a game-theoretic investigation of multi-task deep learning, focusing on the existence and convergence of Nash equilibria. Game theory provides a suitable framework for modeling the interactions among various tasks in a multi-task deep learning system, as it captures the strategic behavior of learning agents sharing a common set of parameters. Our primary contributions include: casting the multi-task deep learning problem as a game where each task acts as a player aiming to minimize its task-specific loss function; introducing the notion of a Nash equilibrium for the multi-task deep learning game; demonstrating the existence of at least one Nash equilibrium under specific convexity and Lipschitz continuity assumptions for the loss functions; examining the convergence characteristics of the Nash equilibrium; and providing a comprehensive analysis of the implications and limitations of our theoretical findings. We also discuss potential extensions and directions for future research in the multi-task deep learning landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12060569"
    },
    {
        "id": 19235,
        "title": "Efficient healthcare supply chain: A prioritized multi-task learning approach with task-specific regularization",
        "authors": "Soumyadipta Kar, Manas Kumar Mohanty, Parag Kumar Guha Thakurta",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108249"
    },
    {
        "id": 19236,
        "title": "Multi-Task Learning for Lung Disease Classification and Report Generation via Prior Graph Structure and Contrastive Learning",
        "authors": "Kaifeng Guo, Shihao Zheng, Ri Huang, Rongjian Gao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3322425"
    },
    {
        "id": 19237,
        "title": "A Discriminative Multi-task Learning for Autism Classification Based on Speech Signals",
        "authors": "Xiaotian Yin, Chao Zhang, Wei Wang",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscc58397.2023.10217990"
    },
    {
        "id": 19238,
        "title": "Agricultural Field Boundary Delineation From Multi-Temporal IRS P-6 LISS IV Images Using Multi-Task Learning",
        "authors": "Bharathi Chaudhury, Anand S Sahadevan, Pabitra Mitra",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/migars57353.2023.10064490"
    },
    {
        "id": 19239,
        "title": "Let’s talk tasks",
        "authors": "Laura Gurzynski-Weiss",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00019.gur"
    },
    {
        "id": 19240,
        "title": "Multi-Arm Robot Task Planning for Fruit Harvesting Using Multi-Agent Reinforcement Learning",
        "authors": "Tao Li, Feng Xie, Quan Qiu, Qingchun Feng",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341822"
    },
    {
        "id": 19241,
        "title": "3M: Multi-Task Multi-Prompt Learning Model for Aspect Based Sentiment Analysis",
        "authors": "Yanwei Bao, Xingda Li, Fuji Ren",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccis59572.2023.10263122"
    },
    {
        "id": 19242,
        "title": "Collaborative Multi-task Learning for Multi-Object Tracking and Segmentation",
        "authors": "Yiming Cui, Cheng Han, Dongfang Liu",
        "published": "2024-6-30",
        "citations": 0,
        "abstract": "The advancement of computer vision has pushed visual analysis tasks from still images to the video domain. In recent years, video instance segmentation, which aims at tracking and segment multiple objects in video frames, has drawn much attention for its potential applications in various emerging areas such as autonomous driving, intelligent transportation, and smart retail. In this article, we propose an effective framework for instance-level visual analysis on video frames, which can simultaneously conduct object detection, instance segmentation, and multi-object tracking. The core idea of our method is collaborative multi-task learning which is achieved by a novel structure, named associative connections among detection, segmentation, and tracking task heads in an end-to-end learnable CNN. These additional connections allow information propagation across multiple related tasks, so as to benefit these tasks simultaneously. We evaluate the proposed method extensively on KITTI MOTS and MOTS Challenge datasets and obtain quite encouraging results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3632181"
    },
    {
        "id": 19243,
        "title": "A Deep Multi-Task Learning Approach for Bioelectrical Signal Analysis",
        "authors": "Jishu K. Medhi, Pusheng Ren, Mengsha Hu, Xuhui Chen",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "Deep learning is a promising technique for bioelectrical signal analysis, as it can automatically discover hidden features from raw data without substantial domain knowledge. However, training a deep neural network requires a vast amount of labeled samples. Additionally, a well-trained model may be sensitive to the study object, and its performance may deteriorate sharply when transferred to other study objects. We propose a deep multi-task learning approach for bioelectrical signal analysis to address these issues. Explicitly, we define two distinct scenarios, the consistent source-target scenario and the inconsistent source-target scenario based on the motivation and purpose of the tasks. For each scenario, we present methods to decompose the original task and dataset into multiple subtasks and sub-datasets. Correspondingly, we design the generic deep parameter-sharing neural networks to solve the multi-task learning problem and illustrate the details of implementation with one-dimension convolutional neural networks (1D CNN), vanilla recurrent neural networks (RNN), recurrent neural networks with long short-term memory units (LSTM), and recurrent neural networks with gated recurrent units (GRU). In these two scenarios, we conducted extensive experiments on four electrocardiogram (ECG) databases. The results demonstrate the benefits of our approach, showing that our proposed method can improve the accuracy of ECG data analysis (up to 5.2%) in the MIT-BIH arrhythmia database.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11224566"
    },
    {
        "id": 19244,
        "title": "Multi-task learning and joint refinement between camera localization and object detection",
        "authors": "Junyi Wang, Yue Qi",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "AbstractVisual localization and object detection both play important roles in various tasks. In many indoor application scenarios where some detected objects have fixed positions, the two techniques work closely together. However, few researchers consider these two tasks simultaneously, because of a lack of datasets and the little attention paid to such environments. In this paper, we explore multi-task network design and joint refinement of detection and localization. To address the dataset problem, we construct a medium indoor scene of an aviation exhibition hall through a semi-automatic process. The dataset provides localization and detection information, and is publicly available at https://drive.google.com/drive/folders/1U28zkuN4_I0dbzkqyIAKlAl5k9oUK0jI?usp=sharing for benchmarking localization and object detection tasks. Targeting this dataset, we have designed a multi-task network, JLDNet, based on YOLO v3, that outputs a target point cloud and object bounding boxes. For dynamic environments, the detection branch also promotes the perception of dynamics. JLDNet includes image feature learning, point feature learning, feature fusion, detection construction, and point cloud regression. Moreover, object-level bundle adjustment is used to further improve localization and detection accuracy. To test JLDNet and compare it to other methods, we have conducted experiments on 7 static scenes, our constructed dataset, and the dynamic TUM RGB-D and Bonn datasets. Our results show state-of-the-art accuracy for both tasks, and the benefit of jointly working on both tasks is demonstrated.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41095-022-0319-z"
    },
    {
        "id": 19245,
        "title": "Multi-Task Learning Using Facial Features for Mental Health Screening",
        "authors": "Ricardo Flores, Avantika Shrestha, Ml Tlachac, Elke A. Rundensteiner",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386191"
    },
    {
        "id": 19246,
        "title": "Fast and Accurate Resume Parsing Method Based on Multi-Task Learning",
        "authors": "Yuhai Liang, Zhicheng Lin, Xin Shi, Haigang Ma",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ialp61005.2023.10337278"
    },
    {
        "id": 19247,
        "title": "MPCNet: GNSS Multipath Error Compensation Network via Multi-task learning",
        "authors": "Sangjae Cho, Hong-Woo Seok, Seung-Hyun Kong",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv55152.2023.10186566"
    },
    {
        "id": 19248,
        "title": "A Comparison Study: Building Identification in Aerial Imagery Using Multi-Task Learning",
        "authors": "N. Proscovia, T. L. Grobler",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282906"
    },
    {
        "id": 19249,
        "title": "Dynamic Neural Network for Multi-Task Learning Searching across Diverse Network Topologies",
        "authors": "Wonhyeok Choi, Sunghoon Im",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00368"
    },
    {
        "id": 19250,
        "title": "Music recommendation algorithms based on knowledge graph and multi-task feature learning",
        "authors": "Xinqiao Liu, Zhisheng Yang, Jinyong Cheng",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "AbstractDuring music recommendation scenarios, sparsity and cold start problems are inevitable. Auxiliary information has been utilized in music recommendation algorithms to provide users with more accurate music recommendation results. This study proposes an end-to-end framework, MMSS_MKR, that uses a knowledge graph as a source of auxiliary information to serve the information obtained from it to the recommendation module. The framework exploits Cross & Compression Units to bridge the knowledge graph embedding task with recommendation task modules. We can obtain more realistic triple information and exclude false triple information as much as possible, because our model obtains triple information through the music knowledge graph, and the information obtained through the recommendation module is used to determine the truth of the triple information; thus, the knowledge graph embedding task is used to perform the recommendation task. In the recommendation module, multiple predictions are adopted to predict the recommendation accuracy. In the knowledge graph embedding module, multiple calculations are used to calculate the score. Finally, the loss function of the model is improved to help us to obtain more useful information for music recommendations. The MMSS_MKR model achieved significant improvements in music recommendations compared with many existing recommendation models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-52463-z"
    },
    {
        "id": 19251,
        "title": "Exploring multi-task learning and data augmentation in dementia detection with self-supervised pretrained models",
        "authors": "Minchuan Chen, Chenfeng Miao, Jun Ma, Shaojun Wang, Jing Xiao",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1623"
    },
    {
        "id": 19252,
        "title": "Survey on Multi-Task Learning in Smart Transportation",
        "authors": "Mohammed Alzahrani, Qianlong Wang, Weixian Liao, Xuhui Chen, Wei Yu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3355034"
    },
    {
        "id": 19253,
        "title": "Modelling plurilingual instruction through a crosslinguistic-communicative task sequence",
        "authors": "Isabelle Wouters, Nina Woll, Pierre-Luc Paquet",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Abstract\nThis study aims to bridge the gap between ‘communicative’ and ‘plurilingual’ approaches, by providing a means for\n\t\t\t\t\tteachers to integrate learners’ plurilingual repertoires when teaching an additional language (Lx). We developed a model of\n\t\t\t\t\tcrosslinguistic instruction embedded within the task-based language teaching approach. It consists of a 4 stages task sequence:\n\t\t\t\t\tinput-based task, crosslinguistic consciousness-raising task, output-based task, and recap of the sequence. An iterative process\n\t\t\t\t\tof field testing and analysis (Harvey & Loiselle, 2009) allowed us to refine the\n\t\t\t\t\tmodel: researchers in-depth analysis (functional field test), implementation of the model in Lx classrooms (empirical field test)\n\t\t\t\t\tand experts assessment (second functional field test). Participant perceptions and evaluations provide an overview of their\n\t\t\t\t\tappreciation of different aspects, which lead to the current version of the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.22013.wou"
    },
    {
        "id": 19254,
        "title": "From sci-fi to the classroom",
        "authors": "Frederick J. Poole, Charlene Polio",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Abstract\nWith the release of ChatGPT, the use of AI in language teaching\n\t\t\t\t\thas become an issue that we cannot ignore. In this commentary, we argue that AI\n\t\t\t\t\ttools, including ChatGPT, are now among the digital resources available to\n\t\t\t\t\tstudents and teachers. We therefore need to be aware of the challenges and\n\t\t\t\t\taffordances of their uses in teaching and learning and that helping students\n\t\t\t\t\tunderstand these issues is part of the language teacher’s role in promoting\n\t\t\t\t\tdigital literacy. We first discuss the history of AI in teaching writing and\n\t\t\t\t\tthen highlight three issues related to its use: authorship, authenticity and\n\t\t\t\t\taccuracy, and digital literacies. Next, we provide examples of three tasks\n\t\t\t\t\tillustrating how AI can be used to promote language learning, genre awareness,\n\t\t\t\t\tand digital literacy. We conclude by suggesting some areas for further\n\t\t\t\t\texploration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00022.poo"
    },
    {
        "id": 19255,
        "title": "Task-specific motivation and development of the Spanish L2 self during domestic immersion",
        "authors": "Dylan Jarrett, Laura Gurzynski-Weiss",
        "published": "2023-10-4",
        "citations": 1,
        "abstract": "Abstract\nThe present study considers global (Dörnyei’s 2005 L2 selves) and\n\t\t\t\t\tmicro (task-specific) measures of motivation in a unique task-based context: a two-week, domestic Spanish immersion program for\n\t\t\t\t\thigh schoolers in the United States (Gurzynski-Weiss, in revision).\nData was collected from eight students via task-specific questionnaires (given after 30 tasks), L2 self\n\t\t\t\t\tquestionnaires (given at the beginning and end of a two-week program), and 12 daily reflective journals. Results indicated overall\n\t\t\t\t\thigh L2 self-constructs with little change over two weeks of instruction, and all task domains were rated moderately to very high\n\t\t\t\t\tfor task motivation. It was found that higher L2 self ratings regularly patterned with higher task-specific motivation, although\n\t\t\t\t\tparticipant individual differences and characteristics unique to a domestic immersion program also influenced task-specific\n\t\t\t\t\tmotivation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.21023.jar"
    },
    {
        "id": 19256,
        "title": "Students' Approaches to Mathematics Online: Its Challenges and Learning Resources",
        "authors": "Maribeth Salazar",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4316208"
    },
    {
        "id": 19257,
        "title": "Ultra-short-term multi-energy load forecasting for integrated energy systems based on multi-dimensional coupling characteristic mining and multi-task learning",
        "authors": "Nantian Huang, Xinran Wang, Hao Wang, Hefei Wang",
        "published": "2024-4-11",
        "citations": 0,
        "abstract": "To address the challenges posed by the randomness and volatility of multi-energy loads in integrated energy systems for ultra-short-term accurate load forecasting, this paper proposes an ultra-short-term multi-energy load forecasting method based on multi-dimensional coupling feature mining and multi-task learning. Firstly, a method for mining multi-dimensional coupling characteristics of multi-energy loads is proposed, integrating multiple correlation analysis methods. By constructing coupling features of multi-energy loads and using them as input features of the model, the complex coupling relationships between multi-energy loads are effectively quantified. Secondly, an ultra-short-term multi-energy load forecasting model based on multi-task learning and a temporal convolutional network is constructed. In the prediction model construction phase, the potential complex coupling characteristics between multiple loads can be fully explored, and the potential temporal associations and long-term dependencies within data can be extracted. Then, the multi-task learning loss function weight optimization method based on homoscedastic uncertainty is used to optimize the forecasting model, realizing automatic tuning of the loss function weight parameters and further improving the prediction performance of the model. Finally, an experimental analysis is conducted using the integrated energy system of Arizona State University in the United States as an example. The results show that the proposed forecasting method has higher prediction accuracy than other prediction methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fenrg.2024.1373345"
    },
    {
        "id": 19258,
        "title": "Forecast of Short-Term Passenger Flow in Multi-Level Rail Transit Network Based on a Multi-Task Learning Model",
        "authors": "Fenling Feng, Zhaohui Zou, Chengguang Liu, Qianran Zhou, Chang Liu",
        "published": "2023-2-10",
        "citations": 2,
        "abstract": "With the refinement of the urban transportation network, more and more passengers choose the combined mode. To provide better inter-trip services, it is necessary to integrate and forecast the passenger flow of multi-level rail transit network to improve the connectivity of different transport modes. The difficulty of multi-level rail transit passenger flow prediction lies in the complexity of the spatiotemporal characteristics of the data, the different characteristics of passenger flow composition, and the difficulty of research. At present, most of the research focuses on one mode of transportation or the passenger flow within the city, while the comprehensive analysis of passenger flow under various modes of transportation is less. This study takes the key nodes of the multi-level rail transit railway hub as the research object, establishes a multi-task learning model, and forecasts the short-term passenger flow of rail transit by combining the trunk railway, intercity rail transit and subway. Different from the existing research, the model introduces convolution layer and multi-head attention mechanism to improve and optimize the Transformer multi-task learning framework, trains and processes the data of trunk railway, intercity railway, and subway as different tasks, and considers the correlation of passenger flow of trunk railway, intercity railway, and subway in the prediction. At the same time, a new residual network structure is introduced to solve the problems of over-fitting, gradient disappearance, and gradient explosion in the training process. Taking the large comprehensive transportation hub in Guangzhou metropolitan area as an example, the proposed multi-task learning model is evaluated. The improved Transformer has the highest prediction accuracy (Average prediction accuracy of passenger flow of three traffic modes) 88.569%, and others methods HA, FC-LSTM and STGCN are 81.579%, 82.230% and 81.761%, respectively. The results show that the proposed multi-task learning model has better prediction performance than the existing models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15043296"
    },
    {
        "id": 19259,
        "title": "Adaptive Multi-Task Learning for Multi-PAR in Real-World",
        "authors": "Haoyun Sun, Hongwei Zhao, Weishan Zhang, Liang Xu, Hongqing Guan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jrfid.2024.3371881"
    },
    {
        "id": 19260,
        "title": "Combining a multi-feature neural network with multi-task learning for emergency calls severity prediction",
        "authors": "Marianne Abi Kanaan, Jean-François Couchot, Christophe Guyeux, David Laiymani, Talar Atechian, Rony Darazi",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.array.2023.100333"
    },
    {
        "id": 19261,
        "title": "Spreading the word",
        "authors": "Koen Van Gorp, Kris Van den Branden",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.00018.gor"
    },
    {
        "id": 19262,
        "title": "Multi-dataset fusion for multi-task learning on face attribute recognition",
        "authors": "Hengjie Lu, Shugong Xu, Jiahao Wang",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patrec.2023.07.015"
    },
    {
        "id": 19263,
        "title": "Aero-engine prognosis strategy based on multi-scale feature fusion and multi-task parallel learning",
        "authors": "Liang Zhou, Huawei Wang, Shanshan Xu",
        "published": "2023-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ress.2023.109182"
    },
    {
        "id": 19264,
        "title": "Machine learning optimization for catalytic desulfurization of petroleum: Multi-layered perceptron, Multi Task Lasso, and Gaussian process regression models",
        "authors": "Rongjing Xu, Xianjun Yang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.molliq.2024.124508"
    },
    {
        "id": 19265,
        "title": "Chinese EFL teachers’ understandings and implementation of task-based language teaching",
        "authors": "Hongyu Li, Nathan Thomas",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Abstract\nAcross China, English language teaching curricula have advocated for task-based language teaching (TBLT) for more\n\t\t\t\t\tthan 20 years. Yet, there is reason to believe that practice varies widely. As such, this multiple case study sheds light on two\n\t\t\t\t\tChinese teachers’ understandings and implementation of TBLT in a public primary school in Chongqing, southwest China. Data\n\t\t\t\t\tcollection consisted of eight semi-structured interviews and eight classroom observations. Data were analyzed using qualitative\n\t\t\t\t\tcontent analysis. The analysis indicated that the teachers had basic understandings of TBLT, but their teaching was incongruent\n\t\t\t\t\twith its principles. Few tasks were observed in their lessons. Three main factors affected the teachers’ implementation of TBLT:\n\t\t\t\t\t(1) classroom management issues; (2) preparation and teaching resources; and (3) the teachers’ own tacit reluctance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.22015.li"
    },
    {
        "id": 19266,
        "title": "MetaMorphosis: Task-oriented Privacy Cognizant Feature Generation for Multi-task Learning",
        "authors": "Md Adnan Arefeen, Zhouyu Li, Md Yusuf Sarwar Uddin, Anupam Das",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3576842.3582372"
    },
    {
        "id": 19267,
        "title": "Exploiting task relationships for Alzheimer’s disease cognitive score prediction via multi-task learning",
        "authors": "Wei Liang, Kai Zhang, Peng Cao, Xiaoli Liu, Jinzhu Yang, Osmar R. Zaiane",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2022.106367"
    },
    {
        "id": 19268,
        "title": "ML Mob at SemEval-2023 Task 5: “Breaking News: Our Semi-Supervised and Multi-Task Learning Approach Spoils Clickbait”",
        "authors": "Hannah Sterz, Leonard Bongard, Tobias Werner, Clifton Poth, Martin Hentschel",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.251"
    },
    {
        "id": 19269,
        "title": "An Auxiliary Task Boosted Multi-task Learning Method for Service Account Retrieval with Limited Human Annotation",
        "authors": "Yuanzhou Yao, Zhao Zhang, Kaijia Yang, Huasheng Liang, Qiang Yan, Yongjun Xu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-industry.50"
    },
    {
        "id": 19270,
        "title": "A Survey of Multi-task Learning in Natural Language Processing: Regarding Task Relatedness and Training Methods",
        "authors": "Zhihan Zhang, Wenhao Yu, Mengxia Yu, Zhichun Guo, Meng Jiang",
        "published": "2023",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.66"
    },
    {
        "id": 19271,
        "title": "Task Aware Feature Extraction Framework for Sequential Dependence Multi-Task Learning",
        "authors": "Xuewen Tao, Mingming Ha, Qiongxu Ma, Hongwei Cheng, Wenfang Lin, Xiaobo Guo, Linxun Cheng, Bing Han",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604915.3608772"
    },
    {
        "id": 19272,
        "title": "UL &amp; UM6P at SemEval-2023 Task 10: Semi-Supervised Multi-task Learning for Explainable Detection of Online Sexism",
        "authors": "Salima Lamsiyah, Abdelkader El Mahdaouy, Hamza Alami, Ismail Berrada, Christoph Schommer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.88"
    },
    {
        "id": 19273,
        "title": "Is Multi-Task Learning an Upper Bound for Continual Learning?",
        "authors": "Zihao Wu, Huy Tran, Hamed Pirsiavash, Soheil Kolouri",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095984"
    },
    {
        "id": 19274,
        "title": "Hierarchical Prompt Learning for Multi-Task Learning",
        "authors": "Yajing Liu, Yuning Lu, Hao Liu, Yaozu An, Zhuoran Xu, Zhuokun Yao, Baofeng Zhang, Zhiwei Xiong, Chenguang Gui",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01048"
    },
    {
        "id": 19275,
        "title": "Learning Locally, Communicating Globally: Reinforcement Learning of Multi-robot Task Allocation for Cooperative Transport",
        "authors": "Kazuki Shibata, Tomohiko Jimbo, Tadashi Odashima, Keisuke Takeshita, Takamitsu Matsubara",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.10.431"
    },
    {
        "id": 19276,
        "title": "Technology-mediated task-based language teaching: a CALL evaluation framework and its pedagogical implications",
        "authors": "Nouf J. Aljohani",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09588221.2024.2317840"
    },
    {
        "id": 19277,
        "title": "Developing Multi-Task Learning Methods to Aid in Electronic Healthcare Prediction",
        "authors": "Edward Tsien, Dezhi Wu, Ana Lopez-De Fede",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00077"
    },
    {
        "id": 19278,
        "title": "Uncertainty Estimation in Neural Networks Through Multi-Task Learning",
        "authors": "Ashish James, Anusha James",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "The impressive predictive performance of deep learning techniques on a wide range of tasks has led to its widespread use. Estimating the confidence of these predictions is paramount for improving the safety and reliability of such systems. However, the uncertainty estimates provided by neural networks (NNs) tend to be overconfident and unreasonable. Previous studies have found out that ensemble of NNs typically produce good predictions and uncertainty estimates. Inspired by these, this paper presents a new framework that can quantitatively estimate the uncertainties by leveraging the advances in multi-task learning through slight modification to the existing training pipelines. This promising algorithm is developed with an intention of deployment in real world problems which already boast a good predictive performance by reusing those pretrained models. The idea is to capture the behavior of the trained NNs for the base task by augmenting it with the uncertainty estimates from a supplementary network. A series of experiments show that the proposed approach produces well calibrated uncertainty estimates with high quality predictions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/ijaia.2023.14402"
    },
    {
        "id": 19279,
        "title": "Bayesian Multi-Task Transfer Learning for Soft Prompt Tuning",
        "authors": "Haeju Lee, Minchan Jeong, Se-Young Yun, Kee-Eung Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.329"
    },
    {
        "id": 19280,
        "title": "Multi-Task Learning via Time-Aware Neural ODE",
        "authors": "Feiyang Ye, Xuehao Wang, Yu Zhang, Ivor W. Tsang",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Multi-Task Learning (MTL) is a well-established paradigm for learning shared models for a diverse set of tasks. Moreover, MTL improves data efficiency by jointly training all tasks simultaneously. However, directly optimizing the losses of all the tasks may lead to imbalanced performance on all the tasks due to the competition among tasks for the shared parameters in MTL models. Many MTL methods try to mitigate this problem by dynamically weighting task losses or manipulating task gradients. Different from existing studies, in this paper, we propose a Neural Ordinal diffeRential equation based Multi-tAsk Learning (NORMAL) method to alleviate this issue by modeling task-specific feature transformations from the perspective of dynamic flows built on the Neural Ordinary Differential Equation (NODE). Specifically, the proposed NORMAL model designs a time-aware neural ODE block to learn task-specific time information, which determines task positions of feature transformations in the dynamic flow, in NODE automatically via gradient descent methods. In this way, the proposed NORMAL model handles the problem of competing shared parameters by learning task positions. Moreover, the learned task positions can be used to measure the relevance among different tasks. Extensive experiments show that the proposed NORMAL model outperforms state-of-the-art MTL models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/500"
    },
    {
        "id": 19281,
        "title": "End-to-End Motion Planners Through Multi-Task Learning for Mobile Robots with 2D LiDAR",
        "authors": "Satoshi Hoshino, Kyohei Unuma",
        "published": "2023-1-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sii55687.2023.10039122"
    },
    {
        "id": 19282,
        "title": "Asynchronous Multi-Task Learning Based on One Stage YOLOR Algorithm",
        "authors": "Cheng-Fu Liou, Tsung-Han Lee, Jiun-In Guo",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isie51358.2023.10228120"
    },
    {
        "id": 19283,
        "title": "Constructing time-series momentum portfolios with deep multi-task learning",
        "authors": "Joel Ong, Dorien Herremans",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120587"
    },
    {
        "id": 19284,
        "title": "Improved Mixed Discrete Particle Swarms based Multi-task Assignment for UAVs",
        "authors": "Zhenshuai Jia, Bing Xiao, Hanyu Qian",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ddcls58216.2023.10166130"
    },
    {
        "id": 19285,
        "title": "A Multi-task Learning Model for Gold-two-mention Co-reference Resolution",
        "authors": "Ruicheng Liu, Guanyi Chen, Rui Mao, Erik Cambria",
        "published": "2023-6-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191719"
    },
    {
        "id": 19286,
        "title": "Multi-Task Learning for Game Review Classification with Emotion and Sarcasm Detection",
        "authors": "Xinchen Xia, Yuee Huang, Yiwen Zhang",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsc59305.2023.00032"
    },
    {
        "id": 19287,
        "title": "Multi-Task Learning for Industrial Mobile Robot Perception Using a Simulated Warehouse Dataset",
        "authors": "Dimitrios Arapis, Andrea Vallone, Milad Jami, Lazaros Nalpantidis",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecmr59166.2023.10256389"
    },
    {
        "id": 19288,
        "title": "Multi-Task Learning of Query Generation and Classification for Generative Conversational Question Rewriting",
        "authors": "Sarawoot Kongyoung, Craig MacDonald, Iadh Ounis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.913"
    },
    {
        "id": 19289,
        "title": "AdaMTL: Adaptive Input-dependent Inference for Efficient Multi-Task Learning",
        "authors": "Marina Neseem, Ahmed Agiza, Sherief Reda",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00501"
    },
    {
        "id": 19290,
        "title": "Exploiting Feature Heterogeneity for Improved Generalization in Federated Multi-task Learning",
        "authors": "Renpu Liu, Jing Yang, Cong Shen",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isit54713.2023.10206757"
    },
    {
        "id": 19291,
        "title": "Naming conventions-based multi-label and multi-task learning for fine-grained classification",
        "authors": "Qinbang Zhou, Kezhi Zhang, Feng Yue, Zhaoliang Zhang, Hui Yu",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3014589"
    },
    {
        "id": 19292,
        "title": "Gated Multi-task Learning for QoS-aware Service Recommendation",
        "authors": "Haisen Luo",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "Abstract\nIn the ever-increasing diversity of cloud environment, the recommendation of web service-related applications based on service quality is a basic tasks that both service providers and web developers are very interested in. A key challenge is how to get personalized and accurate QoS values of web services from the multi-source information of users/services. In addition, complex contexts and multi-tasking attributes also make the collaborative services quality prediction difficult to meet. Inspired by the progress of multi-task deep learning, this paper proposes a new framework of service quality prediction called multi-task gated expert network (MGEN), which is based on gating mechanism and multi-task learning. The MGEN consists of three parts: expert-based context-source feature extraction, gated interaction learning and information fusion. First, multiple expert networks are used to capture the latent representation in raw data of web services, including both implicit features in the QoS matrix and explicit features of service descriptions. In the process, several independent experts extract features from different dimensions. Second, output embedding of different expert networks is transmitted to each task layer through different weights, learning both global and local high-order feature interactions. Third, the interactive information of different tasks is fused by embedding splicing, and then fed back to the prediction module for final service recommendation. Results of the comparative experiment demonstrate that the proposed MGEN significantly outperforms the state-of-the-art models of service recommendation, where both the implicit and explicit information of various multi-source features and interaction sequences are effectively extracted. In addition, the gating mechanism performs well in the QoS prediction by independently modeling each task.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2547/1/012011"
    },
    {
        "id": 19293,
        "title": "MmAP: Multi-Modal Alignment Prompt for Cross-Domain Multi-Task Learning",
        "authors": "Yi Xin, Junlong Du, Qiang Wang, Ke Yan, Shouhong Ding",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Multi-Task Learning (MTL) is designed to train multiple correlated tasks simultaneously, thereby enhancing the performance of individual tasks. Typically, a multi-task network structure consists of a shared backbone and task-specific decoders. However, the complexity of the decoders increases with the number of tasks. To tackle this challenge, we integrate the decoder-free vision-language model CLIP, which exhibits robust zero-shot generalization capability. Recently, parameter-efficient transfer learning methods have been extensively explored with CLIP for adapting to downstream tasks, where prompt tuning showcases strong potential. Nevertheless, these methods solely fine-tune a single modality (text or visual), disrupting the modality structure of CLIP. In this paper, we first propose Multi-modal Alignment Prompt (MmAP) for CLIP, which aligns text and visual modalities during fine-tuning process. Building upon MmAP, we develop an innovative multi-task prompt learning framework. On the one hand, to maximize the complementarity of tasks with high similarity, we utilize a gradient-driven task grouping method that partitions tasks into several disjoint groups and assign a group-shared MmAP to each group. On the other hand, to preserve the unique characteristics of each task, we assign an task-specific MmAP to each task. Comprehensive experiments on two large multi-task learning datasets demonstrate that our method achieves significant performance improvements compared to full fine-tuning while only utilizing approximately ~ 0.09% of trainable parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i14.29540"
    },
    {
        "id": 19294,
        "title": "Dialogue Act-Aided Backchannel Prediction Using Multi-Task Learning",
        "authors": "Wencke Liermann, Yo-Han Park, Yong-Seok Choi, Kong Lee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.1006"
    },
    {
        "id": 19295,
        "title": "Few-Shot KBQA Method Based on Multi-Task Learning",
        "authors": "Yuan Ren, Xutong Li, Xudong Liu, Richong Zhang",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigcomp60711.2024.00043"
    },
    {
        "id": 19296,
        "title": "Multi-Trigger-Key: Toward Multi-Task Privacy Preserving in Deep Learning",
        "authors": "Ren Wang, Zhe Xu, Alfred Hero",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3360004"
    },
    {
        "id": 19297,
        "title": "MADDPG: A task offloading algorithm based on multi-agent deep reinforcement learning in vehicle-edge computing",
        "authors": "Xiaoer Wang, Shuang Ding, Guoqing Zhang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640912.3640992"
    },
    {
        "id": 19298,
        "title": "Cybersecurity Named Entity Recognition Based on Word-level Enhancement and Multi-task Learning",
        "authors": "Yiqin Lu, Hong Qi, Jiancheng Qin, Jiarui Chen, Weiqiang Pan",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3613330.3613346"
    },
    {
        "id": 19299,
        "title": "A task-based framework for oral language instruction in support of young language learners in French\n\t\t\t\t\timmersion",
        "authors": "Renée Bourgoin, Josée Le Bouthillier",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Abstract\nIn Canada, French immersion (FI) is a popular language program. In addition to needing strong pedagogies for\n\t\t\t\t\tlanguage and content instruction, primary FI teachers need to attend to students’ age, cognitive level, and lack of exposure to\n\t\t\t\t\tthe target language. We turned our attention to the potential of task-based instruction to conduct a two-year classroom-based\n\t\t\t\t\tstudy exploring communicative tasks designed specifically for young language students in FI. The study led to the development of\n\t\t\t\t\tan instructional sequence for task-based instruction for children ages 5–6, grounded in the Gradual Release of Responsibility\n\t\t\t\t\tmodel and scaffolded instruction. In addition to presenting this pedagogical framework, we discuss identify promising task-based\n\t\t\t\t\tpedagogical principles at play and highlight pathways for classroom application. We also discuss communicative tasks proposed to\n\t\t\t\t\tyoung students and offer the use of symbolic play as a type of task that shows promise for young learners in second language\n\t\t\t\t\tlearning contexts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/task.22001.bou"
    },
    {
        "id": 19300,
        "title": "Mitigating Task Interference in Multi-Task Learning via Explicit Task Routing with Non-Learnable Primitives",
        "authors": "Chuntao Ding, Zhichao Lu, Shangguang Wang, Ran Cheng, Vishnu N. Boddeti",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00749"
    },
    {
        "id": 19301,
        "title": "Task-Aware Dynamic Model Optimization for Multi-Task Learning",
        "authors": "Sujin Choi, Hyundong Jin, Eunwoo Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3339793"
    },
    {
        "id": 19302,
        "title": "Low-Rank Updates of pre-trained Weights for Multi-Task Learning",
        "authors": "Alexandre Audibert, Massih R Amini, Konstantin Usevich, Marianne Clausel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.476"
    },
    {
        "id": 19303,
        "title": "Open‐set recognition of compound jamming signal based on multi‐task multi‐label learning",
        "authors": "Yihan Xiao, Rui Zhang, Xiangzhen Yu, Yilin Jiang",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "AbstractIn the increasingly intricate electromagnetic environment, the radar receiver may simultaneously encounter multiple intentional or unintentional jamming signals, which results in temporal and spectral overlap of received signals and forms a composite jamming signal. The nature and extent of interference contained in the received signal are often unknown, while they significantly affect the accuracy of radar detection. AnOpen‐Set Compound Jamming Signal Recognition Framework based on Multi‐Task Multi‐Label (MTML‐OCJR) is proposed. Based on the time–frequency characteristic of compound jamming signals, the proposed framework employs multi‐label classification to identify components of compound jamming signals while incorporating an unknown signal detection task into the classification process. Time–frequency image reconstruction combined with extreme value model estimation is used to detect unknown types of jamming signals, enabling simultaneous signal recognition and anomaly detection. The obtained results show that the proposed approach has superior recognition performance for composite jamming signals in closed‐set environments and high anomaly detection ability for unknown signals in open‐set environments. This method has the potential to significantly enhance the effectiveness and reliability of jamming systems in battlefield scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/rsn2.12561"
    },
    {
        "id": 19304,
        "title": "Multi-Energy Load Forecasting for Integrated Energy Systems based on Causality Anlysis and Multi-Task Learning",
        "authors": "Kai Qiu, Xiaorong Sun, Xueping Pan, Jinpeng Guo, Zhitao Hu, Chenpeng Chen",
        "published": "2023-12-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/etfg55873.2023.10408150"
    }
]