[
    {
        "id": 19371,
        "title": "Mathematical runtime analysis for the non-dominated sorting genetic algorithm II (NSGA-II)",
        "authors": "Weijie Zheng, Benjamin Doerr",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.artint.2023.104016"
    },
    {
        "id": 19372,
        "title": "Operative generative design using non-dominated sorting genetic algorithm II (NSGA-II)",
        "authors": "Elnaz Tafrihi Bailey, Luisa Caldas",
        "published": "2023-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.autcon.2023.105026"
    },
    {
        "id": 19373,
        "title": "The objective design of triangular bucket for dam's spillway using Non-dominated Sorting Genetic Algorithm II: NSGA-II",
        "authors": "S.H. Hojjati, S.A.A. Salehi Neyshabouri",
        "published": "2017-2-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24200/sci.2017.2373"
    },
    {
        "id": 19374,
        "title": "Multi-Objective Optimization For Proportional Tuition Fees Assessment Using Non-Dominated Sorting Genetic Algorithm II (NSGA II)",
        "authors": "Farid Jauhari, Wayan Firdaus Mahmudy, Achmad Basuki",
        "published": "2018-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siet.2018.8693182"
    },
    {
        "id": 19375,
        "title": "A High Efficiency Thyroid Disorders Prediction System with Non-Dominated Sorting Genetic Algorithm NSGA-II as a Feature Selection Algorithm",
        "authors": "Sefer KURNAZ, Mohammed Sami MOHAMMED, Sahar Jasim MOHAMMED",
        "published": "2020-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet49848.2020.9154189"
    },
    {
        "id": 19376,
        "title": "Estimation parameters of hydrocracking model with NSGA-ii (Non-dominated Sorting Genetic Algorithm) by using discrete kinetic lumping model",
        "authors": "Guoqing Li, Chuxuan Cai",
        "published": "2017-7",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.fuel.2017.03.078"
    },
    {
        "id": 19377,
        "title": "PENJADWALAN RUANG OPERASI RUMAH SAKIT DENGAN METODE NON-DOMINATED SORTING GENETIC ALGORITHM II (NSGA-II)",
        "authors": "Yeni Roha Mahariani",
        "published": "2023-2-25",
        "citations": 0,
        "abstract": "Penjadwalan operasi pasien merupakan aktifitas penting pada kegiatan operasional rumah sakit, karena menentukan waktu pasien-pasien tertangani dengan baik. Permasalahan ini dimodelkan sebagai masalah optimasi multi-obyektif yaitu meminimalkan waktu yang digunakan saat tindakan operasi. Masalah penjadwalan operasi dirumuskan sebagai masalah mixed integer programming (MIP), sehingga variabel merepresentasikan jadwal kasus operasi yang layak untuk ruangan tertentu dalam satu hari. Tahapan dalam merumuskan solusi heuristik, yaitu menentukan fungsi objektif sebagai solusi fraksional, menentukan solusi integer dengan mengubah solusi fraksional, dan meningkatkan kualitas solusi menggunakan local branching, formulasi MIP tersebut didasarkan pada variabel time-index. Model optimasi penjadwalan pasien dapat diselesaikan dengan metode berbasis global search. Metode tersebut dapat menghasilkan sejumlah jadwal operasi non-dominated yang mendekati pareto front dalam satu proses. Walaupun mampu mendekati pareto front, isu utama dari metode berbasis global search adalah bagaimana menjaga diversitas jadwal operasi. Penelitian ini menerapkan algoritma Non-dominated Sorting Genetic Algorithm II (NSGA-II). Berdasarkan hasil uji coba, dalam hal isu diversity pada penjadwalan operasi, metode NSGA II mampu menghasilkan himpunan pareto optimal dengan tingkat diversitas terbaik sebesar 0.597. Hal ini menunjukkan bahwa metode usulan berbasis NSGA-II mampu menghasilkan jadwal operasi pasien yang beragam dengan berbagai kombinasi.",
        "link": "http://dx.doi.org/10.29100/jipi.v8i1.3989"
    },
    {
        "id": 19378,
        "title": "A First Mathematical Runtime Analysis of the Non-dominated Sorting Genetic Algorithm II (NSGA-II)",
        "authors": "Weijie Zheng, Yufei Liu, Benjamin Doerr",
        "published": "2022-6-28",
        "citations": 18,
        "abstract": "The non-dominated sorting genetic algorithm II (NSGA-II) is the most intensively used multi-objective evolutionary algorithm (MOEA) in real-world applications. However, in contrast to several simple MOEAs analyzed also via mathematical means, no such study exists for the NSGA-II so far. In this work, we show that mathematical runtime analyses are feasible also for the NSGA-II. As particular results, we prove that with a population size larger than the Pareto front size by a constant factor, the NSGA-II with two classic mutation operators and three different ways to select the parents satisfies the same asymptotic runtime guarantees as the SEMO and GSEMO algorithms on the basic OneMinMax and LOTZ benchmark functions. However, if the population size is only equal to the size of the Pareto front, then the NSGA-II cannot efficiently compute the full Pareto front (for an exponential number of iterations, the population will always miss a constant fraction of the Pareto front). Our experiments confirm the above findings.",
        "link": "http://dx.doi.org/10.1609/aaai.v36i9.21283"
    },
    {
        "id": 19379,
        "title": "The optimum design of RAM cell based on the modified-GDI method using Non-dominated Sorting Genetic Algorithm II (NSGA-II)",
        "authors": "Ebrahim Abiri, Zobeideh Bezareh, Abdolreza Darabi",
        "published": "2017-5-23",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/jifs-152591"
    },
    {
        "id": 19380,
        "title": "The First Proven Performance Guarantees for the Non-Dominated Sorting Genetic Algorithm II (NSGA-II) on a Combinatorial Optimization Problem",
        "authors": "Sacha Cerf, Benjamin Doerr, Benjamin Hebras, Yakob Kahane, Simon Wietheger",
        "published": "2023-8",
        "citations": 1,
        "abstract": "The Non-dominated Sorting Genetic Algorithm-II (NSGA-II) is one of the most prominent algorithms to solve multi-objective optimization problems. Recently, the first mathematical runtime guarantees have been obtained for this algorithm, however only for synthetic benchmark problems.\n\n\n\nIn this work, we give the first proven performance guarantees for a classic optimization problem, the NP-complete bi-objective minimum spanning tree problem. More specifically, we show that the NSGA-II with population size N >= 4((n-1) wmax + 1) computes all extremal points of the Pareto front in an expected number of O(m^2 n wmax log(n wmax)) iterations, where n is the number of vertices, m the number of edges, and wmax is the maximum edge weight in the problem instance. This result confirms, via mathematical means, the good performance of the NSGA-II observed empirically. It also shows that mathematical analyses of this algorithm are not only possible for synthetic benchmark problems, but also for more complex combinatorial optimization problems.\n\n\n\n  As a side result, we also obtain a new analysis of the performance of the  global SEMO algorithm on the bi-objective minimum spanning tree problem, which improves the previous best result by a factor of |F|, the number of extremal points of the Pareto front, a set that can be as large as n wmax. The main reason for this improvement is our observation that both multi-objective evolutionary algorithms find the different extremal points in parallel rather than sequentially, as assumed in the previous proofs.",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/613"
    },
    {
        "id": 19381,
        "title": "An Efficient Non-dominated sorting Genetic algorithm II (NSGA II) for Optimal Operation of Micro grid",
        "authors": "M. Karuppasamypandiyan, P. Aruna Jeyanthy, D. Devaraj, V. Agnes Idhaya Selvi",
        "published": "2019-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incces47820.2019.9167747"
    },
    {
        "id": 19382,
        "title": "Application of non-dominated sorting genetic algorithm (NSGA-II) in siting and sizing of wind farms and FACTS devices for optimal power flow in a system",
        "authors": "Mohammad R. Aghaebrahimi, Reza Kazemi Golkhandan, Sajjad Ahmadnia",
        "published": "2017-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/afrcon.2017.8095453"
    },
    {
        "id": 19383,
        "title": "The elitist non-dominated sorting genetic algorithm with inheritance (i-NSGA-II) and its jumping gene adaptations for multi-objective optimization",
        "authors": "Mithilesh Kumar, Chandan Guria",
        "published": "2017-3",
        "citations": 54,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ins.2016.12.003"
    },
    {
        "id": 19384,
        "title": "Robust design optimization (RDO) of thermoelectric generator system using non-dominated sorting genetic algorithm II (NSGA-II)",
        "authors": "Ungki Lee, Sudong Park, Ikjin Lee",
        "published": "2020-4",
        "citations": 46,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.energy.2020.117090"
    },
    {
        "id": 19385,
        "title": "The integrated optimization of underground stope layout designing and production scheduling incorporating a non-dominated sorting genetic algorithm (NSGA-II)",
        "authors": "Sorayya Foroughi, Jafar Khademi Hamidi, Masoud Monjezi, Micah Nehring",
        "published": "2019-10",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.resourpol.2019.101408"
    },
    {
        "id": 19386,
        "title": "Multi-objective optimization of batch electrodialysis for minimizing energy consumption by using non-dominated sorting genetic algorithm (NSGA-II)",
        "authors": "F S Rohman, N Aziz",
        "published": "2020-3-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1757-899x/736/3/032005"
    },
    {
        "id": 19387,
        "title": "BIM-based constructability-aware precast building optimization using optimality criteria and combined non-dominated sorting genetic II and great deluge algorithm (NSGA-II-GD)",
        "authors": "Weng-Lam Lao, Mingkai Li, Billy C.L. Wong, Vincent J.L. Gan, Jack C.P. Cheng",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.autcon.2023.105065"
    },
    {
        "id": 19388,
        "title": "Optimization of supply chain operation cost and gas usage quantity using non-dominated sorting genetic algorithm II (NSGA-II) Method",
        "authors": "A Ridwan, A Bahauddin, R P M Naufal",
        "published": "2020-12-1",
        "citations": 4,
        "abstract": "Abstract\nABC plant is one of seven plants in XYZ industry which produce Cold Rolling Coil (CRC) and Cold Rolling Sheet (CRS). The problems faced by ABC plant in its supply chain network are the high overall costs of supply chain operations and the quantity of gas usage. The characteristics of this problem consist of more than one objective, the best method for solving this problem called multi-objective optimization. This research is aim to identify the decision variables that will be optimized and determine the optimal quantity of each decision variable using NSGA-II method. The parameters used in this research are the population size of 50, crossover probability with range 0.1-0.9, mutation probability 0.1 and 0.2 also the number of generation 50 and 100. The result shows that the selected parameters for this research are the crossover probability of 0.7, mutation probability of 0.1, number of generation 100. Four decision variables that are optimized, namely CRC produced (Lite, Medium, and Heavy) and CRC stored with the quantities simultaneously are 40,918, 112,479, 173,758, and 43,209 tons. This result will assist the ABC plant in minimizing the overall cost of supply chain (124,532,272 USD) and the quantity of gas usage (39,634,749,440 Kcal).",
        "link": "http://dx.doi.org/10.1088/1757-899x/909/1/012063"
    },
    {
        "id": 19389,
        "title": "Better Running Time of the Non-dominated Sorting Genetic Algorithm II (NSGA-II) by Using Stochastic Tournament Selection",
        "authors": "Chao Bian, Chao Qian",
        "published": "2022",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-14721-0_30"
    },
    {
        "id": 19390,
        "title": "Optimal Transmission Expansion Planning considering Distributed Generations by using Non-dominated sorting genetic algorithm-II (NSGAII)",
        "authors": "Mehrdad Ahmadi Kamarposhti, Ersan Kabalci, Reza Alayi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Reconstructing power systems has changed the traditional planning of\npower systems and has raised new challenges in transmission expansion\nplanning (TEP). In this paper, investment cost, cost of density and\ndependability have been considered three objectives of optimization.\nAlso, multi-objective genetic algorithm NSGAII was used to solve this\nnon-convex and mixed integer problem. A fuzzy decision method has been\nused to choose the final optimal answer from the Pareto solutions\nobtained from NSGAII. Moreover, to confirm the efficiency of NSGAII\nmulti-objective genetic algorithm in solving TEP problem, the algorithm\nwas implemented in an IEEE 24 bus system and the gained results were\ncompared with previous works in this field.\n",
        "link": "http://dx.doi.org/10.22541/au.160807087.74478199/v1"
    },
    {
        "id": 19391,
        "title": "High precision estimation of optical feedback factor and linewidth enhancement using non-dominated sequential genetic algorithm II (NSGA-II)",
        "authors": "Jinyuan Yuan, Bin Liu",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2687227"
    },
    {
        "id": 19392,
        "title": "Modeling and Multi-objective Optimization of a Packed Bed Reactor for Sulfur Dioxide Removal by Magnesium Oxide Using Non-dominated Sorting Genetic Algorithm II",
        "authors": "Ali Bakhshi Ani, H. Ale Ebrahim",
        "published": "2021-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15255/cabeq.2021.1913"
    },
    {
        "id": 19393,
        "title": "Application of Non-Dominated Sorting Genetic Algorithm (NSGA-II) to Increase the Efficiency of Bakery Production: A Case Study",
        "authors": "Majharulislam Babor, Line Pedersen, Ulla Kidmose, Olivier Paquet-Durand, Bernd Hitzmann",
        "published": "2022-8-16",
        "citations": 5,
        "abstract": "Minimizing the makespan is an important research topic in manufacturing engineering because it accounts for significant production expenses. In bakery manufacturing, ovens are high-energy-consuming machines that run throughout the production time. Finding an optimal combination of makespan and oven idle time in the decisive objective space can result in substantial financial savings. This paper investigates the hybrid no-wait flow shop problems from bakeries. Production scheduling problems from multiple bakery goods manufacturing lines are optimized using Pareto-based multi-objective optimization algorithms, non-dominated sorting genetic algorithm (NSGA-II), and a random search algorithm. NSGA-II improved NSGA, leading to better convergence and spread of the solutions in the objective space, by removing computational complexity and adding elitism and diversity strategies. Instead of a single solution, a set of optimal solutions represents the trade-offs between objectives, makespan and oven idle time to improve cost-effectiveness. Computational results from actual instances show that the solutions from the algorithms significantly outperform existing schedules. The NSGA-II finds a complete set of optimal solutions for the cases, whereas the random search procedure only delivers a subset. The study shows that the application of multi-objective optimization in bakery production scheduling can reduce oven idle time from 1.7% to 26% while minimizing the makespan by up to 12%. Furthermore, by penalizing the best makespan a marginal amount, alternative optimal solutions minimize oven idle time by up to 61% compared to the actual schedule. The proposed strategy can be effective for small and medium-sized bakeries to lower production costs and reduce CO2 emissions.",
        "link": "http://dx.doi.org/10.3390/pr10081623"
    },
    {
        "id": 19394,
        "title": "A Mathematical Runtime Analysis of the Non-dominated Sorting Genetic Algorithm III (NSGA-III)",
        "authors": "Simon Wietheger, Benjamin Doerr",
        "published": "2023-8",
        "citations": 1,
        "abstract": "The Non-dominated Sorting Genetic Algorithm II (NSGA-II) is the most prominent multi-objective evolutionary algorithm for real-world applications.\n\nWhile it performs evidently well on bi-objective optimization problems, empirical studies suggest that it is less effective when applied to problems with more than two objectives. A recent mathematical runtime analysis confirmed this observation by proving the NGSA-II for an exponential number of iterations misses a constant factor of the Pareto front of the simple 3-objective OneMinMax problem.\n\n\n\nIn this work, we provide the first mathematical runtime analysis of the NSGA-III, a refinement of the NSGA-II aimed at better handling more than two objectives.\n\nWe prove that the NSGA-III with sufficiently many reference points - a small constant factor more than the size of the Pareto front, as suggested for this algorithm - computes the complete Pareto front of the 3-objective OneMinMax benchmark in an expected number of O(n log n) iterations. This result holds for all population sizes (that are at least the size of the Pareto front). It shows a drastic advantage of the NSGA-III over the NSGA-II on this benchmark. The mathematical arguments used here and in the previous work on the NSGA-II suggest that similar findings are likely for other benchmarks with three or more objectives.",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/628"
    },
    {
        "id": 19395,
        "title": "Using Dominated Solutions to the Uniformity of Non-dominated Solution Distributions in NSGA-II",
        "authors": "Kina Yokoyama, Yuji Sato",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010143502120219"
    },
    {
        "id": 19396,
        "title": "Multi-criteria Distribution Systems Reconfiguration Using Non-dominated Sorting Genetic Algorithm II",
        "authors": "SOUIFI Hayfa, Omar Kahouli, HADJ ABDALLAH Hsan",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21506/j.ponte.2017.5.38"
    },
    {
        "id": 19397,
        "title": "Experimental Investigation and Multi-objective Optimization of Savonius Wind Turbine Based on modified Non-dominated Sorting Genetic Algorithm-II",
        "authors": "Seyed Ehsan Hosseini, Omid Karimi, Mohammad Ali AsemanBakhsh",
        "published": "No Date",
        "citations": 0,
        "abstract": "This study will lead to the development of a numerical data set that will assist in the design of Savonius wind turbines. A major objective of this study is to develop a better design for Savonius turbine blades in order to increase their torque coefficients, rotational speeds, and pressure coefficients. As part of the experimental design methodology, a full dataset was generated by simulating three-dimensional scale models utilizing computational fluid dynamics (CFD) simulations that were validated by wind tunnel data. This process is multi-objective optimization for optimizing turbine performance. The twist angle, aspect ratio, and overlap ratio are all important factors in determining the optimal torque and power coefficients. The group method of data handling (GMDH) algorithm was utilized to model objective functions based on input-output data. The Pareto fronts were plotted using polynomial models obtained from the evolutionary Pareto-based optimization approach (modified NSGA-II), and the optimal commercial points were determined using TOPSIS. A comparison of three- and two-objective optimization data revealed that two-objective optimization data lie within the boundaries of a three-objective optimization problem. The torque coefficient, rotational speed, and power coefficient are all improved by 13.74%, 0.071%, and 5.32%, respectively, using multi-objective optimization. As a result of the multi-objective optimization of the turbine, some significant characteristics of objective functions were discovered.",
        "link": "http://dx.doi.org/10.20944/preprints202308.1937.v1"
    },
    {
        "id": 19398,
        "title": "Analisis Perbandingan Aggregat Of Function (AOF) dengan Non-Dominated Sorting Genetic Algorithm (NSGA-II) dalam Menentukan Optimasi Multi-Objective pada Penjadwalan Mesin Produksi Flow Shop",
        "authors": "Fifin Sonata, Dede Prabowo Wiguna",
        "published": "2018-8-29",
        "citations": 0,
        "abstract": "Penjadwalan mesin produksi dalam dunia industri memiliki peranan penting sebagai bentuk pengambilan keputusan. Salah satu jenis sistem penjadwalan mesin produksi adalah sistem penjadwalan mesin produksi tipe flow shop. Dalam penjadwalan flow shop, terdapat sejumlah pekerjaan (job) yang tiap-tiap job memiliki urutan pekerjaan mesin yang sama. Optimasi penjadwalan mesin produksi flow shop berkaitan dengan penyusunan penjadwalan mesin yang mempertimbangkan 2 objek yaitu makespan dan total tardiness. Optimasi kedua permasalahan tersebut merupakan optimasi yang bertolak belakang sehingga diperlukan model yang mengintegrasikan permasalahan tersebut dengan optimasi multi-objective A Fast Elitist Non-Dominated Sorting Genetic Algorithm for Multi-Objective Optimazitaion : NSGA-II. Dalam penelitian ini akan dibandingkan 2 buah metode yaitu Aggregat Of Function (AOF) dengan NSGA-II agar dapat terlihat nilai solusinya. Penyelesaian penjadwalan mesin produksi flow shop dengan algoritma NSGA-II untuk membangun jadwal dengan meminimalkan makespan dan total tardiness.Tujuan yang ingin dicapai adalah mengetahui bahwa model yang dikembangkan akan memberikan solusi penjadwalan mesin produksi flow shop yang efisien berupa solusi pareto optimal yang dapat memberikan sekumpulan solusi alternatif bagi pengambil keputusan dalam membuat penjadwalan mesin produksi yang diharapkan. Solusi pareto optimal yang dihasilkan merupakan solusi optimasi multi-objective yang optimal dengan trade-off terhadap seluruh objek, sehingga seluruh solusi pareto optimal sama baiknya.",
        "link": "http://dx.doi.org/10.53513/jis.v17i2.39"
    },
    {
        "id": 19399,
        "title": "Dynamic Multi-Objective Optimization of Autocatalytic Esterification in Semi Batch by Using Control Vector Parameterization (CVP) and Non-Dominated Sorting Genetic Algorithm (NSGA-II)",
        "authors": "F S Rohman, N Aziz",
        "published": "2020-4-1",
        "citations": 2,
        "abstract": "Abstract\nCatalyzed Esterification of sec-butyl propionate in semi batch reactor prefers to be solved by dynamic-nonlinear programming (NLP) based optimization for determining optimal temperature and feed flowrate trajectories. In this autocatalytic esterification process, there are contrary objective functions, i.e. maximum productivity and minimum process time. Simultaneous optimization of these objectives yields in a dynamic multi-objective optimization (DMOO) problem, which is characterized by a set of multiple solutions, known as non-dominated or Pareto solutions. In this work, a control vector parameterization (CVP) and non-dominated sorting genetic algorithm (NSGA-II) approach were used to generate the Pareto solutions for two objectives: maximize conversion and minimize process time. Each point of Pareto solutions consists of different optimal temperature reactor and feed rate profiles, which lead to a variation combination of conversion and process time. These solutions give multiple alternatives in evaluating the trade-offs and selecting the most suitable operating policy.",
        "link": "http://dx.doi.org/10.1088/1757-899x/778/1/012081"
    },
    {
        "id": 19400,
        "title": "Well Placement Optimization Enhancement by Implementation of Similarity-based Mating Scheme in Non-dominated Sorting Genetic Algorithm-II",
        "authors": "A. Rostamian",
        "published": "2017-6-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3997/2214-4609.201701482"
    },
    {
        "id": 19401,
        "title": "A multi-objective optimization model based on long short-term memory and non-dominated sorting genetic algorithm II",
        "authors": "Chunjie Yang, Heng Zhou, Zelong Li",
        "published": "2017-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac.2017.8243030"
    },
    {
        "id": 19402,
        "title": "Multi-Objective Optimization of Plate-Fin Heat Exchangers via Non-Dominated Sequencing Genetic Algorithm (NSGA-II)",
        "authors": "Shengchen Li, Zixin Deng, Jian Liu, Defu Liu",
        "published": "2022-11-20",
        "citations": 4,
        "abstract": "The rules of heat transfer and fluid flow in plate-fin heat exchanger are intricate and complex, and the selection of boundary conditions is the key to giving full play to the performance of heat exchanger. In this paper, a multi-objective optimization based on computational fluid dynamics (CFD) and non-dominated sequencing genetic algorithm (NSGA-II) was carried out to obtain the optimal performance of a plate-fin heat exchanger for an extended-range hybrid vehicle engine. The angle of serrated staggered fin, oil flow rate, and water flow rate were taken as input parameters, and the heat transfer quantity, oil pressure drop, and oil outlet temperature were taken as objective functions to perform the optimization analysis of the heat exchanger. Support vector machine regression (SVR) was used to establish the objective function, and the NSGA-II algorithm was adopted to obtain the Pareto optimal solution set. The optimal solution was determined in the Pareto optimal solution set by comprehensive evaluation based on technique for order preference by similarity to an ideal solution (TOPSIS). The results showed that the best comprehensive performance of the heat exchanger was achieved at a fin angle of 63.01°, an oil flow rate of 9.7 L/min, and a water flow rate of 6.45 L/min. At this time, the heat transfer quantity was 9.79 kW, the oil pressure drop was 13.63 kPa, and the oil outlet temperature was 65.11 °C.",
        "link": "http://dx.doi.org/10.3390/app122211792"
    },
    {
        "id": 19403,
        "title": "A first mathematical runtime analysis of the non-dominated sorting genetic algorithm II (NSGA-II)",
        "authors": "Weijie Zheng, Yufei Liu, Benjamin Doerr",
        "published": "2022-7-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3520304.3534070"
    },
    {
        "id": 19404,
        "title": "Non-dominated Sorting Genetic Algorithm (NSGA-III) for effective resource allocation in cloud",
        "authors": "A. Jemshia Miriam, R. Saminathan, S. Chakaravarthi",
        "published": "2021-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12065-020-00436-2"
    },
    {
        "id": 19405,
        "title": "A new multi-objective evolutionary algorithm for service restoration: Non-dominated Sorting Genetic Algorithm-II in subpopulation tables",
        "authors": "Leandro Tolomeu Marques, Joao Bosco Augusto London, Marcos Henrique Marcal Camillo, Telma Woerle de Lima",
        "published": "2017-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ptc.2017.7981233"
    },
    {
        "id": 19406,
        "title": "Multi-objective optimization of concentrated Photovoltaic-Thermoelectric hybrid system via non-dominated sorting genetic algorithm (NSGA II)",
        "authors": "Aminu Yusuf, Nevra Bayhan, Hasan Tiryaki, Bejan Hamawandi, Muhammet S. Toprak, Sedat Ballikaya",
        "published": "2021-5",
        "citations": 59,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.enconman.2021.114065"
    },
    {
        "id": 19407,
        "title": "NSGA-RF: Elitist non-dominated sorting genetic algorithm region-focused",
        "authors": "Nieremberg J. P. de Lyra Ramos, Glauco Fontgalland, Alfredo Gomes Neto, Silvio Ernesto Barbin",
        "published": "2017-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/apwc.2017.8062310"
    },
    {
        "id": 19408,
        "title": "MCAMC: minimizing the cost and makespan of cloud service using non-dominated sorting genetic algorithm-II",
        "authors": "A Sathya Sofia, P Emmanuel Nicholas, P Ganeshkumar",
        "published": "2019-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12046-019-1200-3"
    },
    {
        "id": 19409,
        "title": "Parallel non-dominated sorting genetic algorithm-II-based image encryption technique",
        "authors": "Manjit Kaur, Vijay Kumar",
        "published": "2018-11-17",
        "citations": 32,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/13682199.2018.1505327"
    },
    {
        "id": 19410,
        "title": "Distributed NSGA-II sharing extreme non-dominated solutions",
        "authors": "Yuji Sato, Mikiko Sato, Minami Miyakawa",
        "published": "2018-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3205651.3208769"
    },
    {
        "id": 19411,
        "title": "Demand Response Management using Non-Dominated Sorting Genetic Algorithm II",
        "authors": "Pravat Kumar Ray, Shobhit Nandkeolyar, Chee Shen Lim, I Nyoman Wahyu Satiawan",
        "published": "2020-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/pesgre45664.2020.9070522"
    },
    {
        "id": 19412,
        "title": "Multi-objective optimization of two-stroke compression release braking performance of a heavy-duty engine based on non-dominated sorting genetic algorithm II (NSGA II)",
        "authors": "Yang Wang, Dongsheng Dong, Pingshu Ge, Tao Zhang, Heng Zhang",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": " Traditional heavy-duty vehicle service brakes use the friction method to realize vehicle deceleration, which means that longer-term use of the service brake will lead to overheating. It will make the braking capacity significantly reduced, at the same time, the service brake system also will wear much faster. Engine brake has been developed continuously in recent decades since it has the advantages of small install space and weight, no attenuation of braking power, rapid response, and endurance braking. However, the complex structure and large valve load of the valve train are the main obstacles to the widespread use of two-stroke compression release braking. Two-stroke compression release braking power is the effective indicator of the braking capacity and the maximum cylinder pressure (Pmax) can reflect the load of the valve train, therefore, the braking power and Pmax need to be optimized at the same time. In this paper, the multi-objective non-dominated sorting genetic algorithm II (NSGA II) was introduced to optimize the two-stroke compression release braking performance and it was compared with the orthogonal design method. The results indicated that the braking power and Pmax of optimal solution 1 by NSGA II achieved −395.64 kW and 59.37 bar, which were 1.17% and 2.78% improved than that of orthogonal analysis, respectively. In addition, the calculation process shows that NSGA II provides a more comprehensive and reliable method to optimize the valve parameters of the two-stroke compression release brake. ",
        "link": "http://dx.doi.org/10.1177/09544070231161403"
    },
    {
        "id": 19413,
        "title": "Energy-aware traffic engineering in IP networks using non-dominated sorting genetic II algorithm",
        "authors": "Muharram Mansoorizadeh, Raheleh Samadi, Mohammad Nassiri",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijaip.2019.10008501"
    },
    {
        "id": 19414,
        "title": "Energy-aware traffic engineering in IP networks using non-dominated sorting genetic II algorithm",
        "authors": "Raheleh Samadi, Mohammad Nassiri, Muharram Mansoorizadeh",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijaip.2020.106691"
    },
    {
        "id": 19415,
        "title": "MULTI-RESOURCE ALLOCATION AND LEVELING IN MULTI-PROJECT SCHEDULING PROBLEM WITH HYBRID-CHROMOSOME NON-DOMINATED SORTING GENETIC ALGORITHM II",
        "authors": "Nathaniel Alvin, I-Tung Yang",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Multi-resource allocation and leveling in multi-project (MR-AL-MP) scheduling refers to the attempt of producing a project schedule with minimum project duration and maximum resource utilization while complying with all precedence and resource availability constraints in a multi-project environment involving multiple resources. This study proposes a model that integrates both resource allocation and leveling models into a unified framework. This study develops a modified version of the Non-Dominated Sorting Genetic Algorithm II (NSGA-II), called Hybrid-Chromosome NSGA-II, as the optimization algorithm. For validation purposes, the performance of Hybrid-Chromosome NSGA-II is compared with two benchmark metaheuristic algorithms which are Multi-Objective Particle Swarm Optimization (MOPSO) and Multi-Objective Symbiotic Organisms Search (MOSOS) in optimizing a case study. It is shown that the proposed model and algorithm are able to produce a set of non-dominated solutions that represent the feasible trade-off relationships between the objectives. Furthermore, the Hybrid-Chromosome NSGA-II is superior to MOPSO and MOSOS in terms of the quality, spread, and diversity of the solutions.",
        "link": "http://dx.doi.org/10.9744/duts.10.2.232-251"
    },
    {
        "id": 19416,
        "title": "Nickel-based polycrystalline superalloy composition design framework based on non-dominated sorting genetic algorithm II",
        "authors": "Yaxi Liu, Bin Xu, Wei Huangfu, Haiqing Yin",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.commatsci.2023.112065"
    },
    {
        "id": 19417,
        "title": "Two-stage multi-objective optimization of reinforced concrete buildings based on non-dominated sorting genetic algorithm (NSGA-III)",
        "authors": "Amin Tanhadoust, Morteza Madhkhan, Moncef L. Nehdi",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jobe.2023.107022"
    },
    {
        "id": 19418,
        "title": "Non-dominated sorting genetic algorithm — II supported neural network in classifying forest types",
        "authors": "Sankhadeep Chatterjee, Soumen Banerjee, Kaustav Guha Mazumdar, Soumyadip Bose, Soumya Sen",
        "published": "2017-4",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iementech.2017.8077015"
    },
    {
        "id": 19419,
        "title": "Non-Dominated Sorted Genetic Algorithm II",
        "authors": "Leonardo Azevedo Scardua",
        "published": "2021-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429298028-11"
    },
    {
        "id": 19420,
        "title": "Non-dominated NSGA-II genetic algorithm for schedule acceleration considering the discrete time-cost compensation problem (DTCTP) in a construction project",
        "authors": "Alvaro Cuadros López, José Miguel Villota Rodríguez, José Deyson Velázquez Sánchez",
        "published": "2022-6-6",
        "citations": 0,
        "abstract": "Sometimes after scheduling a project, it is necessary to shorten its duration. There are many factors that force to crash the duration. Some reasons may be saving costs, early commissioning or avoiding potential risks. In this case, it is necessary to allocate more resources to activities to shorten their duration while trying to invest as little money as possible. The time–cost tradeoff problem is one important problem in project scheduling. In this study the time–cost tradeoff problem is aborded considering a discrete approach and it is solved using a non-dominated genetic algorithm. The application in a construction project identified a Pareto front that managers could use for decision making. Managers were able to analyze different scenarios to meet delivery date, costs, and scope.",
        "link": "http://dx.doi.org/10.24050/reia.v19i38.1574"
    },
    {
        "id": 19421,
        "title": "Notice of Violation: A Dual-Band Beam Steering Multifunctional Reconfigurable Antenna Optimized by Non-Dominated Sorting Genetic Algorithm (NSGA-II) for Wi-Fi 6 Applications",
        "authors": "Junlin Pu, Bing Zhang, Yanping Zhou, Kama Huang, Tiancang Zhang, Juan Yang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tap.2022.3209180"
    },
    {
        "id": 19422,
        "title": "Modeling and Optimizing Medium Composition for Shoot Regeneration of Chrysanthemum via Radial Basis Function-Non-dominated Sorting Genetic Algorithm-II (RBF-NSGAII)",
        "authors": "Mohsen Hesami, Roohangiz Naderi, Masoud Tohidfar",
        "published": "2019-12-3",
        "citations": 41,
        "abstract": "AbstractThe aim of the current study was modeling and optimizing medium compositions for shoot proliferation of chrysanthemum, as a case study, through radial basis function- non-dominated sorting genetic algorithm-II (RBF-NSGAII). RBF as one of the artificial neural networks (ANNs) was used for modeling four outputs including proliferation rate (PR), shoot number (SN), shoot length (SL), and basal callus weight (BCW) based on four variables including 6-benzylaminopurine (BAP), indole-3-butyric acid (IBA), phloroglucinol (PG), and sucrose. Afterward, models were linked to the optimization algorithm. Also, sensitivity analysis was applied for evaluating the importance of each input. The R2 correlation values of 0.88, 0.91, 0.97, and 0.76 between observed and predicted data were obtained for PR, SN, SL, and BCW, respectively. According to RBF-NSGAII, optimal PR (98.85%), SN (13.32), SL (4.83 cm), and BCW (0.08 g) can be obtained from a medium containing 2.16 µM BAP, 0.14 µM IBA, 0.29 mM PG, and 87.63 mM sucrose. The results of sensitivity analysis indicated that PR, SN, and SL were more sensitive to BAP, followed by sucrose, PG, and IBA. Finally, the performance of predicted and optimized medium compositions were tested, and results showed that the difference between the validation data and RBF-NSGAII predicted and optimized data were negligible. Generally, RBF-NSGAII can be considered as an efficient computational strategy for modeling and optimizing in vitro organogenesis.",
        "link": "http://dx.doi.org/10.1038/s41598-019-54257-0"
    },
    {
        "id": 19423,
        "title": "Bi-objective freight scheduling optimization in an integrated forward/reverse logistic network using non-dominated sorting genetic algorithm-II",
        "authors": "Taufik Djatna, Guritno A. M. Amien",
        "published": "2020",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5267/j.dsl.2019.7.002"
    },
    {
        "id": 19424,
        "title": "Multimodal multi-objective route planning using non-dominated sorting genetic algorithm-II and TOPSIS method",
        "authors": "Parham Pahlavani, Fazel Ghaderi,  ,  ",
        "published": "2017-3-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29252/jgit.4.4.123"
    },
    {
        "id": 19425,
        "title": "Experimental investigation and multi-objective optimization of savonius wind turbine based on modified non-dominated sorting genetic algorithm-II",
        "authors": "Seyed Ehsan Hosseini, Omid Karimi, Mohammad Ali AsemanBakhsh",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": " A numerical data set will be developed to assist in the design of Savonius wind turbines. The main objective of study is to improve Savonius turbine blade designs to increase torque coefficients, rotational speeds, and pressure coefficients. Simulating 3D models and validating them with wind tunnel data were part of the experimental design methodology. Multi-objective optimization is used to optimize turbine performance. Twist angle, aspect ratio, and overlap ratio are all important factors in determining the optimal torque and power coefficients. Data-driven objective functions were modeled using the group method of data handling (GMDH). Using an evolutionary Pareto-based optimization approach, polynomial models were used to plot Pareto fronts and TOPSIS to calculate optimal commercial points. The torque coefficient, rotational speed, and power coefficient are all improved by 13.74%, 0.071%, and 5.32%, respectively. As a result of the multi-objective optimization of the turbine, some significant characteristics of objective functions were discovered. ",
        "link": "http://dx.doi.org/10.1177/0309524x231217726"
    },
    {
        "id": 19426,
        "title": "Multi-Objective Self-Adaptive a Non-Dominated Sorting Genetic (NSGA) Algorithm for Optimal Sizing of PV/Wind/Diesel Hybrid Microgrid System",
        "authors": "",
        "published": "2021-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21608/aujst.2021.226485"
    },
    {
        "id": 19427,
        "title": "Non-dominated Sorting Genetic Algorithm (NSGA)-III Based Fuzzy Segmentation Model",
        "authors": "Rajani Kumari, Dinesh Kumar,  Vijay Kumar",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-5077-5_58"
    },
    {
        "id": 19428,
        "title": "Multi-objective optimal scheduling of automated construction equipment using non-dominated sorting genetic algorithm (NSGA-III)",
        "authors": "Ying Liu, Ke You, Yutian Jiang, Zhangang Wu, Zhenyuan Liu, Gang Peng, Cheng Zhou",
        "published": "2022-11",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.autcon.2022.104587"
    },
    {
        "id": 19429,
        "title": "Non-dominated sorting genetic algorithm-II for locating emergency bases to minimise mean and standard deviation of service time",
        "authors": "Hamid Reza Golmakani, Mahtab Eskandar",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijor.2021.119430"
    },
    {
        "id": 19430,
        "title": "Solving Rescheduling Problems in Dynamic Permutation Flow Shop Environments with Multiple Objectives Using the Hybrid Dynamic Non-Dominated Sorting Genetic II Algorithm",
        "authors": "Pablo Valledor, Alberto Gomez, Javier Puente, Isabel Fernandez",
        "published": "2022-7-8",
        "citations": 5,
        "abstract": "In this work, we seek to design a model that contributes to the study and resolution of a multi-objective rescheduling problem in dynamic permutation flow shop contexts. In this type of problem, where the objectives can be valued in heterogeneous units, the difficulty of achieving an optimal solution leads to finding a set of non-dominated efficient solutions (also called Pareto front). On the other hand, we will also consider the potential appearance of disruptions in planned scheduling (such as machine breakdowns or arrival of new priority jobs) that require a rapid re-planning of the aforementioned scheduling. In this paper, a hybrid dynamic non-dominated sorting genetic II metaheuristic (HDNSGA-II) is proposed to find the optimal Pareto front. The algorithm is applied to a benchmark already tested in previous studies, defined by three conflicting objective functions (makespan, total weighted tardiness, and stability) and three different types of disruption (machine breakdowns, incorporation of new jobs, and modifications in process times). According to the statistical comparison performed, the HDNSGA-II algorithm performs better in the designed environment, especially in larger problems.",
        "link": "http://dx.doi.org/10.3390/math10142395"
    },
    {
        "id": 19431,
        "title": "Non-dominated Sorting Genetic Algorithm-II for Locating Emergency Bases to Minimize Mean and Standard Deviation of Service Time",
        "authors": "Mahtab Eskandar, Hamid Reza Golmakani",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijor.2021.10042361"
    },
    {
        "id": 19432,
        "title": "Modeling and Optimizing in vitro Sterilization of Chrysanthemum via Multilayer Perceptron-Non-dominated Sorting Genetic Algorithm-II (MLP-NSGAII)",
        "authors": "Mohsen Hesami, Roohangiz Naderi, Masoud Tohidfar",
        "published": "2019-3-14",
        "citations": 50,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3389/fpls.2019.00282"
    },
    {
        "id": 19433,
        "title": "Aspiration level-based non-dominated sorting genetic algorithm- II &amp; III for multi-objective shortest path problem in trapezoidal environment",
        "authors": "Jayesh Dhodiya, Aniket Todkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijmor.2023.10054856"
    },
    {
        "id": 19434,
        "title": "Optimal base station location in LTE heterogeneous network using non-dominated sorting genetic algorithm II",
        "authors": "Ouamri Mohamed Amine, Zenadji Sylia, Khellaf Selia, Azni Mohamed",
        "published": "2018",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijwmc.2018.093858"
    },
    {
        "id": 19435,
        "title": "A multistage depressed collectors design tool for traveling wave tubes based on non-dominated sorting genetic algorithm II",
        "authors": "Tao Huang, Qiufeng Cao, Jia Liu, Dapeng Gong, Shifeng Li, Zhonghai Yang, Bin Li",
        "published": "2018-4",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ivec.2018.8391481"
    },
    {
        "id": 19436,
        "title": "A new integrated remanufacturing process planning and scheduling model under uncertainties using extended non-dominated sorting genetic algorithm-II",
        "authors": "Huifen Xu, Cheng Fang, Shuai Zhang",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Remanufacturing, with its environmental and economic implications, is gaining significant traction in the contemporary industry. Owing to the complementarity between remanufacturing process planning and scheduling in actual remanufacturing systems, the integrated remanufacturing process planning and scheduling (IRPPS) model provides researchers and practitioners with a favorable direction to improve the performance of remanufacturing systems. However, a comprehensive exploration of the IRPPS model under uncertainties has remained scant, largely attributable to the high complexity stemming from the intrinsic uncertainties of the remanufacturing environment. To address the above challenge, this study proposes a new IRPPS model that operates under such uncertainties. Specifically, the proposed model utilizes interval numbers to represent the uncertainty of processing time and develops a process planning approach that integrates various failure modes to effectively address the uncertain quality of defective parts during the remanufacturing process. To facilitate the resolution of the proposed model, this study proposes an extended non-dominated sorting genetic algorithm-II with a new multi-dimensional representation scheme, in which, a new self-adaptive strategy, multiple genetic operators, and a new local search strategy are integrated to improve the algorithmic performance. The simulation experiments results demonstrate the superiority of the proposed algorithm over three other baseline multi-objective evolutionary algorithms.",
        "link": "http://dx.doi.org/10.3233/jifs-233408"
    },
    {
        "id": 19437,
        "title": "The development of a novel multi-objective optimization framework for non-vertical well placement based on a modified non-dominated sorting genetic algorithm-II",
        "authors": "Auref Rostamian, Saeid Jamshidi, Emily Zirbes",
        "published": "2019-10",
        "citations": 28,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10596-019-09863-2"
    },
    {
        "id": 19438,
        "title": "Traffic light optimization using Non-Dominated Sorting Genetic Algorithm (NSGA2)",
        "authors": "Samara Soares Leal, Paulo Eduardo M. Almeida",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe number of vehicles in the world has increased significantly. The optimization of traffic light control plans in large cities is an extremely important area of research in traffic engineering, as poorly coordinated traffic lights can lead to increased waiting times for vehicles at traffic lights and thus to long delays at intersections. In addition, suboptimal control plans could contribute to traffic congestion, which has become a major concern for public administrations, as it is one of the factors that reduce productivity and the quality of life of people. In this context, this paper presents a method for Active Control of Traffic Signals (ACTS) associated with the use of NSGA2 multi-objective algorithm, aimed at optimizing the traffic signal control plan in response to the traffic demand of a region of the city of Belo Horizonte (Brazil), at each cycle time interval. The objectives are to minimize the average delay time and the number of vehicles stops per cycle. Actual data collected by the Company of Transport and Traffic of Belo Horizonte (BHTrans) were used with the AIMSUN simulator and the experiments were compared with the current signal control plan used by BHTrans to determine if NSGA2 is efficient in optimizing the traffic control plan of the region under study.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2693295/v1"
    },
    {
        "id": 19439,
        "title": "Hybrid Non-Dominated Sorting Genetic Algorithm",
        "authors": "Sankhadeep Chatterjee, Sarbartha Sarkar, Nilanjan Dey, Amira S. Ashour, Soumya Sen",
        "published": "2018",
        "citations": 14,
        "abstract": "Water pollution due to industrial and domestic reasons is highly affecting the water quality. In undeveloped and developed countries, it has become a major reason behind a number of water borne diseases. Poor public health is putting an extra economic liability in order to deploy precautionary measures against these diseases. Recent research works have been directed toward more sustainable solutions to this problem. It has been revealed that good quality of water supply can not only improve the public health, it also accelerates economic growth of a geographical location as well. Water quality prediction using machine learning methods is still at its primitive stage. Besides, most of the studies did not follow any national or international standard for water quality prediction. In the current work, both the problems have been addressed. First, advanced machine learning methods, namely Artificial Neural Networks (ANNs) supported by a well-known multi-objective optimization algorithm called the Non-dominated Sorting Genetic Algorithm-II (NSGA-II) has been used to classify the water samples into two different classes. Secondly, Indian national standard for water quality (IS 10500:2012) has been utilized for this classification task. The hybrid NN-NSGA-II model is compared with another two well-known meta-heuristic supported ANN classifiers, namely ANN trained by Genetic Algorithm (NN-GA) and by Particle Swarm Optimization (NN-PSO). Apart from that, the support vector machine (SVM) has also been included in the comparative study. Besides analysing the performance based on several performance measuring methods, the statistical significance of the results obtained by NN-NSGA-II has been judged by performing Wilcoxon rank sum test with 5% confidence level. Results have indicated the ingenuity of the proposed NN-NSGA-II model over the other classifiers under current study. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-4151-6.ch011"
    },
    {
        "id": 19440,
        "title": "Parametric optimisation of abrasive water jet machining of glass fibre reinforced plastic composite using non-dominated sorting genetic algorithm-II",
        "authors": "Padmakar Jagannath Pawar, Anil Yashvant Mali",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijmheur.2017.10006782"
    },
    {
        "id": 19441,
        "title": "Parametric optimisation of abrasive water jet machining of glass fibre reinforced plastic composite using non-dominated sorting genetic algorithm-II",
        "authors": "Anil Yashvant Mali, Padmakar Jagannath Pawar",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijmheur.2017.086982"
    },
    {
        "id": 19442,
        "title": "Modified non-dominated sorting genetic algorithm-II for the optimal design of soil-concrete periodic plane wave barriers",
        "authors": "Shahab Amanat, Kourosh Gholami, Reza Rafiee-Dehkharghani, Dipanshu Bansal",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compgeo.2023.105947"
    },
    {
        "id": 19443,
        "title": "Application of the Non-dominated Sorting Genetic Algorithm II in Multi-objective Optimization of Orally Disintegrating Tablet Formulation",
        "authors": "Jiaqi Zhang, Yu Yao, Wei Sun, Liling Tang, Xiaodong Li, Huaqing Lin",
        "published": "2022-8-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1208/s12249-022-02379-6"
    },
    {
        "id": 19444,
        "title": "Research on capacity allocation of supercapacitor absorbing transient energy based on non-dominated sorting genetic algorithm II",
        "authors": "Fengren Yang, Hong Wang, Zhijie Wang",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nDuring the actual operation of the power system, various situations will be encountered. A slight disturbance will generate a relatively large transient energy in the system. Estimating the loss and reducing the transient energy well is a very worthwhile research topic. In this paper, we discussed the charging and discharging capability of supercapacitors, proposed a scheme of using parallel supercapacitors to absorb the transient energy generated after grid faults, established a supercapacitor capacity optimization model based on economy and absorption effect, used the NSGA-II Algorithm to find the size of the optimum supercapacitor capacity, and finally carried out modeling and simulating in MATLAB/SIMULINK to verify the absorption effect of the optimal capacity configuration on transient energy.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2683/1/012001"
    },
    {
        "id": 19445,
        "title": "Optimization of Generation Cost, Environmental Impact, and Reliability of a Microgrid Using Non-dominated Sorting Genetic Algorithm-II",
        "authors": "Ikramul Hasan Sohel, Showrov Rahman",
        "published": "2020-12-22",
        "citations": 2,
        "abstract": "Over the past years, energy sectors have accomplished considerable progress in the transition from conventional fossil-based energy to low-carbon energy production, and microgrids are playing important roles in this sustainable energy transition. One of the key challenges for microgrids is to deliver power with the least possible cost and that too with such an approach that the environmental impact is the lowest and the overall system reliability is high enough. For this reason, generation cost, emission entities, and system reliability need to be efficiently optimized. Towards this goal, an online multi-objective technique has been employed to optimize cost, emission and system reliability taking these three factors in pairs at a time. The optimization model is designed using the non-dominated sorting genetic algorithm-II (NSGA-II), and the algorithm has been employed for several double objective scenarios considering reliability as an objective and later as a constraint. To evaluate the performance of the proposed approach, the simulation results are compared with the relative parameters from a different model that uses the strength pareto evolutionary algorithm (SPEA). The results show that the proposed technique satisfies the multi-objective optimization goals and provides good trade-offs between the conflicting objective functions while finding the optimal dispatch.",
        "link": "http://dx.doi.org/10.18280/ijsdp.150814"
    },
    {
        "id": 19446,
        "title": "Mathematical modeling and optimizing the in vitro shoot proliferation of wallflower using multilayer perceptron non-dominated sorting genetic algorithm-II (MLP-NSGAII)",
        "authors": "Fazilat Fakhrzad, Abolfazl Jowkar, Javad Hosseinzadeh",
        "published": "2022-9-9",
        "citations": 9,
        "abstract": "Novel computational methods such as artificial neural networks (ANNs) can facilitate modeling and predicting results of tissue culture experiments and thereby decrease the number of experimental treatments and combinations. The objective of the current study is modeling and predicting in vitro shoot proliferation of Erysimum cheiri (L.) Crantz, which is an important bedding flower and medicinal plant. Its micropropagation has not been investigated before and as a case study multilayer perceptron- non-dominated sorting genetic algorithm-II (MLP-NSGAII) can be applied. MLP was used for modeling three outputs including shoots number (SN), shoots length (SL), and callus weight (CW) based on four variables including 6-benzylaminopurine (BAP), kinetin (Kin), 1-naphthalene acetic acid (NAA) and gibberellic acid (GA3). The R2 correlation values of 0.84, 0.99 and 0.93 between experimental and predicted data were obtained for SN, SL, and CW, respectively. These results proved the high accuracy of MLP model. Afterwards the model connected to Non-dominated Sorting Genetic Algorithm-II (NSGA-II) was used to optimize input variables for obtaining the best predicted outputs. The results of sensitivity analysis indicated that SN and CW were more sensitive to BA, followed by Kin, NAA and GA. For SL, more sensitivity was obtained for GA3 than NAA. The validation experiment indicated that the difference between the validation data and MLP-NSGAII predicted data were negligible. Generally, MLP-NSGAII can be considered as a powerful method for modeling and optimizing in vitro studies.",
        "link": "http://dx.doi.org/10.1371/journal.pone.0273009"
    },
    {
        "id": 19447,
        "title": "Multi‐objective optimization design of the large‐scale high‐intensity homogeneous magnetic field coil system based on non‐dominated sorting genetic algorithm (NSGA‐II)",
        "authors": "Boliang Zhu, Yiwei Lu, Yong Yang, Ming Zhang, Li Jiang, Shusheng Wang",
        "published": "2022-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/elp2.12188"
    },
    {
        "id": 19448,
        "title": "Dynamic optimization of high-speed railway structure based on Non-dominated Sorting Genetic Algorithm-II algorithm",
        "authors": "Donglin Yao, Yongxiao Liu, Yuanbo Zhang, Xianghui Fan",
        "published": "2021-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ichceswidr54323.2021.9656363"
    },
    {
        "id": 19449,
        "title": "Multi-Output Regression Algorithm-Based Non-Dominated Sorting Genetic Algorithm II Optimization for L-Shaped Twisted Tape Insertions in Circular Heat Exchange Tubes",
        "authors": "Shijie Li, Zuoqin Qian, Ji Liu",
        "published": "2024-2-11",
        "citations": 0,
        "abstract": "In this study, an optimization method using various multi-output regression models as model proxies within the NSGA-II framework was applied to determine the geometric parameters (P, W, D) of L-shaped twisted tape inserts for achieving the optimal overall heat transfer performance in a circular heat exchange tube. Herein, 4 multi-output regression models, namely, MOLR, MOSVR, MOGPR, and BPNN, were selected as proxy models and trained on a dataset containing 74 groups of data. The training results indicated that the MOGPR model, balancing high accuracy and low error conditions, exhibited moderate training times among the four algorithms. BPNN showed a comparatively lower comprehensive training effect, obtaining training accuracy close to that of the MOGPR algorithm but with approximately twice the training time. The worst fitting performance was gained with the MOSVR algorithm. Due to its fitting performance, the MOSVR algorithm was excluded from the subsequent NSGA-II model proxy. Through multi-objective optimization with NSGA-II, the optimal structural dimensions for three sets of L-shaped twisted tape inserts were obtained to achieve the best overall heat transfer efficiency within the tube.",
        "link": "http://dx.doi.org/10.3390/en17040850"
    },
    {
        "id": 19450,
        "title": "Optimization of Waste Transportation Routes using Multi-objective Non-dominated Sorting Genetic Algorithm II (MNSGA-II) in the Eastern and Southern Regions of Bandung City, Indonesia",
        "authors": "Natasya Afira, Arie Wahyu Wijayanto",
        "published": "2022-1-4",
        "citations": 0,
        "abstract": "Ensuring high-quality and effective urban waste management has been an important priority to achieve sustainable and environmental-friendly cities and communities mandated by Sustainable Development Goals (SDGs). The massively growing population in urban regions of developing countries, such as Bandung City, Indonesia, leads to the increasing volume of daily goods consumption and households waste production. The waste transportation route is one of the main determining factors for the cost of waste management. In this paper, we introduce the Multi-objective Non-dominated Sorting Genetic Algorithm II (MNSGA-II) to solve the waste transportation route optimization problem in the Eastern and Southern Regions of Bandung City, Indonesia. Compared to the existing traditional evolutionary algorithms, MNSGA-II offers three major important benefits: efficient computational complexity, no requirement of sharing parameters, and a non-elitism mechanism. Algorithm parameters include the number of generations, mutation rate, and crossover rate. Our extensive experiments suggest the best solution resulted in 14 routes with a total distance of 152,63 km. Further, our proposed route optimization is potentially beneficial to support the improvement of the sustainable waste management service system at Bandung City.",
        "link": "http://dx.doi.org/10.34123/icdsos.v2021i1.27"
    },
    {
        "id": 19451,
        "title": "A Novel Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: DSGA",
        "authors": "Qiang Long, Guoquan Li, Lin Jiang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nNon-dominated sorting is a critical component of all multi-objective evolutionary algorithms (MOEAs). A large percentage of computational cost of MOEAs is spent on non-dominated sorting. So the complexity of non-dominated sorting method in a large extent decides the efficiency of the MOEA. In this paper, we present a novel non-dominated sorting method called the dynamic non-dominated sorting (DNS). It is based on the sorting of each objective instead of dominance comparisons. The computational compelxity of DNS is $O(mN\\log N)$ ($m$ is the number of objectives, $N$ is the population size), which equals to the best record so far. Based on DNS, we introduce a novel multi-objective genetic algorithm (MOGA) called the dynamic non-dominated sorting genetic algorithm (DSGA). Then, some numerical comparisons between different non-dominated sorting method are presented. The results shows that DNS is efficient and promising. Finally, numerical experiments on DSGA are also given. The results show that DSGA outperforms some other MOEAs both on general-scale and large-scale multi-objective problems.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-304472/v1"
    },
    {
        "id": 19452,
        "title": "Conceptual Approach in Multi-Objective Optimization of Packed Bed Membrane Reactor for Ethylene Epoxidation Using Real-coded Non-Dominating Sorting Genetic Algorithm NSGA-II",
        "authors": "Matthew J. Palys, Stanislav Y. Ivanov, Ajay K. Ray",
        "published": "2017-1-1",
        "citations": 2,
        "abstract": "Abstract\nAn isothermal plug flow reactor model with extended Fick diffusion model for transport through the porous membrane is utilized for simulation of ethylene oxide formation in a packed bed membrane reactor (PBMR). The model was verified and validated using published experimental data from an existing lab-scale unit. Sensitivity analysis was performed to determine robustness of the model. A conceptual approach on operation and design stage multi-objective optimization study is discussed. Real-coded NSGA-II is used and effect of its parameters on optimization of reactor performance is also studied. The results of three two-objective operation-stage (with 4 decision variables) and one two-objective design-stage (with 6 decision variables) optimization case studies are presented. Good convergence to a Pareto optimal solution is achieved for all cases. Significant improvement over current experimental operation is observed in terms of increase in conversion of ethylene, selectivity to ethylene oxide and ethylene oxide product flow rate.",
        "link": "http://dx.doi.org/10.1515/ijcre-2016-0041"
    },
    {
        "id": 19453,
        "title": "Multi-Objective Optimization of the Perforated Micro Pin-Fin Heat Sink Using Non-Dominated Sorting Genetic Algorithm-II Coupled With Computational Fluid Dynamics Simulation",
        "authors": "Deepa Gupta, Probir Saha, Somnath Roy",
        "published": "2022-9-1",
        "citations": 1,
        "abstract": "Abstract\nThis paper numerically investigates the optimization of the geometric parameters and the coolant's inflow states of the perforated micropin-fins (MPFs) heat sink using an elitist nondominated sorting genetic algorithm-II (NSGA-II) coupled with a finite volume-based computational fluid dynamics (CFD) solver. Square-shaped MPFs with two circular perforations were considered for the investigations on the fluid flow and conjugate heat transfer using numerical simulations. Five design variables (two perforation diameters, their respective locations, and the inflow velocity) with the essential constrained equations were optimized to search for the optimal solutions. Two objective functions, viz., Nusselt number (Nu) and friction factor (f), were selected to evaluate the hydrothermal performances of the perforated MPFs heat sink. The optimization was performed for 52 generations with a population size of 30. We obtained the Pareto optimal solutions, which gave the design boundary of the important parameters. Some of the cases of the Pareto solutions were also investigated in detail to understand the underlying thermal physics and structural rigidity under thermal and hydraulic stresses. It is observed that the MPF's stiffness was not compromised upon introducing two perforations. This study identified different thermohydraulic features responsible for optimal performance at different inflow velocity regimes. The present paper demonstrates that this optimization technique has led to a better understanding of the underlying thermal physics of complex electronic cooling equipment while systematically exploring the design space.",
        "link": "http://dx.doi.org/10.1115/1.4054761"
    },
    {
        "id": 19454,
        "title": "Exploring hydrologic post-processing of ensemble streamflow forecasts based on affine kernel dressing and non-dominated sorting genetic algorithm II",
        "authors": "Jing Xu, François Anctil, Marie-Amélie Boucher",
        "published": "2022-2-22",
        "citations": 4,
        "abstract": "Abstract. Forecast uncertainties are unfortunately inevitable when conducting a deterministic analysis of a dynamical system. The cascade of uncertainty originates from different components of the forecasting chain, such as the chaotic nature of the atmosphere, various initial conditions and boundaries, inappropriate conceptual hydrologic modeling, and the inconsistent stationarity assumption in a changing environment. Ensemble forecasting proves to be a powerful tool to represent error growth in the dynamical system and to capture the uncertainties associated with different sources. In practice, the proper interpretation of the predictive uncertainties and model outputs will also have a crucial impact on risk-based decisions. In this study, the performance of evolutionary multi-objective optimization (i.e., non-dominated sorting genetic algorithm II – NSGA-II) as a hydrological ensemble post-processor was tested and compared with a conventional state-of-the-art post-processor, the affine kernel dressing (AKD). Those two methods are theoretically/technically distinct, yet share the same feature in that both of them relax the parametric assumption of the underlying distribution of the data (the streamflow ensemble forecast). Both NSGA-II and AKD post-processors showed efficiency and effectiveness in eliminating forecast biases and maintaining a proper dispersion with increasing forecasting horizons. In addition, the NSGA-II method demonstrated superiority in communicating trade-offs with end-users on which performance aspects to improve.\n                    ",
        "link": "http://dx.doi.org/10.5194/hess-26-1001-2022"
    },
    {
        "id": 19455,
        "title": "A neutrosophic optimization model for supply chain virtualization in the circular economy using the non-dominated sorting genetic algorithm II",
        "authors": "Hanieh Shambayati, Mohsen Shafiei Nikabadi, Sara Saberi, Abbas Mardani",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10479-023-05791-8"
    },
    {
        "id": 19456,
        "title": "History matching of an Oil Reservoir using Non-dominated Sorting Genetic Algorithm-II coupled with Sequential Gaussian Simulation",
        "authors": "Giridhar Vadicharla, Pushpa Sharma, S. K. Gupta, D N Saraf",
        "published": "2021-9-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icses52305.2021.9633849"
    },
    {
        "id": 19457,
        "title": "Hybrid Flow Shop Scheduling Problem with Energy Utilization using Non-Dominated Sorting Genetic Algorithm-III (NSGA-III) Optimization",
        "authors": "Muhammad Ammar Nik Mu'Tasim, Mohd Fadzil Faisae Ab. Rashid",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "Hybrid flow shop scheduling (HFS) is an on sought problem modelling for production manufacturing. Due to its impact on productivity, researchers from different backgrounds have been attracted to solve its optimum solution. The HFS is a complex dilemma and provides ample solutions, thus inviting researchers to propose niche optimization methods for the problem. Recently, researchers have moved on to multi-objective solutions. In real-world situations, HFS is known for multi-objective problems, and consequently, the need for optimum solutions in multi-objective HFS is a necessity. Regarding sustainability topic, energy utilization is mainly considered as one of the objectives, including the common makespan criteria. This paper presents the existing multi-objective approach for solving energy utilization and makespan problems in HFS scheduling using Non-Dominated Sorting Genetic Algorithm-III (NSGA-III), and a comparison to other optimization models was subjected for analysis. The model was compared with the most sought algorithm and latest multi-objective algorithms, Strength Pareto Evolutionary Algorithm 2 (SPEA -II), Multi-Objective Algorithm Particle Swarm Optimization (MOPSO), Pareto Envelope-based Selection Algorithm II (PESA-II) and Multi-objective Evolutionary Algorithm based on Decomposition (MOEA/D). The research interest starts with problem modelling, followed by a computational experiment with an existing multi-objective approach conducted using twelve HFS benchmark problems. Then, a case study problem is presented to assess all models. The numerical results showed that the NSGA-III obtained 50% best overall for distribution performance metrics and 42% best in convergence performance metrics for HFS benchmark problems. In addition, the case study results show that NSGA-III obtained the best overall convergence and distribution performance metrics. The results show that NSGA-III can search for the best fitness solution without compromising makespan and total energy utilization. In the future, these multi-objective algorithms’ potential can be further investigated for hybrid flow shop scheduling problems.",
        "link": "http://dx.doi.org/10.15282/ijame.20.4.2023.05.0840"
    },
    {
        "id": 19458,
        "title": "Sensitivity Analysis of Non-Dominated Sorting Genetic Algorithm-II for Quantitative Association Rules Mining",
        "authors": "Elif VAROL ALTAY, Bilal ALATAS",
        "published": "2020-1-31",
        "citations": 0,
        "abstract": "İkili ya da kesikli değerlere sahip veri kümelerine odaklanan birçok birliktelik kural madenciliği çalışması vardır. Ancak, gerçek dünya uygulamalarındaki veriler genellikle nicel değerlerden oluşmaktadır. Nicel veriler için keşfedilecek kurallarda hangi niteliklerin olacağı ve hangilerinin kuralın solunda hangilerinin sağında olacağının belirlenmesi, ilgili nicel aralıkların en uygun şekilde otomatik ayarlanması; kuralların yoğun nesne kümeleri üretilmeden tek aşamada anlaşılabilir, doğru, güvenilir, ilginç, sürpriz vb. özelliklere sahip olacak şekilde bulunması ve tüm bu işlemlerin her veri tabanı için önceden belirlenmesi gereken metriklere ihtiyaç duyulmadan ayarlanması zor bir problemdir. Yakın zamanda bazı araştırmacılar, nicel birliktelik kural madenciliğini, farklı kriterleri aynı anda en iyi şekilde karşılayacak şekilde, çok amaçlı bir problem olarak düşünmüşlerdir. Bu makalede nicel birliktelik kural madenciliği problemi için anlaşılabilirlik, ilginçlik ve performansı en üst düzeye çıkarmayı amaçlayan çok amaçlı evrimsel algoritmalardan baskın olmayan sıralama genetik algoritma-II temelli QAR-CIP-NSGA-II’nin parametre analizi yapılmıştır. Bu amaçla; nitelikleri nicel değerler alan beş gerçek dünya verisinde QAR-CIP-NSGA-II’nin değerlendirme sayısı, popülasyon sayısı, mutasyon olasılığı, genlik ve eşik değeri gibi parametrelerinin; elde edilen kural sayısı, ortalama destek, güven, lift, kesinlik faktörü, netconf ve kapsanan kayıt sayısını nasıl değiştirdiği kapsamlı bir şekilde bildiğimiz kadarıyla ilk kez bu çalışmada gerçekleştirilmiştir. Detaylı analiz sonuçları karşılaştırmalı tablolar ile sunulmuştur ve yorumlanmıştır.",
        "link": "http://dx.doi.org/10.17671/gazibtd.503349"
    },
    {
        "id": 19459,
        "title": "Performance prediction of a ground source heat pump system using denoised long short-term memory neural network optimised by fast non-dominated sorting genetic algorithm-II",
        "authors": "Wang Chaoran, Yu Xiong (Bill), Han Chanjuan",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.geothermics.2024.103002"
    },
    {
        "id": 19460,
        "title": "Optimal design of microvascular networks based on non-dominated sorting genetic algorithm II and fluid simulation",
        "authors": "Peng Li, Yuan Liu, Tian Zou, Jinyong Huang",
        "published": "2017-7",
        "citations": 6,
        "abstract": " The non-dominated sorting genetic algorithm II is used to design the microvascular networks embedded in self-healing polymeric materials. And the fluid simulation software Fluent is used to validate the optimization result obtained by non-dominated sorting genetic algorithm II. Two objective functions are considered, namely, the void volume fraction and flow efficiency. A total of 222 solutions are obtained, and the head loss is in the range of (3.88 × 10−7 m, 2.36 × 10−6 m), whereas the void volume fraction is in the range of (4.39%, 5.12%). The simulation velocities are close to optimization velocities. The average error rate of selected solutions (a), (b), and (c) is 22.6%, 26.4%, and 35.2%, respectively. ",
        "link": "http://dx.doi.org/10.1177/1687814017708175"
    },
    {
        "id": 19461,
        "title": "Region of interest based non-dominated sorting genetic algorithm-II",
        "authors": "Manu Manuel, Benjamin Hien, Simon Conrady, Arne Kreddig, Nguyen Anh Vu Doan, Walter Stechele",
        "published": "2022-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3512290.3528872"
    },
    {
        "id": 19462,
        "title": "Shape optimization of egg-shaped sewer pipes based on the nondominated sorting genetic algorithm (NSGA-II)",
        "authors": "Hanting Wu, Yangrui Huang, Lei Chen, Yingjie Zhu, Huaizheng Li",
        "published": "2022-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.envres.2021.111999"
    },
    {
        "id": 19463,
        "title": "Multi-Objective Gas Lift Optimization using Elitist Non-Dominated Sorting Genetic Algorithm (NSGA-II)",
        "authors": "V Sreeharsha,  , Pulak Jawaria, Vishesh Bhadaria,  ,  ",
        "published": "2019-11-30",
        "citations": 0,
        "abstract": "In petroleum industry, gas lift optimization is the most important for evaluating the reservoir. By improving the gas lift operation we can save money and time which we spend on the reservoir for effective production. The mainly accepted scenario of gas lift is to maximize production by using minimized cost infrastructure. If the production rate is increased, then the cost of oil production also increases due to the increase in surface facilities and increase in cost of gas compression to higher pressures. The production rate and production cost during gas lift are mutually conflicting in nature i.e., if anyone desires to increase the oil production rate, then at the same time it is difficult to minimize the cost of production. Therefore, this is an ideal candidate for multi-objective optimization study, where production rate needs to maximized while minimizing the cost of production. The oil production rate is calculated using nodal analysis of inflow performance and outflow performance curve while the production cost is calculated using the brake horsepower requirement of the compressor. Oil production rate during a gas lift operation can be defined as a function of various factors like (i) depth of gas injection, (ii) gas injection rate (iii) gas lift injection pressure, (iv) wellhead pressures, (v) bottom hole pressure, (vi) tubing size, (vii) surface choke size/wellhead pressure. Production cost mainly depends on the cost of gas compression which further depends on the pressure up to which gas has to be compressed in the annulus so that the gas lift valve at the bottom of the well opens. The opening of gas lift valve depends on the bottom hole pressure in the tubing i.e. the density of mixture present inside the tubing. The multi-objective gas lift optimization is carried out using multi-objective evolutionary algorithms (EAs) that use non-dominated sorting called elitist non-dominated sorting genetic algorithm (NSGA-II). In this project, we aim to find the optimum values of the decision parameters i.e. gas injection rate and wellhead pressure, for which oil production rate would be maximized while minimizing the cost of oil production.",
        "link": "http://dx.doi.org/10.35940/ijrte.d9189.118419"
    },
    {
        "id": 19464,
        "title": "Non-Dominated Sorting Genetic Algorithm-II-Induced Neural-Supported Prediction of Water Quality with Stability Analysis",
        "authors": "Sankhadeep Chatterjee, Sarbartha Sarkar, Nilanjan Dey, Soumya Sen",
        "published": "2018-6",
        "citations": 6,
        "abstract": " Water is one of the most important necessities for human survival. In municipal corporation areas, water quality affects a large part of the population. Good quality water supply is an imperative parameter that influences individuals’ health. Automated accurate water quality determination becomes an urgent necessity. Detecting the drinking water quality can prevent such scenarios prior to the critical stage. Recent research works have achieved reasonable success in predicting the water quality by deploying several machine learning-based techniques and utilising different aspects to analyse water quality. The accuracy levels of already proposed models are to be improved, keeping in mind the sensitivity of the problem domain. In the current work, Non-dominated Sorting Genetic Algorithm-II (NN-NSGA-II) was employed to train the artificial neural network (ANN) to improve its performance over its traditional counterparts. The proposed model gradually minimises two different objective functions, namely the root mean square error (RMSE) and Maximum Error (ME) in order to find the optimal weight vector for the ANN. The proposed model was compared with another two well-established models namely ANN trained with Genetic Algorithm (NN-GA) and ANN trained with Particle Swarm Optimisation (NN-PSO) in terms of accuracy, precision, recall, [Formula: see text]-Measure, Matthews correlation coefficient (MCC) and Fowlkes–Mallows (FM) index. Furthermore, a data perturbation-based stability analysis is proposed to test the stability of the proposed method. The simulation results established superior accuracy of NN-NSGA-II over the other models. ",
        "link": "http://dx.doi.org/10.1142/s0219649218500168"
    },
    {
        "id": 19465,
        "title": "Application of hybrid non-dominated sorting genetic algorithm-II and self-organizing map technique to interference management in homogenous frequency demand cellular network",
        "authors": "Hammed Lasisi, Mojeed O. Oyedeji, Yinusa A. Adediran",
        "published": "2017-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/nigercon.2017.8281885"
    },
    {
        "id": 19466,
        "title": "Aspiration level-based non-dominated sorting genetic algorithm-II and III for multi-objective shortest path problem in a trapezoidal environment",
        "authors": "Aniket Todkar, Jayesh M. Dhodiya",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijmor.2024.137054"
    },
    {
        "id": 19467,
        "title": "Suspended sediment load prediction using non-dominated sorting genetic algorithm II",
        "authors": "Mahmoudreza Tabatabaei, Amin Salehpour Jam, Seyed Ahmad Hosseini",
        "published": "2019-6",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.iswcr.2019.01.004"
    },
    {
        "id": 19468,
        "title": "Medical Imaging and Analysis of Thermal Necrosis During Bone Grinding:\nImplementation of Non-dominated Sorting Genetic Algorithm (NSGA-III) in\nHealthcare",
        "authors": "Atul Babbar, Vivek Jain, Dheeraj Gupta, Vidyapati Kumar, Bhargav Prajwal Pathri, Ankit Sharma",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "\nBackground::\nMedical imaging plays a key role in neurosurgery; thereby, imaging and analysis of the soft and hard tissues during bone grinding is of paramount\nimportance for neurosurgeons. Bone grinding, a minimally invasive operation in the field of neurosurgery amid osteotomy, has been used during\nbrain cancer surgery.\n\n\nAims and Objectives::\nWith increasing attention to neural tissue damage in machining operations, imaging of these neural tissues becomes vital and reducing temperature\nis imperative.\n\n\nMethod::\nIn the present study, a novel attempt has been made to perform the imaging of bone tissues during the bone grinding procedure and further\ninvestigate the relationship between rotational speed, feed rate, depth of cut with cutting forces, and temperature. The role of cutting forces and\ntemperature has been addressed as per the requirements of neurosurgeons. Firstly, a three-factor, three-level design was constructed with a full\nfactorial design. Regression models were employed to construct the models between input parameters and response characteristics. Medical\nimaging techniques were used to perform a thorough analysis of thermal necrosis and damage to the bone. Subsequently, the non-dominated\nsorting genetic algorithm (NSGA-III) was used to optimize the parameters for reduction in the cutting forces and temperature during bone grinding\nwhile reducing neural tissue damage.\n\n\nResults::\nThe results revealed that the maximum value of tangential force was 21.32 N, thrust force was 9.25 N, grinding force ratio was 0.453, torque was\n4.55 N-mm, and temperature was 59.3°C. It has been observed that maximum temperature was generated at a rotational speed of 55000 rpm, feed\nrate of 60 mm/min, and depth of cut of 1.0 mm. Histopathological imaging analysis revealed the presence of viable lacunas, empty lacunas,\nhaversian canals, and osteocytes in the bone samples. Furthermore, the elemental composition of the bone highlights the presence of carbon (c)\n59.49%, oxygen (O) 35.82%, sodium (Na) 0.11%, phosphorous 1.50%, sulphur 0.33%, chlorine 0.98%, and calcium 1.77%.\n\n\nConclusion::\nThe study revealed that compared to the initial scenario, NSGA-III can produce better results without compromising the trial results. According to\na statistical study, the rise in temperature during bone grinding was significantly influenced by rotating speed. The density of osteocytes in the\nlacunas was higher at lower temperatures. Furthermore, the results of surface electron microscopy and energy dispersive spectroscopy revealed the\npresence of bone over the surface of the grinding burr, which resulted in the loading of the grinding burr. The results of the present investigation\nwill be beneficial for researchers and clinical practitioners worldwide.\n",
        "link": "http://dx.doi.org/10.2174/0115734056284074231222042746"
    },
    {
        "id": 19469,
        "title": "Multi-objective optimization based on improved non-dominated sorting genetic algorithm II for tolerance allocation of auto-body parts",
        "authors": "Sha Xu, Yanfeng Xing, Weifeng Chen",
        "published": "2017-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/1687814017718123"
    },
    {
        "id": 19470,
        "title": "Optimization problems in water distribution systems using Non-dominated Sorting Genetic Algorithm II: An overview",
        "authors": "Talhah Mohamad Shirajuddin, Nur Shazwani Muhammad, Jazuri Abdullah",
        "published": "2023-4",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asej.2022.101932"
    }
]