[
    {
        "id": 12305,
        "title": "Implementation of Alpha-Beta Pruning and Transposition Tables on Checkers Game",
        "authors": "Cristian C. Suancha, Marco J. Suarez, Felipe A. Besoain",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3381958"
    },
    {
        "id": 12306,
        "title": "Optimization of Alpha-Beta pruning based on heuristic algorithm",
        "authors": "Don Yitong Ma",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Games have become an important place for testing Artificial Intelligence (AI). Minimax and Alpha-Beta Pruning are two common and basic algorithms implemented in game AIs. However, there are still limitations of the searching time and searching depth. This paper strives to improve the game AI with a Heuristic Algorithm to optimize both the searching time and depth. The experiment consists of three AIs built with Minimax, Alpha-Beta Pruning, and Heuristic Algorithm to evident the improvement. These AIs are built to play a traditional Chinese zero-sum game, Gobang, which can be seen as an enhanced version of tic-tac-toe but more advanced. The data is collected when AIs compete with each other. Comparing the search time of three AIs, there is significant improvement of AI implemented Heuristic Algorithm; the median search time for Heuristic AI is only half of the Alpha-Beta Pruning AI, and only quarter of the Minimax AI. Moreover, because the search time decreases, the searching depth of the Heuristic AI can also be increased. With the larger searching depth, the Heuristic AI also gains a higher winning rate against the other two AIs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230498"
    },
    {
        "id": 12307,
        "title": "A Tree Pruning Technique for Decoding Complexity Reduction of Polar Codes and PAC Codes",
        "authors": "Mohsen Moradi, Amir Mozammel",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcomm.2023.3255254"
    },
    {
        "id": 12308,
        "title": "Skeleton extraction and pruning point identification of jujube tree for dormant pruning using space colonization algorithm",
        "authors": "Yuxing Fu, Yuyang Xia, Huiming Zhang, Meng Fu, Yong Wang, Wei Fu, Congju Shen",
        "published": "2023-1-19",
        "citations": 6,
        "abstract": "The dormant pruning of jujube is a labor-intensive and time-consuming activity in the production and management of jujube orchards, which mainly depends on manual operation. Automatic pruning using robots could be a better way to solve the shortage of skilled labor and improve efficiency. In order to realize automatic pruning of jujube trees, a method of pruning point identification based on skeleton information is presented. This study used an RGB-D camera to collect multi-view information on jujube trees and built a complete point cloud information model of jujube trees. The space colonization algorithm acts on the global point cloud to generate the skeleton of jujube trees. The iterative relationship between skeleton points was represented by constructing a directed graph. The proposed skeleton analysis algorithm marked the skeleton as the trunk, the primary branches, and the lateral branches and identified the pruning points under the guidance of pruning rules. Finally, the visual model of the pruned jujube tree was established through the skeleton information. The results showed that the registration errors of individual jujube trees were less than 0.91 cm, and the average registration error was 0.66 cm, which provided a favorable database for skeleton extraction. The skeleton structure extracted by the space colonization algorithm had a high degree of coincidence with jujube trees, and the identified pruning points were all located on the primary branches of jujube trees. The study provides a method to identify the pruning points of jujube trees and successfully verifies the validity of the pruning points, which can provide a reference for the location of the pruning points and visual research basis for automatic pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpls.2022.1103794"
    },
    {
        "id": 12309,
        "title": "Measurement of gross alpha and gross beta activities at low alpha-to-beta activity ratios using LSC- a method for emergency preparedness",
        "authors": "K. Norlin, H. Ramebäck, A. Tovedal",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apradiso.2023.110983"
    },
    {
        "id": 12310,
        "title": "4D Trajectory Conflict Detection and Resolution Using Decision Tree Pruning Method",
        "authors": "Lucas Borges Monteiro, Vitor Filincowsky Ribeiro, Cristiano Perez Garcia, Geraldo Pereira Rocha Filho, Li Weigang",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tla.2023.10015220"
    },
    {
        "id": 12311,
        "title": "Decision tree post-pruning without loss of accuracy using the SAT-PP algorithm with an empirical evaluation on clinical data",
        "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
        "published": "2023-5",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.datak.2023.102173"
    },
    {
        "id": 12312,
        "title": "Extreme Pruning Technique Based on Filter Deactivation Using Sparsity Training for Deep Convolutional Neural Networks",
        "authors": "Kwanghyun Koo, Hyun Kim",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic61013.2024.10457126"
    },
    {
        "id": 12313,
        "title": "Pruning revisited – effect of pruning season on wood discoloration and occlusion in four temperate broadleaved tree species",
        "authors": "Anna Lund, Anna Levinsson, Johan Östberg, Björn Wiström",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "Abstract\nPruning is a necessary part of tree management both in silvicultural systems and in urban forestry. For the wood industry’s production of high-quality timber, as well as for the urban forest’s risk reduction and ecosystem services enhancements, it is essential that the pruning is accurately implemented. This study aimed to determine the effect of pruning season on discoloration amount and occlusion rate in four broadleaved tree species. In 2014, 84 trees were pruned in January, May and September. Six years later, the 252 samples from the three pruning points per tree were collected and analysed. ‘Common oak (Quercus robur L.)’ and ‘small-leaved lime (Tilia cordata Mill.)’ showed least discoloration when pruned in January, ‘wild cherry (Prunus avium L.)’ showed least discoloration when pruned in September and ‘Norway maple (Acer platanoides L.)’ did not show any significant differences. All species occluded fastest when pruned in January, but at different rates. Common oak occluded 84 per cent of the samples, Norway maple 42 per cent, small-leaved lime 32 per cent and wild cherry 13 per cent. In summary, the pruning month affected discoloration amounts and occlusion rates of the tested tree species in varied ways. Our research suggests an important knowledge gap regarding optimal species-specific pruning times and underlying reasons for different reactions to pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/forestry/cpac065"
    },
    {
        "id": 12314,
        "title": "Analysis of Multi-Robot Cooperative Hunting Using Differential Game Technique",
        "authors": "Bashir Abdullahi Baba",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "This research presents two robots cooperative hunting behavior by the use of a differential game method. There are two pursuer robots that are trying to find and then surround another robot prey evader. The purpose of the game is for the two pursuer robots to find the evader simultaneously or when one of the robots finds the evader first it will wait for the other robot to cooperate with it within a specified period of time. We use differential game theory to formulate the problem with a system of an ordinary differential equation. The conditions for the termination of the game were given to be when one of the pursuers catch the evader and the other cooperate with it or when the two pursuers catch it simultaneously.We carefully analyzed all the mathematical equations developed using the ordinary differential equations for the game and present the sufficient conditions that can warrant the two pursuers to catch the evader either  simultaneously or one first and then the other cooperates  with the first one  which will result in termination of the game. We also show mathematically that in the course of the game the robot prey evader tries to prolong the capture time, while the pursuer robots try to shorten the capture time",
        "keywords": "",
        "link": "http://dx.doi.org/10.56471/slujst.v6i.221"
    },
    {
        "id": 12315,
        "title": "Pruning as a production factor of the cacao tree (Theobroma cacao l.)",
        "authors": "Gabriel Cubillos",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Pruning is one of the main tasks that must be taken into account in the management of a cacao plantation. Its proper application stimulates production, facilitates the harvest of ripe fruits and the removal of fruits and organs diseased by Cacao frosty pod rot and Witches´ Broom. Essentially, pruning consists of removing suckers, branches that grow downwards and to the sides, intertwined branches, twigs that form inside the crown, and the tipping of upper branches to preserve the proper height of the trees.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15406/hij.2023.07.00277"
    },
    {
        "id": 12316,
        "title": "Navigation of Apple Tree Pruning Robot Based on Improved RRT-Connect Algorithm",
        "authors": "Yechen Li, Shaochun Ma",
        "published": "2023-7-27",
        "citations": 2,
        "abstract": "Pruning branches of apple trees is a labor-intensive task. Pruning robots can save manpower and reduce costs. A full map of the apple orchard with collision-free paths, which is navigation planning, is essential. To improve the navigation efficiency of the apple tree pruning robot, an improved RRT-Connect algorithm was proposed. Firstly, to address the disadvantage of randomness in the expansion of the RRT-Connect algorithm, a goal-biased strategy was introduced. Secondly, to shorten the path length, the mechanism of the nearest node selection was optimized. Finally, the path was optimized where path redundancy nodes were removed, and Bezier curves were used to deal with path sharp nodes to further reduce the path length and improve the path smoothness. The experimental results of apple orchard navigation show that the improved algorithm proposed in this paper can cover the whole apple orchard, and the path length is 32% shorter than that of the RRT-Connect algorithm. The overall navigation time is 35% shorter than that of the RRT-Connect algorithm. This shows that the improved algorithm has better adaptability and planning efficiency in the apple orchard environment. This will contribute to the automation of orchard operations and provide valuable references for future research on orchard path planning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agriculture13081495"
    },
    {
        "id": 12317,
        "title": "Delineating flood-prone areas using advanced integration of reduced-error pruning tree with different ensemble classifier algorithms",
        "authors": "Ebrahim Nohani, Solmaz Khazaei, Mohammad Dorjahangir, Haniyeh Asadi, Sahar Elkaee, Asad Mahdavi, Javad Hatamiafkoueieh, John P. Tiefenbacher",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11600-023-01238-7"
    },
    {
        "id": 12318,
        "title": "Composite Tiles Produced from Granite Dust and Tree Pruning Using a Sandwiched Method",
        "authors": "Idehai Ohijeagbon, Olawale Aransiola, Adekunle Adeleke, Peter Omoniyi, Peter Ikubanni, Daniel Oguntayo",
        "published": "2023-8-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/rcma.330401"
    },
    {
        "id": 12319,
        "title": "Imperfect-Information Game AI Agent Based on Reinforcement Learning Using Tree Search and a Deep Neural Network",
        "authors": "Xin Ouyang, Ting Zhou",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "In the field of computer intelligence, it has always been a challenge to construct an agent model that can be adapted to various complex tasks. In recent years, based on the planning algorithm of Monte Carlo tree search (MCTS), a new idea has been proposed to solve the AI problems of two-player zero-sum games such as chess and Go. However, most of the games in the real environment rely on imperfect information, so it is impossible to directly use the normal tree search planning algorithm to construct a decision-making model. Mahjong, which is a popular multiplayer game with a long history in China, attracts great attention from AI researchers because it contains a large game state space and a lot of hidden information. In this paper, we utilize an agent learning approach that leverages deep learning, reinforcement learning, and dropout learning techniques to implement a Mahjong AI game agent. First, we improve the state transition of the tree search based on the learned MDP model, the player position variable and transition information are introduced into the tree search algorithm to construct a multiplayer search tree. Then, the model training based on a deep reinforcement learning method ensures the stable and sustainable training process of the learned MDP model. Finally, we utilize the strategy data generated by the tree search and use the dropout learning method to train the normal decision-making agent. The experimental results demonstrate the efficiency and stability performance of the agent trained by our proposed method compared with existing agents in terms of test data accuracy, tournament ranking performance, and online match performance. The agent plays against human players and acts like real humans.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12112453"
    },
    {
        "id": 12320,
        "title": "Sequential Acid/Alkali Pretreatment for an Olive Tree Pruning Biorefinery",
        "authors": "Manuel J. Díaz, Pedro M. Ferrero, Manuel Moya",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "Olive tree pruning is an abundant and renewable lignocellulosic residue, which is generally burned in the fields, causing economic costs and environmental problems. This lignocellulosic residue can be considered a suitable raw material for the production of a wide range of byproducts in a biorefinery context due to its high content of potentially fermentable carbohydrates. To take advantage of its sugar content, pretreatment is necessary to enhance the accessibility of the enzymes to the cellulosic fraction. The aim of this work is to obtain sugars contained in olive tree pruning as a substrate for the production of bioethanol by fermentation. Specifically, the production of fermentable sugars by sequential pretreatment with sulfuric acid and sodium hydroxide is studied. A two-factor rotatable composite central design temperature and catalyst concentration (H2SO4 and NaOH) has been generated, and response surface methodology has been used to discuss and optimize the responses. This work shows that under optimal pretreatment conditions (130 °C, 1.90% w/v H2SO4 and 130 °C, 1.49% w/v NaOH) of 1 kg of olive tree pruning, a solution rich in sugars (102 g of glucose and 61 g of xylose) and a solid residue generating 99 g of glucose by enzymatic hydrolysis is obtained. Moreover, applying the combined severity to the acid pretreatment, it has been determined that 20% of the olive tree pruning is fast solubilization, and it was also found that the apparent activation energy of the acid hydrolysis reaction is 85.07 kJ/mol.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agronomy13112682"
    },
    {
        "id": 12321,
        "title": "Energy and Exergy Analysis of Palm Tree Pruning Residues Gasification",
        "authors": "Birol KAYİŞOĞLU, Gülizar DEMİRTAŞ",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Gasification is the process of obtaining syngas containing combustible gases such as H2, CO and small amounts of CH4 from biomass by performing partial combustion with a limited oxygen supply or with the help of suitable oxidants such as CO2 and water vapor. The efficiency of the gasification process is the most important parameter that determines the success of the system. In this study, the performance of the system in the gasification of palm pruning residues was evaluated by energy and exergy analysis methods. The gasification process was carried out at 7.6 Nm3/h and 10.2 Nm3/h air flow rates in the laboratory type fixed bed downdraft gasification unit manufactured in the Biosystems Engineering Department. The lower heating value of the syngas obtained as a result of gasification was found to be 4.09 MJ/Nm3 at 7.6 Nm3/h air flow rate and 3.76 MJ/Nm3 at 10.2 Nm3/h air flow rate. It has been observed that the lower heating value of the syngas is lower at high air flow rate. Energy efficiencies of the gasification system at 7.6 and 10.2 Nm3/h air flow rate were calculated as 47.6% and 52.8%, and exergy efficiencies were calculated as 43.7% and 48.1%, respectively. Exergy efficiencies were found to be lower than energy efficiencies in both air flow rates. However, as the air flow rate increased, the energy and exergy efficiencies also increased. The results obtained are similar to the results of previous studies on gasification of biomass.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15832/ankutbd.818623"
    },
    {
        "id": 12322,
        "title": "WBIN-Tree: A Single Scan Based Complete, Compact and Abstract Tree for Discovering Rare and Frequent Itemset Using Parallel Technique",
        "authors": "Shwetha Rai, Preetham Kumar, K. Nakul Shetty, M. Geetha, B. Giridhar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3350737"
    },
    {
        "id": 12323,
        "title": "Classification Tree Pruning Under Covariate Shift",
        "authors": "Nicholas R. Galbraith, Samory Kpotufe",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tit.2023.3308914"
    },
    {
        "id": 12324,
        "title": "Analysis of Efficient 32 Bit Adder Using Tree Grafting Technique",
        "authors": "R. Gowrishankar, N. Sathish Kumar",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.025422"
    },
    {
        "id": 12325,
        "title": "Environmental Monitoring of Tritium (3H) and Radiocarbon (14C) Levels in Mafikeng Groundwater Using Alpha/Beta Spectrometry",
        "authors": "Joseph Mathuthu, Omphile Edna Dzimba, Manny Mathuthu",
        "published": "2023-5-27",
        "citations": 0,
        "abstract": "With the current state of water scarcity in Mafikeng, South Africa, due to low water levels and an increasing population, it is therefore crucial to ensure the sustainability and availability of the existing water resources. In this study, the levels of tritium and radiocarbon in groundwater (boreholes) at selected villages in Mafikeng were determined using the Perkin Elmer Ultra Low Liquid Scintillation Counter 2000. The mean activity concentrations of tritium are 3.61304 ± 0.00612 Bq/L and 3.86014 ± 0.00739 Bq/L for samples from Dibate and Lokaleng villages, respectively, whereas 1.83392 ± 0.02265 Bq/L is for Moletsamongwe, Lekung, Airport View and Seweding. Moreover, the mean activity concentrations of radiocarbon from Dibate and Lokaleng are 0.59296 ± 0.00886 Bq/L and 0.8333 ± 0.0126 Bq/L, respectively, whereas for, Moletsamongwe, Lekung, Airport View and Seweding, they are 1.3752713 ± 0.01968 Bq/L. Two (2) out of the forty (40) samples analysed for radiocarbon are below the minimum detectable activity of 0.33627 Bq/L. The average annual effective dose (AED) of tritium for analysed samples from Dibate and Lokaleng villages are 0.04754 μSv/y and 0.05079 μSv/y, respectively, whereas it is 0.02413 μSv/y for Moletsamongwe, Lekung, Airport View and Seweding. The average AED for radiocarbon is 0.251404 μSv/y and 0.36604 μSv/y for samples from Dibate and Lokaleng, respectively, whereas it is 0.58309 μSv/y for Moletsamongwe, Lekung, Airport View and Seweding village. The evaluated lifetime cancer risk for mortality and morbidity in adults is lower than the radiological cancer risk limit of 1.63 × 10−3 set by regulatory agencies; hence, the consumption of the studied groundwater from the selected villages will not pose any health risks in terms of tritium and radiocarbon levels.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/w15112037"
    },
    {
        "id": 12326,
        "title": "Path planning of apple tree pruning robot based on improved RRT algorithm",
        "authors": "Yechen Li, Shaochun Ma, Lingfeng Li, Chenyang Su, Zhengliang Ding",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13031/aim.202300262"
    },
    {
        "id": 12327,
        "title": "GROB G 120 TP-A AIRCRAFT BETA SYSTEM ANALYSIS USING FTA (FAULT TREE ANALYSIS) METHOD",
        "authors": "Fajar Khanif Rahmawati, Istyawan Priyahapsara, Rindy Alriavindra Funny, Denisa Trisma Wati",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "Grob G 120 TP - A beta system aircraft is a system that regulates the size of the angle on the propeller. 42 failures occurred in the beta system from August 2016 to May 2021, resulting in the beta system having to be replaced even before reaching its 2500 flight hour age limit. Using the FTA (Fault Tree Analysis) method, which begins with defining the failure and determining the boundary conditions of the beta system, describing the fault tree model, identifying the minimum cut set from the fault tree, performing a qualitative analysis of the faults tree, and doing a quantitative analysis of the fault tree, it can be seen that the failure that often occurs in the beta system of the Grob G 120 TP-A aircraft is the occurrence of high oil temperature over 84 ℃, the qualitative analysis found 12 causes of failure on the beta system, and based on quantitative analysis obtained probability the occurrence of beta system failure is 0.76363.",
        "keywords": "",
        "link": "http://dx.doi.org/10.28989/vortex.v4i2.1652"
    },
    {
        "id": 12328,
        "title": "Analysis and Evaluation of (beta) Beta Distribution or Three Point Estimation for PERT Technique in Project Management",
        "authors": "Ahraz Javeed Reshi",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr23922120800"
    },
    {
        "id": 12329,
        "title": "Cutting systems evaluation for a tree-pruning robot",
        "authors": "Giovanni Carabin, Stefan Leitner, Fabrizio Mazzetto, Renato Vidoni, Marco Bietresato",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/metroagrifor58484.2023.10424067"
    },
    {
        "id": 12330,
        "title": "Change Point Analysis to Detect the Effect of Pruning Severity on Tree Growth",
        "authors": "Yutaka Iguchi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ojf.2024.141004"
    },
    {
        "id": 12331,
        "title": "Parameters of apple tree crowns depending on the crown shape and pruning time",
        "authors": "Andrii Chaploutskyi, Roman Yakovenko, Roman Butsyk, Oleksandra Polunina, Oleksandr Zabolotnyi",
        "published": "2023-4-10",
        "citations": 1,
        "abstract": "The apple tree is a leading fruit crop in Ukraine in terms of production volumes and planting areas and is a valuable food product with a high content of vitamins. In new modern plantings, fruit producers prefer intensive cultivation technologies that ensure the maximum amount of high-quality fruit yield per unit area. The main criterion for solving this problem is the design of plantings: a narrow-row scheme for planting trees and a low-volume crown shape. The purpose of the study was to establish the influence of the pruning period of different types of crown formations on the growth and productivity of apple trees of two varieties: Fuji and Honey Crisp. The study was conducted in the conditions of the central Forest-Steppe of Ukraine (Uman National University of Horticulture). The scheme of planting was 4x1 m, M.9 rootstock, chernozem sod-podzolic soil, drip irrigation. Field, statistical, and computational-analytical methods were used in the course of the study. It was identified that the growth pattern of the examined varieties differed substantially, and crown volume, projection area, and development of the feeding area prevailed in Honey Crisp trees. However, in terms of productivity, the plantings of the Fuji variety substantially exceeded the values of the Honey Crisp variety. Forming a ballerina crown with the removal of overgrown wood in a 25 cm zone on the central trunk above the lower tier of semi-cellular branches provided an increase in the growth activity of the examined trees by 3-5%. A substantial decrease in the values of crown parameters was provided by the formation of the French axis crown – there was a decrease in the crown diameter by 44%, the crown volume – by 67%, and the crown projection area and the development of the feeding area – by 69%. Performing additional summer pruning of trees also helped to reduce growth activity by 6-11%. However, the specific productivity of plantings doubled in plantings with the formation of the French axis and by 45-50% with the introduction of double pruning of trees. It is recommended that agricultural producers investigate the terms of pruning low-volume crown forms, considering varietal characteristics, to create compacted apple stands and increase the intensification of production",
        "keywords": "",
        "link": "http://dx.doi.org/10.48077/scihor4.2023.65"
    },
    {
        "id": 12332,
        "title": "Effects of Pruning Types on Tree Vigor of Bamboo-Leaf Oak Inferred from Allometric Analysis",
        "authors": "Hideyasu Shimada",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ajps.2023.1412096"
    },
    {
        "id": 12333,
        "title": "Classification Performance Boosting for Interpolation Kernel Machines by Training Set Pruning Using Genetic Algorithm",
        "authors": "Jiaqi Zhang, Xiaoyi Jiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012467200003654"
    },
    {
        "id": 12334,
        "title": "Alpha/beta oscillations reveal cognitive and affective brain states associated with role taking in a dyadic cooperative game",
        "authors": "Karl-Philipp Flösch, Tobias Flaisch, Martin A Imhof, Harald T Schupp",
        "published": "2024-1-14",
        "citations": 1,
        "abstract": "Abstract\nSocial cooperation often requires taking different roles in order to reach a shared goal. By defining individual tasks, these roles dictate processing demands of the collaborators. The main aim of the present study was to examine the hypothesis that induced alpha and lower beta oscillations provide insights into affective and cognitive brain states during social cooperation. Toward this end, an experimental game was used in which participants had to navigate a Pacman figure through a maze by sending and receiving information about the correct moving direction. Supporting our hypotheses, individual roles taken by the collaborators during gameplay were associated with significant changes in alpha and lower beta power. Furthermore, effects were similar when participants played the Pacman Game with human or computer partners. Findings are discussed from the perspective of the information-via-desynchronization hypothesis proposing that alpha and lower beta power decreases reflect states of enhanced cortical information representation. Overall, experimental games are a useful tool for extending basic research on brain oscillations to the domain of naturalistic social interaction as emphasized by the second-person neuroscience perspective.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/cercor/bhad487"
    },
    {
        "id": 12335,
        "title": "The impact of pruning and mortality on urban tree canopy volume",
        "authors": "Andrew Francis Speak, Fabio Salbitano",
        "published": "2023-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ufug.2022.127810"
    },
    {
        "id": 12336,
        "title": "IMPACT OF DATA PREPROCESSING AND BALANCING ON DIABETES PREDICTION USING THE DECISION TREE TECHNIQUE",
        "authors": "SILUE Kolo",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17654/0975045223008"
    },
    {
        "id": 12337,
        "title": "Influence of rejuvenating pruning on the potential productivity of the apple tree ",
        "authors": "GULNAZ USHKEMPIROVA, MARINA URAZAYEVA, SAULE KAZYBAYEVA, YULIYA YEFREMOVA",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "The period of operation of intensive orchards is 15 years. At the age of 6-7 years, the quality of fruits decreases sharply and the frequency of fruiting increases. In order to extend the productive period of the orchard, an experiment was laid on the effect of rejuvenating pruning on the productivity of an apple tree, depending on the variety-rootstock combination. In the course of this scientific study, in the period from 2020 to 2022, results were obtained indicating the presence of the potential for productivity of apple varieties of the Kazakhstani selection Voskhod and Talgarskoe on the introduced forms B 7-35, Arm 18 and the rootstock of the Kazakhstani selection Zhetysu 5 in which the solar radiation transmittance was from 0.45% to 0.77%. On this basis, all the studied varieties are superior to the control variant. It also improved the light space inside the tree crown, which increased the number of young growth points and contributed to the awakening of reserve buds. Young growing fruits, located in the middle and central parts of the crown, are better supplied with nutrients after pruning than before pruning.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.31830/2348-7542.2023.roc-977"
    },
    {
        "id": 12338,
        "title": "MAXILLARY FRENECTOMY IN PEDIATRIC PATIENT USING ELECTROCAUTERY TECHNIQUE : REPORT OF 2 CASES",
        "authors": "Nurdiana Dewi, Rahmad Arifin, Beta Widya Oktiani",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "Background : The frenum is defined as a mocous membrane fold that attaches the lip and the cheek to the alveolar mucosa, the gingiva and the underlying periosteum.  The unsual frenum need treated by frenectomy or by frenotomy procedure. Conventional technique of frenectomy carries the risks of surgery like bleeding and patient compliance with favorable healing. Electrocautery technique provide bloodless area and clear view of the operative field. Case : The present article is a report of two cases of frenectomy using electrocautery technique. Case management : Maxillary frenectomy of 2 patients was carried out using electrocautery technique after the area was anesthetized with 4% articaine. Continuous saline irrigation was given while using the electrocautery. Minimal bleeding was seen during the procedure. No sutures were placed after the treatment. One week recalled visit showed almost complete healing in both cases. No discomfort was complained by patinet during and after the treatment. Conclusion : Electrocautery is recommended for performing frenectomy due to its effectiveness and safety. The procedure causes light bleeding and does not have postoperative complications. The use of electrocautery in frenectomy provides a reduction in work time as well as greater comfort and safety for the patient dan dentist. Keywords : Frenectomy, Frenum, Pediatric Patient",
        "keywords": "",
        "link": "http://dx.doi.org/10.20527/dentino.v8i2.17530"
    },
    {
        "id": 12339,
        "title": "Game Tree Search-based Impulsive Orbital Pursuit–Evasion Game with Limited Actions",
        "authors": "Wenyuan Xie, Liran Zhao, Zhaohui Dang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "This paper focuses on the impulsive orbital pursuit–evasion game (OPEG) with limited action sets for the pursuer and evader. Initially, a mathematical model is developed by combining game theory and orbital dynamics, forming a finite-round impulsive OPEG problem. The problem is then formulated as a bilateral optimization problem, employing a minimum-maximum optimization index based on terminal distance. To tackle this problem, an algorithm based on game tree search is designed, enabling the determination of the optimal pursuit–evasion strategy with limited action sets. Additionally, we explore the influence of the initial pursuing orientation on OPEG. The optimal initial pursuit orientation is analytically derived using relative motion dynamics under uncontrolled conditions. Furthermore, considering factors such as the initial status of the pursuit spacecraft, initial relative distance, transfer time, and maneuverability, the impulsive OPEG problem with limited action sets is numerically solved using game tree search. The findings of this study showcase the efficacy of game tree search in addressing impulsive OPEG problems with limited action sets. The study also demonstrates that the initial pursuing orientation selection at the start of the game plays a crucial role in increasing the success rate of pursuit. The research findings of this study have important implications for future practical engineering applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34133/space.0087"
    },
    {
        "id": 12340,
        "title": "Operation features of the expert system for tree and shrub pruning",
        "authors": "Maxim Logachev, Leliya Krylova",
        "published": "2023",
        "citations": 0,
        "abstract": "The article defines the importance of tree and shrub pruning for the environment of settlements and farms engaged in the cultivation of fruit plants. Such a process requires taking into account many parameters of both the plant itself and external conditions. This justifies the need to develop and use a software product capable of tracking over time the activities associated with pruning a plant and making recommendations to specialists for effective branch removal depending on the parameters of the setting. The problem domain has been analysed with the allocation of key parameters to create a formal model and a set of rules suitable for the use of object-orientated programming techniques. A user interface was created with the description of functional capabilities of the users of the developed software products.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202346202041"
    },
    {
        "id": 12341,
        "title": "Thorax X-Ray Image Segmentation Technique Using Four Thresholding Algorithm Variants",
        "authors": "Rio Subandi, Herman Herman, Anton Yudhana",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "Pneumonia is a respiratory infection caused by bacteria, viruses or fungi, and has been recognized as a fairly common and threatening disease. When diagnosing this disease, doctors usually also use thorax X-ray images. Nowadays, diagnosing pneumonia has been made possible with the help of machine learning technology. Doctors or medical personnel in locations where there are no pulmonary specialists or experts can be assisted by this technology. Machine learning algorithms are used to process digital images that have passed the pre-processing and segmentation stages. This paper offers a solution to segmentation technique of thorax X-ray digital image using a combination of four thresholding algorithms. This combination aims to find the best CNN model with segmentation techniques in the form of the most suitable thresholding algorithm. The result of this research is four different data sets. The thresholding algorithms used include binary, thresh binary inv, thresh to zero, thresh tozero inv with a threshold value of 150. The data used in this research is a thorax X-ray image dataset, as many as 5,856 images acquired from the Kaggle repository data. The program code in this research uses the Python programming language in the Anaconda environment. This research has resulted in a comparison of the accuracy values obtained using 4 variants between thres_binary thresholding algorithm and thres_binary_inv. The thres_tozero obtained 95% of accuracy while thres_tozero_inv obtained 94% of accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22219/kinetik.v9i1.1809"
    },
    {
        "id": 12342,
        "title": "Synthesis of tea tree oil microcapsules via microencapsulation using novel technique",
        "authors": "Samidha Shelar, Chandu Madankar",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Abstract\nTea tree oil (TTO) is widely known essential oil extracted from Melaleuca alternifolia leaves naturally having antimicrobial and antibacterial activities. Due to its highly volatile nature it rapidly evaporates causing loss of efficiency and shorten the effects. Microencapsulation technique was incorporated to ensure the core material is being protected from the immediate contact with the environment and offers controlled release. In this study, microencapsulation of Tea Tree Oil was done by employing complex coacervation technique using Chitosan - Gum acacia system as the coating material and utilized tannic acid as the crosslinking agent. All the materials used in this process are from natural sources which are safe for the human and the environment. In designing the operating process condition for TTO encapsulation, we found that wall ratio of 2:5 and 3.6 pH gave the best yield along with better efficiency. The proposed method studied the surface morphology of the microcapsules with an efficiency and yield of 84.50% and 69.9 % respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2603/1/012035"
    },
    {
        "id": 12343,
        "title": "The sets of $$\\left( \\alpha ,\\beta \\right) $$-statistically convergent and $$\\left( \\alpha ,\\beta \\right) $$-statistically bounded sequences of order $$\\gamma $$ defined by modulus functions",
        "authors": "Ibrahim S. Ibrahim, María C. Listán-García",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12215-024-00998-5"
    },
    {
        "id": 12344,
        "title": "Heart disease prediction system using (SMOTE technique) balanced dataset and decision tree classifier",
        "authors": "Ahmed Sami Jaddoa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0161558"
    },
    {
        "id": 12345,
        "title": "Tender Coconut Classification using Decision Tree and Deep Learning Technique",
        "authors": "Ishani Bhat, V Umadevi, Nishchitha Jagadeesh, Savithri Bhat, Rashmi S Shenoy",
        "published": "2023-3-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10117353"
    },
    {
        "id": 12346,
        "title": "An egalitarian solution to minimum cost spanning tree problems",
        "authors": "Emre Doğan, İbrahim Barış Esmerok",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00182-023-00864-1"
    },
    {
        "id": 12347,
        "title": "Improving Random Forest with Pre-pruning technique for Binary  classification",
        "authors": "Ilhem Tarchoune, Akila Djebbar, Hayet Farida Merouani",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "Random Forest (RF) is a popular machine learning algorithm. It is based on the concept of ensemble learning, which is a process of combining several classifiers to solve a complex problem and improve model performance. The random forest allows extending the notions of decision trees (DT) in order to build more stable models. In this work we propose to further improve the predictions of the trees in the forest by a pre-pruning technique, which aims to optimize the performance of the nodes and to minimize the size of the trees. Two experiments are performed to evaluate the performance of the proposed method; in the first experiment we applied the Classical Random Forest algorithm (CRF) with several different trees. While in the second one, a pre-pruning technique is established on the trees in order to define the optimal size of the forest. Finally, we compared the results obtained. The main objective is to produce accurate decision trees with high precision. The effectiveness of the proposed method is validated on five medical databases; the prediction precision will be improved with 83%, 94%, 95%, 97%, and 81% for Diabetes, Hepatitis, SaHeart, EEG-Eye-State, Prostate-cancer databases respectively. The performance results confirm that the proposed method performs better than the classical random forest algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-abstracts.1202"
    },
    {
        "id": 12348,
        "title": "Measurement of beta, gamma, and neutron radiation using an alpha imager based on a CCD camera and discrimination from alpha particles",
        "authors": "Y. Morishita, N. Sagawa, M. Fujisawa, S. Kurosawa, M. Sasano, M. Hayashi, H. Tanaka",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nssmicrtsd49126.2023.10338000"
    },
    {
        "id": 12349,
        "title": "Estimating the Alpha and Beta of Private Capital Using State Space Modeling and Bayesian Inference",
        "authors": "Vishv Jeet, Amit Partani, Rüdiger R. Stucke",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3905/jpm.2024.1.603"
    },
    {
        "id": 12350,
        "title": "Effects of Music Therapy, Mantra Therapy, and Alpha Beta Binaural Beats on Human Energy Fields using RFI Technology",
        "authors": "Sudhanshu Choudhary, Karan Sharma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbet.2023.10058077"
    },
    {
        "id": 12351,
        "title": "Analysis and Comparison for Innovative Prediction Technique of COVID-19 using Decision Tree Algorithm over the Support Vector Machine Algorithm with Improved Accuracy",
        "authors": "G.V.S. Charan, N.S. Kumar",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The primary goal of this research is to increase the accuracy of COVID-19 prediction and its analysis. Materials and Method: This study relied on data collected from Kaggle’s website and samples are divided into two groups, GROUP 1 (N=20) for the Decision tree and GROUP 2 (N=20) for the Support Vector Machine (SVM) in accordance with the total sample size calculated using clinical.com by keeping alpha error-threshold value 0.05, 95% confidence interval, enrolment ratio as 0:1, and G power at 80%. It involves the software implementation program in MatLab 2021a validating with 20 validations. Results: The accuracy, sensitivity, and precision rates are compared using Statistical Package for the Social Sciences (SPSS) software and an Independent sample T-Test. In comparison to the two, the Decision tree 93.91% accuracy, 94.33% sensitivity, 92% precision with P=0.001 ((p<0.05) produces a superior outcome to the Support Vector Machine 91.25% accuracy, 93.93% sensitivity, 86.11% precision (P<0.001)). Conclusion: The decision tree algorithm produces better results compared to the Support Vector Machine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.891896"
    },
    {
        "id": 12352,
        "title": "Analysis of Factors Related to Domestic Patient Safety Incidents Using Decision Tree Technique",
        "authors": "Jieun Shin, Ji-Hoon Lee, Nam-Yi Kim",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2147/rmhp.s421167"
    },
    {
        "id": 12353,
        "title": "Catalan Numbers in Terms of $(\\alpha, k)-$Gamma \tFunction and $(\\alpha, k)-$Beta Function",
        "authors": "Abdullah AKKURT, Huseyin YILDIRIM",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "In the paper, the authors discuss some extended results involving the Catalan numbers and establish an integral representation of the Catalan numbers in terms of the $(\\alpha,k)$-gamma and $(\\alpha,k)$-beta function. We refer to the results available in the literature by giving special values to the parameters in the obtained theorems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47000/tjmcs.1182387"
    },
    {
        "id": 12354,
        "title": "Credit Risk Prediction using Extra Tree Ensembling Technique with Genetic Algorithm",
        "authors": "Trishita Saha, Saroj Kumar Biswas, Saptarsi Sanyal, Neeta Verma, Biswajit Purkayastha",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307028"
    },
    {
        "id": 12355,
        "title": "Comparable axiomatizations of the average tree solution and the Myerson value",
        "authors": "Özer Selçuk, Takamasa Suzuki",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00182-022-00817-0"
    },
    {
        "id": 12356,
        "title": "Improving the energy efficiency of a refrigerated warehouse through the use of palm tree pruning waste as thermal insulator",
        "authors": "Hicham LAKRAFLI, Soufiane TAHIRI, Mohamed SENNOUNE, Abdelmajid BOUARDI",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "This work investigates the effect of palm tree pruning waste (PTPW) on thermal insulation and energy consumption of a refrigerated warehouse (RW). The thermal properties of PTPW depend strongly on its compactness, i.e. how much it weighs divided by how much space it takes up. The thermal conductivity of PTPW measured using the box method is about 0.069 W/m °C for a mass/occupied volume ratio of 0.064 g/cm3. It is comparable or lower than that of other natural materials discussed in the literature. The dynamic thermal simulation tool “TRNSYS” was applied to predict the thermal behavior of RW. The thickness of PTPW material was considered as variant to choose the better condition allowing achieving results very close to those of polyurethane. Obtained results highlight that 30 cm thick PTPW can reduce temperature by 1 to 2°C compared to 10 cm thick polyurethane. An improvement in the energy efficiency of the refrigerated warehouse was also highlighted. So, because of its performance, low cost, and eco-friendly nature, PTPW can compete with conventional insulating materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18186/thermal.1283362"
    },
    {
        "id": 12357,
        "title": "Multi-Agent Pathfinding on Large Maps Using Graph Pruning: This Way or That Way?",
        "authors": "Jiří Švancara, Philipp Obermeier, Matej Husár, Roman Barták, Torsten Schaub",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011625100003393"
    },
    {
        "id": 12358,
        "title": "Time and type of pruning affect tree growth and yield in high-density olive orchards",
        "authors": "E.M. Lodolini, S. Polverigiani, V. Giorgi, F. Famiani, D. Neri",
        "published": "2023-3",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.scienta.2023.111831"
    },
    {
        "id": 12359,
        "title": "Thermodynamics modeling of deep learning systems for a temperature based filter pruning technique",
        "authors": "M. Lapenna, F. Faglioni, R. Fioresi",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "We analyse the dynamics of convolutional filters’ parameters of a convolutional neural networks during and after training, via a thermodynamic analogy which allows for a sound definition of temperature. We show that removing high temperature filters has a minor effect on the performance of the model, while removing low temperature filters influences majorly both accuracy and loss decay. This result could be exploited to implement a temperature-based pruning technique for the filters and to determine efficiently the crucial filters for an effective learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fphy.2023.1145156"
    },
    {
        "id": 12360,
        "title": "A Novel Pessimistic Decision Tree Pruning Approach for Classification",
        "authors": "Al Maruf Hassan, Abir Hossain Amee, Md Iftekhar Hossain, Sara Ferdous Khan, Dewan Md. Farid",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eict61409.2023.10427593"
    },
    {
        "id": 12361,
        "title": "Alpha-ketoglutaric-acid/arginine/calcium-beta-hydroxybutyrate/KTX-0101/magnesium-beta-hydroxybutyrate/medium-chain-triglyceride-oil/7-oxo-prasterone",
        "authors": "",
        "published": "2024-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40278-024-55876-1"
    },
    {
        "id": 12362,
        "title": "Applying Machine Learning for Autism Risk Evaluation Using a Decision Tree Classification Technique",
        "authors": "Khushi Mittal, Kanwarpartap Singh Gill, Deepak Upadhyay, Vijay Singh, Srinivas Aluvala",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486622"
    },
    {
        "id": 12363,
        "title": "PENINGKATAN AKURASI PREDIKSI PEMILIHAN PROGRAM STUDI CALON MAHASISWA BARU MELALUI OPTIMASI ALGORITMA DECISION TREE DENGAN TEKNIK PRUNING DAN ENSEMBLE",
        "authors": "Harminto Mulyo, Nadia Annisa Maori",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "ENHACING PREDICTION ACCURACY OF NEW STUDENT PROGRAM SELECTION THROUGH DECISION TREE ALGORITHM OPTIMIZATION WITH PRUNING TECHNIQUE AND ENSEMBLEIn the current era of reform and globalization, the complexity of choosing the right study program is increasing with the many choices available. One of the challenges faced by the Nahdlatul Ulama Islamic University (UNISNU) Jepara is the increase in students with non-active status which can have an impact on the reputation of the university. One of the factors that can influence is the inaccuracy of students in choosing a study program, so that they are reluctant to continue because they are not enthusiastic about continuing their studies. The solution provided is to predict the selection of the right study program for prospective new students by utilizing the Decision Tree algorithm which is optimized with pruning and ensemble techniques with Random Forest which can help overcome overfitting in the decision tree. The data used is UNISNU student data from 2013 to 2023 with a total of 15,289 records and 52 attributes. The results showed that the Decision Tree and Random Forest models provided the highest accuracy, namely 0.88 with a max_depth value of 20 and succeeded in overcoming the problem of overfitting the decision tree. This model can then be used as a recommendation in predicting the selection of study programs for prospective new students at UNISNU Jepara.Dalam era reformasi dan globalisasi saat ini, kompleksitas dalam memilih program studi yang sesuai semakin meningkat dengan banyaknya pilihan yang tersedia. Salah satu tantangan yang dihadapi oleh Universitas Islam Nahdlatul Ulama (UNISNU) Jepara adalah meningkatnya mahasiswa dengan status non-aktif yang dapat berdampak pada reputasi universitas. Salah satu faktor yang dapat mempengaruhi adalah ketidaktepatan mahasiswa dalam memilih program studi, sehingga enggan untuk meneruskan karena tidak bersemangat dalam melanjutkan perkuliahan. Solusi yang diberikan adalah dengan melakukan prediksi pemilihan program studi bagi yang tepat bagi calon mahasiswa baru dengan memanfaatkan algoritma Decision Tree yang dioptimalkan dengan teknik pruning dan ensemble dengan Random Forest yang dapat membantu mengatasi overfitting pada decision tree. Data yang digunakan adalah data mahasiswa UNISNU dari tahun 2013 sampai dengan 2023 dengan jumlah 15.289 record dan 52 atribut. Hasil penelitian menunjukkan model Decision Tree dan Random Forest memberikan akurasi tertinggi, yaitu 0.88 dengan nilai max_depth sebesar 20 dan berhasil mengatasi masalah overfitting pada decision tree. Model ini selanjutnya dapat menjadi rekomendasi dalam prediksi pemilihan program studi bagi calon mahasiswa baru di UNISNU Jepara.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34001/jdpt.v15i1.5585"
    },
    {
        "id": 12364,
        "title": "Sigmoid-based Neuron Pruning Technique for MLPs on IoT Edge Devices",
        "authors": "Lakshmi Kavya Kalyanam, Srinivas Katkoori",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeev58650.2023.10391875"
    },
    {
        "id": 12365,
        "title": "Design of a Biogas Power Plant That Uses Olive Tree Pruning and Olive Kernels in Achaia, Western Greece",
        "authors": "Efstathios Papachristopoulos, Evangelos Tsiaras, Vagelis G. Papadakis, Frank A. Coutelieris",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "In Greece, agricultural residues form a significant part of available biomass resources. This study focuses on exploring energy production potential from olive tree pruning and kernels via anaerobic digestion in the Achaia region of Western Greece. It aims to address environmental challenges by analyzing anaerobic digestion of these residues. The study evaluates qualitative and quantitative attributes, including composition analysis and energy content assessment. Detailed design considerations for an anaerobic digestion system tailored for these residues are presented, laying the groundwork for practical implementation. By integrating scientific analysis with engineering principles, this research aims to optimize anaerobic digestion systems for a more sustainable agricultural landscape in Greece.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su16010187"
    },
    {
        "id": 12366,
        "title": "Competitive adsorptive removal of promazine and promethazine from wastewater using olive tree pruning biochar: operational parameters, kinetics, and equilibrium investigations",
        "authors": "Marwa El-Azazy, Ahmed S. El-Shafie, Samer Fawzy, David W. Rooney, Ahmed I. Osman",
        "published": "2023-6-16",
        "citations": 8,
        "abstract": "AbstractThis research aims to remove two phenothiazines, promazine (PRO) and promethazine (PMT), from their individual and binary mixtures using olive tree pruning biochar (BC-OTPR). The impact of individual and combinatory effects of operational variables was evaluated for the first time using central composite design (CCD). Simultaneous removal of both drugs was maximized utilizing the composite desirability function. At low concentrations, the uptake of PRO and PMT from their individual solutions was achieved with high efficiency of 98.64%, 47.20 mg/g and 95.87%, 38.16 mg/g, respectively. No major differences in the removal capacity were observed for the binary mixtures. Characterization of BC-OTPR confirmed successful adsorption and showed that the OTPR surface was predominantly mesoporous. Equilibrium investigations revealed that the Langmuir isotherm model best describes the sorption of PRO/PMT from their individual solutions with maximum adsorption capacities of 640.7 and 346.95 mg/g, respectively. The sorption of PRO/PMT conforms to the pseudo-second-order kinetic model. Regeneration of the adsorbent surface was successfully done with desorption efficiencies of 94.06% and 98.54% for PRO and PMT, respectively, for six cycles.\nGraphical abstract",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-023-27688-6"
    },
    {
        "id": 12367,
        "title": "The Recycling and Reuse of Natural Materials: Sound Absorbing Box Patterns That Use Waste from Olive Tree Pruning",
        "authors": "Rossella Cottone, Louena Shtrepi, Valentina Serra, Simonetta Lucia Pagliolico",
        "published": "2023-2-5",
        "citations": 1,
        "abstract": "The agricultural activity of pruning olive trees generates waste which, due to long-standing practices and unawareness of the consequences, are burned on site, thereby producing CO2 emissions in the atmosphere. Therefore, in order to prevent environmental pollution and a waste of resources, the aim of this research investigation was to highlight some alternative uses of the pruning of olive trees waste. This work focuses on recycled and reused by-products as a secondary raw material for the implementation of interior components that can be used for indoor acoustic correction purposes and evaluates their potential as absorbing materials, without overlooking the aesthetic dimension. In this paper, different configurations based on plywood frames with loose olive pruning chips used as a filler, namely, modules and sub-modules, were investigated. Moreover, other technological details, that is, the influence of a Tissue-Non-Tissue (TNT) layer and a spray film coating applied over the external surface of the loose material, were measured. Sound absorption measurements were conducted inside a small-scale reverberation room (SSRR) and the experimental results demonstrated that the samples, for the given thickness, have weighted sound absorption values (αw) of between 0.15 and 0.35 and single third-octave band values that can reach higher values than 0.50 above 500 Hz. The frequency curves and weighted values of the samples in which the influence of TNT and the spray film coating were tested remained unchanged. This is a design aspect that allows absorbing surfaces to be modeled and integrated with existing walls, while maintaining the acoustic performance and the specific aesthetic features of the loose material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/acoustics5010011"
    },
    {
        "id": 12368,
        "title": "Impact of tree pruning on water use in tree-coffee systems on smallholder farms in Eastern Uganda",
        "authors": "Joel Buyinza, Catherine W. Muthuri, Matthew D. Denton, Ian K. Nuberg",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10457-023-00842-2"
    },
    {
        "id": 12369,
        "title": "Effects of music therapy, mantra therapy, and alpha beta binaural beats on human energy fields using RFI technology",
        "authors": "Karan Sharma, Sudhanshu Choudhary",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbet.2024.136382"
    },
    {
        "id": 12370,
        "title": "197 Monte Carlo Dose Modelling of Embedded Beta/Gamma Emissions from Dart Alpha-Emitters Brachytherapy Seeds Using Geant4",
        "authors": "Julien Mondor, Yuji Kamio, Patrick Chevé, Jean-François Carrier",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0167-8140(23)89289-1"
    },
    {
        "id": 12371,
        "title": "A spanning tree algorithm with adaptive pruning with low redundancy coverage rate",
        "authors": "Renjie Xu, Shouwen Yao, Weiqi Gouhe, Yinghua Zhao, Siqi Huang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cie.2023.109745"
    },
    {
        "id": 12372,
        "title": "Production and characterization of cellulose acetate using olive tree pruning biomass as feedstock",
        "authors": "José Antonio Rodríguez‐Liébana, Esther Robles‐Solano, Sofia Jurado‐Contreras, Francisca Morillas‐Gutiérrez, Alberto J. Moya, Soledad Mateo, Francisco Javier Navas‐Martos, M. Dolores La Rubia",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "AbstractOlive tree pruning (OTP) is one of the most abundant sources of biomass waste in the Mediterranean basin. This is especially relevant in southern Spain where olive oil production represents a large part of the economy. Olive tree prunings are mostly either burned or are spread in olive orchards as an organic amendment, or used for heat generation on a domestic scale. However, the lignocellulosic composition of OTP makes it a potential source of biopolymers, thus providing an excellent economic alternative for the olive oil sector. In this work, pretreated OTP fibers were subjected to an optimized alkaline treatment followed by a single‐step bleaching reaction with H2O2. Afterwards, the cellulose pulp was transformed chemically to obtain cellulose acetate. Noncellulosic components were removed effectively from OTP, thus obtaining a pulp highly purified in cellulose with 71% crystallinity and 355 °C maximum degradation temperature. Nevertheless, a very large amount of cellulose (ca. 50%) was eliminated throughout the process, especially during acid pretreatment, which was responsible for 38% solubilization. A similar level of acetylation and degree of substitution was obtained by using acetylation times in the range of 1 to 6 h. No large differences were observed in the infrared spectra and X‐ray diffractograms of the synthesized acetates. However, their thermal stability varied significantly with reaction time, evolving from a multistep degradation pattern to a single and sharp peak between 300 and 400 °C with increasing time. Thermogravimetric curves revealed that at least 5 h (preferably 6 h) were needed to obtain cellulose acetate from OTP with adequate thermal stability for further processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/bbb.2600"
    },
    {
        "id": 12373,
        "title": "Detection of early stages of canker on apple tree using hyperspectral imaging technique to thwart canker spread",
        "authors": "A. Moran, R. Goyal, K. Ashutosh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1811"
    },
    {
        "id": 12374,
        "title": "Analysis and Comparison for Innovative Prediction Technique of Breast Cancer Tumor using Decision Tree Algorithm over Support Vector Machine Algorithm with Improved Accuracy",
        "authors": "Ch. Srinivasulureddy, N.S. Kumar, V.S. Binu",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The major goal of this research is to improve the accuracy of the Decision Tree (DT) and Support vector machine (SVM) algorithms and compare their efficiency in detecting breast cancer tumors. Materials and Methods: This work depends on the data obtained from the UCI Machine Learning Repository and used to acquire the data sets for the research of Innovative breast cancer prediction using machine learning algorithms. The sample size of breast cancer prediction involves two groups: Decision tree (N=20) and Support vector machine (N=20) according to clincalc.com by keeping 0.05 alpha error-threshold, 95% confidence interval, enrollment ratio as 0:1, and 80% G power. The accuracy, sensitivity, and precision are calculated using MATLAB software. Result: The accuracy of the DT is 83.83% (p<0.001) while the accuracy rate of the Support vector machine is 97.50%. The Decision tree outcomes have a sensitivity and precision rate of 87.46% (p<0.001) and 84.13% (p<0.001) respectively, whereas the Support vector machine sensitivity and the precision rate are 95.83% and 100% respectively. Conclusion: Support vector machine algorithm performed significantly better with improved accuracy of 97.50% for breast cancer prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.872877"
    },
    {
        "id": 12375,
        "title": "An approach to fuzzy transportation problem using Triacontakaidigon fuzzy number with alpha cut ranking technique",
        "authors": "T. Malathi, P. Senthilkumar",
        "published": "2023",
        "citations": 0,
        "abstract": "One of the particular issues with linear programming is transportation. These are optimization efforts whose goal is to reduce the overall cost of moving goods or people through intricate logistical systems. To reduce the overall transit costs involved in distribution, the problem can be solved by optimizing the delivery system of the specific entity (such as any goods, a person, or a material) from sources (suppliers) to destinations (customers). When evacuating a region, transportation concerns are used to determine the best route for evacuees to take from boarding points to evacuation centers. Particular attention is paid to the travel distance and the overall cost of moving one person.Finding the right number of items to send from each warehouse to each customer while keeping costs to a minimum is the goal of this problem’s solution. In this study, a novel fuzzy number called the Triacontakaidigon Fuzzy Number and its membership function are introduced. In terms of both form and computation, the triacontakaidigon fuzzy number is more complex than the triangular and trapezoidal fuzzy numbers. A fuzzy ranking approach is an efficient tool for addressing the fuzzy transportation problem, as demonstrated by numerical examples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jios-1180"
    },
    {
        "id": 12376,
        "title": "Digital Education Game for TK-A Level Students Using Multimedia Development Life Cycle Method",
        "authors": "Ivan Benawan, Dinar Mutiara Kusumo Nugraheni, Beta Noranita, Guruh Aryotejo",
        "published": "2023-2-10",
        "citations": 0,
        "abstract": "COVID-19 pandemic has changed human life. One of the impacted sectors is education. Ministry of Education urges students to implement distance learning. No exception with early childhood education or Pendidikan Anak Usia Dini (PAUD). Although distance learning has been widely implemented, PAUD sector has the lowest online learning implementation in Indonesia with 13.2% of total 98.4% of PAUD students implementing distance learning, whereas early age is considered capable of gaining an understanding of digital technology and equipment. One possible step in conducting digital learning in PAUD is through a digital educational game, because game is an important element in PAUD. In this study, a digital educational game was developed for TK-A level students using Scratch 3 with multimedia development life cycle method. After development, the game goes through two stages of testing. Alpha testing in the form of black box testing, and beta testing in the form of usability testing with 94,39% result, confidence testing with 97,8% result, and summative evaluation with 90% result on TK-A students, as well as interviews with PAUD teachers. The test results indicate that the game has been successfully developed and is feasible to be played by TK-A students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29407/intensif.v7i1.18671"
    },
    {
        "id": 12377,
        "title": "Bioactive Absorbent Chitosan Aerogels Reinforced with Bay Tree Pruning Waste Nanocellulose with Antioxidant Properties for Burger Meat Preservation",
        "authors": "Esther Rincón, Eduardo Espinosa, María Pinillos, Luis Serrano",
        "published": "2023-2-9",
        "citations": 7,
        "abstract": "As a transition strategy towards sustainability, food packaging plays a crucial role in the current era. This, carried out in a biorefinery context of agricultural residues, involves not only obtaining desirable products but a comprehensive utilization of biomass that contributes to the circular bioeconomy. The present work proposes the preparation of bioactive absorbent food pads through a multi-product biorefinery approach from bay tree pruning waste (BTPW). In a first step, chitosan aerogels reinforced with lignocellulose and cellulose micro/nanofibers from BTPW were prepared, studying the effect of residual lignin on the material’s properties. The presence of micro/nanofibers improved the mechanical performance (up to 60%) in addition to increasing the water uptake (42%) when lignin was present. The second step was to make them bioactive by incorporating bay leaf extract. The residual lignin in the micro/nanofibers was decisive, since when present, the release profiles of the extract were faster, reaching an antioxidant power of more than 85% after only 30 min. Finally, these bioactive aerogels were used as absorbent pads for fresh meat. With the use of the bioactive aerogels (with ≥2% extract), the meat remained fresh for 10 days as a result of delayed oxidation of the food during storage (20% metmyoglobin proportion).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/polym15040866"
    },
    {
        "id": 12378,
        "title": "Financial literacy decision tree game: A system development exposé",
        "authors": "Melany Lotter, Chioma Okoro",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Poor financial literacy has significant economic implications, with limited savings, insufficient retirement provisions and higher dependency on debt. Concerns about the level of financial literacy among the youth or young graduates motivated this study. The study describes the design of a game to educate young graduates while imbibing life-long personal financial management skills. A system development approach was used to present the information. Scenarios and decisions were developed to guide the student (player) in planning and making decisions about their budget with real-life events or cases. The study will be beneficial to university students to transition smoothly into the workforce and take control of their finances. University authorities and stakeholders can also implement the game design to assist students in gaining financial education before venturing into the working world. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4995/head23.2023.16306"
    },
    {
        "id": 12379,
        "title": "Dual alpha-v/beta-6 and alpha-v/beta-1 integrin inhibitor bexotegrast attenuates profibrogenic gene expression of myofibroblasts in human liver explant tissue with biliary fibrosis",
        "authors": "Steve Ho, Chris Her, Richard Ahn, Vikram Rao, Jessie Lau, Mahru An, Scott Turner, Martin Decaris, Johanna Schaub",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0168-8278(23)00933-9"
    },
    {
        "id": 12380,
        "title": "Diagnostik und Therapie der alpha- und beta-Thalassämien",
        "authors": "Holger Cario",
        "published": "2023-2",
        "citations": 0,
        "abstract": "ZusammenfassungDie komplexe Behandlung von Patienten mit Thalassämien stellt nicht nur eine medizinische, sondern angesichts der in den letzten Jahren deutlich gestiegenen Patientenzahlen auch eine gesellschaftliche Herausforderung dar, die eine sehr enge Zusammenarbeit aller Behandler erfordert. Der vorliegende Beitrag erläutert Ursachen und Pathogenese der alpha- und beta-Thalassämien und bietet eine Übersicht zu Klinik und Therapien.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1055/a-1966-5765"
    },
    {
        "id": 12381,
        "title": "Detection of Early Stages of Canker on Apple Tree Using Hyperspectral Imaging Technique to Thwart Canker Spread",
        "authors": "Reema Goyal, Umesh Kumar Lilhore, Kushwant Kaur, Navneet Chaudhry",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aic57670.2023.10263976"
    },
    {
        "id": 12382,
        "title": "Prohexadione calcium as a tool to reduce winter pruning in peach tree cultivar Eragil",
        "authors": "Vagner Brancalione Bolsatto, Wendel Silvestre, Carine Cocco",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "This work evaluated the efficiency and feasibility of applying calcium prohexadione (PCA) at different times to control the vegetative growth and qualitative aspects of the peach tree cultivar Eragil. The experiment was carried out in the 2021/2022 season in a commercial orchard in the municipality of Ipê, RS. Treatments consisted of applications of PCA at a fixed dose of 20 mL·100 L-1 at different stages of development, as shown: T1 – control (no application); T2 – application in petal fall; T3 – application at petal fall + application 30 DAA (days after the first application); T4 – application after green pruning; T5 – application after green pruning + application 30 DAA; T6 – application at petal fall + application 30 DAA + application 60 DAA. The experimental design was in randomized blocks, with six treatments and four replications. Each plot consisted of four plants; the two central plants were considered useful. Effective fruiting increased in T3. In the evaluations of the number of pruned branches, length of branches, and weight of branches per plant, all results were smaller in T2. In the assessments of number of buds, internode length, and pruning time per hectare, there was also a significant difference, and in the number of buds, T6 had the smallest number. The internode length was the greatest in T3, and the shortest pruning time stood out in T4. Calcium prohexadione effectively controlled the vegetative growth of Eragil peach and can be directed to large areas of the peach crop when labor for pruning is scarce.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21674/2448-0479.93.168-177"
    },
    {
        "id": 12383,
        "title": "Vermistabilization of mango tree pruning waste with five earthworm species: A biochemical and heavy metal assessment",
        "authors": "Bhavik Keniya, Hemant Patel, Ketan Patel, Shivam Bhatt, Tushar Patel",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e19908"
    },
    {
        "id": 12384,
        "title": "Multi-stage minimum risk point estimation (MRPE) of a function of unknown $$\\varvec{\\beta }$$ in a Gamma($$\\varvec{\\alpha ,\\beta }$$) model with $$\\varvec{\\alpha }$$ known: related problems and illustrations with analysis from simulations and cancer data",
        "authors": "Nitis Mukhopadhyay, Jing Li",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42081-024-00241-6"
    },
    {
        "id": 12385,
        "title": "Tea Tree Essential Oil Kills Escherichia coli and Staphylococcus epidermidis Persisters",
        "authors": "LeeAnn Nguyen, Brianna DeVico, Maliha Mannan, Matthew Chang, Cristina Rada Santacruz, Christopher Siragusa, Sydney Everhart, Christopher H. Fazen",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "Persister cells are a small subpopulation of non-growing bacteria within a population that can survive long exposures to antibiotic treatment. Following antibiotic removal, persister cells can regrow and populate, playing a key role in the chronic reoccurrence of bacterial infections. The development of new molecules and methods to kill bacterial persisters is critical. Essential oils and other natural products have long been studied for their antimicrobial effects. Here, we studied the effectiveness of tea tree essential oil (TTO), a common component in many commercial care products, against Escherichia coli and Staphylococcus epidermidis persister cells. Using biphasic kill curve assays, we found that concentrations of 0.5% and 1.0% TTO for E. coli and S. epidermidis, respectively, completely eradicated persister cells over a period of 24 h, with the component terpinen-4-ol responsible for most of the killing. Using a colorimetric assay, it was determined that the TTO exhibited its anti-persister effects through a membrane disruption mechanism.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/biom13091404"
    },
    {
        "id": 12386,
        "title": "Adapter Pruning using Tropical Characterization",
        "authors": "Rishabh Bhardwaj, Tushar Vaidya, Soujanya Poria",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.116"
    },
    {
        "id": 12387,
        "title": "The Effect of Game Technique on Learning Concepts in Preschool Period",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7176/jep/14-3-02"
    },
    {
        "id": 12388,
        "title": "A method validation for determining gross alpha-beta activity concentration in water samples using LSC",
        "authors": "Machel Mashaba, Deon Kotze, Victor M. Tshivhase, Arnaud Faanhof",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apradiso.2022.110544"
    },
    {
        "id": 12389,
        "title": "Dynamic spanning tree game with myopic players",
        "authors": "Zhao Guo, Huaijinhui Xu, Ying Liang, Yin Li",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326914"
    },
    {
        "id": 12390,
        "title": "Acoustic Performance Assessment of Sustainable Acoustic Absorbers Made from Olive Tree Pruning and Pine Waste",
        "authors": "R. Cottone, L. Shtrepi, V. Serra, S.L. Pagliolico, A. Schiavi",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61782/fa.2023.1218"
    },
    {
        "id": 12391,
        "title": "Alpha and beta diversity mapping in Indian tropical deciduous forests using high-fidelity imaging spectroscopy",
        "authors": "Bodi Surya Pratap Chandra Kishore, Amit Kumar, Purabi Saikia, M.L. Khan",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asr.2023.02.031"
    },
    {
        "id": 12392,
        "title": "The Effectiveness of Group Guidance Using the Pass The Compliment Game Technique to Enhance Students' Self-Confidence",
        "authors": "Seri Jumiarti Hasibuan, Alfin Siregar",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "This study aims to determine the effectiveness of group guidance with the pass the compliment game technique to increase students' confidence in SMP Muhammadiyah Sukaramai in the 2023/2024 academic year. The method used in this research is a quantitative approach with a quasi-experimental research method, which is an experimental research method that allows researchers to control as many variables as possible from the existing situation. The results showed that no that there is no increase in student confidence by carrying out Group Guidance services through the 'pass the compliment' game technique for grade VIII of SMP Muhammadiyah Sukaramai, Tegal Sari I, Kec. Medan Area, North Sumatra 20216 for the 2023/2024 academic year.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59188/devotion.v4i12.636"
    },
    {
        "id": 12393,
        "title": "Temporal Environmental Status of a Shallow Lake Using Alpha and Beta Diversity on Phytoplankton Communities",
        "authors": "Catalina Ríos-Henríquez, Norka Fuentes",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "Phytoplankton communities are excellent indicators of the environmental status of shallow lakes since changes in diversity alert us to potential deterioration. To assess the environmental condition of a shallow lake with strong anthropogenic pressure from forest monocultures, alpha and beta diversities were determined. Three monitoring stations were established in the shallow Kusrüpuyewe Lake, southern Chile, which were monitored during the 2021 austral summer and winter. Alpha diversity was high indicating a stable environmental condition. In total, 103 species in summer, 96 species in winter and a high species diversity (Shannon index: H′ > 5 bits/ind) were recorded. Beta diversity indicated that this ecosystem is seasonally heterogeneous, is potentially productive and has a high species turnover. Based on the large species inventory, we conclude that this shallow lake is stable and diverse. Although it is threatened by the presence of forest monocultures, it maintains a stable environmental condition, mainly due to the ability of the phytoplankton present to self-regulate through the species turnover. This study provides the relevant background information to establish conservation measures around the shallow lake, an ecosystem that provides various ecosystem services for the local indigenous communities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/w16020274"
    },
    {
        "id": 12394,
        "title": "Recovery of lignins with antioxidant activity from Brewer’s spent grain and olive tree pruning using deep eutectic solvents",
        "authors": "Ana C. Cassoni, Patrícia Costa, Inês Mota, Marta W. Vasconcelos, Manuela Pintado",
        "published": "2023-4",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cherd.2023.01.053"
    },
    {
        "id": 12395,
        "title": "A study on search techniques in the game-tree",
        "authors": "Shaojia Zhang",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Artificial intelligence has developed a lot in the game field and search techniques on game-trees are essential for AI-game-playing. As many techniques for searching the game-trees have been published, the time consumption of search has decreased and the accuracy of it has increased. This paper would provide a comprehensive review of existing algorithms and improvements, including their mechanisms and performances. These techniques are first divided into two sections, techniques based on Alpha-Beta pruning and techniques based on Monte-Carlo tree search. Furthermore, techniques based on Alpha-Beta pruning are further subdivided into narrow window properties and information from previous searches based on the specific aspects they focus on. Finally, this paper concludes by summarizing the performance of these techniques and identifying their suitable application scenarios, as well as suggesting potential directions for future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/32/20230221"
    },
    {
        "id": 12396,
        "title": "Forecasting the default risk of Chinese listed companies using a gradient-boosted decision tree based on the undersampling technique",
        "authors": "Shanshan Wang, Guotai Chi, Ying Zhou, Li Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21314/jrmv.2023.009"
    },
    {
        "id": 12397,
        "title": "A genetic algorithm coupled with tree-based pruning for mining closed association rules",
        "authors": "Jashma Suresh Ponmudiyan Poovan, Dinesh Acharya Udupi, Nandanvana Veerappareddy Subba Reddy",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "Due to the voluminous amount of itemsets that are generated, the association rules extracted from these itemsets contain redundancy, and designing an effective approach to address this issue is of paramount importance. Although multiple algorithms were proposed in recent years for mining closed association rules most of them underperform in terms of run time or memory. Another issue that remains challenging is the nature of the dataset. While some of the existing algorithms perform well on dense datasets others perform well on sparse datasets. This paper aims to handle these drawbacks by using a genetic algorithm for mining closed association rules. Recent studies have shown that genetic algorithms perform better than conventional algorithms due to their bitwise operations of crossover and mutation. Bitwise operations are predominantly faster than conventional approaches and bits consume lesser memory thereby improving the overall performance of the algorithm. To address the redundancy in the mined association rules a tree-based pruning algorithm has been designed here. This works on the principle of minimal antecedent and maximal consequent. Experiments have shown that the proposed approach works well on both dense and sparse datasets while surpassing existing techniques with regard to run time and memory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i3.pp2876-2890"
    },
    {
        "id": 12398,
        "title": "Machine Translation Testing via Syntactic Tree Pruning",
        "authors": "Quanjun Zhang, Juan Zhai, Chunrong Fang, Jiawei Liu, Weisong Sun, Haichuan Hu, Qingyu Wang",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Machine translation systems have been widely adopted in our daily life, making life easier and more convenient. Unfortunately, erroneous translations may result in severe consequences, such as financial losses. This requires to improve the accuracy and the reliability of machine translation systems. However, it is challenging to test machine translation systems because of the complexity and intractability of the underlying neural models. To tackle these challenges, we propose a novel metamorphic testing approach by syntactic tree pruning (STP) to validate machine translation systems. Our key insight is that a pruned sentence should have similar crucial semantics compared with the original sentence. Specifically, STP (1) proposes a core semantics-preserving pruning strategy by basic sentence structures and dependency relations on the level of syntactic tree representation; (2) generates source sentence pairs based on the metamorphic relation; (3) reports suspicious issues whose translations break the consistency property by a bag-of-words model. We further evaluate STP on two state-of-the-art machine translation systems (i.e., Google Translate and Bing Microsoft Translator) with 1,200 source sentences as inputs. The results show that STP accurately finds 5,073 unique erroneous translations in Google Translate and 5,100 unique erroneous translations in Bing Microsoft Translator (400% more than state-of-the-art techniques), with 64.5% and 65.4% precision, respectively. The reported erroneous translations vary in types and more than 90% of them found by state-of-the-art techniques. There are 9,393 erroneous translations unique to STP, which is 711.9% more than state-of-the-art techniques. Moreover, STP is quite effective in detecting translation errors for the original sentences with a recall reaching 74.0%, improving state-of-the-art techniques by 55.1% on average.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640329"
    },
    {
        "id": 12399,
        "title": "An Efficient Technique for Determining Tree Coordinates using LiDAR Data via Deep Learning",
        "authors": "Ilya A. Grishin, Boris S. Goryachkin, Valeri I. Terekhov, Sergey I. Chumachenko",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/reepe60449.2024.10479853"
    },
    {
        "id": 12400,
        "title": "Decision tree algorithm in visual novel game using RenPy games engine",
        "authors": "Diena Rauda Ramdania, Maulana Hamdani, Maisevli Harika, Yana Aditia Gerhana, Nurhadi Qomaruddin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0201995"
    },
    {
        "id": 12401,
        "title": "Non-invasive imaging method demonstrates anti-fibrotic efficacy of a dual integrin alpha-v/beta-6 and alpha-v/beta-1 inhibitor in a rat model of biliary fibrosis",
        "authors": "Johanna Schaub, Yingying Ning, Iris Y. Zhou, Nicholas Rotile, Avery Boice, Jessie Lau, Peter Caravan, Scott Turner",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0168-8278(23)01083-8"
    },
    {
        "id": 12402,
        "title": "Public Effective Dose Assessment Using Gross Alpha and Beta Radioactivity Levels of Tap Drinking Water in the District of Abidjan, Cote d’Ivoire",
        "authors": "Ponaho Claude Kezo, Issa Konate, Tekpo Paul Dali",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jep.2023.143009"
    },
    {
        "id": 12403,
        "title": "Go Extinct! An Award-Winning Evolution Game That Teaches Tree-Thinking as Students Pursue the Winning Strategy",
        "authors": "Ariel E. Marcy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24918/cs.2023.9"
    },
    {
        "id": 12404,
        "title": "Multiple Open Switch Fault Diagnosis of Three Phase Voltage Source Inverter Using Ensemble Bagged Tree Machine Learning Technique",
        "authors": "Chukwuemeka N. Ibem, Mohamed E. Farrag, Ahmed A. Aboushady, Sherif M. Dabour",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3304238"
    },
    {
        "id": 12405,
        "title": "Alpha Strategy for Stripping Beta Returns for Pure Bond Funds",
        "authors": "Jingwen Fan",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "Contemporarily alpha strategy is favorable by investors and funders for its stable performances among volatility market. Although alpha strategy shows great extra returns, it might have great drawdown on account of the stochastic fluctuations of the market (e.g., hedge funds’ poor performance during COVID-19 early state including Bridge Water). Despite from stocks and futures, the bond funds are rather a low volatility type underlying assets, hence the alpha strategy based on pure bond will be more favorable for risk aversion investors. By building a five-factor model, this paper dissolves the returns of pure bond funds to the five factors of level, slope, convex, credit and default, which are separated from each other, and Alpha, which is not directly explained by the factors, and verifies the effectiveness of this alpha factor for selecting pure bond funds. Taking 2019 to 2022 as the time interval, the group backtest results show that the alpha factor stripped of beta has a good effect on the selection of pure bond funds in China's public offering fund market, and the base selection ability is better than the Sharpe Ratio and other traditional risk-return factors. Overall, these results shed light on guiding further exploration of portfolio construction with high alpha based on bond funds.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hbem.v10i.8136"
    },
    {
        "id": 12406,
        "title": "SHADOW PRICE APPROXIMATION FOR THE FRACTIONAL STOCHASTIC ALPHA BETA RHO MODEL",
        "authors": "Abel ZONGO",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17654/0972361723049"
    },
    {
        "id": 12407,
        "title": "Geodesic orbit Finsler $$(\\alpha ,\\beta )$$ metrics",
        "authors": "Zdeněk Dušek",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40879-023-00609-0"
    },
    {
        "id": 12408,
        "title": "Alpha/beta-gamma decoupling in methylphenidate medicated ADHD patients",
        "authors": "Nowell Zammit, Richard Muscat",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "There is much interest to understand how different neural rhythms function, interact and are regulated. Here, we focus on WM delay gamma to investigate its coupling with alpha/beta rhythms and its neuromodulation by methylphenidate. We address this through the use of human EEG conducted in healthy and ADHD subjects which revealed ADHD-specific electrophysiological deficits and MPH-induced normalization of gamma amplitude and its coupling with alpha/beta rhythms. Decreased alpha/beta-gamma coupling is known to facilitate memory representations via disinhibition of gamma ensembles coding the maintained stimuli. Here, we present EEG evidence which suggests that these dynamics are sensitive to catecholaminergic neuromodulation. MPH decreased alpha/beta-gamma coupling and this was related to the increase in delay-relevant gamma activity evoked by the same drug. These results add further to the neuromodulatory findings that reflect an electrophysiological dimension to the well-known link between WM delay and catecholaminergic transmission.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnins.2023.1267901"
    },
    {
        "id": 12409,
        "title": "Monte-Carlo tree search with Epsilon-Greedy for game of amazons",
        "authors": "Chuan Tian",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "The Game of the Amazons is an abstract strategy board game. It has a high computational complexity similar to the game of Go. Due to its NP-complete nature and large branching factor of game tree, finding the optimal move given a specific game state is infeasible and it is not trivial to design a computer algorithm that is competitive to an expert in the game of amazons. One way to tackle this problem is to leverage the Monte-Carlo Tree Search by using random simulations. In this article, a computationally cheap heuristic function is proposed and use together with Monte-Carlo Tree Search algorithm with Epsilon-Greedy policy aiming to design a competitive AI for the Game of the Amazon. The effectiveness of the -greedy based Monte-Carlo algorithm is compared to the widely used MCTS with Upper Confidence Bound and other classical tree search method such as breadth-first search, depth-first search, minmax search and alpha-beta pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230956"
    },
    {
        "id": 12410,
        "title": "Integration of Game Theoretic and Tree Theoretic Approaches to Conway Numbers",
        "authors": "Karol Pąk",
        "published": "2023-9-1",
        "citations": 1,
        "abstract": "Summary\nIn this article, we develop our formalised concept of Conway numbers as outlined in [9]. We focus mainly pre-order properties, birthday arithmetic contained in the Chapter 1, Properties of Order and Equality of John Conway’s seminal book. We also propose a method for the selection of class representatives respecting the relation defined by the pre-ordering in order to facilitate combining the results obtained for the original and tree-theoretic definitions of Conway numbers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/forma-2023-0019"
    },
    {
        "id": 12411,
        "title": "Optimal attention allocation: Picking alpha or betting on beta?",
        "authors": "Zuyao GU, Yun Shi, Tingjin Yan, Yong ZHOU",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4660271"
    },
    {
        "id": 12412,
        "title": "About the Possibilities of Using Alpha Beta Radiometer UMF-2000 with «SpDec» Software for Spectrometric Measurements",
        "authors": "Vladimir Semenischev, Artem Kosmychev, Evgeniy Denisov",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "The experience of exploitation of a a§b-radiometer UMF−2000 with «SpDec» software in spectrometric mode was described. Good linear approximation was shown for energ  calibration curve for a-emitters (18 isotopes), whereas the similar energy calibration curve for bemitters (8 isotopes) showed bad linear approximation. Some limitations in identification of a-emitters due to low energy resolution of spectra, emanation of radon isotopes from sources and difference in source thickness were described. The device was tested using two samples of natural water with a high uranium content.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37414/2075-1338-2024-116-1-50-61"
    },
    {
        "id": 12413,
        "title": "A method for crystallographic mapping of an alpha‐beta titanium alloy with nanometre resolution using scanning precession electron diffraction and open‐source software libraries",
        "authors": "Ian MacLaren, Enrique Frutos‐Myro, Steven Zeltmann, Colin Ophus",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "AbstractAn approach for the crystallographic mapping of two‐phase alloys on the nanoscale using a combination of scanned precession electron diffraction and open‐source python libraries is introduced in this paper. This method is demonstrated using the example of a two‐phase α/β titanium alloy. The data were recorded using a direct electron detector to collect the patterns, and recently developed algorithms to perform automated indexing and analyse the crystallography from the results. Very high‐quality mapping is achieved at a 3 nm step size. The results show the expected Burgers orientation relationships between the α laths and β matrix, as well as the expected misorientations between α laths. A minor issue was found that one area was affected by 180° ambiguities in indexing occur due to this area being aligned too close to a zone axis of the α with twofold projection symmetry (not present in 3D) in the zero‐order Laue Zone, and this should be avoided in data acquisition in the future. Nevertheless, this study demonstrates a good workflow for the analysis of nanocrystalline two‐ or multi‐phase materials, which will be of widespread use in analysing two‐phase titanium and other systems and how they evolve as a function of thermomechanical treatments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/jmi.13275"
    },
    {
        "id": 12414,
        "title": "Overcoming harmonic hurdles: Genuine beta-band rhythms vs. contributions of alpha-band waveform shape",
        "authors": "Natalie Schaworonkow",
        "published": "2023-9-11",
        "citations": 2,
        "abstract": "Abstract\nBeta-band activity in the human cortex as recorded with noninvasive electrophysiology is of diverse origin. In addition to genuine beta-rhythms, there are numerous nonsinusoidal alpha-band rhythms present in the human brain, which will result in harmonic beta-band peaks. This type of activity has different temporal and response dynamics than genuine beta-rhythms. Here, it is argued that in the analysis of higher-frequency rhythms, the relationship to lower-frequency rhythms needs to be clarified. Only in that way we can arrive at strong, methodologically valid interpretations of potential functional roles and generative mechanisms of neural oscillations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/imag_a_00018"
    },
    {
        "id": 12415,
        "title": "Naturally reductive homogeneous $(\\alpha,\\beta)$ spaces",
        "authors": "Shaoxiang Zhang, Zaili Yan, Shaoqiang Deng",
        "published": "2023-4-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5486/pmd.2023.9438"
    },
    {
        "id": 12416,
        "title": "Putative pore structure of amyloid beta and alpha synuclein in lipid bilayers",
        "authors": "Ankita Dutta",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bpj.2022.11.492"
    },
    {
        "id": 12417,
        "title": "Decreasing the Computing Time of Bayesian Optimization Using Generalizable Memory Pruning",
        "authors": "Alexander E. Siemenn, Tonio Buonassisi",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hpec58863.2023.10363486"
    },
    {
        "id": 12418,
        "title": "Medical Image Classification Using Transfer Learning and Network Pruning Algorithms",
        "authors": "Luca Saleh, Li Zhang",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10393868"
    },
    {
        "id": 12419,
        "title": "Design and Analysis of Coconut Tree Climbing Bike Using Reverse Engineering Technique",
        "authors": "Siti Nurul ‘Ain Yahaya,  , Hj. Mohd Azwir Azlan,  ",
        "published": "2023-8-13",
        "citations": 0,
        "abstract": "Coconut trees have hard-shelled fruits that grow as high as eight meters to 30m. It is one of the most important crops in the world. Coconut is considered as a healthy food and is used in a various foods and medicine. In this research, a coconut tress climbing bike was designed using reverse engineering technique based on availableinternet media resources. This research aims  to solve the problem faced by most climbers who do not have  thecomplete   equipment   and   technology to   climb   coconut   trees.   Throughout  the  investigation   and   analysis,references  based  on  Ganapathi  Bhat’s climbing bike design were  studied  to  obtain  the necessary informationincluding load capacity, weight, price, size and estimated speed. Simulation and engineering analysis is made using SolidWorks software to evaluate specification. Based on the analysis and simulation result, this  design is able to support and carry a user weighing 80kg to climb  a coconut tree. The maximum speed of a coconut tree climbing bike  is  estimated  at  0.6m/s.  The  coconut  tree  climbing  bike  design  has  a  size  of  717mm(L)  x  539mm(W)  x  415mm(H) and its estimated weight is 29.7kg. The selling price of this bike is estimated to be approximate RM 3500. This project is expected to provide information to the readers to obtain the coconut tree climbing bicycle technology that has already been in the small regional market in India. Hence, hopefully this research can help tointroduce this technology in more detail to the Malaysia universities and citizens.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30880/jsmt.2023.03.01.004"
    },
    {
        "id": 12420,
        "title": "A hybrid technique using minimal spanning tree and analytic hierarchical process to prioritize functional requirements for parallel software development",
        "authors": "Muhammad Yaseen, Aida Mustapha, Muhammad Arif Shah, Noraini Ibrahim",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00766-023-00397-9"
    },
    {
        "id": 12421,
        "title": "Question Tree Technique in Science Education; Sample Application",
        "authors": "Salih Gülen, Tuğba Yadigar",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "The main purpose of this study is to determine the effect of the question tree technique used in the science lesson and the questions brought independently by the students on academic success. In addition, it is to get the opinions of the students about the use of question tree. Mixed method was used in the study. In the study lasting eight weeks, 61 participants participated with random sampling method. A fully structured interview form was preferred in the collection of qualitative data. Question tree questions and academic achievement test were used to collect quantitative data. The data obtained from the measurement tools were analyzed descriptively and content. In these analyzes, assistance was taken from Microsoft Excel and SPSS 17 programs. T-Test, ANCOVA, frequency and percentage and participant citations were used to interpret the data. According to the findings; It was determined that the question tree technique did not make a significant difference on the academic achievement of the experimental and control groups. The test of question tree questions did not affect academic success. It is thought that bringing the questions out of the book, freeing them not under the control of the teacher and using the low level questions are effective on this result. Students' question tree; It has been determined that they are useful and entertaining, sharing the questions with the class and solving them together, and using them in learning the subjects they cannot understand. It has been determined that the questions put on the question tree of the students have effects such as giving them information, learning new and different questions and solutions. In line with the results, suggestions are presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33418/education.1421858"
    },
    {
        "id": 12422,
        "title": "Intrusion detection using decision tree classifier with feature reduction technique",
        "authors": "Syed Atir Raza Shirazi, Sania Shamim, Abdul Hannan Khan, Aqsa Anwar",
        "published": "2023-3-28",
        "citations": 1,
        "abstract": "The number of internet users and network services is increasing rapidly in the recent decade gradually. A Large volume of data is produced and transmitted over the network. Number of security threats to the network has also been increased. Although there are many machine learning approaches and methods are used in intrusion detection systems to detect the attacks, but generally they are not efficient for large datasets and real time detection. Machine learning classifiers using all features of datasets minimized the accuracy of detection for classifier. A reduced feature selection technique that selects the most relevant features to detect the attack with ML approach has been used to obtain higher accuracy. In this paper, we used recursive feature elimination technique and selected more relevant features with machine learning approaches for big data to meet the challenge of detecting the attack. We applied this technique and classifier to NSL KDD dataset. Results showed that selecting all features for detection can maximize the complexity in the context of large data and performance of classifier can be increased by feature selection best in terms of efficiency and accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22581/muet1982.2302.04"
    },
    {
        "id": 12423,
        "title": "Reinforcement Learning with Neural Network-based Deterministic Game Tree Approximation",
        "authors": "Kevin Prakash, Genya Ishigaki",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdataservice58306.2023.00039"
    },
    {
        "id": 12424,
        "title": "Using Structured Pruning to Find Winning Lottery Tickets",
        "authors": "Kamyab Azizi, Hassan Taheri, Soheil Khooyooz",
        "published": "2023-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csicc58665.2023.10105376"
    },
    {
        "id": 12425,
        "title": "Synthesis of a novel cellulose-based adsorbent from olive tree pruning waste for removal of boron from aqueous solution",
        "authors": "Bekir Fırat Altınbaş, Aslı Yüksel",
        "published": "2023-3-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13399-023-04147-3"
    },
    {
        "id": 12426,
        "title": "Kinetics of Thermal Decomposition of Egyptian Olive Tree Pruning Residues",
        "authors": "Fatma Abosamra, A. Radwan, Y. EL-Hadidi, M. Hamad, M. El kholy",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21608/jssae.2023.202291.1158"
    },
    {
        "id": 12427,
        "title": "Reducing Vocal Fatigue While Preserving Realism During Video Game Voice-Overs Using the Vocal Combat Technique: A Randomized Controlled Trial",
        "authors": "Katelyn Reid, Victoria S. McKenna, C. Andrew Lee, John Paul Giliberto, D.’Arcy Smith",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jvoice.2023.07.006"
    },
    {
        "id": 12428,
        "title": "Assessment of the Spatial Variability and Uncertainty of Shreddable Pruning Biomass in an Olive Grove Based on Canopy Volume and Tree Projected Area",
        "authors": "Antonio Rodríguez-Lizana, Alzira Ramos, María João Pereira, Amílcar Soares, Manuel Castro Ribeiro",
        "published": "2023-6-25",
        "citations": 2,
        "abstract": "Olive pruning residues are a by-product that can be applied to soil or used for energy production in a circular economy model. Its benefits depend on the amount of pruning, which varies greatly within farms. This study aimed to investigate the spatial variability of shreddable olive pruning in a traditional olive grove in Córdoba (Spain) with an area of 15 ha and trees distanced 12.5 m from each other. To model the spatial variability of shreddable olive pruning, geostatistical methods of stochastic simulation were applied to three correlated variables measured on sampled trees: the crown projected area (n = 928 trees), the crown volume (n = 167) and the amount of shreddable pruning (n = 59). Pearson’s correlation between pairs of variables varied from 0.71 to 0.76. The amount of pruning showed great variability, ranging from 7.6 to 76 kg tree−1, with a mean value of 37 kg tree−1. Using exponential and spherical variogram models, the spatial continuity of the variables under study was established. Shreddable dry pruning weight values showed spatial autocorrelation up to 180 m. The spatial uncertainty of the estimation was obtained using sequential simulation algorithms. Stochastic simulation algorithms provided 150 possible images of the amount of shreddable pruning on the farm, using tree projected area and crown volume as secondary information. The interquartile range and 90% prediction interval were used as indicators of the uncertainty around the mean value. Uncertainty validation was performed using accuracy plots and the associated G-statistic. Results indicate with high confidence (i.e., low uncertainty) that shreddable dry pruning weight in the mid-western area of the farm will be much lower than the rest of the farm. In the same way, results show with high confidence that dry pruning weight will be much higher in a small area in the middle east of the farm. The values of the G-statistic ranged between 0.89 and 0.90 in the tests performed. The joint use of crown volume and projected areas is valuable in estimating the spatial variability of the amount of pruning. The study shows that the use of prediction intervals enables the evaluation of farm areas and informed management decisions with a low level of risk. The methodology proposed in this work can be extrapolated to other 3D crops without requiring modifications. On a larger scale, it can be useful for predicting optimal locations for biomass plants, areas with high potential as carbon sinks or areas requiring special soil protection measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/agronomy13071697"
    },
    {
        "id": 12429,
        "title": "Uncertainty guided pruning of classification model tree",
        "authors": "Xinlei Zhou, Sudong Chen, Nianjiao Peng, Xinpeng Zhou, Xizhao Wang",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2022.110067"
    },
    {
        "id": 12430,
        "title": "Tree pruning improves tree form but not understory plant production in mixed stands of Sitka spruce and western hemlock, USA",
        "authors": "Kellen N Nelson, Jeffrey C Barnard, Preston M Massingham, Justin S Crotteau",
        "published": "2024-3-10",
        "citations": 1,
        "abstract": "Abstract\nPrecommercial thinning and tree pruning are frequently used together to improve timber quality and wildlife habitat in even-aged Sitka spruce (Picea sitchensis) and western hemlock (Tsuga heterophylla) stands. Thinning enhances crop tree growth and understory plant production; however, the benefits and drawbacks of tree pruning have received less attention. Tree pruning was investigated in two long-term experiments on the Tongass National Forest, Alaska, USA. Experiment 1 tracked four uniformly thinned sites for ~30 years that received 2.4, 3.6, and 5.2 m lift, and no pruning treatments. Experiment 2 tracked 11 sites for 16 years that received thinning/no pruning, thinning plus pruning (25% of trees), thinning plus pruning (50% of trees), and no thinning/no pruning treatments. We investigated (i) how pruning lift height affects tree form and understory production and (ii) how pruning density affects canopy closure and understory production. In Experiment 1, pruning reduced butt log taper and did not adversely affect diameter or height in either species. Pruning lift was visible in height-to-live crown measurements. Crown recession occurred first in low lift treatments and later in all treatments until crown form was similar after 28–31 years. Epicormic branching rates in Sitka spruce peaked 6–9 years after treatment before falling sharply. Deer forage declined through time and did not differ between lift treatments. In Experiment 2, canopy closure was lower shortly after thinning and pruning, but did not differ from the control after 16 years. Epicormic branching rates were greater shortly after thinning and pruning but did not differ from the control after 16 years. Deer forage declined with canopy closure and thinned and pruned treatments exhibited greater forage than the control. We conclude that pruning can improve log quality for timber applications but does not enhance understory plant biomass and deer forage over thinning treatment alone.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/forestry/cpad042"
    },
    {
        "id": 12431,
        "title": "Some Aspects on a Special Type of $(\\alpha,\\beta )$-metric",
        "authors": "Laurian-loan PISCORAN, Cătălin BARBU",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "The aim of this paper is twofold. Firstly, we will investigate the link between the condition for the functions $\\phi(s)$ from $(\\alpha, \\beta)$-metrics of Douglas type to be self-concordant and k-self concordant, and the other objective of the paper will be to continue to investigate the recently new introduced $(\\alpha, \\beta)$-metric ([17]):\n  $$\n\tF(\\alpha,\\beta)=\\frac{\\beta^{2}}{\\alpha}+\\beta+a \\alpha\n\t$$\n\t where $\\alpha=\\sqrt{a_{ij}y^{i}y^{j}}$ is a Riemannian metric; $\\beta=b_{i}y^{i}$ is a 1-form, and $a\\in \\left(\\frac{1}{4},+\\infty\\right)$ is a real positive scalar. This kind of metric can be expressed as follows: $F(\\alpha,\\beta)=\\alpha\\cdot \\phi(s)$, where $\\phi(s)=s^{2}+s+a$.\n\tIn this paper we will study some important results in respect with the above mentioned $(\\alpha, \\beta)$-metric such as: the Kropina change for this metric, the Main Scalar for this metric and also we will analyze how the condition to be self-concordant and k-self-concordant for the function $\\phi(s)$, can be linked with the condition for the metric $F$ to be of Douglas type.\n\nself-concordant functions, Kropina change, main scalar.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36890/iejg.1265041"
    },
    {
        "id": 12432,
        "title": "Implementasi Behaviour Tree Untuk Mengatur Perilaku NPC Musuh Pada Game 2D Platformer `Cyberun`",
        "authors": "Aribowo Hasti Senoaji, Hanny Haryanto, Sendi Novianto",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "Game Platformer memiliki tujuan inti untuk menggerakan karakter sehingga dapat berpindah tempat dari satu titik ke titik lain dalam sebuah arena baik itu dengan gerakan berlari ataupun melompat. Salah satu faktor yang membuat permainan dalam game lebih menarik adalah adanya karakter NPC yang bertugas sebagai musuh. Tentu perancangan NPC musuh yang baik adalah dengan adanya implementasi agen cerdas sehingga mampu membuat karakter NPC musuh berperilaku lebih dinamis. Salah satu metode yang dapat digunakan dalam perancangan agen cerdas ini adalah Behavior Tree. Behavior Tree merupakan cara penerapan dari suatu pengelompokan yang merupakan proses untuk menentukan fungsi dari pemetaan setiap himpuan behavior ke dalam suatu kelompok yang berbentuk seperti pohon (tree). Dari perancangan Behavior Tree inilah yang kemudian dilakukan pengujian kepada NPC musuh guna mengetahui output yang dihasilkan dari berbagai nodestate yang terdapat pada NPC musuh seperti Idle, Patrol, Attack, dan Death. Nodestate ini diimplementasikan pada masing-masing karakter NPC musuh namun dengan perilaku yang berbeda. Dari pemodelan dengan metode Behavior Tree ini menghasilkan output perilaku yang dinamis dari NPC musuh yang berbeda-beda sesuai dengan apa yang sudah dipetakan sebelumnya.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62411/tcv.v1i2.2061"
    },
    {
        "id": 12433,
        "title": "Mitigating Adversarial Attacks using Pruning",
        "authors": "Vipul Kumar Mishra, Aditya Varshney, Shekhar Yadav",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607947.3608057"
    },
    {
        "id": 12434,
        "title": "Pruning Image Classification CNN Network Using Taylor Scores for High-Speed Inference",
        "authors": "",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets50054"
    },
    {
        "id": 12435,
        "title": "In vitro alpha-amylase and alpha-glucosidase inhibitory activity and in vivo antidiabetic activity of Quercus coccifera (Oak tree) leaves extracts",
        "authors": "Saif Aldeen Jaber",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sjbs.2023.103688"
    },
    {
        "id": 12436,
        "title": "Single-Stent Double-Kissing Nano-Crush Technique for the Management of Side Branch Ostial Lesions: A Game Changer? Or Just Another Player in the Game?",
        "authors": "Kenan Yalta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14744/anatoljcardiol.2023.3694"
    },
    {
        "id": 12437,
        "title": "Development of Immersive Augmented Reality Game Based on Plane Expansion Technique",
        "authors": "Hyun-Ho Jeong, Jong-Seung Park",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7583/jkgs.2023.23.5.77"
    },
    {
        "id": 12438,
        "title": "Decision Tree C4.5 Performance Improvement using Synthetic Minority Oversampling Technique (SMOTE) and K-Nearest Neighbor for Debtor Eligibility Evaluation",
        "authors": "Edi Priyanto, Enny Itje Sela, Luther Alexander Latumakulita, Noourul Islam",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "Nowadays, information technology especially machine learning has been used to evaluate the feasibility of debtors. One of the challenges in this classification model is the occurrence of imbalanced datasets, especially in the German Credit Dataset. Another challenge is developing an optimal model for evaluating debtor eligibility. Based on these challenges, this study aims to develop an optimal model for evaluating debtor eligibility on the German Credit Dataset, using the decision trees, k-Nearest Neighbor (k-NN) and Synthetic Minority Oversampling Technique (SMOTE). SMOTE and k-NN is used to overcome challenges regarding imbalanced datasets. While the decision tree are applied to produce a debtor classification model. In general, the steps taken are preparing datasets, pre-processing data, dividing datasets, oversampling with SMOTE, and classification models using decision trees, and testing. Model performance evaluation is represented by accuracy values obtained from the confusion matrix and area under curve (AUC) values generated by the Receiver Operating Characteristic (ROC). Based on the tests that have been carried out, the best accuracy value in the test is obtained at 73.00% and the AUC value is 0.708, in parameters k = 3 and Max-Depth = 25. Based on the analysis produced, the proposed model can improve performance compared to if the dataset is not applied SMOTE.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33096/ilkom.v15i2.1676.373-381"
    },
    {
        "id": 12439,
        "title": "Asymptotically Wijsman lacunary sequences of order $$(\\alpha ,\\beta )$$",
        "authors": "Ravi Kumar, Sunil K. Sharma, Ajay K. Sharma",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41478-023-00607-1"
    },
    {
        "id": 12440,
        "title": "Comparison of K-Nearest Neighbor and Decision Tree Methods using Principal Component Analysis Technique in Heart Disease Classification",
        "authors": " Al Danny Rian Wibisono,  Syahrul Hidayat,  Humam Maulana Tsubasanofa Ramadhan,  Eva Yulia Puspaningrum",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Heart disease has become a global health issue that can threaten anyone, regardless of age. Numerous research efforts have been made to develop classification methods that can aid in diagnosing heart disease. In this study, we compared two classification methods, namely K-Nearest Neighbor (KNN) and Decision Tree, by applying Principal Component Analysis (PCA) technique to the heart disease classification. The dataset used contains relevant clinical attributes. After analyzing the dataset and performing data preprocessing, we applied PCA to reduce the dataset's dimensions. PCA models with KNN and Decision Tree were implemented and evaluated using performance metrics such as Confusion Matrix, F1 Score, and Accuracy. The analysis results showed that the PCA model with Decision Tree outperformed the PCA model with KNN in terms of accuracy. The Decision Tree model successfully classified all data correctly, while KNN had some misclassifications. This research recommends using the PCA model with Decision Tree for heart disease classification with the best performance. However, further research with larger datasets is needed for a deeper understanding",
        "keywords": "",
        "link": "http://dx.doi.org/10.56705/ijodas.v4i2.70"
    },
    {
        "id": 12441,
        "title": "The Fraction Size Sensitivity of Late Genitourinary Toxicity: Analysis of Alpha/Beta (α/β) Ratios in the CHHiP Trial",
        "authors": "Douglas H. Brand, Sarah C. Brüningk, Anna Wilkins, Olivia Naismith, Annie Gao, Isabel Syndikus, David P. Dearnaley, Nicholas van As, Emma Hall, Sarah Gulliford, Alison C. Tree",
        "published": "2023-2",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijrobp.2022.08.030"
    },
    {
        "id": 12442,
        "title": "Optimization of Microwave-Assisted Organosolv Pretreatment for Enzymatic Hydrolysis of Cherry Tree Pruning and Pistachio Shells: a Step to Bioethanol Production",
        "authors": "Luca Corsi, Soledad Mateo, Francesco Spaccini, Cinzia Buratti, Alberto J. Moya",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "AbstractThe overall purpose of this research work was to apply a microwave-assisted digestion process combined with ethanol organosolv as pretreatment for pistachio shells (PS) and cherry tree pruning (CTP) biomasses for cellulose production. This process would reduce the technical and environmental disadvantages of the accumulation of these agricultural wastes. A central composite design based on the Response Surface Methodology was applied to check the effect of reaction time, temperature, and concentration of ethanol acid solution. Adequate models have been obtained for the contents of cellulose and lignin of the treated solids as well as for solubilized cellulose percentage. Best conditions implied 67% ethanol and 30 min at 150 $$~\\mathrm {^\\circ }$$\n\n\n\n\n∘\n\n\nC, involving the production of a cellulose-enriched material (81.1% and 90.1% for treated CTP and PS, respectively). Finally, enzymatic hydrolysis of these materials was carried out, reaching glucose concentrations of 70 and 100 kg/m$$^{3}$$\n\n\n3\n\n for CTP and PS, resulting in enzymatic hydrolysis yields at 12 h of 97.2% and 76.9%. These high values are one of the main novelties and strengths of this work, as show the ease of the process and can have a beneficial influence on its scale-up, reducing both costs and environmental impact.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12155-023-10647-x"
    },
    {
        "id": 12443,
        "title": "Cold-formed section residual stress determination using cos-alpha x-ray diffraction technique and elastic stress – Strain relations",
        "authors": "Tri Widya Swastika, Heru Purnomo, Rifky Apriansyah, Muhammad Refai Muslih",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0193370"
    },
    {
        "id": 12444,
        "title": "Estimating detection for salt-marsh songbirds during winter using the double-pass rope-drag technique",
        "authors": "Bryan D. Watts, Fletcher M. Smith, Chance H. Hines",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "Bird species that are restricted to tidal marshes during one or all of their life stages are under increasing pressure from sea-level rise. To date, most of the research focused on this group has been conducted during the breeding season despite the fact that more than half of the annual cycle is spent on wintering grounds and the high likelihood that the winter period is the most critical time for adult survival. We used a double-pass rope-drag technique to estimate the winter abundance of sharp-tailed sparrows (Ammospiza nelson and A. caudacutus collectively), seaside sparrows (A. maritimus) and marsh wrens (Cistothorus palustris) within tidal marshes of Virginia along 102 60X250 m transects between January and March, 2014. We used the first pass to remove birds from the transect and the second pass was used to estimate detection probabilities. The technique was highly effective producing detection rates of 98% for sharp-tailed sparrows, 95% for seaside sparrows, and 91% for marsh wrens. We conducted three rounds of surveys and found that species-specific detection rates were comparable when we restricted our analyses to two survey rounds. Availability and abundance estimates deviated to a greater degree than detection rates when restricting data to that collected during only two rounds but confidence intervals overlapped for all three taxa, regardless of which two survey periods were used for the comparison. However, results were less precise when we restricted our analyses to two of three rounds with confidence intervals averaging 13%, 45%, and 14% larger for detection, availability, and abundance respectively. The double-pass rope-drag technique provides an effective, unbiased sampling technique to estimate winter songbird abundance in saltmarsh habitat provided that at least two rounds are used and increasing the number of survey rounds will result in more precise estimates.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0281535"
    },
    {
        "id": 12445,
        "title": "Behavior Tree of Agents in Multi-Agent System on Action Video Game",
        "authors": "Danny Kusuma Wijaya, Ary Setijadi Prihatmanto, Rahadian Yusuf",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceei59426.2023.10346820"
    },
    {
        "id": 12446,
        "title": "Developing a Horror Game with Game Development Life Cycle Method using Unity Game Engine",
        "authors": "Rahmat Hidayat, Marastika Wicaksono Aji Bawono, Muhammad Johan Alibasa",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icodsa58501.2023.10277028"
    },
    {
        "id": 12447,
        "title": "Developing the Console Dash: a 2D Adventure Game using Godot Game Engine",
        "authors": "Sujacka Retno, Zeny Arsya Fortilla, Ilmi Suciani Sinambela",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "A 2D platformer game, console dash is a game that tells the story of Dax, a curious game character, jumping out of his console to go on an adventure. He goes through difficult levels, collects objects and meets new friends. They form a team and fight a villain named Glitch. The aim of this research is to design a 2D Console Dash platformer game with an adventure genre that is interesting and also quite difficult to complete. This application was created using the Godot game engine with the GDScript programming language. The method used in this final assignment uses the MDLC model software development method, and uses the SWOT method for system weakness analysis. The final result of this project is a 2D platformer game that plays smoothly and provides an enjoyable gaming experience. Console Dash offers attractive graphics, music and sound effects that liven up the atmosphere of the game, as well as challenging levels to explore. Moreover, this game has an intuitive interface and responsive controls.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29103/game.v1i1.14555"
    },
    {
        "id": 12448,
        "title": "213-LB: Impact of Alpha- and Beta-Cell Dysfunction on the Longitudinal Progression to Type 2 Diabetes",
        "authors": "VIJAYA SUBRAMANIAN, ARTHUR SHERMAN",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "T2D results from glucotoxicity-driven impairment of insulin secretion which limits compensation for increased insulin demand. Increased demand results from insulin resistance and elevated hepatic glucose production (HGP). Increased HGP can result either from insulin resistance or alpha-cell dysregulation leading to hyperglucagonemia.\nObjectives: To investigate with a mathematical model whether increased HGP and progression to T2D could result from impaired glucagon secretion in addition to insulin resistance. Toward this end, we developed a realistic model of beta-cell growth, death and function and interfaced it with a previously validated model of glucose-insulin-glucagon dynamics.\nMethods: A previously published model of longitudinal progression to T2D over years was extended to include glucagon dynamics. The beta cell mass/function equation was parametrized by interfacing with results from a previously published paper on modeling isoglycemic, intravenous glucose infusion tests to obtain snapshots of the metabolic state. The range of parameters observed in the cohort studied cover the gamut from normal, insulin sensitive to normal, insulin resistant to T2D patients, and was used to calibrate the model. The influence of insulin resistance and impaired glucagon secretion as they develop over time was included in the combined model to see how they impact the balance between enhanced and impaired beta-cell function and mass.\nResults and Conclusion: When only insulin sensitivity was allowed to decrease, the normal subjects did not transition to T2D. This was because the glucose levels were not elevated sufficiently to upset the balance between enhancement and impairment and lead to a catastrophic decline in insulin secretion. Including time-dependent impairment of glucagon suppression, in addition to declining insulin sensitivity, was sufficient to lead to the significant imbalance required to progress to T2D diabetes. Thus, both appear to be required.\n\nDisclosure\nV. Subramanian: None. A. Sherman: None.\n\n\nFunding\nNational Institute of Diabetes and Digestive and Kidney Diseases (DK131328)\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2337/db23-213-lb"
    },
    {
        "id": 12449,
        "title": "Pruning Networks Using Filters Similarity Stability",
        "authors": "Haicheng Qu, Xuecong Zhang",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3584871.3584908"
    },
    {
        "id": 12450,
        "title": "Preparation and physicochemical properties of biochar from the pyrolysis of pruning waste of typical fruit tree in north China",
        "authors": "Xuelei Liu, Xueyong Ren, Jiangchuan Dong, Bowei Wang, Jianli Gao, Ruijiang Wang, Jingjing Yao, Wenbo Cao",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Routine maintenance of fruit trees generates a substantial quantity of pruning waste each year. This waste is potential feedstock for producing energy, materials, and other products. The feasibility of making biochar from the waste via pyrolysis was evaluated. The effects of seven tree species, different pruning sites, and temperature on the pyrolysis process, and the physicochemical properties of the biochar were studied. Pyrolysis of different tree species at 500 °C yielded 27.5 to 33.3% biochar, with a high calorific value (approximately 30 MJ/kg), low ash content (approximately 4%), and capturing up to 60% of the carbon element present. Simultaneously, when the temperature was increased from 400 to 700 °C, the yield of biochar decreased from 35.8% to 24.3%, but the properties improved with the higher heating value rising from 29.2 to 31.3 MJ/kg and the iodine value from 234 to 252 mg/g. The biochar has a good pore structure with a specific surface area of 237 m2/g, total pore volume of 0.175 cm3/g, and average pore size of 2.96 nm. In general, biochar from the pyrolysis of fruitwood pruning waste generated here could be an ideal feedstock to produce high-value-added products, such as solid fuels, activated carbon, and electrode materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15376/biores.18.4.8536-8556"
    },
    {
        "id": 12451,
        "title": "AGT: Channel Pruning Using Adaptive Gradient Training for Accelerating Convolutional Neural Networks",
        "authors": "Nam Joon Kim, Hyun Kim",
        "published": "2023-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic57457.2023.10049943"
    },
    {
        "id": 12452,
        "title": "On the significance of the measurement evaluation method in decision making: A synthesis of JCGM 101 and JCGM 106 applied to gross alpha and gross beta measurements using LSC",
        "authors": "H. Ramebäck, A. Tovedal, K. Norlin",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apradiso.2024.111282"
    },
    {
        "id": 12453,
        "title": "Novel epoxy-bPBD-BisMSB composite plastic scintillator for alpha, beta and gamma radiation detection",
        "authors": "R. M. Sahani, Arun Pandya",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "AbstractA composite plastic scintillator is prepared by uniform dispersion of organic fluorophores 2-(4-Biphenylyl)-5-(4-tert-butylphenyl)-1,3,4-oxadiazole (b-PBD) and 1,4-bis(2-methylstyryl) benzene (Bis-MSB) in epoxy resin followed by curing at room temperature. The developed scintillator is strong blue emitter (425 nm), confirmed by 365 nm UV excited Photo luminescence and beta particle (90Sr-90Y) excited Radio-luminescence characterizations. The developed scintillator is highly transparent (~ 70%) to emitted light wavelength. Moreover, the scintillator’s blue emission is appropriate for photomultiplier tube (PMT) based scintillation measurement due to its maximum peak spectral response in blue region. Alpha, beta and gamma radiation detection were performed on PMT coupled scintillators of sizes Ø50 mm × 1 mm, Ø50 mm × 5 mm and Ø50 mm × 25 mm respectively. Pulse height spectra were recorded using 1 k Multichannel analyser (MCA) using various reference radiation sources. All scintillators demonstrated promising response to the respective radiations. Absolute detection efficiency of alpha scintillator is obtained as 32% (241Am), 86% of that of standard plastic scintillator EJ-212. Beta endpoint energy and gamma Compton edges showed linear variation w.r.t. corresponding channel numbers. Detection efficiency of beta and gamma scintillator is found to be 35.7% (90Sr-90Y) and 6.7% (136Cs) respectively. The developed scintillator has potential to be used for radioactivity contamination & gamma dose rate measurement applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-45501-9"
    },
    {
        "id": 12454,
        "title": "Expression of nNOS alpha and beta isoforms in skeletal muscle of mice",
        "authors": "Oliver Baum",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "Knowledge of the primary structure of neuronal NO synthase (nNOS) in skeletal muscle is still conflicting and needs further clarification. To elucidate the expression patterns of nNOS isoforms at both mRNA and protein level, systematic RT-PCR and epitope mapping by qualitative immunoblot analysis on skeletal muscle of C57/BL6 mice were performed. The ability of the nNOS isoforms to form aggregates was characterized by native low-temperature polyacrylamide electrophoresis (LT-PAGE). The molecular analysis was focused on the rectus femoris (RF) muscle, a skeletal muscle with a nearly balanced ratio of nNOS alpha- and beta-isoforms. RT-PCR amplificates from RF muscles showed exclusive exon-1d mRNA expression, either with or without exon-mu. Epitope mapping demonstrated the simultaneous expression of the nNOS splice variants alpha/mu, alpha/non-mu, beta/mu and beta/non-mu. Furthermore, immunoblotting suggests that the transition between nNOS alpha- and beta-isoforms lies within exon-3. In LT-PAGE, three protein nNOS associated aggregates iwere detected in homogenates of RF muscle and tibialis anterior muscle: a 320 kDa band containing nNOS alpha-isoforms, while 250 kDa and 300 kDa bands consist of nNOS beta-isoforms that form homodimers or heterodimers with non-nNOS proteins.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1042/bcj20230458"
    },
    {
        "id": 12455,
        "title": "Changes of alpha and beta brain waves in exposure to different levels of noise",
        "authors": "Zokaei M, Mohammadian F, Takallou Bighash A",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Introduction: Noise is one of the most important environmental stressors, which, along with the prevalence of exposure in the work and living environment, has various effects. Noise exposure can create positive or negative consequences at different levels. Based on this, in the present study, brain wave changes in exposure to different levels of noise were investigated.\r\nMethods & Materials: In this experimental study, 72 student volunteers with an average age of 26.27 years, participated in this study after meeting the exclusion criteria and receiving sufficient training regarding the implementation procedure. Before starting the test, demographic questionnaires, noise sensitivity, and audiometry were completed for the participants. A noise level of 45 dB was chosen as the background sound, and 75, 85, and 95 dB levels were selected for exposure. The participants were exposed to the determined facial pressure level for half an hour and rested for half an hour. During exposure to the noise, the volunteers' brain waves were used by the portable EEG device E wave, 16 channels. The results were analyzed by the mat lab v12 software.\r\nResult: The results show that exposure to two levels of 75 and 85 dB of absolute power alpha has increased in 14 brain channels, including CZ and O2. The results showed that the noise level of 75 dB compared to the background state did not change significantly at any channels (P>0.05). At the 85 and 95 dB levels, the absolute power of the beta frequency band has increased. At the 95 dB level, this increase is statistically noticeable and significant in almost all brain regions (P<0.05).\r\nConclusion: Based on the results of this study, it can be concluded that exposure to noise causes changes in neuronal activities in the brain, and can affect the performance of the exposed workers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/tkj.v15i4.14586"
    },
    {
        "id": 12456,
        "title": "Prediction of Scrabble Game Results Based on Gradient Boosting Decision Tree and time Series Model",
        "authors": "Pinyan Li, Hao Zhang",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257831"
    },
    {
        "id": 12457,
        "title": "DATA HIDING TECHNIQUE AND ITS APPLICATION BY MASKING THE ALPHA CHANNEL FOR IMAGES USING",
        "authors": "Mehmet ŞANVEREN, Mustafa Cem KASAPBAŞI",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Dijital görüntüler günümüzde büyük bir değer taşımaktadır. İnternetin yaşam kaynaklarımızı desteklediği hızlı \r\niletişim çağında iletişim oldukça önemli hale gelmiştir. Bu bağlamda, veri iletişimi ve transferi konularında bir \r\ntakım çalışmalar yapılmıştır. Gerçekleştirilen saklı veri transferler tekniklerine steganografi adı verilir. \r\nSteganografi, gizli mesajların çeşitli teknikler kullanılarak taşıyıcı nesnelerde saklandığı bir yöntemdir. Bu \r\ntaşıyıcı nesneler, görüntü, ses, video veya metin gibi dosya türlerinden oluşabilir ve içerisinde gizli mesajlar \r\nbarındırabilir. Eğer gizli mesaj, taşıyıcı nesne üzerinde görsel olarak fark edilmeyecek bir şekilde saklanıyorsa, \r\nbu yönteme görüntü steganografisi denir. Bu çalışmada, görüntüler üzerindeki veri gizleme teknikleri üzerinde \r\ndurulmuş ve yeni bir uygulama geliştirilmiştir. C# programlama dili kullanılarak kodlama yapılmıştır. En Düşük \r\nDeğerlikli bit (LSB-Least Significant Bit) tekniği, RGB kanallarının yanı sıra alfa kanalını da (R, G, B, A) \r\nkullanmaktadır. Çalışmanın yapısının ve kalite başarısının testini gerçekleştirmek amacıyla MATLAB ortamında \r\nkodlama yapılarak, PSNR (Peak Signal to Noise Ratio), MSE (Mean Squared Error), SSIM (Structural Similarity \r\nIndex), ve entropi testleri gerçekleştirilmiştir. Elde edilen sonuçlar değerlendirildiğinde, insan gözüyle fark \r\nedilemeyen bir durumu ve kalite ölçümlerinin literatür değerlerine uygun şekilde başarılı olduğunu \r\ngöstermektedir. Bu çalışma, arka planı şeffaf olan resimler için başarılı bir şekilde kullanılabilecek bir teknik \r\nsunmaktadır. Mahremiyet ve gizli iletişim konularında alınan önlemler göz önüne alındığında, bu çalışmanın \r\ngörsel steganografiye katkı sağlayarak arka planı şeffaf olan resimlerde yaşanan problemlere çözüm getireceği \r\ndüşünülmektedir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56809/icujtas.1328818"
    },
    {
        "id": 12458,
        "title": "Modelling energy performance of residential dwellings by using the MARS technique, SVM-based approach, MLP neural network and M5 model tree",
        "authors": "Paulino José García Nieto, Esperanza García–Gonzalo, Beatriz María Paredes–Sánchez, José Pablo Paredes–Sánchez",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apenergy.2023.121074"
    },
    {
        "id": 12459,
        "title": "Neuron-based Pruning of Deep Neural Networks with Better Generalization using Kronecker Factored Curvature Approximation",
        "authors": "Abdolghani Ebrahimi, Diego Klabjan",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191525"
    },
    {
        "id": 12460,
        "title": "Inhalation Technique Maintenance in COPD Patients Using the Albuterol Digihaler",
        "authors": "T. Wang, J.A. Ohar, T. Hill, A. Boe, G. Safioti, R. Dangol, M.B. Drummond",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1164/ajrccm-conference.2023.207.1_meetingabstracts.a2849"
    },
    {
        "id": 12461,
        "title": "1513-P: IAPP25 in Beta Cells and DNSP11 in Alpha Cells Inhibit IAPP37 Fibrillation",
        "authors": "QING-RONG LIU, MIN ZHU, JOSEPHINE M. EGAN",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Amyloidosis due to aggregation of mature islet amyloid polypeptide (IAPP37) in human islets causes β-cell dysfunction and there is a need to develop anti-amyloid therapeutics to protect β-cells. We used a bioinformatic approach to uncover novel human IAPP isoforms and we developed a quantitative selective reaction monitoring (SRM) proteomic assay to measure their translated peptide levels in human pancreatic islets. We used the Thioflavin T amyloid reporter assay to monitor the isoform-derived peptides for fibrillation propensity and for anti-amyloid potential to prevent aggregation of IAPP37. We uncovered hominid specific IAPP isoforms that are encoded by 4 exons instead of the conventional 3 exons: hIAPPβ, which encodes an elongated propeptide, and hIAPPγ, which is a frameshifted prepropeptide that is processed to mature IAPP25 instead of IAPP37. We found IAPP25 peptide levels to be significantly reduced in the islets of T2DM postmortem samples. We also found IAPP25, Cα-peptide (a novel short C-peptide of 19 AAs), and GDNF-derived DNSP11 present in α cells, to be nonaggregating peptides that inhibited the aggregation of IAPP37 in vitro. These novel peptides have potential to be developed as peptide based anti-amyloid therapies (This research was supported entirely by the Intramural Research Program of the NIH, National Institute on Aging).\n\nDisclosure\nQ.Liu: None. M.Zhu: None. J.M.Egan: None.\n\n\nFunding\nNational Institute on Aging\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2337/db23-1513-p"
    },
    {
        "id": 12462,
        "title": "Data Pruning for Efficient Model Pruning in Neural Machine Translation",
        "authors": "Abdul Azeemi, Ihsan Qazi, Agha Raza",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.18"
    },
    {
        "id": 12463,
        "title": "Comparing Different Sequences of Pruning Algorithms for Hybrid Pruning",
        "authors": "Thaker Pragnesh, Biju R. Mohan",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307846"
    },
    {
        "id": 12464,
        "title": "Thermal liquefaction of olive tree pruning waste into bio-oil in water and ethanol with NaOH catalyst",
        "authors": "Bulutcem Öcal, Yaşar Kemal Recepoğlu, Aslı Yüksel",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.joei.2024.101533"
    },
    {
        "id": 12465,
        "title": "R-TOSS: A Framework for Real-Time Object Detection using Semi-Structured Pruning",
        "authors": "Abhishek Balasubramaniam, Febin Sunny, Sudeep Pasricha",
        "published": "2023-7-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dac56929.2023.10247917"
    },
    {
        "id": 12466,
        "title": "Study on pruning optimization based on HRank pruning method",
        "authors": "Sheng Lu",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Convolutional neural network (CNN), as one of the most important pillars of deep learning technology, has been paid increased attention to by researchers. However, by the expansion of the application of convolutional neural network, it faces more and more complex problems and more and more diverse situations. In order to solve these problems more appropriately, the number of parameters of convolutional neural networks continuously increases. This limits its potential to be deployed to distal devices with relatively low computing power and memory space. To improve this situation, this paper studies the compression of convolutional neural network model with acceptable sacrifice of accuracy. Based on Pytorch, Resnet-56 on CIFAR-10 is pruned. By using HRank pruning method, convolution kernels of each convolution layers are ordered according to the size of their determinant rank. Through deleting low-rank, less importance convolution kernels and reserving high-rank, more important convolution kernels, the pruning purpose is achieved. By changing the default compression ratio of different convolution layer, more important ones are applied with lower compression rates and less important ones are applied with higher compression rates, the paper achieves higher compression rate with the acceptable loss of accuracy. At the same time, the paper tests the efficiency of pruning under different learning rates. Finally, the paper finds that when the preset compression rate of the intermediate convolutional layer is changed slightly, the accuracy maintains at the level of 92.720% but the compress rate of Params reaches to 44.7% with 0.47M left and the compress rate of Flops reaches 51.1% with 61.39M left. In addition, the paper finds that when the learning rate is 0.05, the learning efficiency reaches its optimum.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230600"
    },
    {
        "id": 12467,
        "title": "Optimization of Road Detection Using Pruning Method for Deep Neural Network",
        "authors": "Moch. Raditya Aulya Aramdhan, Haniah Mahmudah, Rahardhita Widyatra Sudibyo, Md Manowarul Islam",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ies59143.2023.10242577"
    },
    {
        "id": 12468,
        "title": "A Method for Estimating Online Chess Game Player Ratings with Decision Tree",
        "authors": "Habuki Yamada, Nobuko Kishi, Masato Oguchi, Miyuki Nakano",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigcomp57234.2023.00066"
    },
    {
        "id": 12469,
        "title": "Immunophenotyping of mice with mutated thyroid hormone receptor alpha or beta",
        "authors": "Hones G. Sebastian, Moller Lars Christian, Astrid M. Westendorf, Dagmar Fuhrer, Christina Wenzek",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1530/endoabs.92.ps2-20-08"
    },
    {
        "id": 12470,
        "title": "Effect of pruning and plant growth regulators on Physical development of Ber tree",
        "authors": "Sneha Singh, Bhanu Pratap, Alok Kumar Singh, Viveka Nand Singh, RK Yadav, BP Shahi",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33545/26174693.2024.v8.i3sj.888"
    },
    {
        "id": 12471,
        "title": "Implications of Caspase 1/ Interleukin-1 Beta (IL-1β) Signaling and Hypoxia-Inducible Factor 1-Alpha (HIF-1α) on Diabetic Retinopathy Pathology",
        "authors": "Drew Garber, Shu Zhu",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.42479"
    },
    {
        "id": 12472,
        "title": "Correction to: DISCO: Species Tree Inference using Multicopy Gene Family Tree Decomposition",
        "authors": "",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/sysbio/syad003"
    },
    {
        "id": 12473,
        "title": "Prediction Soaring Price by Decision Tree Dealing with Imbalanced Data in Trading Card Game Market",
        "authors": "Takeru Shishido, Ayahiko Niimi",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20533/ijds.2040.2570.2023.0229"
    },
    {
        "id": 12474,
        "title": "PROVIDING ECO-LITERACY OUTREACH TO GENERATION ALPHA USING GAME-BASED PLASTIC RECYCLING ACTIVITY: CASE STUDY WITH FOSTER CHILDREN OF AN ORPHANAGE",
        "authors": "Yosef Manik, Ni Made Amanda Putri Paramerta, Dinda Fairuz Nadhifah, Elvhan Chatisla Cosaken, Farhan Saefurrahman, Inna Stephanie, Saraswati Sintia Widi",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Abstrak: Sebuah kegiatan edukasi lingkungan berbasis permainan bagi Generasi Alpha telah dilaksanakan. Kegiatan ini bertujuan menumbuhkan kesadaran lingkungan pada anak-anak usia dini, sekaligus memberi ruang bagi mahasiswa Teknik Lingkungan Universitas Presiden dalam menginternalisasi nilai-nilai luhur Pancasila dalam konteks penyelamatan lingkungan. Mitra kegiatan ini adalah sebuah panti asuhan di Kabupaten Bekasi yang mengasuh 30 anak-anak generasi Alpha. Metode yang digunakan meliputi edukasi mengenai isu lingkungan dari limbah plastik, praktik aksi nyata dalam bantuk kreasi kriya dari plastik bekas pakai dan penanaman nilai-nilai Pancasila terkait gotong royong untuk menjaga lingkungan. Evaluasi dilakukan dengan cara memberikan quis impromptu di akhir kegiatan yang mengukur pemahaman peserta mengenai pemahaman dampak lingkungan dari sampah plastik, kesadaran untuk menjaga lingkungan dari cemaran plastik dan keterampilan dalam mengolah sampah plastik. Hasil evaluasi menunjukkan bahwa 100% mitra peserta kegiatan mendapatkan peningkatan pemahaman, kesadaran dan keterampilan terkait pengelolaan sampah plastik.Abstract: An educational activity to raise environmental awareness for Generation Alpha has been carried out. This activity aims to foster environmental awareness in young children, as well as providing space for Environmental Engineering students at President University to practice the noble values of Pancasila in the context of saving the environment. The partner for this activity is an orphanage in Bekasi Regency which cares for 30 children of generation Alpha. The methods used include education about the environmental issue of plastic waste and real action practices in creating crafts from used plastic which are framed within the framework of Pancasila values. Evaluation is carried out by giving an impromptu quiz at the end of the activity to measures participants' understanding of the environmental impact of plastic waste, awareness of protecting the environment from plastic pollution and practical skill in processing plastic waste. The evaluation results show that 100% of activity participants have increased understanding, awareness and skills related to plastic waste management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/jmm.v7i5.17325"
    },
    {
        "id": 12475,
        "title": "Community Detection in Dense Networks using Effective Resistance and Link Pruning",
        "authors": "Annalisa Socievole, Clara Pizzuti",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ict-dm58371.2023.10286913"
    },
    {
        "id": 12476,
        "title": "Risk Assessment of Drinkable Water from Hand-dug Reservoirs Using Gross Alpha and Beta Radioactivity Levels in Ogwashi-Uku, Delta State",
        "authors": "Ijabor Blessing Okeoghene, Nwabuoku Augustine Onyema, Janefrances Chinonso Okpilike, Rachael Erhuvwuada, Choice Uzezi Mallam-Obi",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Over the past decade, radioactivity in drinking water has become a matter of urgent concern following reports from various scientific researches. The rapid urbanization and increase in population of Ogwashi-Uku has culminated in the increase for demand of safe and potable water hence the need for this study. A total of 10 samples were collected from the study location. Standard methods for determination of gross alpha and gross beta activity concentrations in the water samples were deployed. The measured gross alpha activity concentrations for all water samples are below 0.1 Bq/L while the measured gross beta activity concentrations in all water samples collected are lower than 1.0 Bq/L permissible limit. The mean annual dose equivalent in all the water samples for gross alpha and gross beta activity is lower than 0.1 mSv recommended dose for radionuclides in water, hence the life cancer risk assessment showed lower values, indicating the water is safe for drinking. The purpose of this study is to assess the concentration of gross alpha and beta activity levels of drinking water from hand-dug reservoirs in Ogwashi-Uku, Delta State in order to offer a scientific basis for making decisions regarding mitigating radioactive pollution and also to ensure the safety of drinking water and public health.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37745/bjes.2013/vol12n13442"
    },
    {
        "id": 12477,
        "title": "269-LB: Modeling Alpha-Cell Dysfunction Using Stem Cell–Derived Alpha Cells",
        "authors": "SWIKRITI SHRESTHA, QUINN P. PETERSON",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Type 1 Diabetes (T1D) therapies have focused on restoring beta cell function via exogenous insulin or islet transplant. While promising, these approaches fail to account for the role of alpha cells and intra-islet communication in disease etiology. Alpha cells secrete glucagon and maintain effective paracrine signaling with beta cells to maintain glucose homeostasis and metabolic control. Mounting evidences suggest that impaired alpha cell function is a significant contributor to disease progression. Understanding triggers of alpha cell dysfunction and the resulting effects will be crucial for restoring both beta and alpha cell function in T1D. Lack of human alpha cell models have limited progress towards this goal. We recently reported a protocol to generate human alpha cells from stem cell sources (SC-alpha). Using these SC-alpha cells, we have established a T1D disease model to identify the triggers that induce alpha cell dysfunction. Importantly, we have identified defects in proglucagon processing that mimic those observed in diabetes and have identified conditions that modulate proglucagon processing and secretion. Here we demonstrate that exposure of SC-alpha cells to diabetogenic stressors such as hyperglycemia, hyperlipidemia, and ER stress impacts the processing of proglucagon and ultimately results in alpha cell dysfunction. We show that upon exposure to these stressors, SC-alpha cells secrete elevated glucagon compared to the control conditions and show a loss of glucose responsiveness. We also observed changes in the secretion of alternate proglucagon processing products, GLP-1, GLP-2, and glicentin. Interestingly, glicentin levels were affected by ER stress induction, but were unaffected by other stressors, suggesting that ER stress plays a direct role in the disruption of proglucagon processing, leading to alpha cell dysfunction. Identifying triggers of alpha cell dysfunction and assessing impacts in proglucagon processing will be a step towards restoring islet paracrine signaling.\n\nDisclosure\nS. Shrestha: None. Q. P. Peterson: None.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2337/db23-269-lb"
    },
    {
        "id": 12478,
        "title": "Analyzing Game Strategies of the Don’t Get Angry Board Game Using Computer Simulations",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-ijanser.200"
    },
    {
        "id": 12479,
        "title": "AgreementLoss: A Data Pruning Metric For Stable Performance Over All Pruning Ratio",
        "authors": "Ryota Higashi, Toshikazu Wada",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394435"
    },
    {
        "id": 12480,
        "title": "Ultrasound-guided arterial cannulation: Is the game over for the palpation technique?",
        "authors": "Pablo Blanco",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.medin.2023.02.013"
    },
    {
        "id": 12481,
        "title": "Simulation as a Game-based Experiential Technique in English for Professional Purposes: Implementation and Evaluation",
        "authors": "Tatjana Marković, Vesna Jokanović",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "The goal of this paper was to explore how effective  simulation as a game-based instructional method is in teaching English for Professional Purposes. It explains the creation, implementation, and assessment of the Company Simulation, a social epistemic simulation game in which students act out roles in a predetermined scenario and learn about the concepts and relationships of the business world while immersed in a classroom-created micro-world. Students complete tasks that mimic real-world professional tasks by navigating a complex web of interactions and transactions. A students' perceptions questionnaire has shown that the simulation was unequivocally thought to be relevant, enjoyable, and useful. It has also helped participants acquire specific language, social, and domain competences and skills in a collaborative environment offering abundant learning opportunities, thus bridging the academia and industry gap and helping students develop 21st century work-related skills in a meaningful, integrated, and purposeful way.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18690/um.fov.3.2024.44"
    },
    {
        "id": 12482,
        "title": "Using Squid Game to Teach Game Theory",
        "authors": "Wayne Geerling, Kristofer Nagy, Elaine Rhee, Nicola Thomas, Jadrian Wooten",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58311/jeconteach/2dfaffe5f7d50d5513a89ae4be17f4d9ff8cc3f3"
    },
    {
        "id": 12483,
        "title": "Developing a model for unmanned aerial vehicle with fixed-wing using 3D-map exploring rapidly random tree technique",
        "authors": "Omar I. Dallal Bashi, Husamuldeen K. Hameed, Yasir Mahmood Al Kubaisi, Ahmad H. Sabry",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "While the motion planning algorithms consider the obstacles that were known in the map, it is possible to use obstacle avoidance algorithms to take over and send commands to theunmanned aerial vehicle (UAV), when there is an unknown obstacle on the way. The rapidly random tree (RRT) algorithm is used to plan paths for a quad-copter or a fixed-wing UAV. This work develops a model for UAV with fixed-wing using a 3D map exploring the RRT technique. The first step is to obtain a 3D occupancy map from the map data stored in the UAV city to provide a map with some pre-generated obstacles. The contribution of this work is to use RRT planning for 3D state space, where the motion segment or motion primitive connecting the two consecutive states should be defined in a 3D space while satisfying the motion constraints of a UAV. The simulation includes setting up a 3D map, providing the starting and destination pose, planning a way using RRT and 3D Dubins moving primitives, smoothing the acquired trajectory, and simulating the UAV flight. The results obtained demonstrate that the smoothed-generated waypoints significantly improved tracking in general with shorter paths.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v13i1.5305"
    },
    {
        "id": 12484,
        "title": "Possibilistic Cost Computation Tree Logic and Related Equivalence, Abstraction Technique",
        "authors": "Hui Deng, Yuzhe Zhang, Zhilong Huang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2022.3231458"
    },
    {
        "id": 12485,
        "title": "Simulating systems of Itô SDEs with split-step $ (\\alpha, \\beta) $-Milstein scheme",
        "authors": "Hassan Ranjbar, Leila Torkzadeh, Dumitru Baleanu, Kazem Nouri",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>In the present study, we provide a new approximation scheme for solving stochastic differential equations based on the explicit Milstein scheme. Under sufficient conditions, we prove that the split-step $ (\\alpha, \\beta) $-Milstein scheme strongly convergence to the exact solution with order $ 1.0 $ in mean-square sense. The mean-square stability of our scheme for a linear stochastic differential equation with single and multiplicative commutative noise terms is studied. Stability analysis shows that the mean-square stability of our proposed scheme contains the mean-square stability region of the linear scalar test equation for suitable values of parameters $ \\alpha, \\beta $. Finally, numerical examples illustrate the effectiveness of the theoretical results.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2023133"
    },
    {
        "id": 12486,
        "title": "Measurements of $\\alpha$, $\\beta$, $\\phi_s$ and $B$ meson lifetime properties at LHCb",
        "authors": "Ramon Angel Ruiz Fernandez,  ",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22323/1.411.0102"
    },
    {
        "id": 12487,
        "title": "Probing the Assembly of Nicotinuric Acid with Alpha and Beta Cyclodextrin Molecules by Physiochemical Investigation and Computational Approach",
        "authors": "",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24214/jcbps.a.13.4.42031"
    },
    {
        "id": 12488,
        "title": "Alpha-stable branching and beta-frequency processes, beyond the IID assumption",
        "authors": "Adrián González Casanova, Imanol Nuñez, José Luis Pérez",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-ecp570"
    },
    {
        "id": 12489,
        "title": "Information revelation and coordination using cheap talk in a game with two-sided private information",
        "authors": "Chirantan Ganguly, Indrajit Ray",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractWe consider a version of the Battle of the Sexes with private information and allow cheap talk regarding the players’ types before the game. We show that a desirable type-coordination property is achieved at the unique fully revealing symmetric equilibrium (when it exists). Type-coordination is also obtained in a partially revealing equilibrium that exists when the fully revealing equilibrium does not. We further prove that truthfully revealed messages, followed by actions that depend meaningfully on these messages, are not equilibrium profiles with one-sided cheap talk. Finally, fully revealing equilibria do not exist under sequential communication either.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00182-023-00857-0"
    },
    {
        "id": 12490,
        "title": "PENGUJIAN ANIMASI MOTION GRAPHIC SAVE THE PLANET DENGAN METODE ALPHA DAN BETA TESTING",
        "authors": "Nuri Cahyono, Rio Bagus Candrahutomo",
        "published": "2023-2-5",
        "citations": 0,
        "abstract": "Animasi save the planet dibuat dengan Teknik motion graphic dan dalam pengembangan telah melalui tiga tahap pengembangan. Untuk mengetahui kelayakan dari animasi yang dibuat maka dilakukan pengujian dengan dua metode yaitu alpha testing dan beta testing. Pada alpha testing didapatkan hasil animasi tersebut memenuhi pengujian 12 prinsip animasi, memenuhi pengujian kebutuhan fungsional dan memenuhi pengujian kesesuaian terhadap storyboard. Dalam beta testing terdapat dua validasi yaitu uji aspek kelayakan cerita dengan presentase 95% dan  uji aspek kelayakan animasi di peroleh presentase 92%  artinya animasi sudah layak untuk dijadikan media edukasi.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i1.6147"
    },
    {
        "id": 12491,
        "title": "Filter-Pruning of Lightweight Face Detectors Using a Geometric Median Criterion",
        "authors": "Konstantinos Gkrispanis, Nikolaos Gkalelis, Vasileios Mezaris",
        "published": "2024-1-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw60836.2024.00037"
    },
    {
        "id": 12492,
        "title": "Induced membrane technique using beta-tricalcium phosphate for reconstruction of clavicle bone defect after fracture related infection - A case report",
        "authors": "Kunihiko Arakawa, Yoshinobu Watanabe, Gen Sasaki, Hirotaka Matsuura, Mari Nishizawa, Akifumi Honda, Natsumi Saka, Hirotaka Kawano",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tcr.2024.101013"
    },
    {
        "id": 12493,
        "title": "Reply to Letter to the Editor: “Single-Stent Double-Kissing Nano-Crush Technique for the Management of Side Branch Ostial Lesions: A Game Changer? Or Just Another Player in the Game?”",
        "authors": "Emrah Acar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14744/anatoljcardiol.2023.3696"
    },
    {
        "id": 12494,
        "title": "Game4Good: A Community-Based and Interactive Game Platform for Social Impact using Game Engine and Big Data Analysis",
        "authors": "Yize Wang, Moddwyn Andaya",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "This paper introduces a novel approach to education through game-based learning by merging chemistry and traffic planning concepts into interactive experiences [1]. The project addresses challenges in comprehending chemical reactions and traffic congestion issues [2][3]. A Unity Engine-based game was developed for each subject [4]. The chemistry game enabled players to simulate real-life chemical reactions and compound combinations, enhancing practical understanding [5]. The traffic planning game offered scenarios to design effective traffic flow, fostering awareness and knowledge of traffic management. Both experiments demonstrated significant post-test score improvements in the experimental groups compared to controls. Results underscore the efficacy of game-based learning in promoting experiential comprehension. The immersive and interactive nature of the games facilitated engagement, enabling participants to apply theoretical knowledge to practical situations. These findings contribute to innovative educational tools that bridge theoretical gaps and provide effective learning avenues.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131715"
    },
    {
        "id": 12495,
        "title": "Effects of winter pruning intensity on the interactions between the apple tree and rosy apple aphid Dysaphis plantaginea (Hemiptera: Aphididae)",
        "authors": "Sabrina Benzina, Abdelkader Harizia, Abdelkader Elouissi, Tara Canelo, Raul Bonal",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41348-023-00789-7"
    },
    {
        "id": 12496,
        "title": "Effects of urban tree pruning on ecosystem services performance",
        "authors": "Desirée Muscas, Fabio Orlandi, Roberto Petrucci, Chiara Proietti, Luigia Ruga, Marco Fornaciari",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tfp.2024.100503"
    },
    {
        "id": 12497,
        "title": "Cryo-EM of &amp;alpha;-tubulin isotype-containing microtubules                     revealed a contracted structure of &amp;alpha;4A/&amp;beta;2A microtubules",
        "authors": "Lei Diao, Wei Zheng, Qiaoyu Zhao, Mingyi Liu, Zhenglin Fu, Xu Zhang, Lan Bao, Yao Cong",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3724/abbs.2023130"
    },
    {
        "id": 12498,
        "title": "Asymptotically lacunary statistical equivalence set sequences of order $(\\alpha,\\beta)$",
        "authors": "Ravi Kumar, Sunil K. Sharma",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32513/asetmj/193220082326"
    },
    {
        "id": 12499,
        "title": "Nondestructive estimation of pomegranate tree biomass by using allometric equation",
        "authors": "Ganeshamurthy Nanjundaiah Arkalgud, Rupa T.R, Alivelu Karasula",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59512/aaz.2023.62.3.4"
    },
    {
        "id": 12500,
        "title": "Penerapan Finite State Machine pada Alpha Utopia Menggunakan Metode Game Development Life Cycle",
        "authors": "Dini Destiani Siti Fatimah, Eri Satria, Fujia Hermawan",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "Pembuatan game yang menggunakan artificial intelligence bisa menjadikan salah satu daya tarik tersendiri bagi pemainnya. Game dapat dimanfaatkan sebagai media pembelajaran. Game edukasi cocok untuk dimainkan oleh anak-anak dengan menggunakan style/gameplay dua dimensi dengan banyaknya text atau drag & drop. Penelitian ini bertujuan membuat game untuk memperkenalkan salah satu khas budaya Indonesia dengan menerapkan finite state machine, sebuah mesin abstrak yang pada suatu waktu tertentu dapat berada tepat di salah satu dari sejumlah finite-states.  Sebuah game dibuat dan diberi nama Alpha Utopia. Metode game development life cycle digunakan terdiri dari tahapan initiation, pre-production, production, testing, beta, release. Hasil penelitian diperoleh sebuah game yang dengan tema menembak objek. Perancangan menggunakan Unreal Engine 4 dengan gaya tiga dimensi, menggunakan Artificial Intelligence atau sering disebut Non-Player Character. Finite State Machine diterapkan untuk pembuatan aplikasinya. Unsur budaya Indonesia berupa senjata keris ditampilkan pada objek permainan sebagai senjata utama yang digunakan untuk melawan musuh berupa karakter virus. Pembuatan game ini diharapkan mengenalkan budaya khas Indonesia dan sebagai media pembelajaran bagi penggunanya.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33364/algoritma/v.20-1.1269"
    },
    {
        "id": 12501,
        "title": "Comparison of alpha/beta T cell depletion with posttransplant cyclophosphamide in haploidentical transplantation",
        "authors": "Mehmet Ozen, Mehmet Gunduz, Ilknur Aksoyoglu, Ahmet Ifran, Ali Ugur Ural",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.30714/j-ebr.2023.178"
    },
    {
        "id": 12502,
        "title": "On the Seidel integral graphs which\nbelong to the class $\\alpha K_a\\cup \\beta K_b$",
        "authors": "Mirko Lepović",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30755/nsjom.15679"
    },
    {
        "id": 12503,
        "title": "Stochastically Pruning Large Language Models Using Sparsity Regularization and Compressive Sensing",
        "authors": "Mohammad Munzurul Islam, Mohammed Alawad",
        "published": "2023-6-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583781.3590232"
    },
    {
        "id": 12504,
        "title": "The Impact of Model Capacity on Performance via Weight Pruning: A Study Using the Food-11 Dataset",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.66"
    }
]