[
    {
        "id": 20071,
        "title": "Modeling Automobile Sales in Turkiye with  Regression-Based Machine Learning Algorithms",
        "authors": "Merve Babaoğlu, Ahmet Coşkunçay, Tolga Aydın",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26650/joda.1242645"
    },
    {
        "id": 20072,
        "title": "Linear Regression",
        "authors": "",
        "published": "2020-1-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108690935.009"
    },
    {
        "id": 20073,
        "title": "Regression Algorithms in Machine Learning",
        "authors": "Usha Sakthivel, Neha Singhal, Pethuru Raj Chelliah, Ashwini R. Malipatil",
        "published": "2021-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003119838-5"
    },
    {
        "id": 20074,
        "title": "MODELING USING LINEAR AND POLYNOMIAL REGRESSION ALGORITHMS OF MACHINE LEARNING BASED ON MAHALLA DATA",
        "authors": "M.F. Ibragimov, O.K. Khujaev, H.J. Rakhimboev, D.Z. Khaitboeva",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "The article deals with the problem of creating a model and algorithm to support the importance of monitoring in the management of socio-economic processes in self-government bodies, decision-making in self-government bodies through machine learning. Models and algorithms of the decision-making process in digital form are studied, consisting of independent data, quantitative parametric assessments of the activities of self-government bodies and general expert assessments of self-government bodies. This model is used to quantify the generalized expert assessment of the condition of the object of the new self-government body, which is interpreted as a proposed improvement solution.",
        "link": "http://dx.doi.org/10.25743/dir.2022.99.37.017"
    },
    {
        "id": 20075,
        "title": "Regression",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.028"
    },
    {
        "id": 20076,
        "title": "MODELING OF GENERAL CARGO SHIP’S MAIN ENGINE POWERS WITH REGRESSION BASED MACHINE LEARNING ALGORITHMS: COMPARATIVE RESEARCH",
        "authors": "Fatih OKUMUŞ, Araks EKMEKÇİOĞLU",
        "published": "2021-6-30",
        "citations": 1,
        "abstract": "This study, which allows estimating main engine power of new ships based on data from general cargo ships, consists of a series of mathematical relationships. Thanks to these mathematical relationships, it can be predicted main engine power according to length (L), gross tonnage (GT) and age of a general cargo ship. In this study, polynomial regression, K-Nearest Neighbors (KNN) regression and Gradient Boosting Machine (GBM) regression algorithms are used. By this means the relationships presented here, it is aimed to build ships that are environmentally friendly and can be sustained at a lower cost by using the main engine power of the new ships with high accuracy. In addition, the relationships presented here provide validation for computational fluid dynamics (CFDs) and other studies with empirical statements. As a result of the study, polynomial regression gives similar results with other studies in the literature. We also concluded that while KNN regression yields fast results, GBM regression algorithm provides more accurate solutions to estimate the ship's main engine power.",
        "link": "http://dx.doi.org/10.47512/meujmaf.923874"
    },
    {
        "id": 20077,
        "title": "Data-Driven Modeling of Oil Saturation from Dielectric Logs Using Ensemble Regression, Dimensionality Reduction and Anomaly Detection Machine Learning Algorithms",
        "authors": "M. A. Alghazal, D. Krinis",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "Abstract\nDielectric is a specialized logging tool employed to measure the oil saturation independently of water salinity, enabled by the convoluted multi-frequency measurements of the formation's dielectric properties. Conventional resistivity and salinity-dependent tools are more commonly used but with high measurement uncertainty in variable salinity environments. In this paper, we developed a unique data-driven model encapsulating several supervised and unsupervised machine learning algorithms to predict the dielectric-based saturation using readily available reservoir and well data.\nMore than 20 features were extracted from a common reservoir, well and petrophysical data such as: fluid densities, porosity, free water level, rock type, caliper and resistivity-based oil saturation. We also handcrafted features relating the sample's depth to the nearest injector and reservoir structure. The dataset, with 4000 samples, was randomly split into 80% training and 20% testing. Training was performed using cross-validation technique to benchmark and tune various machine learning regression models including: ensemble methods, neural network and support vector machines. The performance of regression models were further optimized via integrating dimensionality reduction and anomaly detection machine learning models.\nEnsemble methods, particularly random forest, produced the best cross-validation score compared to other regression models. When tested on unseen samples, the random forest model predicted the dielectric oil saturation with 68% correlation coefficient. Two features dimensionality reduction techniques were evaluated to improve prediction using principal component analysis (PCA) and recursive feature elimination (RFE). PCA screen-plot analysis was performed to reduce the features dimensionality to five principle components accounting for more than 80% of data variability. The RFE model was used to select seven optimal features from the total original features. The refitted random forest model, based on the reduced features from both techniques, resulted in a better prediction with the RFE model by 4%. To further improve results, the Density-Based Spatial Clustering of Applications with Noise (DBSCAN) unsupervised model was used to detect anomalies across high dimensional features. The parameters from the DBSCAN model identified more than 400 outliers mostly located at the reservoir's top invaded and lower quality production zones. By removing these outliers, the predicted dielectric oil saturation on test samples from random forest have improved to 76% correlation coefficient.\nCompared to conventional logs, the dielectric tool provides salinity-independent measurement of oil saturation, but it is more expensive with elaborate physical models. In this paper, we demonstrate the unique development of fully-integrated supervised and unsupervised machine learning models for predicting the dielectric oil saturation based on the soft-computation of readily available features extracted from conventional reservoir and well sources.",
        "link": "http://dx.doi.org/10.2118/216430-ms"
    },
    {
        "id": 20078,
        "title": "Linear Regression",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.029"
    },
    {
        "id": 20079,
        "title": "Logistic Regression",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.030"
    },
    {
        "id": 20080,
        "title": "Regression Evaluation",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.033"
    },
    {
        "id": 20081,
        "title": "Logistic Regression",
        "authors": "V Kishore Ayyadevara",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3564-5_3"
    },
    {
        "id": 20082,
        "title": "Inductive Learning Algorithms",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-2"
    },
    {
        "id": 20083,
        "title": "Linear Regression",
        "authors": "V Kishore Ayyadevara",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3564-5_2"
    },
    {
        "id": 20084,
        "title": "Mathematical Modeling of Cancers Using Machine Learning Algorithms",
        "authors": "",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "This paper shows a mathematical modeling method using different machine learning algorithms for prediction of probability of procuring Pancreatic Cancer (PC). Each algorithm reports its own accuracy, precision, recall and F1-score. Also, a Bayesian network model is used to determine the probability each subject has in contracting PC on the basis of certain preconditions, like his dietary habits and other biological attributes. This paper makes use of the PC dataset as provided by the National Cancer Institute in collaboration with National Institute of Health (NIH). The features obtained from this dataset can have either a binary value or a scalar value. The dataset consists of three questionnaires distributed to 155000 subjects. In each of these questionnaires, the subject is asked about his dietary habits and illness history.",
        "link": "http://dx.doi.org/10.33140/ijcrt.08.03.07"
    },
    {
        "id": 20085,
        "title": "Machine Learning Algorithms Using Logistic Regression for Predicting Neurosurgical Outcomes",
        "authors": "Nida Fatima",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground: Preoperative prognostication of clinical and surgical outcome in patients with neurosurgical diseases can improve the risk stratification, thus can guide in implementing targeted treatment to minimize these events. Therefore, the author aims to highlight the development and validation of predictive models determining neurosurgical outcomes through machine learning algorithms using logistic regression.Methods: Logistic regression (enter, backward and forward) and least absolute shrinkage and selection operator (LASSO) method for selection of variables from selected database can eventually lead to multiple candidate models. The final model with a set of predictive variables must be selected based upon the clinical knowledge and numerical results.Results: The predictive model which performed best on the discrimination, calibration, Brier score and decision curve analysis must be selected to develop machine learning algorithms. Logistic regression should be compared with the LASSO model. Usually for the big databases, the predictive model selected through logistic regression gives higher Area Under the Curve (AUC) than those with LASSO model. The predictive probability derived from the best model could be uploaded to an open access web application which is easily deployed by the patients and surgeons to make a risk assessment world-wide.Conclusions: Machine learning algorithms provide promising results for the prediction of outcomes following cranial and spinal surgery. These algorithms can provide useful factors for patient-counselling, assessing peri-operative risk factors, and predicting post-operative outcomes after neurosurgery.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-37934/v1"
    },
    {
        "id": 20086,
        "title": "Advances in regression analysis for performance modeling of machine learning systems (Conference Presentation)",
        "authors": "George Steven Goley, Brian Thelen, Ismael Xique, Adam Nolan",
        "published": "2020-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2562153"
    },
    {
        "id": 20087,
        "title": "Enhancing Logistic Regression Using Neural Networks for Classification in Actuarial Learning",
        "authors": "George Tzougas, Konstantin Kutzkov",
        "published": "2023-2-9",
        "citations": 4,
        "abstract": "We developed a methodology for the neural network boosting of logistic regression aimed at learning an additional model structure from the data. In particular, we constructed two classes of neural network-based models: shallow–dense neural networks with one hidden layer and deep neural networks with multiple hidden layers. Furthermore, several advanced approaches were explored, including the combined actuarial neural network approach, embeddings and transfer learning. The model training was achieved by minimizing either the deviance or the cross-entropy loss functions, leading to fourteen neural network-based models in total. For illustrative purposes, logistic regression and the alternative neural network-based models we propose are employed for a binary classification exercise concerning the occurrence of at least one claim in a French motor third-party insurance portfolio. Finally, the model interpretability issue was addressed via the local interpretable model-agnostic explanations approach.",
        "link": "http://dx.doi.org/10.3390/a16020099"
    },
    {
        "id": 20088,
        "title": "Computer-Aided Medical Diagnosis System Using Logistics Regression Algorithms (LRA) Supervised Learning Approach",
        "authors": "AKINWOLE Agnes Kikelomo,  ",
        "published": "2021-12-2",
        "citations": 0,
        "abstract": "This work focused on the designing of medical diagnosis system using Supervised Machine Learning. Logistics Regression Algorithms (LRA) was adopted, the label inputs for the data set which the symptoms were trained and mapped with the input of the user. Diagnosis of malaria was considered in this work; the system verified the value of the logical regression in the medical decision support system. Medical practitioners and other health workers can use this system to make better decisions in medical diagnosis for malaria. Adoption of this system will reduce stress of diagnoses malaria from patient and reduce congestion in our hospitals.",
        "link": "http://dx.doi.org/10.47191/etj/v6i12.02"
    },
    {
        "id": 20089,
        "title": "Drilling Optimization Applying Machine Learning Regression Algorithms",
        "authors": "Freddy J. Marquez",
        "published": "2021-8-9",
        "citations": 0,
        "abstract": "Abstract\nMachine Learning is an artificial intelligence subprocess applied to automatically and quickly perform mathematical calculations to data in order to build models used to make predictions. Technical papers related to machine learning algorithms applications have being increasingly published in many oil and gas disciplines over the last five years, revolutionizing the way engineers approach to their works, and sharing innovating solutions that contributes to an increase in efficiency.\nIn this paper, Machine Learning models are built to predict inverse rate of penetration (ROPI) and surface torque for a well located at Gulf of Mexico shallow waters. Three type of analysis were performed. Pre-drill analysis, predicting the parameters without any data of the target well in the database. Drilling analysis, running the model every sixty meters, updating the database with information of the target well and predicting the parameters ahead the bit. Sensitivity parameter optimization analysis was performed iterating weight on bit and rotary speed values as model inputs in order identify the optimum combination to deliver the best drilling performance under the given conditions.\nThe Extreme Gradient Boosting (XGBoost) library in Python programming language environment, was used to build the models. Model performance was satisfactory, overcoming the challenge of using drilling parameters input manually by drilling bit engineers. The database was built with data from different fields and wells. Two databases were created to build the models, one of the models did not consider logging while drilling (LWD) data in order to determine its importance on the predictions.\nPre-drill surface torque prediction showed better performance than ROPI. Predictions ahead the bit performance was good both for torque and ROPI. Sensitivity parameter optimization showed better resolution with the database that includes LWD data.",
        "link": "http://dx.doi.org/10.4043/30934-ms"
    },
    {
        "id": 20090,
        "title": "A Remote Sensing Approach for Surface Urban Heat Island Modeling in a Tropical Colombian City Using Regression Analysis and Machine Learning Algorithms",
        "authors": "Julián Garzón, Iñigo Molina, Jesús Velasco, Andrés Calabia",
        "published": "2021-10-22",
        "citations": 7,
        "abstract": "The Surface Urban Heat Islands (SUHI) phenomenon has adverse environmental consequences on human activities, biophysical and ecological systems. In this study, Land Surface Temperature (LST) from Landsat and Sentinel-2 satellites is used to investigate the contribution of potential factors that generate the SUHI phenomenon. We employ Principal Component Analysis (PCA) and Multiple Linear Regression (MLR) techniques to model the main temporal and spatial SUHI patterns of Cartago, Colombia, for the period 2001–2020. We test and evaluate the performance of three different emissivity models to retrieve LST. The fractional vegetation cover model using Sentinel-2 data provides the best results with R2 = 0.78, while the ASTER Global Emissivity Dataset v3 and the land surface emissivity model provide R2 = 0.27 and R2 = 0.26, respectively. Our SUHI model reveals that the factors with the highest impact are the Normalized Difference Water Index (NDWI) and the Normalized Difference Build-up Index (NDBI). Furthermore, we incorporate a weighted Naïve Bayes Machine Learning (NBML) algorithm to identify areas prone to extreme temperatures that can be used to define and apply normative actions to mitigate the negative consequences of SUHI. Our NBML approach demonstrates the suitability of the new SUHI model with uncertainty within 95%, against the 88% given by the Support Vector Machine (SVM) approach.",
        "link": "http://dx.doi.org/10.3390/rs13214256"
    },
    {
        "id": 20091,
        "title": "Regression Revisited: Using LP to Fit Linear Models",
        "authors": "",
        "published": "2020-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781316227268.017"
    },
    {
        "id": 20092,
        "title": "Data fitting and regression",
        "authors": "Xin-She Yang",
        "published": "2019",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-817216-2.00011-9"
    },
    {
        "id": 20093,
        "title": "Regression tasks for machine learning",
        "authors": "K.A. Venkatesh, K. Mohanasundaram, V. Pothyachi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-91776-6.00009-9"
    },
    {
        "id": 20094,
        "title": "Support vector machine and regression",
        "authors": "Xin-She Yang",
        "published": "2019",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-817216-2.00014-4"
    },
    {
        "id": 20095,
        "title": "Performance Analysis of Regression-Machine Learning Algorithms for Predication of Runoff Time",
        "authors": "Marwan Khan, Sanam Noor",
        "published": "2019",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.35248/2168-9881.19.8.187"
    },
    {
        "id": 20096,
        "title": "Basic Algorithms and Program Listings",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-8"
    },
    {
        "id": 20097,
        "title": "Modeling of Quadruple Tank System using Machine Learning Algorithms",
        "authors": "Aravindan M",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nModeling is essential for understanding the input and output behavior of quadruple tank system, analysis and design of controllers. Precise mathematical model for multi loop system-based Quadruple Tank Process (QTP) is a challenging task, due to strong interaction between pump inputs and output liquid level sensor values. Traditional methods such as transfer function and state space model limitations are removed through the proposed Model. Transfer function model can never be applied to multiple input and multiple output QTP system. State space model never address the internal state of QTP system. In this paper, Machine Learning based Quadruple Tank Process model is proposed such as Gaussian Process Regression Quadruple Tank Process (GPR-QTP) model and Support Vector Machine Quadruple Tank Process (SVM-QTP) model for runtime input and output sensor level data from laboratory based QTP station. Regression technique is performed with pump inputs and output liquid level data which can change in experimental environments such as ambient temperature and tube condition change, due to unknown disturbances and due to change in power supply to the pumps. The regression technique is verified with R-square values of proposed models. GPR-QTP and SVM-QTP models are developed using MATLAB software. From experimental results, GPR-QTP and SVM-QTP models perform better than conventional transfer function and state space model and validated through performance analysis such as Mean Absolute Error (MAE), Root Mean Squared Error (RMSE), R-squared (R2) and Mean Squared Error (MSE). GPR-QTP and SVM-QTP models provides an accuracy of about 98%.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1884689/v1"
    },
    {
        "id": 20098,
        "title": "Reinforcement Learning and Genetic Algorithms",
        "authors": "Richard A. Berk",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-40189-4_9"
    },
    {
        "id": 20099,
        "title": "Communication-aware Distributed Gaussian Process Regression Algorithms for Real-time Machine Learning",
        "authors": "Zhenyuan Yuan, Minghui Zhu",
        "published": "2020-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc45564.2020.9147886"
    },
    {
        "id": 20100,
        "title": "Nearest Neighbor outperforms Kernel-Kernel Methods for Distribution Regression",
        "authors": "Ilqar Ramazanli",
        "published": "2022-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cacml55074.2022.00009"
    },
    {
        "id": 20101,
        "title": "Prediction of Stock Prices using Machine Learning (Regression, Classification) Algorithms",
        "authors": "Srinath Ravikumar, Prasad Saraf",
        "published": "2020-6",
        "citations": 34,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet49848.2020.9154061"
    },
    {
        "id": 20102,
        "title": "Logistic regression, PCA, LDA, and ICA",
        "authors": "Xin-She Yang",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-817216-2.00012-0"
    },
    {
        "id": 20103,
        "title": "Physical Fields and Modeling",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-4"
    },
    {
        "id": 20104,
        "title": "Modeling an e-Commerce Hybrid Recommender System Based on Machine Learning Algorithms",
        "authors": "Antonio Panarese, Giuseppina Settanni, Angelo Galiano",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011745700003393"
    },
    {
        "id": 20105,
        "title": "Inductive Learning Algorithms for Complex Systems Modeling",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493"
    },
    {
        "id": 20106,
        "title": "Impact Analysis of Stacked Machine Learning Algorithms Based Feature Selections for Deep Learning Algorithm Applied to Regression Analysis",
        "authors": "Shrirang Ambaji Kulkarni, Varadraj P Gurupur, Christian King",
        "published": "2022-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/southeastcon48659.2022.9764105"
    },
    {
        "id": 20107,
        "title": "Resilient Modulus Prediction from Regression and Machine Learning Algorithms",
        "authors": "Kanika Gupta, Sung Soo Park, Antonio Bobet",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1061/9780784485354.020"
    },
    {
        "id": 20108,
        "title": "Machine Learning Regression–based Forecasting",
        "authors": "Akshay R Kulkarni, Adarsha Shivananda, Anoosh Kulkarni, V Adithya Krishnan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8978-5_4"
    },
    {
        "id": 20109,
        "title": "Loan Repayment Prediction Using Logistic Regression Ensemble Learning With Machine Learning Algorithms",
        "authors": "Thuan Nguyen Dinh, Binh Pham Thanh",
        "published": "2022-11-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscmi56532.2022.10068483"
    },
    {
        "id": 20110,
        "title": "Optimizing Pension Participation in Kenya through Predictive Modeling: A Comparative Analysis of Tree-Based Machine Learning Algorithms and Logistic Regression Classifier",
        "authors": "Nelson Kemboi Yego, Juma Kasozi, Joseph Nkurunziza",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "Pension plans play a vital role in the economy by impacting savings, consumption, and investment allocation. Despite declining mortality rates and increasing life expectancy, pension enrollment remains low, affecting the long-term financial stability and well-being of populations. To address this issue, this study was conducted to explore the potential of predictive modeling techniques in improving pension participation. The study utilized three tree-based machine learning algorithms and a logistic regression classifier to analyze data from a nationally representative 2019 Kenya FinAccess Household Survey. The results indicated that ensemble tree-based models, particularly the random forest model, were the most effective in predicting pension enrollment. The study identified the key factors that influenced enrollment, such as National Health Insurance Fund (NHIF) usage, monthly income, and bank usage. The findings suggest that collaboration among the NHIF, banks, and pension providers is necessary to increase pension uptake, along with increased financial education for citizens. The study provides valuable insight for promoting and optimizing pension participation.",
        "link": "http://dx.doi.org/10.3390/risks11040077"
    },
    {
        "id": 20111,
        "title": "Regression analysis for Dependent current status data",
        "authors": "Hanwen Yan, Yuting Zhou, Xuemei Yang",
        "published": "2022-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cacml55074.2022.00111"
    },
    {
        "id": 20112,
        "title": "Steel Phase Kinetics Modeling using Symbolic Regression",
        "authors": "David Piringer, Bernhard Bloder, Gabriel Kronberger",
        "published": "2022-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/synasc57785.2022.00059"
    },
    {
        "id": 20113,
        "title": "Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael C. Kolios",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring\napoptosis and classifying clusters of apoptotic cells based on\nthe changes in ultrasound backscatter signals from the tissues.\nThe backscatter from normal and apoptotic cells, using a high\nfrequency ultrasound instrument are modeled through an\nAutoregressive (AR) modeling technique. The proper model\norder is calculated by tracking the error criteria in the\nreconstruction of the original signal. The AR model\ncoefficients, which are assumed to contain the main statistical\nfeatures of the signal, are passed as the input to Linear and\nNonlinear machine classifiers (Fisher Linear Discriminant,\nConditional Gaussian Classifier, Naive Bayes Classifier and\nNeural Networks with nonlinear activation functions). In\naddition, an adaptive signal segmentation method ,(Least\nSquares Lattice Filter) is used to differentiate the data from\nlayers of different cell types into stationary parts ready for\nmodeling and classification. <div>Keywords: Apoptosis, Ultrasound Backscatter </div>",
        "link": "http://dx.doi.org/10.32920/ryerson.14639328"
    },
    {
        "id": 20114,
        "title": "Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael C. Kolios",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring\napoptosis and classifying clusters of apoptotic cells based on\nthe changes in ultrasound backscatter signals from the tissues.\nThe backscatter from normal and apoptotic cells, using a high\nfrequency ultrasound instrument are modeled through an\nAutoregressive (AR) modeling technique. The proper model\norder is calculated by tracking the error criteria in the\nreconstruction of the original signal. The AR model\ncoefficients, which are assumed to contain the main statistical\nfeatures of the signal, are passed as the input to Linear and\nNonlinear machine classifiers (Fisher Linear Discriminant,\nConditional Gaussian Classifier, Naive Bayes Classifier and\nNeural Networks with nonlinear activation functions). In\naddition, an adaptive signal segmentation method ,(Least\nSquares Lattice Filter) is used to differentiate the data from\nlayers of different cell types into stationary parts ready for\nmodeling and classification. <div>Keywords: Apoptosis, Ultrasound Backscatter </div>",
        "link": "http://dx.doi.org/10.32920/ryerson.14639328.v1"
    },
    {
        "id": 20115,
        "title": "Maximum Power Point Tracking with Regression Machine Learning Algorithms for Solar PV systems",
        "authors": "",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20508/ijrer.v12i3.13249.g8517"
    },
    {
        "id": 20116,
        "title": "Experimental Comparison of Thermal Performance of Different Refrigerants and Modeling with Regression Algorithms",
        "authors": "Oguzhan Pektezel, Mehmet DAS, Halil Ibrahim Acar",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4017099"
    },
    {
        "id": 20117,
        "title": "Epilogue",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-9"
    },
    {
        "id": 20118,
        "title": "Applications",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-6"
    },
    {
        "id": 20119,
        "title": "Process parameter optimization of 6061AA Friction Stir Welded Joints using Supervised Machine Learning Regression-based Algorithms",
        "authors": "Akshansh Mishra, Eyob Meseele Sefene, Assefa Asmare Tsegaw",
        "published": "No Date",
        "citations": 1,
        "abstract": "The highest strength-to-weight ratio criterion has fascinated curiosity increasingly in virtually all areas where heft reduction is indispensable. Lightweight materials and their joining processes are also a recent point of research demands in the manufacturing industries. Friction Stir Welding (FSW) is one of the recent advancements for joining materials without adding any third material (filler rod) and joining below the melting point of the parent material. The process is widely used for joining similar and dissimilar metals, especially lightweight non-ferrous materials like aluminum, copper, and magnesium alloys. This paper presents verdicts of optimum process parameters on attaining enhanced mechanical properties of the weld joint. The experiment was conducted on a 5 mm 6061 aluminum alloy sheet. Process parameters; tool material, rotational speed, traverse speed, and axial forces were utilized. Mechanical properties of the weld joint are examined employing a tensile test, and the maximum joint strength efficiency was reached 94.2%. Supervised Machine Learning based Regression algorithms such as Decision Trees, Random Forest, and Gradient Boosting algorithms were used. The results showed that the Random Forest algorithm yielded highest coefficient of determination value of 0.926 which means it gives a best fit in comparison to other algorithms.",
        "link": "http://dx.doi.org/10.33774/chemrxiv-2021-hh7nn"
    },
    {
        "id": 20120,
        "title": "Process parameter optimization of 6061AA Friction Stir Welded Joints using Supervised Machine Learning Regression-based Algorithms",
        "authors": "Akshansh Mishra, Eyob Meseele Sefene, Assefa Asmare Tsegaw",
        "published": "No Date",
        "citations": 2,
        "abstract": "The highest strength-to-weight ratio criterion has fascinated curiosity increasingly in virtually all areas where heft reduction is indispensable. Lightweight materials and their joining processes are also a recent point of research demands in the manufacturing industries. Friction Stir Welding (FSW) is one of the recent advancements for joining materials without adding any third material (filler rod) and joining below the melting point of the parent material. The process is widely used for joining similar and dissimilar metals, especially lightweight non-ferrous materials like aluminum, copper, and magnesium alloys. This paper presents verdicts of optimum process parameters on attaining enhanced mechanical properties of the weld joint. The experiment was conducted on a 5 mm 6061 aluminum alloy sheet. Process parameters; tool material, rotational speed, traverse speed, and axial forces were utilized. Mechanical properties of the weld joint are examined employing a tensile test, and the maximum joint strength efficiency was reached 94.2%. Supervised Machine Learning based Regression algorithms such as Decision Trees, Random Forest, and Gradient Boosting algorithms were used. The results showed that the Random Forest algorithm yielded highest coefficient of determination value of 0.926 which means it gives a best fit in comparison to other algorithms.",
        "link": "http://dx.doi.org/10.26434/chemrxiv-2021-hh7nn"
    },
    {
        "id": 20121,
        "title": "Regression Classification",
        "authors": "",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781394209118.ch8"
    },
    {
        "id": 20122,
        "title": "Introduction",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-1"
    },
    {
        "id": 20123,
        "title": "On Modeling Smoke-Haze Incidence with Cluster and Regression Analyses",
        "authors": "Kacha Chansilp, Paradee Chuaybamroong, Kittisak Kerdprasop, Nittaya Kerdprasop",
        "published": "2020-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijmlc.2020.10.6.1004"
    },
    {
        "id": 20124,
        "title": "Evaluating Resilience of Infrastructures Towards Endogenous Events by Non-Destructive High-Performance Techniques and Machine Learning Regression Algorithms",
        "authors": "Nicholas Fiorentini, Pietro Leandri, Massimo Losa",
        "published": "No Date",
        "citations": 0,
        "abstract": "\n        &lt;p&gt;In order to plan infrastructure maintenance strategies, Non-Destructive Techniques (NDT) have been largely employed in recent years, achieving outstanding results in the identification of infrastructural deficiencies. Nevertheless, the extensive combination of different NDT that can cover various factors affecting infrastructure durability has not yet been thoroughly investigated.&lt;/p&gt;&lt;p&gt;This paper proposes a methodology for evaluating the resilience of infrastructures towards endogenous factors by combining different NDT outcomes. Machine Learning (ML) Regression algorithms have been used to predict the pavement surface roughness connected to a set of potential endogenous conditioning factors. The development, application, and comparison of two different regression algorithms, specifically Regression Tree (RT) and Random Forest (RF) have been carried out.&lt;/p&gt;&lt;p&gt;The study area involves 4 testing sites, both in the rural and urban context, for a total length of 11400 m. In addition to the International Roughness Index (IRI) calculated by profilometric measurements, a set of endogenous features of the infrastructure were collected by using NDT such as Falling Weight Deflectometer (FWD), and Ground Penetrating Radar (GPR). Moreover, a set of topographical data of roadside areas, information on properties of materials composing the subgrade and the pavement structure, traffic flow, rainfall, temperature, and age of infrastructure were gathered.&lt;/p&gt;&lt;p&gt;The database was randomly split into a Training (70%) and Test sets (30%). With the Training set, through a 10-Fold Cross-Validation (CV), the models have been trained and validated. A set of three performance metrics, namely Correlation Coefficient (R&lt;sup&gt;2&lt;/sup&gt;), Root Mean Square Error (RMSE), and Mean Absolute Error (MSE), has been used for the Goodness-of-Fit (GoF) assessment. Also, with the Test set, the Predictive Performance (PP) of the models has been evaluated.&lt;/p&gt;&lt;p&gt;Results indicate that the suggested methodology is satisfactory for supporting processes on planning road maintenance by National Road Authorities (NRA) and allows decision-makers to pursue better solutions.&lt;/p&gt;\n        ",
        "link": "http://dx.doi.org/10.5194/egusphere-egu2020-21183"
    },
    {
        "id": 20125,
        "title": "Capacity Loss Analysis Using Machine Learning Regression Algorithms",
        "authors": "Sergen Atay, Ahmet Aytug Ayranci, Burcu Erkmen",
        "published": "2022-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceee55327.2022.9772532"
    },
    {
        "id": 20126,
        "title": "Regression Modeling Basics",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781506303451.n3"
    },
    {
        "id": 20127,
        "title": "Bayesian Learning for Sparsity-Aware Modeling",
        "authors": "Lei Cheng, Zhongtao Chen, Yik-Chung Wu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-22438-6_2"
    },
    {
        "id": 20128,
        "title": "Feature Learning Using Random Forest and Binary Logistic Regression for ATDS",
        "authors": "Chandra Shekhar Yadav, Aditi Sharan",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-3357-0_22"
    },
    {
        "id": 20129,
        "title": "A machine learning approach to predict the rating of team using regression algorithms",
        "authors": "Ashok Ramavath, Vandana Bhattacharjee, Sanjay Kumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0182615"
    },
    {
        "id": 20130,
        "title": "User interest modeling and collaborative filtering algorithms application in English personalized learning resource recommendation",
        "authors": "Wu Jin",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn order to solve the problem that the current traditional English classroom teaching in large classes has higher teaching efficiency, but it is difficult to take care of every student, and it is difficult to meet the needs of students' personalized learning, this paper combines user interest modeling and collaborative filtering algorithms to propose a knowledge-oriented learning resource recommendation method. Moreover, this paper proposes an algorithm based on user interest model. In addition, on the basis of obtaining the user's historical interest model, this paper combines user behavior information to obtain the user interest model and calculates the similarity between the candidate items and the user, and makes TOP-N recommendation based on the similarity calculation result. Finally, this paper conducts experiments on the news dataset, and compares the results with the benchmark algorithm to prove the effectiveness of the algorithm. The results show that this paper has achieved certain results in the research of combining multi-data source user interest modeling and recommendation and has made a little contribution to the research of interest modeling.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2767576/v1"
    },
    {
        "id": 20131,
        "title": "Key Regression Modeling Concepts",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781506303451.n4"
    },
    {
        "id": 20132,
        "title": "A Comparative Study of Penalized Regression and Machine Learning Algorithms in High Dimensional Scenarios",
        "authors": "Connor Shrader, Gabriel Ackall",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1137/22s1538302"
    },
    {
        "id": 20133,
        "title": "Regression with Deep Neural Networks: Generalization Error Guarantees, Learning Algorithms, and Regularizers",
        "authors": "Jaweria Amjad, Zhaoyan Lyu, Miguel R.D. Rodrigues",
        "published": "2021-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco54536.2021.9616069"
    },
    {
        "id": 20134,
        "title": "Regression Analysis of COVID-19 using Machine Learning Algorithms",
        "authors": "Ekta Gambhir, Ritika Jain, Alankrit Gupta, Uma Tomer",
        "published": "2020-9",
        "citations": 41,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosec49089.2020.9215356"
    },
    {
        "id": 20135,
        "title": "Comparison Decision Tree and Logistic Regression Machine Learning Classification Algorithms to determine Covid-19",
        "authors": "Artika Arista",
        "published": "2022-1-3",
        "citations": 6,
        "abstract": "Many people today are unsure whether they have COVID-19. The frequent fever, dry cough, and sore throat are all signs and symptoms of COVID-19. If a person has signs or symptoms of coronavirus disease 2019 (COVID-19), he/she should see the doctor or go to a clinic as soon as possible. As a result, it's vital to learn and comprehend the fundamental differences. COVID-19 can cause a wide range of symptoms. The experiments were carried out using two Machine Learning Classification Algorithms, namely Decision Tree (DT) and Logistic Regression (LR). Both algorithms were written and analyzed using the Python program in Jupyter Notebook 6.4.5. From the results obtained in the experiments of covid symptoms dataset, on average, the DT model has obtained the best cross-validation average and the testing performance average compared to the LR machine learning models. For cross-validation results, the DT model has achieved an accuracy of 98.0%. For performance testing, the DT model has achieved an accuracy of 98.0%. The LR has obtained the second-best result on the average of cross-validation performance and the testing results. For cross-validation results, the LR model has achieved an accuracy of 96.0%. For performance testing, the LR model has achieved an accuracy of 97.0%. Consequently, the DT for the COVID-19 symptoms dataset is outperforming the LR for cross-validation and testing results.",
        "link": "http://dx.doi.org/10.33395/sinkron.v7i1.11243"
    },
    {
        "id": 20136,
        "title": "A comparison of machine learning algorithms and traditional regression-based statistical modeling for predicting hypertension incidence in a Canadian population",
        "authors": "Mohammad Ziaul Islam Chowdhury, Alexander A. Leung, Robin L. Walker, Khokan C. Sikdar, Maeve O’Beirne, Hude Quan, Tanvir C. Turin",
        "published": "2023-1-2",
        "citations": 9,
        "abstract": "AbstractRisk prediction models are frequently used to identify individuals at risk of developing hypertension. This study evaluates different machine learning algorithms and compares their predictive performance with the conventional Cox proportional hazards (PH) model to predict hypertension incidence using survival data. This study analyzed 18,322 participants on 24 candidate features from the large Alberta’s Tomorrow Project (ATP) to develop different prediction models. To select the top features, we applied five feature selection methods, including two filter-based: a univariate Cox p-value and C-index; two embedded-based: random survival forest and least absolute shrinkage and selection operator (Lasso); and one constraint-based: the statistically equivalent signature (SES). Five machine learning algorithms were developed to predict hypertension incidence: penalized regression Ridge, Lasso, Elastic Net (EN), random survival forest (RSF), and gradient boosting (GB), along with the conventional Cox PH model. The predictive performance of the models was assessed using C-index. The performance of machine learning algorithms was observed, similar to the conventional Cox PH model. Average C-indexes were 0.78, 0.78, 0.78, 0.76, 0.76, and 0.77 for Ridge, Lasso, EN, RSF, GB and Cox PH, respectively. Important features associated with each model were also presented. Our study findings demonstrate little predictive performance difference between machine learning algorithms and the conventional Cox PH regression model in predicting hypertension incidence. In a moderate dataset with a reasonable number of features, conventional regression-based models perform similar to machine learning algorithms with good predictive accuracy.",
        "link": "http://dx.doi.org/10.1038/s41598-022-27264-x"
    },
    {
        "id": 20137,
        "title": "Optimization of Regression algorithms using Learning curve in WSN",
        "authors": "Vivek Kumar verma, Vinod Kumar",
        "published": "2021-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacite51222.2021.9404686"
    },
    {
        "id": 20138,
        "title": "Regression with Shrinkage",
        "authors": "Kao-Tai Tsai",
        "published": "2021-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003205685-3"
    },
    {
        "id": 20139,
        "title": "High Performance Concrete (HPC) Compressive Strength Prediction With Advanced Machine Learning Methods",
        "authors": "Melda Yucel, Ersin Namlı",
        "published": "2022-5-13",
        "citations": 0,
        "abstract": "In this chapter, the authors realized prediction applications of concrete compressive strength values via generation of various hybrid models, which are based on decision trees as main a prediction method. This was completed by using different artificial intelligence and machine learning techniques. In respect to this aim, the authors presented a literature review. The authors explained the machine learning methods that they used as well as with their developments and structural features. Next, the authors performed various applications to predict concrete compressive strength. Then, the feature selection was applied to a prediction model in order to determine parameters that were primarily important for the compressive strength prediction model. The authors evaluated the success of both models with respect to correctness and precision prediction of values with different error metrics and calculations. ",
        "link": "http://dx.doi.org/10.4018/978-1-6684-6291-1.ch006"
    },
    {
        "id": 20140,
        "title": "Modeling and Optimization in Software-Defined Networks",
        "authors": "Konstantinos Poularakis, Leandros Tassiulas, T.V. Lakshman",
        "published": "2021-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2200/s01099ed1v01y202105lna027"
    },
    {
        "id": 20141,
        "title": "A hybrid deep neural network with statistical learning algorithms for flood susceptibility modeling",
        "authors": "Morteza Ghobadi, Masumeh Ahmadipari",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFlood, with its environmental impact, is a naturally destructive process usually causes severe damage. Therefore, the determination of the areas susceptible to flood by the latest tools, which can render precise estimations, is essential to mitigate this damage. In this study, it was attempted to evaluate flood susceptibility in Lorestan, Iran using a novel hybrid approach including Deep Neural Network (DNN), Frequency Ratio (FR), and Stepwise Weight Assessment Ratio Analysis (SWARA). For this purpose, a geospatial database of floods, including 142 flood locations and 10 flood influencing variables, was used to predict the flood susceptibility areas. FR and SWARA were applied to weigh and score the flood influencing variables, while DNN, which is an excellent tool of machine learning and artificial intelligence, was used to prepare the inference flood pattern. The performance of the models was checked by the area under the curve (AUC), receiver operating characteristic (ROC) curve, and various statistical tests. The outputs indicated that both of the proposed algorithms, DNN-FR and DNN-SWARA, were able to estimate the future flood zones with a precision of over 90%. The outputs also confirmed that although the two algorithms had a high goodness-of-fit and prediction accuracy, the DNN-FR (AUC = 0.953) outperformed the DNN-SWARA (AUC = 0.941). Thus, the DNN-FR algorithm was proposed to be applied as a more reliable and accurate tool for spatial estimation of flood zones.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2500950/v1"
    },
    {
        "id": 20142,
        "title": "Correlation and Regression",
        "authors": "Mohd. Abdul Haleem Rizwan",
        "published": "2020-7-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119654834.ch3"
    },
    {
        "id": 20143,
        "title": "Phase Retrieval Based on Supervised Machine Learning Regression Algorithms",
        "authors": "Helton A. Azevedo, Rafael R.L Benevides, Sébastien R.M.J Rondineau",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wcnps60622.2023.10345110"
    },
    {
        "id": 20144,
        "title": "Clusterization and Recognition",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-5"
    },
    {
        "id": 20145,
        "title": "MACHINE LEARNING ALGORITHMS FOR DETECTION OF CYBER THREATS USING LOGISTIC REGRESSION",
        "authors": "Hari Gonaygunta",
        "published": "2023-1",
        "citations": 1,
        "abstract": "The threat of cyberattacks is expanding globally; thus, businesses are developing intelligent artificial intelligence systems that can analyze security and other infrastructure logs from their systems department and quickly and automatically identify cyberattacks. Security analytics based on machine learning the next big thing in cybersecurity is machine data, which aims to mine security data to show the high maintenance costs of static relationship rules and methods. But, choosing the appropriate machine learning technique for log analytics using ML continues to be a significant barrier to AI success in cyber security due to the possibility of a substantial number of false-positive detections in large-scale or global Security Operations Centre (SOC) settings, selecting the proper machine learning technique for security log analytics remains a substantial obstacle to AI success in cyber security. A machine learning technique for a cyber threat exposure system that can minimize false positives is required. Today's machine learning methods for identifying threats frequently use logistic regression. Logistic regression is the first of three machine learning subcategories—supervised, unsupervised, and reinforcement learning. Any machine learning enthusiast will encounter this supervised machine learning algorithm at the beginning of their machine learning career. It's an essential and often applied classification algorithm.",
        "link": "http://dx.doi.org/10.47893/ijssan.2023.1229"
    },
    {
        "id": 20146,
        "title": "Modeling of Functional Coefficients in Varying-Coefficient Quantile Regression via Machine Learning Approach",
        "authors": "Andrey Babkin",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3418861"
    },
    {
        "id": 20147,
        "title": "A regularized logistic regression based model for supervised learning",
        "authors": "Carlos Brito-Pacheco, Carlos Brito-Loeza, Anabel Martin-Gonzalez",
        "published": "2020-1",
        "citations": 1,
        "abstract": " In this work, we introduce a new regularized logistic model for the supervised classification problem. Current logistic models have become the preferred tools for supervised classification in many situations. They mostly use either L1 or L2 regularization of the weight vector of parameters. Here we take a different approach by applying regularization not to the weight vector but to the gradient vector of the function representing the separating hyper-surface. We present the mathematical analysis of the model in its continuous setting and provide experimental evidence to show that the new model is competitive with state of the art models. ",
        "link": "http://dx.doi.org/10.1177/1748302620971535"
    },
    {
        "id": 20148,
        "title": "Regression Analysis for Marketing Data: Regression-Based Modeling",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781529732801"
    },
    {
        "id": 20149,
        "title": "Modeling the magnetocaloric effect of manganite using hybrid genetic and support vector regression algorithms",
        "authors": "Taoreed O. Owolabi",
        "published": "2019-5",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.physleta.2019.02.036"
    },
    {
        "id": 20150,
        "title": "Flight Delay Prediction Using Different Regression Algorithms in Machine Learning",
        "authors": "A. Evangeline, R. Catherine Joy, A. Albert Rajan",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspc57692.2023.10125675"
    },
    {
        "id": 20151,
        "title": "Algorithms and Software for Numerical Estimation of Posinomial Regression Models Using the Least Squares Method",
        "authors": "Mikhail Bazilevskiy, Anna Karaulova",
        "published": "2023-5-16",
        "citations": 0,
        "abstract": "The article is devoted to the construction of posinomial regression models with several monomes for each input variable. Such models generalize well-known polynomial regressions. Investigated by a posin with one variable and two monomes. The algorithm «A» of approximate estimation of posinomial regressions using the least squares method is proposed. The main disadvantage of the algorithm «A» is that due to the inter-monomic multicollinearity, the estimated posinomial regression may not be consistent with the meaningful meaning of the factors included in it. Therefore, algorithm «B» was developed, which guarantees not only the preservation of the meaningful meaning of the factors, but also the significance of all posinomial regression coefficients according to the Student's t-criterion. Algorithm «B» was implemented in the form of the POSITON-1 software package. The work of the software package is demonstrated by the example of solving a specific applied problem.",
        "link": "http://dx.doi.org/10.17150/2713-1734.2023.5(2).97-114"
    },
    {
        "id": 20152,
        "title": "The fundamental block of algorithms for constructing well-interpreted qualitative regression models",
        "authors": "Mikhail Pavlovich Bazilevskiy",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26731/2658-3704.2020.3(8).1-10"
    },
    {
        "id": 20153,
        "title": "Heart Disease Prediction Using Machine Learning Algorithms Logistic Regression, Support Vector Machine and Random Forest Classification Techniques",
        "authors": "Rohit Baxani, Mani Edinburgh",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4151423"
    },
    {
        "id": 20154,
        "title": "Crop Fertilizer Prediction using Regression analysis and Machine Learning algorithms",
        "authors": "K Monika, Balakrishnan Ramprakash, Sankayya Muthuramalingam, K Mirdula",
        "published": "2022-12-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic3i56241.2022.10072846"
    },
    {
        "id": 20155,
        "title": "Inductive and Deductive Networks",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-7"
    },
    {
        "id": 20156,
        "title": "A Critical Look at Machine Learning Algorithms in River/Stream Water Temperature Modeling&amp;#160;",
        "authors": "Claudia Corona, Terri Hogue",
        "published": "No Date",
        "citations": 0,
        "abstract": "As climate change continues to impact stream systems worldwide, water temperature is an increasingly important indicator of distribution patterns and mortality rates among fish, amphibians, and macroinvertebrates. Technological advances tracing back to the 1960s have improved our ability to measure stream water temperature (SWT) at varying spatial and temporal resolutions, for the fundamental goal of better understanding stream function and ensuring ecosystem health. Despite significant advances, there continue to be a large number of stream reaches, stream segments and entire catchments that are difficult to access for a myriad of reasons, including but not limited to physical limitations. Moreover, there are noted access issues, financial constraints, and temporal and spatial inconsistencies or failures within situ instrumentation.\nOver the last few decades and in response to these limitations, statistical methods and physically-based computer models have been steadily employed to examine SWT dynamics and controls. Most recently, the use of artificial intelligence, specifically machine learning (M.L.) algorithms, has garnered significant attention and utility in hydrologic sciences, specifically as a novel tool to learn yet-to-be-discovered patterns from complex data and attempt to fill data streams and knowledge gaps. Our review of publications focusing on stream water temperature modeling and prediction identified a similar number (~26) of publications utilizing M.L. in the previous four years (2020-2023), as were published in the previous 19 years, (2000-2019). &#160;\nThe objective of this work is three-fold: first, to provide a concise review of the utilization of M.L. algorithms in stream water temperature modeling and prediction. Second, to review M.L. performance evaluation metrics as it pertains to SWT modeling and prediction and identify the commonly-used metrics as well as suggest guidelines for easier comparison of M.L. performance across SWT studies. Finally, we examine where progress has been made in our understanding of the physical system from the use of M.L. in SWT modeling and prediction, and identify where progress is still needed to advance our understanding of spatial and temporal patterns of stream water temperature.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-7003"
    },
    {
        "id": 20157,
        "title": "Ultrasound Backscatter Signal Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael Kolios, Sridhar Krishnan",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring apoptosis and classifying clusters of apoptotic cells based on the changes in ultrasound backscatter signals from the tissues. The backscatter from normal and apoptotic cells, using a high frequency ultrasound instrument are modeled through an autoregressive (AR) modeling technique. The proper model order is calculated by tracking the error criteria in the reconstruction of the original signal. The AR model coefficients, which are assumed to contain the main statistical features of the signal, are passed as the input to linear and nonlinear machine classifiers (Fisher linear discriminant, conditional Gaussian classifier, Naive Bayes classifier and neural networks with nonlinear activation functions). In addition, an adaptive signal segmentation method (least squares lattice filter) is used to differentiate the data from layers of different cell types into stationary parts ready for modeling and classification.",
        "link": "http://dx.doi.org/10.32920/ryerson.14641290.v2"
    },
    {
        "id": 20158,
        "title": "Methods of\n            <scp>ML</scp>\n            Linear Regression",
        "authors": "",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781394209118.ch4"
    },
    {
        "id": 20159,
        "title": "Noise Immunity and Convergence",
        "authors": "Hema R. Madala, Alexy G. Ivakhnenko",
        "published": "2019-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351073493-3"
    },
    {
        "id": 20160,
        "title": "Hierarchical Spatial Features Learning for Image Classification",
        "authors": "Guoqing Zhou",
        "published": "2020-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003082439-20"
    },
    {
        "id": 20161,
        "title": "Ultrasound Backscatter Signal Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael Kolios, Sridhar Krishnan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Ultrasound Backscatter Signal Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "link": "http://dx.doi.org/10.32920/ryerson.14641290.v1"
    },
    {
        "id": 20162,
        "title": "Exact Passive-Aggressive Algorithms for Ordinal Regression Using Interval Labels",
        "authors": "Naresh Manwani, Mohit Chandra",
        "published": "2020-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tnnls.2019.2939861"
    },
    {
        "id": 20163,
        "title": "Machine Learning Algorithms for Semiconductor Device Modeling",
        "authors": "Yogendra Gupta, Niketa Sharma, Ashish Sharma, Harish Sharma",
        "published": "2021-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003201038-9"
    },
    {
        "id": 20164,
        "title": "PREDICTIVE MAINTENANCE OF SINGLE PHASE AC MOTOR USING IOT SENSOR DATA AND MACHINE LEARNING (SIMPLE LINEAR REGRESSION AND MULTIPLE LINEAR REGRESSION ALGORITHMS)",
        "authors": "Jakra A. Husain, Ashish Manusmare",
        "published": "2019-8-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33564/ijeast.2019.v04i04.022"
    },
    {
        "id": 20165,
        "title": "Multiobjective optimization of support vector regression parameters by teaching-learning-based optimization for modeling of electric discharge machining responses",
        "authors": "Ushasta Aich, Simul Banerjee",
        "published": "2017-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b21863-7"
    },
    {
        "id": 20166,
        "title": "Ultrasound Backscatter Signal Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael Kolios, Sridhar Krishnan",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring apoptosis and classifying clusters of apoptotic cells based on the changes in ultrasound backscatter signals from the tissues. The backscatter from normal and apoptotic cells, using a high frequency ultrasound instrument are modeled through an autoregressive (AR) modeling technique. The proper model order is calculated by tracking the error criteria in the reconstruction of the original signal. The AR model coefficients, which are assumed to contain the main statistical features of the signal, are passed as the input to linear and nonlinear machine classifiers (Fisher linear discriminant, conditional Gaussian classifier, Naive Bayes classifier and neural networks with nonlinear activation functions). In addition, an adaptive signal segmentation method (least squares lattice filter) is used to differentiate the data from layers of different cell types into stationary parts ready for modeling and classification.",
        "link": "http://dx.doi.org/10.32920/ryerson.14641290"
    },
    {
        "id": 20167,
        "title": "Advancing Multinomial Regression and Topic Modeling with Beta-Liouville Distributions",
        "authors": "Pantea Koochemeshkian, Nizar Bouguila",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00292"
    },
    {
        "id": 20168,
        "title": "Mapping wind erosion hazard with regression-based machine learning algorithms",
        "authors": "Hamid Gholami, Aliakbar Mohammadifar, Dieu Tien Bui, Adrian L. Collins",
        "published": "2020-11-24",
        "citations": 35,
        "abstract": "AbstractLand susceptibility to wind erosion hazard in Isfahan province, Iran, was mapped by testing 16 advanced regression-based machine learning methods: Robust linear regression (RLR), Cforest, Non-convex penalized quantile regression (NCPQR), Neural network with feature extraction (NNFE), Monotone multi-layer perception neural network (MMLPNN), Ridge regression (RR), Boosting generalized linear model (BGLM), Negative binomial generalized linear model (NBGLM), Boosting generalized additive model (BGAM), Spline generalized additive model (SGAM), Spike and slab regression (SSR), Stochastic gradient boosting (SGB), support vector machine (SVM), Relevance vector machine (RVM) and the Cubist and Adaptive network-based fuzzy inference system (ANFIS). Thirteen factors controlling wind erosion were mapped, and multicollinearity among these factors was quantified using the tolerance coefficient (TC) and variance inflation factor (VIF). Model performance was assessed by RMSE, MAE, MBE, and a Taylor diagram using both training and validation datasets. The result showed that five models (MMLPNN, SGAM, Cforest, BGAM and SGB) are capable of delivering a high prediction accuracy for land susceptibility to wind erosion hazard. DEM, precipitation, and vegetation (NDVI) are the most critical factors controlling wind erosion in the study area. Overall, regression-based machine learning models are efficient techniques for mapping land susceptibility to wind erosion hazards.",
        "link": "http://dx.doi.org/10.1038/s41598-020-77567-0"
    },
    {
        "id": 20169,
        "title": "A comparative study on machine learning regression algorithms aplied to modeling gas centrifuge / Um estudo comparativo sobre algoritmos de regressão de aprendizagem de máquinas aplicado à modelagem de centrífugas a gás",
        "authors": "Delvonei Alves de Andrade, Roberto Navarro de Mesquita, Natan Patussi Nascimento",
        "published": "2022-7-21",
        "citations": 0,
        "abstract": "The gas Centrifuge is a very hard equipment to model, because it involves a gas dynamic with many complications, such as hypersonic waves and rarefied regions combined with continuous flow areas. Therefore, data analysis regressions remain currently a very important technique to understand and describe the problem in a practical way. This paper intends to apply and compare several regression techniques using machine learning, to obtain a hydraulic and a separative power model of gas centrifuge used in enrichment plants. For this purpose, a set of normalized data composed of 134 experimental lines was used, observing the variables of interest, the separation power (dU), and the waste pressure (Pw), through the following explanatory variables: feed flow (F), cut (q), and product pressure (Pp). The comparisons were presented between the results obtained for the models generated by the following: algorithms, multivariate regression, multivariate adaptive regression splines – MARS, bootstrap aggregating multivariate adaptive regression splines – Bagging MARS, artificial neural network – ANN, extreme gradient boosting – XGBoost, support vector regression– Poly SVR, radial basis Function support vector regression – RBF SVR, K-nearest neighbors – KNN and Stacked Ensemble. That way, to avoid overfitting and provide insights about generalization of the models in unseen data, during the training phase, the k-fold cross validation approach was used.  Subsequently, the residuals were analyzed, and the models were compared by the following metrics: Root mean square error – RMSE; Mean squared error – MSE; Mean absolute error – MAE; and Coefficient of determination – R2.",
        "link": "http://dx.doi.org/10.34117/bjdv8n7-265"
    },
    {
        "id": 20170,
        "title": "Energy Demand Curve Modeling with Machine Learning Algorithms",
        "authors": "Andrei Ioanes, Radu Tirnovan",
        "published": "2019-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mps.2019.8759660"
    }
]