[
    {
        "id": 24705,
        "title": "Text-Text Neural Machine Translation: A Survey",
        "authors": " Ebisa Gemechu, G. R. Kanagachidambaresan",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020042"
    },
    {
        "id": 24706,
        "title": "Generating Stellar Spectra Using Neural Networks",
        "authors": "Marwan Gebran",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "A new generative technique is presented in this paper that uses Deep Learning to reconstruct stellar spectra based on a set of stellar parameters. Two different Neural Networks were trained allowing the generation of new spectra. First, an autoencoder is trained on a set of BAFGK synthetic data calculated using ATLAS9 model atmospheres and SYNSPEC radiative transfer code. These spectra are calculated in the wavelength range of Gaia RVS between 8400 and 8800 Å. Second, we trained a Fully Dense Neural Network to relate the stellar parameters to the Latent Space of the autoencoder. Finally, we linked the Fully Dense Neural Network to the decoder part of the autoencoder and we built a model that uses as input any combination of Teff, logg, vesini, [M/H], and ξt and output a normalized spectrum. The generated spectra are shown to represent all the line profiles and flux values as the ones calculated using the classical radiative transfer code. The accuracy of our technique is tested using a stellar parameter determination procedure and the results show that the generated spectra have the same characteristics as the synthetic ones.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/astronomy3010001"
    },
    {
        "id": 24707,
        "title": "Generating post-hoc explanations for Skip-gram-based node embeddings by identifying important nodes with bridgeness",
        "authors": "Hogun Park, Jennifer Neville",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.04.029"
    },
    {
        "id": 24708,
        "title": "Lifelong Text-Audio Sentiment Analysis learning",
        "authors": "Yuting Lin, Peng Ji, Xiuyi Chen, Zhongshi He",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.02.008"
    },
    {
        "id": 24709,
        "title": "Generating Synthetic Text using Generative Adversarial Networks",
        "authors": "Nisha Sahal, Ramkumar Krishnamoorthy, Navjot Singh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470722"
    },
    {
        "id": 24710,
        "title": "Manually Crafted Chinese Text Corpus for Text Emotion Recognition",
        "authors": "Bo Gao, Fan Zhang",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191747"
    },
    {
        "id": 24711,
        "title": "Speech to Text Recognition for Videogame Controlling with Convolutional Neural Networks",
        "authors": "Joaquin Aguirre-Peralta, Marek Rivas-Zavala, Willy Ugarte",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011782900003411"
    },
    {
        "id": 24712,
        "title": "Genetic data visualization using literature text-based neural networks: Examples associated with myocardial infarction",
        "authors": "Jihye Moon, Hugo F. Posada-Quintero, Ki H. Chon",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.015"
    },
    {
        "id": 24713,
        "title": "LCM-Captioner: A lightweight text-based image captioning method with collaborative mechanism between vision and text",
        "authors": "Qi Wang, Hongyu Deng, Xue Wu, Zhenguo Yang, Yun Liu, Yazhou Wang, Gefei Hao",
        "published": "2023-5",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.03.010"
    },
    {
        "id": 24714,
        "title": "A Method for Creating Structural Models of Text Documents Using Neural Networks",
        "authors": "",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14529/cmse230102"
    },
    {
        "id": 24715,
        "title": "The Application of Generating API Call Sequence Code for Android Driven by Neural Network",
        "authors": "Jingbo Yang, Wenjun Wu, Jian Ren",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191527"
    },
    {
        "id": 24716,
        "title": "Retracted: Transfer Learning Auto-Encoder Neural Networks for Anomaly Detection of DDoS Generating IoT Devices",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9840813"
    },
    {
        "id": 24717,
        "title": "Generating Low-Earth Orbit Satellite Attitude Maneuver Profiles Using Deep Neural Networks",
        "authors": "Seok-Teak Yun",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "To perform Earth observations, low-Earth orbit (LEO) satellites require attitude maneuvers, which can be classified into two types: maintenance of a target-pointing attitude and maneuvering between target-pointing attitudes. The former depends on the observation target, while the latter has nonlinear characteristics and must consider various conditions. Therefore, generating an optimal reference attitude profile is difficult. Mission performance and satellite antenna position-to-ground communication are also determined by the maneuver profile between the target-pointing attitudes. Generating a reference maneuver profile with small errors before target pointing can enhance the quality of the observation images and increase the maximum possible number of missions and accuracy of ground contact. Therefore, herein we proposed a technique for optimizing the maneuver profile between target-pointing attitudes based on data-based learning. We used a deep neural network based on bidirectional long short-term memory to model the quaternion profiles of LEO satellites. This model was used to predict the maneuvers between target-pointing attitudes. After predicting the attitude profile, it was differentiated to obtain the time and angular acceleration profiles. The optimal maneuver reference profile was obtained by Bayesian-based optimization. To verify the performance of the proposed technique, the results of maneuvers in the 2–68° range were analyzed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23104650"
    },
    {
        "id": 24718,
        "title": "On Building a Semi-Automated Framework for Generating Causal Bayesian Networks from Raw Text",
        "authors": "Solat J. Sheikh",
        "published": "2023-8",
        "citations": 0,
        "abstract": "The availability of a large amount of unstructured text has generated interest in utilizing it for future decision-making and developing strategies in various critical domains. Despite some progress, automatically generating accurate reasoning models from the raw text is still an active area of research. Furthermore, most proposed approaches focus on a specific do-main. As such, their suggested transformation methods are usually unreliable when applied to other domains. This research aims to develop a framework, SCANER (Semi-automated CAusal Network Extraction from Raw text), to convert raw text into Causal Bayesian Networks (CBNs). The framework will then be employed in various domains to demonstrate its utilization as a decision-support tool. The preliminary experiments have focused on three domains: political narratives, food insecurity, and medical sciences. The future focus is on developing BNs from political narratives and modifying them through various methods to reduce the level of aggressiveness or extremity in the narratives without causing conflict among the masses or countries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/822"
    },
    {
        "id": 24719,
        "title": "The development of text-to-image graphical neural networks",
        "authors": "N.A. Bondareva",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54837/9785604289174_cpt2023-p130"
    },
    {
        "id": 24720,
        "title": "Generating Image Captions Using Deep Neural Networks",
        "authors": "Mehmet Ali Can Ertuǧrul, Sevinç İlhan Omurca",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ubmk59864.2023.10286622"
    },
    {
        "id": 24721,
        "title": "Dual-Mode Method for Generating Adversarial Examples to Attack Deep Neural Networks",
        "authors": "Hyun Kwon, SungHwan Kim",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3245632"
    },
    {
        "id": 24722,
        "title": "SuperFormer: Continual learning superposition method for text classification",
        "authors": "Marko Zeman, Jana Faganeli Pucer, Igor Kononenko, Zoran Bosnić",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.040"
    },
    {
        "id": 24723,
        "title": "Towards Robustness of Few-Shot Text Classifiers",
        "authors": "Rohit Raj, V. Susheela Devi",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191201"
    },
    {
        "id": 24724,
        "title": "Image Captioning System Using Merge Conventional and Recurrent Neural Networks",
        "authors": "Rasha Talib Gdeeb",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Image captioning system is that operation where we create a group of captions defines the image content and depends specially on deep learning. This technology is used for a wide range in recent time because it can help as example the blind people by telling them about all the objects around them which Nvidia company has the lead of it. Many searches were done in this subject and may be the most important one that search done by Andrej Karpathy leader of artificial intelligent in Tesla company depending on Flicker database which gives a special result used by next researches. ICS (Image Captioning Systems) are end-to-end Sequence-to-Sequence systems where we can convert a series of image pixels descriptions into a series of words. For images objects recognition we can use conventional neural networks (CNN) and for the words recognition and text build we will use recurrent neural network",
        "keywords": "",
        "link": "http://dx.doi.org/10.47832/minarcongress9-17"
    },
    {
        "id": 24725,
        "title": "BIT: Improving Image-text Sentiment Analysis via Learning Bidirectional Image-text Interaction",
        "authors": "Xingwang Xiao, Yuanyuan Pu, Zhengpeng Zhao, Jinjing Gu, Dan Xu",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191445"
    },
    {
        "id": 24726,
        "title": "An Unseen Features Enhanced Text Classification Approach",
        "authors": "Nesar Ahmad Wasi, Muhammad Abulaish",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191857"
    },
    {
        "id": 24727,
        "title": "Connecting the Dots: What Graph-Based Text Representations Work Best for Text Classification using Graph Neural Networks?",
        "authors": "Margarita Bugueño, Gerard de Melo",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.600"
    },
    {
        "id": 24728,
        "title": "PromptMix: Text-to-image diffusion models enhance the performance of lightweight networks",
        "authors": "Arian Bakhtiarnia, Qi Zhang, Alexandros Iosifidis",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191962"
    },
    {
        "id": 24729,
        "title": "Spectrum Occupancy Prediction Algorithm Using Artificial Neural Networks",
        "authors": "D. S. Chirov, E. O. Kandaurova",
        "published": "2023-3-14",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf56737.2023.10092167"
    },
    {
        "id": 24730,
        "title": "Short Text Sentiment Classification Using Bayesian and Deep Neural Networks",
        "authors": "Zhan Shi, Chongjun Fan",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "The previous multi-layer learning network is easy to fall into local extreme points in supervised learning. If the training samples sufficiently cover future samples, the learned multi-layer weights can be well used to predict new test samples. This paper mainly studies the research and analysis of machine short text sentiment classification based on Bayesian network and deep neural network algorithm. It first introduces Bayesian network and deep neural network algorithms, and analyzes the comments of various social software such as Twitter, Weibo, and other popular emotional communication platforms. Using modeling technology popular reviews are designed to conduct classification research on unigrams, bigrams, parts of speech, dependency labels, and triplet dependencies. The results show that the range of its classification accuracy is the smallest as 0.8116 and the largest as 0.87. These values are obtained when the input nodes of the triple dependency feature are 12,000, and the reconstruction error range of the Boltzmann machine is limited between 7.3175 and 26.5429, and the average classification accuracy is 0.8301. The advantages of triplet dependency features for text representation in text sentiment classification tasks are illustrated. It shows that Bayesian and deep neural network show good advantages in short text emotion classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12071589"
    },
    {
        "id": 24731,
        "title": "Multi-dimensional Semantic-based Text Classification Model",
        "authors": "Xiaoyan Gongye, Chongxu Hu, Xiaohu Zhang, Shuang Liu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191647"
    },
    {
        "id": 24732,
        "title": "CoLRP: A Contrastive Learning Abstractive Text Summarization Method with ROUGE Penalty",
        "authors": "Caidong Tan, Xiao Sun",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191344"
    },
    {
        "id": 24733,
        "title": "LLaMA-LoRA Neural Prompt Engineering: A Deep Tuning Framework for Automatically Generating Chinese Text Logical Reasoning Thinking Chains",
        "authors": "Songlin Chen, Weicheng Wang, Xiaoliang Chen, Peng Lu, Zaiyan Yang, Yajun Du",
        "published": "2024-4-11",
        "citations": 0,
        "abstract": "Abstract\nThe exption of Chinese natural language processing (NLP) has stimulated research in the broader NLP domain. However, existing large language models have limitations in comprehending and reasoning in Chinese. This paper addresses these limitations by enhancing Chinese language models comprehension and reasoning capabilities while minimizing resource requirements. We propose LLaMA-LoRA, a neural prompt engineering framework that builds upon the LLaMA-13B model and incorporates the Low-Rank Adaptation(LoRA) of Large Language Models technique for refinement. Chain-of-Thought(CoT) are crucial for generating intermediate reasoning chains in language models, but their effectiveness can be limited by isolated language patterns. Erroneous reasoning resulting from conventional prompts negatively impacts model performance. Automatic prompts are introduced to encourage reasoning chain generation and accurate answer inference. Training the model with an extensive corpus of Chinese CoT data enhances its comprehension and reasoning abilities. The LLaMA-LoRA model demonstrates exceptional performance across numerous Chinese language tasks, surpassing benchmark performance achieved by related language models such as GPT-3.5, Chat-GLM, and OpenAssistant, delivering accurate, comprehensive, and professional answers. The availability of our open-source model code facilitates further research in the field of Chinese text logical reasoning thinking chains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/dint_a_00251"
    },
    {
        "id": 24734,
        "title": "Generating more Realistic Packet Loss Patterns for Wireless links using Neural Networks",
        "authors": "Daniel Otten, Thomas Hänel, Tim Römer, Nils Aschenbruck",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Simulations of wireless network connections are essential forthe development of new technologies because they are farmore scalable than real-world experiments and reproducible.Modeling packet loss realistically provides a highly abstractyet powerful tool for the simulation of wirelesses links. Typi-cally, simple statistical models or replaying of recorded tracesare used for the simulation. For a proper parametrization ofsimple statistical models, recorded traces are required, too.Both approaches have drawbacks: replaying traces is limitedto the length of the traces, a repetition may lead to unwantedeffects in the simulation. The statistical models solve this, butthe resulting packet loss patterns significantly differ from realones. In this paper, we propose using a neural network in-stead. It takes the same kind of input, i.e., a real-world trace,but it can generate longer traces with more realistic loss pat-terns. We share pre-trained neural networks for multiple linksin office and industry scenarios with the community for usein future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32473/flairs.36.133099"
    },
    {
        "id": 24735,
        "title": "Word self-update contrastive adversarial networks for text-to-image synthesis",
        "authors": "Jian Xiao, Yiwen Sun, Xiaojun Bi",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.038"
    },
    {
        "id": 24736,
        "title": "Research on text classification based on neural networks",
        "authors": "Mingshi Zheng",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "With the rapid development of information technology, the processing of massive text data has become increasingly important. As a common computer information processing task, text classification has attracted a wide range of research interests. This paper aims to explore the text classification method based on neural network and analyze the key technologies. In order to solve the problem of text time series data classification, this paper uses the text time series data of occupancy detection and applies these neural network models in deep learning, including recurrent neural network, long short-term memory and gated recurrent unit, and trains the neural network through supervised learning. Inputting the room attribute data to these trained neural network models and judging the occupancy of the room. At the same time, observing the experimental results of these neural network models, including training loss, test loss and accuracy, to further study the performance of neural network in processing text time series data classification. This papers experiment aims to evaluate the performance of neural network in text classification and makes a detailed analysis through the experimental results. The goal of the research is to find an effective solution based on neural networks for the classification of text sequence data. Through the analysis of the experimental results, it can be concluded that the method based on neural network is feasible and effective in text sequence data classification. These analysis results will help to further promote the development of text classification technology and provide guidance and reference for practical application. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/41/20230768"
    },
    {
        "id": 24737,
        "title": "Improved Recurrent Neural Networks for Text Classification and Dynamic Sylvester Equation Solving",
        "authors": "Weijie Chen, Jie Jin, Dimitrios Gerontitis, Lixin Qiu, Jingcan Zhu",
        "published": "2023-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11063-023-11176-6"
    },
    {
        "id": 24738,
        "title": "Generating Questions via Unexploited OCR Texts: Prompt-Based Data Augmentation for TextVQA",
        "authors": "Mingjie Han, Ting Jin, Wancong Lin, Can Li, Liang Qiao",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191606"
    },
    {
        "id": 24739,
        "title": "A Survey on Generating Audio with Captions for a Live Video using Neural Networks",
        "authors": "Archana Uriti, Durga Prasad Kakarla, Deepika Jinugu, Kanaka Nihitha Silla, K.T. V.N.S. Sai Krishna, Chunduru Anilkumar",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370514"
    },
    {
        "id": 24740,
        "title": "KETM:A Knowledge-Enhanced Text Matching method",
        "authors": "Kexin Jiang, Yahui Zhao, Guozhe Jin, Zhenguo Zhang, Rongyi Cui",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191337"
    },
    {
        "id": 24741,
        "title": "CR-CAM: Generating explanations for deep neural networks by contrasting and ranking features",
        "authors": "Yanshan Li, Huajie Liang, Hongfang Zheng, Rui Yu",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2024.110251"
    },
    {
        "id": 24742,
        "title": "Generating Semantic Adversarial Examples via Feature Manipulation in Latent Space",
        "authors": "Shuo Wang, Shangyu Chen, Tianle Chen, Surya Nepal, Carsten Rudolph, Marthie Grobler",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3299408"
    },
    {
        "id": 24743,
        "title": "Generating post-hoc explanation from deep neural networks for multi-modal medical image analysis tasks",
        "authors": "Weina Jin, Xiaoxiao Li, Mostafa Fatehi, Ghassan Hamarneh",
        "published": "2023",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mex.2023.102009"
    },
    {
        "id": 24744,
        "title": "TacoSi: A Sinhala Text to Speech System with Neural Networks",
        "authors": "Tharuka Kasthuri Arachchige, Ruvan Weerasinghe",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarc57651.2023.10145749"
    },
    {
        "id": 24745,
        "title": "Text Feature Adversarial Learning for Text Generation With Knowledge Transfer From GPT2",
        "authors": "Hao Zhang, Yulai Cong, Zhengjue Wang, Lei Zhang, Miaoyun Zhao, Liqun Chen, Shijing Si, Ricardo Henao, Lawrence Carin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3210975"
    },
    {
        "id": 24746,
        "title": "Long Text Multi-label Classification",
        "authors": "Miao Zang, Siyi Niu, Yang Gao, Xi Chen",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105696"
    },
    {
        "id": 24747,
        "title": "LisaCLIP: Locally Incremental Semantics Adaptation towards Zero-shot Text-driven Image Synthesis",
        "authors": "An Cao, Yilin Zhou, Gang Shen",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191516"
    },
    {
        "id": 24748,
        "title": "Over comparative study of text summarization techniques based on graph neural networks",
        "authors": "Samina Mulla, Nuzhat F. Shaikh",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "Due to the enormous content of text available online through emails, social media, and news articles, it has become complicated to summarize the textual information from multiple documents. Text summarization automatically creates a comprehensive description of the document that retains its informative contents through the keywords, where Multi-Document Summarization (MDS) is a productive tool for data accumulation that creates a concise and informative summary from the documents. In order to extract the relevant information from the documents, Graph neural networks (GNNs) is the neural structure that detains the interrelation of the graph by progressing the messages between the graphical nodes. In the current years, the advanced version of GNNs, such as graph attention network (GAN), graph recurrent network, and graph convolutional network (GCN) provides a remarkable performance in text summarization with the advantage of deep learning techniques. Hence, in this survey, graph approaches for text summarization has been analyzed and discussed, where the recent text summarization model based on Deep learning techniques are highlighted. Further, the article provides the taxonomy to abstract the design pattern of Neural Networks and conducts a comprehensive of the existing text summarization model. Finally, the review article enlists the future direction of the researcher, which would motivate the enthusiastic and novel contributions in text summarizations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/web-230014"
    },
    {
        "id": 24749,
        "title": "A Novel Clinical Trial Prediction-Based Factual Inconsistency Detection Approach for Medical Text Summarization",
        "authors": "Shuaimin Li, Jungang Xu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191247"
    },
    {
        "id": 24750,
        "title": "Research on the application of graph neural networks in text classification",
        "authors": "Chuangyu Xu",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "With the rapid development of the Internet and social media, a large amount of text data is constantly generated, and text classification has become an important task. Text classification is an important branch in the field of natural language processing and has attracted the attention of many researchers in recent years. Due to the ease of editing text data, most texts in the network are manually constructed and uploaded by users. Therefore, the standardization of online texts and the classification of texts with different granularity are of great significance in the field of information retrieval. This article introduces the basic concepts of text classification and three text classification methods: knowledge engineering (rule) based text classification methods, traditional machine learning-based text classification methods, and deep neural network-based text classification methods. This article also analyzes the advantages and disadvantages of the three methods. Subsequently, the basic concepts and common models of graph neural networks were explored. An application case of graph neural networks in text classification is provided. This article provides effective suggestions for text classification applications in the field of natural language processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/52/20241560"
    },
    {
        "id": 24751,
        "title": "Image text deblurring by convolutional neural networks",
        "authors": "Ali Shakir Alahmed, Serkan Ozbay",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0103150"
    },
    {
        "id": 24752,
        "title": "A New Method for Extractive Text Summarization Using Neural Networks",
        "authors": "Sohini Roy Chowdhury, Kamal Sarkar",
        "published": "2023-5-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01806-0"
    },
    {
        "id": 24753,
        "title": "Grounding spatial relations in text-only language models",
        "authors": "Gorka Azkune, Ander Salaberria, Eneko Agirre",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.031"
    },
    {
        "id": 24754,
        "title": "BoW-based neural networks vs. cutting-edge models for single-label text classification",
        "authors": "Hassan I. Abdalla, Ali A. Amer, Sri Devi Ravana",
        "published": "2023-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08754-z"
    },
    {
        "id": 24755,
        "title": "Fusion of Prior Knowledge and Gated Neural Networks for Short Text Recognition",
        "authors": "Hao Wen, Yang Yang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icctit60726.2023.10435758"
    },
    {
        "id": 24756,
        "title": "Convolutional Neural Networks Based Turkish Text Classification",
        "authors": "Güler ALPARSLAN, Mahir DURSUN",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Bu çalışmada makine öğrenmesi teknikleri ve konvolüsyonel sinir ağları (KSA) tabanlı bir derin öğrenme modeli kullanılarak iki farklı Türkçe metin veri kümesi sınıflandırılmıştır. Metin sınıflandırma çalışmasında Rastgele Orman (RO), Naive Bayes (NB), Destek Vektör Makineleri (DVM), K-En Yakın Komşu (KNN) Algoritmaları ve geliştirilen KSA tabanlı derin öğrenme modeli seçilen veri kümelerine uygulanmıştır. Türkçe dilinde seçilen veri kümeleri, metin ve sınıf adedi olarak birbirinden farklı yapıda tercih edilmiş böylece kelime vektör boyutunun aynı deney ortamında sınıflandırma başarısına etkisi araştırılmıştır. Kelime temsil yöntemi olarak Terim Frekansı-Ters Doküman Frekansı (TF-IDF) belirlenmiş olup, sınıflandırma işlemi öncesi veri kümelerine uygulanan durdurma kelimeleri filtreleme ve kök bulma önişlemlerinin de sınıflandırma sonuçlarına katkısı değerlendirilmiştir. Ayrıca kelime temsil vektörlerine öznitelik seçimi uygulanarak boyutları düşürülmüş, böylece nihai vektör boyutunun da sonuçlara etkisi araştırılmıştır. Bahsedilen tüm ön işlemlerin farklı birleşimleri uygulanarak ortaya çıkan kelime vektörlerinin sınıflandırması sonucunda doğruluk ve F1-skor değerleri karşılaştırılmıştır. Karşılaştırmalar her bir sınıflandırma algoritması özelinde ayrı tablolar halinde sunulmuştur. Ayrıca tüm algoritmaların birbiri ile karşılaştırmasını içeren tablolar oluşturularak sonuçlar analiz edilmiştir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17671/gazibtd.1165291"
    },
    {
        "id": 24757,
        "title": "Exploring the Effectiveness of Combined Cosine Similarity and Convolutional Neural Networks for Text Similarity Analysis",
        "authors": "Johan Anish Philip, Jyoti Srivastava",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4624815"
    },
    {
        "id": 24758,
        "title": "Incorporating Text Embeddings in Deep Neural Networks for Click-Through Rate Prediction",
        "authors": "Ali Buğra Kanburoğlu, Funda Ay Ak",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296803"
    },
    {
        "id": 24759,
        "title": "VDCL: A supervised text classification method based on virtual adversarial and contrast learning",
        "authors": "Ximeng Dou, Jing Zhao, Ming Li",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191345"
    },
    {
        "id": 24760,
        "title": "Hierarchical Multi-label Text Classification Method Based On Multi-level Decoupling",
        "authors": "Qingwu Fan, Changsheng Qiu",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105736"
    },
    {
        "id": 24761,
        "title": "Preprocessing of recto-verso printed documents based on neural networks for text analysis",
        "authors": "Pasquale Savino, Anna Tonazzini",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cist56084.2023.10409970"
    },
    {
        "id": 24762,
        "title": "A Character-level Short Text Classification Model Based On Spiking Neural Networks",
        "authors": "Chengzhi Jiang, Linjing Li, Daniel Dajun Zeng, Xiaoxuan Wang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191963"
    },
    {
        "id": 24763,
        "title": "Generating A-Star Algorithm Admissible Heuristics Using a Dynamic Dataloader on Neural Networks, Enhanced With Genetic Algorithms, on a Distributed Architecture",
        "authors": "Ouardi Amine, Mestari Mohammed",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3247773"
    },
    {
        "id": 24764,
        "title": "Improving text detection by generating images with curved text instances",
        "authors": "Leon Landeka, Ratko Grbić, Matteo Brisinello, Marijan Herceg",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/zinc58345.2023.10174175"
    },
    {
        "id": 24765,
        "title": "A Multi-scale Domain Adaptive Framework for Scene Text Detection",
        "authors": "Bi Wang, Yu Gu, Yu Lu",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105723"
    },
    {
        "id": 24766,
        "title": "Text-based neural networks for question intent recognition",
        "authors": "Alvaro Trewhela, Alejandro Figueroa",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.105933"
    },
    {
        "id": 24767,
        "title": "Generating Representative Phrase Sets for Text Entry Experiments by GA-Based Text Corpora Sampling",
        "authors": "Sandi Ljubic, Alen Salkanovic",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "In the field of human–computer interaction (HCI), text entry methods can be evaluated through controlled user experiments or predictive modeling techniques. While the modeling approach requires a language model, the empirical approach necessitates representative text phrases for the experimental stimuli. In this context, finding a phrase set with the best language representativeness belongs to the class of optimization problems in which a solution is sought in a large search space. We propose a genetic algorithm (GA)-based method for extracting a target phrase set from the available text corpus, optimizing its language representativeness. Kullback–Leibler divergence is utilized to evaluate candidates, considering the digram probability distributions of both the source corpus and the target sample. The proposed method is highly customizable, outperforms typical random sampling, and exhibits language independence. The representative phrase sets generated by the proposed solution facilitate a more valid comparison of the results from different text entry studies. The open source implementation enables the easy customization of the GA-based sampling method, promotes its immediate utilization, and facilitates the reproducibility of this study. In addition, we provide heuristic guidelines for preparing the text entry experiments, which consider the experiment’s intended design and the phrase set to be generated with the proposed solution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11112550"
    },
    {
        "id": 24768,
        "title": "Neural Networks Referees in 2023",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00713-x"
    },
    {
        "id": 24769,
        "title": "Extracting Unique Keywords Related to Customer Engagement from Review Text Using Uncorrelated Weights Estimation in Neural Networks",
        "authors": "Toshikuni Sato, Takumi Kato",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4752197"
    },
    {
        "id": 24770,
        "title": "Text sentiment analysis model based on RoBERTa-BiLSTM-Attention",
        "authors": "Jingjing Sun, Gongwu Chen",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004930"
    },
    {
        "id": 24771,
        "title": "Mental Health Prediction through Text Chat Conversations",
        "authors": "Muhammad Nouman, Hollian Sara, Sui Yang Khoo, MA Parvez Mahmud, Abbas Z. Kouzani",
        "published": "2023-6-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191849"
    },
    {
        "id": 24772,
        "title": "Revisiting Citation Prediction with Cluster-Aware Text-Enhanced Heterogeneous Graph Neural Networks",
        "authors": "Carl Yang, Jiawei Han",
        "published": "2023-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00058"
    },
    {
        "id": 24773,
        "title": "TeKo: Text-Rich Graph Neural Networks With External Knowledge",
        "authors": "Zhizhi Yu, Di Jin, Jianguo Wei, Yawen Li, Ziyang Liu, Yue Shang, Jiawei Han, Lingfei Wu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3281354"
    },
    {
        "id": 24774,
        "title": "Neural Networks Referees in 2022",
        "authors": "",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00489-0"
    },
    {
        "id": 24775,
        "title": "Customized mask region based convolutional neural networks for un-uniformed shape text detection and text recognition",
        "authors": "Ravikumar Hodikehosahally Channegowda, Palani Karthik, Raghavendra Srinivasaiah, Mahadev Shivaraj",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "<p><span lang=\"EN-US\">In image scene, text contains high-level of important information that helps to analyze and consider the particular environment. In this paper, we adapt image mask and original identification of the mask region based convolutional neural networks (R-CNN) to allow recognition at 3 levels such as sequence, holistic and pixel-level semantics. Particularly, pixel and holistic level semantics can be utilized to recognize the texts and define the text shapes, respectively. Precisely, in mask and detection, we segment and recognize both character and word instances. Furthermore, we implement text detection through the outcome of instance segmentation on 2-D feature-space. Also, to tackle and identify the text issues of smaller and blurry texts, we consider text recognition by attention-based of optical character recognition (OCR) model with the mask R-CNN at sequential level. The OCR module is used to estimate character sequence through feature maps of the word instances in sequence to sequence. Finally, we proposed a fine-grained learning technique that trains a more accurate and robust model by learning models from the annotated datasets at the word level. Our proposed approach is evaluated on popular benchmark dataset ICDAR 2013 and ICDAR 2015.</span></p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i1.pp413-424"
    },
    {
        "id": 24776,
        "title": "DeepHC: Efficient Generating Tests with High Coverage for Deep Neural Networks",
        "authors": "Junyuan Teng, Tingting Yu, Rui Chen, Dongdong Gao, Chunpeng Jia",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qrs-c60940.2023.00030"
    },
    {
        "id": 24777,
        "title": "An Approach to Generating the Training Sample for Bottom Objects Recognition Neural Networks",
        "authors": "Valentina S. Bykova, Andrey I. Mashoshin, Alexey A. Pavlov",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icos60708.2023.10425358"
    },
    {
        "id": 24778,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00714-1"
    },
    {
        "id": 24779,
        "title": "An Attention-Based Convolutional Recurrent Neural Networks for Scene Text Recognition",
        "authors": "Adil Abdullah Abdulhussein Alshawi, Jafar Tanha, Mohammad Ali Balafar",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3352748"
    },
    {
        "id": 24780,
        "title": "Breaking Barriers: Real-Time Sign Language to Text Conversion Using Neural Networks",
        "authors": " Saksham Garg",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "Sign languages bring life­ to deaf and hearing-impaired communitie­s around the world. But not many understand these­ vibrant languages, causing big communication issues. This paper looks at how ne­ural networks could convert sign language to text in real-time. We explore the difficulties in re­cognizing sign languages, current models using Convolutional Ne­ural Networks (CNNs) and Recurrent Ne­ural Networks (RNNs), and how transfer learning might boost accuracy. We­ also discuss where this technology could go ne­xt and how it could impact society.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-16930"
    },
    {
        "id": 24781,
        "title": "A Typo Correction System Using Artificial Neural Networks for a Text-based Ornamental Fish Search Engine",
        "authors": "",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3837/tiis.2023.08.018"
    },
    {
        "id": 24782,
        "title": "Text3D: 3D Convolutional Neural Networks for Text Classification",
        "authors": "Jinrui Wang, Jie Li, Yirui Zhang",
        "published": "2023-7-16",
        "citations": 2,
        "abstract": "Convolutional Neural Networks (CNNs) have demonstrated promising performance in many NLP tasks owing to their excellent local feature-extraction capability. Many previous works have made word-level 2D CNNs deeper to capture global representations of text. Three-dimensional CNNs perform excellently in CV tasks through spatiotemporal feature learning, though they are little utilized in text classification task. This paper proposes a simple, yet effective, approach for hierarchy feature learning using 3D CNN in text classification tasks, named Text3D. Text3D efficiently extracts rich information through text representations structured in three dimensions produced by pretrained language model BERT. Specifically, our Text3D utilizes word order, word embedding and hierarchy information of BERT encoder layers as features of three dimensions. The proposed model with 12 layers outperforms the baselines on four benchmark datasets for sentiment classification and topic categorization. Text3D with a different hierarchy of output from BERT layers demonstrates that the linguistic features from different layers have varied effects on text classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12143087"
    },
    {
        "id": 24783,
        "title": "Text classification in memristor-based spiking neural networks",
        "authors": "Jinqi Huang, Alexantrou Serb, Spyros Stathopoulos, Themis Prodromakis",
        "published": "2023-3-1",
        "citations": 7,
        "abstract": "Abstract\nMemristors, emerging non-volatile memory devices, have shown promising potential in neuromorphic hardware designs, especially in spiking neural network (SNN) hardware implementation. Memristor-based SNNs have been successfully applied in a wide range of applications, including image classification and pattern recognition. However, implementing memristor-based SNNs in text classification is still under exploration. One of the main reasons is that training memristor-based SNNs for text classification is costly due to the lack of efficient learning rules and memristor non-idealities. To address these issues and accelerate the research of exploring memristor-based SNNs in text classification applications, we develop a simulation framework with a virtual memristor array using an empirical memristor model. We use this framework to demonstrate a sentiment analysis task in the IMDB movie reviews dataset. We take two approaches to obtain trained SNNs with memristor models: (1) by converting a pre-trained artificial neural network (ANN) to a memristor-based SNN, or (2) by training a memristor-based SNN directly. These two approaches can be applied in two scenarios: offline classification and online training. We achieve the classification accuracy of 85.88% by converting a pre-trained ANN to a memristor-based SNN and 84.86% by training the memristor-based SNN directly, given that the baseline training accuracy of the equivalent ANN is 86.02%. We conclude that it is possible to achieve similar classification accuracy in simulation from ANNs to SNNs and from non-memristive synapses to data-driven memristive synapses. We also investigate how global parameters such as spike train length, the read noise, and the weight updating stop conditions affect the neural networks in both approaches. This investigation further indicates that the simulation using statistic memristor models in the two approaches presented by this paper can assist the exploration of memristor-based SNNs in natural language processing tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2634-4386/acb2f0"
    },
    {
        "id": 24784,
        "title": "Fusing AraBERT and Graph Neural Networks for Enhanced Arabic Text Classification",
        "authors": "Ola Karajeh, Mohammed N. Al-Kabi, Edward A. Fox",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acit58888.2023.10453909"
    },
    {
        "id": 24785,
        "title": "Generating images using generative adversarial networks based on text descriptions",
        "authors": "Marzhan Turarova, Roza Bekbayeva, Lazzat Abdykerimova, Murat Aitimov, Aigulim Bayegizova, Ulmeken Smailova, Leila Kassenova, Natalya Glazyrina",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Modern developments in the fields of natural language processing (NLP) and computer vision (CV) emphasize the increasing importance of generating images from text descriptions. The presented article analyzes and compares two key methods in this area: generative adversarial network with conditional latent semantic analysis (GAN-CLS) and ultra-long transformer network (XLNet). The main components of GAN-CLS, including the generator, discriminator, and text encoder, are discussed in the context of their functional tasks—generating images from text inputs, assessing the realism of generated images, and converting text descriptions into latent spaces, respectively. A detailed comparative analysis of the performance of GAN-CLS and XLNet, the latter of which is widely used in the organic light-emitting diode (OEL) field, is carried out. The purpose of the study is to determine the effectiveness of each method in different scenarios and then provide valuable recommendations for selecting the best method for generating images from text descriptions, taking into account specific tasks and resources. Ultimately, our paper aims to be a valuable research resource by providing scientific guidance for NLP and CV experts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v14i2.pp2014-2023"
    },
    {
        "id": 24786,
        "title": "TextGCL: Graph Contrastive Learning for Transductive Text Classification",
        "authors": "Yawei Zhao, Xiaoyang Song",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191923"
    },
    {
        "id": 24787,
        "title": "Rule extraction based on PROMETHEE-assisted multi-objective genetic algorithm for generating interpretable neural networks",
        "authors": "Dounia Yedjour, Hayat Yedjour, Mohammed Bilel Amri, Adlania Senouci",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.111160"
    },
    {
        "id": 24788,
        "title": "Exploring Text-Generating Large Language Models (LLMs) for Emotion Recognition in Affective Intelligent Agents",
        "authors": "Aaron Pico, Emilio Vivancos, Ana Garcia-Fornes, Vicente Botti",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012596800003636"
    },
    {
        "id": 24789,
        "title": "Convolutional Neural Networks for Text Classification: A Comprehensive Analysis",
        "authors": "Prof. Sachin Sambhaji Patil",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: This research paper explores the integration of Convolutional Neural Networks (CNNs) with the VADER (Valence Aware Dictionary and sEntiment Reasoner) sentiment analysis tool for text classification tasks. CNNs have shown promising results in text classification, while VADER is a well-established lexicon and rule-based sentiment analysis tool. By combining the strengths of both approaches, we aim to enhance the accuracy and effectiveness of text classification models. The proposed approach leverages the local context capture capabilities of CNNs and the sentiment analysis capabilities of VADER to classify text into predefined categories. We evaluate the performance of the CNN with VADER model on benchmark datasets, comparing it with other state-of-the-art text classification models. The results demonstrate that the integration of CNNs with VADER significantly improves classification accuracy and provides a more nuanced understanding of sentiment in textual data. This research contributes to the field of text classification by highlighting the benefits of combining deep learning models with sentiment analysis tools for more accurate and informative classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.52889"
    },
    {
        "id": 24790,
        "title": "Research on Chinese short text classification based on ERNIE-TEXTCNN model",
        "authors": "Mengtao Wang, Junwu Xu",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005031"
    },
    {
        "id": 24791,
        "title": "Abstractive Text Summarisation using Recurrent Neural Networks at the Paragraph Level",
        "authors": "Israel Christian Tchouya’a Ngoko, Boniface Kabaso",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "Continuous production of information has been facilitated by the easy access to new technology. This has made it difficult for many users to find relevant information, which are sometimes buried deeply inside mass-produced content. Without the development of new tools and technology to make this data more accessible, it potential remain unexploited. Abstractive text summarisation aims to extract the key points of the document. Because text generating techniques are still in their early stage, it has received little attention in the past. Recently, the application of recurrent neural network models has made significant progress in abstractive sentence summarisation. Despite the improvement in results, these models still tend to produce grammatical errors. Unfortunately, attempts in abstractive document summarisation are still in their early phases, and evaluation outcomes on benchmark datasets are noticeably inferior to human summarisation. In this study we propose a data-driven for abstractive document. Each word generated in the summary use an attention-based technique depending on the input paragraph. According to experimental findings, our model generates higher-quality summaries, achieving ROUGE-1 score of 44.44, ROUGE-2 score of 22.50, and ROUGEL score of 45.15 on the document understanding conference 2004 datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59200/icarti.2023.020"
    },
    {
        "id": 24792,
        "title": "A Determinantal Point Process Based Novel Sampling Method of Abstractive Text Summarization",
        "authors": "Jianbin Shen, Junyu Xuan, Christy Liang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191958"
    },
    {
        "id": 24793,
        "title": "Generating Tiny Deep Neural Networks for ECG Classification on Micro-Controllers",
        "authors": "Shalini Mukhopadhyay, Swarnava Dey, Avik Ghose, Pragya Singh, Pallab Dasgupta",
        "published": "2023-3-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/percomworkshops56833.2023.10150311"
    },
    {
        "id": 24794,
        "title": "Research on Sentence Embeddings for Text Matching through Multiview Interactive Features",
        "authors": "Xiaohui Liu, Fumin Chen, Yong Hu, Xinjian Li",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105673"
    },
    {
        "id": 24795,
        "title": "Text Sentiment Analysis based on Multichannel Convolutional Neural Networks and Syntactic Structure",
        "authors": "Debabrata Maity, Suvarna Kanakaraddi, Shantala Giraddi",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.004"
    },
    {
        "id": 24796,
        "title": "Multi-source combined transfer learning for text classification",
        "authors": "Bingbing Song, Jianhan Pan, Qiaoli Qu, Sijing Chen",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004780"
    },
    {
        "id": 24797,
        "title": "Optimizer algorithms and convolutional neural networks for text classification",
        "authors": "Mohammed Qorich, Rajae El Ouazzani",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "<span lang=\"EN-US\">Lately, deep learning has improved the algorithms and the architectures of several natural language processing (NLP) tasks. In spite of that, the performance of any deep learning model is widely impacted by the used optimizer algorithm; which allows updating the model parameters, finding the optimal weights, and minimizing the value of the loss function. Thus, this paper proposes a new convolutional neural network (CNN) architecture for text classification (TC) and sentiment analysis and uses it with various optimizer algorithms in the literature. Actually, in NLP, and particularly for sentiment classification concerns, the need for more empirical experiments increases the probability of selecting the pertinent optimizer. Hence, we have evaluated various optimizers on three types of text review datasets: small, medium, and large. Thereby, we examined the optimizers regarding the data amount and we have implemented our CNN model on three different sentiment analysis datasets so as to binary label text reviews. The experimental results illustrate that the adaptive optimization algorithms Adam and root mean square propagation (RMSprop) have surpassed the other optimizers. Moreover, our best CNN model which employed the RMSprop optimizer has achieved 90.48% accuracy and surpassed the state-of-the-art CNN models for binary sentiment classification problems. </span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijai.v13.i1.pp451-458"
    },
    {
        "id": 24798,
        "title": "Offline Recognition Of Handwritten Text Using Combination Of Neural Networks",
        "authors": "Maheswari B, Subha S, Tulasi Malini V K, Venkada Ramanan P",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192850"
    },
    {
        "id": 24799,
        "title": "Generating Diagnostic and Actionable Explanations for Fair Graph Neural Networks",
        "authors": "Zhenzhong Wang, Qingyuan Zeng, Wanyu Lin, Min Jiang, Kay Chen Tan",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "A plethora of fair graph neural networks (GNNs) have been proposed to promote algorithmic fairness for high-stake real-life contexts. Meanwhile, explainability is generally proposed to help machine learning practitioners debug models by providing human-understandable explanations. However, seldom work on explainability is made to generate explanations for fairness diagnosis in GNNs. From the explainability perspective, this paper explores the problem of what subgraph patterns cause the biased behavior of GNNs, and what actions could practitioners take to rectify the bias? By answering the two questions, this paper aims to produce compact, diagnostic, and actionable explanations that are responsible for discriminatory behavior. Specifically, we formulate the problem of generating diagnostic and actionable explanations as a multi-objective combinatorial optimization problem. To solve the problem, a dedicated multi-objective evolutionary algorithm is presented to ensure GNNs' explainability and fairness in one go. In particular, an influenced nodes-based gradient approximation is developed to boost the computation efficiency of the evolutionary algorithm. We provide a theoretical analysis to illustrate the effectiveness of the proposed framework. Extensive experiments have been conducted to demonstrate the superiority of the proposed method in terms of classification performance, fairness, and interpretability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i19.30168"
    },
    {
        "id": 24800,
        "title": "Target-X: An Efficient Algorithm for Generating Targeted Adversarial Images to Fool Neural Networks",
        "authors": "Samer Y. Khamaiseh, Derek Bagagem, Abdullah Al-Alaj, Mathew Mancino, Hakem Alomari, Ahmed Aleroud",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00087"
    },
    {
        "id": 24801,
        "title": "Multi-hop Relational Graph Attention Network for Text-to-SQL Parsing",
        "authors": "Hu Liu, Yuliang Shi, Jianlin Zhang, Xinjun Wang, Hui Li, Fanyu Kong",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191914"
    },
    {
        "id": 24802,
        "title": "ED-T2V: An Efficient Training Framework for Diffusion-based Text-to-Video Generation",
        "authors": "Jiawei Liu, Weining Wang, Wei Liu, Qian He, Jing Liu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191565"
    },
    {
        "id": 24803,
        "title": "Generating muonic force carriers events with classical and quantum neural networks",
        "authors": "T. Ramazyan, O. Kiss, M. Grossi, E. Kajomovitz, S. Vallecorsa",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Abstract\nGenerative models (GM) are promising applications for near-term quantum computers due to the probabilistic nature of quantum mechanics. This work compares a classical conditional generative adversarial network (CGAN) with a quantum circuit Born machine while addressing their strengths and limitations to generate muonic force carriers (MFCs) events. The former uses a neural network as a discriminator to train the generator, while the latter takes advantage of the stochastic nature of measurements in quantum mechanics to generate samples. We consider a muon fixed-target collision between muons produced at the high-energy collisions of the LHC and the detector material of the ForwArd Search ExpeRiment (FASER) or the ATLAS calorimeter. In the ATLAS case, independent muon measurements performed by the inner detector (ID) and muon system (MS) can help observe new force carriers coupled to muons, which are usually not detected. We numerically observed that CGANs could reproduce the complete data set and interpolate to different regimes. Moreover, we show on a simplified problem that Born machines are promising generative models for near-term quantum devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2438/1/012089"
    },
    {
        "id": 24804,
        "title": "Bidirectionally self-normalizing neural networks",
        "authors": "Yao Lu, Stephen Gould, Thalaiyasingam Ajanthan",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.017"
    },
    {
        "id": 24805,
        "title": "Generating Adversarial Examples with Better Transferability via Masking Unimportant Parameters of Surrogate Model",
        "authors": "Dingcheng Yang, Wenjian Yu, Zihao Xiao, Jiaqi Luo",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191679"
    },
    {
        "id": 24806,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "Taro Toyoizumi, DeLiang Wang",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00490-7"
    },
    {
        "id": 24807,
        "title": "VC dimensions of group convolutional neural networks",
        "authors": "Philipp Christian Petersen, Anna Sepliarskaia",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.012"
    },
    {
        "id": 24808,
        "title": "Multi-modal sentiment analysis based on expression and text",
        "authors": "Wenjun Kao, Hai Yang, Chunling Liu, Jianguo Bai",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004687"
    },
    {
        "id": 24809,
        "title": "ARTIFICIAL TEXT GENERATION USING DEEP NEURAL NETWORKS:  TRAINING OF SULEYMAN SANI AKHUNDOV’S PLAYS",
        "authors": "Shahriyar Guliyev,  ",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36719/2663-4619/91/82-96"
    },
    {
        "id": 24810,
        "title": "NEURAL NETWORKS OPTIMIZATION: METHODS AND THEIR COMPARISON BASED OFF TEXT INTELLECTUAL ANALYSIS",
        "authors": "Julia V. Torkunova, Danila V. Milovanov",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "The research resulted in the development of software that implements various algorithms of neural networks optimization, which allowed to carry out their comparative analysis in terms of optimization quality. The article takes a detailed look at artificial neural networks and methods of their optimization: quantization, overcutting, distillation, Tucker’s dissolution. Algorithms and optimization tools of neural networks were explained, as well as comparative analysis of different methods was conducted with their advantages and disadvantages listed. Calculation values were given as well as recommendations on how to execute each method. Optimization is studied by text classification performance: peculiarities were removed, models were chosen and taught, parameters were adjusted. The set task was completed with the use of the following technologies: Python programming language, Pytorch framework and Jupyter Notebook developing environment. The results that were acquired can be used to reduce the demand on computing power while preserving the same level of detection and classification abilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12731/2227-930x-2023-13-4-142-158"
    },
    {
        "id": 24811,
        "title": "GTR-GA: Harnessing the power of graph-based neural networks and genetic algorithms for text augmentation",
        "authors": "Aytuğ Onan",
        "published": "2023-12",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120908"
    },
    {
        "id": 24812,
        "title": "Beyond Words: A Heterogeneous Graph Representation of Text via Graph Neural Networks For Classification",
        "authors": "Fardin Rastakhiz, Omid Davar, Mahdi Eftekhari",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp61396.2024.10475238"
    },
    {
        "id": 24813,
        "title": "Towards an image-computable visual text quality metric using deep neural networks",
        "authors": "Ling-Qi Zhang, Minjung Kim, James Hillis, Trisha Lian",
        "published": "2023-1-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2352/ei.2023.35.8.iqsp-310"
    },
    {
        "id": 24814,
        "title": "A Hybrid Text Summarization Approach Using Neural Networks and Metaheuristic Algorithms",
        "authors": "Abdulrahman Mohsen Ahmed Zeyad, Arun Biradar",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ijsse.130310"
    },
    {
        "id": 24815,
        "title": "Corrigendum to ‘An exact mapping from ReLU networks to spiking neural networks’ [Neural Networks Volume 168 (2023) Pages 74-88]",
        "authors": "Ana Stanojevic, Stanisław Woźniak, Guillaume Bellec, Giovanni Cherubini, Angeliki Pantazi, Wulfram Gerstner",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.057"
    },
    {
        "id": 24816,
        "title": "DEVELOPMENT OF METHODS AND ALGORITHM FOR FORMALIZING A TEXT REQUEST TO ONLINE SERVICES GENERATING IMAGES THROUGH NEURAL NETWORK TECHNOLOGIE",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21667/1995-4565-2023-85-82-95"
    },
    {
        "id": 24817,
        "title": "Optimizing dense feed-forward neural networks",
        "authors": "Luis Balderas, Miguel Lastra, José M. Benítez",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.12.015"
    },
    {
        "id": 24818,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00516-0"
    },
    {
        "id": 24819,
        "title": "Current Events",
        "authors": "",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00198-3"
    },
    {
        "id": 24820,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00314-3"
    },
    {
        "id": 24821,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00113-8"
    },
    {
        "id": 24822,
        "title": "Mean-field neural networks: Learning mappings on Wasserstein space",
        "authors": "Huyên Pham, Xavier Warin",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.015"
    },
    {
        "id": 24823,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00039-4"
    },
    {
        "id": 24824,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00476-8"
    },
    {
        "id": 24825,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00709-8"
    },
    {
        "id": 24826,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00179-5"
    },
    {
        "id": 24827,
        "title": "Current Events",
        "authors": "",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00485-3"
    },
    {
        "id": 24828,
        "title": "Consideration on the learning efficiency of multiple-layered neural networks with linear units",
        "authors": "Miki Aoyagi",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106132"
    },
    {
        "id": 24829,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00482-8"
    },
    {
        "id": 24830,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00415-x"
    },
    {
        "id": 24831,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00545-2"
    },
    {
        "id": 24832,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00095-3"
    },
    {
        "id": 24833,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00241-1"
    },
    {
        "id": 24834,
        "title": "Current Events",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00715-3"
    },
    {
        "id": 24835,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00008-x"
    },
    {
        "id": 24836,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00482-3"
    },
    {
        "id": 24837,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00550-6"
    },
    {
        "id": 24838,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106192"
    },
    {
        "id": 24839,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00066-2"
    },
    {
        "id": 24840,
        "title": "Editorial Board",
        "authors": "",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00225-9"
    },
    {
        "id": 24841,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00227-2"
    },
    {
        "id": 24842,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00194-6"
    },
    {
        "id": 24843,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00035-7"
    },
    {
        "id": 24844,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00152-1"
    },
    {
        "id": 24845,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00149-1"
    },
    {
        "id": 24846,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00317-9"
    },
    {
        "id": 24847,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00598-1"
    },
    {
        "id": 24848,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00011-x"
    },
    {
        "id": 24849,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00031-x"
    },
    {
        "id": 24850,
        "title": "Current Events",
        "authors": "",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00105-3"
    },
    {
        "id": 24851,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00593-2"
    },
    {
        "id": 24852,
        "title": "Current Events",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00519-6"
    },
    {
        "id": 24853,
        "title": "Current Events",
        "authors": "",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00410-0"
    },
    {
        "id": 24854,
        "title": "Editorial Board",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00246-0"
    },
    {
        "id": 24855,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00183-7"
    },
    {
        "id": 24856,
        "title": "CURRENT EVENTS",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00061-3"
    },
    {
        "id": 24857,
        "title": "Relevance and Irrelevance Considered Subspace Mapping Neural Networks for Remote Sensing Text-Image Retrieval",
        "authors": "Xiu Li, Chengyu Zheng, Jie Nie, Ruoyu Zhang, Xinyue Liang, Zhiqiang Wei",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3595916.3626391"
    },
    {
        "id": 24858,
        "title": "A Systematic Literature Review on Text Generation using Deep Neural Networks",
        "authors": "Rutuja Santosh Thube -, Gauri Sanjay Patil -, Dr. Harshali Patil -, Dr. Jyotshna Dongradive -",
        "published": "2024-1-13",
        "citations": 0,
        "abstract": "Text generation using deep neural networks has become an exciting area of research. Deep neural networks, such as recurrent neural networks (RNNs) and transformers, have shown remarkable capabilities in generating coherent and contextually relevant text. By training these models on large text corpora, they learn to capture the underlying patterns and structures of the language. This enables them to generate new text that resembles the style and content of the training data. Text generation using deep neural networks has a wide range of applications, including chatbots, language translation, poetry generation, and even code generation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i01.11921"
    },
    {
        "id": 24859,
        "title": "Application of Multi-Modal Neural Networks in Verifying the Authenticity of News Text and Images",
        "authors": "Feng Li, Meiling Xu, Marshima Mohd Rosli",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ts.400606"
    },
    {
        "id": 24860,
        "title": "An Efficient Text based Classification using Neural Networks and Long Short-Term Memory",
        "authors": "Settipalli Shanmukha Sai Srinivas, Devata Sai Harshith, Venubabu Rachapudi",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icais56108.2023.10073886"
    },
    {
        "id": 24861,
        "title": "Stabilization of reaction–diffusion fractional-order memristive neural networks",
        "authors": "Ruoxia Li, Jinde Cao, Ning Li",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.042"
    },
    {
        "id": 24862,
        "title": "TieFake: Title-Text Similarity and Emotion-Aware Fake News Detection",
        "authors": "Quanjiang Guo, Zhao Kang, Ling Tian, Zhouguo Chen",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191858"
    },
    {
        "id": 24863,
        "title": "Text Classification on Imbalanced Data using Graph Neural Networks and Adversarial Weight Balancer",
        "authors": "Fatemeh Badiei, Makan Kananian, S. AmirAli Gh. Ghahramani",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csde59766.2023.10487693"
    },
    {
        "id": 24864,
        "title": "Deep Semantic Multimodal Hashing Network for Scalable Image-Text and Video-Text Retrievals",
        "authors": "Lu Jin, Zechao Li, Jinhui Tang",
        "published": "2023-4",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2020.2997020"
    },
    {
        "id": 24865,
        "title": "Mixing neural networks, continuation and symbolic computation to solve parametric systems of non linear equations",
        "authors": "J.-P. Merlet",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106316"
    },
    {
        "id": 24866,
        "title": "HybridBranchNet: A novel structure for branch hybrid convolutional neural networks architecture",
        "authors": "Ebrahim Parcham, Mansoor Fateh",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.025"
    },
    {
        "id": 24867,
        "title": "Generating Faithful Text From a Knowledge Graph with Noisy Reference Text",
        "authors": "Tahsina Hashem, Weiqing Wang, Derry Tanti Wijaya, Mohammed Eunus Ali, Yuan-Fang Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.inlg-main.8"
    },
    {
        "id": 24868,
        "title": "FACExplainer: Generating Model-faithful Explanations for Graph Neural Networks Guided by Spatial Information",
        "authors": "Hua Yang, C. L. Philip Chen, Bianna Chen, Tong Zhang",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibm58861.2023.10385740"
    },
    {
        "id": 24869,
        "title": "Convolutional Neural Networks for Handwritten Text Recognition of Medical Prescription",
        "authors": "Makarand Shahade, Mayuri Kulkarni, Vivek Pawar, Jatin Chaudhari, Yash Lakade, Darshan Kotkar",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.6025/jdim/2023/21/4/117-124"
    },
    {
        "id": 24870,
        "title": "ReciPic: A Tool for Generating Infographic from Recipe Procedure Text",
        "authors": "Lechang Zhang, Takayuki Itoh",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv60283.2023.00012"
    },
    {
        "id": 24871,
        "title": "Exploring the Impact of Informal Language on Sentiment Analysis Models for Social Media Text Using Convolutional Neural Networks",
        "authors": "Aadil Gani Ganie, Samad Dadvandipour",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "The present study sought to investigate the influence of informal language on the effectiveness of sentiment analysis models when applied to social media text. A Convolutional Neural Network (CNN) approach was employed, and the model was developed and trained on three distinct datasets: a sarcasm corpus, a sentiment corpus, and an emoticon corpus. The experimental design involved keeping the model architecture constant and training it on 80% of the data, followed by evaluating its performance on the remaining 20%. The results revealed that the model achieved a high accuracy of 96.47% on the sarcasm corpus, with class 1 exhibiting the lowest accuracy. The sentiment corpus yielded an accuracy of 95.28% for the model. The integration of the sarcasm and sentiment datasets resulted in a slight improvement in accuracy to 95.1%. The inclusion of the emoticon corpus had a marginal positive effect, resulting in an accuracy of 95.37%. These findings suggest that the use of informal language has minimal impact on the performance of sentiment analysis models applied to social media text. Furthermore, the incorporation of emoticon data may lead to a modest improvement in accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35925/j.multi.2023.1.17"
    },
    {
        "id": 24872,
        "title": "Handwritten Vedic Sanskrit Text Recognition Using Deep Learning and Convolutional Neural Networks",
        "authors": "Et al. Ashi Maheshwari",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Recognizing Vedic Sanskrit text is essential for accessing classical Indo-Aryan language, predominantly utilized in the Vedas. Currently, there is limited awareness about the Vedas, making this field a highly demanding and challenging area in pattern recognition. To accelerate progress in optical character recognition (OCR), deep learning methods are indispensable. This article presents a novel approach to Vedic Sanskrit text recognition, incorporating deep convolutional architectures with their respective interpretations. We introduce three modified 4-fold CNN architectures and the AlexNet model. Our system comprises a handwritten dataset containing 140 distinct Vedic Sanskrit words, with approximately 500 images per word, totaling around 70,000 images. The dataset is partitioned for training and testing in an 80:20 ratio. Training is conducted using 20% of the samples, and the resulting model is applied to the deep convolutional network with varied sets of neurons in their hidden layers. Our proposed method demonstrates robust support for accurate Vedic Sanskrit word classification. The recognition rate achieved in our research is 97.42%, with an average recognition time of 0.3640 milliseconds, surpassing existing CNN-based approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i11.10071"
    },
    {
        "id": 24873,
        "title": "Fine-Tuned Convolutional Neural Networks for Tamil Handwritten Text Recognition",
        "authors": "C. R. Dhivyaa, K. Nithya, R. Dharshini, R. Sudhakar, K. Sathis Kumar, T. Janani",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192712"
    },
    {
        "id": 24874,
        "title": "Text sentiment classification of Amazon reviews using word embeddings and convolutional neural networks",
        "authors": "Mohammed Qorich, Rajae El Ouazzani",
        "published": "2023-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05094-6"
    },
    {
        "id": 24875,
        "title": "Possibilities of Using the Architecture of Neural Networks \"Transformer\" in Transport Engineering",
        "authors": "A. V. Tarasova, R. A. Gematudinov, M. E. Yahimovich, P. A. Selezneva, Kh. A. Dzhabrailov",
        "published": "2023-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf56737.2023.10092182"
    },
    {
        "id": 24876,
        "title": "Two-timescale recurrent neural networks for distributed minimax optimization",
        "authors": "Zicong Xia, Yang Liu, Jiasen Wang, Jun Wang",
        "published": "2023-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.003"
    },
    {
        "id": 24877,
        "title": "Performance evaluation of generative adversarial networks for generating mugshot images from text description",
        "authors": "Nur Nabilah Bahrum, Samsul Setumin, Nor Azlan Othman, Mohd Ikmal Fitri Maruzuki, Mohd Firdaus Abdullah, Adi Izhar Che Ani",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "The process of identifying photos from a sketch has been explored by many researchers, and the performance of the identification process is almost perfect, particularly for viewed sketches. Suspect identification based on sketches is one of the applications in forensic science. To identify the suspect using these kinds of methods, a face sketch is required. Hence, the methods require skilled artists to sketch the suspect based on descriptions provided by eyewitnesses. However, the skills of these artists are different from one another, which results in different rendered sketches. Therefore, this work attempts to propose a new identification method based only on forensic face-written descriptions. To investigate the feasibility of the proposed method, this study has evaluated the performance of some text-to-photo generators on both viewed and forensic datasets using three different models of GAN which are SAGAN, DFGAN, and DCGAN. Then, the generated images are compared to the real photo contained within those datasets to evaluate how well the proposed method recognizes the faces. The results demonstrated that the recognition rate for the generated photos by the DCGAN models is better than the other two models which achieve a 38.3% recognition rate at rank-10 for mugshot identification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v13i1.5895"
    },
    {
        "id": 24878,
        "title": "A singular Riemannian geometry approach to Deep Neural Networks I. Theoretical foundations",
        "authors": "Alessandro Benfenati, Alessio Marta",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.022"
    },
    {
        "id": 24879,
        "title": "Domain-informed graph neural networks: A quantum chemistry case study",
        "authors": "Jay Paul Morgan, Adeline Paiement, Christian Klinke",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.030"
    },
    {
        "id": 24880,
        "title": "Beyond multilayer perceptrons: Investigating complex topologies in neural networks",
        "authors": "Tommaso Boccato, Matteo Ferrante, Andrea Duggento, Nicola Toschi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.12.012"
    },
    {
        "id": 24881,
        "title": "Feature flow regularization: Improving structured sparsity in deep neural networks",
        "authors": "Yue Wu, Yuan Lan, Luchan Zhang, Yang Xiang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.02.013"
    },
    {
        "id": 24882,
        "title": "Physics-informed neural wavefields with Gabor basis functions",
        "authors": "Tariq Alkhalifah, Xinquan Huang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106286"
    },
    {
        "id": 24883,
        "title": "Neural Text Classification by Jointly Learning to Cluster and Align",
        "authors": "Yekun Chai, Haidong Zhang, Qiyue Yin, Junge Zhang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191269"
    },
    {
        "id": 24884,
        "title": "MGEL: Multigrained Representation Analysis and Ensemble Learning for Text Moderation",
        "authors": "Fei Tan, Changwei Hu, Yifan Hu, Kevin Yen, Zhi Wei, Aasish Pappu, Serim Park, Keqian Li",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3137045"
    },
    {
        "id": 24885,
        "title": "An adaptive embedding procedure for time series forecasting with deep neural networks",
        "authors": "Federico Succetti, Antonello Rosato, Massimo Panella",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.051"
    },
    {
        "id": 24886,
        "title": "Approximation bounds for convolutional neural networks in operator learning",
        "authors": "Nicola Rares Franco, Stefania Fresca, Andrea Manzoni, Paolo Zunino",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.029"
    },
    {
        "id": 24887,
        "title": "A mathematical framework for improved weight initialization of neural networks using Lagrange multipliers",
        "authors": "Ingeborg de Pater, Mihaela Mitici",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.035"
    },
    {
        "id": 24888,
        "title": "Logarithmic Learning Differential Convolutional Neural Network",
        "authors": "Magombe Yasin, Mehmet Sarıgül, Mutlu Avci",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106114"
    },
    {
        "id": 24889,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00594-4"
    },
    {
        "id": 24890,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00716-5"
    },
    {
        "id": 24891,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00062-5"
    },
    {
        "id": 24892,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00153-3"
    },
    {
        "id": 24893,
        "title": "EBBE-Text: Explaining Neural Networks by Exploring Text Classification Decision Boundaries",
        "authors": "Alexis Delaforge, Jérôme Azé, Sandra Bringay, Caroline Mollevi, Arnaud Sallaberry, Maximilien Servajean",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tvcg.2022.3184247"
    },
    {
        "id": 24894,
        "title": "Corrigendum to “Functional connectivity inference from fMRI data using multivariate information measures” [Neural Networks 146 (2022) 85–97]",
        "authors": "Qiang Li",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.021"
    },
    {
        "id": 24895,
        "title": "EDANAS: Adaptive Neural Architecture Search for Early Exit Neural Networks",
        "authors": "Matteo Gambella, Manuel Roveri",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191876"
    },
    {
        "id": 24896,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106193"
    },
    {
        "id": 24897,
        "title": "NN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00318-0"
    },
    {
        "id": 24898,
        "title": "List of Editorial Board Members",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00488-9"
    },
    {
        "id": 24899,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00242-3"
    },
    {
        "id": 24900,
        "title": "INN/ENNS/JNNS - Membership Applic. Form",
        "authors": "",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0893-6080(24)00184-9"
    },
    {
        "id": 24901,
        "title": "Fixed-time periodic stabilization of discontinuous reaction–diffusion Cohen–Grossberg neural networks",
        "authors": "Fanchao Kong, Quanxin Zhu, Hamid Reza Karimi",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.017"
    },
    {
        "id": 24902,
        "title": "A Method for Extrapolating Continuous Functions by Generating New Training Samples for Feedforward Artificial Neural Networks",
        "authors": "Kostadin Yotov, Emil Hadzhikolev, Stanka Hadzhikoleva, Stoyan Cheresharov",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "The goal of the present study is to find a method for improving the predictive capabilities of feedforward neural networks in cases where values distant from the input–output sample interval are predicted. This paper proposes an iterative prediction algorithm based on two assumptions. One is that predictions near the statistical sample have much lower error than those distant from the sample. The second is that a neural network can generate additional training samples and use them to train itself in order to get closer to a distant prediction point. This paper presents the results of multiple experiments with different univariate and multivariate functions and compares the predictions made by neural networks before and after their training with the proposed iterative algorithm. The results show that, having passed through the stages of the algorithm, artificial neural networks significantly improve their interpolation performance in long-term forecasting. The present study demonstrates that neural networks are capable of creating additional samples for their own training, thus increasing their approximating efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12080759"
    },
    {
        "id": 24903,
        "title": "On the improvement of handwritten text line recognition with octave convolutional recurrent neural networks",
        "authors": "Dayvid Castro, Cleber Zanchettin, Luís A. Nunes Amaral",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10032-024-00460-3"
    },
    {
        "id": 24904,
        "title": "Drop edges and adapt: A fairness enforcing fine-tuning for graph neural networks",
        "authors": "Indro Spinelli, Riccardo Bianchini, Simone Scardapane",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.002"
    }
]