[
    {
        "id": 1501,
        "title": "Malicious Traffic classification using Long Short-Term Memory (LSTM) model",
        "authors": "Naresh Kumar Thapa K, N. Duraipandian",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nMalicious traffic classification is the initial and primary step for any network-based security systems. This traffic classification systems include behavior-based anomaly detection system and Intrusion Detection System. Existing methods always relies on the conventional techniques and process the data in the fixed sequence, which may leads to performance issues. Furthermore, conventional techniques require proper annotation to process the volumetric data. Relying on the data annotation for efficient traffic classification may leads to network loops and bandwidth issues within the network. To address the above-mentioned issues, this paper presents a novel solution based on artificial intelligence perspective. The key idea of this paper is to propose a novel malicious classification system using Long Short-Term Memory (LSTM) model. To validate the efficiency of the proposed model, an experimental setup along with experimental validation is carried out. From the experimental results, it is proven that the proposed model is better in terms of accuracy, throughput when compared to the state-of-the-art models. Further, the accuracy of the proposed model outperforms the existing state of the art models with increase in 5% and overall 99.5% in accuracy.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-159180/v1"
    },
    {
        "id": 1502,
        "title": "Predicting machine’s performance data using the stacked long short-term memory (LSTM) neural networks",
        "authors": "Jianrong Dai",
        "published": "No Date",
        "citations": 2,
        "abstract": "Abstract\nPurpose\n\nMachine Performance Check (MPC) is a daily quality assurance (QA) tool for Varian machines. The daily QA data based on MPC tests show machine performance patterns and potentially provide warning messages for preventive actions. This study developed a neural network model that could predict the trend of data variations quantitively.\nMethods and materials:\n\nMPC data used were collected daily for 3 years. The stacked long short-term memory (LSTM)model was used to develop the neural work model. To compare the stacked LSTM, the autoregressive integrated moving average model (ARIMA) was developed on the same data set. Cubic interpolation was used to double the amount of data to enhance prediction accuracy. After then, the data were divided into 3 groups: 70% for training, 15% for validation, and 15% for testing. The training set and the validation set were used to train the stacked LSTM with different hyperparameters to find the optimal hyperparameter. Furthermore, a greedy coordinate descent method was employed to combinate different hyperparameter sets. The testing set was used to assess the performance of the model with the optimal hyperparameter combination. The accuracy of the model was quantified by the mean absolute error (MAE), root-mean-square error (RMSE), and coefficient of determination (R2).\nResults\n\nA total of 867 data were collected to predict the data for the next 5 days. The mean MAE, RMSE, and \\({\\text{R}}^{2}\\) with all MPC tests was 0.013, 0.020, and 0.853 in LSTM, while 0.021, 0.030, and 0.618 in ARIMA, respectively. The results show that the LSTM outperforms the ARIMA.\nConclusions\n\nIn this study, the stacked LSTM model can accurately predict the daily QA data based on MPC tests. Predicting future performance data based on MPC tests will foresee possible machine failure, allowing early machine maintenance and reducing unscheduled machine downtime.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-961567/v1"
    },
    {
        "id": 1503,
        "title": "Rainfall-Runoff modelling using Long-Short-Term-Memory (LSTM) networks",
        "authors": " Anonymous",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/hess-2018-247-sc1"
    },
    {
        "id": 1504,
        "title": "Rainfall-Runoff modelling using Long-Short-Term-Memory (LSTM) networks",
        "authors": " Anonymous",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/hess-2018-247-sc2"
    },
    {
        "id": 1505,
        "title": "Economic Nowcasting with Long Short-term Memory Artificial Neural Networks (LSTM)",
        "authors": "Daniel Hopp",
        "published": "No Date",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3855402"
    },
    {
        "id": 1506,
        "title": "Utilizing Long Short-Term Memory (LSTM) for Detecting Multiple Sclerosis Based on Vessel Analysis",
        "authors": "Neda yaghoubi, Rahele kafieh",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground:\n Multiple Sclerosis (MS) is a chronic immune-mediated disease affecting the central nervous system, leading to various disturbances, including visual impairment. Early and accurate diagnosis of MS is critical for effective treatment and management. Scanning Laser Ophthalmoscopy (SLO) is a non-invasive technique that provides high-quality retinal images, serving as a promising resource for the early detection of MS. This research investigates a vessel-based approach for MS detection in SLO images using Long Short-Term Memory (LSTM) networks.\nMaterial and Methods:\n A total of 106 Healthy Controls (HCs) and 39 MS patients (78 eyes) were enrolled. After implementing quality control measures and removing poor-quality or damaged images, the research utilized a total of 265 photos (73 MS and 192 HC). An approach for the early detection of MS in SLO images using LSTM networks is introduced. This approach involves two steps: 1. Pre-training a deep neural network on the source dataset, and 2. Tuning the network on the target dataset of SLO images.\nResults:\n The significance of vessel segmentation in MS detection is examined, and the application of the proposed method in improving diagnostic models is explored. The proposed approach achieves an accuracy rate of 97.44% when evaluated on a test dataset consisting of SLO pictures.\nConclusions:\n Through experiments on SLO datasets and employing the proposed vessel-based approach with LSTM, empirical results demonstrate that this approach contributes to the early detection of MS with high accuracy. These models exhibit the capability to accurately detect the disease with high precision and appropriate sensitivity.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3503257/v1"
    },
    {
        "id": 1507,
        "title": "Evaluation of Korean Reviews Automatically Generated using Long Short-Term Memory Unit",
        "authors": "Youngkyo Oh, Dongyoung Koo",
        "published": "2019-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5626/jok.2019.46.6.515"
    },
    {
        "id": 1508,
        "title": "Long short-term memory (LSTM) networks",
        "authors": "Emil Hvitfeldt, Julia Silge",
        "published": "2021-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003093459-14"
    },
    {
        "id": 1509,
        "title": "Long Short-Term Memory (LSTM) Algorithm Based Prediction of Stock Market Exchange",
        "authors": "KARUNAKAR POTHUGANTI",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3770184"
    },
    {
        "id": 1510,
        "title": "Implementasi Long Short Term Memory (LSTM) dan Bidirectional Long Short Term Memory (BiLSTM) Dalam Prediksi Harga Saham Syariah",
        "authors": "Dian Islamiaty Puteri",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "The development of the stock market in Indonesia is currently growing quite rapidly. This can be seen based on the number of investors who have increased every year. In 2011, sharia stocks were launched for the first time in Indonesia, and it can be seen that the price of the stock is not always stable or can experience increases or decreases. For investors, a strategy is needed to predict stock prices in order to make the right decisions in investing. In this study, stock prediction was carried out using the Long Short-Term Memory (LSTM) and Bidirectional Long Short-Term Memory (BiLSTM) methods. The data used in this study is historical closing price data for three Sharia stocks, namely PT Aneka Tambang Tbk, PT Unilever Indonesia Tbk, and PT Indofood Sukses Makmur Tbk. In building the best predictive model in this study based on tuning parameters such as epoch, batch, neurons, as well as an optimizer and dropout regulation techniques to prevent overfitting of the model. The test results show that from the three stock data used, the smallest MAPE value is obtained in the BiLSTM model. The MAPE values obtained for each stock data in this study are sequentially 2,59%, 1,77%, and 1,05%. Based on the MAPE value criteria, the prediction model is included in the very accurate criteria.",
        "link": "http://dx.doi.org/10.34312/euler.v11i1.19791"
    },
    {
        "id": 1511,
        "title": "Simulation of long-term rainfall runoff using a Long Short-Term Memory (LSTM) networks: Case of Osipcheon watershed in Korea",
        "authors": "Sung Wook An, Jung Ryel Choi, Byung Sik Kim",
        "published": "No Date",
        "citations": 0,
        "abstract": "Water resource management requires long-term historical discharge data, and physical hydrology models were widely used. Recently, in the field of water resources, various studies using artificial neural networks have been conducted. In this paper, long-term discharge was estimated using meteorological data and LSTM (Long Short-Term Memory). Study area is selected as Osipcheon watershed in Korea. Observed meteorological data and discharge data were collected for 10 years to training period (2011-2018) and testing period (2019&#8211;2020). The potential evaporation data was calculated by Hargreaves formula equation. And NSE (Nash&#8211; Sutcliffe Efficiency), RMSE (Root Mean Square Error), and MSE (Mean Square Error) were used to compare LSTM results and observed discharge during the training, test and total period. As a result, NSE, RMSE, and MSE were satisfactory during the total period which showed a high possibility of using the LSTM deep learning technique in the water resource area.Acknowledgment: This research was supported by a grant(2022-MOIS61-001) of Development Risk Prediction Technology of Storm and Flood For Climate Change based on Artificial Intelligence funded by Ministry of Interior and Safety(MOIS, Korea).",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-17334"
    },
    {
        "id": 1512,
        "title": "Bayesian-Optimization-Based Long Short-Term Memory (LSTM) Super Learner Approach for Modeling Long-Term Electricity Consumption",
        "authors": "Salma Hamad Almuhaini, Nahid Sultana",
        "published": "2023-9-7",
        "citations": 2,
        "abstract": "This study utilized different methods, namely classical multiple linear regression (MLR), statistical approach exponential smoothing (EXPS), and deep learning algorithm long short-term memory (LSTM) to forecast long-term electricity consumption in the Kingdom of Saudi Arabia. The originality of this research lies in (1) specifying exogenous variables that significantly affect electrical consumption; (2) utilizing the Bayesian optimization algorithm (BOA) to develop individual super learner BOA-LSTM models for forecasting the residential and total long-term electric energy consumption; (3) measuring forecasting performances of the proposed super learner models with classical and statistical models, viz. MLR and EXPS, by employing the broadly used evaluation measures regarding the computational efficiency, model accuracy, and generalizability; and finally (4) estimating forthcoming yearly electric energy consumption and validation. Population, gross domestic products, imports, and refined oil products significantly impact residential and total annual electricity consumption. The coefficient of determination (R2) for all the proposed models is greater than 0.93, representing an outstanding fitting of the models with historical data. Moreover, the developed BOA-LSTM models have the best performance with R2>0.99, enhancing the predicting accuracy (Mean Absolute Percentage Error (MAPE)) by 59.6% and 54.8% compared to the MLR and EXPS models, respectively, of total annual electricity consumption. This forecasting accuracy in residential electricity consumption for the BOA-LSTM model is improved by 62.7% and 68.9% compared to the MLR and EXPS models. This study achieved a higher accuracy and consistency of the proposed super learner model in long-term electricity forecasting, which can be utilized in energy strategy management to secure the sustainability of electric energy.",
        "link": "http://dx.doi.org/10.3390/su151813409"
    },
    {
        "id": 1513,
        "title": "Evaluating a Long Short-Term Memory(LSTM) network for real-time high-rate GNSS time series analysis",
        "authors": "Jensen DeGrande, Brendan Crowell",
        "published": "No Date",
        "citations": 0,
        "abstract": "We present a neural network optimized for producing GNSS displacements to explore machine learning capabilities in forecasting ground motions for earthquake early warning and to improve our understanding of ground motion in real-time. For earthquake early warning, displacements at GNSS receivers are currently being incorporated into the ShakeAlert system, but displacements in real-time are problematic due to issues with phase ambiguity fixing, cycle slips, and loss of satellite lock as well as dilution of precision from satellite network geometry. These errors can lead to anomalous motions of up to a meter. Raw GNSS observations for velocities can utilize orbits (relative positions) and remove uncertainties caused by path errors, leading to a higher precision observation than the displacements. In general, peak ground velocity is diagnostic of earthquake damage and displacement is diagnostic of total moment release, so obtaining these observations at the highest fidelity is crucial for rapid earthquake source estimation. Since processing raw GNSS velocities gives a higher precision observation, we aim to derive displacements from velocities using a machine learning approach. We use a Long Short-Term Memory (LSTM) network, a recurrent neural network (RNN) with the ability to remember values for an arbitrary amount of time, for time series prediction of the GNSS displacements. The input variables for the model are three-component GNSS velocities derived from the SNIVEL software package, with the possibility of including signal to noise and phase observables, and the output variable is the GNSS displacement time series. The GNSS displacement is validated against the displacements computed with the precise point positioning code GipsyX. With over 2250 1-Hz observations from 82 different events ranging from M4.9 to M9, we have ample data to train, validate, and test the network on. We train several neural network instances on random selection of train/validation/test split for redundancy and shuffle data input order for each instance. By computing the GNSS displacement from GNSS velocities, we produce a higher precision observation, a low-cost method for monitoring deformation without the traditionally high overhead associated with real-time GNSS processing, and the possibility of direct onboard receiver transmission of displacements.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-309"
    },
    {
        "id": 1514,
        "title": "Long Short-Term Memory (LSTM) Neural Networks Applied to Energy Disaggregation",
        "authors": "Anawat Tongta, Komkrit Chooruang",
        "published": "2020-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ieecon48109.2020.229559"
    },
    {
        "id": 1515,
        "title": "BO-LSTM: Classifying relations via long short-term memory networks along biomedical ontologies",
        "authors": "Andre Lamurias, Luka A. Clarke, Francisco M. Couto",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractRecent studies have proposed deep learning techniques, namely recurrent neural networks, to improve biomedical text mining tasks. However, these techniques rarely take advantage of existing domain-specific resources, such as ontologies. In Life and Health Sciences there is a vast and valuable set of such resources publicly available, which are continuously being updated. Biomedical ontologies are nowadays a mainstream approach to formalize existing knowledge about entities, such as genes, chemicals, phenotypes, and disorders. These resources contain supplementary information that may not be yet encoded in training data, particularly in domains with limited labeled data.We propose a new model, BO-LSTM, that takes advantage of domain-specific ontologies, by representing each entity as the sequence of its ancestors in the ontology. We implemented BO-LSTM as a recurrent neural network with long short-term memory units and using an open biomedical ontology, which in our case-study was Chemical Entities of Biological Interest (ChEBI). We assessed the performance of BO-LSTM on detecting and classifying drug-drug interactions in a publicly available corpus from an international challenge, composed of 792 drug descriptions and 233 scientific abstracts. By using the domain-specific ontology in addition to word embeddings and WordNet, BO-LSTM improved both the F1-score of the detection and classification of drug-drug interactions, particularly in a document set with a limited number of annotations. Our findings demonstrate that besides the high performance of current deep learning techniques, domain-specific ontologies can still be useful to mitigate the lack of labeled data.Author summaryA high quantity of biomedical information is only available in documents such as scientific articles and patents. Due to the rate at which new documents are produced, we need automatic methods to extract useful information from them. Text mining is a subfield of information retrieval which aims at extracting relevant information from text. Scientific literature is a challenge to text mining because of the complexity and specificity of the topics approached. In recent years, deep learning has obtained promising results in various text mining tasks by exploring large datasets. On the other hand, ontologies provide a detailed and sound representation of a domain and have been developed to diverse biomedical domains. We propose a model that combines deep learning algorithms with biomedical ontologies to identify relations between concepts in text. We demonstrate the potential of this model to extract drug-drug interactions from abstracts and drug descriptions. This model can be applied to other biomedical domains using an annotated corpus of documents and an ontology related to that domain to train a new classifier.",
        "link": "http://dx.doi.org/10.1101/336719"
    },
    {
        "id": 1516,
        "title": "Very-Short-Term Solar Forecasting with Long Short-Term Memory (LSTM) Network",
        "authors": "Yanbin Lin, Dongliang Duan, Xueming Hong, Xiang Cheng, Liuqing Yang, Shuguang Cui",
        "published": "2020-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aeees48850.2020.9121512"
    },
    {
        "id": 1517,
        "title": "Respiratory Events Classification Using Long Short-Term Memory (LSTM) Networks",
        "authors": "Taisa  Daiana Costa, Guilherme  Nunes Nogueira-Neto, Christopher Druzgalski, Percy Nohama",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4556003"
    },
    {
        "id": 1518,
        "title": "Stock Market Prediction in BSE Using Long Short-Term Memory (LSTM) Algorithm",
        "authors": "Vijay Reddy Madireddy",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4289422"
    },
    {
        "id": 1519,
        "title": "Hourly Precipitation Prediction: Integrating Long Short-Term Memory (LSTM) Neural Networks with Granger Causality",
        "authors": "Rahul Sreedhar, Akshay Sunil, Raghu L Murthy",
        "published": "No Date",
        "citations": 0,
        "abstract": "Precipitation events are one of the most crucial processes governing the water cycle and therefore acts as a major input in majority of water resource studies. Furthermore, the modern era is witnessing an unprecedented increase in the frequency of extreme events highlighting the importance of understanding and predicting the precipitation events. Current precipitation prediction methods utilise complex physics-based models that require large number of input parameters as well as powerful computational facilities, making precipitation prediction a complex task. This scenario has not improved much over the years as advancements are often limited to either improving the model&#8217;s physics or input data quality. Hourly precipitation prediction is even more challenging due to increasing complexity and non-linearity with decreasing scale and therefore studies on understanding hourly precipitation is limited. Recent trends have shown a shift towards utilizing deep learning models in weather prediction owing to the ability of neural networks to capture complex patterns leading to high accuracy predictions. The current research introduces a Long Short Term Memory (LSTM) neural network adept at forecasting fine-scale hourly precipitation patterns up to two hours ahead, a critical development for real-time rain predictions. The Bi-LSTM's architecture, with its forward and backward processing capabilities, is particularly suited to capture the dynamic temporal relationships among the limited meteorological variables helping in effective precipitation prediction. Granger Causality analysis is done to capture relevant information for improving model performance. The model's performance is evaluated on its ability to accurately forecast weather conditions by learning from the historical inter-variable influences that were clearly detailed in the causality diagram. The findings from this study and the interlinks observed is expected to enhance our understanding of variable impact and improve the predictive power of precipitation models for future weather forecasting",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-10291"
    },
    {
        "id": 1520,
        "title": "Advancing Streamflow Modelling: Bias Removal in Physically-Based Models with the Long Short-Term Memory Networks (LSTM) Algorithm",
        "authors": "Safa Mohammed, Ahmed Nasr",
        "published": "No Date",
        "citations": 0,
        "abstract": "Traditional hydrological models have long served as the standard for predicting streamflow across temporal and spatial domains. However, a persistent challenge in modelling lies in mitigating bias inherent in streamflow estimation due to both random and systemic errors in the employed model. Removal of this bias is pivotal for effective water resources management and resilience against extreme events, especially amidst evolving climate conditions. An innovative solution to address this challenge involves the integration of hydrological models with deep learning methods, known as hybridisation. Long Short-Term Memory networks (LSTM), have emerged as a promising and efficient approach to enhancing streamflow estimation. This study focuses on coupling LSTM with a physically distributed model, Wflow_sbm, to serve as a post-processor aimed at reducing modelling errors. The coupled Wflow_sbm-LSTM model was applied to the Boyne catchment in Ireland, utilising a dataset spanning two decades, divided into training, validation, and testing sets to ensure robust model evaluation. Predictive performance was rigorously assessed using metrics like Modified Kling-Gupta Efficiency (MKGE) and Nash-Sutcliffe Efficiency (NSE), with observed streamflow discharges as the target variable. Results demonstrated that the coupled model outperformed the best-calibrated Wflow_sbm model in the study catchment based on the performance measures. The enhanced prediction of extreme events by the coupled Wflow_sbm-LSTM model strengthens the case for its integration into an operational river flow forecasting framework. Significantly, Wflow is endorsed by the National Flood Forecast Warning Service (NFFWS) in Ireland as a recommended model for streamflow simulations, specifically designed for fluvial flood forecasting. Consequently, our proposed Wflow_sbm-LSTM coupled model presents a compelling opportunity for integration into the NFFWS. With demonstrated potential to achieve precise streamflow estimations, this integration holds promise for significantly enhancing the accuracy and effectiveness of flood predictions in Ireland.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-9573"
    },
    {
        "id": 1521,
        "title": "Review of: \"Leveraging long short-term memory (LSTM)-based neural networks for modeling structure–property relationships of metamaterials from electromagnetic responses\"",
        "authors": "Xuhui Bu",
        "published": "2021-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/0axbtt"
    },
    {
        "id": 1522,
        "title": "Prediction of Geomagnetic Auroral Electrojet Indices with Long Short-Term Memory (LSTM) Recurrent Neural Network",
        "authors": "Yucheng Shao, A Surjalal Sharma",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10512983.1"
    },
    {
        "id": 1523,
        "title": "Reviewer comments on &amp;quot;Rainfall Runoff Modeling using Long-Short-Term-Memory (LSTM) Networks",
        "authors": " Anonymous",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/hess-2018-247-rc1"
    },
    {
        "id": 1524,
        "title": "Long Short-Term Memory (LSTM) Deep Neural Networks in Energy Appliances Prediction",
        "authors": "Georgios N. Kouziokas",
        "published": "2019-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/pacet48583.2019.8956252"
    },
    {
        "id": 1525,
        "title": "Exploring Mega-Nourishment Interventions Using Long Short-Term Memory (LSTM) Models and the Sand Engine Surface MATLAB Framework",
        "authors": "Pavitra Kumar, Nicoletta Leonardi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Coastal protection is of paramount importance because erosion and\nflooding affect millions of people living along the coast and can\nlargely influence countries’ economy. The implementation of nature-based\nsolutions for coastal protection, such as sand engines, has become more\npopular due to these interventions’ adaptability to climate change. This\nstudy explores synergies between AI and hydro-morphodynamic models for\nthe creation of efficient decision-making tools for the choice of\noptimal sand engines configurations. Specifically, we investigate the\nuse of long-short-term memory (LSTM) models as predictive tools for the\nmorphological evolution of sand engines. We developed different LSTM\nmodels to predict time series of bathymetric changes across the sand\nengine as well as the time-decline in the sand engine volume as a\nfunction of external forces and intervention size. Finally, a MATLAB\nframework was developed to return LSTM model results based on users’\ninputs about sand engine size and external forcings.",
        "link": "http://dx.doi.org/10.22541/au.169297181.19761587/v1"
    },
    {
        "id": 1526,
        "title": "Chapter 12: Long Short-Term Memory (LSTM) Networks",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1137/1.9781611977905.ch12"
    },
    {
        "id": 1527,
        "title": "Implementation of Sentiment Analysis for Student Academic Services Using Support Vector Machine and Long Short Term Memory (LSTM) Methods",
        "authors": "I. Caturbawa, Sri Asri, I. Suasnawa, Ni Saptarini, Kadek Yasa",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011740100003575"
    },
    {
        "id": 1528,
        "title": "Runoff coefficient modelling using Long Short-Term Memory (LSTM) in the Rur catchment, Germany",
        "authors": "Arash Rahi, Mehdi Rahmati, Jacopo Dari, Renato Morbidelli",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research examines the effectiveness of Long Short-Term Memory (LSTM) models in predicting runoff coefficient (Rc) within the Rur basin at the Stah outlet (Germany) during the period from 1961 to 2021; monthly data of temperature (T), precipitation (P), soil water storage (SWS), and total evaporation (ETA) are used as an input. Because of the complexity in predicting undecomposed Rc time series due to noise, a novel approach incorporating discrete wavelet transform (DWT) to decompose the original Rc at five levels is proposed.\nThe investigation identifies overfitting challenges at level-1, gradually mitigated in subsequent decomposition levels, particularly in level-2, while other levels remain tuned. Reconstructing Rc using modelled decomposition coefficients yielded Nash-Sutcliffe efficacy (NSE) values of 0.88, 0.79, and 0.74 for the training, validation, and test sets, respectively. Comparative analysis highlights that modelling undecomposed Rc with LSTM yields to a minor accuracy, emphasizing the pivotal role of decomposition techniques in tandem with LSTM for enhanced model performances.\nThis study provides novel insights to address challenges related to noise effects and temporal dependencies in Rc modelling; through a comprehensive analysis of the interplay between atmospheric conditions and observed data, the research contributes in advancing predictive modelling in hydrology.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-2872"
    },
    {
        "id": 1529,
        "title": "Country Information Based on Long-Term Short-Term Memory (LSTM)",
        "authors": "Hojae Son, Anand Paul, Gwanggil Jeon",
        "published": "2018-12-1",
        "citations": 0,
        "abstract": "Social platform such as Facebook, Twitter and Instagram generates tremendous data these days. Researchers make use of these data to extract meaningful information and predict future. Especially twitter is the platform people can share their thought briefly on a certain topic and it provides real-time streaming data API (Application Programming Interface) for filtering data for a purpose. Over time a country has changed its interest in other countries. People can get a benefit to see a tendency of interest as well as prediction result from twitter streaming data. Capturing twitter data flow is connected to how people think and have an interest on the topic. We believe real-time twitter data reflect this change. Long-term Short-term Memory Unit (LSTM) is the widely used deep learning unit from recurrent neural network to learn the sequence. The purpose of this work is building prediction model “Country Interest Analysis based on LSTM (CIAL)” to forecast next interval of tweet counts when it comes to referring country on the tweet post. Additionally it’s necessary to cluster for analyzing multiple countries twitter data over the remote nodes. This paper presents how country attention tendency can be captured over twitter streaming data with LSTM algorithm.  ",
        "link": "http://dx.doi.org/10.14419/ijet.v7i4.44.26861"
    },
    {
        "id": 1530,
        "title": "Vibration-based Multi-class Damage Detection and Localization Using Long Short-Term Memory (LSTM) Networks",
        "authors": "Sandeep Sony, Sunanda gamage, Ayan sadhu, Jagath Samarabandu",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this paper, a novel method is proposed for detecting and localizing structural damage by classifying acceleration responses of a structure using a long short-term memory (LSTM) network. Windows of samples are extracted from acceleration responses in a novel data pre-processing pipeline, and an LSTM network is developed to classify the signals into multiple classes. A predicted classification of a signal by the LSTM network into one of the damage levels indicates a damage detection. Furthermore, multiple signals obtained from the vibration sensors placed on a structure are provided as input to the LSTM model, and the resulting predicted class probabilities are used to identify the locations with high probability of damage. The proposed method is validated on the experimental setup of the Qatar University Grandstand Simulator (QUGS) for binary classification, as well as, full-scale study of the Z24 bridge benchmark data for multi-class damage classification. Experiments show that the proposed LSTM-based method performs on par with 1D convolutional neural networks (1D CNN) on the QUGS dataset, and outperforms the 1D CNN on the Z24 dataset. The novelty of this study lies in the use of recurrent neural network based LSTM for vibration data for multi-class damage identification and localization.",
        "link": "http://dx.doi.org/10.31224/osf.io/ftb4d"
    },
    {
        "id": 1531,
        "title": "Rainfall-Runoff modelling using Long Short-Term Memory (LSTM) networks",
        "authors": "Frederik Kratzert, Daniel Klotz, Claire Brenner, Karsten Schulz, Mathew Herrnegger",
        "published": "No Date",
        "citations": 2,
        "abstract": "Rainfall-runoff modelling is one of the key challenges in the field of hydrology. Various approaches exist, ranging from physically based over conceptual to fully data driven models. In this paper, we propose a novel data driven approach, using the Long-Short-Term-Memory (LSTM) network, a special type of recurrent neural networks. The advantage of the LSTM is its ability to learn long-term dependencies between the provided input and output of the network, which are essential for modelling storage effects in e.g. catchments with snow influence. We use 241 catchments of the freely available CAMELS data set to test our approach and also compare the results to the well-known Sacramento Soil Moisture Accounting Model (SAC-SMA) coupled with the Snow-17 snow routine. We also show the potential of the LSTM as a regional hydrological model, in which one model predicts the discharge for a variety of catchments. In our last experiment, we show the possibility to transfer process understanding, learned at regional scale, to individual catchments and thereby increasing model performance when compared to a LSTM trained only on the data of single catchments. Using this approach, we were able to achieve better model performance as the SAC-SMA + Snow-17, which underlines the potential of the LSTM for hydrological modelling applications.",
        "link": "http://dx.doi.org/10.31223/osf.io/qv5jz"
    },
    {
        "id": 1532,
        "title": "ProxySense: A novel approach for gas concentration estimation using Long Short-Term Memory Recurrent Neural Network (LSTM-RNN)",
        "authors": "Nwamaka Okafor, Declan Delaney, Ugochukwu Mathew",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>When equipped with a reliable calibration model, Low-Cost Sensor (LCS) can be relied upon as an effective option for gas concentration estimation, providing robust and high spatio-temporal resolution data to replace large-scale analytical instruments. In this paper, we present ProxySense, a rapid and efficient approach for gas concentration estimation. The ProxySense pipeline consists of gas sensing unit made up of array of metal oxide LCS, data pre-processing including an effective approach based on Variatioanl Autoencoders (VAE) for handling missing sensor data and Long Short Term Memory Reccurrent Neural Network (LSTM-RNN) prediction model. We investigate the capability of ProxySense in exploiting the deep characteristics that exist in multi-sensors’ responses to predict the concentration of a gas for which no specific sensor is included in a multi-sensor device. We evaluated ProxySense for benzene (C6H6) and carbon monoxide (CO) concentration predictions and compared the performances to multiple baselines by means of prediction error characterization. We further studied the relationship between model performance and training length and showed ProxySense to be highly accurate for gas concentration prediction even for small number of training period.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.20306418.v1"
    },
    {
        "id": 1533,
        "title": "Sub-seasonal daily precipitation forecasting based on Long Short-Term Memory (LSTM) models",
        "authors": "Claudia Bertini, Gerald Corzo, Schalk Jan van Andel, Dimitri Solomatine",
        "published": "No Date",
        "citations": 0,
        "abstract": "Water managers need accurate rainfall forecasts for a wide spectrum of applications, ranging from water resources evaluation and allocation, to flood and drought predictions. In the past years, several frameworks based on Artificial Intelligence have been developed to improve the traditional Numerical Weather Prediction (NWP) forecasts, thanks to their ability of learning from past data, unravelling hidden relationships among variables and handle large amounts of inputs. Among these approaches, Long Short-Term Memory (LSTM) models emerged for their ability to predict sequence data, and have been successfully used for rainfall and flow forecasting, mainly with short lead-times. In this study, we explore three different multi-variate LSTM-based models, i.e. vanilla LSTM, stacked LSTM and bidirectional LSTM, to forecast daily precipitation for the upcoming 30 days in the area of Rhine Delta, the Netherlands. We use both local atmospheric and global climate variables from the ERA-5 reanalysis dataset to predict rainfall, and we introduce a fuzzy index for the models to account for seasonality effects. The framework is developed within the H2020 project CLImate INTelligence (CLINT), and its outcomes have the potential to improve forecasting precipitation deficit in the study area.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-7828"
    },
    {
        "id": 1534,
        "title": "Lake water level modeling using a Long-Short-Term-Memory (LSTM) neural network",
        "authors": "Sonja Jankowfsky, Shuangcai Li, Jose Salinas, Ludovico Nicotina, Arno Hilberts",
        "published": "No Date",
        "citations": 0,
        "abstract": "High lake water level-induced flooding could cause catastrophic property damage and loss of life. The frequency and severity of lake flooding has been increasing in recent years, likely due to climate change . To quantify the lake flooding risk, accurate modeling of lake water level is critical. However, simulation of lake water level is a challenging problem in the field of hydrology, due to the various hydrological and morphological characteristics of river-lake systems. To solve this challenge, Moody's RMS has developed a coupled physical based &#8211; Machine Learning model, using a Long-Short-Term-Memory (LSTM) neural network which incorporates both dynamical variables and static variables . This model is tested and validated with representative lakes in the Southeastern US, and compared with other models including linear, dense, decision tree regression, random forest, and convolution neural network, which demonstrates the reliability and superiority of LSTM in lake water level modeling",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-15212"
    },
    {
        "id": 1535,
        "title": "ProxySense: A novel approach for gas concentration estimation using Long Short-Term Memory Recurrent Neural Network (LSTM-RNN)",
        "authors": "Nwamaka Okafor, Declan Delaney, Ugochukwu Mathew",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>When equipped with a reliable calibration model, Low-Cost Sensor (LCS) can be relied upon as an effective option for gas concentration estimation, providing robust and high spatio-temporal resolution data to replace large-scale analytical instruments. In this paper, we present ProxySense, a rapid and efficient approach for gas concentration estimation. The ProxySense pipeline consists of gas sensing unit made up of array of metal oxide LCS, data pre-processing including an effective approach based on Variatioanl Autoencoders (VAE) for handling missing sensor data and Long Short Term Memory Reccurrent Neural Network (LSTM-RNN) prediction model. We investigate the capability of ProxySense in exploiting the deep characteristics that exist in multi-sensors’ responses to predict the concentration of a gas for which no specific sensor is included in a multi-sensor device. We evaluated ProxySense for benzene (C6H6) and carbon monoxide (CO) concentration predictions and compared the performances to multiple baselines by means of prediction error characterization. We further studied the relationship between model performance and training length and showed ProxySense to be highly accurate for gas concentration prediction even for small number of training period.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.20306418"
    },
    {
        "id": 1536,
        "title": "Rainfall-Runoff modelling using Long-Short-Term-Memory (LSTM) networks",
        "authors": "Frederik Kratzert, Daniel Klotz, Claire Brenner, Karsten Schulz, Mathew Herrnegger",
        "published": "No Date",
        "citations": 11,
        "abstract": "Abstract. Rainfall-runoff modelling is one of the key challenges in the field of hydrology. Various approaches exist, ranging from physically based over conceptual to fully data driven models. In this paper, we propose a novel data driven approach, using the Long-Short-Term-Memory (LSTM) network, a special type of recurrent neural networks. The advantage of the LSTM is its ability to learn long-term dependencies between the provided input and output of the network, which are essential for modelling storage effects in e.g. catchments with snow influence. We use 241 catchments of the freely available CAMELS data set to test our approach and also compare the results to the well-known Sacramento Soil Moisture Accounting Model (SAC-SMA) coupled with the Snow-17 snow routine. We also show the potential of the LSTM as a regional hydrological model, in which one model predicts the discharge for a variety of catchments. In our last experiment, we show the possibility to transfer process understanding, learned at regional scale, to individual catchments and thereby increasing model performance when compared to a LSTM trained only on the data of single catchments. Using this approach, we were able to achieve better model performance as the SAC-SMA + Snow-17, which underlines the potential of the LSTM for hydrological modelling applications.\n                        ",
        "link": "http://dx.doi.org/10.5194/hess-2018-247"
    },
    {
        "id": 1537,
        "title": "Country Interest Analysis Based on Long-Term Short-Term Memory(LSTM) In Decentralized System",
        "authors": "Hojae Son, Anand Paul, Gwanggil Jeon",
        "published": "2018-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw.2018.00023"
    },
    {
        "id": 1538,
        "title": "Finding the Optimum Horizon for Short-Term Solar Irradiance Forecasting Using Long Short-Term Memory (LSTM) Network",
        "authors": "Chibuzor N Obiora, Ahmed Ali, Ali N Hasan",
        "published": "2022-9-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpse56329.2022.9935346"
    },
    {
        "id": 1539,
        "title": "Itsg-Lstm: Inter-Country Trade Similarity Graph-Based Long Short-Term Memory for Port Throughput Prediction",
        "authors": "Wonho Sohn, Suhyeon Kim, Dongcheol Lim, Junghye Lee",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4409872"
    },
    {
        "id": 1540,
        "title": "Long Short-Term Memory (LSTM) Network Applications in Stock Price Prediction",
        "authors": "Kaimao Wang",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390445"
    },
    {
        "id": 1541,
        "title": "Real-Time PPG Signal Conditioning with Long Short-Term Memory (LSTM) Network for Wearable Devices",
        "authors": "Marek Wójcikowski",
        "published": "2021-12-27",
        "citations": 9,
        "abstract": "This paper presents an algorithm for real-time detection of the heart rate measured on a person’s wrist using a wearable device with a photoplethysmographic (PPG) sensor and accelerometer. The proposed algorithm consists of an appropriately trained LSTM network and the Time-Domain Heart Rate (TDHR) algorithm for peak detection in the PPG waveform. The Long Short-Term Memory (LSTM) network uses the signals from the accelerometer to improve the shape of the PPG input signal in a time domain that is distorted by body movements. Multiple variants of the LSTM network have been evaluated, including taking their complexity and computational cost into consideration. Adding the LSTM network caused additional computational effort, but the performance results of the whole algorithm are much better, outperforming the other algorithms from the literature.",
        "link": "http://dx.doi.org/10.3390/s22010164"
    },
    {
        "id": 1542,
        "title": "Gated RNN: The Long Short-Term Memory (LSTM) RNN",
        "authors": "Fathi M. Salem",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-89929-5_4"
    },
    {
        "id": 1543,
        "title": "A comprehensive integrated forecasting approach based on long short-term memory (LSTM)",
        "authors": "Yunjie Wei, Shouyang Wang, Kin Keung Lai",
        "published": "2021-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003141983-8"
    },
    {
        "id": 1544,
        "title": "Using Long Short-Term Memory (LSTM) Recurrent Neural Networks to Classify EEG for Seizure Prediction",
        "authors": "Jordan Chambers, Mark Cook, Anthony Burkitt, David  B. Grayden",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4575830"
    },
    {
        "id": 1545,
        "title": "Long Short-Term Memory (LSTM) Based Deep Learning Models for Predicting Univariate Time Series Data",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijml.2024.14.1.1154"
    },
    {
        "id": 1546,
        "title": "Implementation of Long Short-Term Memory (LSTM) Model for Stress Detection Using EEG Signal",
        "authors": "Ayushi Jain",
        "published": "2019-8-31",
        "citations": 0,
        "abstract": "Stress is a common issue in modern society and can lead to various health problems when left unaddressed. Accurate stress detection is, therefore, crucial in order to provide effective interventions and improve overall well-being. This study presents the implementation of a Long Short-Term Memory (LSTM) model to detect stress using electroencephalogram (EEG) signals. EEG signals were collected from a sample of participants while they were exposed to stress-inducing tasks and control tasks. The data was pre-processed using filtering and artifact removal techniques to ensure high quality and reliability. The pre-processed EEG signals were then used to extract relevant features, such as spectral power and coherence, which served as inputs to the LSTM model. A deep learning architecture was developed, incorporating the LSTM layers and other components to optimize the model's performance. The LSTM model was trained and validated using the available dataset. The results showed that the LSTM model significantly outperformed the other algorithms in terms of accuracy, sensitivity, and specificity. Furthermore, the model demonstrated robustness in detecting stress across various tasks and EEG channels. These findings suggest that LSTM-based models have the potential to be used as effective tools for stress detection in real-life scenarios, and can contribute to the development of more personalized stress management interventions. Future research should focus on refining the model and exploring its applicability in different populations and settings.",
        "link": "http://dx.doi.org/10.17762/itii.v7i2.803"
    },
    {
        "id": 1547,
        "title": "PREDIKSI PARAMETER CUACA MENGGUNAKAN DEEP LEARNING LONG-SHORT TERM MEMORY (LSTM)",
        "authors": "Eko Supriyadi",
        "published": "2021-1-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31172/jmg.v21i2.619"
    },
    {
        "id": 1548,
        "title": "LSTM（Long Short-Term Memory）",
        "authors": "",
        "published": "2018-8-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3156/jsoft.30.4_223_1"
    },
    {
        "id": 1549,
        "title": "Low-Cost Hardware Design Approach for Long Short-Term Memory (LSTM)",
        "authors": "Kasem Khalil, Tamador Mohaidat, Magdy Bayoumi",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscas46773.2023.10182030"
    },
    {
        "id": 1550,
        "title": "Long Short Term Memory Networks (LSTM)-Monte-Carlo Simulation of Surface Ionization using Radon",
        "authors": "Ahmad Muhammed, Fatih Külahcı, Hemn Salh, Pishtiwan Akram Hama Rashid",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nEarthquake events are usually associated with the atmospheric processes modification. Some of the important events in seismic periods include the atmospheric electricity/conductivity modification, which is often related to the ion population in the earthquake preparation area vicinity. Radon, together with cosmic radiation is the major ionization sources in the lower troposphere. The ion-pair production rate is estimated as caused by radon in Erzincan, a city along the North Anatolian Fault Zone, Turkey. Long short term memory and Monte Carlo methods are proposed to account for uncertainty in the estimations and also in the radon data to simulate the ion production rate. The advantage of the LSTM model is taken to study radon anomalies during the M=5 Girlevik earthquake, Erzincan. Radon concentration in Erzincan is found to be very high when compared to other regions, and this might relate to the geological settings of the region. Radon concentration is found to increase prior to the 5.0 Girlevik earthquake. According to estimations, 23×109 ion-pairs m-3s-1 were generated during the earthquake. The ion production estimation rate due to radon and its progeny in Erzincan is at the order of 109 ion-pairs m-3s-1. When added to other ionization sources more pronounced conditions could favor ionospheric perturbations. Ionospheric disturbance simulations would be significant in regions with high radon concentration for understanding atmospheric processes.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-448397/v1"
    },
    {
        "id": 1551,
        "title": "Automatic Composition of Guzheng (Chinese Zither) Music Using Long Short-Term Memory Network (LSTM) and Reinforcement Learning (RL)",
        "authors": "Shuling Chen, Yong Zhong, Ruxu Du",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn recent years, with the advance of Artificial Intelligence, automatic music composition has been demonstrated. However, there are many music genres and music instruments. For a same piece of music, different music instruments would produce different effects. Invented some 2500 years ago, Guzheng is one of the oldest music instruments in China and the world. It has distinct timbres and patterns that cannot be duplicated by other music instruments. Therefore, it is interesting to know whether AI can compose Guzheng music or alike. In this paper we present a method that can automatically compose and play Guzheng music. First, we collect a number of existing Guzheng music pieces and convert them into Music Instrument Digital Interface (MIDI) format. Second, we use these data to train a Long Short-Term Memory (LSTM) network and use the trained network to generate new Guzheng music pieces. Next, we use the Reinforcement Learning (RL) to optimize the LSTM network by adding special Guzheng playing techniques and Guzheng timbre. According to the evaluations from general audiences, our Guzheng music is very close to the real Guzheng music. The presented method can also be used to automatically compose the music of other Chinese music instruments.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1268083/v1"
    },
    {
        "id": 1552,
        "title": "Forecasting Hourly Solar Irradiance Using Long Short-Term Memory (LSTM) Network",
        "authors": "Chibuzor N Obiora, Ahmed Ali, Ali N Hasan",
        "published": "2020-10-29",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/irec48820.2020.9310449"
    },
    {
        "id": 1553,
        "title": "Rancang Bangun Aplikasi Peramalan Jumlah Penumpang Menggunakan Long Short-Term Memory (LSTM)",
        "authors": "Muhammad Davi, Edi Winarko",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Public services such as public transportation are closely related to user satisfaction. Busway DKI Jakarta is one of the first public transportation services in Southeast and South Asia. In order to maintain passenger satisfaction, the management of Busway continues to improve services such as adding buses and opening a new line. Opening a new lane or adding buses must necessarily be adjusted also with the increasing number of passengers. So to know the number of passengers in the future, it is necessary to forecast the number of passengers through existing historical data. The historical data used is time series data from January 2015 to January 2016. The method used in forecasting is Long Short-Term Memory (LSTM), one of the machine learning methods. The method is measured in accuracy using Root Mean Squared Error (RMSE) and Mean Absolute Percentage Error (MAPE). As a comparison of LSTM accuracy in forecasting, we also use the Exponential Smoothing method. Based on the results of forecasting, the most and least dominant method of producing RMSE and MAPE is the LSTM method. Only in corridor 3 LSTM can not provide RMSE and MAPE values below baseline values. While corridor 5 LSTM can give better results after the data transformation process by using exponential smoothing. However, overall the LSTM method provides the best accuracy based on the lowest average RMSE and MAPE values, namely RMSE of 2640.53 and MAPE of 9.14%.",
        "link": "http://dx.doi.org/10.35970/infotekmesin.v14i2.1911"
    },
    {
        "id": 1554,
        "title": "Evolutionary Design of Long Short Term Memory (LSTM) Ensemble",
        "authors": "Ramya Anasseriyil Viswambaran, Gang Chen, Bing Xue, Mohammad Nekooei",
        "published": "2020-12-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci47803.2020.9308393"
    },
    {
        "id": 1555,
        "title": "Well Integrity Operations Experience Transfer Using Long Short-Term Memory (LSTM) Recurrent Neural Network",
        "authors": "David Semwogerere, Alexey Pavlov, Sigbjørn Sangesland",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "Abstract\nWell integrity is critical throughout the lifecycle of a well. During well operations especially for new fields, inexperienced engineers encounter many well integrity challenges which require a fast-learning curve. This ranges from downhole problems such as lost circulation and kicks to equipment damage due to lack of experience during installation, etc. The success of well integrity as a criterion in wells operations therefore heavily depends in the experience of the humans involved. For offshore operations this lack of experience can translate into very expensive consequences in case of loss of well integrity. Damaged equipment, lost time, injury to personnel and contamination of the environment are some of the consequences of blowouts. In oil and gas well construction and service operations petabytes of data in form of logs, reports and other sensor data are generated which contain vast information. By using machine learning and other statistical data analytic techniques on the data, insights on well integrity can be generated.\nWhile yet most well data analytics focuses more on the numerical indicators of well integrity for example pressure, temperature, and casing thickness, text in well integrity reports gives elaborate description on the nature, context and experience applied in well integrity problems encountered. It’s important to transfer this experience in a faster way to the next well operation without laboring through the unstructured data repositories by using advanced text analysis. This smoothens the learning curve for the engineers, saving costs and improving well integrity.\nIn this paper, a language model for experience transfer using the Long Short-Term Memory (LSTM) recurrent neural network that reads well integrity problem description text from a report and classifies it into a root cause is proposed. It is benchmarked against the state-of the art Bidirectional Encoder Representation from Transformer (BERT) model. The pitfalls of current state of the art language models in processing datasets of oil and gas well operations text are discussed using the Volve end of well reports as an example.",
        "link": "http://dx.doi.org/10.1115/omae2023-108149"
    },
    {
        "id": 1556,
        "title": "Forecating Composite Stock Price Index (CSPI) Using Long Short Term Memory (LSTM)",
        "authors": "Intan Elprida Silaban",
        "published": "2022-6-16",
        "citations": 0,
        "abstract": "The Composite Stock Price Index (CSPI) is an index that displays developments the whole movement of the company's share price in the stock market which refers to the Indonesia Stock Exchange (IDX). Before considering investment, investors can predict the Indonesian stock market is up and down by CSPI analysis. The main objective of this research is to propose forecasting model of CSPI using Long Short Term Memory (LSTM). The performance of LSTM model measured by Root Mean Square Error (RMSE). The results showed that the best LSTM models is model with number of neuron in hidden layer and epoch (iterations) were 10 and 10, respectively. The RMSE values achieved from the LSTM models for testing data is 0,0633. Visually, the prediction graph is almost similar with original data.",
        "link": "http://dx.doi.org/10.24114/j-ids.v1i1.38571"
    },
    {
        "id": 1557,
        "title": "Long Short-Term Memory Neural Network (LSTM-NN) for Aquifer Level Time Series Forecasting Using in-Situ Piezometric Observations",
        "authors": "Ryan Solgi, Hugo A. Loaiciga, Mark Kram",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10506314.2"
    },
    {
        "id": 1558,
        "title": "Power Demand Forecasting using Long Short-Term Memory (LSTM) Deep-Learning Model for Monitoring Energy Sustainability",
        "authors": " Choi,  Cho,  Kim",
        "published": "2020-2-4",
        "citations": 32,
        "abstract": "The purpose of this study is to design a novel custom power demand forecasting algorithm based on the LSTM Deep-Learning method regarding the recent power demand patterns. We performed tests to verify the error rates of the forecasting module, and to confirm the sudden change of power patterns in the actual power demand monitoring system. We collected the power usage data in every five-minute resolution in a day from some groups of the residential, public offices, hospitals, and industrial factories buildings in one year. In order to grasp the external factors and to predict the power demand of each facility, a comparative experiment was conducted in three ways; short-term, long-term, seasonal forecasting exp[eriments. The seasonal patterns of power demand usages were analyzed regarding the residential building. The overall error rates of power demand forecasting using the proposed LSTM module were reduced in terms of each facility. The predicted power demand data shows a certain pattern according to each facility. Especially, the forecasting difference of the residential seasonal forecasting pattern in summer and winter was very different from other seasons. It is possible to reduce unnecessary demand management costs by the designed accurate forecasting method.",
        "link": "http://dx.doi.org/10.3390/su12031109"
    },
    {
        "id": 1559,
        "title": "Recurrent Neural Network (RNN), Long short-term memory (LSTM) for Aerosol Optical Depth (AOD) using NASA’s MERRA-2 Reanalysis",
        "authors": "Mohammed Magooda, Mohamed Eltahan, Karim Moharm",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/essoar.10503933.1"
    },
    {
        "id": 1560,
        "title": "Financial Time Series Prediction Under COVID-19 Pandemic Crisis with Long Short-Term Memory (LSTM) Network",
        "authors": "Mourad Mroua, Ahlem Lamine",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4242252"
    },
    {
        "id": 1561,
        "title": "Simplified gating in long short-term memory (LSTM) recurrent neural networks",
        "authors": "Yuzhen Lu, Fathi M. Salem",
        "published": "2017-8",
        "citations": 25,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mwscas.2017.8053244"
    },
    {
        "id": 1562,
        "title": "Understanding Long Short-Term Memory LSTM Models  in IBM SPSS Statistics",
        "authors": "",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46632/jitl/2/1/3"
    },
    {
        "id": 1563,
        "title": "A Study on Forecasting the Producer Price of Farmed Korean Rockfish Using Deep Learning Models －Focusing on LSTM(Long-short Term Memory) and GRU(Gated Recurrent Units) Models－",
        "authors": "Ga-hyun Lee, Do-hoon Kim",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47085/kjfme.39.4.2"
    },
    {
        "id": 1564,
        "title": "Prediction of Sunspot Activity Cycle Based on Long Short-Term Memory (LSTM) Network Models",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25236/ajcis.2023.061325"
    },
    {
        "id": 1565,
        "title": "Prediction of Depression from EEG Signal Using Long Short Term Memory(LSTM)",
        "authors": "S.Dhananjay Kumar, DP Subha",
        "published": "2019-4",
        "citations": 49,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoei.2019.8862560"
    },
    {
        "id": 1566,
        "title": "Fuel Moisture Content Forecasting Using Long Short-Term Memory(LSTM) Model",
        "authors": "Zhenyu Kang, Miao Jiao, Zijie Zhou",
        "published": "2022-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/igarss46834.2022.9883168"
    },
    {
        "id": 1567,
        "title": "Hate Speech Text Classification Using Long Short-Term Memory (LSTM)",
        "authors": "Suminar Ariwibowo, Abba Suganda Girsang,  Diana",
        "published": "2022-10-19",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosnikom56551.2022.10034908"
    },
    {
        "id": 1568,
        "title": "Two-Stage Genetic Algorithm for Designing Long Short Term Memory (LSTM) Ensembles",
        "authors": "Ramya Anasseriyil Viswambaran, Gang Chen, Bing Xue, Mohammad Nekooei",
        "published": "2021-6-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cec45853.2021.9504788"
    },
    {
        "id": 1569,
        "title": "PREDIKSI TINGKAT TEMPERATUR KOTA SEMARANG   MENGGUNAKAN METODE LONG SHORT-TERM MEMORY (LSTM)",
        "authors": "Rahmatul Akbar, Rukun Santoso, Budi Warsito",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "Temperature is one of the most important attributes of climate, temperature affects life in many different ways such as in agriculture, aviation, energy, and life in general. Temperatur prediction is needed to make the right step to prevent the negative impact of climate change. Long Short-Term Memory (LSTM) is the method that can predict time series data, using unique design of neural network, LSTM can help to prevent vanishing gradient from happening which allows us to use more data from the past to predict the future. Hyperparameters like LSTM unit, epochs, and batch size are used to make the best model, the best model is the one with the lowest loss function. This research used climate data from 1 January 2019 until 31 December 2021 consist of 1096 data in total. The best prediction in this research is made by the model with 1 hidden layer, 64 LSTM units, 8 batch sizes, and 400 epochs with the lowest loss function 0.012769, this model give MAPE value of 1.97325 % and RMSE value of 0.683.",
        "link": "http://dx.doi.org/10.14710/j.gauss.11.4.572-579"
    },
    {
        "id": 1570,
        "title": "Forecasting salmon market volatility using long short-term memory (LSTM)",
        "authors": "Mikaella Zitti",
        "published": "2023-9-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/13657305.2023.2255346"
    },
    {
        "id": 1571,
        "title": "Leap-LSTM: Enhancing Long Short-Term Memory for Text Categorization",
        "authors": "Ting Huang, Gehui Shen, Zhi-Hong Deng",
        "published": "2019-8",
        "citations": 12,
        "abstract": "Recurrent Neural Networks (RNNs) are widely used in the field of natural language processing (NLP), ranging from text categorization to question answering and machine translation. However, RNNs generally read the whole text from beginning to end or vice versa sometimes, which makes it inefficient to process long texts. When reading a long document for a categorization task, such as topic categorization, large quantities of words are irrelevant and can be skipped. To this end, we propose  Leap-LSTM, an LSTM-enhanced model which dynamically leaps between words while reading texts. \nAt each step, we utilize several feature encoders to extract messages from preceding texts, following texts and the current word, and then determine whether to skip the current word. We evaluate Leap-LSTM on several text categorization tasks: sentiment analysis, news categorization, ontology classification and topic classification, with five benchmark data sets. The experimental results show that our model reads faster and predicts better than standard LSTM. Compared to previous models which can also skip words, our model achieves better trade-offs between performance and efficiency.",
        "link": "http://dx.doi.org/10.24963/ijcai.2019/697"
    },
    {
        "id": 1572,
        "title": "Production Forecasting in Tight Gas Reservoirs Using Long Short-Term Memory Methods (LSTM)",
        "authors": "Afrah Qoqandi, Omar Alfaleh, Moemen Ramadan, Uchenna Odi",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "AbstractForecasting the estimated ultimate recovery (EUR) for extremely tight gas sites with long-term transient behaviors is not an easy task. Because older, more established methods used to predict wells with these characteristics have shown important limitations, researchers have relied on new techniques, like long short-term memory (LSTM) deep learning methods. This study assesses the performance of LSTM estimations, compared to that of a physics-based reservoir simulation process.With the goal of obtaining reliable EUR forecasts, unconventional tight gas reservoir data is generated via simulation and analyzed with LSTM deep learning techniques, tailored for sequential data. Simultaneously, a reservoir simulation model that is based on the same data is generated for comparison purposes. The LSTM forecasting model has the added benefit of considering operational interventions in the well, so that the machine learning (ML) framework is not disrupted by interferences that do not reflect the actual physics of the production mechanism on well behavior.The comparison of the data-driven LSTM deep learning model and the physics-based reservoir simulation model estimations was performed using the latter framework as a benchmark. Findings show that the AI-assisted LSTM model provides predictions similarly accurate to the ones estimated by the physics-based reservoir model, but with the added capability for long-term forecasting. These data-driven EUR models show great promise when analyzing unusually tight gas reservoirs that feature time series well information, which can improve estimations about recovery and point engineers towards better decisions regarding the future of reservoirs. Therefore, exploring deep learning methods featuring varying types of artificial neural networks in greater detail has the potential to significantly benefit the oil and gas sector.When compared to other machine learning methods, novel deep learning techniques have advantages that remain underexplored in the literature. This paper helps fill this gap by providing a valuable comparison between older prediction methods and new estimation simulations based on neural networks that can predict long-term behaviors.",
        "link": "http://dx.doi.org/10.2118/213343-ms"
    },
    {
        "id": 1573,
        "title": "Air Pollution Prediction Using Long Short-Term Memory (LSTM) and Deep Autoencoder (DAE) Models",
        "authors": "Thanongsak Xayasouk, HwaMin Lee, Giyeol Lee",
        "published": "2020-3-24",
        "citations": 107,
        "abstract": "Many countries worldwide have poor air quality due to the emission of particulate matter (i.e., PM10 and PM2.5), which has led to concerns about human health impacts in urban areas. In this study, we developed models to predict fine PM concentrations using long short-term memory (LSTM) and deep autoencoder (DAE) methods, and compared the model results in terms of root mean square error (RMSE). We applied the models to hourly air quality data from 25 stations in Seoul, South Korea, for the period from 1 January 2015, to 31 December 2018. Fine PM concentrations were predicted for the 10 days following this period, at an optimal learning rate of 0.01 for 100 epochs with batch sizes of 32 for LSTM model, and DAEs model performed best with batch size 64. The proposed models effectively predicted fine PM concentrations, with the LSTM model showing slightly better performance. With our forecasting model, it is possible to give reliable fine dust prediction information for the area where the user is located.",
        "link": "http://dx.doi.org/10.3390/su12062570"
    },
    {
        "id": 1574,
        "title": "Performance of Three Slim Variants of The Long Short-Term Memory (LSTM) Layer",
        "authors": "Daniel Kent, Fathi Salem",
        "published": "2019-8",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mwscas.2019.8885035"
    },
    {
        "id": 1575,
        "title": "Predicting Style Factor Returns and Group/sector Returns Using Long and Short-term Memory ('LSTM') Deep Learning Neural Networks",
        "authors": "Sanele Makamo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4542403"
    },
    {
        "id": 1576,
        "title": "Economic Nowcasting with Long Short-Term Memory Artificial Neural Networks (LSTM)",
        "authors": "Daniel Hopp",
        "published": "2022-9-1",
        "citations": 2,
        "abstract": "Abstract\nArtificial neural networks (ANNs) have been the catalyst to numerous advances in a variety of fields and disciplines in recent years. Their impact on economics, however, has been comparatively muted. One type of ANN, the long short-term memory network (LSTM), is particularly well-suited to deal with economic time-series. Here, the architecture’s performance and characteristics are evaluated in comparison with the dynamic factor model (DFM), currently a popular choice in the field of economic nowcasting. LSTMs are found to produce superior results to DFMs in the nowcasting of three separate variables; global merchandise export values and volumes, and global services exports. Further advantages include their ability to handle large numbers of input features in a variety of time frequencies. A disadvantage is the stochastic nature of outputs, common to all ANNs. In order to facilitate continued applied research of the methodology by avoiding the need for any knowledge of deep-learning libraries, an accompanying Python (Hopp 2021a) library was developed using PyTorch. The library is also available in R, MATLAB, and Julia.",
        "link": "http://dx.doi.org/10.2478/jos-2022-0037"
    },
    {
        "id": 1577,
        "title": "Long short-term memory (LSTM) deep neural networks for sentiment classification",
        "authors": "Bharatendra Rai",
        "published": "2022-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9783110734652-001"
    },
    {
        "id": 1578,
        "title": "Forecasting Crude Oil Prices Using Improved Deep Belief Network (IDBN) and Long-Term Short-Term Memory Network (LSTM)",
        "authors": "Mohammad Mahdi Lotfi Heravi, Mahsa Khorrampanah, Monireh Houshmand",
        "published": "2022-5-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icee55646.2022.9827452"
    },
    {
        "id": 1579,
        "title": "Uzun Kısa Süre Bellek (LSTM) ile Toprak Sıcaklığının Tahmini",
        "authors": "Orhan İNİK, Özkan İNİK, Taşkın ÖZTAŞ, Alaaddin YUKSEL",
        "published": "2022-7-23",
        "citations": 1,
        "abstract": "Soil temperature not only affects many soil properties, but also has a significant effect on plant development. Knowing and correct estimation of soil temperature is important for both soil management and crop production. The accuracy of temperature forecasts is very important, especially for the countries that stand out with their agriculture-based economies. Therefore, in recent years, different artificial intelligence methods have been used in soil temperature predictions. Deep learning methods lead the way in achieving high prediction accuracy. In this study, a Long Short-Term Memory (LSTM) network, which is a deep learning (DL) sub-architecture, is proposed to create an effective model for soil temperature prediction. The data used in the study are the daily soil temperatures at a depth of 50 cm for the years 2013-2021 of Bingöl province. For the training of the proposed LSTM model, 89% of the data set within the scope of the study was used, and. The remaining 11% was estimated by the model for assessing model success. The RMSE value as a result of the estimation made by the trained LSTM model was obtained as 1,25. The high estimation accuracy of the proposed model showed that this model could be successfully applied in temperature data estimation studies.",
        "link": "http://dx.doi.org/10.30910/turkjans.1101753"
    },
    {
        "id": 1580,
        "title": "A cascaded long short-term memory (LSTM) driven generic visual question answering (VQA)",
        "authors": "Iqbal Chowdhury, Kien Nguyen, Clinton Fookes, Sridha Sridharan",
        "published": "2017-9",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2017.8296600"
    },
    {
        "id": 1581,
        "title": "Weather Prediction using Long Short Term Memory (LSTM) model",
        "authors": "Koduru Nitesh, Yanamala Abhiram, Rayapudi Krishna Teja, S. Kavitha",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icssit55814.2023.10061039"
    },
    {
        "id": 1582,
        "title": "Pengujian Long-Short Term Memory (LSTM) Pada Prediksi Trafik Lalu Lintas Menggunakan Multi Server",
        "authors": "Riesa Krisna Astuti Sakir",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "This study presents a test of the long short term memory (LSTM) algorithm on traffic prediction with multi edge server and cloud server architectures. IoT sensors located on the roadside such as cameras and location data on each driver are used and stored in the data center. When a driver sends a travel time request to a nearby edge server, traffic predictions will be made on the edge server or cloud server. Server selection is made based on the destination location of the driver's request. If the destination is in the edge server area, traffic predictions are made on the edge server. However, if the destination is in the cloud server area, traffic predictions are made on the cloud server. Then to predict traffic traffic is done with LSTM. following modeling is made with a density of 128 and a density of 256. By learning from previous traffic, LSTM with a greater density gets a proportion of errors, namely RMSE 10.78%, MAE 8.24%, and MAPE 19.87%. ",
        "link": "http://dx.doi.org/10.31963/elekterika.v20i1.4242"
    },
    {
        "id": 1583,
        "title": "Seminal Stacked Long Short-Term Memory (SS-LSTM) Model for Forecasting Particulate Matter (PM2.5 and PM10)",
        "authors": "Narendran Sobanapuram Muruganandam, Umamakeswari Arumugam",
        "published": "2022-10-20",
        "citations": 4,
        "abstract": "With increased industrialization and urbanization, sustainable smart environments are becoming more concerned with particulate matter (PM) forecasts that are based on artificial intelligence (AI) techniques. The intercorrelation between multiple pollutant components and the extremely volatile PM pattern changes are the key impediments to effective prediction. For accurate PM forecasting with the benefit of federated learning, a new architecture incorporating seminal stacked long short-term memory networks (SS-LSTM) is presented in this research. The historical data are analyzed using SS-LSTM to reveal the location-aware behavior of PM, and a new prediction model is generated that takes into account the most prevalent pollutants and weather conditions. The stacking of LSTM units adds hierarchical levels of knowledge that help to tune the forecast model with the most appropriate weighting to the external features that contribute toward PM. The suggested SS-LSTM model is compared with traditional machine learning approaches and deep learning models to see how well it performs in predicting PM2.5 and PM10. The suggested strategy outperforms all other models tested in experiments carried out for the data collected from Delhi in India.",
        "link": "http://dx.doi.org/10.3390/atmos13101726"
    },
    {
        "id": 1584,
        "title": "Stock Index Forecasting Using Stacked Long Short-Term Memory (LSTM)",
        "authors": "Debasmita Pal, Partha Pratim Deb",
        "published": "2022-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003279044-7"
    },
    {
        "id": 1585,
        "title": "Using Long Short-Term Memory (LSTM) networks with the toy model concept for compressible pulsatile flow metering",
        "authors": "Indranil Brahma",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.measurement.2023.113782"
    },
    {
        "id": 1586,
        "title": "PI-LSTM: Physics-informed long short-term memory network for structural response modeling",
        "authors": "Fangyu Liu, Junlin Li, Linbing Wang",
        "published": "2023-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2023.116500"
    },
    {
        "id": 1587,
        "title": "Vehicle Detection and Classification Based on Distributed Acoustic Sensing with Long Short-Term Memory (Lstm)",
        "authors": "Cabrel Wouladje, Golden  Tendekai Mumanikidzwa, Xu Shijie, Wei Yi, Yu Xia, Shen Jianguo",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4739403"
    },
    {
        "id": 1588,
        "title": "HST-LSTM: A Hierarchical Spatial-Temporal Long-Short Term Memory Network for Location Prediction",
        "authors": "Dejiang Kong, Fei Wu",
        "published": "2018-7",
        "citations": 126,
        "abstract": "The widely use of positioning technology has made mining the movements of people feasible and plenty of trajectory data have been accumulated. How to efficiently leverage these data for location prediction has become an increasingly popular research topic as it is fundamental to location-based services (LBS). The existing methods often focus either on long time (days or months) visit prediction (i.e., the recommendation of point of interest) or on real time location prediction (i.e., trajectory prediction). In this paper, we are interested in the location prediction problem in a weak real time condition and aim to predict users' movement in next minutes or hours. We propose a Spatial-Temporal Long-Short Term Memory (ST-LSTM) model which naturally combines spatial-temporal influence into LSTM to mitigate the problem of data sparsity. Further, we employ a hierarchical extension of the proposed ST-LSTM (HST-LSTM) in an encoder-decoder manner which models the contextual historic visit information in order to boost the prediction performance. The proposed HST-LSTM is evaluated on a real world trajectory data set and the experimental results demonstrate the effectiveness of the proposed model.",
        "link": "http://dx.doi.org/10.24963/ijcai.2018/324"
    },
    {
        "id": 1589,
        "title": "Predicting Stock Market Movements Using Long Short-Term Memory (LSTM)",
        "authors": "Achmad Fauzan, Maria SusanAnggreainy, Nicholas Nathaniel, Afdhal Kurniawan",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aidas60501.2023.10284713"
    },
    {
        "id": 1590,
        "title": "Soil Moisture Estimation From Smap Observations Using Long Short- Term Memory (LSTM)",
        "authors": "Ali Ben Abbes, Ramata Magagi, Kalifa Goita",
        "published": "2019-7",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/igarss.2019.8898418"
    },
    {
        "id": 1591,
        "title": "Long Short-Term Memory (LSTM) Estimation of Chair Reaction Force during Sit-to-Stand Movements",
        "authors": "Naoto Otomori, Asuka Takai",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/iccas59377.2023.10317053"
    },
    {
        "id": 1592,
        "title": "Prediction of Atmospheric Air Temperature Using Long Short-Term Memory (Lstm) Recurrent Neural Network",
        "authors": "Arif Ozbek, Aliihsan Sekertekin, Mehmet Bilgili, Niyazi Arslan",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3571403"
    },
    {
        "id": 1593,
        "title": "Fundamentals of Recurrent Neural Network (RNN) and Long Short-Term Memory (LSTM) network",
        "authors": "Alex Sherstinsky",
        "published": "2020-3",
        "citations": 1897,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.physd.2019.132306"
    },
    {
        "id": 1594,
        "title": "Prediction of Atmospheric Air Temperature Using Long Short-Term Memory (Lstm) Recurrent Neural Network",
        "authors": "Arif Ozbek, Aliihsan Sekertekin, Mehmet Bilgili, Niyazi Arslan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3980616"
    },
    {
        "id": 1595,
        "title": "Prediksi Belanja Pemerintah Indonesia Menggunakan Long Short-Term Memory (LSTM)",
        "authors": " Sabar Sautomo,  Hilman Ferdinandus Pardede",
        "published": "2021-2-20",
        "citations": 0,
        "abstract": "Abstract \r\nEstimates of government expenditure for the next period are very important in the government, for instance for the Ministry of Finance of the Republic of Indonesia, because this can be taken into consideration in making policies regarding how much money the government should bear and whether there is sufficient availability of funds to finance it. As is the case in the health, education and social fields, modeling technology in machine learning is expected to be applied in the financial sector in government, namely in making modeling for spending predictions. In this study, it is proposed the application of Long Short-Term Memory (LSTM) Model for expenditure predictions. Experiments show that LSTM model using three hidden layers and the appropriate hyperparameters can produce Mean Square Error (MSE) performance of 0.2325, Root Mean Square Error (RMSE) of 0.4820, Mean Average Error (MAE) of 0.3292 and Mean Everage Presentage Error (MAPE) of 0.4214. This is better than conventional modeling using the Auto Regressive Integrated Moving Average (ARIMA) as a comparison model.",
        "link": "http://dx.doi.org/10.29207/resti.v5i1.2815"
    },
    {
        "id": 1596,
        "title": "A Reversible-Logic Based Architecture for Long Short-Term Memory (LSTM) Network",
        "authors": "Kasem Khalil, Bappaditya Dey, Ashok Kumar, Magdy Bayoumi",
        "published": "2021-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscas51556.2021.9401395"
    },
    {
        "id": 1597,
        "title": "LSTM-PSO: Long Short-Term Memory Ship Motion Prediction Based on Particle Swarm Optimization",
        "authors": "Yuxin Yao, Liang Han, Jiangyun Wang",
        "published": "2018-8",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gncc42960.2018.9018688"
    },
    {
        "id": 1598,
        "title": "Remaining useful life (RUL) regression using Long–Short Term Memory (LSTM) networks",
        "authors": "Sofia Yousuf, Salman A. Khan, Saqib Khursheed",
        "published": "2022-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.microrel.2022.114772"
    },
    {
        "id": 1599,
        "title": "Long Short Term Memory (LSTM) based Deep Learning for Sentiment Analysis of English and Spanish Data",
        "authors": "Baidya Nath Saha, Apurbalal Senapati",
        "published": "2020-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/compe49325.2020.9200054"
    },
    {
        "id": 1600,
        "title": "Emotional Text Classification Using TF-IDF (Term Frequency-Inverse Document Frequency) And LSTM (Long Short-Term Memory)",
        "authors": "Muhammad Ibnu Alfarizi, Lailis Syafaah, Merinda Lestandy",
        "published": "2022-11-14",
        "citations": 2,
        "abstract": "Humans in carrying out communication activities can express their feelings either verbally or non-verbally. Verbal communication can be in the form of oral or written communication. A person's feelings or emotions can usually be seen by their behavior, tone of voice, and expression. Not everyone can see emotion only through writing, whether in the form of words, sentences, or paragraphs. Therefore, a classification system is needed to help someone determine the emotions contained in a piece of writing. The novelty of this study is a development of previous research using a similar method, namely LSTM but improved on the word weighting process using the TF-IDF method as a further process of LSTM classification. The method proposed in this research is called Natural Language Processing (NLP). The purpose of this study was to compare the classification method with the LSTM (Long Short-Term Memory) model by adding the word weighting TF-IDF (Term Frequency–Inverse Document Frequency) and the LinearSVC model, as well to increase accuracy in determining an emotion (sadness, anger, fear, love, joy, and surprise) contained in the text. The dataset used is 18000, which is divided into 16000 training data and 2000 test data with 6 classifications of emotion classes, namely sadness, anger, fear, love, joy, and surprise. The results of the classification accuracy of emotions using the LSTM method yielded a 97.50% accuracy while using the LinearSVC method resulted in an accuracy value of 89%.",
        "link": "http://dx.doi.org/10.30595/juita.v10i2.13262"
    }
]