[
    {
        "id": 4505,
        "title": "Towards Poisoning of Federated Support Vector Machines with Data Poisoning Attacks",
        "authors": "Israt Mouri, Muhammad Ridowan, Muhammad Adnan",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011825800003488"
    },
    {
        "id": 4506,
        "title": "Fault Detection in Aircraft Flight Control Actuators Using Support Vector Machines",
        "authors": "Julianne Grehan, Dmitry Ignatyev, Argyrios Zolotas",
        "published": "2023-2-2",
        "citations": 2,
        "abstract": "Future generations of flight control systems, such as those for unmanned autonomous vehicles (UAVs), are likely to be more adaptive and intelligent to cope with the extra safety and reliability requirements due to pilotless operations. An efficient fault detection and isolation (FDI) system is paramount and should be capable of monitoring the health status of an aircraft. Historically, hardware redundancy techniques have been used to detect faults. However, duplicating the actuators in an UAV is not ideal due to the high cost and large mass of additional components. Fortunately, aircraft actuator faults can also be detected using analytical redundancy techniques. In this study, a data-driven algorithm using Support Vector Machine (SVM) is designed. The aircraft actuator fault investigated is the loss-of-effectiveness (LOE) fault. The aim of the fault detection algorithm is to classify the feature vector data into a nominal or faulty class based on the health of the actuator. The results show that the SVM algorithm detects the LOE fault almost instantly, with an average accuracy of 99%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11020211"
    },
    {
        "id": 4507,
        "title": "Predicting Coronary Artery Disease Utilizing Support Vector Machines: Optimizing Predictive Model",
        "authors": "",
        "published": "2023-3-25",
        "citations": 0,
        "abstract": "In the medical field, specialists aspire through the use of artificial intelligence to obtain accuracy in the results and details of patients. Such as automatic detection and prediction of diseases and obtaining medical results by applying artificial intelligence techniques such as machine learning algorithms to clinical data. Therefore, because coronary artery disease (CAD) is one of the most prevalent types of diseases in the world and with the highest rate of injuries, one of the machine learning algorithms will be used in this research to diagnose this disease through artificial intelligence. Patient clinical factors were used, a data set of 303 people. The Support Vector Machine (SVM) algorithm is used and applied to the clinical factors of patients, which are 56 variables, as they are considered one of the most important clinical factors that can be used to detect CAD. This algorithm is considered to have good predictive ability in medical clinical characteristics. The Support Vector Machine algorithm model, which was used in this research, provided the highest prediction accuracy of (96.7%), with an AUC value of (71.5%). This indicates the effectiveness of the SVM algorithm in classifying the clinical patient data set that was adopted in this research. After applying it to the research data set, the SVM algorithm showed its ability to classify and predict well. The accuracy of the algorithm model was (96.7%). This indicates that this algorithm can help cardiologists in different ways during their daily practices to predict coronary artery disease, which is one of the most common heart diseases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/mjaih/2023/004"
    },
    {
        "id": 4508,
        "title": "Least Squares Minimum Class Variance Support Vector Machines",
        "authors": "Michalis Panayides, Andreas Artemiou",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "In this paper, we propose a Support Vector Machine (SVM)-type algorithm, which is statistically faster among other common algorithms in the family of SVM algorithms. The new algorithm uses distributional information of each class and, therefore, combines the benefits of using the class variance in the optimization with the least squares approach, which gives an analytic solution to the minimization problem and, therefore, is computationally efficient. We demonstrate an important property of the algorithm which allows us to address the inversion of a singular matrix in the solution. We also demonstrate through real data experiments that we improve on the computational time without losing any of the accuracy when compared to previously proposed algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers13020034"
    },
    {
        "id": 4509,
        "title": "Adiabatic Quantum Support Vector Machines",
        "authors": "Dong Jun Woun, Prasanna Date",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10250"
    },
    {
        "id": 4510,
        "title": "Support Vector Machines for Evaluating the Impact of the Forward Osmosis Membrane Characteristics on the Rejection of the Organic Molecules",
        "authors": "Fouad Kratbi, Yamina Ammi, Salah Hanini",
        "published": "2023-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15255/kui.2022.081"
    },
    {
        "id": 4511,
        "title": "The complexity of quantum support vector machines",
        "authors": "Gian Gentinetta, Arne Thomsen, David Sutter, Stefan Woerner",
        "published": "2024-1-11",
        "citations": 4,
        "abstract": "Quantum support vector machines employ quantum circuits to define the kernel function. It has been shown that this approach offers a provable exponential speedup compared to any known classical algorithm for certain data sets. The training of such models corresponds to solving a convex optimization problem either via its primal or dual formulation. Due to the probabilistic nature of quantum mechanics, the training algorithms are affected by statistical uncertainty, which has a major impact on their complexity. We show that the dual problem can be solved in O(M4.67/&#x03B5;2) quantum circuit evaluations, where M denotes the size of the data set and &#x03B5; the solution accuracy compared to the ideal result from exact expectation values, which is only obtainable in theory. We prove under an empirically motivated assumption that the kernelized primal problem can alternatively be solved in O(min{M2/&#x03B5;6,1/&#x03B5;10}) evaluations by employing a generalization of a known classical algorithm called Pegasos. Accompanying empirical results demonstrate these analytical complexities to be essentially tight. In addition, we investigate a variational approximation to quantum support vector machines and show that their heuristic training achieves considerably better scaling in our experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2024-01-11-1225"
    },
    {
        "id": 4512,
        "title": "Wear Parameter Diagnostics of Industrial Milling Machine with Support Vector Regression",
        "authors": "Teemu Mäkiaho, Henri Vainio, Kari T. Koskinen",
        "published": "2023-3-17",
        "citations": 3,
        "abstract": "Modern industrial machine applications often contain data collection functions through automation systems or external sensors. Yet, while the different data collection mechanisms might be effortless to construct, it is advised to have a well-balanced consideration of the possible data inputs based on the machine characteristics, usage, and operational environment. Prior consideration of the collected data parameters reduces the risk of excessive data, yet another challenge remains to distinguish meaningful features significant for the purpose. This research illustrates a peripheral milling machine data collection and data pre-processing approach to diagnose significant machine parameters relevant to milling blade wear. The experiences gained from this research encourage conducting pre-categorisation of data significant for the purpose, those being manual setup data, programmable logic controller (PLC) automation system data, calculated parameters, and measured parameters under this study. Further, the results from the raw data pre-processing phase performed with Pearson Correlation Coefficient and permutation feature importance methods indicate that the most dominant correlation to recognised wear characteristics in the case machine context is perceived with vibration excitation monitoring. The root mean square (RMS) vibration signal is further predicted by using the support vector regression (SVR) algorithm to test the SVR’s overall suitability for the asset’s health index (HI) approximation. It was found that the SVR algorithm has sufficient data parameter behaviour forecast capabilities to be used in the peripheral milling machine prognostic process and its development. The SVR with Gaussian radial basis function (RBF) kernel receives the highest scoring metrics; therefore, outperforming the linear and polynomial kernels compared as part of the study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11030395"
    },
    {
        "id": 4513,
        "title": "Support subsets estimation for support vector machines retraining",
        "authors": "Víctor Aceña, Isaac Martín de Diego, Rubén R． Fernández, Javier M． Moguerza",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109117"
    },
    {
        "id": 4514,
        "title": "EEG-based Stress Detection using DEAP Dataset and Support Vector Machines",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/6-3-673"
    },
    {
        "id": 4515,
        "title": "Training Minimal Complexity Support Vector Machines with Multiple Kernels",
        "authors": "Shigeo Abe",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394217"
    },
    {
        "id": 4516,
        "title": "Support Vector Machines: Spherical Separability: Limitations of Learning",
        "authors": "Garimella Ramamurthy, Tata Jagannadha Swamy",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci58599.2023.10331068"
    },
    {
        "id": 4517,
        "title": "Efficient Image Registration Using Support Vector Machines",
        "authors": "Sachin Goswami, Anu Sharma, Prerna Mahajan",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470766"
    },
    {
        "id": 4518,
        "title": "On neural quantum support vector machines",
        "authors": "Lars Simon, Manuel Radons",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00140-9"
    },
    {
        "id": 4519,
        "title": "A Review on Low Complex Blind Video Quality Predictor based on Support Vector Machines",
        "authors": "Amitesh Kumar Singam",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4511324"
    },
    {
        "id": 4520,
        "title": "Hybrid Quantum Technologies for Quantum Support Vector Machines",
        "authors": "Filippo Orazi, Simone Gasperini, Stefano Lodi, Claudio Sartori",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "Quantum computing has rapidly gained prominence for its unprecedented computational efficiency in solving specific problems when compared to classical computing counterparts. This surge in attention is particularly pronounced in the realm of quantum machine learning (QML) following a classical trend. Here we start with a comprehensive overview of the current state-of-the-art in Quantum Support Vector Machines (QSVMs). Subsequently, we analyze the limitations inherent in both annealing and gate-based techniques. To address these identified weaknesses, we propose a novel hybrid methodology that integrates aspects of both techniques, thereby mitigating several individual drawbacks while keeping the advantages. We provide a detailed presentation of the two components of our hybrid models, accompanied by the presentation of experimental results that corroborate the efficacy of the proposed architecture. These results pave the way for a more integrated paradigm in quantum machine learning and quantum computing at large, transcending traditional compartmentalization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info15020072"
    },
    {
        "id": 4521,
        "title": "A Wireless Sensor Networks in Localization Using Support Vector Machines",
        "authors": "Ansh Kataria",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442265"
    },
    {
        "id": 4522,
        "title": "Enhancing handwritten numeric string recognition through incremental support vector machines",
        "authors": "Rani Kurnia Putri, Muhammad Athoillah",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "Handwritten digit recognition systems are integral to diverse applications such as postal services, banking, and document processing in our digitally-driven society. This research addresses the challenges posed by evolving datasets and dynamic scenarios in handwritten digit recognition by proposing an approach based on incremental support vector machines (ISVM). ISVM is an extension of traditional support vector machines (SVM) designed to handle scenarios where new data points become available over time. The dataset includes handwritten images (numbers “0” to “6”) and trials introducing new classes (“7”, “8”, and “9”). Evaluation utilizes k-fold cross-validation for robustness. Digital image processing involves converting images into numeric data using the histogram method. The result showed the positive outcomes of using ISVM in handwritten digit recognition, emphasizing its adaptability to incremental learning and its ability to maintain robust performance in the face of evolving datasets, which is crucial for real-world applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59400/jam.v2i1.373"
    },
    {
        "id": 4523,
        "title": "Gearbox Fault Diagnosis Based on Refined Time-Shift Multiscale Reverse Dispersion Entropy and Optimised Support Vector Machine",
        "authors": "Xiang Wang, Han Jiang",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "The fault diagnosis of a gearbox is crucial to ensure its safe operation. Entropy has become a common tool for measuring the complexity of time series. However, entropy bias may occur when the data are not long enough or the scale becomes larger. This paper proposes a gearbox fault diagnosis method based on Refined Time-Shifted Multiscale Reverse Dispersion Entropy (RTSMRDE), t-distributed Stochastic Neighbour Embedding (t-SNE), and the Sparrow Search Algorithm Support Vector Machine (SSA-SVM). First, the proposed RTSMRDE was used to calculate the multiscale fault features. By incorporating the refined time-shift method into Multiscale Reverse Dispersion Entropy (MRDE), errors that arose during the processing of complex time series could be effectively reduced. Second, the t-SNE algorithm was utilized to extract sensitive features from the multiscale, high-dimensional fault features. Finally, the low-dimensional feature matrix was input into SSA-SVM for fault diagnosis. Two gearbox experiments showed that the diagnostic model proposed in this paper had an accuracy rate of 100%, and the proposed model performed better than other methods in terms of diagnostic performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11060646"
    },
    {
        "id": 4524,
        "title": "Mapping of impervious surfaces with the use of remote sensing imagery: Support Vector Machines classification and GIS-based approach",
        "authors": "",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/ace.2023.146071"
    },
    {
        "id": 4525,
        "title": "Automated Oral Cancer Detection using Convolutional Neural Networks and Support Vector Machines",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-ijanser.582"
    },
    {
        "id": 4526,
        "title": "Advancing Support Vector Machines for Automated Medical Image Diagnosis",
        "authors": "Ajay Agrawal, Rupal Gupta, N.R Solomon Jebaraj",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470696"
    },
    {
        "id": 4527,
        "title": "Evaluate the performance of the support vector machines ensemble",
        "authors": "Bowen Liu, Yihui Qiu",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671159"
    },
    {
        "id": 4528,
        "title": "A Novel Ensemble of Support Vector Machines for Improving Medical Data Classification",
        "authors": "Phuoc Hai Huynh, Van Hoa Nguyen",
        "published": "2023-2-15",
        "citations": 1,
        "abstract": "In recent years, the increasing volume and availability of healthcare and biomedical data are opening up new opportunities for computational methods to enhance healthcare in many hospitals. Medical data classification is regarded as the challenging task to develop intelligent medical decision support systems in hospitals. In this paper, the ensemble approaches based on support vector machines are proposed for classifying medical data. This research’s key contribution is that the ensemble multiple support vector machines use the function kernel in the style of gradient boosting and bagging to produce a more accurate fusion model than the mono-modality models. Extensive experiments have been conducted on forty benchmark medical datasets from the University of California at Irvine machine learning repository. The classification results show that there is a statistically significant difference (p-values < 0.05) between the proposed approaches and the best classification models. In addition, the empirical analysis of forty medical datasets indicated that our models can predict diseases with an accuracy rate of 82.82 and 81.76 percent without feature selection in the preprocessing data stage.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4028/p-h0cef4"
    },
    {
        "id": 4529,
        "title": "Research on Vegetable Incoming and Pricing Strategies Based on Support Vector Machines and Gray Prediction Models",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/infse.2023.041018"
    },
    {
        "id": 4530,
        "title": "Developing Support Vector Machines for Accurate Medical Image Analysis",
        "authors": "Feon Jaison, Viiay Kumar Pandey, Ashish Bishnoi",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470551"
    },
    {
        "id": 4531,
        "title": "Shilling Attack Detection with One Class Support Vector Machines",
        "authors": "Halil İbrahim AYAZ, Zehra KAMIŞLI ÖZTÜRK",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Öneri sistemleri çeşitli çevrimiçi platformlarda hayati bir rol oynar ve kullanıcıların tercihlerini göz önünde bulundurarak yeni ürünler, hizmetler ve içerikler keşfetmelerine yardımcı olur. Bununla birlikte, bu sistemler, kötü niyetli kullanıcıların derecelendirmeleri yapay olarak şişirdiği veya söndürdüğü ve önyargılı önerilere yol açtığı şilin saldırıları yoluyla manipülasyona karşı savunmasızdır. Bu saldırıları araştırmanın, anlamanın ve hafifletmenin önemini vurgulamak çok önemlidir. Bu tür saldırıları tespit etmek, tavsiye sistemlerinin bütünlüğünü ve etkinliğini korumak için çok önemlidir. Literatürde, şilin saldırılarını tespit etmek için birçok çalışma sunulmuştur. En iyi bilinen kümeleme yöntemleri farklı saldırı modelleri için uyarlanmıştır. Bu makalede, şilin saldırılarını tespit etmek için gürbüz bir teknik olarak Tek Sınıflı Destek Vektör Makineleri kullanımını araştırıyoruz. Tek Sınıflı Destek Vektör Makinaları, öncelikle anomali tespiti ve aykırılık tespiti görevleri için tasarlanmış geleneksel Destek Vektör Makinelerinin özel bir çeşididir. Önerilen yöntemi doğrulamak için MovieLens100K veri kümesi kullanılmıştır. Sonuç olarak, farklı boyut ve doluluk oranlı saldırılar için hassasiyet ve geri çağırma değerleri verilmiştir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47112/neufmbd.2023.22"
    },
    {
        "id": 4532,
        "title": "Multi-Class Support Vector Machines for Text Classification Using a Class-Incremental Learni",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/7-2-547"
    },
    {
        "id": 4533,
        "title": "COMPARISON OF SUPPORT VECTOR MACHINES AND CLASSIFICATION AND REGRESSION TREE CLASSIFIERS ON THE IRIS DATA SET",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "The classification problem is the most applicable today; its implementations are face recognition, data grouping, and color classification. The primary objective of this study will be to address this last problem; that is to say: We will prove that it is possible to classify flowers using the well-known Iris data set made up of 150 samples with 4 attributes and 3 classes to identify. The novel idea in this study is the implementation of two different algorithms widely used for their high efficiency and simplicity: support vector machines and decision trees. This will lead us to observe how close both algorithms are from the viewpoint of the precision results that are high enough, in tune with the purpose of this study is high enough (very precise), and will be the problem to be solved, the one that finally determines the choice of the algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35741/issn.0258-2724.58.2.59"
    },
    {
        "id": 4534,
        "title": "One-class Support Vector Machines for Real-time and Unsupervised Condition Monitoring of Rotary Machines",
        "authors": "Alexandre Henrique Pereira Tavares, Aldemir Ap Cavalini Jr, Antonio Veiga, C. Nataraj, Amirhassan Abbasi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26678/abcm.cobem2023.cob2023-1929"
    },
    {
        "id": 4535,
        "title": "Optimizing Parameters of Support Vector Machines Using an Enhanced Whale Optimization Algorithm",
        "authors": "Yang Wenzhuo, Liu Shuo",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/epce58798.2023.00034"
    },
    {
        "id": 4536,
        "title": "Research on Glass Classification and Recognition based on Support Vector Machines",
        "authors": "Shimeng Guo, Jinwei Gan",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "Glass artefacts undergo weathering and a significant exchange of internal elements due to burial in the ground. In order to classify the glass types, Principal Component Analysis was used to transform the existing chemical indicators into a small number of principal components. Subsequently, Support Vector Machine approach was used to classify the glass types to be predicted based on the selected principal components. K-means clustering algorithm was then used to classify the two glass types into subclasses on the basis of the selected chemical components and to perform sensitivity analysis. Using this model, the glass types of the samples to be tested can be identified.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v40i.6601"
    },
    {
        "id": 4537,
        "title": "Investigating Support Vector Machines for Time Series Predictions in Wireless Networks",
        "authors": " Haripriya, Ajay Agrawal, Pavan Kumar Singh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470554"
    },
    {
        "id": 4538,
        "title": "A Hybrid Approach for Medical Image Classification using Support Vector Machines and Artificial Neural Networks",
        "authors": "Uma. N",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276063"
    },
    {
        "id": 4539,
        "title": "Density-convoluted tensor support vector machines",
        "authors": "Boxiang Wang, Le Zhou, Jian Yang, Qing Mai",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4310/23-sii796"
    },
    {
        "id": 4540,
        "title": "Tuning Support Vector Machines and Boosted Trees Using Optimization Algorithms",
        "authors": "Jill F. Lundell",
        "published": "2023",
        "citations": 0,
        "abstract": "Statistical learning methods have been growing in popularity in recent years. Many of these procedures have parameters that must be tuned for models to perform well. Research has been extensive in neural networks, but not for many other learning methods. We looked at the behavior of tuning parameters for support vector machines, gradient boosting machines, and adaboost in both a classification and regression setting. We used grid search to identify ranges of tuning parameters where good models can be found across many different datasets. We then explored different optimization algorithms to select a model across the tuning parameter space. Models selected by the optimization algorithm were compared to the best models obtained through grid search to select well performing algorithms. This information was used to create an R package, EZtune, that automatically tunes support vector machines and boosted trees.",
        "keywords": "",
        "link": "http://dx.doi.org/10.6339/23-jds1106"
    },
    {
        "id": 4541,
        "title": "Impact Performance Prediction and Optimization of a Circumferentially Corrugated Tube with Variable Wall Thickness Using Support Vector Machine",
        "authors": "Zhixiang Li, Chengxing Yang, Shuguang Yao",
        "published": "2023-2-2",
        "citations": 2,
        "abstract": "Based on the hypothesis that multi-corner and multi-cell structures can effectively improve energy absorption behavior, this paper designed a multi-cell circumferentially corrugated tube (MCCT) for energy absorption. The MCCT was designed as a variable thickness form to study the influence of the materials distribution on the cross section on energy absorption. The energy absorption performance of the MCCT was investigated under impact condition with finite element simulation validated by a drop hammer test. Support vector machine, a machine learning technique, was used to predict the energy absorption performance and was further used for optimization of the MCCT. The results show that under the same mass, the MCCT with variable decreasing wall thickness (corners thicker than other regions) shows 4.81%, 30.67% and 37.70% improvement, respectively, in PCF, SEA and CFE, compared to the MCCT with variable increasing wall thickness (corners thinner than other regions). Moreover, the optimization results show that most samples in Pareto front lie in the region of tc > tm. These results all indicate that the MCCT with variable decreasing wall thickness performs better than with increasing wall thickness with regards energy absorption. In conclusion, arranging more materials in the corner element area can effectively improve the energy absorption characteristics of the thin-walled tube. This paper highlights the importance of designing thin-walled tubes as multi-corner and variable thickness configurations for energy absorption.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11020217"
    },
    {
        "id": 4542,
        "title": "Research on Yield Prediction Technology for Aerospace Engine Production Lines Based on Convolutional Neural Networks-Improved Support Vector Regression",
        "authors": "Hongjun Liu, Boyuan Li, Chang Liu, Mengqi Zu, Minhao Lin",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Improving the prediction accuracy of aerospace engine production line yields is of significant importance for enhancing production efficiency and optimizing production scheduling in enterprises. To address this, a novel method called Convolutional Neural Networks-Improved Support Vector Regression (CNN-ISVR) has been proposed for predicting the production line yield of aerospace engines. The method first divides the factors influencing production line yield into production cycle and real-time status information of the production line and then analyzes the key feature factors. To solve the problem of poor prediction performance in traditional SVR models due to the subjective selection of kernel function parameters, an improved SVR model is presented. This approach combines the elite strategy genetic algorithm with the hyperparameter optimization method based on grid search and cross-validation to obtain the best penalty factor and kernel function width of the Radial Basis Function (RBF) kernel function. The extracted features of production data are then used for prediction by inputting them into the improved support vector regression model, based on a shallow CNN without dimensionality reduction. Finally, the prediction accuracy of the CNN-ISVR model is evaluated using the three commonly used evaluation metrics: Mean Absolute Percentage Error (MAPE), Root Mean Square Error (RMSE) and coefficient of determination (R2). The model’s prediction results are then compared to those of other models. The CNN-ISVR hybrid model is shown to outperform other models in terms of prediction accuracy and generalization ability, demonstrating the effectiveness of the proposed model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11090875"
    },
    {
        "id": 4543,
        "title": "Optimal Parameters Selection of Support Vector Machines Using Bat Algorithm",
        "authors": "Adis Alihodzic, Eva Tuba, Milan Tuba",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10252635"
    },
    {
        "id": 4544,
        "title": "Intuitionistic fuzzy multi-view support vector machines with universum data",
        "authors": "Chunling Lou, Xijiong Xie",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-05260-6"
    },
    {
        "id": 4545,
        "title": "Research of Forecasting Method of Lung Cancer Based on Machine Learning and Support Vector Machines",
        "authors": "Gou Zixuan",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10442213"
    },
    {
        "id": 4546,
        "title": "Comparing Support Vector Machines and Neural Networks for Cardiac Arrest Risk Prediction",
        "authors": "Abhishek Chaudhary, Gunjan Agrawal, Manish Saraswat, Rakesh Kumar",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489397"
    },
    {
        "id": 4547,
        "title": "Improving Computational Performance of Least Squares Multiple Birth Support Vector Machines with k-Means Clustering",
        "authors": "Güvenç Arslan, Nisa Nur Bülbül",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36287/setsci.6.1.010"
    },
    {
        "id": 4548,
        "title": "A framework for enterprise assessment of carbon performance using support vector machines",
        "authors": "Yijun Shou",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09406-z"
    },
    {
        "id": 4549,
        "title": "Enhancing quantum support vector machines through variational kernel training",
        "authors": "N. Innan, M.A.Z. Khan, B. Panda, M. Bennai",
        "published": "2023-10-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-04138-3"
    },
    {
        "id": 4550,
        "title": "Utilizing support vector machines for predictive analytics in chronic kidney diseases",
        "authors": "A.S. Shanthakumari, R. Jayakarthik",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2021.04.309"
    },
    {
        "id": 4551,
        "title": "Optical Surface Analysis with Support Vector Machines based on Two Different Measurement Techniques",
        "authors": "Marcin Hinz, Jannis Pietruschka, Stefan Bracke",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3850/978-981-18-8071-1_p409-cd"
    },
    {
        "id": 4552,
        "title": "An Error-Pursuing Adaptive Uncertainty Analysis Method Based on Bayesian Support Vector Regression",
        "authors": "Sheng-Tong Zhou, Jian Jiang, Jian-Min Zhou, Pei-Han Chen, Qian Xiao",
        "published": "2023-2-4",
        "citations": 0,
        "abstract": "The Bayesian support vector regression (BSVR) metamodel is widely used in various engineering fields to analyze the uncertainty arising from uncertain parameters. However, the accuracy of the BSVR metamodel based on the traditional one-shot sampling method fails to meet the requirements of the uncertainty analysis of complex systems. To this end, an error-pursing adaptive uncertainty analysis method based on the BSVR metamodel is presented by combining a new adaptive sampling scheme. This new sampling scheme was improved by a new error-pursuing active learning function that is named, herein, adjusted mean square error (AMSE), which guides the adaptive sampling of the BSVR metamodel’s design of experiments (DoE). During the sampling process, AMSE combines mean square error and leave-one-out cross-validation error to estimate the prediction error of the metamodel in the entire design space. Stepwise refinement of the metamodel was achieved by placing the sampled regions at locations with large prediction errors. Six benchmark analytical functions featuring different dimensions were used to validate the proposed method. The effectiveness of the method was then further illustrated by a more realistic application of an overhung rotor system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11020228"
    },
    {
        "id": 4553,
        "title": "Support vector machines implementation over integers modulo-M and Residue Number System",
        "authors": "Sergio Andrés Arenas-Hoyos, Álvaro Bernal-Noreña",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "In low-power hardware implementations for classification algorithms, it is often essential to use physical resources efficiently. In this sense, the use of modulo-M integer operations instead of floating-point arithmetic, can lead to better performance, especially when M represents the dynamic range of an arithmetic block of the Residue Number System (RNS) [1,2]. Following this premise, this work is aiming to provide a methodology for implementing a classifier, specifically a Support Vector Machine (SVM) [3], using modulo-M integers and proposing a method for the use of Residue Number System.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15446/dyna.v90n226.107112"
    },
    {
        "id": 4554,
        "title": "Revolutionizing Rice Disease Diagnosis: A Fusionof Convolutional Neural Networks and Support Vector Machines",
        "authors": "Arshleen Kaur, Vinay Kukreja, Deepak Banerjee, Dibyahash Bordoloi",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235197"
    },
    {
        "id": 4555,
        "title": "Prediction of Ship Maintenance Cost by Support Vector Machines Based on Bayesian Optimization",
        "authors": "Wenjun Ye, Guoping Jiang",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icftic59930.2023.10455871"
    },
    {
        "id": 4556,
        "title": "Differentiating dreaming and waking reports with automatic text analysis and Support Vector Machines",
        "authors": "Xiaofang Zheng, Richard Schweickert",
        "published": "2023-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.concog.2022.103439"
    },
    {
        "id": 4557,
        "title": "Particle Swarm Optimization Based Support Vector Machines in Motion Imagery",
        "authors": "Hongmin Wang, Xuewen Shi, Rui Wang, Zhaoning Wang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiim60438.2023.10441303"
    },
    {
        "id": 4558,
        "title": "Development and Application of Convergence Education about a Support Vector Machines for Elementary Learners",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55463/hkjss.issn.1021-3619.60.75"
    },
    {
        "id": 4559,
        "title": "DIABETES PREDICTION USING SUPPORT VECTOR MACHINES",
        "authors": " N. Srividhya,  K. Divya,  N. Sanjana,  K. Krishna Kumari,  M. Rambhupal",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "One of the worst illnesses in the world is diabetes. It is also the creator of a variety of other diseases, such as urinary organ illness, blindness, and cardiac failure. The patient must go to a diagnostic facility in this situation to receive their reports following consultation. Because of this, they always have to invest both money and time. However, as machine learning techniques have improved, we now have the freedom to look for the right solution. For example, we now have sophisticated information processing systems that can predict whether a patient has polygenic disease or not. Additionally, anticipating the illness early results in giving the patients what they need before it becomes urgent.Goals of this analysis is to develop a system which predicts the diabetes risk level of patient.The experimental results shows that the prediction of diabetes done at high accuracy using support vector machines.\nKEYWORDS: Early Detection, Machine Learning, SVM(Support Vector Machines), Accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36713/epra14769"
    },
    {
        "id": 4560,
        "title": "Deep Learning Meets Support Vector Machines: An Effective Hybrid Model for Banana Leaf Wilt Disease Severity Assessment",
        "authors": "Manish Kumar, Anuj Kumar",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489081"
    },
    {
        "id": 4561,
        "title": "K-means and Support Vector Machines for Thai Language IT News Retrieval System",
        "authors": "Weenawadee Muangon, Sunee Pongpinigpinyo, Panyanat Aunpong",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsm60247.2023.00016"
    },
    {
        "id": 4562,
        "title": "Analysis of Sentimental on Twitter using Content Aware Support Vector Machines",
        "authors": "B Manikandan, T. Krishna Kumar",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icses60034.2023.10465302"
    },
    {
        "id": 4563,
        "title": "Prediction of Clients Based on Google Analytics Income Using Support Vector Machines",
        "authors": "Erika Severeyn, Alexandra La Cruz, Mónica Huerta, Roberto Matute, Juan Estrada",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/c358072.2023.10436245"
    },
    {
        "id": 4564,
        "title": "Retracted: Differentially Private Singular Value Decomposition for Training Support Vector Machines",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9760375"
    },
    {
        "id": 4565,
        "title": "Optimization of Support Vector Machines for Prediction of Parkinson’s Disease",
        "authors": "Turgut Özseven, Zübeyir Şükrü Özkorucu",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Abstract\nAs in all fields, technological developments have started to be used in the field of medical diagnosis, and computer-aided diagnosis systems have started to assist physicians in their diagnosis. The success of computer-aided diagnosis methods depends on the method used; dataset, pre-processing, post-processing, etc. differ according to the processes. In this study, parameter optimization of support vector machines was performed with four different methods currently used in the literature to assist the physician in diagnosis. The success of each method was tested on two different Parkinson’s datasets and the results were compared within themselves and with the literature. According to the results obtained, the highest accuracy rates vary depending on the dataset and optimization method. While Improved Chaotic Particle Swarm Optimization achieved high success in the first dataset, Bat Algorithm achieved higher success in the other dataset. While the successful results obtained are better than some studies in the literature, they are at a level that can compete with some studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/msr-2023-0001"
    },
    {
        "id": 4566,
        "title": "Lung Cancer Detection: A Classification Approach Utilizing Oversampling and Support Vector Machines",
        "authors": "Adolfo Jara-Gavilanes, Vladimir Robles-Bykbaev",
        "published": "2023-12-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-02432-6"
    },
    {
        "id": 4567,
        "title": "Fault Diagnosis Strategy of Four-Switch Buck-Boost Converter Based on Support Vector Machines",
        "authors": "Xueqi Liu, Xin Zhang, Kexin Hu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciea58696.2023.10241809"
    },
    {
        "id": 4568,
        "title": "Comparison of Support Vector Machines and ShuffleNet for Detection of Rice Species",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/icriret.1378"
    },
    {
        "id": 4569,
        "title": "Enhancing Human Expression Classification using Local Binary Patterns and Support Vector Machines with RBF Kernel in Convolutional Neural Networks",
        "authors": "Rushil Patel, Ritesh Ajoodha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4663400"
    },
    {
        "id": 4570,
        "title": "Enhancing Personalization and Privacy Management with Support Vector Machines in High Dense Cloud Networks",
        "authors": "Ramkumar Krishnamoorthy, Swati Singh, Swati Gupta",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470492"
    },
    {
        "id": 4571,
        "title": "Predicting Stock Price Using Random Forest Algorithm and Support Vector Machines Algorithm",
        "authors": "C.M. Shih, K. C. Yang, W.P. Chao",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieem58616.2023.10406964"
    },
    {
        "id": 4572,
        "title": "Differentially Private Support Vector Machines with Knowledge Aggregation",
        "authors": "Teng Wang, Yao Zhang, Jiangguo Liang, Shuai Wang, Shuanggen Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2024.048115"
    },
    {
        "id": 4573,
        "title": "Transductive Support Vector Machines (TSVM) With Hybrid Recurrent Neural Networks For Medical Image Filtering",
        "authors": "Ravi Kumar",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ihcsp56702.2023.10127184"
    },
    {
        "id": 4574,
        "title": "Enhanced Text Emotion Prediction Algorithm: A Comparative Study with Support Vector Machines for Emotion Prediction in Text",
        "authors": "",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets42842"
    },
    {
        "id": 4575,
        "title": "Improved Service Quality Assessment Through the Integration of Principal Component Analysis and Support Vector Machines",
        "authors": "Feng Xiafei, Huang Fuli",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263572"
    },
    {
        "id": 4576,
        "title": "Employee Engagement Prediction: A Comparative Study of Support Vector Machines and Neural Networks",
        "authors": "Shalini S,  Venkatesh",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iitcee59897.2024.10468031"
    },
    {
        "id": 4577,
        "title": "Improved Support Vector Machine for Voiceprint Diagnosis of Typical Faults in Power Transformers",
        "authors": "Jianxin Wang, Zhishan Zhao, Jun Zhu, Xin Li, Fan Dong, Shuting Wan",
        "published": "2023-5-10",
        "citations": 3,
        "abstract": "The traditional power transformer diagnosis method relies on a lot of experience knowledge and a complex sampling process, which brings great difficulties to the fault diagnosis work. To solve this problem, a fault feature extraction method based on fully adaptive noise set empirical mode decomposition (CEEMDAN) is proposed, and the hunter–prey optimization (HPO) algorithm is used to optimize the support vector machine (SVM) to identify and classify the voice print faults of power transformers. Firstly, the CEEMDAN algorithm is used to decompose the voicemarks into several IMF components. IMF components containing fault information are selected according to the envelope kurtosis index and reconstructed to generate new signal sequences. PCA dimensionality reduction is performed on the reconstructed signal, and the principal components are extracted with a high cumulative contribution rate as input to SVM. Then, the HPO-SVM algorithm is used to classify and identify transformer faults. Apply the proposed method to the diagnosis of typical faults in power transformers. The results show that the accuracy of this method in identifying various fault states of power transformers can reach 98.5%, and it has better classification performance than other similar methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11050539"
    },
    {
        "id": 4578,
        "title": "Musical Genre Classification Using Support Vector Machines and Convolutional Neural Networks",
        "authors": "Tharun R Ragav, Divya B, Kavitha A",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccmla58983.2023.10346701"
    },
    {
        "id": 4579,
        "title": "Hyperparameter Tuning of Support Vector Machines for Wind Turbine Detection Using Drones",
        "authors": "Jordan Miller, Colton Seegmiller, Mohammad A.S. Masoum, Mohammad Shekaramiz, Abdennour C. Seibi",
        "published": "2023-5-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ietc57902.2023.10152252"
    },
    {
        "id": 4580,
        "title": "Support Vector Machines Application for Prediction of Binding Elements",
        "authors": "Kingshuk Das Bakshi, N. Balakrishnan, Earli. Manemma, S.Janu Priya, Bhasker Pant, P.Anantha Christu Raj",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.074"
    },
    {
        "id": 4581,
        "title": "Robust Detection of Chronic Lymphocytic Leukemia with Support Vector Machines and Flow Cytometry",
        "authors": "Barış BORAL",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Abstract\r\nAim:  Our aim is to build a precise automatic tool for the diagnosis of CLL with the help of machine learning algorithms and flow cytometry immunophenotypic data.\r\nMethods: We run experiments with two machine learning methods. First one is decision tree which was previously used in other similar works and second one is support vector machines which is considered to be a more robust classification method.\r\nResults : Among the 40 CLL patients from the test set, the model correctly predicts 38 of them and among the 20 other B-CLPD patients, the model predicts 18 of them correctly. Its sensitivity, which is the fraction of true positive predictions among all positive samples, is 95% (38/40).\r\nConclusion : The model achieves very high accuracies on our leave out test set. This model can be a useful tool for automatic CLL diagnosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36516/jocass.1342711"
    },
    {
        "id": 4582,
        "title": "Parameter selection of Gaussian kernel for cost-sensitive support vector machines in imbalanced data classification",
        "authors": "Yu Zhao, Nan Wang",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvidl58838.2023.10166009"
    },
    {
        "id": 4583,
        "title": "Hybridizing Convolutional Neural Networks and Support Vector Machines for Mango Ripeness Classification",
        "authors": "Raj Gaurang Tiwari, Ankit Kumar Rai",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetsis61505.2024.10459360"
    },
    {
        "id": 4584,
        "title": "Non-Profiled Semi-Supervised Horizontal Attack Against Elliptic Curve Scalar Multiplication Using Support Vector Machines",
        "authors": "Marcin Aftowicz, Ievgen Kabin, Zoya Dyka, Peter Langendörfer",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsd60849.2023.00101"
    },
    {
        "id": 4585,
        "title": "Retracted: Design of a Regional Economic Forecasting Model Using Optimal Nonlinear Support Vector Machines",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9763031"
    },
    {
        "id": 4586,
        "title": "A novel twin-support vector machines method for binary classification to imbalanced data",
        "authors": "Jingyi Li, Shiwei Chao",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "Most existing classifiers are better at identifying majority classes instead of ignoring minority classes, which leads to classifier degradation. Therefore, it is a challenge for binary classification to imbalanced data, to address this, this paper proposes a novel twin-support vector machine method. The thought is that majority classes and minority classes are found by two support vector machines, respectively. The new kernel is derived to promote the learning ability of the two support vector machines. Results show that the proposed method wins over competing methods in classification performance and the ability to find minority classes. Those classifiers based-twin architectures have more advantages than those classifiers based-single architecture in classification ability. We demonstrate that the complexity of imbalanced data distribution has negative effects on classification results, whereas, the advanced classification results and the desired boundaries can be gained by optimizing the kernel.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-222501"
    },
    {
        "id": 4587,
        "title": "Classification of colon cancer patients into consensus molecular subtypes using support vector machines",
        "authors": "Necla Koçhan, Baris Emre Dayanc",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55730/1300-0152.2675"
    },
    {
        "id": 4588,
        "title": "A study on using two-stage multiple support vector machines to forecast medium-term electricity market prices",
        "authors": "Jiabei zhang",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3026885"
    },
    {
        "id": 4589,
        "title": "Multicycle disassembly-based decomposition algorithm to train multiclass support vector machines",
        "authors": "Tong Gao, Hao Chen",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109479"
    },
    {
        "id": 4590,
        "title": "Classifying Aircraft using Velocity Data with Support Vector Machines and Likelihood Ratio Tests",
        "authors": "Logan Dihel, Chester Dolph, Henry T. Holbrook, Sandip Roy",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-0898"
    },
    {
        "id": 4591,
        "title": "Optimizing Convolutional Neural Networks and Support Vector Machines for Spinach Disease Detection: A Hyperparameter Tuning Study",
        "authors": "Ankita Suryavanshi, Vinay Kukreja, Ayush Dogra",
        "published": "2023-10-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353280"
    },
    {
        "id": 4592,
        "title": "Sentiment Analysis of Flood Disaster Management in Jakarta on Twitter Using Support Vector Machines",
        "authors": "M Amiruddin Saddam, Erno Kurniawan Dewantara, Achmad Solichin",
        "published": "2023-1-6",
        "citations": 2,
        "abstract": "Floods can cause negative impacts in various aspects, starting from economic, social, to health aspects. Even quoted from the site gis.bnpb.go.id, during 2022, there have been 1031 cases of flood disasters in Indonesia. Meanwhile in Jakarta, in 2022 there have been 14 cases of floods that caused hundreds of people to lose their homes. Several approaches can be taken to determine public opinion about flooding, one of which is text mining with an analysis of community sentiment. Sentiment analysis aims to determine public opinion regarding flood management in the capital city of Jakarta based on positive, neutral, and negative categories. To get the public sentiment, researchers carried out several stages, including the preprocessing stage. After obtaining public sentiment regarding flood management through the preprocessing stage, then classification is carried out based on public opinion so that it can be used by related parties for evaluation material in flood handling. In this study, the classification method used is the SVM method which is one of the supervised learning methods in machine learning. After classification, the next stage is the testing process using the K-Fold Cross Validation method. From the various sentiments obtained from Twitter data, it can be concluded that there are around 414 positive sentiments and 2464 negative sentiments related to flood handling in DKI Jakarta, while the results obtained from the test results show that the accuracy reaches 88.6%, the precision reaches 88.6% and recall reached 89.4%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i1.12063"
    },
    {
        "id": 4593,
        "title": "Data generation using geometrical edge probability for one-class support vector machines",
        "authors": "Geonseok Lee, Pilwon Woo, Kichun Lee",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120387"
    },
    {
        "id": 4594,
        "title": "PERBANDINGAN KINERJA METODE KLASIFIKASI  K-NEAREST NEIGHBOR DAN SUPPORT VECTOR MACHINES PADA DATASET PARKINSON",
        "authors": "Wahyu Anwar Ridho, Triastuti Wuryandari, Arief Rachman Hakim",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "The government program in the form of social assistance (bansos) is part of the effort to improve the welfare of the community and ensure basic needs and improve the standard of living of the recipients. However, there are often cases of mistargeting of social assistance programs by the government. Improper data management and Data Terpadu Kesejahteraan Sosial (DTKS) which are not used as the cause of the distribution of social assistance are not well targeted. The data can be analyzed using the classification method to determine whether or not the family accepts the ban from the government. This study classifies the SUSENAS data by comparing K-Nearest Neighbor (KNN) and Support Vector Machines (SVM). The advantage of the KNN method lies in the level of accuracy to solve problems with large data while the SVM method has better performance in various fields of application such as bioinformacs, handwriting recognition, text classification and so on. Based on training data and testing data comparison 85%:15% showed that KNN method had a better classification performance than the SVM method. The accuracy value of KNN method is 80,95% higher than the accuracy value of SVM method is 78,79%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14710/j.gauss.12.3.372-381"
    },
    {
        "id": 4595,
        "title": "Sparse optimization via vector k-norm and DC programming with an application to feature selection for support vector machines",
        "authors": "Manlio Gaudioso, Giovanni Giallombardo, Giovanna Miglionico",
        "published": "2023-11",
        "citations": 1,
        "abstract": "AbstractSparse optimization is about finding minimizers of functions characterized by a number of nonzero components as small as possible, such paradigm being of great practical relevance in Machine Learning, particularly in classification approaches based on support vector machines. By exploiting some properties of the k-norm of a vector, namely, of the sum of its k largest absolute-value components, we formulate a sparse optimization problem as a mixed-integer nonlinear program, whose continuous relaxation is equivalent to the unconstrained minimization of a difference-of-convex function. The approach is applied to Feature Selection in the support vector machine framework, and tested on a set of benchmark instances. Numerical comparisons against both the standard $$\\ell _1$$\n\nℓ\n1\n\n-based support vector machine and a simple version of the Slope method are presented, that demonstrate the effectiveness of our approach in achieving high sparsity level of the solutions without impairing test-correctness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10589-023-00506-y"
    },
    {
        "id": 4596,
        "title": "A distance-based kernel for classification via Support Vector Machines",
        "authors": "Nazhir Amaya-Tejera, Margarita Gamarra, Jorge I. Vélez, Eduardo Zurek",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Support Vector Machines (SVMs) are a type of supervised machine learning algorithm widely used for classification tasks. In contrast to traditional methods that split the data into separate training and testing sets, here we propose an innovative approach where subsets of the original data are randomly selected to train the model multiple times. This iterative training process aims to identify a representative data subset, leading to improved inferences about the population. Additionally, we introduce a novel distance-based kernel specifically designed for binary-type features based on a similarity matrix that efficiently handles both binary and multi-class classification problems. Computational experiments on publicly available datasets of varying sizes demonstrate that our proposed method significantly outperforms existing approaches in terms of classification accuracy. Furthermore, the distance-based kernel achieves superior performance compared to other well-known kernels from the literature and those used in previous studies on the same datasets. These findings validate the effectiveness of our proposed classification method and distance-based kernel for SVMs. By leveraging random subset selection and a unique kernel design, we achieve notable improvements in classification accuracy. These results have significant implications for diverse classification problems in Machine Learning and data analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frai.2024.1287875"
    },
    {
        "id": 4597,
        "title": "PERBANDINGAN ALGORITMA  SUPPORT VECTOR MACHINES (SVM) DAN NEURAL NETWORK UNTUK KLASIFIKASI PENYAKIT JANTUNG",
        "authors": "Muhammad Dion Febrian Tino,  Herliyani Hasanah,  Tri Djoko Santosa",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "Jantung merupakan salah satu organ terpenting yang ada pada tubuh manusia. Dengan ada nya jantung, darah dapat tersalurkan keseluruh tubuh dengan baik. diperlukannya sebuah pola klasifikasi penyakit jantung. Klasifikasi yang digunakan yaitu dengan metode Support Vector Machines (SVM) dan Neural Net kinerja yang sangat baik. Pada dataset ini memiliki total 416 instance. Confusion Matrix algoritma SVM terdapat 36 + 34 prediksi yang benar dan 7 + 7 prediksi yang salah. Confusion Matrix algoritma Neural Network terdapat 164 + 180 prediksi yang benar dan 41 + 33 prediksi yang salah. Algoritma SVM memiliki tingakat accuracy lebih tinggi dibandingkan algoritma Neural Net. Yang berisi nilai pada AUC 0.833, CA 0.83, F1 0.835, Precision 0.835 dan Recall 0.835.Berdasarkan hasil penelitian pada kedua algoritma, bahwa algoritma SVM dapat menyelesaikan masalah klasifikasi penyakit jantung lebih baik dengan nilai akurasi 83% sedangkan pada algoritma Neural Net memiliki nilai akurasi 82% dalam menyelesaikan penyakit jantung.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31949/infotech.v9i1.5432"
    },
    {
        "id": 4598,
        "title": "A Graph Classification Method Based on Support Vector Machines and Locality-Sensitive Hashing",
        "authors": "María D. Gonzalez-Lima, Carenne C. Ludeña, Gibran G. Otazo-Sanchez",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3356572"
    },
    {
        "id": 4599,
        "title": "A structural model of teachers’ teaching competencies based on multimodal affective features of support vector machines",
        "authors": "Wenting Xiong, Xin Lai",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nBased on big data technology, this paper first proposes to study and analyze the structural model of teachers’ teaching ability based on multimodal sentiment features of support vector machines. Then the Mel inverse spectral coefficients, wavelet packet coefficients, Fourier coefficient features, dynamic features, and global features are extracted respectively, and the features are dimensionalized using linear support vector machine and Lagrangian function, and the dimensionalized feature parameters are sent to the classifier for emotion recognition. Finally, the structural model evaluation index system of teachers’ teaching ability is constructed, and the current teaching ability development of college teachers in a province is studied and analyzed from two perspectives of teachers’ self-assessment and students’ evaluation based on multimodal emotional features of support vector machine. The results showed that in terms of teaching ability dimensions, teachers had the highest expectation of their teaching ability (4.38) in each dimension, followed in order by teachers’ self-evaluation of teaching ability (4.15), students’ expectation (4.05), and students’ evaluation of teachers’ teaching ability (3.56) was the lowest. This study reveals that teachers’ perceptions of the teaching competencies they should have are biased, and their awareness of self-development is insufficient from the emotional characteristics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns.2023.2.00201"
    },
    {
        "id": 4600,
        "title": "An In-Depth Analysis of Robustness to Noise in Soft Margin Support Vector Machines",
        "authors": "Vinit Kumar, Sanyam Shukla, Dr. Manasi Gyanchandani",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs61402.2024.10482315"
    },
    {
        "id": 4601,
        "title": "Support vector machines within a bivariate mixed-integer linear programming framework",
        "authors": "John Alasdair Warwicker, Steffen Rebennack",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122998"
    },
    {
        "id": 4602,
        "title": "Predict the Quality of Freshwater using Support Vector Machines",
        "authors": "Sriram S., Santhiya S., Rajeshkumar G., Gayathri S., Vijaya K., Rajesh Kanna P.",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaaic56838.2023.10140956"
    },
    {
        "id": 4603,
        "title": "Breast mass density categorisation using deep transferred EfficientNet with support vector machines",
        "authors": "Ankita Patra, Santi Kumari Behera, Prabira Kumar Sethy, Nalini Kanta Barpanda",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18507-2"
    },
    {
        "id": 4604,
        "title": "Optimizing support vector machines and autoregressive integrated moving average methods for heart rate variability data correction",
        "authors": "Jakob Svane, Tomasz Wiktorski, Stein Ørn, Trygve Christian Eftestøl",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mex.2023.102381"
    },
    {
        "id": 4605,
        "title": "Behaviour-constrained support vector machines for FMRI data analysis",
        "authors": "Pardeep Kumar, J. Jegan Amarnath, K. Somasundaram,  Thilagavathy A.",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0109861"
    },
    {
        "id": 4606,
        "title": "Text Classification using Incremental Learning for many classes of Support Vector Machines",
        "authors": "R.V. Gandhi, Seshaiah Merikapudi, Murthy S.V.N",
        "published": "2023",
        "citations": 0,
        "abstract": "This study introduces class-incremental learning (CIL). This framework improves multi-class data support vector machines (SVMs). CIL is incremental feature selection and training. Both steps update SVM classifiers as new classes are added to a system. CIL learns one binary sub-classifier and reuses classifier models for subsequent classes. Another feature selection stage follows. Testing applies the classifier to subspacerelevant vector projections. The CIL system is compatible with any binary classification approaches that are used for text analysis. According to the findings of our research, the CIL-based SVM beat the most popular batch SVM learning methods, such as divide-by-2, 1-against-1, and 1-against-rest, and trained faster. These learning methods are used to train SVMs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58599/ijsmien.2023.1205"
    },
    {
        "id": 4607,
        "title": "Nonparametric formulation of polynomial chaos expansion based on least-square support-vector machines",
        "authors": "Paolo Manfredi, Riccardo Trinchero",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108182"
    },
    {
        "id": 4608,
        "title": "Safe screening rules for multi-view support vector machines",
        "authors": "Huiru Wang, Jiayi Zhu, Siyuan Zhang",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.021"
    },
    {
        "id": 4609,
        "title": "Smart Diagnosis of Adenocarcinoma Using Convolution Neural Networks and Support Vector Machines",
        "authors": "Balasundaram Ananthakrishnan, Ayesha Shaik, Shubhadip Chakrabarti, Vaishnavi Shukla, Dewanshi Paul, Muthu Subash Kavitha",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "Adenocarcinoma is a type of cancer that develops in the glands present on the lining of the organs in the human body. It is found that histopathological images, obtained as a result of biopsy, are the most definitive way of diagnosing cancer. The main objective of this work is to use deep learning techniques for the detection and classification of adenocarcinoma using histopathological images of lung and colon tissues with minimal preprocessing. Two approaches have been utilized. The first method entails creating two CNN architectures: CNN with a Softmax classifier (AdenoCanNet) and CNN with an SVM classifier (AdenoCanSVM). The second approach corresponds to training some of the prominent existing architecture such as VGG16, VGG19, LeNet, and ResNet50. The study aims at understanding the performance of various architectures in diagnosing using histopathological images with cases taken separately and taken together, with a full dataset and a subset of the dataset. The LC25000 dataset used consists of 25,000 histopathological images, having both cancerous and normal images from both the lung and colon regions of the human body. The accuracy metric was taken as the defining parameter for determining and comparing the performance of various architectures undertaken during the study. A comparison between the several models used in the study is presented and discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15021399"
    },
    {
        "id": 4610,
        "title": "Classifying seismograms using the FastMap algorithm and support-vector machines",
        "authors": "Malcolm C. A. White, Kushal Sharma, Ang Li, T. K. Satish Kumar, Nori Nakata",
        "published": "2023-7-15",
        "citations": 1,
        "abstract": "AbstractNeural networks and related deep learning methods are currently at the leading edge of technologies used for classifying complex objects such as seismograms. However they generally demand large amounts of time and data for model training and their learned models can sometimes be difficult to interpret. FastMapSVM is an interpretable machine learning framework for classifying complex objects, combining the complementary strengths of FastMap with support vector machines (SVMs) and extending the applicability of SVMs to domains with complex objects. FastMap is an efficient linear-time algorithm that maps complex objects to points in a Euclidean space while preserving pairwise domain-specific distances between them. Here we invoke FastMapSVM as a lightweight alternative to neural networks for classifying seismograms. We demonstrate that FastMapSVM outperforms other state-of-the-art methods for classifying seismograms when train data or time is limited. We also show that FastMapSVM can provide an insightful visualization of seismogram clustering behaviour and thus earthquake classification boundaries. We expect FastMapSVM to be viable for classification tasks in many other real-world domains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s44172-023-00099-8"
    },
    {
        "id": 4611,
        "title": "Multi-Class Support Vector Machines with Incremental Learning for Text Classification",
        "authors": "Pankaj Kawadkar, Puppala Krupa Sagar,  B.Rebecca",
        "published": "2023",
        "citations": 0,
        "abstract": "Class-incremental learning (CIL) is a revolutionary framework we develop in this study to address multi-class problems with support vector machines (SVM). Text classifiers built with support for support vector machines (SVMs) can be kept up-to-date with the help of CIL’s two incremental processes. Reusing previously learned classifier models, the CIL only needs to train a single binary sub-classifier and an extra step for feature assortmentonce a new class is introduced. The projections of the vectors onto the relevant subspaces are analyzed using the present classifier. Any text classification method based on binary classification can use CIL as a universal framework for implementation. We found that the CIL-based SVM not only outperformed well-known batch SVM learning strategies like 1-against-rest, 1-against-1, and divide-by-2, but also required much less time to train.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58599/ijsmien.2023.1605"
    },
    {
        "id": 4612,
        "title": "Three-Phase Power Transformer Fault Diagnosis Based on Support Vector Machines and Bees Algorithm",
        "authors": "Othman Abdusalam, Fatih Anayi, Michael Packianather",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpea56918.2023.10093147"
    },
    {
        "id": 4613,
        "title": "Application of support vector machines for categorizing biological and medical data",
        "authors": "Zhanyang Jin, TEJADA GURMENDI HEI, Kewei Jin",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3026871"
    },
    {
        "id": 4614,
        "title": "Class Balancing Methods Comparison for Software Requirements Classification on Support Vector Machines",
        "authors": "Fachrul Pralienka Bani Muhamad, Esti Mulyani, Munengsih Sari Bunga, Achmad Farhan Mushafa",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "Cost, time, and development effort can increase due to errors in analyzing functional and non-functional software requirements. To minimize these errors, previous research has tried to classify software requirements, especially non-functional requirements, on the PROMISE dataset using the Bag of Words (BoW) feature extraction and the Support Vector Machine (SVM) classification algorithm. On the other hand, the unbalanced distribution of class labels tends to decrease the evaluation result. Moreover, most software requirements are usually functional requirements. Therefore, there is a tendency for classifier models to classify test data as functional requirements. Previous research has performed class balancing on a dataset to handle unbalanced data. The study can achieve better classification evaluation results. Based on the previous research, this study proposes to combine the class balancing method and the SVM algorithm. K-fold cross-validation is used to optimize the training and test data to be more consistent in developing the SVM model. Tests were carried out on the value of K in k-fold, i.e., 5, 10, and 15. Results are measured by accuracy, f1-score, precision, and recall. The Public Requirements (PURE) dataset has been used in this research. Results show that SVM with class balancing can classify software requirements more accurately than SVM without class balancing. Random Over Sampling is the class balancing method with the highest evaluation score for classifying software requirements on SVM. The results showed an improvement in the average value of accuracy, f1 score, precision, and recall in SVM by 22.07%, 19.67%, 17.73%, and 19.67%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i2.12415"
    },
    {
        "id": 4615,
        "title": "Rational Jacobi Kernel Functions: A novel massively parallelizable orthogonal kernel for support vector machines",
        "authors": "Mahdi Movahedian Moghaddam, Alireza Afzal Aghaei, Kourosh Parand",
        "published": "2024-5-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dchpc60845.2024.10454075"
    },
    {
        "id": 4616,
        "title": "Handling Imbalanced Classification Problems With Support Vector Machines via Evolutionary Bilevel Optimization",
        "authors": "Alejandro Rosales-Pérez, Salvador García, Francisco Herrera",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcyb.2022.3163974"
    },
    {
        "id": 4617,
        "title": "Research on prediction of wax deposition rate based on improved Support Vector Machines model",
        "authors": "Qing Quan, Yong Wang, Shouxi Wang, Xinwen Zhang",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmsp58539.2023.10170875"
    },
    {
        "id": 4618,
        "title": "Real-time human activity recognition from smart phone using linear support vector machines",
        "authors": "Kamel Maaloul, Lejdel Brahim, Nedioui Med Abdelhamid",
        "published": "2023-6-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12928/telkomnika.v21i3.24100"
    },
    {
        "id": 4619,
        "title": "1-dimensional Embedding Approach for Adolescent Psychosis Prediction from EEG Brain Waves using Support Vector Machines and Deep Learning",
        "authors": "Ejay Nsugbe,  ",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "Objective: Schizophrenia is a form of psychosis which is prevalent within the population and affects both adults and adolescents, where it has also been noted that the conventional means towards diagnosing the disorder involve a high degree of subjectivity, can yield false positive results and are overall difficult to replicate. The use of electroencephalography (EEG) brain waves has been seen to carry promise as a means towards a non-invasive diagnosis of brain states via the acquisition of the bioelectrical manifestation of neuronal activities from across the skull. The acquisition of EEG signals involves a high number of electrode channels alongside the extraction of a relatively broad number of signal features which ultimately yields a high dimensional vector that scales upwards with the addition of data from subsequent subjects.     Methods: As a means around dealing with this issue, this paper proposes a combination of signal decomposition prior to feature extraction, alongside dimensionality reduction, to obtain a low dimensional representation and embedding which is sufficient to allow for an improved prediction performance with a low dimensional projection capable of distinguishing between schizophrenic and non-schizophrenic adolescents.     Results: The results from the pilot carried out, showed that a combination of a metaheuristic signal decomposition, linear dimensionality reduction and the long short-term memory deep learning model provided the best classification performance for the recognition of adolescent schizophrenia from a 1-dimensional embedding representation with a prediction accuracy of 88%.     Conclusion: Further work in this area would now look into the application of probabilistic modelling as a means towards inferring an associated stage of the schizophrenia psychosis where predicted to be present in an adolescent subject.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53964/mit.2023002"
    },
    {
        "id": 4620,
        "title": "Using Naïve Bayes and Support Vector Machines to Predict Television Channel Viewership",
        "authors": "Job Karimi, Tobias Mwalili, Kennedy Ogada",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmeralda60125.2023.10458180"
    },
    {
        "id": 4621,
        "title": "Over-relaxed multi-block ADMM algorithms for doubly regularized support vector machines",
        "authors": "Yunwei Dai, Yuao Zhang, Qingbiao Wu",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.01.082"
    },
    {
        "id": 4622,
        "title": "Interval-based KKT framework for support vector machines and beyond",
        "authors": "Awais Younus,  Rimsha, Cemil Tunç",
        "published": "2024-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/16583655.2024.2334017"
    },
    {
        "id": 4623,
        "title": "Support vector machines",
        "authors": "Dirk Valkenborg, Axel-Jan Rousseau, Melvin Geubbelmans, Tomasz Burzykowski",
        "published": "2023-11",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ajodo.2023.08.003"
    },
    {
        "id": 4624,
        "title": "AI-Driven Sunflower Disease Multiclassification: Merging Convolutional Neural Networks and Support Vector Machines",
        "authors": "Deepak Banerjee, Vinay Kukreja, Satvik Vats, Vishal Jain, Bhawna Goyal",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icesc57686.2023.10193473"
    },
    {
        "id": 4625,
        "title": "Fuzzy-Based Image Contrast Enhancement for Wind Turbine Detection: A Case Study Using Visual Geometry Group Model 19, Xception, and Support Vector Machines",
        "authors": "Zachary Ward, Jordan Miller, Jeremiah Engel, Mohammad A. S. Masoum, Mohammad Shekaramiz, Abdennour Seibi",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "Traditionally, condition monitoring of wind turbines has been performed manually by certified rope teams. This method of inspection can be dangerous for the personnel involved, and the resulting downtime can be expensive. Wind turbine inspection can be performed using autonomous drones to achieve lower downtime, cost, and health risks. To enable autonomy, the field of drone path planning can be assisted by this research, namely machine learning that detects wind turbines present in aerial RGB images taken by the drone before performing the maneuvering for turbine inspection. For this task, the effectiveness of two deep learning architectures is evaluated in this paper both without and with a proposed fuzzy contrast enhancement (FCE) image preprocessing algorithm. Efforts are focused on two convolutional neural network (CNN) variants: VGG19 and Xception. A more traditional approach involving support vector machines (SVM) is also included to contrast a machine learning approach with our deep learning networks. The authors created a novel dataset of 4500 RGB images of size 210×210 to train and evaluate the performance of these networks on wind turbine detection. The dataset is captured in an environment mimicking that of a wind turbine farm, and consists of two classes of images: with and without a small-scale wind turbine (12V Primus Air Max) assembled at Utah Valley University. The images were used to describe in detail the analysis and implementation of the VGG19, Xception, and SVM algorithms using different optimization, model training, and hyperparameter tuning technologies. The performances of these three algorithms are compared in depth alongside those augmented using the proposed FCE image preprocessing technique.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines12010055"
    },
    {
        "id": 4626,
        "title": "Evaluating robustness of support vector machines with the Lagrangian dual approach",
        "authors": "Yuting Liu, Hong Gu, Pan Qin",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-024-09490-8"
    },
    {
        "id": 4627,
        "title": "Hyper-Heuristic Glowworm Swarm Optimized Support Vector Machines for Heart and Thyroid Disease Classification",
        "authors": "S. Mary Vennila, G. Kiruthiga",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsse.2024.10055912"
    },
    {
        "id": 4628,
        "title": "PolyFLAG_SVM: a Polymorphic Federated Learning Aggregation of Gradients Support Vector Machines Framework",
        "authors": "Mohammad Moshawrab, Mehdi Adda, Abdenour Bouzouane, Hussein Ibrahim, Ali Raad",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.09.021"
    },
    {
        "id": 4629,
        "title": "Compositional optimization of quantum circuits for quantum kernels of support vector machines",
        "authors": "Elham Torabian, Roman V. Krems",
        "published": "2023-3-28",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevresearch.5.013211"
    },
    {
        "id": 4630,
        "title": "Can Machine Learning Outperform the Market? Testing the Weak-form Efficiency Hypothesis of the Indian Stock Market Using Support Vector Machines",
        "authors": "Robin Thomas",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": " This article examines the validity of the weak form of the efficient market hypothesis (EMH) in the context of the Nifty stock market index by applying a support vector machine (SVM) model. The aim is to forecast future stock prices using historical data and to evaluate the performance of the SVM model based on accuracy, precision, recall and the area under the receiver operating characteristic (ROC) curve (AUC). The findings offer important implications for the efficiency of the Nifty market and its consequences for investors. The EMH posits that stock prices incorporate all available information, making it impossible to consistently beat the market using historical data. This article tests this proposition by using an SVM model to forecast future stock prices using historical data. The methodology consists of applying the SVM algorithm on historical data of the Nifty stock market index. Performance measures, such as accuracy, precision, recall and AUC, are used to assess the effectiveness of the SVM model. The results show an accuracy of 63.25% in forecasting stock prices, indicating a substantial agreement between predicted and actual labels. The precision score of the model is 97.97%, indicating a high proportion of correctly predicted positive instances. However, the recall score is relatively low at 34.36%, suggesting that some actual positive instances were overlooked. The ROC curve visually illustrates the trade-off between true positive rate and false positive rate for different classification thresholds. This article contributes to the literature on market efficiency by applying a novel SVM model to forecast future stock prices of the Nifty index and finding that the model outperforms random chance, thus challenging the weak form of the EMH. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/09721509231204137"
    },
    {
        "id": 4631,
        "title": "Machine Predictive Maintenance by Using Support Vector Machines",
        "authors": "Idrus Assagaf, Agus Sukandi, Abdul Azis Abdillah, Samsul Arifin, Jonri Lomi Ga",
        "published": "2023-1-1",
        "citations": 1,
        "abstract": "Predictive Maintenance (PdM) is an adoptable worth strategy when we deal with the maintenance business, due to a necessity of minimizing stop time into a minimum and reduce expenses.  Recently, the research of PdM is now begin in utilizing the artificial intelligence by using the machine data itself and sensors. Data collected then analyzed and modelled so that the decision can be made for the near and next future. One of the popular artificial intelligences in handling such classification problem is Support Vector Machines (SVM). The purpose of the study is to detect machine failure by using the SVM model. The study is using database approach from the model of Machine Learning. The data collection comes from the sensors installed on the machine itself, so that it can predict the failure of machine function. The study also to test the performance and seek for the best parameter value for building a detection model of machine predictive maintenance The result shows based on dataset AI4I 2020 Predictive Maintenance, SVM is able to detect machine failure with the accuracy of 80%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59511/riestech.v1i01.6"
    },
    {
        "id": 4632,
        "title": "Automated Damage Detection Using Lamb Wave-Based Phase-Sensitive OTDR and Support Vector Machines",
        "authors": "Rizwan Zahoor, Ester Catalano, Raffaele Vallifuoco, Luigi Zeni, Aldo Minardo",
        "published": "2023-1-18",
        "citations": 1,
        "abstract": "In this paper, we propose and demonstrate a damage detection technique based on the automatic classification of the Lamb wave signals acquired on a metallic plate. In the reported experiments, Lamb waves are excited in an aluminum plate through a piezoelectric transducer glued onto the monitored structure. The response of the monitored structure is detected through a high-resolution phase-sensitive optical time-domain reflectometer (ϕ-OTDR). The presence and location of a small perturbation, induced by placing a lumped mass of 5 g on the plate, are determined by processing the optical fiber sensor data through support vector machine (SVM) classifiers trained with experimental data. The results show that the proposed method takes full advantage of the multipoint sensing nature of the ϕ-OTDR technology, resulting in accurate damage detection and localization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031099"
    },
    {
        "id": 4633,
        "title": "Least Square Support Vector Machines Laguerre Hammerstein Model Identification and Non-linear Model Predictive Controller Design for pH Neutralization Process",
        "authors": "Akshaykumar NAREGALKAR, Subbulekshmi D",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "The ability to describe the nonlinear process dynamics is an essential feature of the Hammerstein model that paved more research and application studies in system identification and control. Using the Hammerstein model, this study shows an alternative approach to identify and control the highly nonlinear pH neutralization process. This Hammerstein model called Laguerre Least Square Support Vector Machines (LLSSVM) models the static nonlinearity with LSSVM and the linear part with Laguerre filter. The identified LLSSVM Hammerstein model performance evaluation with Mean Squared Error (MSE) and Variance Accounted For (VAF) is better than the Linear Laguerre model. We apply the identified LLSSVM Hammerstein model to implement a Nonlinear Model Predictive Controller (NMPC) to control the pH neutralization process. Then evaluated NMPC performance in terms of Integral Squared Error (ISE), Integral Absolute Error (IAE), and Total Variation (TV) and Control Effort (CE) parameters to verify its effectiveness in set-point tracking and disturbance rejection problems. The comparison of the NMPC with the Linear Laguerre Model-based Predictive Controller (LMPC) shows better performance of the NMPC than the LMPC. Results show that the LLSSVM Hammerstein model replicates the pH neutralization process well than the Linear Laguerre model. Also, the identified LLSSVM Hammerstein model provides an efficient NMPC than the LMPC for the pH neutralization process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35378/gujs.798451"
    },
    {
        "id": 4634,
        "title": "Optimization-based adversarial perturbations against twin support vector machines",
        "authors": "Wenjie Wang, Yuanhai Shao, Yiju Wang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2023.103573"
    },
    {
        "id": 4635,
        "title": "A Projection-Based Support Vector Machine Algorithm for Induction Motors’ Bearing Fault Detection",
        "authors": "Narges Khadem Hosseini, Hamid Toshani, Salman Abdi",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sdemped54949.2023.10271436"
    },
    {
        "id": 4636,
        "title": "Multi-view intuitionistic fuzzy support vector machines with insensitive pinball loss for classification of noisy data",
        "authors": "Chunling Lou, Xijiong Xie",
        "published": "2023-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126458"
    },
    {
        "id": 4637,
        "title": "Evaluation of Zones in Himeji City for Foreign Tourists Using Support Vector Machines",
        "authors": "Naotake Kamiura, Teijiro Isokawa, Satoru Hakukawa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52731/ijscai.v7.i1.706"
    },
    {
        "id": 4638,
        "title": "Hyper-heuristic glowworm swarm optimised support vector machines for heart and thyroid disease classification",
        "authors": "G. Kiruthiga, S.Mary Vennila",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsse.2024.137067"
    },
    {
        "id": 4639,
        "title": "An Approach to Mine Data for Predicting Forest Fires Using Support Vector Machines and Gini Index for Feature Selection",
        "authors": " Prathimesh,  Kunal, Groresh Shingari, Deepika Sharma",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccpct58313.2023.10245148"
    },
    {
        "id": 4640,
        "title": "Wind Power Forecasting with Support Vector Machines using Sparrow Search Algorithm",
        "authors": "V. Vidya Lakshmi, S Giriprasad, S P Vimal, Hanumaji Kantari, B Meenakshi, S. Srinivasan",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486697"
    },
    {
        "id": 4641,
        "title": "Laplacian Support Vector Machines as Data Classifier in Machine Learning Approaches of Structural Health Monitoring",
        "authors": "Hassan Fazeli, Nemat Hassani, Mohammad Safi",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1793431124500040"
    },
    {
        "id": 4642,
        "title": "Deep multi-view multiclass twin support vector machines",
        "authors": "Xijiong Xie, Yanfeng Li, Shiliang Sun",
        "published": "2023-3",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2022.10.005"
    },
    {
        "id": 4643,
        "title": "Deep learning and support vector machines for transcription start site identification",
        "authors": "José A. Barbero-Aparicio, Alicia Olivares-Gil, José F. Díez-Pastor, César García-Osorio",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "Recognizing transcription start sites is key to gene identification. Several approaches have been employed in related problems such as detecting translation initiation sites or promoters, many of the most recent ones based on machine learning. Deep learning methods have been proven to be exceptionally effective for this task, but their use in transcription start site identification has not yet been explored in depth. Also, the very few existing works do not compare their methods to support vector machines (SVMs), the most established technique in this area of study, nor provide the curated dataset used in the study. The reduced amount of published papers in this specific problem could be explained by this lack of datasets. Given that both support vector machines and deep neural networks have been applied in related problems with remarkable results, we compared their performance in transcription start site predictions, concluding that SVMs are computationally much slower, and deep learning methods, specially long short-term memory neural networks (LSTMs), are best suited to work with sequences than SVMs. For such a purpose, we used the reference human genome GRCh38. Additionally, we studied two different aspects related to data processing: the proper way to generate training examples and the imbalanced nature of the data. Furthermore, the generalization performance of the models studied was also tested using the mouse genome, where the LSTM neural network stood out from the rest of the algorithms. To sum up, this article provides an analysis of the best architecture choices in transcription start site identification, as well as a method to generate transcription start site datasets including negative instances on any species available in Ensembl. We found that deep learning methods are better suited than SVMs to solve this problem, being more efficient and better adapted to long sequences and large amounts of data. We also create a transcription start site (TSS) dataset large enough to be used in deep learning experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1340"
    },
    {
        "id": 4644,
        "title": "Method for wind power forecasting based on support vector machines optimized and weighted composite gray relational analysis",
        "authors": "Miaona You, Sumei Zhuang, Ruxue Luo",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "This study proposes a weighted composite approach for grey relational analysis (GRA) that utilizes a numerical weather prediction (NWP) and support vector machine (SVM). The approach is optimized using an improved grey wolf optimization (IGWO) algorithm. Initially, the dimension of NWP data is decreased by t-distributed stochastic neighbor embedding (t-SNE), then the weight of sample coefficients is calculated by entropy-weight method (EWM), and the weighted grey relational of data points is calculated for different weather numerical time series data. At the same time, a new weighted composite grey relational degree is formed by combining the weighted cosine similarity of NWP values of the historical day and to be measured day. The SVM’s regression power prediction model is constructed by the time series data. To improve the accuracy of the system’s predictions, the grey relational time series data is chosen as the input variable for the SVM, and the influence parameters of the ideal SVM are discovered using the IGWO technique. According to the simulated prediction and analysis based on NWP, it can be observed that the proposed method in this study significantly improves the prediction accuracy of the data. Specifically, evaluation metrics such as root mean squared error (RMSE), regression correlation coefficient (r 2), mean absolute error (MAE) and mean absolute percent error (MAPE) all show corresponding enhancements, while the computational burden remains relatively low.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-237333"
    },
    {
        "id": 4645,
        "title": "Comparative of machine learning classification strategies for electron energy loss spectroscopy: Support vector machines and artificial neural networks",
        "authors": "Daniel del-Pozo-Bueno, Demie Kepaptsoglou, Francesca Peiró, Sònia Estradé",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ultramic.2023.113828"
    },
    {
        "id": 4646,
        "title": "Cost-sensitive probabilistic predictions for support vector machines",
        "authors": "Sandra Benítez-Peña, Rafael Blanquero, Emilio Carrizosa, Pepa Ramírez-Cobo",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ejor.2023.09.027"
    },
    {
        "id": 4647,
        "title": "Fuzzy Twin Support Vector Machines With Distribution Inputs",
        "authors": "Zhizheng Liang, Shifei Ding",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tfuzz.2023.3296503"
    },
    {
        "id": 4648,
        "title": "Convolutional neural networks and support vector machines for hybrid number plate recognition model",
        "authors": "Peter Muthuri Kibaara, Edna C. Too, David Gitonga Mwathi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijhi.2023.129322"
    },
    {
        "id": 4649,
        "title": "The effects of training quantum support vector machines with different samples from the same dataset",
        "authors": "Tanin Imanothai, Unchalisa Taetragool",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178310"
    },
    {
        "id": 4650,
        "title": "Detection and Analysis of Android Ransomware Using the Support Vector Machines",
        "authors": "Hardlife Ngirande, Martin Muduva, Ronald Chiwariro, Austin Makate",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Abstract: Ransomware is a malicious code designed to encrypt and lock personal data such as documents and photos, in order to create opportunity for extorting money from the victims. Android operating systems are particularly targeted due to their large market share. Previous studies have primarily relied on signature-based detection methods, which require sufficient data samples and labelled signatures. However, modern ransomware utilizes obfuscation techniques that make it challenging to analyse using static methods. This project proposes a hybrid analysis approach for Android ransomware, employing the SVM algorithm for detection. The novelty lies in the limited exploration of SVM algorithms for ransomware analysis. The dataset used in the study was obtained from CICA and Mal 2017. Static features, including permissions, intents, encoding methods, and API calls were used, along with dynamic features such as network activities and system calls. The SVM model achieved good performance, with 81% accuracy and 90% precision using static features, and 100% accuracy with dynamic features",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.57885"
    },
    {
        "id": 4651,
        "title": "Performance Analysis of Maximum Power Point Tracking of PV Systems using Artificial Neural Networks and Support Vector Machines",
        "authors": "Pradeep Kumar S, Vidhya Koothupalakkal Viswambharan, Swaroop Pillai",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccike58312.2023.10131783"
    },
    {
        "id": 4652,
        "title": "Detection of microplastics in water using electrical impedance spectroscopy and support vector machines",
        "authors": "Luca Bifano, Valentin Meiler, Ronny Peter, Gerhard Fischerauer",
        "published": "2023-6-25",
        "citations": 1,
        "abstract": "Abstract\nThe detection of microplastics in water requires a series of processes (sample collection, purification, and preparation) until a sample can be analyzed in the laboratory. To shorten this process chain, we are investigating whether electrical impedance spectroscopy (EIS) enhanced by a classifier based on support vector machine (SVM) can be applied to the problem of microplastics detection. Results with suspensions of polypropylene (PP) and polyolefin (PO) in deionized water proved promising: The relative permittivities extracted from the measured impedances agree with literature data. The subsequent classification of measured impedances by SVM shows that the three classes “no plastic” (below the detection limit of 1 g plastic per filling), “PP” and “PO” can be distinguished securely independent of the background medium water. Mixtures of PO and PP were not examined, i.e. either PO or PP was filled into the measuring cell. An SVM regression performed after the SVM classification yields the microplastic concentration of the respective sample. Further tests with varying salinity and content of organic or biological material in the water confirmed the good results. We conclude that EIS in combination with machine learning (MLEIS) seems to be a promising approach for in situ detection of microplastics and certainly warrants further research activities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/teme-2022-0095"
    },
    {
        "id": 4653,
        "title": "Determination of the actual turbocharging characteristics of diesel engines using support vector machines (SVM)",
        "authors": "V.F. Fedorenko, A.B. Ivanov, V.A. Eviev, N. Sazonov",
        "published": "2024",
        "citations": 0,
        "abstract": "The article proposes and justifies a method that allows solving the problem of determining the characteristics of turbocharging of diesel engines of agricultural tractors without the use of test benches. The proposed application of support vector machines (SVM) has a number of advantages over traditional methods for determining the characteristics of turbocharging of diesel engines under operating conditions of agricultural tractors and machines.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202448003026"
    },
    {
        "id": 4654,
        "title": "Density-Convoluted Support Vector Machines for High-Dimensional Classification",
        "authors": "Boxiang Wang, Le Zhou, Yuwen Gu, Hui Zou",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tit.2022.3222767"
    },
    {
        "id": 4655,
        "title": "Damage detection in an aluminum plate through a phi-OTDR sensor and support vector machines",
        "authors": "Rizwan Zahoor, Ester Catalano, Raffaele Vallifuoco, Luigi Zeni, Aldo Minardo",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2678095"
    },
    {
        "id": 4656,
        "title": "Domain-informed variational neural networks and support vector machines based leakage detection framework to augment self-healing in water distribution networks",
        "authors": "Lauren McMillan, Jawad Fayaz, Liz Varga",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.watres.2023.120983"
    },
    {
        "id": 4657,
        "title": "Bounded quantile loss for robust support vector machines-based classification and regression",
        "authors": "Jiaqi Zhang, Hu Yang",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122759"
    },
    {
        "id": 4658,
        "title": "Classification of COVID-19 Chest X-Ray Images Based on Speeded Up Robust Features and Clustering-Based Support Vector Machines",
        "authors": "Maher I. Rajab",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nDue to the worldwide deficiency of medical test kits and the significant time required by radiology experts to identify the new COVID-19, it is essential to develop fast, robust, and intelligent chest X-ray (CXR) image classification system. The proposed method consists of two major components: feature extraction and classification. The Bag of image features algorithm creates visual vocabulary from two training data categories of chest X-ray images: Normal and COVID-19 patients’ datasets. The algorithm extracts salient features and descriptors from CXR images using the Speeded Up Robust Features (SURF) algorithm. Machine learning with the Clustering-Based Support Vector Machines (CB-SVMs) multiclass classifier is trained using SURF features to classify the CXR image categories. The careful collection of ground truth Normal and COVID-19 CXR datasets, provided by worldwide expert radiologists, has certainly influenced the performance of the proposed CB-SVMs classifier to preserve the generalization capabilities. The high classification accuracy of 99 % demonstrates the effectiveness of the proposed method, where the accuracy is assessed on an independent test sets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/acss-2023-0016"
    },
    {
        "id": 4659,
        "title": "Timely Detection of Diabetes with Support Vector Machines, Neural Networks and Deep Neural Networks",
        "authors": "Rumen Valchev, Miroslav Nikolov, Ognyan Nakov, Milena Lazarova, Valeri Mladenov",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "In this paper, we describe an expert system with three tools - Support Vector Machine (SVM), Deep Neural Network (DNN), and feed-forward neural network (NN) in MATLAB and Python to identify potential candidates with diabetes at the initial stages of the disease. To achieve this goal, the importance of the main factors associated with previous health problems and the onset of diabetes in individuals with a medical history is analyzed. By recognizing the common early indications of diabetes, the system can aid in the selection of patients and potentially benefit them by detecting the disease at an early stage and applying appropriate and timely healing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/232018.2023.11.24"
    },
    {
        "id": 4660,
        "title": "Simulation of Hierarchical Parallel Computing Model for Fluid Machinery Based on Support Vector Machines",
        "authors": "Dechen Wei, Yuanyuan Jiao, Yukun Fan",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10442024"
    },
    {
        "id": 4661,
        "title": "Analysing Red Wine Quality Data Exploratorily using Support Vector Machines and Other Machine Learning Methods",
        "authors": "Muskan Singla, Kanwarpartap Singh Gill, Rahul Chauhan, Hemant Singh Pokhariya, Yerrolla Chanti",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486781"
    },
    {
        "id": 4662,
        "title": "A Comparative Analysis of Random Forest and Support Vector Machines for Classifying Irrigated Cropping Areas in The Upper-Comoé Basin, Burkina Faso",
        "authors": "Farid Traoré,  , Sié Palé, Aïda Zaré, Moussa Karamoko Traoré, Blaise Ouédraogo, Joachim Bonkoungou",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "Objectives: This study investigates the performance of two machine-learning algorithms in classifying land areas across the Upper-Comoé basin in Burkina Faso. Methods: Within the Google Earth Engine data processing environment, Support Vector Machine (SVM) and the Random Forest (RF) algorithms were applied to a Landsat-8 OLI image of March 2019, to discriminate agricultural land areas, with an emphasis on irrigated areas. Findings: The results indicated good to excellent classification performance, with overall accuracies and Kappa coefficients between 71% and 99%, and 0.66 and 0.99, respectively. The RF method outperformed the SVM in terms of mapping \"accuracy\", but in terms of spatial distribution of classes, the SVM method provided a mapping close to reality, due to the density of the classes generated. Novelty: Our findings suggest that remote sensing can constitute a tool fully adapted to the needs of services in charge of agricultural water management in Burkina Faso.  Keywords: Irrigation, Random Forest, Support Vector Machine, Google Earth Engine, Burkina Faso",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i8.78"
    },
    {
        "id": 4663,
        "title": "Lung Cancer Detection from CT Images: Modified Adaptive Threshold\nSegmentation with Support Vector Machines and Artificial Neural Network\nClassifier",
        "authors": "Sneha S. Nair, V. N. Meena Devi, Saju Bhasi",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "\nBackground:\nThe most difficult aspect of diagnosing lung cancer is early diagnosis. According to the American Cancer Society, each year, there are around 11 million newly diagnosed instances of cancer worldwide. Radiologists often turn to Computed Tomography (CT) scans to diagnose respiratory conditions, which can reveal if lung tissue remains normal or abnormal. However, there is an increased chance of inaccuracy and delay; therefore, radiologists are concerned with the physical segmentation of nodules.\n\n\nObjective:\nThe objective of the research is to implement an advanced modified threshold segmentation and classification model for early and accurate detection of lung cancer from CT images.\n\n\nMethods:\nUsing the Support Vector Machines (SVM) classifier as well as the Artificial Neural Network (ANN) classifier, the authors propose using Modified adaptive threshold segmentation as a segmentation approach for cancer detection. Here, Lung Image Database Consortium (LIDC) datasets, a collection of CT scans, are used as the video frames in an investigation to authorize the recitation of the suggested technique.\n\n\nResults:\nBoth quantitative as well as qualitative analyses are used to analyze the segmentation function of the anticipated algorithm. Both the ANN and SVM classifiers used in the suggested technique for lung cancer diagnosis achieve world-record levels of accuracy, with the former achieving a 96.3% detection rate and the latter a 97% rate of accuracy.\n\n\nConclusion:\nThis innovation may have a major impact on the worldwide rate of lung cancer rate due to its ability to detect lung tumors in their earliest stages when they are most amenable to being avoided and treated. This method is useful because it provides more information and facilitates quick, precise decision-making for doctors diagnosing lung cancer in their patients.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230714110914"
    },
    {
        "id": 4664,
        "title": "FAULT DETECTION AND DIAGNOSIS BY SUPPORT VECTOR MACHINES: APPLICATION TO VINYL-CHLORIDE-MONOMER PROCESS",
        "authors": "Chanin Panjapornpon, Siriwatida Srirabai",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "Monitoring process status and identifying process operational faults are essential for improving the process safety in petrochemical plants that interactions between various process streams and units are associated. This paper presents a deployment of a support vector machine technique for detecting and identifying operational fault cases with a case study of a vinyl chloride monomer plant. An integrated simulation environment between MATLAB and UniSim Design dynamic simulator is utilized for evaluating the performance of the proposed fault detection and identification framework. Under the real-time software-in-the-loop simulation, the confusion matrix results and receiver operating characteristics supported that the proposed framework provides high accuracy of fault classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55766/sujst-2023-03-e03028"
    },
    {
        "id": 4665,
        "title": "Polyneuropathy Early Detection Based on Electrodermal Activity Features and Support Vector Machines",
        "authors": "Jaouher Ben Ali, Nourhene Dhouibi, Mounir Sayadi, Jean-Marc Ginoux, Jacques Grapperon, Moez Bouchouicha",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codit58514.2023.10284464"
    },
    {
        "id": 4666,
        "title": "Data-driven risk-averse newsvendor problems: developing the CVaR criteria and support vector machines",
        "authors": "Zhen-Yu Chen",
        "published": "2024-2-16",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/00207543.2023.2179350"
    },
    {
        "id": 4667,
        "title": "A Comparative Study of Deep Neural Networks and Support Vector Machines for Unsupervised Anomaly Detection in Cloud Computing Environments",
        "authors": "Tamilselvan Arjunan",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Abstract: Cloud computing is now ubiquitous and provides convenient access to computing resources on demand. Cloud environments are complex and prone to faults, which can have a negative impact on service quality. Cloud providers must be able to detect issues in a proactive manner using unsupervised anomaly detection. This does not require labeled data. This paper presents a comparison of deep neural networks and support vector machine (SVMs), both used for unsupervised anomaly identification in cloud environments. On benchmark datasets provided by cloud providers, we evaluate the performance Autoencoders with LSTM models, One Class SVMs, and Isolation Forests. Our results show that shallow Autoencoders do not capture workload patterns well, but LSTMs or Convolutional Autoencoders can. SVMs are as good or better than Autoencoders. One-Class SVMs show robust performance in all workloads. Isolation Forests perform poorly on cloud data that is seasonal. One-Class SVMs are the most accurate and low latency option for anomaly detection. Our findings offer cloud providers guidance on how to select suitable unsupervised models based upon their performance, interpretability, and computational overhead. The results and comparative methodology will be used to inform future research into adapting unsupervised-learning for cloud anomaly detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.58496"
    },
    {
        "id": 4668,
        "title": "Fault diagnosis of bearings using multifractal detrended cross-correlation analysis and uncertain support vector machines",
        "authors": "Wenbo Wu, Tianji Zou, Yitong Cao, Lu Zhang, Ke Wang, Xuzhi Li",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2ecs60824.2023.10493531"
    },
    {
        "id": 4669,
        "title": "Classification of Sand-Binder Mixtures from the Foundry Industry Using Electrical Impedance Spectroscopy and Support Vector Machines",
        "authors": "Luca Bifano, Xiaohu Ma, Gerhard Fischerauer",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "Molding sand mixtures used in the foundry industry consist of various sands (quartz sands, chromite sands, etc.) and additives such as bentonite. The optimum control of the processes involved in using the mixtures and in their regeneration after the casting requires an efficient in-line monitoring method that is not available today. We are investigating whether such a method can be based on electrical impedance spectroscopy (EIS). To establish a database, we have characterized various sand mixtures by EIS in the frequency range from 0.5 kHz to 1 MHz under laboratory conditions. Attempts at classifying the different molding sand mixtures by support vector machines (SVM) show encouraging results. Already high assignment accuracies (above 90%) could even be improved with suitable feature selection (sequential feature selection). At the same time, the standard uncertainty of the SVM results is low, i.e., data assigned to a class by the presented SVMs have a high probability of being assigned correctly. The application of EIS with subsequent evaluation by machine learning (machine-learning-enhanced EIS, MLEIS) in the field of bulk material monitoring in the foundry industry appears possible.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24062013"
    },
    {
        "id": 4670,
        "title": "Classification ChatGPT Generated News and True News Using Support Vector Machines",
        "authors": "Richard G. Mayopu, Venkateswarlu Nalluri, Long-Seng Chen",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icast57874.2023.10359313"
    },
    {
        "id": 4671,
        "title": "Classification of the technical condition of rolling bearing by the scalar indicators and support vector machines",
        "authors": "Volodymyr Puzyr, Serhii Mykhalkiv",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "Background: the necessity to classify the technical condition of rolling bearings by machine learning methods to reduce the influence of the human factor and to reduce the duration of diagnostics;\nObjective: determining an acceptable combination of scalar indicators to provide high accuracy of the binary classification;\nMethods: for the acquired signals of the fault free axle-bearing of rolling stock and the bearing with the damaged roller, four scalar indicators were calculated: root mean square, crest factor, asymmetry and kurtosis, which were grouped into the corresponding datasets and used for training the support vector machines;\nResults: learning accuracy was calculated for the four datasets with two different predictors in each dataset;\nConclusions: the properties of the behavior of the root mean square and kurtosis of vibration were taken into account, and it was possible to achieve 100 % accuracy of learning the support vector machines in the corresponding combinations of the scalar indicators",
        "keywords": "",
        "link": "http://dx.doi.org/10.20535/2409-7160.2023.xxiii.278143"
    },
    {
        "id": 4672,
        "title": "Enhancing Brain Tumor Diagnosis: A Synergistic Approach with Support Vector Machines and Decision Trees for Improved Detection and Segmentation",
        "authors": "Srikumaran R",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Abstract: Brain tumor identification and segmentation are critical components of modern medical imaging, facilitating timely diagnoses and effective therapy planning. This paper introduces an innovative methodology that harmoniously integrates Support Vector Machines (SVM) and Decision Tree methods. SVM adeptly classifies brain images into tumor and nonneoplastic regions, harnessing its proficiency with complex datasets. Decision Tree methods complement this process, providing transparent segmentation that accurately delineates intricate tumor boundaries. The synergy between SVM and Decision Tree methods establishes a robust framework for brain tumor identification. This novel approach holds promise for enhanced diagnosis speed, particularly valuable in time-sensitive medical scenarios. Emphasizing potential advancements in patient care outcomes, the methodology enables tailored treatment plans with greater precision. Positioned at the core of brain image analysis, this novel methodology signifies a substantial step forward in healthcare practices, fostering personalized approaches to brain tumor diagnosis and treatment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.58595"
    },
    {
        "id": 4673,
        "title": "Quantum Support Vector Machines for Aerodynamic Classification",
        "authors": "Xi-Jun Yuan, Zi-Qiao Chen, Yu-Dan Liu, Zhe Xie, Ying-Zheng Liu, Xian-Min Jin, Xin Wen, Hao Tang",
        "published": "2023-1",
        "citations": 2,
        "abstract": "Aerodynamics plays an important role in the aviation industry and aircraft design. Detecting and minimizing the phenomenon of flow separation from scattered pressure data on the airfoil is critical for ensuring stable and efficient aviation. However, given that it is challenging to understand the mechanics of flow-field separation, aerodynamic parameters are emphasized for the identification and control of flow separation. The mechanics of flow-field separation have been extensively investigated using traditional algorithms and machine learning methods such as support vector machine (SVM) models. Recently, growing interest in quantum computing and its applications in various research communities has shed light on the use of quantum techniques to solve aerodynamic problems. In this study, we applied qSVM, a quantum SVM algorithm based on the quantum annealing model, to identify flow separation and compared its performance to that of the widely used classical SVM. We demonstrated that our approach outperforms the classical SVM with an 11.1% increase in accuracy, from 0.818 to 0.909, for this binary classification task. We further developed a multiclass qSVM based on a one-against-all algorithm and applied it to the classification of multiple angles of attack on the wings, where its advantage over its classical multiclass counterparts was maintained with a 17.9% increase in accuracy, from 0.67 to 0.79. Our study demonstrates a useful quantum technique for classifying flow separation scenarios and may promote the investigation of quantum computing applications in fluid dynamics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34133/icomputing.0057"
    },
    {
        "id": 4674,
        "title": "Anomaly Detection of Industrial Images Based on Instance Segmentation with Support Vector Machines Model",
        "authors": "Ramachandra A C, Abbas Hameed Abdul Hussein, Myasar Mundher Adnan, V Malathy, Muhammed Basim Jabar",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmnwc60182.2023.10435880"
    },
    {
        "id": 4675,
        "title": "Classifying Game Reviews by Using Natural Language Processing and Support Vector Machines with SMOTE-Tomek Algorithm",
        "authors": "Yi-Yun Wang, Zi-Jie Luo, Mu-Chen Chen, Long-Sheng Chen",
        "published": "2023-7-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iiai-aai59060.2023.00067"
    },
    {
        "id": 4676,
        "title": "Classification of Ettawa Crossbread Goats based on Face using Gray Level Co-Occurrence Matrix (GLCM) and Support Vector Machines (SVM) Methods",
        "authors": "Anna Nur Nazilah Chamim, Alif Fatullah, Yessi Jusman",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwaiip58158.2023.10462844"
    },
    {
        "id": 4677,
        "title": "Hyper-heuristic salp swarm optimization of multi-kernel support vector machines for big data classification",
        "authors": "Issa Mohammed Saeed Ali, D. Hariprasad",
        "published": "2023-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41870-022-01141-2"
    },
    {
        "id": 4678,
        "title": "Drone Range Detection Using Extracted Mel Frequency Cepstral Coefficients with Logistic Regression and Support Vector Machines",
        "authors": "Anthony C. Brunson, Richard Dill, Brett J. Borghetti, Douglas D. Hodson",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csce60160.2023.00137"
    },
    {
        "id": 4679,
        "title": "Fault diagnosis of rolling linear guides based on wavelet packet decomposition and support vector machines",
        "authors": "Xiudan Luo, Yangyang Rao, Guangyu Xia, Wei Liu, Runwei Gu, Cheng He",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci57876.2023.10176959"
    },
    {
        "id": 4680,
        "title": "Penerapan data mining dalam analisa profil mahasiswa menggunakan metode support vector machines (SVM)",
        "authors": "Luki Hernando, Vitri Aprilla Handayani, Deosa Putra Caniago, Nadia Widari Nasution",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "decision making. The Support Vector Machine algorithm is a method in supervised learning which is usually used for classifications such as Support Vector Classification and support Vector Regression regression. In this study the SVM algorithm was used in the classification of student data profiles at the Batam Institute of Technology, which can be used as material for consideration in determining and considering decisions to make an effective destination strategy promotion.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.37859/coscitech.v4i2.5107"
    },
    {
        "id": 4681,
        "title": "Chord Recognition in Music Using a Robust Pitch Class Profile (PCP) Feature and Support Vector Machines (SVM)",
        "authors": "Suwatchai Kamonsantiroj",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47738/ijiis.v7i1.191"
    },
    {
        "id": 4682,
        "title": "Affinity-based elastic net intuitionistic fuzzy twin support vector machines",
        "authors": "Zhishen Li, Peiai Zhang",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13042-023-02041-y"
    },
    {
        "id": 4683,
        "title": "Application of the support vector machines method for metal analyse by an eddy current system",
        "authors": "Anton Abramovych, Ievgen Zaitsev, Volodymyr Piddubnyi, Viktoriia Bereznychenko",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractThe eddy current method of control analyzed and the possibility of its use for the identification of metals and alloys substantiated. It is shown that this can be done by modernizing the eddy current radio engineering system with dynamic scanning of metal samples, which consists in the use of modern microcontrollers with high‐precision ADC operation. The structural of the modernized system is presented, some aspects of processing the received response signal are considered, which made it possible to highlight the information coefficients that would represent the metal or alloy as a generalized image. It is proposed to use machine learning methods to compare an unknown sample of a metal or alloy under study with those available in the collected database, which is shown on the example of the support vector machine method, which allows for real‐time identification of metals and alloys, to carry out express control, without human intervention in the identification process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/tje2.12346"
    },
    {
        "id": 4684,
        "title": "Sentiment Analysis of Digital Television Migration on Twitter Using Naïve Bayes Multinomial Comparison, Support Vector Machines, and Logistic Regression Algorithms",
        "authors": "Ryo Benhard Dahlian, Delima Sitanggang",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "The Ministry of Communication and Information Technology (KEMENKOMINFO) has announced to the publics in Indonesia regarding the termination of analog television broadcasts or called analog switch-off, which requires the public to migrate from analog television to digital television. Regarding the process of stopping analog broadcasts this raises pros and cons by the people in Indonesia. Many people give their respective opinions through social media, especially on Twitter. A collection of pros and cons data from the public can be collected and used as research of sentiment analysis. This research will focus on comparing three classification algorithms, which is called Multinomial Naïve Bayes, Support Vector Machines, and Logistic Regression using the same dataset and the same method called Lexicon Based. The results showed that the highest accuracy is Support Vector Machines with the accuracy is 94.00%, Logistic Regression with the accuracy is 90.00%, and Multinomial Naïve Bayes with the accuracy is 88.00%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32736/sisfokom.v12i2.1668"
    },
    {
        "id": 4685,
        "title": "An Efficient Filter and Wrapper based Selection Methods along With Random Forest and Support Vector Machines Classification Technique in Health Care System",
        "authors": "Keerthika N, Nithyanandam S",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "Health care Management System (HMS) is a key to successful management of any health care industry. Health\ncare management systems have so many research dimensions such as identifying disease and diagnostic, drug discovery\nmanufacturing, Bioinformatics’ problem, personalized treatments, Patient image analysis and so on. Heart Disease Prediction\n(HDP) is a process of identifying heart disease in advance and recognizes patient health condition by applying techniques on\npatient heart related symptoms. Now a day’s the problem of identifying heart diseases is solved by machine learning techniques.\nIn this paper we construct a heart disease prediction method using combined feature selection and classification machine\nlearning techniques. According to the existing study the one of the main difficult in heart disease prediction system is that the\navailable data in open sources are not properly recorded the necessary characteristics and there is some lagging in finding the\nuseful features from the available features. The process of removing inappropriate features from an available feature set while\npreserving sufficient classification accuracy is known as feature selection. A methodology is proposed in this paper that consists\nof two phases: Phase one employs two broad categories of feature selection techniques to identify the efficient feature sets and\nit is given to the input of our second phase such as classification. In this work we will concentrate on filter-based method for\nfeature selection such as Chi-square, Fast Correlation Based Filter (FCBF), Gini Index (GI), RelifeF, and wrapper-based\nmethod for feature selection such as Backward Feature Elimination (BFE), Exhaustive Feature Selection (EFS), Forward\nFeature Selection (FFS), and Recursive Feature Elimination (RFE). The UCI heart disease data set is used to evaluate the output\nin this study. Finally, the proposed system's performance is validated by various experiments setups.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/7669/jmc202303048"
    },
    {
        "id": 4686,
        "title": "Sequential Minimal Optimization Algorithm for One-Class Support Vector Machines With Privileged Information",
        "authors": "Andrey Lange, Dmitry Smolyakov, Evgeny Burnaev",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3331685"
    },
    {
        "id": 4687,
        "title": "Brassica Black Rot Severity Levels classification based on Multimodal Convolutional Neural Networks and Support Vector Machines",
        "authors": "Deepak Upadhyay, Manika Manwal, Ajay Pratap Singh Yadav, Vinay Kukreja, Rishabh Sharma",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486264"
    },
    {
        "id": 4688,
        "title": "Support Vector Machines Based Predictive Seizure Care using IoT-Wearable EEG Devices for Proactive Intervention in Epilepsy",
        "authors": "Porandla Srinivas, M. Arulprakash, M. Vadivel, N Anusha, G. Rajasekar, C. Srinivasan",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486581"
    },
    {
        "id": 4689,
        "title": "Lung Cancer Detection using Segmented 3D Tensors and Support Vector Machines",
        "authors": "Zaib un Nisa, Arfan Jaffar, Sohail Masood Bhatti, Umair Muneer Butt",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141066"
    },
    {
        "id": 4690,
        "title": "Hybrid Method with Parallel-Factor Theory, a Support Vector Machine, and Particle Filter Optimization for Intelligent Machinery Failure Identification",
        "authors": "Shaoyi Li, Hanxin Chen, Yongting Chen, Yunwei Xiong, Ziwei Song",
        "published": "2023-8-17",
        "citations": 22,
        "abstract": "Here, a novel hybrid method of intelligent fault identification within complex mechanical systems was proposed using parallel-factor (PARAFAC) theory and adaptive particle swarm optimization (APSO) for a support vector machine (SVM). The parallel-factor multi-scale analysis theory was studied to reconstruct tensor feature information based on a three-dimensional matrix for time, frequency, and spatial vectors. A multi-scale wavelet analysis was used to transform the original multi-channel experimental data acquired from a gearbox into a three-dimensional feature matrix of the multi-level structure. The optimal correspondence among the two-dimensional feature signals in the frequency and time domains for the different fault modes was established by the PARAFAC theory. An intelligent APSO algorithm was developed to obtain the optimal parameter structures of an SVM classifier. A comparison with the existing time–frequency analysis method showed that the proposed hybrid PARAFAC-PSO-SVM diagnosis model effectively eliminated the redundant information in the multi-dimensional tensor features but retained the important components. The PARAFAC-APSO-SVM hybrid diagnostic model achieved fast, accurate, and simple fault-classification and identification results, and could provide theoretical support for the application of the PARAFAC theory to complex mechanical fault diagnosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11080837"
    },
    {
        "id": 4691,
        "title": "Thrust Vector Controller Comparison for a Finless Rocket",
        "authors": "Laura Sopegno, Patrizia Livreri, Margareta Stefanovic, Kimon P. Valavanis",
        "published": "2023-3-17",
        "citations": 2,
        "abstract": "The paper focuses on comparing applicability, tuning, and performance of different controllers implemented and tested on a finless rocket during its boost phase. The objective was to evaluate the advantages and disadvantages of each controller, such that the most appropriate one would then be developed and implemented in real-time in the finless rocket. The compared controllers were Linear Quadratic Regulator (LQR), Linear Quadratic Gaussian (LQG), and Proportional Integral Derivative (PID). To control the attitude of the rocket, emphasis is given to the Thrust Vector Control (TVC) component (sub-system) through the gimballing of the rocket engine. The launcher is commanded through the control input thrust gimbal angle δ, while the output parameter is expressed in terms of the pitch angle θ. After deriving a linearized state–space model, rocket stability is addressed before controller implementation and testing. The comparative study showed that both LQR and LQG track pitch angle changes rapidly, thus providing efficient closed-loop dynamic tracking. Tuning of the LQR controller, through the Q and R weighting matrices, illustrates how variations directly affect performance of the closed-loop system by varying the values of the feedback gain (K). The LQG controller provides a more realistic profile because, in general, not all variables are measurable and available for feedback. However, disturbances affecting the system are better handled and reduced with the PID controller, thus overcoming steady-state errors due to aerodynamic and model uncertainty. Overall controller performance is evaluated in terms of overshoot, settling and rise time, and steady-state error.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11030394"
    },
    {
        "id": 4692,
        "title": "An improved method for sand wave morphology discrimination in rivers by combining a flow resistance law and support vector machines",
        "authors": "Yuchuan Bai, Yanjie Sun, Xiaolong Song, Haijue Xu",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijsrc.2023.10.003"
    },
    {
        "id": 4693,
        "title": "Retracted: Diminution of Smart Grid with Renewable Sources Using Support Vector Machines for Identification of Regression Losses in Large-Scale Systems",
        "authors": "",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9898623"
    },
    {
        "id": 4694,
        "title": "Comparing Neural Networks, Support Vector Machines, and Naïve Bayes Algorhythms for Classifying Banana Types",
        "authors": "Abwabul Jinan, Manutur Siregar, Vicky Rolanda, Dede Fika Suryani, Abdul Muis",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "One of the most significant fruits for human consumption is the banana. Fruit consumption not only promotes health but also lowers the risk of heart disease, stroke, digestive issues, hypertension, some cancers, cataracts in the eyes, skin ailments, cholesterol reduction, and, perhaps most importantly, boosts immunity.The study included secondary data, which is information gathered from online resources like Kaggle. Ten categories of bananas will be identified from the 531 total varieties of bananas used as a train dataset: Ambon bananas, Stone bananas, Cavendish bananas, Kepok bananas, Mas bananas, Red bananas, plantains, Milk bananas, Horn bananas, and Varigata bananas. The development of information technology for image object recognition has become a very intriguing topic along with the rapid advancement of society, and it is undoubtedly directly tied to information data. In order to examine Naive Bayes, Support Vector Machine, and Neural Network techniques for classifying banana types, researchers will use the SqueezeNet Deep Learning model to extract features from photos. The study's findings will provide empirical evidence for the distinctions between each algorithm's accuracy, recall, and precision. Based on the collected results, the Neural Network (NN) method is the best in terms of classification, with accuracy of 72.3%, precision of 72.1%, and recall of 72.3%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47709/cnahpc.v6i1.3381"
    },
    {
        "id": 4695,
        "title": "Measuring technical efficiency for multi-input multi-output production processes through OneClass Support Vector Machines: a finite-sample study",
        "authors": "Raul Moragues, Juan Aparicio, Miriam Esteve",
        "published": "2023-9",
        "citations": 1,
        "abstract": "AbstractWe introduce a new method for the estimation of production technologies in a multi-input multi-output context, based on OneClass Support Vector Machines with piecewise linear transformation mapping. We compare via a finite-sample simulation study the new technique with Data Envelopment Analysis (DEA) to estimate technical efficiency. The criteria adopted for measuring the performance of the estimators are bias and mean squared error. The simulations reveal that the approach based on machine learning seems to provide better results than DEA in our finite-sample scenarios. We also show how to adapt several well-known technical efficiency measures to the introduced estimator. Finally, we compare the new technique with respect to DEA via its application to an empirical database of USA schools from the Programme for International Student Assessment, where we obtain statistically significant differences in the efficiency scores determined through the Slacks-Based Measure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12351-023-00788-4"
    },
    {
        "id": 4696,
        "title": "Machine learning-based electricity theft detection using support vector machines",
        "authors": "Safdar Ali Abro, Lyu Guang Hua, Javed Ahmed Laghari, Muhammad Akram Bhayo, Abdul Aziz Memon",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Electricity theft is a serious issue that many nations face, especially in developing areas where non-technical losses can make up a significant percentage of the overall losses sustained by utilities. Electricity theft detection (ETD) is a very challenging task because it frequently introduces irregularities in customer electricity consumption patterns. In recent times, machine learning (ML) techniques have been investigated as a potential solution for ETD. In this research, author propose electricity theft detection based on four kernel functions of support vector machines (SVM). The proposed method analyzes the electricity consumption patterns and then predicts the category of the user. The kernel functions utilized includes polynomial, sigmoid, radial basis function (RBF) and linear kernel function. For experimentation and model training, a dataset of Pakistani utility company is used, which contains the electricity consumption information. The results highlight SVM method works well for accurate ETD. The detection accuracy of the various kernel functions of SVM is 83%, 79%, 80%, and 76% for RBF, polynomial, sigmoid, and linear kernel functions, respectively, demonstrating the effectiveness of the proposed SVM-based method for theft detection. By leveraging these ML-based methods, utility companies can strengthen their ability to detect and prevent electricity theft, leading to improved revenue management and dependability of services.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v14i2.pp1240-1250"
    },
    {
        "id": 4697,
        "title": "Calculation of Emission Factors of the Northwest Regional Grid Based on Linear Support Vector Machines",
        "authors": "Yu Peng, Ting Chong, Xiaoye Zhang, Shaolin Chen, Gang Xie",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Abstract\nMachine learning can perform correlation analysis on a large amount of data and explore their relationship. Thus, the status quo can be analyzed, and the values of specific power industry indicators can be predicted in the future. This paper deduced the industry indicators that affect the grid emission factor by analyzing the grid emission factor algorithm. The study used the support vector machine regression algorithm to model and analyze collected power grid data and discussed the regression effect from five main aspects, including RMSE, MSE, MAE, coefficient and running time. Finally the most fitted regression model parameters were obtained. And the optimal model predicted the emission factors of the Northwest power grid.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2474/1/012083"
    },
    {
        "id": 4698,
        "title": "Linearized alternating direction method of multipliers for elastic-net support vector machines",
        "authors": "Rongmei Liang, Xiaofei Wu, Zhimin Zhang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.110134"
    },
    {
        "id": 4699,
        "title": "Uso do classificador Support Vector Machines para o mapeamento da cobertura do solo usando imagens de Sensoriamento Remoto",
        "authors": "Juarez Antônio da Silva Júnior, Admilson Da Penha Pacheco",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "O mapeamento do uso/cobertura da terra desempenha um papel vital no planejamento e supervisão da utilização dos recursos naturais com base no aumento gradual das demandas humanas no ecossistema atual. As detecções de mudanças na cobertura do solo são essenciais para entender quais vetores de degradação atuam na região, além do monitoramento do risco ambiental no entorno de reservatórios de abastecimento de água no Bioma Caatinga. O sensoriamento remoto e o classificador SVM fornecem uma plataforma consistente para estudar as transformações da paisagem em toda a superfície da Terra. Este estudo objetiva o mapeamento de uso e ocupação do solo no entorno da Barragem barra do Juá localizado no estado de Pernambuco através da comparação entre sensores orbitais, o Câmera Multiespectral Regular (MUX) e o Operational Land Instrument (OLI) dos satélites CBERS-4 e Landsat-8 respectivamente. A análises foram baseadas em Tabela de Contingência obtidas por meio de um mapa oficial de referência. Após a verificações comparativas com o produto de referência, foram obtidos uma acurácia do produtor e de usuário médio de 62,44% e 71,74% para o MUX e 60,88% e 62,38% para o OLI, respectivamente. As diferentes especificações e capacidades técnicas entre os sensores na captura bem como o comportamento espectral dos alvos foram relevantes para a variabilidade espacial e temática entre os mapas de uso do solo MUX e OLI.  Os resultados obtidos mostraram que o MUX apresentou mapas de cobertura da terra com melhor desempenho em relação aos dados OLI.       Support Vector Machines classifier for land cover mapping using CBERS-4/MUX and Landsat-8/OLI images A B S T R A C TLand use/land cover mapping plays a vital role in planning and supervising the use of natural resources based on the gradual increase in human demands on today's ecosystem. The detection of changes in land cover is essential to understand which degradation vectors act in the region, in addition to monitoring the environmental risk around water supply reservoirs in the Caatinga Biome. Remote sensing and the SVM classifier provide a consistent platform for studying landscape transformations across the Earth's surface. This study aims to map land use and occupation around the Barra do Juá dam located in the state of Pernambuco through the comparison between orbital sensors, the Regular Multispectral Camera (MUX) and the Operational Land Instrument (OLI) of the CBERS-4 satellites and Landsat-8 respectively. The analyzes were based on a Contingency Table obtained through an official reference map. After comparative verifications with the reference product, an accuracy of 62.44% and 71.74% for the MUX and 60.88% and 62.38% for the OLI were obtained for the average producer and user, respectively. The different specifications and technical capabilities between the sensors in the capture as well as the spectral behavior of the targets were relevant to the spatial and thematic variability between the MUX and OLI land use maps. The results obtained showed that the MUX presented land cover maps with better performance in relation to the OLI data",
        "keywords": "",
        "link": "http://dx.doi.org/10.26848/rbgf.v16.3.p1304-1319"
    },
    {
        "id": 4700,
        "title": "Evaluating the machine learning based Efficacy of Decision Tree and Support Vector Machines in Smart Irrigation Systems for Precise Irrigation Status Classification for Optimizing Water Management in Agriculture",
        "authors": " Shaik Mabasha",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "The research paper deals with the improvement of water management practices in agriculture through the use of machine learning in smart irrigation systems. The efficiency of the Decision Tree and the Support Vector Machine models with real-time sensor data was analyzed. The Internet of Things system was developed to analyze the data collected at the field with the help of various sensors, including temperature, humidity, and soil moisture sensors. The layout and choice of sensors were based on the official parameters required for most average plants and corps. After data collection and development of classifiers, the Decision Tree and Support Vector Machine models were used and analyzed regarding their efficiency for making irrigation-related decisions. As the result, it was found that both models showed a good performance, but the SVM model was slightly better due to a smaller number of false positives and false negatives, which allow it to divide the data into the corresponding categories more accurately. At the same time, both models use history data, and the more recent data are better for decision as it was also noted during the development when the use of models based on history data for irrigation decision result in regular irrigation, which in long term would cause the loss of productivity of plans, due to the issue that ancient and no crops are watered too. As the final results, it can be stated that the models show good performance, and the algorithms that were tested can be stated viable for the use at practice. At the same time, the SVM model shows slightly better performance than DT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1682"
    },
    {
        "id": 4701,
        "title": "An Empirical Internet Protocol Network Intrusion Detection using Isolation Forest and One-Class Support Vector Machines",
        "authors": "Gerard Shu Fuhnwi, Victoria Adedoyin, Janet O. Agbaje",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140801"
    },
    {
        "id": 4702,
        "title": "$$L_1$$-penalized fraud detection support vector machines",
        "authors": "Minhyoung Park, Hyungwoo Kim, Seung Jun Shin",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42952-023-00207-6"
    },
    {
        "id": 4703,
        "title": "Securing Southbound Interface in SDNs: Utilizing Support Vector Machines for OpenFlow Packet Classification",
        "authors": "Ali Gökhan Avran, Elif Ak, Kübra Duran, Gökhan Yurdakul, Gökhan Seçinti",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/camad59638.2023.10478400"
    },
    {
        "id": 4704,
        "title": "Using support vector machines for classification datamining on international trade price index data",
        "authors": "Erni Febrina Harahap, A. Heri Iswanto, Delipiter Lase, Rizqi Putri Nourma Budiarti, Sritrusta Sukaridhoto",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0183902"
    }
]