[
    {
        "id": 22771,
        "title": "Machine Learning Algorithms for Recommendation of Learning CS Courses in E-Learning Systems",
        "authors": "Ngai Cheong",
        "published": "2022-8-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3561877.3561899"
    },
    {
        "id": 22772,
        "title": "Gamified Learning Systems’ Personalized Feedback Report Dashboards via Custom Machine Learning Algorithms and Recommendation Systems",
        "authors": " Nymfodora-Maria Raftopoulou,  Petros L. Pallis",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17265/2159-5526/2023.03.006"
    },
    {
        "id": 22773,
        "title": "Machine Learning-Based Algorithms Towards Crop Recommendation Systems",
        "authors": "Soumya Roy, Yuvika Vatsa, Moumita Sahoo, Somak Karan",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "Technology is now playing a critical role in many industries to overcome challenges and get better and optimum results. The farming industry in India significantly affects the country's economy. The agricultural sector continues to employ half of the nation's workforce. The majority of agricultural activities in the nation still use outdated methods, and technical advancement is modest. Effective technology can be applied to this industry to maximize yield and minimize difficulties. Thus, based on the weather, moisture, and season, the machine learning-based farming solution may provide a crop recommendation system that aids farmers in selecting the appropriate crop to sow in their field. This work used six classifiers to recommend best fitted crop depending on soil as well as environmental parameters. It has been observed that the highest accuracy score has been achieved by Naïve Bayes followed by SVM – SVC, decision tree, KNN, SVM – NuSVC, and logistic regression classifier.",
        "link": "http://dx.doi.org/10.4018/978-1-6684-7524-9.ch013"
    },
    {
        "id": 22774,
        "title": "Crop Recommendation Systems using Machine Learning Algorithms",
        "authors": "Gokila Brindha P, ReenaSri S, Dhanushree U, Sivadhanu K",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icraset59632.2023.10420164"
    },
    {
        "id": 22775,
        "title": "Survival Probability Assessment using Machine Learning Algorithms",
        "authors": "Jingyi Wang, Boyang Zhang",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlise57402.2022.00097"
    },
    {
        "id": 22776,
        "title": "Adapting machine-learning algorithms to design gene circuits",
        "authors": "Tom Hiscock",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractBiological systems rely on complex networks, such as transcriptional circuits and protein-protein interaction networks, to perform a variety of functions e.g. responding to stimuli, directing cell fate, or patterning an embryo. Mathematical models are often used to ask: given some network, what function does it perform? However, we often want precisely the opposite i.e. given some circuit – either observedin vivo, or desired for some engineering objective – what biological networks could execute this function? Here, we adapt optimization algorithms from machine learning to rapidly screen and design gene circuits capable of performing arbitrary functions. We demonstrate the power of this approach by designing circuits (1) that recapitulate importantin vivophenomena, such as oscillators, and (2) to perform complex tasks for synthetic biology, such as counting noisy biological events. Our method can be readily applied to biological networks of any type and size, and is provided as an open-source and easy-to-use python module, GeneNet.",
        "link": "http://dx.doi.org/10.1101/213587"
    },
    {
        "id": 22777,
        "title": "Movie Recommendation System Using Machine Learning Algorithms",
        "authors": "Onkar N Jadhav, Ashwini KB",
        "published": "2022-4-5",
        "citations": 1,
        "abstract": "Movies are one kind of enjoyment, however the challenge is locating the specified resources among the lots of movies discharged annually. To search out a show what users are seeking out through this technology is incredibly troublesome. However, recommendation structures return abundant handier in these things. Searching is the first step depending on which the movies are recommended to the user. To search a movie the user may use any of the parameter like name of the actor, director, genres etc. Searching based on one of the parameter and recommending movies based on the parameter is how the current recommendation system works. The movies are recommended with the help of filtering technique i,e collaborative filtering which recommends the movies based on user preference and ratings of the movies. This can be further enhanced by taking multiple parameters (2 in this case) for searching the movies based on which the recommendation can be done. With the help of multiple parameters (2 in this case) the user can be more specific in what he wants to search so that it helps in more accurate recommendations of the movies.",
        "link": "http://dx.doi.org/10.53759/7669/jmc202202011"
    },
    {
        "id": 22778,
        "title": "Introduction to Evolutionary Machine Learning Techniques",
        "authors": "Seyedali Mirjalili, Hossam Faris, Ibrahim Aljarah",
        "published": "2020",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-32-9990-0_1"
    },
    {
        "id": 22779,
        "title": "Prediction of People’s Abnormal Behaviors Based on Machine Learning Algorithms",
        "authors": "Xiaoyu Song",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlise57402.2022.00087"
    },
    {
        "id": 22780,
        "title": "Crop Recommendation Using Machine Learning Algorithms and Soil Attributes Data",
        "authors": "Ritesh Ajoodha, Takalani Orifha Mufamadi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-7041-2_3"
    },
    {
        "id": 22781,
        "title": "Machine Learning Algorithms: An Experimental Evaluation for Decision Support Systems",
        "authors": "Hugo Silva, Jorge Bernardino",
        "published": "2022-4-15",
        "citations": 4,
        "abstract": "Decision support systems with machine learning can help organizations improve operations and lower costs with more precision and efficiency. This work presents a review of state-of-the-art machine learning algorithms for binary classification and makes a comparison of the related metrics between them with their application to a public diabetes and human resource datasets. The two mainly used categories that allow the learning process without requiring explicit programming are supervised and unsupervised learning. For that, we use Scikit-learn, the free software machine learning library for Python language. The best-performing algorithm was Random Forest for supervised learning, while in unsupervised clustering techniques, Balanced Iterative Reducing and Clustering Using Hierarchies and Spectral Clustering algorithms presented the best results. The experimental evaluation shows that the application of unsupervised clustering algorithms does not translate into better results than with supervised algorithms. However, the application of unsupervised clustering algorithms, as the preprocessing of the supervised techniques, can translate into a boost of performance.",
        "link": "http://dx.doi.org/10.3390/a15040130"
    },
    {
        "id": 22782,
        "title": "Novel Machine Learning (ML) Algorithms to Classify IPv6 Network Traffic in Resource-Limited Systems",
        "authors": "Yıldıran YILMAZ, Selim BUYRUKOĞLU, Muzaffer ALIM",
        "published": "2022-9-16",
        "citations": 0,
        "abstract": "Providing machine learning (ML) based security in heterogeneous IoT networks including resource-constrained devices is a challenge because of the fact that conventional ML algorithms require heavy computations.  Therefore, in this paper, lightweight ProtoNN, CMSIS-NN, and Bonsai tree ML algorithms were evaluated by using performance metrics such as testing accuracy, precision, F1 score and recall to test their classification ability on the IPv6 network dataset generated on resource-scarce embedded devices. The Bonsai tree algorithm provided the best performance results in all metrics (98.8 in accuracy, 98.9% in F1 score, 99.2% in precision, and 98.8% in recall) compared to the ProtoNN, and CMSIS-NN algorithms.",
        "link": "http://dx.doi.org/10.53070/bbd.1172706"
    },
    {
        "id": 22783,
        "title": "Content-Based Airline Recommendation Prediction Using Machine Learning Techniques",
        "authors": "Praphula Kumar Jain, Rajendra Pamula",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-50641-4_11"
    },
    {
        "id": 22784,
        "title": "Crop recommendation using machine learning algorithms",
        "authors": "Prashant Kumar, Keshav Bhagat, Kusum Lata, Sushant Jhingran",
        "published": "2023-5-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdt57929.2023.10151325"
    },
    {
        "id": 22785,
        "title": "Application of Machine Learning in Recommendation Algorithms",
        "authors": "Zhaoming Han",
        "published": "2022-12-3",
        "citations": 0,
        "abstract": "With the development of technology, the importance of recommendation algorithms in online transactions is gradually increasing. The development of machine learning is essential to improve the performance of recommendation algorithms. Therefore, a suitable model is urgently needed for recommendation algorithms. In order to evaluate the performance of classical machine learning algorithms against newer machine learning algorithms, four models were selected, namely Decision Tree model, Random Forest model, Gradient Boosting Decision Tree model and XGBoost model. They were subjected to regression analysis on the same dataset, and the final scores were derived from the four parameters r2_score, MSE, MAE, and expected variance. The article selects a set of recommendation dataset from Amazon platform and processes the noisy data in the dataset. The data is processed by three methods, namely direct deletion, character digitisation and natural language processing, to obtain a valid dataset of 19, 676 items, and divided into training and prediction sets according to 7:3. Next, the models included in the sklearn library in PYTHON were used for regression analysis to obtain the performance scores of each model. The Decision Tree model had the lowest score of 0.70584 and the Gradient Boosting Decision Tree model had the highest score of 0.85281. In addition, in general, the Decision Tree model scored much worse than the other three models, while the other three models scored more similarly.",
        "link": "http://dx.doi.org/10.54097/hset.v23i.3201"
    },
    {
        "id": 22786,
        "title": "DENGUE PREDICTION RECOMMENDATION ENGINE USING MACHINE LEARNING AND GENETIC HYBRID ALGORITHMS",
        "authors": "",
        "published": "2020-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.6/151"
    },
    {
        "id": 22787,
        "title": "Scientific Applications of Machine Learning Algorithms",
        "authors": "",
        "published": "2022-3-11",
        "citations": 0,
        "abstract": "This chapter considers several popular scientific applications of machine learning/data mining algorithms. The survey-like introductory section provides a brief overview of some relevant historical and trending applications, while the other four sections present specific details on four selected scientific applications. Each section focuses on one of the following algorithms: neural networks, rule induction, tree algorithms, and neighborhood-based algorithms. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8350-0.ch004"
    },
    {
        "id": 22788,
        "title": "Crop Recommendation System Using Machine Learning Algorithms",
        "authors": "Pranjali G. Gulhane, Anuradha Thakare",
        "published": "2022-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003355960-15"
    },
    {
        "id": 22789,
        "title": "Multiple Machine Learning Algorithms for Human Smoking Behavior Detection",
        "authors": "Chenxin Cui, Ruofeng Xu",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlise57402.2022.00054"
    },
    {
        "id": 22790,
        "title": "Development of Product Recommendation Engine By Collaborative Filtering and Association Rule Mining Using Machine Learning Algorithms",
        "authors": "Abhiraj Biswas, Kaza Sai Vineeth, Ayush Jain,  Mohana",
        "published": "2020-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icisc47916.2020.9171210"
    },
    {
        "id": 22791,
        "title": "An Adaptive Educational Content Recommendation System for UPSC as prints Based on their Past Performance Using Machine Learning Algorithms",
        "authors": "Danish Kundra",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icses60034.2023.10465345"
    },
    {
        "id": 22792,
        "title": "A Survey on Swarm Intelligence Algorithms Employed for Optimizing Machine Learning Techniques Used in Recommendation Systems",
        "authors": "Lim Cher Zet, Muhammed Basheer Jasser, Richard T.K. Wong, Hui Na Chua, Bayan Issa",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspc59664.2023.10419947"
    },
    {
        "id": 22793,
        "title": "Recommender Systems",
        "authors": "V Kishore Ayyadevara",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3564-5_13"
    },
    {
        "id": 22794,
        "title": "Endocrine Therapy Recommendation for Estrogen Receptor Positive (ER + ) Metastases Advanced Breast Cancer using Machine Learning Algorithms",
        "authors": "Reena Lokare, Sunita Patil",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nArtificial Intelligence (AI) technology has shown tremendous contribution in various applications like Speech Recognition, Expert Systems, Computer Vision, Robotics, Gaming etc. Machine Learning (ML) and Deep Learning (DL) algorithms under AI address problems such as prediction, classification and regression. AI has touched many domains like Finance, Healthcare, Retail, Travel, Media etc. The results or the predictions generated by these algorithms are not easily accepted by the user with the apprehension as what AI promises, how can they guarantee it? Especially the Healthcare domain is facing a great challenge in accepting the results or the predictions with the concern, are AI results reliable, correct and ethical? Doctors or medical practitioners aren’t ready to treat patients on the basis of results or suggestions generated by AI algorithms. Hence, a technology which can explain how the results returned by AI algorithms are trustworthy, transparent and interpretable was strongly needed. This need has given rise to the latest technology-Explainable Artificial Intelligence (XAI). With the use of XAI, all the predictions, classifications made by AI algorithms are explainable, auditable, comprehensive, validating and socially acceptable. This study will help medical practitioners and other researchers to use XAI for reliable, trustworthy and explainable results or suggestions provided by AI, ML, DL algorithms not only in healthcare but all other sectors adopting these technologies.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1378725/v1"
    },
    {
        "id": 22795,
        "title": "Estimating the Efficiency of Machine Learning Algorithms in Predicting Seizure With Convolutional Neural Network Architecture",
        "authors": "Jamunadevi C., Arul P.",
        "published": "2022",
        "citations": 1,
        "abstract": "The reason trends in prevalent detection of EEG seizure help in analyzing the various features of EEG signals to customize and to remove visual inspection in reading the EEG signals. Epilepsy is a disorder and is identified by baseless seizures that have been associated with unexpected improper neural discharges which result in various health issues and also result in death. One of the most common methods in detecting contraction seizures is an electroencephalogram. By using machine learning methods, it is easy to extract the features of EEG signals that help in detecting seizures. Convolutional neural network (CNN) includes both inputs as well as output layers that help in training the data acquired since it helps in analyzing the large set of high dimensional data. The performance analysis is done under multiple classifiers such as random forest, gradient boosting, and decision tree, which are used in feature extraction. Among them, random forest proves to be the best classifier in achieving a high degree of accuracy. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-9308-0.ch008"
    },
    {
        "id": 22796,
        "title": "Business and Industrial Applications of Machine Learning Algorithms",
        "authors": "",
        "published": "2022-3-11",
        "citations": 0,
        "abstract": "This chapter provides an overview of some popular business and industrial applications of machine learning/data mining algorithms. The survey-like introductory section provides a brief overview of some relevant historical and trending applications, while the other four sections present specific details on four selected business and industrial applications. Each section focuses on a different considered algorithm, namely neural networks, rule induction, tree algorithms, and neighborhood-based algorithms. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-8350-0.ch005"
    },
    {
        "id": 22797,
        "title": "Crop Yield Prediction and Fertilizer Recommendation System Using Hybrid Machine Learning Algorithms",
        "authors": "K P K Devan, B Swetha, P Uma Sruthi, S Varshini",
        "published": "2023-4-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csnt57126.2023.10134662"
    },
    {
        "id": 22798,
        "title": "Designing Hybrid Intelligence based Recommendation Algorithms: An Experience through Machine Learning Metaphor",
        "authors": "Arup Roy",
        "published": "2020-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31449/inf.v44i3.2926"
    },
    {
        "id": 22799,
        "title": "Performance Evaluation of Machine Learning Algorithms for a Cluster-based Crop Recommendation System",
        "authors": "Dalhatu Muhammed, Ehsan Ahvar, Shohreh Ahvar, Maria Trocan",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sitis61268.2023.00079"
    },
    {
        "id": 22800,
        "title": "RETAIL SALES FORECASTING INFORMATION SYSTEMS: COMPARISON BETWEEN TRADITIONAL METHODS AND MACHINE LEARNING ALGORITHMS",
        "authors": "",
        "published": "2022-3-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33965/is2022_202201l004"
    },
    {
        "id": 22801,
        "title": "Research on Personalized Recommendation System Based on Machine Learning",
        "authors": "Yong Fang",
        "published": "2022-2-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eebda53927.2022.9745026"
    },
    {
        "id": 22802,
        "title": "Endocrine Therapy Recommendation for Estrogen Receptor Positive (ER + ) Metastases Advanced Breast Cancer using Machine Learning Algorithms",
        "authors": "Reena Lokare, Sunita Patil",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nArtificial Intelligence (AI) technology has shown tremendous contribution in various applications like Speech Recognition, Expert Systems, Computer Vision, Robotics, Gaming etc. Machine Learning (ML) and Deep Learning (DL) algorithms under AI address problems such as prediction, classification and regression. AI has touched many domains like Finance, Healthcare, Retail, Travel, Media etc. The results or the predictions generated by these algorithms are not easily accepted by the user with the apprehension as what AI promises, how can they guarantee it? Especially the Healthcare domain is facing a great challenge in accepting the results or the predictions with the concern, are AI results reliable, correct and ethical? Doctors or medical practitioners aren’t ready to treat patients on the basis of results or suggestions generated by AI algorithms. Hence, a technology which can explain how the results returned by AI algorithms are trustworthy, transparent and interpretable was strongly needed. This need has given rise to the latest technology-Explainable Artificial Intelligence (XAI). With the use of XAI, all the predictions, classifications made by AI algorithms are explainable, auditable, comprehensive, validating and socially acceptable. This study will help medical practitioners and other researchers to use XAI for reliable, trustworthy and explainable results or suggestions provided by AI, ML, DL algorithms not only in healthcare but all other sectors adopting these technologies.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1378725/v2"
    },
    {
        "id": 22803,
        "title": "Category Based﻿ Location Aware Tourist Place Popularity Prediction and Recommendation System Using Machine Learning Algorithms",
        "authors": "Apeksha Arun Wadhe, Shraddha Suratkar",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-2894-9_16"
    },
    {
        "id": 22804,
        "title": "Comprehensive Survey on AQI Prediction Using Machine Learning Algorithms",
        "authors": "Imran Khan, Rashi Agarwal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2229-1_32"
    },
    {
        "id": 22805,
        "title": "AI-Based Agriculture Recommendation System for Farmers",
        "authors": "V. Vanitha, N. Rajathi, K. Prakash Kumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-3754-7_7"
    },
    {
        "id": 22806,
        "title": "Support Vector Machine: Applications and Improvements Using Evolutionary Algorithms",
        "authors": "Seyed Hamed Hashemi Mehne, Seyedali Mirjalili",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-32-9990-0_3"
    },
    {
        "id": 22807,
        "title": "Quantum Machine Learning: A comprehensive review on optimization of machine learning algorithms",
        "authors": "R Divya, J. Dinesh Peter",
        "published": "2021-11-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmss53060.2021.9673630"
    },
    {
        "id": 22808,
        "title": "Recommendation Systems",
        "authors": "Ameet V. Joshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-12282-8_21"
    },
    {
        "id": 22809,
        "title": "A COMPARATIVE STUDY FOR CROP RECOMMENDATION USING MACHINE LEARNING ALGORITHMS",
        "authors": "",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets45288"
    },
    {
        "id": 22810,
        "title": "Web Services Recommendation system using Machine Learning Algorithms",
        "authors": "Shrikant Dnyandeo Bhopale, Alok Sahu, Kishor K. Pandyaji",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170205"
    },
    {
        "id": 22811,
        "title": "Research on Mobile Caravan Insurance Recommendation Method Based on Machine Learning",
        "authors": "Hongwei Li",
        "published": "2021-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/caibda53561.2021.00010"
    },
    {
        "id": 22812,
        "title": "Movies Recommendation System Using Machine Learning Algorithms",
        "authors": "Zohaib Tahir, Kunwar Babar Ali",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10465879"
    },
    {
        "id": 22813,
        "title": "Knowledge Recommendation in Practice",
        "authors": "Jarosław Protasiewicz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-32696-7_6"
    },
    {
        "id": 22814,
        "title": "Crop Recommendation System using Machine Learning Algorithms",
        "authors": "Gaurav Chauhan, Alka Chaudhary",
        "published": "2021-12-10",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smart52563.2021.9676210"
    },
    {
        "id": 22815,
        "title": "Comparison of Machine Learning Algorithms for Human Activity Recognition",
        "authors": "Hassan Ashraf, Olivier Brüls, Cédric Schwartz, Mohamed Boutaayamou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011631500003414"
    },
    {
        "id": 22816,
        "title": "Proceedings 2022 Asia Conference on Algorithms, Computing and Machine Learning",
        "authors": "",
        "published": "2022-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cacml55074.2022.00002"
    },
    {
        "id": 22817,
        "title": "Optimization Techniques for Machine Learning",
        "authors": "Souad Taleb Zouggar, Abdelkader Adla",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-0994-0_3"
    },
    {
        "id": 22818,
        "title": "Machine Learning and Deep Learning Techniques",
        "authors": "Reena Thakur, Prashant Panse, Parul Bhanarkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-6645-5_11"
    },
    {
        "id": 22819,
        "title": "Machine-Learning Algorithms for Feature Selection from Gene Expression Data",
        "authors": "Nimrita Koul, Sunilkumar S. Manvi",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-2445-5_10"
    },
    {
        "id": 22820,
        "title": "Recommendation Systems",
        "authors": "Houda El Bouhissi",
        "published": "2022-10-14",
        "citations": 1,
        "abstract": "With the increasing amount of data produced daily, it becomes very difficult for users to find resources suitable to their needs. Recommendation systems, which are capable of providing individualized suggestions or guiding the user to interesting or relevant resources within a large data space, are proposed for this purpose. In this article, the authors do a comprehensive assessment of recommendation models, propose a categorization scheme, analyze challenges, and explore unresolved issues. In addition, they highlight new trends and future visions in this field of study, emphasizing the need of merging ontologies and machine-learning algorithms to increase the accuracy and efficiency of the recommender systems.",
        "link": "http://dx.doi.org/10.4018/978-1-7998-9220-5.ch169"
    },
    {
        "id": 22821,
        "title": "Netflix Recommendation System based on TF-IDF and Cosine Similarity Algorithms",
        "authors": "Mohamed Chiny, Marouane Chihab, Omar Bencharef, Younes Chihab",
        "published": "2021",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010727500003101"
    },
    {
        "id": 22822,
        "title": "Enhanced Machine Learning Algorithms for Validating the Biometrics in VANET",
        "authors": "Premkumar Chithaluru, Lambodar Jena, Bichitrananda Patra, Niranjan Panda",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlcss57186.2022.00011"
    },
    {
        "id": 22823,
        "title": "Machine Learning Algorithms in Recommendation System for Diagnosis of Breast Cancer According to Microwave Radiothermometry",
        "authors": "Alexander Losev, Alexander Petrenko",
        "published": "2020-11-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/summa50634.2020.9280608"
    },
    {
        "id": 22824,
        "title": "Evolutionary Machine Learning Techniques",
        "authors": "",
        "published": "2020",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-32-9990-0"
    },
    {
        "id": 22825,
        "title": "Knowledge Recommendation Systems with Machine Intelligence Algorithms",
        "authors": "Jarosław Protasiewicz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-32696-7"
    },
    {
        "id": 22826,
        "title": "Machine learning and deep learning algorithms for fault diagnosis of photovoltaic systems",
        "authors": "Adel Mellit, Soteris Kalogirou",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-820641-6.00006-5"
    },
    {
        "id": 22827,
        "title": "Detecting Anomalies in Financial Data Using Machine Learning Algorithms",
        "authors": "Alexander Bakumenko, Ahmed Elragal",
        "published": "2022-8-25",
        "citations": 11,
        "abstract": "Bookkeeping data free of fraud and errors are a cornerstone of legitimate business operations. The highly complex and laborious work of financial auditors calls for finding new solutions and algorithms to ensure the correctness of financial statements. Both supervised and unsupervised machine learning (ML) techniques nowadays are being successfully applied to detect fraud and anomalies in data. In accounting, it is a long-established problem to detect financial misstatements deemed anomalous in general ledger (GL) data. Currently, widely used techniques such as random sampling and manual assessment of bookkeeping rules become challenging and unreliable due to increasing data volumes and unknown fraudulent patterns. To address the sampling risk and financial audit inefficiency, we applied seven supervised ML techniques inclusive of deep learning and two unsupervised ML techniques such as isolation forest and autoencoders. We trained and evaluated our models on a real-life GL dataset and used data vectorization to resolve journal entry size variability. The evaluation results showed that the best trained supervised and unsupervised models have high potential in detecting predefined anomaly types as well as in efficiently sampling data to discern higher-risk journal entries. Based on our findings, we discussed possible practical implications of the resulting solutions in the accounting and auditing contexts.",
        "link": "http://dx.doi.org/10.3390/systems10050130"
    },
    {
        "id": 22828,
        "title": "Classifying Skin Cancer Images Based on Machine Learning Algorithms and a CNN Model",
        "authors": "S. Aswath, M. Kalaiyarivu Cholan",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-9650-3_10"
    },
    {
        "id": 22829,
        "title": "Introduction to Machine Learning",
        "authors": "",
        "published": "2020-1-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108690935.003"
    },
    {
        "id": 22830,
        "title": "E-learning and Data Mining using Machine Learning Algorithms",
        "authors": "Arulselvarani S",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaccs54159.2022.9785186"
    },
    {
        "id": 22831,
        "title": "Enhancing Evaluation of Machine Learning Algorithms with Visual Means",
        "authors": "Boris Kovalerchuk",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-73040-0_10"
    },
    {
        "id": 22832,
        "title": "Classification of Heart Rate Time Series Using Machine Learning Algorithms",
        "authors": "",
        "published": "2021-9-10",
        "citations": 1,
        "abstract": "An important diagnostic method for diagnosing abnormalities in the human heart is the electrocardiogram (ECG). A large number of heart patients increase the assignment of physicians. To reduce their assignment, an automatic computer detection system is needed. In this study, a computer system for classifying ECG signals is presented. The MIT-BIH, ECG arrhythmia database is used for analysis. After the ECG signal is noisy in the preprocessing stage, the data feature is extracted. In the feature extraction step, the decision tree is used and the support vector machine (SVM) is constructed to classify the ECG signal into two categories. It is normal or abnormal. The results show that the system classifies the given ECG signal with 90% sensitivity.",
        "link": "http://dx.doi.org/10.33140/amlai.02.01.09"
    },
    {
        "id": 22833,
        "title": "Music Recommendation System using Machine Learning Algorithms",
        "authors": "Kartik Kaushik",
        "published": "2021-7-31",
        "citations": 1,
        "abstract": "Music рlаys аn imроrtаnt rоle in humаn lifestyles.  Humans  рrefers  tо  hear  tо  musiс/songs  mоre  оften  thаn  аbig apple  оther  pursuit.  With    internet  teсhnоlоgies,    large  quantity  оf  musiс  соntent  hold  musiс  оf  several  genres  hаs  beсоme’s  eаsily  аccessible  tо  milliоns  оf  user  аrоund  whole  wоrld.  Musiс  group  sinсe  deсаde  аnd  соmрgrowing  оf  many  genres  оf  musiс  is  accessible.  The  mаjоr  diffiсulties  thаt    customer  fасe  is  tо  choose  аррrорriаte  song/musiс  frоm  suсh  big  collection of music.  The  objective  оf  our  рrоjeсt  wаs  tо  reсоmmend  sоngs  tо  customers  built  exclusively  оn  their  listening  habits,  with  nо  knowledge  аbоut  the  musiс.  Musiс  аррliсаtiоns  аre  аttemрting  tо  imрrоve  their  reсоmmendаtiоn  structures  in  оrder  tо  оffer  their  customers  the  quality  роssible  listening  exрerienсe  аnd  keeр  them  оn  their  рlаtfоrm.  For better   reсоmmendаtiоns,  view  аnаlysis  will  be  рerfоrm  оn  the  lyriсs  оf  sоng and  the use of  rаndоm-fоrest  аlgоrithm  will  be  use  fоr  сlаssified  the  song lines  intо  vаriоus  саtegоry  (hаррy,  sаd).",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.36946"
    },
    {
        "id": 22834,
        "title": "Graph and Natural Language Processing Based Recommendation System for Choosing Machine Learning Algorithms",
        "authors": "Y. Mahima, T.N.D.S. Ginige",
        "published": "2020-11-23",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icait51223.2020.9315570"
    },
    {
        "id": 22835,
        "title": "Intelligent Recommendation Platform for Film and Television Based on Machine Learning Algorithms",
        "authors": "Yue Liu, Tiannan Ren",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245052"
    },
    {
        "id": 22836,
        "title": "Landslide susceptibility assessment using locally weighted learning integrated with machine learning algorithms",
        "authors": "Haoyuan Hong",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121678"
    },
    {
        "id": 22837,
        "title": "Unsupervised Learning Algorithms for Hydropower’s Sensor Data",
        "authors": "Ajeet Rai",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-33-6691-6_11"
    },
    {
        "id": 22838,
        "title": "Product Recommendation Systems Based on Customer Reviews Using Machine Learning Techniques",
        "authors": "J. S. Shyam Mohan, Hanumath Sreeman Vedantham, Venkata Chakradhar Vanam, Nagendra Panini Challa",
        "published": "2021",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-8530-2_21"
    },
    {
        "id": 22839,
        "title": "The background of machine learning algorithms",
        "authors": "",
        "published": "2021-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/pbpc039e_ch4"
    },
    {
        "id": 22840,
        "title": "The Difference of Machine Learning and Deep Learning Algorithms",
        "authors": "Yew Kee Wong",
        "published": "2021-9-25",
        "citations": 0,
        "abstract": "In the information era, enormous amounts of data have become available on hand to decision makers. Big data refers to datasets that are not only big, but also high in variety and velocity, which makes them difficult to handle using traditional tools and techniques. Due to the rapid growth of such data, solutions need to be studiedand provided in order to handle and extract value and knowledge from these datasets. Machine learning is a method of data analysis that automates analytical model building. It is a branch of artificial intelligence based on the idea that systems can learn from data, identify patterns and make decisions with minimal human intervention. Such minimal human intervention can be provided using big data analytics, which is the application of advanced analytics techniques on big data. This paper aims to analyse some of the different machine learning algorithms and methods which can be applied to big data analysis, as well as the opportunities provided by the application of big data analytics in various decision making domains.",
        "link": "http://dx.doi.org/10.5121/csit.2021.111519"
    },
    {
        "id": 22841,
        "title": "Collaborative Filtering-based Robust Recommender System using Machine Learning Algorithms",
        "authors": "Utkarsh Pravind, Palak Porwal, Abhaya Kumar Sahoo, Chittaranjan Pradhan",
        "published": "2021-5-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367631888-1"
    },
    {
        "id": 22842,
        "title": "Machine Learning Algorithms for Breast Cancer Detection in Mammography Images: A Comparative Study",
        "authors": "Rhaylander Almeida, Dehua Chen, Agnaldo Filho, Wladmir Brandão",
        "published": "2021",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010440906600667"
    },
    {
        "id": 22843,
        "title": "Comparative Analysis of Machine Learning Algorithms for Imbalance Data Set Using Principle Component Analysis",
        "authors": "Swati V. Narwane, Sudhir D. Sawarkar",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-9650-3_8"
    },
    {
        "id": 22844,
        "title": "Energy Efficiency Optimization in Clustered Wireless Sensor Networks via Machine Learning Algorithms",
        "authors": "T. Sudarson Rama Perumal, V. Muthumanikandan, S. Mohanalakshmi",
        "published": "2021-8-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003107477-4"
    },
    {
        "id": 22845,
        "title": "Prediction of Health Complications among Firework Industry Workers Using Machine Learning Algorithms",
        "authors": "Indumathi N",
        "published": "2020-7-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12sp8/20202534"
    },
    {
        "id": 22846,
        "title": "Recommendation System For Anime Using Machine Learning Algorithms",
        "authors": "Abhipsa Jena, Arunima Jaiswal, Dakshita Lal, Soumya Rao, Afshan Ayubi, Nitin Sachdeva",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4121831"
    },
    {
        "id": 22847,
        "title": "Machine Learning Algorithms for building Recommender Systems",
        "authors": "Richa Sharma, Shalli Rani, Sarvesh Tanwar",
        "published": "2019-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccs45141.2019.9065538"
    },
    {
        "id": 22848,
        "title": "Artificial intelligence techniques: Machine learning and deep learning algorithms",
        "authors": "Adel Mellit, Soteris Kalogirou",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-820641-6.00002-8"
    },
    {
        "id": 22849,
        "title": "Predicting Depression From Social Media Users by Using Lexicons and Machine Learning Algorithms",
        "authors": "Santhi Selvaraj, S. Selva Nidhyananthan",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "Depression is one of the most common health issues among individuals. The rate of psychotic treatments is increasing day by day. Depression is created in many ways among the people, especially through work stress, financial burden, unemployment among the adults. Today, the emergence of social media into people's lives makes them expose their feelings and emotions on the social media platforms. The aim of this work is to predict the depressive features from social media users' comments by using machine learning techniques. Multinomial naïve bayes, non-linear support vector machine, and artificial neural network methods are used for classifying the features and comparing it using performance evaluation metrics and get the best classifier. This system includes data pre-processing, feature extraction, data splitting, classification, and performance evaluation. The results show that the proposed system has gradually improved performance accuracy. According to the results, ANN gives 99.19%, the best accuracy compared to other machine learning classifiers.",
        "link": "http://dx.doi.org/10.4018/978-1-6684-8531-6.ch012"
    },
    {
        "id": 22850,
        "title": "Electrical Price Prediction using Machine Learning Algorithms",
        "authors": "Swastik Mishra, Kanika Prasad, Anand Mukut Tigga",
        "published": "2023-1-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003104858-15"
    },
    {
        "id": 22851,
        "title": "Application of Machine Learning algorithms for power systems fault detection",
        "authors": "Nouha Bouchiba, Azeddine Kaddouri",
        "published": "2021-11-24",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsc50472.2021.9666726"
    },
    {
        "id": 22852,
        "title": "Credit Scoring Using Machine Learning Algorithms and Blockchain Technology",
        "authors": "Mariam Ossama Kotb",
        "published": "2023-7-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/imsa58542.2023.10217411"
    },
    {
        "id": 22853,
        "title": "DETECTION OF FAKE REVIEWS ON SOCIAL MEDIA USING MACHINE LEARNING ALGORITHMS",
        "authors": "",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48009/1_iis_2020_185-194"
    },
    {
        "id": 22854,
        "title": "Distributed Optimization in Machine Learning",
        "authors": "Gauri Joshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-19067-4_1"
    },
    {
        "id": 22855,
        "title": "Study on Machine Learning Algorithms to Automatically Identifying Body Type for Clothing Model Recommendation",
        "authors": "Evandro Costa, Emanuele Silva, Hemilis Rocha, Artur Maia, Thales Vieira",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-77700-9_8"
    },
    {
        "id": 22856,
        "title": "Epileptic Seizure Onset Prediction Using EEG with Machine Learning Algorithms",
        "authors": "Shruti Bijawat, Abhishek Dadhich",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-4936-6_16"
    },
    {
        "id": 22857,
        "title": "Yourcare: A diet and fitness recommendation system using machine learning algorithms",
        "authors": "Sarathchandran Hemaraju, Parvathi Manoj Kaloor, Krishnamoorthy Arasu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0134382"
    },
    {
        "id": 22858,
        "title": "Flight Arrival Delay Prediction Using Supervised Machine Learning Algorithms",
        "authors": "Hajar Alla, Lahcen Moumoun, Youssef Balouki",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-72588-4_16"
    },
    {
        "id": 22859,
        "title": "Disease Prediction and Hospital Recommendation using Machine Learning Algorithms",
        "authors": "Sandhya B",
        "published": "2020-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22214/ijraset.2020.5337"
    },
    {
        "id": 22860,
        "title": "Recommendation system for anime using machine learning algorithms",
        "authors": "Harsh Choudhary, S. Raghavendra,  Ramyashree",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003363781-11"
    },
    {
        "id": 22861,
        "title": "A0065 The Study of Graph Based Machine Learning Algorithms in Antihypertensive Drug Recommendation",
        "authors": "Xing Liu, Hong Yuan",
        "published": "2018-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1097/01.hjh.0000548376.30517.25"
    },
    {
        "id": 22862,
        "title": "COLPOUSIT: A Hybrid Model for Tourist Place Recommendation based on Machine Learning Algorithms",
        "authors": "Ummesalma M, Yashiga C",
        "published": "2021-6-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoei51242.2021.9452746"
    },
    {
        "id": 22863,
        "title": "A Fish Biomass Prediction Model for Aquaponics System Using Machine Learning Algorithms",
        "authors": "Pragnaleena Debroy, Lalu Seban",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-7996-4_27"
    },
    {
        "id": 22864,
        "title": "Dynamic Reusability Measurement Using Machine Learning Algorithms in Object-Oriented Environment",
        "authors": " Manju, Pradeep Kumar Bhatia",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-1295-4_40"
    },
    {
        "id": 22865,
        "title": "AgroConsultant: Intelligent Crop Recommendation System Using Machine Learning Algorithms",
        "authors": "Zeel Doshi, Subhash Nadkarni, Rashi Agrawal, Neepa Shah",
        "published": "2018-8",
        "citations": 88,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccubea.2018.8697349"
    },
    {
        "id": 22866,
        "title": "Basics of Machine Learning",
        "authors": "V Kishore Ayyadevara",
        "published": "2018",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3564-5_1"
    },
    {
        "id": 22867,
        "title": "Inference-based User’s Recommendation in E-learning Systems",
        "authors": "Youssef Elouahby, Rachid Elouahbi",
        "published": "2017-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14738/tmlai.54.3198"
    },
    {
        "id": 22868,
        "title": "Evaluating the Accuracy of Machine Learning Algorithms on Detecting Code Smells for Different Developers",
        "authors": "Mário Hozano, Nuno Antunes, Baldoino Fonseca, Evandro Costa",
        "published": "2017",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006338804740482"
    },
    {
        "id": 22869,
        "title": "Evaluation of Machine Learning Algorithms for Surface Water Delineation Using Landsat 8 Images",
        "authors": "Bijeesh T.V.",
        "published": "2020-3-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12i3/20201184"
    },
    {
        "id": 22870,
        "title": "A Review on Data Privacy Using Machine Learning Algorithms Over Block Chain Methods",
        "authors": "Sivasankari K.",
        "published": "2020-7-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12i7/20202036"
    }
]