[
    {
        "id": 1801,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/resmil.v10i1.13"
    },
    {
        "id": 1802,
        "title": "Multiclass Texture Synthesis Using Generative Adversarial Networks",
        "authors": "Maroš Kollár, Lukas Hudec, Wanda Benesova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011657500003417"
    },
    {
        "id": 1803,
        "title": "NATURE-INSPIRED DESIGN IDEA GENERATION WITH GENERATIVE ADVERSARIAL NETWORKS",
        "authors": "Nurullah YÜKSEL, Hüseyin Rıza BÖRKLÜ",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "Generating new, creative, and innovative ideas in the early stages of the design process is crucial for developing better and original products. Human designers may become too attached to specific design ideas, preventing them from generating new concepts and achieving ideal designs. To come up with original design ideas, a designer needs to have a creative mind, as well as knowledge, experience, and talent. Verbal, written, and visual sources of inspiration can also be valuable for generating ideas and concepts. This study presents a visual integration model that uses a data-supported Artificial Intelligence (AI) method to generate creative design ideas. The proposed model is based on a generative adversarial network (GAN) that combines target object and biological object images to produce new creative product images inspired by nature. The model was successfully applied to an aircraft design problem and the resulting sketches inspired designers to generate new and creative design ideas and variants in a case study. It was seen that this approach improved the quality of the ideas produced and simplified the idea and concept generation process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46519/ij3dptdi.1239487"
    },
    {
        "id": 1804,
        "title": "Privacy Protection of Synthetic Smart Grid Data Simulated via Generative Adversarial Networks",
        "authors": "Kayode Adewole, Vicenç Torra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011956800003555"
    },
    {
        "id": 1805,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS (2019)",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/jcr.06.07.109"
    },
    {
        "id": 1806,
        "title": "MAGAN: A Meta-Analysis for Generative Adversarial Networks’ Latent Space",
        "authors": "Frederic Rizk, Rodrigue Rizk, Dominick Rizk, Chee-Hung Chu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011771900003411"
    },
    {
        "id": 1807,
        "title": "Multi-View Inversion for 3D-aware Generative Adversarial Networks",
        "authors": "Florian Barthel, Anna Hilsmann, Peter Eisert",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012371000003660"
    },
    {
        "id": 1808,
        "title": "Unpaired Bone Marrow Smears Virtual Staining Using Content and Attention-Guided Generative Adversarial Networks: UBMSVStain Using Content and Attention-Guided Generative Adversarial Networks",
        "authors": "Aman Wang, Ruijie Zhu",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3644116.3644228"
    },
    {
        "id": 1809,
        "title": "Adversarial Attacks on Deep Neural Networks using Generative Perturbation Networks",
        "authors": "Sudharman K. Jayaweera",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10201189"
    },
    {
        "id": 1810,
        "title": "BSDGAN: Balancing Sensor Data Generative Adversarial Networks for Human Activity Recognition",
        "authors": "Yifan Hu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191928"
    },
    {
        "id": 1811,
        "title": "Leveraging Dual-Generative Adversarial Networks for Adversarial Malware Detection via Ensemble Learning",
        "authors": "Lucas Gordon",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nIn the expanding realm of cybersecurity, machine learning-based malware detection has emerged as a vital line of defense. However, the growing sophistication of malware attacks poses formidable challenges to conventional detection systems. To address this, this paper uses a Generative Adversarial Network that utilizes dual generators for adversarial learning on malware, designed to enhance the detection of harmful Portable Executable (PE) files. Our model employs a two-tiered generator system within the GAN architecture, where the secondary generator intervenes when the primary generator yields a malware PE executable dismissed by the detector.\r\nThe detection unit leverages ensemble learning techniques to analyze the PE software feature vector, capitalizing on the synergy of multiple learning models for improved performance and generalization. This setup empowers the system to generate a broader range of adversarial examples and respond to them effectively, enhancing the robustness of the detector against previously unseen or variable malware types.\r\n\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.24908/iqurcp16688"
    },
    {
        "id": 1812,
        "title": "Quality-Aware Conditional Generative Adversarial Networks for Precipitation Nowcasting",
        "authors": "Jahnavi Jonnalagadda, Mahdi Hashemi",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039011"
    },
    {
        "id": 1813,
        "title": "Data Generation with Variational Autoencoders and Generative Adversarial Networks",
        "authors": "Daniil Devyatkin, Ivan Trenev",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023033037"
    },
    {
        "id": 1814,
        "title": "Generative Adversarial Networks",
        "authors": "Moez Krichen",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306417"
    },
    {
        "id": 1815,
        "title": "STE-GAN: Speech-to-Electromyography Signal Conversion using Generative Adversarial Networks",
        "authors": "Kevin Scheck, Tanja Schultz",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-174"
    },
    {
        "id": 1816,
        "title": "Biologically Informed Generative Adversarial Networks for Modeling and Prediction",
        "authors": "Anagha Savit",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/isal_a_00589"
    },
    {
        "id": 1817,
        "title": "Diverse Level Generation for Tile-Based Video Game using Generative Adversarial Networks from Few Samples",
        "authors": "Soichiro Takata, Yuichi Sei, Yasuyuki Tahara, Akihiko Ohsuga",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011666200003393"
    },
    {
        "id": 1818,
        "title": "Wearable Data Generation Using Time-Series Generative Adversarial Networks for Hydration Monitoring",
        "authors": "Farida Sabry, Wadha Labda, Tamer Eltaras, Fatima Hamza, Khawla Alzoubi, Qutaibah Malluhi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011757200003414"
    },
    {
        "id": 1819,
        "title": "Generating Realistic Aircraft Trajectories Using Generative Adversarial Networks",
        "authors": "Petr Lukeš, Pavel Kulmon",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/irs57608.2023.10172407"
    },
    {
        "id": 1820,
        "title": "Similarity-Based Gossip Learning for Generative Adversarial Networks",
        "authors": "Jiaxin Zhang, Liang Zhao, Na Lin",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsn57992.2023.10297386"
    },
    {
        "id": 1821,
        "title": "Application of a Deep Generative Model for Diversified Video Subtitles Based on Generative Adversarial Networks",
        "authors": "Lingzhi Shen",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acctcs58815.2023.00080"
    },
    {
        "id": 1822,
        "title": "Retracted: Cryptospace Invertible Steganography with Conditional Generative Adversarial Networks",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9764791"
    },
    {
        "id": 1823,
        "title": "Recent Advances in Generative Adversarial Networks for Gene Expression Data: A Comprehensive Review",
        "authors": "Minhyeok Lee",
        "published": "2023-7-10",
        "citations": 6,
        "abstract": "The evolving field of generative artificial intelligence (GenAI), particularly generative deep learning, is revolutionizing a host of scientific and technological sectors. One of the pivotal innovations within this domain is the emergence of generative adversarial networks (GANs). These unique models have shown remarkable capabilities in crafting synthetic data, closely emulating real-world distributions. Notably, their application to gene expression data systems is a fascinating and rapidly growing focus area. Restrictions related to ethical and logistical issues often limit the size, diversity, and data-gathering speed of gene expression data. Herein lies the potential of GANs, as they are capable of producing synthetic gene expression data, offering a potential solution to these limitations. This review provides a thorough analysis of the most recent advancements at this innovative crossroads of GANs and gene expression data, specifically during the period from 2019 to 2023. In the context of the fast-paced progress in deep learning technologies, accurate and inclusive reviews of current practices are critical to guiding subsequent research efforts, sharing knowledge, and catalyzing continual growth in the discipline. This review, through highlighting recent studies and seminal works, serves as a key resource for academics and professionals alike, aiding their journey through the compelling confluence of GANs and gene expression data systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11143055"
    },
    {
        "id": 1824,
        "title": "Training generative adversarial networks by auxiliary adversarial example regulator",
        "authors": "Yan Gan, Mao Ye, Dan Liu, Yiguang Liu",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110086"
    },
    {
        "id": 1825,
        "title": "Generative Adversarial Networks to Secure Vehicle-to-Microgrid Services",
        "authors": "Ahmed Omara, Burak Kantarci",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vcc60689.2023.10475111"
    },
    {
        "id": 1826,
        "title": "Regularizing Label-Augmented Generative Adversarial Networks Under Limited Data",
        "authors": "Liang Hou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3259066"
    },
    {
        "id": 1827,
        "title": "Virtual Wearable Sensor Data Generation with Generative Adversarial Networks",
        "authors": "Yining Huang, Hong Wan, Xi Chen",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wsc60868.2023.10407328"
    },
    {
        "id": 1828,
        "title": "Human Body Security Screening Image Data Augmentation Using Generative Adversarial Networks",
        "authors": "Kasai Abdulmajid",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4730822"
    },
    {
        "id": 1829,
        "title": "Evaluating Generative Adversarial Networks: A Topological Approach",
        "authors": "Narges Alipourjeddi, Ali Miri",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074146"
    },
    {
        "id": 1830,
        "title": "TCGAN: Convolutional Generative Adversarial Network for time series classification and clustering",
        "authors": "Fanling Huang, Yangdong Deng",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.033"
    },
    {
        "id": 1831,
        "title": "A Review on Drawbacks and Limitations of Generative Adversarial Networks",
        "authors": "Amitesh Kumar Singam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4739618"
    },
    {
        "id": 1832,
        "title": "Supervised Contrastive Generative Adversarial Networks",
        "authors": "Honglei Gu",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Generative Adversarial Networks (GANs) is becoming more and more popular, artists use them to find their own inspirations, computer scientists use it for data synthesis, workers use it for machine fault diagnosis and so on. However, GANs are flawed despite its popularity: they are unstable. GANs are based on game theory. In a typical GAN model, the generator and the discriminator are both improved by competing with each other. Therefore, in this highly competitive training process, GANs can easily run into trouble while they move towards the optimal solution. In most cases, the case of such instability arises from the loss function, or in other words, the gradient of the loss function. This research proposed a new set of GAN that replaces its objective function with supcon, or the supervised contrastive loss to solve gradient-related problems. We have also proved that under our model, the GANs are less likely to suffer from these two factors of instability. Finally, we have compared our model and the traditional generative adversarial nets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/5/20230428"
    },
    {
        "id": 1833,
        "title": "Clustering Using Conditional Generative Adversarial Networks (cGANs)",
        "authors": "Marek Ružička, Matúš Dopiriak",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/radioelektronika57919.2023.10109069"
    },
    {
        "id": 1834,
        "title": "Improved Two Stage Generative Adversarial Networks for Adversarial\nExample Generation with Real Exposure",
        "authors": "Priyanka Goyal, Deepesh Singh",
        "published": "2023-9",
        "citations": 0,
        "abstract": "\nIntroduction:\nDeep neural networks due to their linear nature are sensitive to adversarial examples. They can easily be broken just by a small disturbance to the input data. Some of the existing methods to perform these kinds of attacks are pixel-level perturbation and spatial transformation of images.\n\n\nMethod:\nThese methods generate adversarial examples that can be fed to the network for wrong predictions. The drawback that comes with these methods is that they are really slow and computationally expensive. This research work performed a black box attack on the target model classifier by using the generative adversarial networks (GAN) to generate adversarial examples that can fool a classifier model to classify the images as wrong classes. The proposed method used a biased dataset that does not contain any data of the target label to train the first generator Gnorm of the first stage GAN, and after the first training has finished, the second stage generator Gadv, which is a new generator model that does not take random noise as input but the output of the first generator Gnorm.\n\n\nResult:\nThe generated examples have been superimposed with the Gnorm output with a small constant, and then the superimposed data have been fed to the target model classifier to calculate the loss. Some additional losses have been included to constrain the generation from generating target examples.\n\n\nConclusion:\nThe proposed model has shown a better fidelity score, as evaluated using Fretchet inception distance score (FID), which was up to 42.43 in the first stage and up to 105.65 in the second stage with the attack success rate of up to 99.13%.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/2666255816666230608104148"
    },
    {
        "id": 1835,
        "title": "Single-Channel Speech Quality Enhancement in Mobile Networks Based on Generative Adversarial Networks",
        "authors": "Guifen Wu, Norbert Herencsar",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11036-024-02300-4"
    },
    {
        "id": 1836,
        "title": "On the Use of Generative Adversarial Networks to Predict Health Status Among Chronic Patients",
        "authors": "María Jurado-Camino, David Chushig-Muzo, Cristina Soguero-Ruiz, Pablo Bohoyo, Inmaculada Mora-Jiménez",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011690500003414"
    },
    {
        "id": 1837,
        "title": "Improved Method for Pedestrian Recognition Based on Generative Adversarial Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/jaip.2023.060204"
    },
    {
        "id": 1838,
        "title": "Generative Adversarial Networks: A Brief History and Overview",
        "authors": "Akhil Gunasekaran",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Over the past decade, research in the field of Deep Learning has brought about novel improvements in image generation and feature learning; one such example being a Generative Adversarial Network. However, these improvements have been coupled with an increasing demand on mathematical literacy and previous knowledge in the field. Therefore, in this literature review, I seek to introduce Generative Adversarial Networks (GANs) to a broader audience by explaining their background and intuition at a more foundational level. I begin by discussing the mathematical background of this architecture, specifically topics in linear algebra and probability theory. I then proceed to introduce GANs in a more theoretical framework, along with some of the literature on GANs, including their architectural improvements and image-generation capabilities. Finally, I cover state-of-the-art image generation through style-based methods, as well as their implications on society.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsr.v12i1.1848"
    },
    {
        "id": 1839,
        "title": "Performance Analysis of Convolutional Neural Networks and Multilayer Perceptron in Generative Adversarial Networks",
        "authors": "Siyuan Guan",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10076041"
    },
    {
        "id": 1840,
        "title": "A Taxonomy for Generative Adversarial Networks in Dynamic Adaptive Streaming Over HTTP",
        "authors": "Koffka Khan,  ",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Generative Adversarial Networks (GANs) have emerged as a powerful tool in the field of Dynamic Adaptive Streaming over HTTP (DASH) to enhance various aspects of video streaming. This paper presents a taxonomy that categorizes the applications and techniques of GANs in the context of DASH. The taxonomy covers several key dimensions, including video generation, compression, quality enhancement, bandwidth adaptation, dynamic bitrate streaming, and cross-modal applications. Within each dimension, specific subcategories are identified to capture the diverse applications of GANs in DASH. Additionally, evaluation metrics for assessing the quality and effectiveness of GAN-based approaches are discussed. The taxonomy serves as a comprehensive framework to understand and organize the different ways in which GANs can be utilized to improve the streaming experience in DASH. By providing an organized structure, this taxonomy facilitates better understanding, comparison, and exploration of GAN-based approaches in DASH and enables researchers and practitioners to identify areas for further research and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijmra/v6-i6-45"
    },
    {
        "id": 1841,
        "title": "On Generating Synthetic Histopathology Images Using Generative Adversarial Networks",
        "authors": "Seán Carmody, Deepu John",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/issc59246.2023.10162094"
    },
    {
        "id": 1842,
        "title": "Image flare removal using Deep Convolutional Generative Adversarial Networks",
        "authors": "Ishan Prakash,  Aryan, S. Indu, Mini Sreejeth",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116874"
    },
    {
        "id": 1843,
        "title": "The Deep Learning Generative Adversarial Random Neural Network in data marketplaces: The digital creative",
        "authors": "Will Serrano",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.028"
    },
    {
        "id": 1844,
        "title": "Camera Tripod Removal Model in Panoramic Images Based on Generative Adversarial Networks",
        "authors": "Jian Wu Jian Wu, Honghui Deng Jian Wu, Fei Cheng Honghui Deng, Hongjun Wang Fei Cheng",
        "published": "2023-6",
        "citations": 0,
        "abstract": "\n                        <p>There are often residual images of the camera tripod in panoramic images, which may reduce the image quality and deteriorate the post-processing speed. To address this problem, a camera tripod removal network (TRNet) based on generative adversarial network&nbsp;is proposed. As an end-to-end model, the generator is designed to include recognition and reconstruction branches, which reduce the number of parameters and improve the training efficiency by sharing the encoder&nbsp;and correspond to scaffold recognition and texture reconstruction respectively. The recognition branch based on the U-Net structure can effectively identify the tripod area, while the reconstruction branch can brilliantly reconstruct the texture details through an intermediate layer formed by stacking dilated convolution residual blocks.  Furthermore, spectral normalized Markov discriminator and multiple combined loss function&nbsp;are adopted to promote global texture consistency and thus result in a better texture filling effect. Finally, a data set of 400 panoramic images is constructed and experimental results on this data set demonstrate the better repair ability&nbsp;of TRNet against other state-of-the-art methods.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/199115992023063403002"
    },
    {
        "id": 1845,
        "title": "Image Matting Algorithm Using Deep Generative Adversarial Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2023.061109"
    },
    {
        "id": 1846,
        "title": "Context-based Image Inpainting with Improved Generative Adversarial Networks",
        "authors": "Minqian Qian, Bo Chen, Weiqin Chen",
        "published": "2023-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105714"
    },
    {
        "id": 1847,
        "title": "Optimization Strategy for Generative Adversarial Networks Design",
        "authors": "Oleksandr Striuk, Yuriy Kondratenko",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "Generative Adversarial Networks (GANs) are a powerful class of deep learning models that can generate realistic synthetic data. However, designing and optimizing GANs can be a difficult task due to various technical challenges. The article provides a comprehensive analysis of solution methods for GAN performance optimization. The research covers a range of GAN design components, including loss functions, activation functions, batch normalization, weight clipping, gradient penalty, stability problems, performance evaluation, mini-batch discrimination, and other aspects. The article reviews various techniques used to address these challenges and highlights the advancements in the field. The article offers an up-to-date overview of the state-of-the-art methods for structuring, designing, and optimizing GANs, which will be valuable for researchers and practitioners. The implementation of the optimization strategy for the design of standard and deep convolutional GANs (handwritten digits and fingerprints) developed by the authors is discussed in detail, the obtained results confirm the effectiveness of the proposed optimization approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47839/ijc.22.3.3223"
    },
    {
        "id": 1848,
        "title": "Training Generative Adversarial Networks with Adaptive Composite\n                    Gradient",
        "authors": "Huiqing Qi, Fang Li, Shengli Tan, Xiangyun Zhang",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "ABSTRACT\nThe wide applications of Generative adversarial networks benefit from the successful training methods, guaranteeing that an object function converges to the local minimum. Nevertheless, designing an efficient and competitive training method is still a challenging task due to the cyclic behaviors of some gradient-based ways and the expensive computational cost of acquiring the Hessian matrix. To address this problem, we proposed the Adaptive Composite Gradients(ACG) method, linearly convergent in bilinear games under suitable settings. Theory analysis and toy-function experiments both suggest that our approach alleviates the cyclic behaviors and converges faster than recently proposed SOTA algorithms. The convergence speed of the ACG is improved by 33% than other methods. Our ACG method is a novel Semi-Gradient-Free algorithm that can reduce the computational cost of gradient and Hessian by utilizing the predictive information in future iterations. The mixture of Gaussians experiments and real-world digital image generative experiments show that our ACG method outperforms several existing technologies, illustrating the superiority and efficacy of our method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/dint_a_00246"
    },
    {
        "id": 1849,
        "title": "Predicting Ground Surface Deformation Induced by Pressurized Fractures Using Conditional Generative Adversarial Networks",
        "authors": "S. Salimzadeh, D. Kasperczyk, T. Kadeethum",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "\nABSTRACT\nHydraulic fracturing has been widely applied in subsurface to facilitate hydrocarbon flow or as a preconditioning method to promote normal caving behavior in mining operations. The success of the method prominently relies on the geometry of the induced fractures in the host rock. An array of high-resolution tiltmeters is commonly used to measure the displacement gradient (tilt angle) of ground surface during hydraulic fracturing operation, and to infer the geometry of the induced fractures. In this work, we present a machine-learned model that is capable of predicting the surface tilt resulting from a pressurized fracture, using Conditional Generative Adversarial Networks (cGAN). Fracture apertures along horizontal and vertical planes are given as input while surface tilt vectors are provided as output for the forward model. A 3D finite element model with discrete fractures is utilized as the Full Order Model (FOM) to create training data. The fractures are pressurized uniformly to induce a displacement at the ground surface. Images of the fracture aperture in XY and XZ planes, and surface tilt vector components (tilt X and tilt Y) are used for the training process. Three different loss functions are used, and the predicted tilts are compared to the real (FOM) tilts. The results show that the trained cGAN with Wasserstein loss and gradient penalty (W-model) can predict the ground surface tilt due to the pressurized fractures at variable dip angles.\n\n\nINTRODUCTION\nHydraulic fracturing has been frequently applied as a preconditioning method to promote normal caving behavior in mining operations. The success of the method prominently relies on the geometry of the induced fractures in the stiff overburden layer. An array of high-resolution tiltmeters is commonly used to measure the displacement gradient (tilt angle) of ground surface during hydraulic fracturing operation, and to infer the geometry of the induced fractures or pressure plumes using simplified models (Lecampion et al., 2005; Salimzadeh et al., 2022).\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.56952/arma-2023-0218"
    },
    {
        "id": 1850,
        "title": "Zero-Inflated Text Data Analysis using Generative Adversarial Networks and Statistical Modeling",
        "authors": "Sunghae Jun",
        "published": "2023-12-10",
        "citations": 1,
        "abstract": "In big data analysis, various zero-inflated problems are occurring. In particular, the problem of inflated zeros has a great influence on text big data analysis. In general, the preprocessed data from text documents are a matrix consisting of the documents and terms for row and column, respectively. Each element of this matrix is an occurred frequency of term in a document. Most elements of the matrix are zeros, because the number of columns is much larger than the rows. This problem is a cause of decreasing model performance in text data analysis. To overcome this problem, we propose a method of zero-inflated text data analysis using generative adversarial networks (GAN) and statistical modeling. In this paper, we solve the zero-inflated problem using synthetic data generated from the original data with zero inflation. The main finding of our study is how to change zero values to the very small numeric values with random noise through the GAN. The generator and discriminator of the GAN learned the zero-inflated text data together and built a model that generates synthetic data that can replace the zero-inflated data. We conducted experiments and showed the results, using real and simulation data sets to verify the improved performance of our proposed method. In our experiments, we used five quantitative measures, prediction sum of squares, R-squared, log-likelihood, Akaike information criterion and Bayesian information criterion to evaluate the model’s performance between original and synthetic data sets. We found that all performances of our proposed method are better than the traditional methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12120258"
    },
    {
        "id": 1851,
        "title": "Application of Knowledge Distillation in Generative Adversarial Networks",
        "authors": "Xu Zhang",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acctcs58815.2023.00014"
    },
    {
        "id": 1852,
        "title": "Performance Comparison of Generative Adversarial Networks and Neural Networks on Cancers Detection",
        "authors": "Amit Kumar Bishnoi,  Manivasagam, Rakhi Gupta",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470909"
    },
    {
        "id": 1853,
        "title": "Prediction of Time Series Using Generative Adversarial Networks",
        "authors": "Ao Di Ding",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isctis58954.2023.10213145"
    },
    {
        "id": 1854,
        "title": "Review of Speech Enhancement Methods using Generative Adversarial Networks",
        "authors": "Didin Skariah, Joshua Thomas",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57789.2023.10164848"
    },
    {
        "id": 1855,
        "title": "A Generative Adversarial Networks Based Approach for Literary Translation",
        "authors": "",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17559/tv-20221222092039"
    },
    {
        "id": 1856,
        "title": "IPattern: Islamic-Inspired Pattern Generation Using Generative Adversarial Networks",
        "authors": "Moutaz Saleh, Roudha Al-Rumaihi, Slafa Al-Dulaimi, Alaa Abashar",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323993"
    },
    {
        "id": 1857,
        "title": "Synthetic Electricity Consumption Data Generation Using Tabular Generative Adversarial Networks",
        "authors": "Thet Paing Tun, Ioana Pisica",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/upec57427.2023.10294666"
    },
    {
        "id": 1858,
        "title": "Generative Adversarial Networks for the Inverse Design of 2D Spinodoid Metamaterials",
        "authors": "Sheng Liu, Pinar Acar",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-0037"
    },
    {
        "id": 1859,
        "title": "An Enhanced Network Intrusion Detection Method Using Auxiliary Classifier Generative Adversarial Networks",
        "authors": "Yawei Tian, Yusun Fu, Zhenyuan Ji",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451618"
    },
    {
        "id": 1860,
        "title": "Gait Recognition using Deep Residual Networks and Conditional Generative Adversarial Networks",
        "authors": "Entesar B. Talal, Zakariya A. Oraibi, Ali Wali",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00178"
    },
    {
        "id": 1861,
        "title": "Enhanced damage classification accuracy on a transmission by extending existing datasets with generative adversarial networks",
        "authors": "Timo König, Fabian Wagner, Markus Kley, Marcus Liebschner",
        "published": "2023-6",
        "citations": 1,
        "abstract": "AbstractIn many areas of drive technology, condition monitoring of transmissions and drive systems is becoming an increasingly important discipline. Condition monitoring systems are used in many cases in combination with machine learning algorithms. The generation of a sufficient amount of data per condition class is relevant to ensure training stability and accuracy of the applied algorithms. Especially in early development phases a sufficient data generation is not often given. In the scope of this paper, a Generative Adversarial Network is applied to generate synthetic data and therefore extend existing measurement data sets. Acceleration data in three different condition classes is used, that has been collected on a gearbox as part of the PHM Data Challenge 2009. In order to highlight relevant features and reduce the number of data points, data is pre-processed via appropriate signal analysis techniques, in this case with the spectral kurtosis. It is shown, that in this use case the synthetically generated data via a Generative Adversarial Network has the same feature characteristics as the real measured data sets. The augmentation of the existing data set also improves the detection accuracy with artificial neural networks for the classification of different system states.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10010-023-00668-5"
    },
    {
        "id": 1862,
        "title": "Offline handwritten signature recognition based on generative adversarial networks",
        "authors": "Xiaoguang Jiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbm.2024.10059894"
    },
    {
        "id": 1863,
        "title": "Historic Image Colorization with Generative Adversarial Networks",
        "authors": "Md. Rezowan Talukder, A N Tanvir, Taslima Akbar Keya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4413265"
    },
    {
        "id": 1864,
        "title": "Challenges, Corresponding Solutions, and Applications of Generative Adversarial Networks",
        "authors": "Hongbo Zhong",
        "published": "2023-7-11",
        "citations": 0,
        "abstract": "Generative adversarial networks (GANs) have become a popular deep learning framework in the field of artificial intelligence. Researchers have developed various types of GANs, such as Conditional GANs (CGANs), Mode Dropping GANs (MDGANs), and Wasserstein GANs (WGANs), which have been applied to many different fields. Despite the success of GANs in various tasks, there are still some challenges that need to be addressed. For example, model collapse, non-convergence, and diminished gradient could hinder the training of GANs. In this paper, the authors first introduce the basics of GANs before highlighting a few common problems associated with GANs and their corresponding solutions. For instance, they discuss techniques such as mini-batch discrimination and batch normalization that can help mitigate model collapse and diminish gradient problems. Additionally, they cover methods that can improve the convergence rate and stability of GANs, such as using alternative loss functions and incorporating regularization algorithms. Finally, this paper briefly introduces some recent applications of GANs in image generation, video prediction, and other areas. Despite the challenges that still exist, GANs have shown great promise in various fields, and with further research, GANs have the potential to become more robust and efficient models for generating high-quality synthetic data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v57i.9991"
    },
    {
        "id": 1865,
        "title": "Improving satellite pose estimation across domain gap with generative adversarial networks",
        "authors": "A. Lotti",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Abstract. Pose estimation from a monocular camera is a critical technology for in-orbit servicing missions. However, collecting large image datasets in space for training neural networks is impractical, resulting in the use of synthetic images. Unfortunately, these often fail to accurately replicate real image features, leading to a significant domain gap. This work explores the use of generative adversarial networks as a solution for bridging this gap from the data level by making synthetic images more closely resemble real ones. A generative model is trained on a small subset of unpaired synthetic and real pictures from the SPEED+ dataset. The entire synthetic dataset is then augmented using the generator, and employed to train a regression model, based on the MetaFormer architecture, which locates a set of landmarks. By comparing the model's pose estimation accuracy on real images with and without generator preprocessing, it is observed that the augmentation effectively reduces the median pose estimation error by a factor 1.4 to 5. This compelling result validates the efficacy of these tools and justifies further research in their utilization. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21741/9781644902677-55"
    },
    {
        "id": 1866,
        "title": "Deep Convolutional Generative Adversarial Networks for Crime Scene Object Detection",
        "authors": "Uma N",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250517"
    },
    {
        "id": 1867,
        "title": "RegraphGAN: A graph generative adversarial network model for dynamic network anomaly detection",
        "authors": "Dezhi Guo, Zhaowei Liu, Ranran Li",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.07.026"
    },
    {
        "id": 1868,
        "title": "Temporally Conditioning of Generative Adversarial Networks with LSTM for Music Generation",
        "authors": "Romit Mohanty, Pranjal Pratap Dubey, Tushar Sandhan",
        "published": "2023-3-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10117324"
    },
    {
        "id": 1869,
        "title": "Limit Order Book Simulation with Generative Adversarial Networks",
        "authors": "Rama Cont, Mihai Cucuringu, Jonathan Kochems, Felix Prenzel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4512356"
    },
    {
        "id": 1870,
        "title": "Generating Synthetic Text using Generative Adversarial Networks",
        "authors": "Nisha Sahal, Ramkumar Krishnamoorthy, Navjot Singh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470722"
    },
    {
        "id": 1871,
        "title": "Synthesizing credit data using autoencoders and generative adversarial networks",
        "authors": "Goran Oreski",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110646"
    },
    {
        "id": 1872,
        "title": "A generative model for Chinese character style fusion based on generative adversarial networks",
        "authors": "Lvqing Zhou, Zhiqiang Dong, Xiongkai Chen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004721"
    },
    {
        "id": 1873,
        "title": "An Overview of Generative Adversarial Networks",
        "authors": "Xinyue Long, Mingchuan Zhang",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "Generative adversarial network (GAN), put forward by two-person zero-sum game theory, is one of the most important research hotspots in the field of artificial intelligence. With a generator network and a discriminator network, GAN is trained by adversarial learning. In this paper, we aim to discusses the development status of GAN. We first introduce the basic idea and training process of GAN in detail, and summarize the structure and structure of GAN derivative models, including conditional GAN, deep convolution DCGAN, WGAN based on Wasserstein distance and WGAN-GP based on gradient strategy. We also introduce the specific applications of GAN in the fields of information security, face recognition, 3D and video technology, and summarize the shortcomings of GAN. Finally, we look forward to the development trend of GAN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jceim.v10i3.8677"
    },
    {
        "id": 1874,
        "title": "Pretraining technology of adversarial generative networks based data selection",
        "authors": "Ziyi Zhao",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "The effectiveness of adversarial generative networks (GANs) has been shown in many works. However, the convergence of the GANs should be granted mathematically with proper hyperparameters and some network structures. Considering the difficulties of constructing a large and clean dataset, GANs are required in many cases to extract enough information from a relatively small dataset. This could result in bad coverage performance of GANs, and one way to tackle this problem is pretraining. Since this method relies on importing external information from the pretraining dataset, this paper does a necessary discussion on the effect that the pretraining dataset has on the model and makes a simple assumption on the standard of choosing a pretraining dataset. Specifically, this paper focuses on the case where the target is to generate animation-style characters, and it has been proven that when providing a pretraining dataset with higher diversity, the performance of the GAN is better. The result of this paper should reveal the possibility that using a specially chosen pretraining dataset can improve the result of GAN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/5/20230608"
    },
    {
        "id": 1875,
        "title": "Self-Attention Based Generative Adversarial Networks For Unsupervised Video Summarization",
        "authors": "Maria Nektaria Minaidi, Charilaos Papaioannou, Alexandros Potamianos",
        "published": "2023-9-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289808"
    },
    {
        "id": 1876,
        "title": "MIMO Radar Waveform Synthesis Using Generative Adversarial Networks",
        "authors": "Vesa Saarinen, Visa Koivunen",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285933"
    },
    {
        "id": 1877,
        "title": "Generating Fashion Sketches Using Generative Adversarial Networks",
        "authors": "Amira Al-Samawi, Shatha Mallak, Rehab Duwairi",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icics60529.2023.10330453"
    },
    {
        "id": 1878,
        "title": "Generative Adversarial Networks for Generating Synthetic Medical Images",
        "authors": "Sunil Kumar, Ramkumar Krishnamoorthy, Rajesh Guputa",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470861"
    },
    {
        "id": 1879,
        "title": "Face Restoration Via Generative Adversarial Networks",
        "authors": "Sonu Kumar, Soham Bhardwaj, Dinesh Kumar Vishwakarma",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176746"
    },
    {
        "id": 1880,
        "title": "Indoor Localization Advancement Using Wasserstein Generative Adversarial Networks",
        "authors": "Shivam Kumar, Saikat Majumder, Sumit Chakravarty",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126229"
    },
    {
        "id": 1881,
        "title": "Effects of Different Generative Adversarial Networks on the Face Generation Task",
        "authors": "Tianxiao Dong",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257729"
    },
    {
        "id": 1882,
        "title": "Autoencoders and Generative Adversarial Networks for Imbalanced Sequence Classification",
        "authors": "Stephanie Ger, Yegna Subramanian Jambunath, Diego Klabjan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386960"
    },
    {
        "id": 1883,
        "title": "A scenario framework for electricity grid using Generative Adversarial Networks",
        "authors": "Bilgi Yilmaz",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.segan.2023.101157"
    },
    {
        "id": 1884,
        "title": "Document Binarization with Multi-Branch Gated Convolutional Generative Adversarial Networks",
        "authors": "Zongyuan Yang, Yongping Xiong, Guibin Wu",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222024"
    },
    {
        "id": 1885,
        "title": "Semantic Segmentation of Urban Area using Pix2Pix Generative Adversarial Networks",
        "authors": "Khyat Patel, Pratham Shah, Ruchi Gajjar",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icort56052.2023.10249202"
    },
    {
        "id": 1886,
        "title": "3D Clothing Design Modeling Based on 3D Measurement and Generative Adversarial Networks",
        "authors": "Jiayi Zhou",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00023"
    },
    {
        "id": 1887,
        "title": "Retracted: Anticoncept Drift Method for Malware Detector Based on Generative Adversarial Network",
        "authors": "",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9890472"
    },
    {
        "id": 1888,
        "title": "Advancing Recurrent Neural Networks and Generative Adversarial Networks: A Technical Framework for Enhanced Effectiveness Evaluation",
        "authors": "Xia Yu",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciscae59047.2023.10393296"
    },
    {
        "id": 1889,
        "title": "Intrusion Detection Classification Method based on Generative Adversarial Networks",
        "authors": "Yan Lu",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icfeict59519.2023.00064"
    },
    {
        "id": 1890,
        "title": "A Novel Approach to Credit Card Security with Generative Adversarial Networks and Security Assessment",
        "authors": "",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53469/wjimt.2024.07(02).03"
    },
    {
        "id": 1891,
        "title": "Generative Adversarial Networks for Synthesizing High-Quality Medical Images",
        "authors": "Shri Bhagwan,  Manivasagam, Anubhav Sony",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470656"
    },
    {
        "id": 1892,
        "title": "Generative Adversarial Networks Assist Missing Data Imputation: A Comprehensive Survey and Evaluation",
        "authors": "Reza Shahbazian, Sergio Greco",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3306721"
    },
    {
        "id": 1893,
        "title": "MLGAN: Addressing Imbalance in Multilabel Learning Using Generative Adversarial Networks",
        "authors": "Aatif Nisar Dar, Reshma Rastogi",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci58599.2023.10331105"
    },
    {
        "id": 1894,
        "title": "IoT Attack Classification Based on Generative Adversarial Networks",
        "authors": "Hung-Chi Chu, Yu-Jhe Lin",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ickii58656.2023.10332560"
    },
    {
        "id": 1895,
        "title": "Modeling Neuronal Activity with Quantum Generative Adversarial Networks",
        "authors": "Vinicius Hernandes, Eliska Greplova",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10267"
    },
    {
        "id": 1896,
        "title": "3D Image Generation from X-Ray Projections Using Generative Adversarial Networks",
        "authors": "Mohammad AlShurbaji, Salam Dhou",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibe60311.2023.00015"
    },
    {
        "id": 1897,
        "title": "Generative Adversarial Networks for Cybersecurity Threat",
        "authors": "Anatha Charan Ojha, Ankita Agarwal, G Swetha",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraset59632.2023.10419878"
    },
    {
        "id": 1898,
        "title": "Dynamic Image Representations for Crowd Anomaly Detection using Generative Adversarial Networks",
        "authors": "Samar Mahmoud, Yasmine Arafa, Maha Abdelmohsen",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca59364.2023.10401681"
    },
    {
        "id": 1899,
        "title": "Generative Adversarial Networks for Self-Supervised Transfer Learning in Medical Image Classification",
        "authors": "Mahesh T R, Meena Krishna",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425480"
    },
    {
        "id": 1900,
        "title": "A New Paradigm for Generative Adversarial Networks Based on Randomized Decision Rules",
        "authors": "Sehwan Kim, Qifan Song, Faming Liang",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0404"
    }
]