[
    {
        "id": 13571,
        "title": "Retrieval of Multimedia Information Using Content-Based Image Retrieval (CBIR) Techniques",
        "authors": "Anupam Mukherjee",
        "published": "2017",
        "citations": 0,
        "abstract": "This chapter will focus on the concept of Content-based image retrieval. Searching of an image or video database based on text based description is a manual labor intensive process. Descriptions of the file are usually typed manually for each image by human operators because the automatic generation of keywords for the images is difficult without incorporation of visual information and feature extraction. This method is impractical in today's multimedia information era. “Content-based” means that the search will analyze the actual contents of the image rather than the metadata such as keywords, tags, and descriptions associated with the image. The term “content” in this context might refer to colors, shapes, textures, or any other information that can be derived from the image itself. Several important sections are highlighted in this chapter, like architectures, query techniques, multidimensional indexing, video retrieval and different application sections of CBIR. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-0983-7.ch027"
    },
    {
        "id": 13572,
        "title": "Review on Content Based Image Retrieval (CBIR) Technique",
        "authors": "Prof. Vikram M Kakade,  , Ishwar A. Keche,  ",
        "published": "2017-3-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijecs/v6i3.02"
    },
    {
        "id": 13573,
        "title": "Content-Based Image Retrieval (CBIR) in Big Histological Image Databases",
        "authors": "Vania V Estrela",
        "published": "2020-12-7",
        "citations": 1,
        "abstract": "Background: Automatic analysis of Histopathological Images (HIs) demands image processing and Computational Intelligence (CI) techniques. Both Computer-Aided Diagnosis (CAD) and Content-Based Image-Retrieval (CBIR) systems assist diagnosis, disease discovery, and biological decision-making. Classical tests comprise screening examinations and biopsy. Histopathology slides offer more ample diagnosis data. However, manual examination of microscopic images is labor-intensive and time-consuming and may depend on a subjective assessment by the pathologist, which can be a challenge.\r\nMethods: This work discusses a CBIR framework to extract and handle histological data, histological metadata, integrated patient records, specimen metadata, attributes, and similar stored files. This work presents a scalable image-retrieval framework for intelligent HI analysis with real-time retrieval. The potential applications of this framework include image-guided diagnosis, decision support, healthcare education, and efﬁcient biological data management.\r\nResults: The considerable amount of biological-related data prompted the development and deployment of large-scale databases and data-driven techniques to bridge the semantic gap between images and diagnostic information. The new cloud computing technologies and the concept of cyber-physical systems have improved the CBIR architectures considerably. The proposed scalable architecture relies on CI and validates performance on several HIs acquired from microscopic tissues. Extensive assessments show improvements in terms of disease classiﬁcation and retrieval tests.\r\nConclusion: This research effort significant contributions are twofold. 1) Defining a  comprehensive and large-scale CBIR framework to analyze HIs with high-dimensional features and CI methods successfully. 2) high-performance updating and optimization strategies improve the querying while better handling new training samples than traditional methods.",
        "link": "http://dx.doi.org/10.26415/2572-004x-vol4iss3p581-582"
    },
    {
        "id": 13574,
        "title": "Retrieval of Multimedia Information Using Content-Based Image Retrieval (CBIR) Techniques",
        "authors": "Anupam Mukherjee",
        "published": "2017",
        "citations": 0,
        "abstract": "This chapter will focus on the concept of Content-based image retrieval. Searching of an image or video database based on text based description is a manual labor intensive process. Descriptions of the file are usually typed manually for each image by human operators because the automatic generation of keywords for the images is difficult without incorporation of visual information and feature extraction. This method is impractical in today's multimedia information era. “Content-based” means that the search will analyze the actual contents of the image rather than the metadata such as keywords, tags, and descriptions associated with the image. The term “content” in this context might refer to colors, shapes, textures, or any other information that can be derived from the image itself. Several important sections are highlighted in this chapter, like architectures, query techniques, multidimensional indexing, video retrieval and different application sections of CBIR. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-0498-6.ch005"
    },
    {
        "id": 13575,
        "title": "Multi-object face recognition using Content Based Image Retrieval (CBIR)",
        "authors": "Muhammad Fachrurrozi,  Erwin,  Saparudin,  Mardiana",
        "published": "2017-8",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecos.2017.8167132"
    },
    {
        "id": 13576,
        "title": "Content Based Image Retrieval (CBIR) by Statistical Methods",
        "authors": "Fathala Ali et al.",
        "published": "2020-6-23",
        "citations": 9,
        "abstract": "            An image retrieval system is a computer system for browsing, looking and recovering pictures from a huge database of advanced pictures. The objective of Content-Based Image Retrieval (CBIR) methods is essentially to extract, from large (image) databases, a specified number of images similar in visual and semantic content to a so-called query image. The researchers were developing a new mechanism to retrieval systems which is mainly based on two procedures. The first procedure relies on extract the statistical feature of both original, traditional image by using the histogram and statistical characteristics (mean, standard deviation). The second procedure relies on the T- test to measure the independence between more than images, (coefficient of correlate, T- test, Level of significance, find the decision), and, through experimental test, it was found that this proposed method of retrieval technique is powerful than the classical retrieval System.",
        "link": "http://dx.doi.org/10.21123/bsj.2020.17.2(si).0694"
    },
    {
        "id": 13577,
        "title": "Content Based Image Retrieval (CBIR) Menggunakan Jarak dan Divergensi",
        "authors": "",
        "published": "2020-10-28",
        "citations": 0,
        "abstract": "Temu kembali citra atau yang disebut dengan Content Based Image Retrieval (CBIR), yang menggunakan Jarak dan Divergensi dimana citra yang kurang jelas gambarnya dapat ditemukan kembali dengan menggunakan Jarak dan Divergensi, dengan menggunakan pendekatan jarak dimana untuk dapat menentukan kesamaan dan ketidaksamaan citra semakin dekat jarak semakin besar akan ditemukannya citra, Divergensi dapat dilakukan dengan citra yang sering muncul atau nilai probabilitasnya tinggi dalam satu citra, metode CBIR yang digunakan untuk mengeksploitasi informasi pengguna mengenai relevansi dalam mengambil citra, CBIR dapat ditingkatkan secara signifikan dengan menggunakan metode Jarak dan Divergensi. sejumlah objek telah disimpan di dalam database. Selanjutnya, ketika suatu citra dijadikan sebagai bahan query, fitur akan dihitung setelah melalui prapemrosesan dan segmentasi. Fitur yang diperoleh dibandingkan dengan fitur semua objek yang terdapat di dalam database, melalui perhitungan jarak fitur. Hasil jarak ini sering disebut sebagai skor atau ranking.  Seluruh skor diurutkan dari yang paling bernilai kecil ke yang paling besar. Objek-objek yang menghasilkan skor rendah adalah citra yang mirip dengan citra query. Untuk membatasi, hanya n citra yang disajikan sebagai hasil query. Dalam hal ini, nilai n dapat ditentukan oleh sistem ataupun pengguna.",
        "link": "http://dx.doi.org/10.36774/jusiti.v9i2.773"
    },
    {
        "id": 13578,
        "title": "Content Based Image Retrieval (Cbir) For Storing Of Products",
        "authors": "Dr. Kannan, Et. al.",
        "published": "2021-4-11",
        "citations": 0,
        "abstract": "With rise in complexity of materials and lack of necessary skills among the mass population, it is necessary to find a system that can help the employees to identify the materials without the help of additional labour, training and manuals. Hence, a system has been created to identify the material and give similar materials when the model is provided with just an image of the material in question. This being an unlinked database helps in maintaining privacy of the company. Convolutional neural networks are used for object detection and then captioning is done by Recurrent neural network which also compares the generated caption with the provided database and return the best match. LSTM and NLP aid the process of caption generation and search. The dataset used is MSCOCO 2014. The evaluation metrics is BLEU which returned a score of 70.3%. The whole idea is easy to combine with concepts like KANBAN and facilitate the layout design of the company to a great flexibility. By reducing the time spent on training and sorting the efficiency of the firm is increased. The system created for identifying the material can be interlinked with centralised inventory management system to help track the material in the production process. The layout of the store was not optimised which resulted in delay in the production process. This can be rectified using a software like ARENA to design the store layout. With a system in place for material deduction the steps followed in stores can be reduced.",
        "link": "http://dx.doi.org/10.17762/turcomat.v12i4.505"
    },
    {
        "id": 13579,
        "title": "Comparison of query optimization techniques in content based image retrieval (CBIR)",
        "authors": "Mariam Alharthi, Fahad Alqurashi",
        "published": "2019-7-6",
        "citations": 0,
        "abstract": "With increasing the popularity of World Wide Web, storing digital contents increases enormously, in that case, it is important to implement convenient information systems which manage the collections of these digital contents efficiently. This paper concentrates on hastening techniques for efficient retrieval of images. Content-Based Image Retrieval (CBIR) systems are used by common approaches. These systems support retrieving similar images depend on content properties (e.g., color, shape, and texture) by retrieving automatically similar images to a pattern or user-defined specification. The CBIR generally used in several applications by applying different techniques in each application which in turns enhance the retrieval process. The paper aims to evaluate some of these applications and compare them to find out the proper methods that return the best results in these CBIR systems.",
        "link": "http://dx.doi.org/10.14419/ijamr.v8i1.29435"
    },
    {
        "id": 13580,
        "title": "Cbir-Gan: A Triplet Generative Adversarial Network for Content-Based Image Retrieval",
        "authors": "Narges Norouzi, Maral Zarvani, Sara Saberi Tehrani Moghadam, Reza Azmi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4057354"
    },
    {
        "id": 13581,
        "title": "CBIR-ANR: A content-based image retrieval with accuracy noise reduction",
        "authors": "Gabriel S. Vieira, Afonso U. Fonseca, Fabrizzio Soares",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.simpa.2023.100486"
    },
    {
        "id": 13582,
        "title": "Multistage Content-Based Image Retrieval",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_14"
    },
    {
        "id": 13583,
        "title": "Content-Based Image Retrieval: An Introduction",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_1"
    },
    {
        "id": 13584,
        "title": "Digital image clustering and colour model selection in content-based image retrieval (CBIR) approach for biometric security image",
        "authors": "Muhammad Naim Abdullah, Muhammad Amin Sahari",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0119762"
    },
    {
        "id": 13585,
        "title": "Content based Image Retrieval (CBIR) System using Threshold based Color Layout Descriptor (CLD) and Edge Histogram Descriptor (EHD)",
        "authors": "Pradnya A., P. P.",
        "published": "2018-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2018916985"
    },
    {
        "id": 13586,
        "title": "Recent developments of content-based image retrieval (CBIR)",
        "authors": "Xiaoqing Li, Jiansheng Yang, Jinwen Ma",
        "published": "2021-9",
        "citations": 69,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neucom.2020.07.139"
    },
    {
        "id": 13587,
        "title": "Content-Based Image Retrieval Techniques: A Review",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_2"
    },
    {
        "id": 13588,
        "title": "SMPP-CBIR: shorted and mixed aggregated image features for privacy-preserving content-based image retrieval",
        "authors": "Ali Lazim Lafta, Ayad I. Abdulsada",
        "published": "2022-10-1",
        "citations": 2,
        "abstract": "Thanks to recent breakthroughs in photographic and digital technology, enormous amounts of image data are generated daily. Many content-based image retrieval (CBIR) systems have been developed for searching image collections. However, these systems need more computer and storage resources that can be met by cloud servers, since they supply a lot of processing power at a reasonable price. The protection of users' personal information is a worry for image owners since cloud services are not exactly trustworthy. In this paper, we suggest and put into practice a CBIR (SMPP-CBIR) technique for searching and retrieving ciphertext information that protects security. Asymmetric scalar-product-preserving encryption process (ASPE) is used to preserve aggregated mixed feature vectors while still enabling computation between them to describe the related picture collection. The k-means clustering algorithm is used to recursively arrange all encrypted attributes into a tree index in order to speed up search times. The findings show that SMPP-CBIR is more scalable, more precise, and faster in indexing and retrieval than earlier systems.",
        "link": "http://dx.doi.org/10.11591/eei.v11i5.4323"
    },
    {
        "id": 13589,
        "title": "An Appraisal of Content-Based Image Retrieval (CBIR) Methods",
        "authors": "J. O. Olaleke, A. O. Adetunmbi, B. A. Ojokoh, Iroju Olaronke",
        "published": "2019-4-19",
        "citations": 2,
        "abstract": "Background: Content Based Image Retrieval (CBIR) is an aspect of computer vision and image processing that finds images that are similar to a given query image in a large scale database using the visual contents of images such as colour, texture, shape, and spatial arrangement of regions of interest (ROIs) rather than manually annotated textual keywords. A CBIR system represents an image as a feature vector and measures the similarity between the image and other images in the database for the purpose of retrieving similar images with minimal human intervention. The CBIR system has been deployed in several fields such as fingerprint identification, biodiversity information systems, digital libraries, Architectural and Engineering design, crime prevention, historical research and medicine. There are several steps involved in the development of CBIR systems. Typical examples of these steps include feature extraction and selection, indexing and similarity measurement.\r\nProblem: However, each of these steps has its own method. Nevertheless, there is no universally acceptable method for retrieving similar images in CBIR.\r\nAim: Hence, this study examines the diverse methods used in CBIR systems. This is with the aim of revealing the strengths and weakness of each of these methods.\r\nMethodology: Literatures that are related to the subject matter were sought in three scientific electronic databases namely CiteseerX, Science Direct and Google scholar. The Google search engine was used to search for documents and WebPages that are appropriate to the study.\r\nResults: The result of the study revealed that three main features are usually extracted during CBIR. These features include colour, shape and text. The study also revealed that diverse methods that can be used for extracting each of the features in CBIR. For instance, colour space, colour histogram, colour moments, geometric moment as well as colour correlogram can be used for extracting colour features. The commonly used methods for texture feature extraction include statistical, model-based, and transform-based methods while the edge method, Fourier transform and Zernike methods can be used for extracting shape features.\r\nContributions: The paper highlights the benefits and challenges of diverse methods used in CBIR. This is with the aim of revealing the methods that are more efficient for CBIR.\r\nConclusion: Each of the CBIR methods has their own advantages and disadvantages. However, there is a need for a further work that will validate the reliability and efficiency of each of the method.",
        "link": "http://dx.doi.org/10.9734/ajrcos/2019/v3i230089"
    },
    {
        "id": 13590,
        "title": "Design and Development of a Content-Based Image Retrieval (CBIR) System for Computing Similarity.",
        "authors": "Rajkumar Sarode, Snehal Nirmal",
        "published": "2021-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21904/weken/2021/v6/i1/170778"
    },
    {
        "id": 13591,
        "title": "Content-Based Image Retrieval Based on Location-Independent Regions of Interest",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_10"
    },
    {
        "id": 13592,
        "title": "CBIR-ACHS: compressed domain content-based image retrieval through auto-correloblock in HEVC standard",
        "authors": "Yaghoub Saberi, Mohammadreza Ramezanpour, Shervan Fekri-Ershad, Behrang Barekatain",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-024-18488-2"
    },
    {
        "id": 13593,
        "title": "Research Issues for Next Generation Content-Based Image Retrieval",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_15"
    },
    {
        "id": 13594,
        "title": "Content-Based Image Retrieval Using a Short Run Length Descriptor",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_12"
    },
    {
        "id": 13595,
        "title": "An effective hybrid framework for content based image retrieval (CBIR)",
        "authors": "Umer Ali Khan, Ali Javed, Rehan Ashraf",
        "published": "2021-7",
        "citations": 26,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-021-10530-x"
    },
    {
        "id": 13596,
        "title": "Region-Based Image Retrieval",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_3"
    },
    {
        "id": 13597,
        "title": "Content-Based Image Retrieval of Texture Images Using Adaptive Tetrolet Transforms",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_11"
    },
    {
        "id": 13598,
        "title": "Content-Based Image Retrieval Using Integrated Color, Texture, and Shape Features",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_13"
    },
    {
        "id": 13599,
        "title": "Similarity Measurement on Logo Image Using CBIR (Content Base Image Retrieval) and CNN ResNet-18 Architecture",
        "authors": "Larissa Navia Rani, Yuhandri Yuhandri",
        "published": "2023-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccosite57641.2023.10127711"
    },
    {
        "id": 13600,
        "title": "CBIR-CNN: Content-Based Image Retrieval on Celebrity Data Using Deep Convolution Neural Network",
        "authors": "Pushpendra Singh, P.N. Hrisheekesha, Vinai Kumar. Singh",
        "published": "2021-4-5",
        "citations": 16,
        "abstract": "\nBackground:\n Finding a region of interest in an image and content-based image analysis\nhas been a challenging task for the last two decades. With the advancement in image processing,\ncomputer vision and a huge amount of image data generation, the Content-Based Image Retrieval\nSystem (CBIR) has attracted several researchers as a common technique to manage this huge\namount of data. It is an approach of searching user interest based on visual information present in\nan image. The requirement of high computation power and huge memory limits the deployment of\nthe CBIR technique in real-time scenarios.\n\n\nObjective:\nIn this paper, an advanced deep learning model is applied to the CBIR on facial image\ndata. We designed a deep convolution neural network architecture where activation of the convolution\nlayer is used for feature representation and included max-pooling as a feature reduction technique.\nFurthermore, our model uses partial feature mapping as image descriptor to incorporate the\nproperty that facial image contains repeated information.\n\n\nMethods:\n Existing CBIR approaches primarily consider colour, texture and low-level features for\nmapping and localizing image segments. While deep learning has shown high performance in numerous\nfields of research, its application in CBIR is still very limited. Human face contains significant\ninformation to be used in a content driven task and applicable to various applications of computer\nvision and multimedia systems. In this research work, a deep learning-based model has been\ndiscussed for Content-Based Image Retrieval (CBIR). In CBIR, there are two important things 1)\nclassification and 2) retrieval of image based on similarity. For the classification purpose, a fourconvolution\nlayer model has been proposed. For the calculation of the similarity, Euclidian distance\nmeasure has been used between the images.\n\n\nResults:\nThe proposed model is completely unsupervised, and it is fast and accurate in comparison\nto other deep learning models applied for CBIR over the facial dataset. The proposed method provided\nsatisfactory results from the experiment, and it outperforms other CNN-based models such as VGG16,\nInception V3, ResNet50, and MobileNet. Moreover, the performance of the proposed model has been\ncompared with pre-trained models in terms of accuracy, storage space and inference time.\n\n\nConclusion:\n: The experimental analysis over the dataset has shown promising results with more\nthan 90% classification accuracy.\n",
        "link": "http://dx.doi.org/10.2174/2666255813666200129111928"
    },
    {
        "id": 13601,
        "title": "Content-based image retrieval algorithm for nuclei segmentation in histopathology images",
        "authors": "Yashwant Kurmi, Vijayshri Chaurasia",
        "published": "2021-1",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-020-09797-3"
    },
    {
        "id": 13602,
        "title": "IDENTIFIKASI KEMATANGAN BUAH MANGGA GEDONG GINCU BERDASARKAN WARNA MENGGUNAKAN METODE CONTENT BASED IMAGE RETRIEVAL (CBIR)",
        "authors": " Suhendri, Deffy Susanti, Kholid Mubarok",
        "published": "2020-12-28",
        "citations": 0,
        "abstract": "Perkembangan ilmu pengetahuan dan teknologi sangatlah cepat terus berkembang, menuntut pula adanya suatu peningkatan dari sumber daya manusia. Penerapan aplikasi teknologi informasi dalam berbagai bidang pun terus dilakukan termasuk dalam bidang Pertanian, dengan perkembangan teknologi informasi yang sangat cepat dalam bidang pertanian yang dapat petani rasakan diantaranya, UPJA Smart Mobile dan SAPA MEKTAN. Terdapat beberapa daerah di Jawa Barat yang merupakan sentra produksi mangga diantaranya yaitu Kabupaten Indramayu, Kabupaten Cirebon, Kabupaten Majalengka, Kabupaten Kuningan, dan Kabupaten Sumedang. Majalengka sendiri masuk dalam sentra penghasil buah mangga gedong gincu, komoditas ini juga berpontensi untuk meningkatkan kesejahteraan petaninya karena memiliki nilai ekonomis yang cukup tinggi. Pemasaran mangga oleh petani ke pasar modern dan pasar ekspor merupakan peluang yang besar karena petani sudah dapat menghasilkan mangga dengan kualitas yang baik dan dengan memasarkan hasil produksi mangga ke pasar modern, maka nilai jual pun akan meningkat dibandingkan dengan pasar tradisional sehingga pendapatan petani pun meningkat. Content Based Image Retrieval (CBIR) merupakan salah satu bentuk aplikasi komputer vision untuk pencarian citra berdasarkan fitur yang ada pada citra itu sendiri. Sistem yang dibangun dengan memafaatkan fitur utama dari citra yaitu fitur warna. Dalam menentukan kategori suatu citra atau gambar dapat dilakukan dengan menggunakan teknik pegukuran jarak yaitu Euclidean Distance. Euclidean Distance merupakan suatu teknik yang digunakan untuk menghitung kesamaan antara dua vektor dengan cara menghitung akar dari kuadrat perbedaan dari dua vektor tersebut.",
        "link": "http://dx.doi.org/10.53580/naratif.v2i2.93"
    },
    {
        "id": 13603,
        "title": "Content-Based Image Retrieval Based on Relative Locations of Multiple Regions of Interest Using Selective Regions Matching",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_9"
    },
    {
        "id": 13604,
        "title": "A ten-year literature review of content-based image retrieval (CBIR) studies in the tourism industry",
        "authors": "Chanattra Ammatmanee, Lu Gan",
        "published": "2021-7-17",
        "citations": 2,
        "abstract": "\nPurpose\nDue to the worldwide growth of digital image sharing and the maturity of the tourism industry, the vast and growing collections of digital images have become a challenge for those who use and/or manage these image data across tourism settings. To overcome the image indexing task with less labour cost and improve the image retrieval task with less human errors, the content-based image retrieval (CBIR) technique has been investigated for the tourism domain particularly. This paper aims to review the relevant literature in the field to understand these previous works and identify research gaps for future directions.\n\n\nDesign/methodology/approach\nA systematic and comprehensive review of CBIR studies in tourism from the year 2010 to 2019, focussing on journal articles and conference proceedings in reputable online databases, is conducted by taking a comparative approach to critically analyse and address the trends of each fundamental element in these research experiments.\n\n\nFindings\nBased on the review of the literature, the trends of CBIR studies in tourism is to improve image representation and retrieval by advancing existing feature extraction techniques, contributing novel techniques in the feature extraction process through fine-tuning fusion features and improving image query of CBIR systems. Co-authorship, tourist attraction sector and fusion image features have been in focus. Nonetheless, the number of studies in other tourism sectors and available image databases could be further explored.\n\n\nOriginality/value\nThe fact that no existing academic review of CBIR studies in tourism makes this paper a novel contribution.\n",
        "link": "http://dx.doi.org/10.1108/el-06-2020-0149"
    },
    {
        "id": 13605,
        "title": "Content-Based Image Retrieval (CBIR): A Review",
        "authors": "Deepti Agrawal, Apurva Agarwal, Dilip Kumar Sharma",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-8892-8_33"
    },
    {
        "id": 13606,
        "title": "Some Issues Regarding Content-Based Image Retrieval (CBIR) for Remote Healthcare Theradiagnosis",
        "authors": "Vania V. Estrela, Abdullah Ayub Khan, Aftab Ahmed Shaikh, Asif Ali Laghari, Mazhar Ali Dootio, Mudassir Hussain, Awais Khan Jumani, Rukhsar Ayub",
        "published": "2023-7-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003196822-7"
    },
    {
        "id": 13607,
        "title": "Study of Content Based Image Retrieval Techniques",
        "authors": "",
        "published": "2017-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/art20164191"
    },
    {
        "id": 13608,
        "title": "Content-Based Image Retrieval (CBIR): Using Combined Color and Texture Features (TriCLR and HistLBP)",
        "authors": "P. John Bosco, S. Janakiraman",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": " Content-Based Image Retrieval (CBIR) is a broad research field in the current digital world. This paper focuses on content-based image retrieval based on visual properties, consisting of high-level semantic information. The variation between low-level and high-level features is identified as a semantic gap. The semantic gap is the biggest problem in CBIR. The visual characteristics are extracted from low-level features such as color, texture and shape. The low-level feature increases CBIRs performance level. The paper mainly focuses on an image retrieval system called combined color (TriCLR) (RGB, YCbCr, and [Formula: see text]) with the histogram of texture features in LBP (HistLBP), which, is known as a hybrid of three colors (TriCLR) with Histogram of LBP (TriCLR and HistLBP). The study also discusses the hybrid method in light of low-level features. Finally, the hybrid approach uses the (TriCLR and HistLBP) algorithm, which provides a new solution to the CBIR system that is better than the existing methods. ",
        "link": "http://dx.doi.org/10.1142/s0219467825500214"
    },
    {
        "id": 13609,
        "title": "Content-Based Image Retrieval",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4"
    },
    {
        "id": 13610,
        "title": "Automatic Query Image Disambiguation for Content-based Image Retrieval",
        "authors": "Björn Barz, Joachim Denzler",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006593402490256"
    },
    {
        "id": 13611,
        "title": "Real-time Multi-object Face Recognition Using Content Based Image Retrieval (CBIR)",
        "authors": "Muhammad Fachrurrozi, Saparudin Saparudin, Erwin Erwin, Mardiana Mardiana, Clara Fin Badillah, Junia Erlina, Auzan Lazuardi",
        "published": "2018-10-1",
        "citations": 1,
        "abstract": "<p>Face recognition system in real time is divided into three processes, namely feature extraction, clustering, detection, and recognition. Each of these stages uses different methods, Local Binary Pattern (LBP), Agglomerative Hierarchical Clustering (AHC) and Euclidean Distance. Multi-face image search using Content Based Image Retrieval (CBIR) method. CBIR performs image search by image feature itself. Based on real time trial results, the accuracy value obtained is 61.64%. </p><p class=\"Abstract\"> </p>",
        "link": "http://dx.doi.org/10.11591/ijece.v8i5.pp2812-2817"
    },
    {
        "id": 13612,
        "title": "Class Anchor Margin Loss for Content-Based Image Retrieval",
        "authors": "Alexandru Ghita, Radu Ionescu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012400500003636"
    },
    {
        "id": 13613,
        "title": "Implementasi Content Based Image Retrieval (CBIR) Pada Citra Batik Besurek Yang Tidak Utuh Menggunakan Metode Speeded Up Robust Features (SURF) dan Fast Library Approximated Nearest Neighbor (FLANN)",
        "authors": "Rezki Oksaputri, Ernawati Ernawati, Desi Andreswari",
        "published": "2018-11-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33369/pseudocode.5.2.18-28"
    },
    {
        "id": 13614,
        "title": "7. Content-Based Image Retrieval",
        "authors": "",
        "published": "2017-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9783110524130-007"
    },
    {
        "id": 13615,
        "title": "Fuzzy Content–Based Image Retrieval",
        "authors": "",
        "published": "2017-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b15853-11"
    },
    {
        "id": 13616,
        "title": "Fuzzy Content Based Image Retrieval Using Software Agents",
        "authors": "Monireh Azimi hemat",
        "published": "2018-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.9756/iajse/v5i1/1810001"
    },
    {
        "id": 13617,
        "title": "Automatic content-based image retrieval using hierarchical clustering algorithms",
        "authors": "Kambiz Jarrah",
        "published": "No Date",
        "citations": 0,
        "abstract": "The overall objective of this thesis is to present a methodology for guiding adaptations of an RBF-based relevance feedback network, embedded in automatic content-based image retrieval (CBIR) systems, through the principle of unsupervised hierarchical clustering. The main focus of this thesis is two-fold: introducing a new member of Self-Organizing Tree Map (SOTM) family, the Directed self-organizing tree map (DSOTM) that not only provides a partial supervision on cluster generation by forcing divisions away from the query class, but also presents an objective verdict on resemblance of the input pattern as its tree structure grows; and using a base-10 Genetic Algorithm (GA) approach to accurately determine the contribution of individual feature vectors for a successful retrieval in a so-called \"feature weight detection process.\" \n  The DSOTM is quite attractive in CBIR since it aims to reduce both user workload and subjectivity. Repetitive user interaction steps are replaced by a DSOTM module, which adaptively guides relevance feedback, to bridge the gap between low-level image descriptors and high-level semantics. To further reduce this gap and achieve an enhanced performance for the automatic CBIR system under study, a GA-based approach was proposed in conjunction with the DSOTM. The resulting framework is referred to as GA-based CBIR (GA-CBIR) and aims to import human subjectivity by automatically adjusting the search process to what the system evolves \"to believe\" is significant content within the query. In this engine, traditional GA operators work closely with the DSOTM to better attune the apparent discriminative characteristics observed in an image by a human user.",
        "link": "http://dx.doi.org/10.32920/ryerson.14664333.v1"
    },
    {
        "id": 13618,
        "title": "Automatic content-based image retrieval using hierarchical clustering algorithms",
        "authors": "Kambiz Jarrah",
        "published": "No Date",
        "citations": 0,
        "abstract": "The overall objective of this thesis is to present a methodology for guiding adaptations of an RBF-based relevance feedback network, embedded in automatic content-based image retrieval (CBIR) systems, through the principle of unsupervised hierarchical clustering. The main focus of this thesis is two-fold: introducing a new member of Self-Organizing Tree Map (SOTM) family, the Directed self-organizing tree map (DSOTM) that not only provides a partial supervision on cluster generation by forcing divisions away from the query class, but also presents an objective verdict on resemblance of the input pattern as its tree structure grows; and using a base-10 Genetic Algorithm (GA) approach to accurately determine the contribution of individual feature vectors for a successful retrieval in a so-called \"feature weight detection process.\" \n  The DSOTM is quite attractive in CBIR since it aims to reduce both user workload and subjectivity. Repetitive user interaction steps are replaced by a DSOTM module, which adaptively guides relevance feedback, to bridge the gap between low-level image descriptors and high-level semantics. To further reduce this gap and achieve an enhanced performance for the automatic CBIR system under study, a GA-based approach was proposed in conjunction with the DSOTM. The resulting framework is referred to as GA-based CBIR (GA-CBIR) and aims to import human subjectivity by automatically adjusting the search process to what the system evolves \"to believe\" is significant content within the query. In this engine, traditional GA operators work closely with the DSOTM to better attune the apparent discriminative characteristics observed in an image by a human user.",
        "link": "http://dx.doi.org/10.32920/ryerson.14664333"
    },
    {
        "id": 13619,
        "title": "A content-based image retrieval system for hat database",
        "authors": "Danhua Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "Content-based image retrieval (CBIR) is a technique for indexing and retrieving images based on the low-level features, middle-level features, and high-level features. Low-level feature is extracted from contents of the images such as color, texture and shape; middle-level feature is a region obtained as a result of image segmentation; high-level feature is semantic information about the meaning of image, its objects and their roles, and categories to which the image belongs. In this project, three low-level features texture-based retrieval, color-based retrieval and shape-based retrieval are implemented and compared on hat database. Texture features are obtained from parameters of a two-component Gaussian mixture model (GMM) in the wavelet domain. Color features are extracted from a two-component GMM on HLS color space. Shape features are extracted from the contour by using centroid-contour distance Fourier descriptor. A comprehensive experimental evaluation of the retrieval performance of different feature sets is performed. The experimental results indicate that the shape features based on the centroid-contour distance Fourier descriptor perform much better than the color and texture features for the hat database used in this project",
        "link": "http://dx.doi.org/10.32920/ryerson.14657568.v1"
    },
    {
        "id": 13620,
        "title": "A content-based image retrieval system for hat database",
        "authors": "Danhua Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "Content-based image retrieval (CBIR) is a technique for indexing and retrieving images based on the low-level features, middle-level features, and high-level features. Low-level feature is extracted from contents of the images such as color, texture and shape; middle-level feature is a region obtained as a result of image segmentation; high-level feature is semantic information about the meaning of image, its objects and their roles, and categories to which the image belongs. In this project, three low-level features texture-based retrieval, color-based retrieval and shape-based retrieval are implemented and compared on hat database. Texture features are obtained from parameters of a two-component Gaussian mixture model (GMM) in the wavelet domain. Color features are extracted from a two-component GMM on HLS color space. Shape features are extracted from the contour by using centroid-contour distance Fourier descriptor. A comprehensive experimental evaluation of the retrieval performance of different feature sets is performed. The experimental results indicate that the shape features based on the centroid-contour distance Fourier descriptor perform much better than the color and texture features for the hat database used in this project",
        "link": "http://dx.doi.org/10.32920/ryerson.14657568"
    },
    {
        "id": 13621,
        "title": "An effective shape descriptor for content based image retrieval",
        "authors": "Yupeng Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this work, we present a modified version of the Generic Fourier Descriptor (GFD) that operates on edge information within natural images from the COREL image database for the purpose of shape-based image retrieval. By incorporating an edge-texture characterization (ETC) measure, we reduced the complexity inherent in oversensitive edge maps typical of most gradient-based detectors that otherwise tend to contaminate the shape feature description. We find that the proposed techniques not only improve overall retrieval in terms of shape, but more importantly, provide a more accurate similarity ranking measure of retrieved results, demonstrating the need for greater consideration for dominant internal and external shape details. A feature database combined by color moments, color histograms, Gabor wavelet and shape features is applied in our image retrieval system. Relevance feedback has also been considered, bridging the gap between the high level concepts and the low level visual features. The experimental results indicate that dynamically updating weights associated with feature compenents by users' feedback greatly improves retrieval performance.",
        "link": "http://dx.doi.org/10.32920/ryerson.14649771"
    },
    {
        "id": 13622,
        "title": "An effective shape descriptor for content based image retrieval",
        "authors": "Yupeng Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this work, we present a modified version of the Generic Fourier Descriptor (GFD) that operates on edge information within natural images from the COREL image database for the purpose of shape-based image retrieval. By incorporating an edge-texture characterization (ETC) measure, we reduced the complexity inherent in oversensitive edge maps typical of most gradient-based detectors that otherwise tend to contaminate the shape feature description. We find that the proposed techniques not only improve overall retrieval in terms of shape, but more importantly, provide a more accurate similarity ranking measure of retrieved results, demonstrating the need for greater consideration for dominant internal and external shape details. A feature database combined by color moments, color histograms, Gabor wavelet and shape features is applied in our image retrieval system. Relevance feedback has also been considered, bridging the gap between the high level concepts and the low level visual features. The experimental results indicate that dynamically updating weights associated with feature compenents by users' feedback greatly improves retrieval performance.",
        "link": "http://dx.doi.org/10.32920/ryerson.14649771.v1"
    },
    {
        "id": 13623,
        "title": "New Approach on the Techniques of Content-Based Image Retrieval (CBIR) Using Color, Texture and Shape Features",
        "authors": "Mohd Afizi Mohd Shukran, Muhamad Naim Abdullah, Mohd Sidek Fadhil Mohd Yunus",
        "published": "2021",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4236/msce.2021.91005"
    },
    {
        "id": 13624,
        "title": "Content Based Image Retrieval Using Image Preprocessing Techniques",
        "authors": "",
        "published": "2020-12-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/sr7.12/044"
    },
    {
        "id": 13625,
        "title": "An Efficient Image    Retrieval of Digital Images Using Content Based Image Retrieval by Fuzzy Based Rule Extraction",
        "authors": "R Sowmya, R.C Narayanan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3126065"
    },
    {
        "id": 13626,
        "title": "A Digital Image Retrieval Based Technique in the Database by Using CBIR Method",
        "authors": "Arshad Ahmed Jagirdar, V Suma",
        "published": "2018-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icirca.2018.8597429"
    },
    {
        "id": 13627,
        "title": "MPEG-7: Multimedia Content Description Standard",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_5"
    },
    {
        "id": 13628,
        "title": "Content-Based Image Retrieval (CBIR) Based Computer-Aided Diagnosis (CAD) in Evaluation of Lung Nodules: A New Tool for Self-Learning and To Assist Radiologists in Diagnosing Lung Cancer",
        "authors": "Mandeep Garg, Nidhi Prabhakar, Sudipta Mukhopadhyay, Niranjan Khandelwal",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4172/2155-9929.s2-033"
    },
    {
        "id": 13629,
        "title": "Saliency-Based Image Retrieval as a Refinement to Content-Based Image Retrieval",
        "authors": "Mohammad A. N. Al-Azawi",
        "published": "2021-5-27",
        "citations": 2,
        "abstract": "Searching for an image in a database is important in different applications; hence, many algorithms have been proposed to identify the contents of the image. In some applications, but not all, identifying the content of the image as a whole can offer good results. Searching for an object inside the image is more important in most applications than identifying the image as a whole. Therefore, studies focused on segmenting the image into small sub-images and identified their contents. In view of the concepts of human attention, various literature defined saliency as a computer representation of it, where different algorithms were developed to extract the salient regions. These salient regions, which are the regions that attract human attention, are used to identify the most important regions that contain important objects in the image. In this paper, we introduce a new algorithm that utilises the saliency principles to identify the contents of an image and search for similar objects in the images stored in a database. We also demonstrate that the use of salient objects produces better and more accurate results in the image retrieval process. A new retrieval algorithm is therefore presented here, focused on identifying the objects extracted from the salient regions. To assess the efficiency of the proposed algorithm, a new evaluation method is also proposed which considers the order of the retrieved image in assessing the efficiency of the algorithm.",
        "link": "http://dx.doi.org/10.5565/rev/elcvia.1325"
    },
    {
        "id": 13630,
        "title": "An Efficient Content-Based Image Retrieval (CBIR) Using GLCM for Feature Extraction",
        "authors": "P. Chandana, P. Srinivas Rao, C. H. Satyanarayana, Y. Srinivas, A. Gauthami Latha",
        "published": "2017",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-3779-5_4"
    },
    {
        "id": 13631,
        "title": "Texture Feature",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_8"
    },
    {
        "id": 13632,
        "title": "Shape Feature",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_6"
    },
    {
        "id": 13633,
        "title": "Content Based Image Retrieval",
        "authors": "Minu Kumari",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3371777"
    },
    {
        "id": 13634,
        "title": "Color Feature",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_7"
    },
    {
        "id": 13635,
        "title": "Deep Learning-Based Image Retrieval: Addressing the Semantic Gap for Accurate Content-Based Image Retrieval",
        "authors": "Aditya Soni,  Anju, Amit Kumar",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccpct58313.2023.10245342"
    },
    {
        "id": 13636,
        "title": "Image Retrieval Based on Query by Saliency Content",
        "authors": "Adrian G. Bors, Alex Papushoy",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-57687-9_8"
    },
    {
        "id": 13637,
        "title": "Content based Image Retrieval Using Support Vector Machines",
        "authors": "Vishal Goyal, Aasheesh Shukla",
        "published": "2019-10-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v11sp10/20192851"
    },
    {
        "id": 13638,
        "title": "Fuzzy based Optimization Framework for Content based Medical Image Retrieval (CBMIR)",
        "authors": "Rohit Agarwal, Himanshu Sharma",
        "published": "2019-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v11sp10/20192857"
    },
    {
        "id": 13639,
        "title": "Survey Of Content-Based Image Retrieval Using Sift Algorithm:, Case Study \"Image / Sketch Retrieval\"",
        "authors": "Haider Issam Hamdi, Soukaena H. Hashem",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.34279/0923-009-003-005"
    },
    {
        "id": 13640,
        "title": "Content-Based Image Retrieval Using Intelligent Techniques",
        "authors": "Prashant Srivastava, Manish Khare, Ashish Khare",
        "published": "2021-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003134138-14"
    },
    {
        "id": 13641,
        "title": "High and Low-Level Classification based Features for Content-based Image Retrieval in Privacy-Preserving",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe authors have requested that this preprint be removed from Research Square.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1461397/v2"
    },
    {
        "id": 13642,
        "title": "A Secure Search For Outsourced Image Collection Based Content-Based Image Retrieval",
        "authors": "Israa Kadhem Abady Hamady",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.54633/2333-022-047-023"
    },
    {
        "id": 13643,
        "title": "Content Based Image Retrieval",
        "authors": "Dr. Aziz Makandar,  , Mrs. Rashmi Somshekhar, Miss. Nayan Jadav",
        "published": "2019-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31142/ijtsrd24047"
    },
    {
        "id": 13644,
        "title": "Content-Based Image Retrieval: An Assessment",
        "authors": "Santosh Kumar Swarnkar, Prof. Avinash Sharma,  ",
        "published": "2019-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31142/ijtsrd21708"
    },
    {
        "id": 13645,
        "title": "Content Based Image Retrieval Using Depth Maps for Colonoscopy Images",
        "authors": "Md Rahman, JungHwan Oh, Wallapak Tavanapong, Piet C. de Groen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011749100003414"
    },
    {
        "id": 13646,
        "title": "Content-Based Retrieval",
        "authors": "Yu-Jin Zhang",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-5873-3_44"
    },
    {
        "id": 13647,
        "title": "A small comparison of various content based image retrieval approach",
        "authors": "Vinay Lowanshi, Dr. Kalpana Rai",
        "published": "No Date",
        "citations": 0,
        "abstract": "-Image retrieval is one of the most interesting and fastest growing research areas in the field of digital image processing as well as for the information retrieval from web contents. In most Content-Based Image Retrieval (CBIR) systems, an image is represented by a set of different level of visual features, by which can manage large databases.CBIR is used in many areas for retrieving images of simillar type from large database Most of the popular database removes the highlevel semantic information.",
        "link": "http://dx.doi.org/10.14293/s2199-1006.1.sor-.pp6pwqi.v1"
    },
    {
        "id": 13648,
        "title": "A Comparative Study of Image Retrieval Algorithms for Enhancing a Content-based Image Retrieval System",
        "authors": "Elsaeed E.",
        "published": "2017-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2017915073"
    },
    {
        "id": 13649,
        "title": "Text- and Content-Based Medical Image Retrieval in the VISCERAL Retrieval Benchmark",
        "authors": "Fan Zhang, Yang Song, Weidong Cai, Adrien Depeursinge, Henning Müller",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-49644-3_14"
    },
    {
        "id": 13650,
        "title": "Bi-Modal Content Based Image Retrieval using Multi-class Cycle-GAN",
        "authors": "Girraj Pahariya",
        "published": "2018-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dicta.2018.8615838"
    },
    {
        "id": 13651,
        "title": "Index-Based Image Retrieval-Analyzed Methodologies in CBIR",
        "authors": "B. Prasanthi, P. Suresh, D. Vasumathi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-3935-5_24"
    },
    {
        "id": 13652,
        "title": "A Content based Remote Sensing Image Retrieval Using A Modified Local Color Descriptors",
        "authors": "Binisha Rose J.",
        "published": "2020-3-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12i3/20201188"
    },
    {
        "id": 13653,
        "title": "Similarity Measures and Performance Evaluation",
        "authors": "Vipin Tyagi",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6759-4_4"
    },
    {
        "id": 13654,
        "title": "Content-based Image Retrieval using Texture and Color Features",
        "authors": "",
        "published": "2019-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32792/utq/utjsci/vol3/4/17"
    },
    {
        "id": 13655,
        "title": "Fuzzy Techniques for Content-Based Image Retrieval",
        "authors": " Rose Bindu Joseph P., Ezhilmaran Devarasan",
        "published": "2018",
        "citations": 0,
        "abstract": "Content-based image retrieval aims to acquire images from huge databases by analyzing their visual features like color, texture, shape, and spatial relationship. The search for superior accuracy in image retrieval has resulted in concentrating more on semantic gap reduction between the low-level features and high level human reasoning. Fuzzy theory is a prevailing methodology which helps in attaining this goal by using attributes and interpretations similar to human reasoning. The vagueness and impreciseness in image data and the retrieval process can be modeled by fuzzy sets. This chapter analyses fuzzy theoretic approaches in various stages of content-based image retrieval system. Various fuzzy-based feature descriptors are discussed along with different fuzzy classification and indexing algorithms for content-based image retrieval. This chapter also presents an overview of various fuzzy distance and similarity measures for image retrieval. A novel fuzzy theoretic retrieval for finger vein biometric images is also proposed in this chapter with experiment and analysis. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-5775-3.ch003"
    },
    {
        "id": 13656,
        "title": "Content-Based Image Retrieval with Combined Features: Color and Gradient",
        "authors": "Mahmut Kılıçaslan, Recep Demirci",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFeature extraction is fundamental stage of effective content based image retrieval (CBIR). However, it remains challenging issue to extract low-level features for retrieval systems. This paper puts forward an effective solution proposal for the aforementioned problem. Initially, images and their gradients are clustered with multi-level thresholding. A codebook is generated with threshold values. The size of the codebook generated depends on the number of thresholds. Consequently, every pixel in color image is included in a cluster by means of the codebook. Color reduction is performed by assigning the average values of pixels in the same cluster. A cluster-based one-dimensional histogram (CBH) is created with the numbers of pixels in every cluster represented with a single color. Then the cluster-based feature vectors with histogram are extracted from original image and gradient image. Accordingly, relevant features are combined. The developed feature vector is called as combined feature vector (CFV). The most important advantages of CFV are that it performs an effective color reduction technique and feature presentation by processing texture information with gradient operator. Therefore, the main contribution of the combined feature vector suggested is its high accuracy and stability for image retrieval. The proposed method has been tested with Corel-1K, Corel-5K Corel-10K and GHIM-10K datasets. In addition, performances of different image histogram similarity techniques such as cosine, histogram intersection and Euclidean distance have been verified with the developed algorithm. Experimental results have been analyzed in two categories. Initially, CBIR results produced with combined feature vectors which are generated by Otsu, Kapur and center of gravity of histogram (CGH) procedures have been evaluated. Then, the CBIR strategy based on CGH method has been compared with CBIR systems with local binary pattern (LBP) and gradient-structures histogram (GSH). It was observed that CBIR approach based on CGH technique has significantly outperformed.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-222235/v1"
    },
    {
        "id": 13657,
        "title": "Platform Implementation for Developing a Mobile Content-Based Image Retrieval Application",
        "authors": "Yong-Eun Lee, Young-Eun An, Jong-Hun Chun, Jong-An Park",
        "published": "2017-11-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14801/jkiit.2017.15.11.1"
    },
    {
        "id": 13658,
        "title": "Deep Feature Factorization for Content-Based Image Retrieval and Localization",
        "authors": "Edo Collins, Sabine Susstrunk",
        "published": "2019-9",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8802980"
    },
    {
        "id": 13659,
        "title": "Enhancement of Resulting Image Search Engine (ERISE) by Content-Based Image Retrieval System",
        "authors": " Sumaiya, Md. Armanuzzaman",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tensymp50017.2020.9230653"
    },
    {
        "id": 13660,
        "title": "Multi-Branch Convolutional Descriptors for Content-based Remote Sensing Image Retrieval",
        "authors": "Raffaele Imbriaco, Tunc Alkanat, Egor Bondarev, Peter de With",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008895702420249"
    },
    {
        "id": 13661,
        "title": "A Study on Content based Image Retrieval Using Knowledge Extraction Technique",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.52783/jier.v4i1.670"
    },
    {
        "id": 13662,
        "title": "Content-Based Image Retrieval Using Texture Features",
        "authors": "Prashant Srivastava, Manish Khare, Ashish Khare",
        "published": "2022-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003267782-2"
    },
    {
        "id": 13663,
        "title": "Content-based image retrieval base on relevance feedback",
        "authors": "Haixin Wen, Yinwei Zhan",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.4992856"
    },
    {
        "id": 13664,
        "title": "Colour Features Extraction Techniques and Approaches for Content-Based Image Retrieval (CBIR) System",
        "authors": "Muhammad Naim Abdullah, Mohd Afizi Mohd Shukran, Mohd Rizal Mohd Isa, Nor Suraya Mariam Ahmad, Mohammad Adib Khairuddin, Mohd Sidek Fadhil Mohd Yunus, Fatimah Ahmad",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4236/msce.2021.97003"
    },
    {
        "id": 13665,
        "title": "Content-based fauna image retrieval system",
        "authors": "Mas Rina Mustaffa, Wong San San",
        "published": "2017-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsipa.2017.8120594"
    },
    {
        "id": 13666,
        "title": "Content-Based Image Retrieval Using Shape Features",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "This chapter presents CBIR methodologies for extracting geometric and margin features of objects in images and constructed as feature vector. This approach is unique in nature as the size of the feature is relatively small and capable of discriminating the query object with the data base object. These geometric features measure the object characteristics in terms of its shape and margin. Manhattan distance is used for measuring the similarity between query images and the database images for retrieving relevant images from the database.",
        "link": "http://dx.doi.org/10.4018/978-1-5225-3796-0.ch002"
    },
    {
        "id": 13667,
        "title": "Content-based image retrieval for fabric images: A survey",
        "authors": "Silvester Tena, Rudy Hartanto, Igi Ardiyanto",
        "published": "No Date",
        "citations": 0,
        "abstract": "In recent years, a great deal of research has been conducted in the area of fabric image retrieval, especially the identification and classification of visual features. One of the challenges associated with the domain of content-based image retrieval (CBIR) is the semantic gap between low-level visual features and high-level human perceptions. Generally, CBIR includes two main components, namely feature extraction and similarity measurement. Therefore, this research aims to determine the content-based image retrieval for fabric using feature extraction techniques grouped into traditional methods and convolutional neural networks (CNN). Traditional descriptors deal with low-level features, while CNN addresses the high-level, called semantic features. Traditional descriptors have the advantage of shorter computation time and reduced system requirements. Meanwhile, CNN descriptors, which handle high-level features tailored to human perceptions, deal with large amounts of data and require a great deal of computation time. In general, thefeatures of a CNN's fully connected layers are used for matching query and database images. In several studies, the extracted features of the CNN's convolutional layer were used for image retrieval. At the end of the CNN layer, hash codes are added to reduce search time.",
        "link": "http://dx.doi.org/10.31219/osf.io/5v2ty"
    },
    {
        "id": 13668,
        "title": "Content Based Image Retrieval on Satellite Imagery",
        "authors": "Zeynep GÖKCE",
        "published": "2023-7-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223878"
    },
    {
        "id": 13669,
        "title": "Content-based image retrieval: Colorfulness and Depth visual perception quantification",
        "authors": "Solene Vilfroy, Thierry Urruty, Philippe Carre, Lionel Bombrun, Arnaud Bour",
        "published": "2021-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cbmi50038.2021.9461892"
    },
    {
        "id": 13670,
        "title": "Content-based medical image retrieval system based on gradient orientation and edge information",
        "authors": "PRANJIT DAS",
        "published": "2018-9-5",
        "citations": 1,
        "abstract": "Retrieval of biomedical pictures is a significant side of computer based diagnosis. It helps the radiologist and restorative authority to spot and analyze the particular disease. This paper proposes a Content Based Medical Image Retrieval (CBMIR) approach for retrieving similar biomedical images. The extraction of retrieving features is based on histogram of oriented gradients (HOG) and canny edge detection. To reduce the dimensionality, principal component analysis(PCA) is employed over the feature vector. The experiments are conducted on high-resolution computed tomography medical images of lungs. With the average retrieval rate (ARR) and average retrieval precision (ARP), the performance of the proposed approach is analyzed and compared with other existing methods viz. Local Binary Pattern (LBP), LBP with uniform patterns (LBPu2), Local Mesh Pattern with uniform patterns (LMePu2) and LMeP with gabor transform (GLMeP).",
        "link": "http://dx.doi.org/10.24294/as.v1i3.969"
    }
]