[
    {
        "id": 105,
        "title": "Parameter Estimation Via Expectation Maximization - Expectation Consistent Algorithm",
        "authors": "Fangqing Xiao, Dirk Slock",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447082"
    },
    {
        "id": 106,
        "title": "Total variation regularized expectation maximization reconstruction improves 68Ga-FAPI-04 PET/CT image quality as compared to ordered subset expectation maximization reconstruction",
        "authors": "Hanxiang LIU, Lin LIU, Shijie XU, Zhonglin LU, Greta S. MOK, Yingwei WANG, Yi TAO, Yue CHEN",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23736/s1824-4785.22.03409-4"
    },
    {
        "id": 107,
        "title": "Slow Expectation-Maximization Convergence in Low-Noise Dynamic Factor Models",
        "authors": "Daan Opschoor, Dick J.C. van Dijk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4408065"
    },
    {
        "id": 108,
        "title": "Risk-Sensitive RL Using Sampling-Based Expectation-Maximization",
        "authors": "Erfaun Noorani, John S. Baras, Karl H. Johansson",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cdc49753.2023.10383692"
    },
    {
        "id": 109,
        "title": "Adaptive Noise Covariance Estimation Under Colored Noise Using Dynamic Expectation Maximization",
        "authors": "Ajith Anil Meera, Pablo Lanillos",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cdc49753.2023.10383933"
    },
    {
        "id": 110,
        "title": "Big Learning Expectation Maximization",
        "authors": "Yulai Cong, Sijia Li",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Mixture models serve as one fundamental tool with versatile applications. However, their training techniques, like the popular Expectation Maximization (EM) algorithm, are notoriously sensitive to parameter initialization and often suffer from bad local optima that could be arbitrarily worse than the optimal. To address the long-lasting bad-local-optima challenge, we draw inspiration from the recent ground-breaking foundation models and propose to leverage their underlying big learning principle to upgrade the EM. Specifically, we present the Big Learning EM (BigLearn-EM), an EM upgrade that simultaneously performs joint, marginal, and orthogonally transformed marginal matchings between data and model distributions. Through simulated experiments, we empirically show that the BigLearn-EM is capable of delivering the optimal with high probability; comparisons on benchmark clustering datasets further demonstrate its effectiveness and advantages over existing techniques. The code is available at https://github.com/YulaiCong/Big-Learning-Expectation-Maximization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i10.29050"
    },
    {
        "id": 111,
        "title": "An Experimental Evaluation of the Expectation Maximization Algorithm",
        "authors": "Dimitrios Karapiperis, Georgios Feretzakis, Vassilios S. Verykios",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iisa59645.2023.10345907"
    },
    {
        "id": 112,
        "title": "Correlated Wishart matrices classification via an expectation-maximization composite likelihood-based algorithm",
        "authors": "Zhou Lan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4310/22-sii770"
    },
    {
        "id": 113,
        "title": "An expectation maximization algorithm for the hidden markov models with multiparameter student-t observations",
        "authors": "Emna Ghorbel, Mahdi Louati",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00180-023-01432-7"
    },
    {
        "id": 114,
        "title": "CRF-MEM: Conditional Random Field Model Based Modified Expectation Maximization Algorithm for Sarcasm Detection in Social Media",
        "authors": "Anbarasu Sivalingam Anbarasu Sivalingam, Karthik Sundararajan Anbarasu Sivalingam, Anandhakumar Palanisamy Karthik Sundararajan",
        "published": "2023-1",
        "citations": 1,
        "abstract": "\n                        <p>Text processing is an important task in various machine learning applications. One among the applications is Sentiment analysis. However, the presence of sarcasm makes it difficult for analyzing the sentiment of the statement. In the current scenario, the amount of sarcastic statements in any social media platform is high taking the forms of memes, comments, trolls etc. Hence it is important to identify sarcasm to preserve the polarity of any given statement. Sarcasm usually means the opposite of what the sentence seems to convey. While the existing works in literature have focused on detecting sarcasm, the proposed model, in addition to that, determines the levels of sarcasm present in the text, which will aid in finding the level of harshness present in the statement. In this work, an unsupervised learning model, Conditional Random Field model based Modified Expectation Maximization (CRF-MEM) algorithm has been proposed for detecting sarcasm in tweets. The proposed model aims to overcome the limitation present in the traditional EM algorithm, the random assignment factor, with the proposed aspect relationship value. Experimental results showed that the proposed CRF-MEM achieved an accuracy of 91.89% whereas the traditional EM displayed an accuracy of 80% in detecting sarcasm from text.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/160792642023012401005"
    },
    {
        "id": 115,
        "title": "Confidence-Aware Personalized Federated Learning via Variational Expectation Maximization",
        "authors": "Junyi Zhu, Xingchen Ma, Matthew B. Blaschko",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.02351"
    },
    {
        "id": 116,
        "title": "Doubly Selective with Expectation Maximization based Massive-Mimo-Non-Orthogonal Multiple Access systems",
        "authors": "",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "The Long-Term Evaluation (LTE) based Fourth Generation (4G) and Fifth Generation (5G) communications require higher data rates to satisfy the requirements of user equipment. However, it is a difficult task for conventional Multiple Input Multiple Output (MIMO) systems to deliver the highest throughput and data rates to end users. Additionally, an increase in data rates led to increased power consumption, which decreased spectrum efficiency and energy efficiency. Therefore, this paper focuses on the implementation of the Doubly Selective with Expectation Maximization (DSEM) channel estimation method for Massive-MIMO based Non-Orthogonal Multiple Access (NOMA) systems. Here, the DSEM scheme divides the channel into expectation and maximization vectors based on antenna diversity. Further, time sample and frequency band base dual channel analysis are performed to maintain the synchronization in the receiver. The simulations conducted using MatlabR2018a show that base station (BS) capacity, user equipment capacity, uplink (UL)-Spectrum Efficiency (SE), and downlink (DL)-SE performance measures are improved in Massive-MIMO-NOMA systems using DSEM channel estimation and shows the superior performance than state of art approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59018/0923242"
    },
    {
        "id": 117,
        "title": "Sentiment Analysis Based on Social Networks Using Support Expectation-Maximization for E-Commerce Applications",
        "authors": "Paramjit Baxi",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdcece57866.2023.10150703"
    },
    {
        "id": 118,
        "title": "An Expectation-Maximization Algorithm for Combining a Sample of Partially Overlapping Covariance Matrices",
        "authors": "Deniz Akdemir, Mohamed Somo, Julio Isidro-Sanchéz",
        "published": "2023-2-4",
        "citations": 1,
        "abstract": "The generation of unprecedented amounts of data brings new challenges in data management, but also an opportunity to accelerate the identification of processes of multiple science disciplines. One of these challenges is the harmonization of high-dimensional unbalanced and heterogeneous data. In this manuscript, we propose a statistical approach to combine incomplete and partially-overlapping pieces of covariance matrices that come from independent experiments. We assume that the data are a random sample of partial covariance matrices sampled from Wishart distributions and we derive an expectation-maximization algorithm for parameter estimation. We demonstrate the properties of our method by (i) using simulation studies and (ii) using empirical datasets. In general, being able to make inferences about the covariance of variables not observed in the same experiment is a valuable tool for data analysis since covariance estimation is an important step in many statistical applications, such as multivariate analysis, principal component analysis, factor analysis, and structural equation modeling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12020161"
    },
    {
        "id": 119,
        "title": "Self-Supervised Blind Motion Deblurring with Deep Expectation Maximization",
        "authors": "Ji Li, Weixi Wang, Yuesong Nan, Hui Ji",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01344"
    },
    {
        "id": 120,
        "title": "Performance improvement in inventory classification using the Expectation-Maximization algorithm",
        "authors": "Punniyamoorthy Murugesan, Kathirvel Selvaraju",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijenm.2024.10059173"
    },
    {
        "id": 121,
        "title": "Energy Hole Minimization in Wireless Mobile Ad Hoc Networks Using Enhanced Expectation-Maximization",
        "authors": "J. Viji Gripsy, A. Jayanthiladevi",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10112728"
    },
    {
        "id": 122,
        "title": "Exploring the Influence of Initial Estimates on Iterative Maximum Likelihood Expectation–maximization in Tomographic Reconstruction",
        "authors": "Mohsen Qutbi",
        "published": "2024",
        "citations": 0,
        "abstract": "\nPurpose:\nTo explore the influence of initial guess or estimate (uniform as “ones” and “zeros” vs. filtered back projection [FBP] image) as an input image for maximum likelihood expectation–maximization (MLEM) tomographic reconstruction algorithm and provide the curves of error or convergence for each of these three initial estimates.\n\n\nMethods:\nTwo phantoms, created as digital images, were utilized: one was a simple noiseless object and the other was a more complicated, noise-degraded object of the section of lower thorax in a matrix of 256 × 256 pixels. Both underwent radon transform or forward projection process and the corresponding sinograms were generated. For filtering during tomographic image reconstruction, ramp and Butterworth filters, as high-pass and low-pass ones, were applied to images. The second phantom (lower thorax) was radon-transformed and the resulting sinogram was degraded by noise. As initial guess or estimate images, in addition to FBP tomographic image, two uniform images, one with all pixels having a value of 1 (“ones”) and the other with all having zero (“zeros”), were created. The three initial estimates (FBP, ones, and zeros) were reconstructed with iterative MLEM tomographic reconstruction (with 1, 2, 4, 8, 16, 32, and 64 iterations). The difference between the object and the updated slice was calculated at the end of each iteration (as error matrix), and the mean squared error (MSE) was computed and plotted separately or in conjunction with the MSE curves of other initial estimates. All computations were implemented in MATLAB software.\n\n\nResults:\nThe results of ones and zeros seemed strikingly similar. The curves of uniform ones and uniform zeros were so close to each other that overlap near-perfectly. However, in the FBP slice as an initial estimate, the resulting tomographic slice was similar with a much higher extent to the object even after 1 or 2 iterations. The pattern of convergence for all three curves was roughly similar. The normalized MSE decreased sharply up to 5 iterations and then, after 10 iterations, the curves reached a plateau until 32 iterations. For the phantom of the lower thorax section with its noise-degraded sinogram, similar to the pattern observed for simple disk-shaped phantom, the curves (normalized MSE) fell sharply up to 10 iterations and then rapidly converged thereafter until 64 iterations.\n\n\nConclusion:\nSimilar results are observed when choosing different initial guesses or estimates (uniform vs. FBP) as the starting point, based on the error calculation using MSE. The algorithm converges almost similarly for all initial estimates. Therefore, selecting a uniform initial guess image can be an appropriate choice and may be preferred over an FBP image. Reducing the processing time can be a valid reason for this choice.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/jmp.jmp_110_23"
    },
    {
        "id": 123,
        "title": "Expectation-maximization type algorithms for direction of arrival estimation in unknown nonuniform noise",
        "authors": "Ming-yan Gong, Bin Lyu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dsp.2023.104220"
    },
    {
        "id": 124,
        "title": "Extended Expectation Maximization for Under-Fitted Models",
        "authors": "Aref Miri Rekavandi, Abd-Krim Seghouane, Farid Boussaid, Mohammed Bennamoun",
        "published": "2023-6-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095526"
    },
    {
        "id": 125,
        "title": "Distributed online expectation-maximization algorithm for Poisson mixture model",
        "authors": "Qian Wang, Guangbao Guo, Guoqi Qian, Xuejun Jiang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apm.2023.08.016"
    },
    {
        "id": 126,
        "title": "Markov random field model and expectation of maximization for images segmentation",
        "authors": "Lalaoui Lahouaoui, Djaalab Abdelhak",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Image segmentation is a significant issue in image processing. Among the various models and approaches that have been developed, some are commonly used the Markov Random Field (MRF) model, statistical techniques (MRF). In this study a Markov random field proposed is based on an EM Modified (EMM) model. In this paper, The local optimization is based on a modified Expectation-Maximization (EM) method for parameter estimation and the ICM method for finding the solution given a fixed set of these parameters. To select the combination strategy, it is necessary to carry out a comparative study to find the best result. The effectiveness of our proposed methods has been proven by experimentation. We have applied this segmented algorithm to different types of images, exhibiting the algorithm's image segmentation strength with its best values criteria for EM statics and other methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v29.i2.pp772-779"
    },
    {
        "id": 127,
        "title": "Stochastic Expectation Maximization Algorithm for Linear Mixed-Effects Model with Interactions in the Presence of Incomplete Data",
        "authors": "Alandra Zakkour, Cyril Perret, Yousri Slaoui",
        "published": "2023-3-8",
        "citations": 1,
        "abstract": "The purpose of this paper is to propose a new algorithm based on stochastic expectation maximization (SEM) to deal with the problem of unobserved values when multiple interactions in a linear mixed-effects model (LMEM) are present. We test the effectiveness of the proposed algorithm with the stochastic approximation expectation maximization (SAEM) and Monte Carlo Markov chain (MCMC) algorithms. This comparison is implemented to highlight the importance of including the maximum effects that can affect the model. The applications are made on both simulated psychological and real data. The findings demonstrate that our proposed SEM algorithm is highly preferable to the other competitor algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25030473"
    },
    {
        "id": 128,
        "title": "An Expectation-Maximization Algorithm for Including Oncological COVID-19 Deaths in Survival Analysis",
        "authors": "Francesca De Felice, Luca Mazzoni, Franco Moriconi",
        "published": "2023-2-8",
        "citations": 0,
        "abstract": "We address the problem of how COVID-19 deaths observed in an oncology clinical trial can be consistently taken into account in typical survival estimates. We refer to oncological patients since there is empirical evidence of strong correlation between COVID-19 and cancer deaths, which implies that COVID-19 deaths cannot be treated simply as non-informative censoring, a property usually required by the classical survival estimators. We consider the problem in the framework of the widely used Kaplan–Meier (KM) estimator. Through a counterfactual approach, an algorithmic method is developed allowing to include COVID-19 deaths in the observed data by mean-imputation. The procedure can be seen in the class of the Expectation-Maximization (EM) algorithms and will be referred to as Covid-Death Mean-Imputation (CoDMI) algorithm. We discuss the CoDMI underlying assumptions and the convergence issue. The algorithm provides a completed lifetime data set, where each Covid-death time is replaced by a point estimate of the corresponding virtual lifetime. This complete data set is naturally equipped with the corresponding KM survival function estimate and all available statistical tools can be applied to these data. However, mean-imputation requires an increased variance of the estimates. We then propose a natural extension of the classical Greenwood’s formula, thus obtaining expanded confidence intervals for the survival function estimate. To illustrate how the algorithm works, CoDMI is applied to real medical data extended by the addition of artificial Covid-death observations. The results are compared with the estimates provided by the two naïve approaches which count COVID-19 deaths as censoring or as deaths by the disease under study. In order to evaluate the predictive performances of CoDMI an extensive simulation study is carried out. The results indicate that in the simulated scenarios CoDMI is roughly unbiased and outperforms the estimates obtained by the naïve approaches. A user-friendly version of CoDMI programmed in R is freely available.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/curroncol30020163"
    },
    {
        "id": 129,
        "title": "A New Fast Bloc Matching Algorithm Using Unsupervised Bayesian Classifier with Bootstrap Gaussian Expectation Maximization Algorithm",
        "authors": "Djoudi Kerfa, Faouzi Ghorbel",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01757-6"
    },
    {
        "id": 130,
        "title": "An efficient image segmentation method based on expectation maximization and Salp swarm algorithm",
        "authors": "Ehsan Ehsaeyan",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15149-8"
    },
    {
        "id": 131,
        "title": "ANFIS learning using expectation maximization based Gaussian mixture model and multilayer perceptron learning",
        "authors": "Sadaf Jabeen, Mubasher Baig, Mian Muhammad Awais",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110958"
    },
    {
        "id": 132,
        "title": "Robust M-Estimation Based Distributed Expectation Maximization Algorithm with Robust Aggregation",
        "authors": "Christian A. Schroth, Stefan Vlaski, Abdelhak M. Zoubir",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096191"
    },
    {
        "id": 133,
        "title": "Enhancing Energy Level and Network Lifetime for Asynchronous Duty Cycled WSN with Expectation-Maximization Algorithm",
        "authors": "R. Purushothaman, R. Narmadha",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10084142"
    },
    {
        "id": 134,
        "title": "System Identification in Distribution Grid Without Phase Angle using Expectation Maximization",
        "authors": "Shubhankar Kapoor, Johannes Hendriks, Lachlan Blackhall",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.10.790"
    },
    {
        "id": 135,
        "title": "Correction to: Tempered expectation-maximization algorithm for the estimation of discrete latent variable models",
        "authors": "Luca Brusa, Francesco Bartolucci, Fulvia Pennoni",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00180-022-01321-5"
    },
    {
        "id": 136,
        "title": "Expectation-Maximization Algorithm for Identification of Mesh-Based Compartment Thermal Model of Power Modules",
        "authors": "Jakub Ševčík, Václav Šmídl, Ondřej Straka",
        "published": "2023-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01457632.2023.2241174"
    },
    {
        "id": 137,
        "title": "HD Map Generation from Noisy Multi-Route Vehicle Fleet Data on Highways with Expectation Maximization",
        "authors": "Fabian Immel, Richard Fehler, Mohammad M. Ghanaat, Florian Ries, Martin Haueis, Christoph Stiller",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv55152.2023.10186773"
    },
    {
        "id": 138,
        "title": "An Enhanced Expectation Maximization Text Document Clustering Algorithm for E-Content Analysis",
        "authors": "Thangaraj M, Ponmani K",
        "published": "2023-2-6",
        "citations": 0,
        "abstract": "Nowadays, there are many types of digital materials that can be used in the classroom. Students and scholars are migrating from textbooks to digital study materials because textbooks are too large and expensive. Teachers and college students can use and modify the materials that are freely available or with some constraints for their learning and teaching. E-content can be designed, evolved, utilized, re-used, and distributed electronically from anywhere at anytime. Because of the flexibility of time, place, and speed of learning, e-content is becoming extremely popular. It can be readily and instantly shared and communicated with an infinite number of clients all across the globe. Document clustering is most commonly used to group documents that are related to a specific topic. Text document clustering can be used to group a collection of documents regarding the information they include and to deliver search results when a user searches the internet. In this paper mainly focuses on text document clustering to cope with massive collection of E-Content documents. Enhanced Expectation Maximization Text Document Clustering (EEMTDC) clustering algorithm was proposed and compared with Expectation Maximization (EM) clustering, K-Means clustering, and Hierarchical clustering (HC) algorithms. The experiment shows that the performance of proposed EEMTDC algorithm produces greater clustering accuracy than existing clustering algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i1.5982"
    },
    {
        "id": 139,
        "title": "Expectation-Maximization Algorithm for the Weibull Proportional Hazard Model under Current Status Data",
        "authors": "Sisi Chen, Fengkai Yang",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Due to the flexibility of the Weibull distribution and the proportional hazard (PH) model, Weibull PH is widely used in survival analysis under right censored data and interval censored data but it is seldom investigated under current status data, partially because there is less information in current status data than in right censored data and interval censored data. This paper considers the Weibull PH model under the current status data and introduces the Poisson latent variables to augment the data, then uses the expectation-maximization (EM) algorithm to obtain the maximum likelihood estimators of the model parameters. The EM algorithm is compared with the Newton–Raphson (NR) algorithm from several perspectives in the simulation studies, and the results show that the proposed method has several highlights, such as computational simplicity, improved convergence stability, and overall estimator results that are either comparable or slightly better in terms of bias. Furthermore, the performance of the Weibull PH model and the semi-parametric PH model is compared under two simulation scenarios, and two standard model selection criteria are used for model selection. The results indicate that the Weibull PH model has significant advantages when failure time follows a Weibull distribution. Lastly, the Weibull PH model along with EM algorithm is applied to lung tumor data and intraocular lens (IOL) calcification data with the aim of assessing the impact of covariates, including environmental factors and gender, on event timing and risk.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11234826"
    },
    {
        "id": 140,
        "title": "On a result of K. P. Hart about non-existence of measurable solutions to the discrete expectation maximization problem",
        "authors": "Vladimir G.  Pestov",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14712/1213-7243.2023.031"
    },
    {
        "id": 141,
        "title": "Medical image segmentation using hybrid Contrast Limited Adaptive Histogram Equalization (CLAHE) and expectation maximization algorithm",
        "authors": "K.C. Prabu Shankar, S. Prayla Shyry",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Early detection of diseases in men and women can improve treatment and reduce the risk involved in human life. Nowadays techniques which are non-invasive in nature are popularly used to detect the various types of diseases. Histopathological analysis plays a major role in finding the nature of the disease through medical images. Manual interpretation of these medical imaging takes time, is tedious, subjective, and can have human errors. It has also been discovered that the interpretation of these images varies amongst diagnostic labs. As computer power and memory capacity have increased, methodologies and medical image processing techniques have been developed to interpret and analyse these images as a substitute for human involvement. The challenge lies in devising an efficient pre-processing technique that helps in analysing, processing and preparing the medical image for further diagnostics. This research provides a hybrid technique that reduces noise in the NITFI medical image by using a 2D adaptive median filter at level 1. The edges of the filtered medical image are preserved using the modified CLAHE algorithm which preserves the local contrast of the image. Expectation Maximization (EM) algorithm extracts the ROI part of the image which helps in easy and accurate identification of the disease. All the three steps are run over the 3D image slices of a NIFTI image. The proposed method proves that it achieves close to ideal RMSE, PSNR and UQI values as well as achieves an average runtime of 37.193 seconds for EM per slice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-233931"
    },
    {
        "id": 142,
        "title": "Expectation-Maximization Regularised Deep Learning for Tumour Segmentation",
        "authors": "Chao Li, Wenjian Huang, Xi Chen, Yiran Wei, Lipei Zhang, Jianguo Zhang, Stephen Price, Carola-Bibiane Schönlieb",
        "published": "2023-4-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230573"
    },
    {
        "id": 143,
        "title": "Affective analysis in machine learning using AMIGOS with Gaussian expectation-maximization model",
        "authors": "Balamurugan Kaliappan, Bakkialakshmi Vaithialingam Sudalaiyadumperumal, Sudalaimuthu Thalavaipillai",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "<p>Investigating human subjects is the goal of predicting human emotions in the stock market. A significant number of psychological effects require (feelings) to be produced, directly releasing human emotions. The development of effect theory leads one to believe that one must be aware of one's sentiments and emotions to forecast one's behavior. The proposed line of inquiry focuses on developing a reliable model incorporating neurophysiological data into actual feelings. Any change in emotional affect will directly elicit a response in the body's physiological systems. This approach is named after the notion of Gaussian mixture models (GMM). The statistical reaction following data processing, quantitative findings on emotion labels, and coincidental responses with training samples all directly impact the outcomes that are accomplished. In terms of statistical parameters such as population mean and standard deviation, the suggested method is evaluated compared to a technique considered to be state-of-the-art. The proposed system determines an individual's emotional state after a minimum of 6 iterative learning using the Gaussian expectation-maximization (GEM) statistical model, in which the iterations tend to continue to zero error. Perhaps each of these improves predictions while simultaneously increasing the amount of value extracted.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijres.v13.i1.pp201-209"
    },
    {
        "id": 144,
        "title": "Stochastic Optimal Control for Multivariable Dynamical Systems Using Expectation Maximization",
        "authors": "Prakash Mallick, Zhiyong Chen",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3190246"
    },
    {
        "id": 145,
        "title": "Expectation–maximization machine learning model for micromechanical evaluation of thermally-cycled solder joints in a semiconductor",
        "authors": "Tzu-Chia Chen",
        "published": "2023-8-2",
        "citations": 1,
        "abstract": "Abstract\nThis paper aims to study the microstructural and micromechanical variations of solder joints in a semiconductor under the evolution of thermal-cycling loading. For this purpose, a model was developed on the basis of expectation–maximization machine learning (ML) and nanoindentation mapping. Using this model, it is possible to predict and interpret the microstructural features of solder joints through the micromechanical variations (i.e. elastic modulus) of interconnection. According to the results, the classification of Sn-based matrix, intermetallic compounds (IMCs) and the grain boundaries with specified elastic-modulus ranges was successfully performed through the ML model. However, it was detected some overestimations in regression process when the interfacial regions got thickened in the microstructure. The ML outcomes also revealed that the thermal-cycling evolution was accompanied with stiffening and growth of IMCs; while the spatial portion of Sn-based matrix decreased in the microstructure. It was also figured out that the stiffness gradient becomes intensified in the treated samples, which is consistent with this fact that the thermal cycling increases the mechanical mismatch between the matrix and the IMCs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-648x/accdab"
    },
    {
        "id": 146,
        "title": "Clustered Sparse Channel Estimation for Massive MIMO Systems by Expectation Maximization-Propagation (EM-EP)",
        "authors": "Mohammed Rashid, Mort Naraghi-Pour",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tvt.2023.3250399"
    },
    {
        "id": 147,
        "title": "Moving objects detection in thermal scene videos using unsupervised Bayesian classifier with bootstrap Gaussian expectation maximization algorithm",
        "authors": "Djoudi Kerfa",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15849-1"
    },
    {
        "id": 148,
        "title": "Time-Adaptive Expectation Maximization Learning Framework for HMM Based Data-Driven Gas Sensor Calibration",
        "authors": "Yang You, Tobias J. Oechtering",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tii.2022.3215960"
    },
    {
        "id": 149,
        "title": "The expectation–maximization approach for Bayesian additive Cox regression with current status data",
        "authors": "Di Cui, Clarence Tee",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42952-023-00204-9"
    },
    {
        "id": 150,
        "title": "Expectation-Maximization Algorithms for Gaussian Mixture Models Using Linear Algebra Libraries on Parallel Shared-Memory Systems",
        "authors": "Wojciech Kwedlo",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15439/2023f9859"
    },
    {
        "id": 151,
        "title": "A Flexible Framework for Expectation Maximization-Based MIMO System Identification for Time-Variant Linear Acoustic Systems",
        "authors": "Tobias Kabzinski, Peter Jax",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ojsp.2023.3337721"
    },
    {
        "id": 152,
        "title": "Photon Counting Histogram Expectation Maximization Algorithm for Characterization of Deep Sub-Electron Read Noise Sensors",
        "authors": "Aaron J. Hendrickson, David P. Haefner",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jeds.2023.3290106"
    },
    {
        "id": 153,
        "title": "Fusion of Centroid-Based Clustering With Graph Clustering: An Expectation-Maximization-Based Hybrid Clustering",
        "authors": "Zekeriya Uykan",
        "published": "2023-8",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3121224"
    },
    {
        "id": 154,
        "title": "An expectation conditional maximization algorithm for the skew-normal based stochastic frontier model",
        "authors": "Xiaonan Zhu, Zheng Wei, Tonghui Wang, S. T. Boris Choy, Ziwei Ma",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00180-023-01356-2"
    },
    {
        "id": 155,
        "title": "MODELING THE MANY EARTHQUAKES IN SUMATRA USING POISSON HIDDEN MARKOV MODELS AND EXPECTATION MAXIMIZATION ALGORITHM",
        "authors": "Muhammad Arib Alwansyah, Ramya Rachmawati",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Sumatra Island is one of the islands that are prone to earthquakes because Sumatra Island is located at the confluence of three plates, namely the large Indo-Australian plate, the Eurasian plate and the Philippine plate. In general, the number of earthquake events follows the Poisson distribution, but there are cases where there is overdispersion in the Poisson distribution. The Poisson Hidden Markov Models (PHMMs) method is used to overcome overdispersion, then applying the Expectation-Maximization Algorithm (EM algorithm) to each model to obtain the estimated parameters. From the models obtained, the best model will be selected based on the smallest Akaike Information Criterion (AIC) value. The data used is secondary data on earthquake events on the island of Sumatra from January 2000 to December 2022 with a depth of ≤ 70 Km and a magnitude of ≥ 4.4 Mw. From the research, the model with m = 3 is the best estimation model with an AIC value of 1503,286. From the best model, estimates are obtained for Poisson Hidden Markov Models with an average occurrence of earthquakes of 5.7633 ≈ 6 events within one month.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol18iss1pp0163-10135"
    },
    {
        "id": 156,
        "title": "Using Regularization to Identify Measurement Bias Across Multiple Background Characteristics: A Penalized Expectation–Maximization Algorithm",
        "authors": "William C. M. Belzak, Daniel J. Bauer",
        "published": "2024-2-5",
        "citations": 1,
        "abstract": " Testing for differential item functioning (DIF) has undergone rapid statistical developments recently. Moderated nonlinear factor analysis (MNLFA) allows for simultaneous testing of DIF among multiple categorical and continuous covariates (e.g., sex, age, ethnicity, etc.), and regularization has shown promising results for identifying DIF among many covariates. However, computationally inefficient estimation methods have hampered practical use of the regularized MNFLA method. We develop a penalized expectation–maximization (EM) algorithm with soft- and firm-thresholding to more efficiently estimate regularized MNLFA parameters. Simulation and empirical results show that, compared to previous implementations of regularized MNFLA, the penalized EM algorithm is faster, more flexible, and more statistically principled. This method also yields similar recovery of DIF relative to previous implementations, suggesting that regularized DIF detection remains a preferred approach over traditional methods of identifying DIF. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/10769986231226439"
    },
    {
        "id": 157,
        "title": "Training-Based Multiple Source Tracking Using Manifold-Learning and Recursive Expectation-Maximization",
        "authors": "Avital Bross, Sharon Gannot",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/taslp.2023.3245414"
    },
    {
        "id": 158,
        "title": "A general algorithm for error-in-variables regression modelling using Monte Carlo expectation maximization",
        "authors": "Jakub Stoklosa, Wen-Han Hwang, David I. Warton",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "In regression modelling, measurement error models are often needed to correct for uncertainty arising from measurements of covariates/predictor variables. The literature on measurement error (or errors-in-variables) modelling is plentiful, however, general algorithms and software for maximum likelihood estimation of models with measurement error are not as readily available, in a form that they can be used by applied researchers without relatively advanced statistical expertise. In this study, we develop a novel algorithm for measurement error modelling, which could in principle take any regression model fitted by maximum likelihood, or penalised likelihood, and extend it to account for uncertainty in covariates. This is achieved by exploiting an interesting property of the Monte Carlo Expectation-Maximization (MCEM) algorithm, namely that it can be expressed as an iteratively reweighted maximisation of complete data likelihoods (formed by imputing the missing values). Thus we can take any regression model for which we have an algorithm for (penalised) likelihood estimation when covariates are error-free, nest it within our proposed iteratively reweighted MCEM algorithm, and thus account for uncertainty in covariates. The approach is demonstrated on examples involving generalized linear models, point process models, generalized additive models and capture–recapture models. Because the proposed method uses maximum (penalised) likelihood, it inherits advantageous optimality and inferential properties, as illustrated by simulation. We also study the model robustness of some violations in predictor distributional assumptions. Software is provided as the refitME package on R, whose key function behaves like a refit() function, taking a fitted regression model object and re-fitting with a pre-specified amount of measurement error.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0283798"
    },
    {
        "id": 159,
        "title": "EMCLR: Expectation Maximization Contrastive Learning Representations",
        "authors": "Meng Liu, Ran Yi, Lizhuang Ma",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094790"
    },
    {
        "id": 160,
        "title": "Snapshot-deficient active target localization in beam-time domain using multi-frequency expectation-maximization algorithm",
        "authors": "He Wang, Ting Zhang, Lei Cheng, Hangfang Zhao",
        "published": "2023-2-1",
        "citations": 5,
        "abstract": "The two-dimensional (2D) active target localization is generally hindered by the high temporal and spatial sidelobe levels in snapshot-deficient scenarios, where the adaptive approaches undergo performance degeneration since they require many snapshots to build the sample covariance matrix. Aiming at working robustly in snapshot-deficient active scenarios, a 2D expectation-maximization-based vertical-time-record (EMVTR) approach is proposed to compensate for the snapshot deficiency and achieve the high-resolution active localization by reconstructing the covariance matrix using estimated hyperparameters, i.e., signal powers and noise variance. With the short-time Fourier transform, the proposed approach could reduce echoes' temporal correlation and attain robust beam-time localization in mild reverberation. The multi-frequency EMVTR is derived from the single-frequency case to improve the weak echo localization. The performance is evaluated by considering single and multiple target echoes in simulation and a single moving target with tank experimental data. The results manifest the proposed EMVTR's robustness and effectiveness for the 2D active localization in snapshot-deficient scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1121/10.0017164"
    },
    {
        "id": 161,
        "title": "Stability of radiomic features from positron emission tomography images: a phantom study comparing advanced reconstruction algorithms and ordered subset expectation maximization",
        "authors": "Takuro Shiiba, Masanori Watanabe",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13246-024-01416-x"
    },
    {
        "id": 162,
        "title": "Human crowd behaviour analysis based on video segmentation and classification using expectation–maximization with deep learning architectures",
        "authors": "Shruti Garg, Sudhir Sharma, Sumit Dhariwal, W. Deva Priya, Mangal Singh, S. Ramesh",
        "published": "2024-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18630-0"
    },
    {
        "id": 163,
        "title": "High-fidelity tomographic additive manufacturing for large-volume and high-attenuation situations using expectation maximization algorithm",
        "authors": "Tianhang Chen, Shangting You, Liang Xu, Chun Cao, Haifeng Li, Cuifang Kuang, Xu Liu",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.addma.2024.103968"
    },
    {
        "id": 164,
        "title": "An expectation–maximization framework for comprehensive prediction of isoform-specific functions",
        "authors": "Guy Karlebach, Leigh Carmody, Jagadish Chandrabose Sundaramurthi, Elena Casiraghi, Peter Hansen, Justin Reese, Christopher J Mungall, Giorgio Valentini, Peter N Robinson",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "AbstractMotivationAdvances in RNA sequencing technologies have achieved an unprecedented accuracy in the quantification of mRNA isoforms, but our knowledge of isoform-specific functions has lagged behind. There is a need to understand the functional consequences of differential splicing, which could be supported by the generation of accurate and comprehensive isoform-specific gene ontology annotations.ResultsWe present isoform interpretation, a method that uses expectation–maximization to infer isoform-specific functions based on the relationship between sequence and functional isoform similarity. We predicted isoform-specific functional annotations for 85 617 isoforms of 17 900 protein-coding human genes spanning a range of 17 430 distinct gene ontology terms. Comparison with a gold-standard corpus of manually annotated human isoform functions showed that isoform interpretation significantly outperforms state-of-the-art competing methods. We provide experimental evidence that functionally related isoforms predicted by isoform interpretation show a higher degree of domain sharing and expression correlation than functionally related genes. We also show that isoform sequence similarity correlates better with inferred isoform function than with gene-level function.Availability and implementationSource code, documentation, and resource files are freely available under a GNU3 license at https://github.com/TheJacksonLaboratory/isopretEM and https://zenodo.org/record/7594321.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioinformatics/btad132"
    },
    {
        "id": 165,
        "title": "ROV State Estimation Using Mixture of Gaussian Based on Expectation-Maximization Cubature Particle Filter",
        "authors": "Biao Wang, Chunhao Chen, Zhe Jiang, Yu Zhao",
        "published": "2023-5-10",
        "citations": 1,
        "abstract": "The underwater motion of the ROV is affected by various environmental factors, such as wind, waves, and currents. The complex relationship between these disturbance variables results in non-Gaussian noise distribution, which cannot be handled by the classical Kalman filter. For the accurate and real-time observation of ROV climbing, and, at the same time, to reduce the influence of the uncertainty of the noise distribution, the ROV state filter is designed based on the mixture of Gaussian model theory with the expectation-maximization cubature particle filter (EM-MOGCPF). The EM-MOGCPF considers different sensor measurement noises, and the addition of mixture of Gaussian (MOG) improves the fineness and real-time properties, while the expectation-maximization (EM) reduces the complexity of the algorithm. To estimate the ROV xyz-axis and yaw angular states, we establish a four-degree-of-freedom (4-DOF) ROV kinetics model, which uses a simulation platform for multiple sea state degrees. The results show that the EM-MOGCPF effectively improves the estimation accuracy and exhibits strong adaptability to nonlinear and non-Gaussian environments. We believe that this algorithm holds promise in solving the state estimation challenge in these difficult environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13105885"
    },
    {
        "id": 166,
        "title": "A stochastic alternative technique for Compton Maximum Likelihood Expectation-Maximization (MLEM) reconstruction",
        "authors": "Mina-Ermioni Tomazinaki, Efstathios Stiliaris",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.107502"
    },
    {
        "id": 167,
        "title": "Data-Driven Reconstruction of Dynamical Forces and Responses through Bayesian Expectation-Maximization and Modal Reduction Methods",
        "authors": "Daniz Teymouri, Omid Sedehi, Lambros S. Katafygiotis, Costas Papadimitriou",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/jenmdt.emeng-7023"
    },
    {
        "id": 168,
        "title": "Estimating the size of undeclared work from partially misclassified survey data via the Expectation–Maximization algorithm",
        "authors": "Maria Felice Arezzo, Giuseppina Guagnano, Domenico Vitale",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "Abstract\nUndeclared work (UW) is pervasive in economies. This explains the interest of public authorities in knowing its size and drivers. Unfortunately, this is a very complex task because several issues often arise in the collected data, due to the sensitivity of the topic. In sample surveys, one major problem is misclassification. Without appropriate adjustments, inference would provide biased estimates, the reason being the concealing of undeclared status. In order to overcome such problem, we developed a methodology based on a Expectation–Maximization algorithm that accounts for misclassification due to dishonest answering. Through the proposed approach, we are able to estimate the prevalence of UW and its determinants. The reliability of the methodology is validated through an extensive simulation study. An application to the Special Eurobarometer survey no. 402 on UW is provided.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jrsssc/qlae013"
    },
    {
        "id": 169,
        "title": "Expectation-Maximization clustering of states based on crime cases against children",
        "authors": "Lalitha Saroja Thota, Isharath Sultana, Yerraginnela Shravani, Suresh Babu Changalasetty, Syed Asif Basha, Sreelasya Changalasetty, Pulime Satyanarayana, Firdouse Banu",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307033"
    },
    {
        "id": 170,
        "title": "Enhanced Expectation-Maximization Algorithm for Smart Traffic IoT Systems using Deep Generative Adversarial Networks to Reduce waiting time",
        "authors": "B Yamini, M Jayaprakash, S Logesswari, V Ulagamuthalvi., R Porselvi, G S Uthayakumar",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icesc57686.2023.10193089"
    },
    {
        "id": 171,
        "title": "Expectation Maximization Algorithm for a Battery State of Health Model with Missing Data",
        "authors": "Dongqi Han",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "With the popularity of lithium-ion batteries, battery state of health (SOH) estimation has become one of the current research hotspots. Due to network congestion, collected data usually encounter time-delay or packet loss. In this paper, an expectation maximization (EM) algorithm is proposed for the SOH model which is approximated by a polynomial model. Based on the EM method, the missing data are computed in the E step, and the parameters are updated in the M step. Compared with the least square method, the proposed algorithm has more accurate estimation accuracy. The simulation example shows the effectiveness of the proposed algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1149/1945-7111/acf526"
    },
    {
        "id": 172,
        "title": "Expectation-maximization Estimation Algorithm for Bilinear State-space Systems with Missing Outputs Using Kalman Smoother",
        "authors": "Xinyue Wang, Junxia Ma, Weili Xiong",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12555-021-1029-5"
    },
    {
        "id": 173,
        "title": "Adaptive Radar Detection in Heterogeneous Clutter Plus Thermal Noise via the Expectation-Maximization Algorithm",
        "authors": "Angelo Coluccia, Alessio Fascista, Danilo Orlando, Giuseppe Ricci",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/taes.2023.3322389"
    },
    {
        "id": 174,
        "title": "Data-compatibility Analysis Based on Expectation-Maximization Algorithm with Unknown Noise Statistics",
        "authors": "Junyi Zuo, Shi Qiu, Wenzheng Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/taes.2023.3260074"
    },
    {
        "id": 175,
        "title": "SAR Coherent Change Detection With Variational Expectation Maximization",
        "authors": "David Tucker, Joshua N. Ash, Lee C. Potter",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/taes.2022.3213634"
    },
    {
        "id": 176,
        "title": "Online Expectation-Maximization Based Frequency and Phase Consensus in Distributed Phased Arrays",
        "authors": "Mohammed Rashid, Jeffrey A. Nanzer",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcomm.2023.3261388"
    },
    {
        "id": 177,
        "title": "Inference Based on the Stochastic Expectation Maximization Algorithm in a Kumaraswamy Model with an Application to COVID-19 Cases in Chile",
        "authors": "Jorge Figueroa-Zúñiga, Juan G. Toledo, Bernardo Lagos-Alvarez, Víctor Leiva, Jean P. Navarrete",
        "published": "2023-6-28",
        "citations": 3,
        "abstract": "Extensive research has been conducted on models that utilize the Kumaraswamy distribution to describe continuous variables with bounded support. In this study, we examine the trapezoidal Kumaraswamy model. Our objective is to propose a parameter estimation method for this model using the stochastic expectation maximization algorithm, which effectively tackles the challenges commonly encountered in the traditional expectation maximization algorithm. We then apply our results to the modeling of daily COVID-19 cases in Chile.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11132894"
    },
    {
        "id": 178,
        "title": "Reliability evaluation of components with multiple failure modes based on mixture Weibull distribution using expectation maximization algorithm",
        "authors": "Yuting Wu, Zhong Lu, Jiayu Wu, Xihui Liang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12206-024-0113-1"
    },
    {
        "id": 179,
        "title": "Robust Expectation-Maximization-Based Secondary Voltage Control Scheme Considering Stochastic Measurement Error",
        "authors": "Jian-Hong Liu, Zhe-Hao Li",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpwrs.2023.3256129"
    },
    {
        "id": 180,
        "title": "<scp>RPEM</scp>: Randomized Monte Carlo parametric expectation maximization algorithm",
        "authors": "Rong Chen, Alan Schumitzky, Alona Kryshchenko, Keith Nieforth, Michael Tomashevskiy, Shuhua Hu, Romain Garreau, Julian Otalvaro, Walter Yamada, Michael N. Neely",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "AbstractInspired from quantum Monte Carlo, by sampling discrete and continuous variables at the same time using the Metropolis–Hastings algorithm, we present a novel, fast, and accurate high performance Monte Carlo Parametric Expectation Maximization (MCPEM) algorithm. We named it Randomized Parametric Expectation Maximization (RPEM). We compared RPEM with NONMEM's Importance Sampling Method (IMP), Monolix's Stochastic Approximation Expectation Maximization (SAEM), and Certara's Quasi‐Random Parametric Expectation Maximization (QRPEM) for a realistic two‐compartment voriconazole model with ordinary differential equations using simulated data. We show that RPEM is as fast and as accurate as the algorithms IMP, QRPEM, and SAEM for the voriconazole model in reconstructing the population parameters, for the normal and log‐normal cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/psp4.13113"
    },
    {
        "id": 181,
        "title": "Expectation-maximization vector approximate message passing-based frequency-domain turbo equalization for underwater acoustic communications",
        "authors": "Xinrui Zhang, Jun Tao, Dong Li, Yanbo Wu, Wenxuan Chen",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Channel equalization plays a crucial role in single-carrier underwater acoustic (UWA) communications. Recently, a frequency-domain turbo equalization (FDTE) scheme enabled by the vector approximate message passing (VAMP) algorithm, was proposed, and it outperformed classic linear minimum mean square error FDTE at acceptable complexity cost. The operation of the VAMP-FDTE requires knowledge of noise power, which is predetermined before the equalization starts. In practice, however, it is difficult to obtain prior knowledge of noise power due to factors of unknown channel estimation errors and dynamic underwater environments. Motivated by this fact, we propose an enhanced VAMP-FDTE scheme, which learns the noise power knowledge during the equalization process via the expectation-maximization (EM) algorithm. The EM-based noise power estimation makes use of intermediate results of the VAMP-FDTE and, thus, only incurs a small extra computational overhead. The improved VAMP-FDTE, named EM-VAMP-FDTE, was tested by experimental data collected in shallow-sea horizontal UWA communication trials with MIMO configuration. It showed better performance than the existing VAMP-FDTE scheme, attributed to the online noise power learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1121/10.0022376"
    },
    {
        "id": 182,
        "title": "The expectation-maximization algorithm for autoregressive models with normal inverse Gaussian innovations",
        "authors": "Monika S. Dhull, Arun Kumar, Agnieszka Wyłomańska",
        "published": "2023-3-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/03610918.2023.2186334"
    },
    {
        "id": 183,
        "title": "An Improved Mixture Model of Gaussian Processes and Its Classification Expectation–Maximization Algorithm",
        "authors": "Yurong Xie, Di Wu, Zhe Qiang",
        "published": "2023-5-11",
        "citations": 2,
        "abstract": "The mixture of experts (ME) model is effective for multimodal data in statistics and machine learning. To treat non-stationary probabilistic regression, the mixture of Gaussian processes (MGP) model has been proposed, but it may not perform well in some cases due to the limited ability of each Gaussian process (GP) expert. Although the mixture of Gaussian processes (MGP) and warped Gaussian process (WGP) models are dominant and effective for non-stationary probabilistic regression, they may not be able to handle general non-stationary probabilistic regression in practice. In this paper, we first propose the mixture of warped Gaussian processes (MWGP) model as well as its classification expectation–maximization (CEM) algorithm to address this problem. To overcome the local optimum of the CEM algorithm, we then propose the split and merge CEM (SMC EM) algorithm for MWGP. Experiments were done on synthetic and real-world datasets, which show that our proposed MWGP is more effective than the models used for comparison, and the SMCEM algorithm can solve the local optimum for MWGP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11102251"
    },
    {
        "id": 184,
        "title": "Extraction of feature structure by expectation-maximization algorithm-based dynamic mode decomposition from particle image velocimetry data of separated flow",
        "authors": "Y. Iwasaki, Y. Sasaki, T. Nagata, S. Kaneko, T. Nonomura",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1615/thmt-23.1580"
    },
    {
        "id": 185,
        "title": "Accelerated and Deep Expectation Maximization for One-Bit MIMO-OFDM Detection",
        "authors": "Mingjie Shao, Wing-Kin Ma, Junbin Liu, Zihao Huang",
        "published": "2024",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tsp.2024.3359083"
    },
    {
        "id": 186,
        "title": "Structure function learning of hierarchical multi-state systems with a change-point: An embedded expectation-maximization algorithm",
        "authors": "Zhidong Shao, Qin Zhang, Yu Liu, Chaoyang Xie",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ress.2023.109574"
    },
    {
        "id": 187,
        "title": "Fault-Robust GPS Spoofing Mitigation with Expectation-Maximization",
        "authors": "Ashwin Vivek Kanhere, Grace Gao",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33012/2023.19366"
    },
    {
        "id": 188,
        "title": "A generalization of the maximum likelihood expectation maximization (MLEM) method: Masked-MLEM",
        "authors": "Yifan Zheng, Emily Frame, Javier Caravaca, Grant T Gullberg, Kai Vetter, Youngho Seo",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "Abstract\n\nObjective. In our previous work on image reconstruction for single-layer collimatorless scintigraphy, we developed the min–min weighted robust least squares (WRLS) optimization algorithm to address the challenge of reconstructing images when both the system matrix and the projection data are uncertain. Whereas the WRLS algorithm has been successful in two-dimensional (2D) reconstruction, expanding it to three-dimensional (3D) reconstruction is difficult since the WRLS optimization problem is neither smooth nor strongly-convex. To overcome these difficulties and achieve robust image reconstruction in the presence of system uncertainties and projection noise, we propose a generalized iterative method based on the maximum likelihood expectation maximization (MLEM) algorithm, hereinafter referred to as the Masked-MLEM algorithm. Approach. In the Masked-MLEM algorithm, only selected subsets (‘masks’) from the system matrix and the projection contribute to the image update to satisfy the constraints imposed by the system uncertainties. We validate the Masked-MLEM algorithm and compare it to the standard MLEM algorithm using experimental data obtained from both collimated and uncollimated imaging instruments, including parallel-hole collimated SPECT, 2D collimatorless scintigraphy, and 3D collimatorless tomography. Additionally, we conduct comprehensive Monte Carlo simulations for 3D collimatorless tomography to further validate the effectiveness of the Masked-MLEM algorithm in handling different levels of system uncertainties. Main results. The Masked-MLEM and standard MLEM reconstructions are similar in cases with negligible system uncertainties, whereas the Masked-MLEM algorithm outperforms the standard MLEM algorithm when the system matrix is an approximation. Importantly, the Masked-MLEM algorithm ensures reliable image reconstruction across varying levels of system uncertainties. Significance. With a good choice of system uncertainty and without requiring accurate knowledge of the actual system matrix, the Masked-MLEM algorithm yields more robust image reconstruction than the standard MLEM algorithm, effectively reducing the likelihood of erroneously reconstructing higher activities in regions without radioactive sources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6560/ad0900"
    },
    {
        "id": 189,
        "title": "Extraction of feature structure by expectation-maximization algorithm-based dynamic mode decomposition from particle image velocimetry data of separated flow",
        "authors": "Y. Iwasaki, Y. Sasaki, T. Nagata, S. Kaneko, T. Nonomura",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1615/ichmt.thmt-23.1580"
    },
    {
        "id": 190,
        "title": "Input-state-parameter-noise identification and virtual sensing in dynamical systems: A Bayesian expectation-maximization (BEM) perspective",
        "authors": "Daniz Teymouri, Omid Sedehi, Lambros S. Katafygiotis, Costas Papadimitriou",
        "published": "2023-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ymssp.2022.109758"
    },
    {
        "id": 191,
        "title": "Deep expectation-maximization network for unsupervised image segmentation and clustering",
        "authors": "Yannan Pu, Jian Sun, Niansheng Tang, Zongben Xu",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.imavis.2023.104717"
    },
    {
        "id": 192,
        "title": "A 3D reconstruction method of bubble flow field based on multi-view images by bi-direction filtering maximum likelihood expectation maximization algorithm",
        "authors": "Hongyi Wang, Yang Yang, Gongcheng Dou, Jipei Lou, Xinjun Zhu, Limei Song, Feng Dong",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijmultiphaseflow.2023.104480"
    },
    {
        "id": 193,
        "title": "Embedded Particle Size Measurement Method of Metal Mineral Polished Section Using Gaussian Mixture Model Based on Expectation Maximization Algorithm",
        "authors": "Hao Peng, Chaoxi Luo, Lifang He, Haopo Tang",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "The study of process mineralogy plays a very important role in the field of mineral processing and metallurgy, in which the measurement of mineral-embedded particle size is one of the main research areas. The manual measurement method using a microscope has many problems, such as heavy workload and low measurement accuracy. In order to solve this problem, this paper proposes a Gaussian mixture model based on an expectation maximization (EM) algorithm to measure the embedded particle sizes of minerals of polished metal sections. Experiments are here performed on the polished section images of ilmenite and pyrite, and we compared the results with a microscope. The experimental results show that the proposed method has higher precision and accuracy in measuring the embedded particle sizes of metal minerals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/min14040358"
    },
    {
        "id": 194,
        "title": "Expectation-maximization framework-based image-domain least-squares migration",
        "authors": "Shen Sheng, Bo Feng, Huazhong Wang, Peng Xu, Chengliang Wu",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": " High-resolution and high-fidelity seismic inversion imaging is one of the core issues of lithologic reservoir exploration. As a linearization subproblem of full-waveform inversion, least-squares migration (LSM) can obtain inversion results with more reliable amplitude, better resolution, and fewer artifacts that can be solved in either the data domain or image domain. For data-domain LSM, the calculation of the data-domain iteration can be very computationally intensive. In practical situations, the convexity of the cost function of LSM could be poor, resulting in slow or even nonconvergence iteration, so the ideal inversion imaging results cannot be reached. The image-domain LSM (ID-LSM) follows the logic of image deblurring, which realizes the effects of LSM in another way. The key problem of ID-LSM is to calculate a reliable Hessian matrix that can be effectively replaced by a set of point-spread functions (PSFs). Affected by the unknown source wavelet, the accuracy of the background velocity, and the accuracy of the forward/migration operator, the calculation results of the Hessian/PSF cannot be accurate. We first illustrate the impact of incorrect Hessian/PSF on ID-LSM through numerical experiments. To eliminate the influence of the inaccuracy of PSF, we develop the ID-LSM problem as a high-dimensional image deconvolution problem. An alternate update strategy of PSF and imaging results is given under the framework of the expectation-maximization algorithm by additionally introducing prior information about PSF and the inversion result. Numerical examples of synthetic data and field data verify that our method significantly improves image quality. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1190/geo2022-0373.1"
    },
    {
        "id": 195,
        "title": "An expectation–maximization algorithm for estimating proportions of deletions among bacterial populations with application to study antibiotic resistance gene transfer in Enterococcus faecalis",
        "authors": "Yu Zhang, Cong Zhang, Wenwen Huo, Xinlei Wang, Michael Zhang, Kelli Palmer, Min Chen",
        "published": "2023-1-31",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42995-022-00144-z"
    },
    {
        "id": 196,
        "title": "The study of a neutron spectrum unfolding method based on particle swarm optimization combined with maximum likelihood expectation maximization",
        "authors": "Hong-Fei Xiao, Qing-Xian Zhang, He-Yi Tan, Bin Shi, Jun Chen, Zhi-Qiang Cheng, Jian Zhang, Rui Yang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41365-023-01200-8"
    },
    {
        "id": 197,
        "title": "Expectation‐maximization algorithm for bilinear state‐space models with time‐varying delays under non‐Gaussian noise",
        "authors": "Xinyue Wang, Junxia Ma, Weili Xiong",
        "published": "2023-10",
        "citations": 18,
        "abstract": "SummaryIn this paper, the parameter identification of bilinear state‐space model (SSM) in the presence of random outliers and time‐varying delays is investigated. Under the basis of the observable canonical form of the bilinear model, the system output can be written as a regressive form, and a bilinear state observer is applied to estimate the unknown states. To eliminate the influence of outliers and time‐varying delays on parameter estimation, we employ the Student's  distribution to deal with the measurement noise and use a first‐order Markov chain to model the delays. In the framework of expectation‐maximization (EM) algorithm, the unknown parameters, delays, noise variance, states and transition probability matrix can be estimated iteratively. A numerical simulation and a continuous stirred tank reactor (CSTR) process demonstrate that the proposed algorithm has good immunity against outliers and time‐varying delays and offers good estimation accuracy for the bilinear SSM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/acs.3657"
    },
    {
        "id": 198,
        "title": "A P–S–N curve fitting method based on mixed Weibull distribution and expectation-maximization algorithm",
        "authors": "Jianhui Liu, Xianyu Liu, Feilong Hua, Xuemei Pan, Ruicheng Feng, Jianfeng Wen",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijpvp.2024.105158"
    },
    {
        "id": 199,
        "title": "EFEM: Equivariant Neural Field Expectation Maximization for 3D Object Segmentation Without Scene Supervision",
        "authors": "Jiahui Lei, Congyue Deng, Karl Schmeckpeper, Leonidas Guibas, Kostas Daniilidis",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00475"
    },
    {
        "id": 200,
        "title": "Detection of False Data Injection Attacks in Smart Grids Based on Expectation Maximization",
        "authors": "Pengfei Hu, Wengen Gao, Yunfei Li, Minghui Wu, Feng Hua, Lina Qiao",
        "published": "2023-2-3",
        "citations": 2,
        "abstract": "The secure operation of smart grids is closely linked to state estimates that accurately reflect the physical characteristics of the grid. However, well-designed false data injection attacks (FDIAs) can manipulate the process of state estimation by injecting malicious data into the measurement data while bypassing the detection of the security system, ultimately causing the results of state estimation to deviate from secure values. Since FDIAs tampering with the measurement data of some buses will lead to error offset, this paper proposes an attack-detection algorithm based on statistical learning according to the different characteristic parameters of measurement error before and after tampering. In order to detect and classify false data from the measurement data, in this paper, we report the model establishment and estimation of error parameters for the tampered measurement data by combining the the k-means++ algorithm with the expectation maximization (EM) algorithm. At the same time, we located and recorded the bus that the attacker attempted to tamper with. In order to verify the feasibility of the algorithm proposed in this paper, the IEEE 5-bus standard test system and the IEEE 14-bus standard test system were used for simulation analysis. Numerical examples demonstrate that the combined use of the two algorithms can decrease the detection time to less than 0.011883 s and correctly locate the false data with a probability of more than 95%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031683"
    },
    {
        "id": 201,
        "title": "EMVC-2: an efficient single-nucleotide variant caller based on expectation maximization",
        "authors": "Guillermo Dufort y Álvarez, Martí Xargay-Ferrer, Alba Pagès-Zamora, Idoia Ochoa",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "Abstract\n\nMotivation\nSingle-nucleotide variants (SNVs) are the most common type of genetic variation in the human genome. Accurate and efficient detection of SNVs from next-generation sequencing (NGS) data is essential for various applications in genomics and personalized medicine. However, SNV calling methods usually suffer from high computational complexity and limited accuracy. In this context, there is a need for new methods that overcome these limitations and provide fast reliable results.\n\n\nResults\nWe present EMVC-2, a novel method for SNV calling from NGS data. EMVC-2 uses a multi-class ensemble classification approach based on the expectation–maximization algorithm that infers at each locus the most likely genotype from multiple labels provided by different learners. The inferred variants are then validated by a decision tree that filters out unlikely ones. We evaluate EMVC-2 on several publicly available real human NGS data for which the set of SNVs is available, and demonstrate that it outperforms state-of-the-art variant callers in terms of accuracy and speed, on average.\n\n\nAvailability and implementation\nEMVC-2 is coded in C and Python, and is freely available for download at: https://github.com/guilledufort/EMVC-2. EMVC-2 is also available in Bioconda.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioinformatics/btad681"
    },
    {
        "id": 202,
        "title": "Space Event and Outlier Detection Based on Expectation Maximization Algorithm",
        "authors": "Liu Jing-hong, Wu Chen-yun, Xu Jin, Du Jian-li, Lei Xiang-xu",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chinastron.2023.06.003"
    },
    {
        "id": 203,
        "title": "Multi-objective confidence gap decision based robust optimal dispatch of integrated energy system using entropy expectation maximization GMM",
        "authors": "Huijuan Sun, Daquan Zhang, Chunhua Peng, Yi Zhang, Bo Gao, Jialu Xu",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijepes.2023.109364"
    },
    {
        "id": 204,
        "title": "Phantom and clinical evaluation of Block Sequential Regularized Expectation Maximization (BSREM) reconstruction algorithm in 68Ga-PSMA PET-CT studies",
        "authors": "Fatemeh Sadeghi, Peyman Sheikhzadeh, Nima Kasraie, Saeed Farzanehfar, Mehrshad Abbasi, Yalda Salehi, Mohammadreza Ay",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13246-023-01299-4"
    },
    {
        "id": 205,
        "title": "Neutron source reconstruction using a generalized expectation–maximization algorithm on one-dimensional neutron images from the Z facility",
        "authors": "S. A. Ricketts, M. A. Mangan, P. Volegov, D. N. Fittinghoff, W. E. Lewis, O. M. Mannion, J. E. Morel, M. L. Adams, D. J. Ampleford",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Magnetized Liner Inertial Fusion experiments have been performed at the Z facility at Sandia National Laboratories. These experiments use deuterium fuel, which produces 2.45 MeV neutrons on reaching thermonuclear conditions. To study the spatial structure of neutron production, the one-dimensional imager of neutrons diagnostic was fielded to record axial resolved neutron images. In this diagnostic, neutrons passing through a rolled edge aperture form an image on a CR-39-based solid state nuclear track detector. Here, we present a modified generalized expectation–maximization algorithm to reconstruct an axial neutron emission profile of the stagnated fusion plasma. We validate the approach by comparing the reconstructed neutron emission profile to an x-ray emission profile provided by a time-integrated pinhole camera.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0176152"
    },
    {
        "id": 206,
        "title": "Expectation Violations, Expectation Change, and Expectation Persistence: The Scientific Landscape as Revealed by Bibliometric Network Analyses",
        "authors": "José C. García Alanis, Anna E. Strelow, Martina Dort, Hanna Christiansen, Martin Pinquart, Christian Panitz",
        "published": "2023-4-11",
        "citations": 1,
        "abstract": "Expectation violations occur when there is a discrepancy between expected and perceived events or experiences. Often, however, expectations persist despite disconfirming evidence. Therefore, research on expectation violations, expectation change, and expectation persistence has been conducted in several fields of psychology with wide-ranging theoretical assumptions and empirical considerations. In the present review, we analysed how these research fields relate to each other using bibliometric network analyses. For this purpose, we conducted a systematic literature search to identify scientific publications on expectation violations, expectation change, and expectation persistence. The literature corpus was then quantitatively analysed using similarity measures that allow a data-driven classification of publications into groups, revealing their conceptual, theoretical, and empirical commonalities. Our results indicate that many influential publications have focused on finding reactivity measures (e.g., brain activation) to the discrepancy experienced between expectations and outcomes. Furthermore, these measures have been used to assess when and to which degree learning and behavioural adaptation (i.e., expectation change) take place. We discuss the potential application of these measures for understanding expectation violations, expectation change, and expectation persistence in more complex settings (e.g., social interaction). The goal of this review was to foster interdisciplinarity in psychology, enabling scientists and practitioners to identify new topics, promising empirical approaches, and previously neglected variables.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1525/collabra.73830"
    },
    {
        "id": 207,
        "title": "A Neural Expectation-Maximization Framework for Noisy Multi-Label Text Classification",
        "authors": "Junfan Chen, Richong Zhang, Jie Xu, Chunming Hu, Yongyi Mao",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tkde.2022.3223067"
    },
    {
        "id": 208,
        "title": "EMA‐GAN: A Generative Adversarial Network for Infrared and Visible Image Fusion with Multiscale Attention Network and Expectation Maximization Algorithm",
        "authors": "Xiuliang Xi, Xin Jin, Qian Jiang, Yu Lin, Wei Zhou, Lei Guo",
        "published": "2023-11",
        "citations": 0,
        "abstract": "The purpose of the infrared and visible image fusion is to generate a fused image with rich information. Although most fusion methods can achieve good performance, there are still shortcomings in extracting feature information from source images, which make it difficult to balance the thermal radiation region information and texture detail information in the fused image. To address the above issues, an expectation maximization (EM) learning framework based on adversarial generative networks (GAN) for infrared and visible image fusion is proposed. The EM algorithm (EMA) can obtain maximum likelihood estimation for problems with potential variables, which is helpful in solving the problem of lack of labels in infrared and visible image fusion. The axial‐corner attention mechanism is designed to capture long‐range semantic information and texture information of the visible image. The multifrequency attention mechanism digs the relationships between features at different scales to highlight target information of infrared images in the fused result. Meanwhile, two discriminators are used to balance two different features, and a new loss function is designed to maximize the likelihood estimate of the data with soft class label assignments, which is obtained from the expectation network. Extensive experiments demonstrate the superiority of EMA‐GAN over the state‐of‐the‐art.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/aisy.202300310"
    },
    {
        "id": 209,
        "title": "Improved [68Ga]Ga-PSMA-11 image qualities reconstructed by total variation regularized expectation maximization on total-body PET/CT",
        "authors": "Lianghua Li, Ruohua Chen, Jun Wen, Xuefei Yang, Debin Hu, Hongyan Sun, Qi Ge, Yee Ling Ng, Yun Zhou, Liangrong Wan, Yumei Chen, Weijun Wei, Jianjun Liu",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21037/qims-22-1341"
    },
    {
        "id": 210,
        "title": "Adaptive Expectation–Maximization-Based Kalman Filter/Finite Impulse Response Filter for MEMS-INS-Based Posture Capture of Human Upper Limbs",
        "authors": "Mingxu Sun, Yichen Li, Rui Gao, Jingwen Yu, Yuan Xu",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "To obtain precise positional information, in this study, we propose an adaptive expectation–maximization (EM)-based Kalman filter (KF)/finite impulse response (FIR) integrated filter for inertial navigation system (INS)-based posture capture of human upper limbs. Initially, a data fusion model for wrist and elbow position is developed. Subsequently, the Mahalanobis distance is utilized to evaluate the performance of the filter. The integrated filter employs the EM-based KF to enhance noise estimation accuracy when the performance of KF declines. Conversely, upon deterioration in the performance of the EM-based KF, which is evaluated using the Mahalanobis distance, the FIR filter is employed to maintain the effectiveness of the data fusion filter. This research utilizes the proposed EM-based KF/FIR integrated filter to ascertain wrist and elbow positions. The empirical results demonstrate the proficiency of the proposed approach in estimating these positions, thereby overcoming the challenge and highlighting its inherent effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/mi15040440"
    },
    {
        "id": 211,
        "title": "Hd-Deep-EM: Deep Expectation Maximization for Dynamic Hidden State Recovery Using Heterogeneous Data",
        "authors": "Zhihao Ma, Haoran Li, Yang Weng, Erik Blasch, Xiaodong Zheng",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpwrs.2023.3288005"
    },
    {
        "id": 212,
        "title": "Joint Identification and Estimation of Imbalance Torque in Gimbal Servo Systems via Variational Bayes Adaptive Expectation-Maximization",
        "authors": "Xiaoyu Guo, Wenshuo Li, Yangyang Cui",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcsii.2023.3330734"
    },
    {
        "id": 213,
        "title": "Expectation-Maximization Based Disturbance Identification and Velocity Tracking for Gimbal Servo Systems With Dynamic Imbalance",
        "authors": "Xiaoyu Guo, Wenshuo Li, Yangyang Cui, Chenliang Wang, Zhengtao Ding",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcsi.2024.3373229"
    },
    {
        "id": 214,
        "title": "Expectation Maximization Algorithm for GPS Positioning in Multipath Environments Based on Volterra Series",
        "authors": "Lianyuan Cheng, Jing Chen, Yawen Mao, Cuicui Liao, Quanmin Zhu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00034-023-02407-1"
    },
    {
        "id": 215,
        "title": "DeepWalk Based Influence Maximization (DWIM): Influence Maximization Using Deep Learning",
        "authors": " Sonia, Kapil Sharma, Monika Bajaj",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.026134"
    },
    {
        "id": 216,
        "title": "An Optimal Distribution Load Scheduling Considering the Loss Of Energy Expectation (LOEE) and Loss Of Load Expectation (LOLE)",
        "authors": "Nonzol R.A, Tuliao Y.P, Pacis M.C",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccae56788.2023.10111272"
    },
    {
        "id": 217,
        "title": "Deliberately making miskates: Behavioural consistency under win maximization and loss maximization conditions",
        "authors": "Yajing Zhang, Thi Kim Truc Huynh, Benjamin James Dyson",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "AbstractWe argue that the feedback traditionally used to indicate negative outcomes causes future detrimental performance because of the default goal of win maximization. In gaming paradigms where participants intentionally performed as well (win maximization) and as poorly (loss maximization) as possible, we showed a double dissociation where actions following wins were more consistent during win maximization, but actions following losses were more consistent during loss maximization. This broader distinction between goal-congruent and goal-incongruent feedback suggests that individuals are able to flexibly redefine their definition of ‘success’, and provide a reconsideration of the way we think about ‘losing’.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41539-023-00206-6"
    },
    {
        "id": 218,
        "title": "Expectation vs Reality: Analyzing the Competencies of Software Testing Teams",
        "authors": "Nayane Maia, Ana Oran, Bruno Gadelha",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011853800003467"
    },
    {
        "id": 219,
        "title": "Laplace Distribution Based Online Identification of Linear Systems With Robust Recursive Expectation–Maximization Algorithm",
        "authors": "Xin Chen, Shunyi Zhao, Fei Liu, Chongben Tao",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tii.2022.3225026"
    },
    {
        "id": 220,
        "title": "From profit maximization to social welfare maximization: Reclaiming the purpose of American business education",
        "authors": "Eva Witesman, Bradley Agle, Justin Ames, Steven Christenson, Max Moore, Rachel Pankey",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.futures.2023.103152"
    },
    {
        "id": 221,
        "title": "Profit maximization in social networks and non-monotone DR-submodular maximization",
        "authors": "Shuyang Gu, Chuangen Gao, Jun Huang, Weili Wu",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tcs.2023.113847"
    },
    {
        "id": 222,
        "title": "Recidivism and Adaptive Expectation",
        "authors": "Ambinintsoa Ramanambonona",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4458060"
    },
    {
        "id": 223,
        "title": "Accelerating L1-penalized expectation maximization algorithm for latent variable selection in multidimensional two-parameter logistic models",
        "authors": "Laixu Shang, Ping-Feng Xu, Na Shan, Man-Lai Tang, George To-Sum Ho",
        "published": "2023-1-17",
        "citations": 1,
        "abstract": "One of the main concerns in multidimensional item response theory (MIRT) is to detect the relationship between observed items and latent traits, which is typically addressed by the exploratory analysis and factor rotation techniques. Recently, an EM-based L1-penalized log-likelihood method (EML1) is proposed as a vital alternative to factor rotation. Based on the observed test response data, EML1 can yield a sparse and interpretable estimate of the loading matrix. However, EML1 suffers from high computational burden. In this paper, we consider the coordinate descent algorithm to optimize a new weighted log-likelihood, and consequently propose an improved EML1 (IEML1) which is more than 30 times faster than EML1. The performance of IEML1 is evaluated through simulation studies and an application on a real data set related to the Eysenck Personality Questionnaire is used to demonstrate our methodologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0279918"
    },
    {
        "id": 224,
        "title": "Financial Inclusion Expectation Gap",
        "authors": "Peterson K Ozili",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4364147"
    },
    {
        "id": 225,
        "title": "Appearance of Senescence and Life Expectation in Bugio (Alouatta spp.) in Captivity",
        "authors": "Maria Luiza de Sousa Barbosa",
        "published": "2023",
        "citations": 0,
        "abstract": "The number of non-human primates aging in captivity has increased in recent years. More animals are visible in captivity than in the wild due to changes that have occurred with globalization and technological evolution. For this study, data was collected regarding the age of studies that mention senescent howler monkeys. The nominal qualitative variable in discrete quantitative variable infers the need for aspects to be considered to categorize this species as senile",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/izab-16000506"
    },
    {
        "id": 226,
        "title": "The Architecture of Expectation",
        "authors": "Kevin Nute",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "Humans have been described as a “forward-looking” species in more than simply physiological terms. We are, it seems, unusually concerned with the future. This essay explores how built environments can be designed to evoke positive anticipation of future events. It suggests that there are three primary means of achieving this: (1) the visible display of valued resources, (2) signs of readiness, and (3) views that encourage mental exploration. It is observed that while resources tend to elicit hope of their future use, readiness and visual prospects seem to evoke a more general sense of optimism. Given the large proportion of our lives that most of us now spend in buildings, it is suggested that these design strategies might be helpful in maintaining and improving occupant morale in the indoor spaces where we live and work, and even more so for those who, for one reason or another, are unable to venture out.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/architecture3040036"
    },
    {
        "id": 227,
        "title": "An Expectation-Maximization-Based Estimation Algorithm for AOA Target Tracking With Non-Gaussian Measurement Noises",
        "authors": "Sheng Xu, Mark Rice, Feng Rice, Xinyu Wu",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tvt.2022.3201633"
    },
    {
        "id": 228,
        "title": "Revenue Maximization with Partially Verifiable Information",
        "authors": "Marco Reuter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4641290"
    },
    {
        "id": 229,
        "title": "Modeling Life Expectation of Population in Sumatra Island Using Durbin Spatial Model Analysis",
        "authors": "Sartika Mega Aulia, Haposan Sirait",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "Life expectancy is an indicator in measuring government performance in improving the level of health and well-being of the population of a region. While life expectancy on Sumatra Island has variable values, the quality of public health is less uniform. These variations can be caused by several factors such as education, health services, and economic conditions. Therefore, the government needs to provide further treatment on Sumatra Island by identifying factors that affect life expectancy. The study used a Spatial Durbin Model with Queen Contiguity and Rook Contiguity 154 districts/cities on the island of Sumatra. The variables used in the study were data on life expectancy, average school age, the percentage of many infants who received complete immunization, the percent of households having access to decent drinking water, the proportion of the poor population, the regional gross domestic product in 2021. The results of the study showed that the best model was the model that used the Queen Contiguity weighing matrix because it had a smaller AIC value of 365.22. Factors influencing the life expectancy of the population of Sumatra Island in 2021 using the durbin spatial model with the Queen weigher are the average age of school, the percentage of the poor population, and the regional gross domestic product.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46336/ijmsc.v1i3.7"
    },
    {
        "id": 230,
        "title": "The Expectation of Unwavering Invincibility: Music Performance Anxiety in School Band Directors",
        "authors": "Beth Yoder",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2003783"
    },
    {
        "id": 231,
        "title": "Conditional Expectation Network for SHAP",
        "authors": "Ronald Richman, Mario V. Wuthrich",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4514891"
    },
    {
        "id": 232,
        "title": "The impact of the investment expectation gap on households’ risky financial asset investment",
        "authors": "Xinzhe Xu",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "Rational household asset allocation is crucial for the accumulation of household wealth. However, there is still a widespread phenomenon of limited participation among households. This paper aims to explore the impact of the investment expectation gap on households’ risky financial asset investment. Utilizing data from the China Household Finance Survey 2019, this paper systematically investigates the role of the investment expectation gap in risky financial asset investment through the Probit and Tobit models. The study reveals that the investment expectation gap has a significant negative impact on the investment probability (Average Marginal Effect, –0.118, p &amp;lt; 0.01) and holding proportion (β, –0.082, p &amp;lt; 0.01) of household investment in risky financial assets. This conclusion remains robust after conducting robustness tests by replacing the explanatory variable and performing subsample tests and endogenous treatment. The analysis of transmission mechanisms revealed that an expanding of the investment expectation gap would concurrently result in a decline in households’ assessment of stock’s profitability (Average Marginal Effect, –0.080, p &amp;lt; 0.01), the satisfaction with current asset allocation (β, –0.167, p &amp;lt; 0.05), and the subjective well-being of household members (β, –0.289, p &amp;lt; 0.01). Furthermore, the investment expectation gap not only hampers household investment in risky financial asset, but also diminish the household savings rate (β, –0.055, p &amp;lt; 0.01). This study demonstrates that helping households form reasonable expectations for risky financial assets investment returns will contribute to diversifying household asset allocation and enhancing satisfaction with investment decisions.\nAcknowledgmentThis study is funded by the Chongqing Social Science Planning Fund, grant number (2021BS052).",
        "keywords": "",
        "link": "http://dx.doi.org/10.21511/imfi.21(1).2024.25"
    },
    {
        "id": 233,
        "title": "On the Parameterized Intractability of Determinant Maximization",
        "authors": "Naoto Ohsaka",
        "published": "2024-2-3",
        "citations": 0,
        "abstract": "AbstractIn the Determinant Maximization problem, given an $$n \\times n$$\n\nn\n×\nn\n\n positive semi-definite matrix $${\\textbf {A}} $$\nA\n in $$\\mathbb {Q}^{n \\times n}$$\n\n\nQ\n\n\nn\n×\nn\n\n\n and an integer k, we are required to find a $$k \\times k$$\n\nk\n×\nk\n\n principal submatrix of $${\\textbf {A}} $$\nA\n having the maximum determinant. This problem is known to be -hard and further proven to be [1]-hard with respect to k by Koutis (Inf Process Lett 100:8–13, 2006); i.e., a $$f(k)n^{{{\\,\\mathrm{\\mathcal {O}}\\,}}(1)}$$\n\nf\n\n(\nk\n)\n\n\nn\n\n\n\nO\n\n\n(\n1\n)\n\n\n\n-time algorithm is unlikely to exist for any computable function f. However, there is still room to explore its parameterized complexity in the restricted case, in the hope of overcoming the general-case parameterized intractability. In this study, we rule out the fixed-parameter tractability of Determinant Maximization even if an input matrix is extremely sparse or low rank, or an approximate solution is acceptable. We first prove that Determinant Maximization is -hard and [1]-hard even if an input matrix is an arrowhead matrix; i.e., the underlying graph formed by nonzero entries is a star, implying that the structural sparsity is not helpful. By contrast, Determinant Maximization is known to be solvable in polynomial time on tridiagonal matrices (Al-Thani and Lee, in: LAGOS, 2021). Thereafter, we demonstrate the [1]-hardness with respect to the rankr of an input matrix. Our result is stronger than Koutis’ result in the sense that any $$k \\times k$$\n\nk\n×\nk\n\n principal submatrix is singular whenever $$k > r$$\n\nk\n>\nr\n\n. We finally give evidence that it is [1]-hard to approximate Determinant Maximization parameterized by k within a factor of $$2^{-c\\sqrt{k}}$$\n\n2\n\n-\nc\n\nk\n\n\n\n for some universal constant $$c > 0$$\n\nc\n>\n0\n\n. Our hardness result is conditional on the Parameterized Inapproximability Hypothesis posed by Lokshtanov et al. (in: SODA, 2020), which asserts that a gap version of Binary Constraint Satisfaction Problem is [1]-hard. To complement this result, we develop an $$\\varepsilon $$\nε\n-additive approximation algorithm that runs in $$\\varepsilon ^{-r^2} \\cdot r^{{{\\,\\mathrm{\\mathcal {O}}\\,}}(r^3)} \\cdot n^{{{\\,\\mathrm{\\mathcal {O}}\\,}}(1)}$$\n\n\nε\n\n-\n\nr\n2\n\n\n\n·\n\nr\n\n\n\nO\n\n\n(\n\nr\n3\n\n)\n\n\n·\n\nn\n\n\n\nO\n\n\n(\n1\n)\n\n\n\n time for the rank r of an input matrix, provided that the diagonal entries are bounded.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00453-023-01205-0"
    },
    {
        "id": 234,
        "title": "Expectation-Maximization via Pretext-Invariant Representations",
        "authors": "Chingis Oinar, Binh M. Le, Simon S. Woo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3289589"
    },
    {
        "id": 235,
        "title": "Cucurbits relay cropping for resource conservation and profit maximization in castor",
        "authors": " P VEERAMANI,  V RAVICHANDIRAN,  P A SARAVANAN,  S MANICKAM,  S R VENKATACHALAM,  P ARUTCHENTHIL",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "A field experiment was conducted on sandy loamy soils during kharif seasons of 2020-21 and 2021-22 at Tapioca and Castor Research Station, Yethapur, Tamil Nadu to study the effect of Cucurbits relay cropping for resource conservation and profit maximization in castor as well as castor equivalent yield (CEY). The results of Castor-Bitter gourd recorded maximum yield of (9153 kg/ha) followed by Castor-Bottle gourd (7130 kg/ha.). Lowest cucurbits yield was recorded in Castor-Coccinia (3685 kg/ha). Relay cropping treatments significantly influenced CEY. Significantly the highest value of CEY (2472 kg ha) was recorded under Castor-Cucumber, followed by Castor-Bitter gourd recorded 2418 kg/ha.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56739/jor.v40ispecialissue.145787"
    },
    {
        "id": 236,
        "title": "Asset Inspection Efficiency Maximization: Utilizing Alternative Methods",
        "authors": "L. M. Pietranek",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "Abstract\nTechnology is available to transform the way in which offshore assets are inspected and maintained. Breaking away from traditional methods and introducing new solutions which are far better suited to the energy industry as it transitions from a reliance on fossil fuels to more sustainable renewable sources.\nRemoving the requirement for vessel-based inspection and maintenance programs, and instead adopting asset deployed techniques will greatly reduce the environmental impact of routine asset inspections and increase operational efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/217019-ms"
    },
    {
        "id": 237,
        "title": "A Profit Maximization Scheme with Guaranteed Quality of Service in Cloud Computing",
        "authors": "",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2021.19.7.nq21121"
    },
    {
        "id": 238,
        "title": "Understanding oscillatory correlates of pain expectation",
        "authors": "Gemma Learmonth",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24072/pci.rr.100432"
    },
    {
        "id": 239,
        "title": "Understanding oscillatory correlates of pain expectation",
        "authors": "Gemma Learmonth",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24072/pci.rr.100675"
    },
    {
        "id": 240,
        "title": "Machining Processes Maximization on Al7175/SiC/Al2O3 with Cemented Carbide Tool",
        "authors": "",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17756/nwj.2023-s4-041"
    },
    {
        "id": 241,
        "title": "Locally Convex Neural Lyapunov Functions and Region of Attraction Maximization for Stability of Nonlinear Systems",
        "authors": "Lucas Hugo, Philippe Feyel, David Saussié",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012180300003543"
    },
    {
        "id": 242,
        "title": "Quantum Network Utility Maximization",
        "authors": "Gayane Vardoyan, Stephanie Wehner",
        "published": "2023-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00140"
    },
    {
        "id": 243,
        "title": "Non-Concave Utility Maximization with Transaction Costs",
        "authors": "Shuaijie Qian, Chen Yang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4500965"
    },
    {
        "id": 244,
        "title": "Expectation vs reality",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12968/denn.2023.19.8.369"
    },
    {
        "id": 245,
        "title": "Quantum geometry of expectation values",
        "authors": "Chaoming Song",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physreva.107.062207"
    },
    {
        "id": 246,
        "title": "Student Experience Versus Teacher Expectation in Transfer-Level Math Courses",
        "authors": "John Cristobal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2007297"
    },
    {
        "id": 247,
        "title": "Ethereum: Introduction, Expectation, and Implementation",
        "authors": "Qichen Huang",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "As the Blockchain technology develops, more and more cryptocurrencies were invented after Bitcoin. This paper introduces the technology of Blockchain, including the basic concept of Blockchain and how Blockchain works to allow decentralization of trades; The system of Ethereum and the cryptocurrency Ether (ETH), how it was invented, what was the central mission of its invention, as well as how it differs from Bitcoin and how can it allow more decentralized application to be developed, which in turn illustrates what it means and where its values lie. As all cryptocurrency markets have a huge fall in value in the year 2022, as shown in figure 1, many people are losing faith in cryptocurrency. Many believe that since it is entirely digital and non-government based, it has no actual value, that the entire cryptocurrency market is a bubble. Meanwhile, cryptocurrencies introduce a very revolutionary concept, which is the decentralization of applications, and this decentralization can apply to many things, leading to a great technological structure modification, even for social structures. Because of its anonymous and democratic nature, there is also always going to be demand for cryptocurrencies. Thus, this paper also analyzes the expectations of cryptocurrency, mainly Ether, and the predictions of its future development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v41i.6804"
    },
    {
        "id": 248,
        "title": "Expectation Effect and Problem Behavior in Primary School Chinese Classroom",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/appep.2023.040307"
    },
    {
        "id": 249,
        "title": "Center-Surround Inhibition in Expectation",
        "authors": "Ling Huang, xilin zhang",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1167/jov.23.9.5202"
    },
    {
        "id": 250,
        "title": "RUSSIAN ÉMIGRé ON THE WAVES OF HISTORY: VLADIMIR VARSHAVSKY AND HIS NOVEL “EXPECTATION”",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31249/litzhur/2023.60.10"
    },
    {
        "id": 251,
        "title": "Gradient Maximization Regularization for Signed Adversarial Attacks",
        "authors": "Deniz Sen",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eleco60389.2023.10415930"
    },
    {
        "id": 252,
        "title": "Neural Sum Rate Maximization with Deep Unrolling",
        "authors": "Siya Chen, Chee Wei Tan",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437390"
    },
    {
        "id": 253,
        "title": "Utility Elicitation and Maximization from Uncertain Certainty Equivalents",
        "authors": "Napat Rujeerapaiboon, Chunling Luo",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4768970"
    },
    {
        "id": 254,
        "title": "Inflation Expectation and Cryptocurrency Investment",
        "authors": "Lin Cong, Pulak Ghosh, Jiasun Li, Qihong Ruan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4549475"
    },
    {
        "id": 255,
        "title": "Investigate the Students’ Expectation about Quality of E-learning in Pakistan",
        "authors": "Kashif Ali",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4691451"
    },
    {
        "id": 256,
        "title": "Attention, Expectation Updating, and Subjective Models of the Macroeconomy",
        "authors": "Li Tang, Penghui Yin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4585303"
    },
    {
        "id": 257,
        "title": "On the bias of the Unbiased Expectation Theory",
        "authors": "Renato França, Raquel M. Gaspar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4644078"
    },
    {
        "id": 258,
        "title": "The Relationship between Career Expectation and Employment Satisfaction of College Graduates",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/fer.2023.060524"
    },
    {
        "id": 259,
        "title": "Identifying Money and Inflation Expectation Shocks on Real Oil Prices",
        "authors": "Szilard Benk, Max Gillman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4479503"
    },
    {
        "id": 260,
        "title": "Expectation of tele-ophthalmology in remote areas including islands",
        "authors": "Kazuhiko Kotani",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41433-024-02997-3"
    },
    {
        "id": 261,
        "title": "Expectation formation and the Phillips curve revisited",
        "authors": "Robert L. Czudaj",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "Abstract\nThis paper studies expectation formation of professional forecasters in the context of the Phillips curve. We assess whether professionals form their expectations regarding inflation and unemployment consistent with the Phillips curve based on individual forecast data taken from the ECB Survey of Professional Forecasters. We consider expectations over different horizons and do not restrict the analysis to point forecasts but we also take the information inherent in density forecasts into account. We explicitly consider the role of anchoring of inflation expectations as potential source of nonlinearity, and we also assess whether the Phillips curve relation translates to a link between uncertainty regarding inflation and unemployment. Our findings show that professionals tend to build their expectations in line with the Phillips curve but this is only observed for expectations made for shorter horizons. For longer horizons, the Phillips curve connection is much weaker. This relationship also depends on the degree of anchoring and results in a connection between uncertainty regarding future inflation and unemployment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1365100524000051"
    },
    {
        "id": 262,
        "title": "Weighted Sum-Rate Maximization with Causal Inference for Latent Interference Estimation",
        "authors": "Lei You",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10279554"
    },
    {
        "id": 263,
        "title": "Streaming adaptive submodular maximization",
        "authors": "Shaojie Tang, Jing Yuan",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tcs.2022.11.030"
    },
    {
        "id": 264,
        "title": "Maximization of injected power and efficiency based optimal location of DPFC using iterative procedure",
        "authors": "",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aee.2022.140199"
    },
    {
        "id": 265,
        "title": "Approximations for Throughput Maximization",
        "authors": "Dylan Hyatt-Denesik, Mirmahdi Rahgoshay, Mohammad R. Salavatipour",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00453-023-01201-4"
    },
    {
        "id": 266,
        "title": "Maximization of generated electric power in the TEG module at various heat exchange conditions",
        "authors": "",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/cpe.2020.136013"
    },
    {
        "id": 267,
        "title": "Budget-constrained Maximization of 'Cobb-Douglas with Linear Components' Utility Function",
        "authors": "Somdeb Lahiri",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4691629"
    },
    {
        "id": 268,
        "title": "Terminal wealth maximization under drift uncertainty",
        "authors": "Kerem Uğurlu",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/02331934.2024.2324143"
    },
    {
        "id": 269,
        "title": "Estimating the OIS Term Premium with Analyst Expectation Surveys",
        "authors": "Ricardo Barahona, Maria Rodriguez-Moreno",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4764819"
    },
    {
        "id": 270,
        "title": "Optimal stopping with expectation constraints",
        "authors": "Erhan Bayraktar, Song Yao",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aap1980"
    },
    {
        "id": 271,
        "title": "ENERGY SPECTRA, EXPECTATION VALUES, AND THERMODYNAMICPROPERTIES OF HCl AND LiH DIATOMIC MOLECULES",
        "authors": "E.P. Inyang,  ",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "The Schrödinger equation is solved by applying the Nikiforov-Uvarov-Functional Analysis method to the Hulthén plus screened Kratzer Potential. The Greene-Aldrich approximation is employed to determine the closed  form  expressions  for  the  energy  equation  and  the  wave  function.  The  Hellmann-Feynman  theorem  was employed to calculate the energy spectra and expectation values of various quantum states for diatomic moleculesof HCl and LiH.  Subsequently, we  employed the  energy  equation that we  had previously  derived to compute  the partition  function,  which  in  turn  enabled  us  to  determine  the  thermodynamic  properties  associated  with  the diatomic molecules. The partition function for the diatomic molecules of 2Hand LiHwas calculated at different temperatures.  The  results  indicate  that  the  partition  function  of  the  two  diatomic  molecules  rose  as  the temperature increased.The findings we obtained align with the results documented in the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31489/2024no1/124-137"
    },
    {
        "id": 272,
        "title": "Coherence Expectation Minimisation and Combining Weighted Multitaper Estimates",
        "authors": "Oskar Keding, Maria Åkesson, Maria Sandsten",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289813"
    },
    {
        "id": 273,
        "title": "Audit Expectation Gap and Its Implication on Investment Decision-Making of Public Listed Companies",
        "authors": "",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7176/rjfa/14-17-03"
    },
    {
        "id": 274,
        "title": "Mean-Field Stochastic Control Problem with Terminal State Constraints Under G-Expectation",
        "authors": "Hui Min, Ying Zhang",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10240494"
    },
    {
        "id": 275,
        "title": "Expectation-driven boom-bust cycles",
        "authors": "Marco Brianti, Vito Cormun",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmoneco.2024.103575"
    },
    {
        "id": 276,
        "title": "Fuzzy comprehensive state evaluation of housing of silicone rubber insulators based on level difference maximization",
        "authors": "",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aee.2022.140197"
    },
    {
        "id": 277,
        "title": "Capacity Maximization for Movable Antenna Enabled MIMO Communication",
        "authors": "Wenyan Ma, Lipeng Zhu, Rui Zhang",
        "published": "2023-5-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10279745"
    },
    {
        "id": 278,
        "title": "Optimizing Crop Selection and Production Planning in Agriculture: Applications of Linear Programming for Profit Maximization and Sustainability",
        "authors": "Dr. Megha Abhiman Bhamare",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.623.46630"
    },
    {
        "id": 279,
        "title": "Explainable Itemset Utility Maximization with Fuzzy Set",
        "authors": "Guotao Xu Guotao Xu, Jiahui Chen Guotao Xu, Shicheng Wan Jiahui Chen, Cuiwei Peng Shicheng Wan, Yu Liu Cuiwei Peng",
        "published": "2023-3",
        "citations": 1,
        "abstract": "\n                        <>Recently, fuzzy utility pattern mining has received much attention for its practicality and comprehensibility. It aims to discover high fuzzy utility itemsets (HFUIs) by considering not only utility but also linguistic factors. Among existing algorithms, experiments showed that fuzzy-list-based algorithms are effective and efficient. However, a significant disadvantage of fuzzy-list-based algorithms is that constructing and maintaining fuzzy-lists is time-consuming and memory-overhead. To address this issue, a novel algorithm named explainable Itemset Utility Maximization with Fuzzy Set (FS-IUM) is proposed in this paper. The traditional fuzzy-list structure is replaced by a better structure (i.e., fuzzy-list buffer), which speeds up the mining process and reduces memory consumption. Compared with fuzzy-list structure, the fuzzy-list buffer structure and its auxiliary structure help the algorithm locate the fuzzy-list quickly and thus reduce the runtime. Moreover, with an efficient fuzzy-list buffer construction method, the algorithm reduces the cost of candidate storage. Furthermore, with several efficient strategies, the proposed algorithm can prune numerous useless patterns in advance and thus considerably reduces the runtime usage. Finally, extensive experiments on various datasets were conducted to compare the performance of FS-IUM with some state-of-the-art algorithms. The experimental results reveal that the proposed fuzzy-list buffer-based algorithm highly outperforms the baselines in terms of runtime and memory consumption.<>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/160792642023032402004"
    },
    {
        "id": 280,
        "title": "Multi-Objective Information Maximization in a Social Network",
        "authors": "Kundan Kandhway",
        "published": "2023-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imcom56909.2023.10035644"
    },
    {
        "id": 281,
        "title": "Opportunistic Mobile Crowdsensing for Interference Overhead Reduction and Throughput Maximization",
        "authors": "Mozhang Guo, Xianbin Wang",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vcc60689.2023.10474893"
    },
    {
        "id": 282,
        "title": "Reconciling Profit Maximization with Social Conscience vis-a-vis ESGs",
        "authors": "Yoshita Sood, Gauri Vikram",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4466707"
    },
    {
        "id": 283,
        "title": "Methods of Carbon Sequestration Maximization Based on Modern Algorithms",
        "authors": "Jindian Yang",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/9789811267505_0052"
    },
    {
        "id": 284,
        "title": "Bowley Insurance with Expected Utility Maximization of the Policyholders",
        "authors": "Tim J. Boonen, Wenjun Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4404188"
    },
    {
        "id": 285,
        "title": "Expectation and Optimal Allocations in Existential Contests of Finite, Generalized Hyperbolic-Distributed Outcomes",
        "authors": "Ralph Vince",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4620992"
    },
    {
        "id": 286,
        "title": "Invariance of the Mathematical Expectation of a Random Quantity and Its Consequences",
        "authors": "Pierpaolo Angelini",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "Possibility and probability are the two aspects of uncertainty, where uncertainty represents the ignorance of a given individual. The notion of alternative (or event) belongs to the domain of possibility. An event is intrinsically subdivisible and a quadratic metric, whose value is intrinsic or invariant, is used to study it. By subdividing the notion of alternative, a joint (bivariate) distribution of mass appears. The mathematical expectation of X is proved to be invariant using joint distributions of mass. The same is true for X12 and X12…m. This paper describes the notion of α-product, which refers to joint distributions of mass, as a way to connect the concept of probability with multilinear matters that can be treated through statistical inference. This multilinear approach is a meaningful innovation with regard to the current literature. Linear spaces over R with a different dimension can be used as elements of probability spaces. In this study, a more general expression for a measure of variability referred to a single random quantity is obtained. This multilinear measure is obtained using different joint distributions of mass, which are all considered together.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/risks12010014"
    },
    {
        "id": 287,
        "title": "Energy and Expectation: The Dynamics of Living Consciousness",
        "authors": "Michael Trestman",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12304-023-09529-8"
    },
    {
        "id": 288,
        "title": "IMC: Influence Maximization from Community View",
        "authors": "Hongfang Pan",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3639631.3639633"
    },
    {
        "id": 289,
        "title": "Poetry and the expectation of the border",
        "authors": "Lytton Smith",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "This essay explores a set of poetic texts—the Transborder Immigrant Tool (TBT); Amy Sara Carroll's “The Desert Survival Series/La serie de sobrevivencia del desierto”; and Claudia Rankine and John Lucas's video poem “Zidane” and the version of that poem included in Rankine's book Citizen—against the backdrop of recent United States Customs and Border Protection investment in autonomous surveillance towers, the development of the “100 mile” expanded border region, and 2022 practices by Republican governors to relocate migrants to the U.S. to Democrat states. I argue for the existence in the poetry of what I term “the expectation of the border”: the moment when we name the border not as a graspable and unchangeable line in physical space and legal jurisdiction, but as a conceptual reckoning with definitions of community, including but not limited to citizenship status. Drawing on citizenship theorist Engin Isin's argument that “poetic articulation” especially “captures the essence of the political,” this study suggests poetry as a specialized intervention in border politics and definitions of citizenship, including the conditions of the “hostile environment”.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fhumd.2023.1141624"
    },
    {
        "id": 290,
        "title": "The role of expectation in innovation evolution: Exploring hype cycles",
        "authors": "Yuwei Shi, John Herniman",
        "published": "2023-1",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.technovation.2022.102459"
    },
    {
        "id": 291,
        "title": "Decoding Expectation Formation from Realized Stock Prices: An Eye-Tracking Study",
        "authors": "Huseyin Gulen, Chan Lim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4610951"
    },
    {
        "id": 292,
        "title": "The Audit Expectation Gap: Literature Review",
        "authors": "Anass EL BADLAOUI, Saida NAJI, Badreeddine CHEGRI",
        "published": "2023",
        "citations": 0,
        "abstract": "The purpose of this paper is to review recent empirical literature on the components and reducing factors of the Audit Expectation Gap distinguishing research conducted in developed countries relative to developing countries. We adopt a systematic literature review to review papers published between 2010 and 2020. To do so, we conducted a methodological process that combines an electronic search and a manual analysis to extract and analyze data. The results of our literature review show that fewer studies have been conducted in developed countries than in developing countries, because the AEG is no longer a contemporary theme in developed countries. Researchers from developed countries have revealed the existence of AEG, firstly, in the areas of auditor responsibilities, and especially in fraud detection and prevention. In order to mitigate AEG, audit education is seen as the primary factor in reducing AEG. Extending our study to developing countries, a clearer picture of AEG is found predominantly in auditors’ responsibilities in prevention and detection of fraud and other illegal acts and unreasonable expectations of public and auditor’s features. In order to reduce AEG, three factors are widely cited in the literature in developing countries: Audit education; Enhancement of auditor performance and Increasing the information content of audit reports.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5171/2023.4221423"
    },
    {
        "id": 293,
        "title": "Equivalent Expectation Measures for Risk and Return Analysis of Contingent Claims",
        "authors": "Sanjay K. Nawalkha, Xiaoyang Zhuo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4658971"
    },
    {
        "id": 294,
        "title": "Experience and Expectation of Socialism: Principle versus Practice in Nepal",
        "authors": "Rudra Prasad Paudel",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "This article discusses Nepali people’s experience with socialism and their expectations by addressing these questions: What is socialism? Which socialism do Nepali people expect? Why do they expect socialism? How does the principle go against the practice in the context of Nepal? Qualitative secondary sources are critically analyzed as methodological tools to reveal the present experience and expectations of Nepali people. It presents the disparity between principle and practice demonstrated by the Nepali political parties. The Constitution of Nepal2015 has formally promised that the guiding political-economic principle of this state is socialism-oriented. However, the sayings and doings of major political parties in Nepal have a big gap. In their doings, they are highly influenced by liberal capitalist principles, and they continue implementing neo-liberal policies. They put forward liberal bourgeois policies and programs that suited the interest of the comprador bourgeoisie. Thus, we have seen a contradiction in their implementation of the socialist principle, which goes against the expectation of the Nepali people. By pointing out this gap, this article highlights the need for serious discussions on achieving socialism as stated in Nepal’s constitution and expected by the people while also drawing the attention of the political actors to take immediate and radical actions to correct their behaviors in time in order to achieve the goal of a Socialism Nepal.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3126/mef.v13i01.56084"
    },
    {
        "id": 295,
        "title": "Expectation Formation with Correlated Variables",
        "authors": "Simin He, Simas Kučinskas",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Abstract\nWe experimentally study how people form expectations about correlated variables. Subjects forecast a time-series variable A. In treatment Baseline, subjects only observe past values of A. In treatment Correlated, they additionally observe a correlated variable B; A is equally predictable and has the same univariate properties in both treatments. Subjects are significantly less accurate and underreact more in Correlated, inconsistent with Bayesian learning. A structural-model estimation indicates that subjects (i) underestimate the level of correlation and (ii) are insensitive to actual correlation. Our study provides first direct evidence of correlation neglect in the domain of expectation formation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/ej/uead096"
    },
    {
        "id": 296,
        "title": "Expectation confirmation and assimilation of enterprise technology",
        "authors": "Pooria Assadi",
        "published": "2023-5-25",
        "citations": 1,
        "abstract": "PurposeEnterprise information systems (EISs) are intricate technological artifacts with wide user base within organizations. While much is known about the adoption and implementation of EISs, little is known about what subsequently follows them, i.e. the assimilation of EISs. This article aims to examine the assimilation of the EISs which is consequential to realizing any benefits from such enterprise technology.Design/methodology/approachThe author conceptually draws on the insights from the expectation confirmation theory, theory of reasoned action, equity theory, and prospect theory to examine the assimilation of the EISs. In doing so, the author generates competing testable hypotheses regarding the relationship between individual users' psychological and social influences through expectation (dis)confirmation and the users' intention to assimilate the EISs.FindingsBy conceptually articulating the individual users' psychological and social influences through expectation (dis)confirmation, the author offers a more complete account of the assimilation of EISs, and provide several avenues for future empirical and theoretical research on enterprise technology assimilation.Originality/valueThe extant research that there is on the assimilation of the EISs focuses more on the organizational – as opposed to individual – level determinants of EISs assimilation and largely considers the functional – rather than psychological and social – drivers. This article addresses these important, yet understudied, factors to offer a more nuanced account of EISs assimilation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/jeas-08-2022-0198"
    },
    {
        "id": 297,
        "title": "Direct attention-independent expectation effects on visual perception",
        "authors": "Alon Zivony, Martin Eimer",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1167/jov.23.9.4803"
    },
    {
        "id": 298,
        "title": "Predicting Gibbs-State Expectation Values with Pure Thermal Shadows",
        "authors": "Luuk Coopmans, Yuta Kikuchi, Marcello Benedetti",
        "published": "2023-1-13",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/prxquantum.4.010305"
    },
    {
        "id": 299,
        "title": "Forest Land Expectation Value or Maximum Sustained Yield? Resolving A Long-Standing Paradox",
        "authors": "Craig Loehle",
        "published": "2023-5-19",
        "citations": 2,
        "abstract": "The Faustmann formula, equivalent to the land expectation value (LEV), yields the present value, starting with bare land, of an infinite series of future timber rotations for a stand. If this formula is used to find the rotation age that maximizes the present value, a lower annual harvest will result when compared to a maximum sustained yield (MSY) regime for an ownership with many stands. However, the LEV is strongly preferred by economists. This is the LEV vs. rents paradox. Herein, this paper demonstrates that an infinite series of annual harvests for an ownership under an even flow regime, discounted to the present using any interest rate, will provide the same optimal rotation age as the time of the peak MAI for a single stand, though with different estimates for the profitability, depending on the interest rate. Thus, rotations producing the MSY and the maximum financial return are identical when analyzed at the ownership scale but are not the same when based on the analysis at the stand scale using the Faustmann formula (LEV). This is the solution to the paradox. The formulas for internal rate of return (IRR) and the land valuation for transaction purposes are also presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/f14051052"
    },
    {
        "id": 300,
        "title": "Expectation and Optimal Allocations in Existential Contests of Finite, Heavy-Tail-Distributed Outcomes",
        "authors": "Ralph Vince",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "Financial time series and other human-driven, non-natural processes are known to exhibit fat-tailed outcome distributions. That is, such processes demonstrate a greater tendency for extreme outcomes than the normal distribution or other natural distributional processes would predict. We examine the mathematical expectation, or simply “expectation”, traditionally the probability-weighted outcome, regarded since the seventeenth century as the mathematical definition of “expectation”. However, when considering the “expectation” of an individual confronted with a finite sequence of outcomes, particularly existential outcomes (e.g., a trader with a limited time to perform or lose his position in a trading operation), we find this individual “expects” the median terminal outcome over those finite trials, with the classical seventeenth-century definition being the asymptotic limit as trials increase. Since such finite-sequence “expectations” often differ in values from the classic one, so do the optimal allocations (e.g., growth-optimal). We examine these for fat-tailed distributions. The focus is on implementation, and the techniques described can be applied to all distributional forms. We make no assertion that the empirical data for any financial time series comports to the generalized hyperbolic distribution (GHD), which we will use as a proxy of any heavy-tailed distribution herein. Rather, we have selected the GHD to highlight the process for determining expectation and other important time-dependent metrics in existential contests, using the GHD as a generic proxy for the specific distributional form an implementor of the presented technique might ascribe to the empirical data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12010011"
    },
    {
        "id": 301,
        "title": "Metaphors of University Educators: The Expectation Gap with Implications for Educator Wellbeing",
        "authors": "Kim A Johnston, Anne B Lane",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "Generalised moves to online and more flexible delivery modes of teaching have challenged the perceptions and expectations of university educators worldwide. Congruence around educator role expectations, held by both the educator and their students, therefore is central to educator wellbeing, and by default, student success in a changing university environment. Metaphorical analysis is a way to understand perceptions, expectations, and the realities of university teaching. Extending the work of Saban et al. (2007), this mixed methods study of metaphors of university educators from student and educator perspectives found that while educators and students were aligned in conceptualizing teachers, there were increasing expectations on educators to demonstrate higher levels of humanistic personal qualities while at the same time being experts, accredited teachers, and engaging content creators. Educators however saw themselves as something different to how students see them, pointing to a vulnerability for educator wellbeing. The implications suggest more institutional support is needed for the ‘being and doing’ of teaching and to find better ways to align the expectations of students, universities, and educators. For early career educators, recognising the tension between the reality and aspiration of being a teacher, will go some way towards maintaining educator wellbeing.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5204/ssj.2620"
    },
    {
        "id": 302,
        "title": "A Survey of Vocational Expectation of Primary School Teachers in Western Guangdong Region",
        "authors": "",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53469/jerp.2023.05(04).13"
    },
    {
        "id": 303,
        "title": "Beef: The unbearable weight of expectation",
        "authors": "Meghna Sharma",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/10398562231198138"
    },
    {
        "id": 304,
        "title": "Conditional expectation using compactification operators",
        "authors": "Suddhasattwa Das",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.acha.2024.101638"
    }
]