[
    {
        "id": 19505,
        "title": "Analisis Ulasan Aplikasi MyPertamina Menggunakan Topic Modeling dengan Latent Dirichlet Allocation",
        "authors": "Muhammad Adrinta Abdurrazzaq",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "Kebijakan untuk menggunakan aplikasi MyPertamina dalam pembelian Bahan Bakar Minyak (BBM) bersubsidi dimulai pada tanggal 1 Juli 2022. Hingga tanggal 17 Agustus 2022, kebutuhan yang besar terhadap BBM di masyarakat membuat kebijakan ini menjadi perhatian. Pengembang aplikasi dapat memperbaiki serta memperbarui aplikasi sesuai dengan keluhan dan ulasan pengguna. Penelitian ini bertujuan untuk memetakan permasalahan yang ada pada aplikasi MyPertamina yang banyak dikeluhkan penggunanya menggunakan topic modeling dengan algoritma LDA. Hasil penelitian membagi komentar menjadi 7 dengan nilai perplexity -8.08844 dan topic coherence 0.49860. Topik – topik tersebut terkait tentang kecemasan pengguna terhadap kebijakan penggunaan aplikasi MyPertamina, permasalahan pada proses pendaftaran, permasalahan pada proses autentikasi, dan permasalahan pada kelancaran penggunaan aplikasi terkait bug dan sinyal.  Terdapat 5341 komentar dianggap sebagai spam yang tidak berkorelasi dengan aplikasi MyPertamina.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53008/kalbiscientia.v10i1.694"
    },
    {
        "id": 19506,
        "title": "Topic Modeling based Consumer behavior analysis using Latent Dirichlet Allocation",
        "authors": "Amar Jeet Rawat, Rakesh Semwal, Rajeev Kumar",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10183240"
    },
    {
        "id": 19507,
        "title": "Analyzing the Determinants of Guest Experience in Istanbul's Airbnb Market: An Advanced Topic Modeling Approach via Latent Dirichlet Allocation",
        "authors": "Yavuz Selim BALCIOĞLU",
        "published": "2024-3-17",
        "citations": 0,
        "abstract": "This study embraces an inductive approach to comprehensively examine the various factors influencing customer experience and satisfaction in Istanbul's rapidly evolving accommodation-sharing economy, with a specific focus on Airbnb. The research undertakes an extensive analysis of a substantial dataset comprising 508,746 Airbnb reviews collected from Istanbul, marking a significant endeavor in understanding the nuances of customer preferences and expectations in this domain. The process begins with a thorough preprocessing of the textual data, ensuring clarity and relevance in the information analyzed. Following this, the study employs Latent Dirichlet Allocation (LDA), a sophisticated statistical model, to identify and extract 32 distinct topics from the user-generated content. These topics, embedded within the reviews, provide a rich source of insights into the guest experience. The extracted topics are systematically categorized into several key dimensions, offering a structured framework for analysis. These dimensions include detailed assessments made by guests, locational attributes of the accommodations that range from central urban areas to more peripheral locations, and both the tangible and intangible aspects of the Airbnb listings. Additionally, the study examines the management practices of the hosts and the overall quality of service, factors that are crucial in shaping guest satisfaction. Each of these dimensions offers a lens through which the intricate aspects of customer experience in the shared accommodation sector can be understood and evaluated. To explore deeper into the intricate relationships among these topics, the study employs hierarchical Ward Clustering. This statistical technique is instrumental in revealing the complex interplay and subtle connections between the various topics. Such an approach is pivotal in elucidating the multifaceted nature of customer experience in the peer-to-peer accommodation context. The analysis aims to provide a comprehensive and layered understanding of the determinants that shape guest experiences in Istanbul's Airbnb sector. By offering a detailed, multi-faceted perspective on the drivers of customer satisfaction, this study contributes significantly to the body of knowledge in the field, enhancing the understanding of key factors that influence guest experiences and satisfaction in the dynamic and diverse landscape of Istanbul's accommodation-sharing economy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35674/kent.1396279"
    },
    {
        "id": 19508,
        "title": "TOPIC MODELING IN COVID-19 VACCINATION REFUSAL CASES USING LATENT DIRICHLET ALLOCATION AND LATENT SEMANTIC ANALYSIS",
        "authors": "Ulfah Malihatin S, Yulian Findawati, Uce Indahyanti",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "COVID -19 vaccination is a program provided by the Indonesian government to minimize the spread of the virus. The COVID-19 vaccination program in Indonesia goes hand in hand with issues that are circulating, causing controversy and rejection of vaccination on social media, especially Twitter. There are many factors that influence vaccine rejection on Twitter, to summarize frequently discussed topics and find out hidden topics, this study uses the Latent Dirichlet Allocation (LDA) and Latent Semantic Analysis (LSA) methods from 1797 Twitter scrapping data. Both models require a set of words that have been converted into a matrix, so before conducting LDA topic modeling, the dataset will undergo a bag of word (BOW) calculation. Meanwhile, in LSA topic modeling, the existing dataset will undergo word weighting of frequently occurring words using Term Frequency - Inverse Document Frequency (TF-IDF). This study was conducted to find and summarize hidden information in the form of frequently discussed topics, thus understanding public opinions related to the COVID -19 vaccination refusal case. LDA and LSA methods will display topics based on the probability and mathematical calculations of word occurrences in each topic in the document. The topics that appear will be further analyzed through coherence score by applying a limit of 20 topics to display the best value. Further modeling experiments are carried out to display topics through LDA and LSA models, this study takes 6 topics with the highest coherence values including the right of individuals to choose whether to be vaccinated or not (0.484607), the Ribka Tjiptaning controversy (0.473368), rejection of the COVID-19 vaccine by groups represented by public figures (0.463631), punishment for non-compliance in the form of fines (0.324924), and halal certification (0.312521).",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.5.951"
    },
    {
        "id": 19509,
        "title": "Mandalika Modeling Topic on Social Media Using Latent Dirichlet Allocation",
        "authors": "Veny Cahya Hardita, Rifqi Hammad, Ahmad Zuli Amrullah",
        "published": "2023-2-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccosite57641.2023.10127821"
    },
    {
        "id": 19510,
        "title": "Pemodelan Topik pada Media Berita Online Menggunakan Latent Dirichlet Allocation (Studi Kasus Merek Somethinc)",
        "authors": "Evi Puspita, Diqy Fakhrun Shiddieq, Fikri Fahru Roji",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "Somethinc merupakan salah satu merek kosmetik lokal di Indonesia yang aktif memanfaatkan media, seperti berita online untuk menyampaikan informasi terkini seputar merek. Dari banyaknya berita online mengenai merek Somethinc, sering kali topik dan tren yang sedang dibahas tidak menggambarkan informasi secara keseluruhan. Untuk menganalisis topik yang paling sering dibahas dalam berita online mengenai merek Somethinc, peneliti menggunakan metode topic modeling, yaitu Latent Dirichlet Allocation, yang dinilai lebih unggul dalam menghasilkan topik secara terstruktur. Penelitian ini memanfaatkan nilai coherence untuk menganalisis dan mengevaluasi jumlah topik terbaik, selanjutnya pendekatan human judgement digunakan untuk menginterpretasikan topik. Hasil analisis kemudian divisualisasikan secara interaktif menggunakan pyLDAvis, untuk mengetahui persebaran kata dari setiap topik. Berdasarkan hasil penelitian, jumlah topik terbaik terdapat pada topik 6 dengan nilai coherence sebesar 0.404. Keenam topik tersebut diinterpretasikan berdasarkan pendekatan human judgement, menghasilkan topik-topik meliputi produk skincare untuk kulit berjerawat, penghargaan brand kecantikan terbaik, kolaborasi produk, produk perawatan kulit dan kecantikan, kampanye pemasaran produk, dan brand lokal dengan produk perawatan kecantikan. Dapat disimpulkan bahwa jumlah topik 6 menghasilkan topik-topik yang relevan mengenai merek Somethinc.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1204"
    },
    {
        "id": 19511,
        "title": "Topic opinion leader identification based on latent Dirichlet allocation topic model",
        "authors": "Ying Zhao, Huili Deng, Tian Qiang",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004095"
    },
    {
        "id": 19512,
        "title": "Computational Linguistics Using Latent Dirichlet Allocation for Topic Modeling on Wattpad Review",
        "authors": "Rachma Awantina, Wahyu Wibowo",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.1-11-2022.2326169"
    },
    {
        "id": 19513,
        "title": "Identify Reviews of Pedulilindungi Applications using Topic Modeling with Latent Dirichlet Allocation Method",
        "authors": "Layli Hardiyanti, Dina Anggraini, Ana Kurniawati",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "The emergence of Covid-19 in December 2019 has disrupted life worldwide, including Indonesia. The government has made various efforts to control the pandemic, one of which is the development of an application called PeduliLindungi. This app aims to be a reliable tool for the government and the entire community during the pandemic. As a new regulation, the use of PeduliLindungi has prompted numerous reviews assessing its quality and performance. With the app's emergence and growth, various topics have emerged and become trending among the public. These topics were identified through user reviews of the PeduliLindungi app, using the Latent Dirichlet Allocation (LDA) algorithm. The data, consisting of 15,522 reviews, was collected from the Google Play Store and underwent pre-processing, including dictionary and corpus creation, determining the number of topics, and modeling with LDA. The resulting topic modeling process generated the ten most prominent topics. The outcomes were visualized using word clouds and topic distribution graphs, representing the most discussed aspects of the PeduliLindungi app among users. These topics are considered diverse since each issue has no relation or similarity to one another.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ijccs.86025"
    },
    {
        "id": 19514,
        "title": "Topic Modelling of Web Pages with Latent Dirichlet Allocation Methods",
        "authors": "IJSREM Journal",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Topic modelling with Latent Dirichlet Allocation (LDA) is a popular technique used in natural language processing to uncover hidden thematic structures within a collection of documents. When applied to web pages, LDA can help in identifying prevalent topics or themes across these pages.. This study delves into the utilization of Latent Dirichlet Allocation (LDA) methods to extract underlying topics within web pages, a fundamental pursuit in understanding the multifaceted landscape of online information. Web content analysis presents unique challenges owing to its diverse nature—comprising text, images, videos, and structured HTML elements—mandating rigorous preprocessing strategies to homogenize the data. By adapting the LDA model to accommodate these challenges, this research tackles the task of uncovering latent thematic structures prevalent across web content. Methodologically, the study explores parameter tuning and model adaptation to optimize LDA for web page analysis, navigating complexities such as varied content formats, noise, and inherent biases in web data. Addressing these intricacies involves parsing HTML, extracting meaningful textual information, and refining tokenization processes. Evaluating the fidelity and interpretability of discovered topics becomes pivotal, prompting the utilization of coherence scores, perplexity metrics, and human assessment to gauge the quality of generated topics. Additionally, this research confronts the dynamic nature of web content, proposing strategies like continuous model retraining and dynamic topic modeling to accommodate evolving trends and updates. Practical applications of the extracted topics span a spectrum of domains, encompassing content recommendation systems, user behavior analysis, sentiment analysis, targeted advertising, and the enhancement of search algorithms for improved relevance and user engagement. Supported by illustrative case studies, this study elucidates how LDA serves as a potent mechanism to distill coherent and meaningful topics from web pages, offering invaluable insights into the hidden structures within the vast expanse of online information. St This comprehensive abstract encapsulates the depth and breadth of employing LDA for the analysis of web content, encompassing challenges, methodologies, evaluations, applications, and real-world implications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem27350"
    },
    {
        "id": 19515,
        "title": "Tracing the evolution of green logistics: A latent dirichlet allocation based topic modeling technology and roadmapping",
        "authors": "Ruijundi Ma, Yong Jin Kim",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "Green logistics (GL) is the main development trend of modern logistics. The analysis of green logistics topics and their evolution is helpful in grasping its development trend and doing research facing the international frontier. Focusing on the hot topics and evolution process of green logistics, this paper analyzes from four aspects: firstly, this study divides the green logistics development progress into three stages based on life cycle theory, which are the emerging stage (1993–2003), slow growth stage (2004–2014) and rapid growth stage (2015–2021). Then, based on latent dirichlet allocation (LDA) topic model, this study summarizes and confirms related words and meaning of each topic in different stages. Furthermore, this study calculates the text similarity in each development stage of green logistics and analyzes the trend of hot topics in green logistics. Finally, this paper visualizes the development roadmap of green logistics and explores the progression among three stages. There are 4, 5, and 7 topics defined respectively in three development stages. The revolution of green logistics is analyzed, and the results show that \"model and management on sustainable development of GL\", \"related issues and potential threats of GL\", and \"optimization analysis of low-carbon vehicle routing and time\" are the primary development trends of green logistics. This study fills the gap in considering the evolution process of green logistics through topic modeling and roadmapping method. It provides a particular theoretical significance for the green and sustainable development of logistics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0290074"
    },
    {
        "id": 19516,
        "title": "ANALISIS DAN PENERAPAN TOPIC MODELING PADA JUDUL TUGAS AKHIR MAHASISWA MENGGUNAKAN METODE LATENT DIRICHLET ALLOCATION (LDA)",
        "authors": "Titiana Titiana, Dwi Hosanna Bangkalang",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "Tugas akhir menjadi syarat kelulusan bagi mahasiswa program studi Sistem Informasi, Fakultas Teknologi Informasi, Universitas Kristen Satya Wacana. Penentuan judul tugas akhir di program studi, biasanya ditentukan sesuai konsentrasi. Namun, saat penentuan judul masih terdapat mahasiswa yang kebingungan karena tidak mempunyai referensi yang valid terkait gambaran judul di konsentrasi program studi. Sehingga, mahasiswa sering memasukan data kosong pada judul tugas akhir saat melakukan pendaftaran. Selain itu, program studi juga belum mempunyai informasi terkait pengelompokan judul tugas akhir mahasiswa. Oleh karena itu dibutuhkan topic modeling untuk mengetahui minat judul tugas akhir sebagai referensi mahasiswa dalam penentuan judul. Topic modeling dibuat menggunakan metode Latent Dirichlet Allocation (LDA) kemudian dibuat pengklasteran serta dilakukan evaluasi model menggunakan hyperparameter tuning dan coherence score sebagai alat ukur performa model. Tahapan penelitian meliputi studi literatur dan wawancara, pengumpulan dan analisis data, data pre-processing, pembuatan model, dan evaluasi. Diperoleh hasil bahwa mayoritas mahasiswa Sistem Informasi mengambil judul bertema Tata Kelola. Model yang dibuat memperoleh 4 cluster yaitu terkait Technology Acceptance Model, Framework Cobit, dan Arsitektur Enterprise.  Setelah dilakukan hyperparameter tuning didapat coherence score sebesar 0,617789 dari yang sebelumnya 0,53448. Tujuan penelitian ini adalah memodelkan topik tugas akhir mahasiswa sebagai informasi cluster pengambilan judul tugas akhir dari peneliti mahasiswa terdahulu. Sehingga bermanfaat sebagai referensi pengambilan judul tugas akhir untuk mahasiswa sebagai dasar pengetahuan minat judul tugas akhir dan untuk memberikan pengetahuan dan kontribusi bagi program studi sebagai landasan penyesuaian judul tugas akhir mahasiswa, konsentrasi serta pengembangan kurikulum.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29100/jipi.v8i4.4254"
    },
    {
        "id": 19517,
        "title": "Topic modeling of the quality of guest’s experience using latent Dirichlet allocation: western versus eastern perspectives",
        "authors": "Raksmey Sann, Pei-Chun Lai",
        "published": "2023-2-8",
        "citations": 5,
        "abstract": "\nPurpose\nThis study aims to understand the satisfaction and needs of eastern and western travelers as hotel guest, based on their experiences as seen in guest reviews and review topics.\n\n\nDesign/methodology/approach\nConsidering 2,965 and 1,035 western and eastern traveler reviews, respectively, from 47 countries, obtained from TripAdvisor listed-hotel in Phnom Penh and Siem Reap city in Cambodia, this study investigates the differences in hotel guest satisfaction and needs by using topic modeling (i.e. latent Dirichlet allocation [LDA]).\n\n\nFindings\nThe results reveal differences in the online preferences, experiences, expectations and behaviors of hotel guests from different cultural backgrounds. Though western and eastern travelers appear to place similar emphasis on service, location, room and destination. The westerners more likely focus on meal and online reservation, whereas the easterners focus on hotel facility.\n\n\nResearch limitations/implications\nReviews were obtained from only two cities in Cambodia, which is not an adequate representation of the diverse travelers visiting the country.\n\n\nPractical implications\nThe comparison highlighting the similarities and dissimilarities between western and eastern traveler perspectives enable hoteliers to understand guests’ preferences and their hidden changes in (dis)satisfaction and leverage it to improve hotel service quality, increase occupancy and, thereby, maximize profits.\n\n\nOriginality/value\nThis study contributes to the literature on hotel guests’ experiences by presenting the difference in perceptions of service experience of western and eastern travelers, through topic modeling.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/cbth-04-2022-0084"
    },
    {
        "id": 19518,
        "title": "Human-centricity in Industry 5.0 – revealing of hidden research topics by unsupervised topic modeling using Latent Dirichlet Allocation",
        "authors": "Peter Madzik, Lukas Falat, Luay Jum’a, Mária Vrábliková, Dominik Zimon",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "PurposeThe set of 2,509 documents related to the human-centric aspect of manufacturing were retrieved from Scopus database and systmatically analyzed. Using an unsupervised machine learning approach based on Latent Dirichlet Allocation we were able to identify latent topics related to human-centric aspect of Industry 5.0.Design/methodology/approachThis study aims to create a scientific map of the human-centric aspect of manufacturing and thus provide a systematic framework for further research development of Industry 5.0.FindingsIn this study a 140 unique research topics were identified, 19 of which had sufficient research impact and research interest so that we could mark them as the most significant. In addition to the most significant topics, this study contains a detailed analysis of their development and points out their connections.Originality/valueIndustry 5.0 has three pillars – human-centric, sustainable, and resilient. The sustainable and resilient aspect of manufacturing has been the subject of many studies in the past. The human-centric aspect of such a systematic description and deep analysis of latent topics is currently just passing through.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ejim-09-2023-0753"
    },
    {
        "id": 19519,
        "title": "Analisis Topic Modelling Persepsi Pengguna Internet Menggunakan Metode Latent Dirichlet Allocation",
        "authors": "Nuri Cahyono,  Angga Reni Dwi Astuti",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Technological advances have undoubtedly had a major impact on information media. One impact of technological progress is the existence of news media as a source of publik information. There is also regional information, both domestic and foreign, and of course there are various discussions. News data from online news portals can be used as a source of information as a source of research and analysis. Of course, newa portals cover all types of news on various topics. Indentifying frequently discussed topics on news portal will denfinitely take a lot of time. Therefore, this research focuses on applying a topic modelling system to implement a news topic decision system using the Latent Dirichlet Allocation (LDA) method. This research successfully applies the Latent Dirichlet Allocation (LDA) method in determining news topics, of which there are three topic categories that are often discussed on the online news portal detik.com. topic 1 contains natural disaster event, topik 2 contins political figures and issues, topik 3 conttains news about the world cup.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i1.3155"
    },
    {
        "id": 19520,
        "title": "An Integrated Approach for Sentiment Analysis and Topic Modeling of a Digital Bank in Indonesia using Naïve Bayes and Latent Dirichlet Allocation Algorithms on Social Media Data",
        "authors": "Johan Setiawan, Anastasia Milenia, Ahmad Faza",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ibdap58581.2023.10271956"
    },
    {
        "id": 19521,
        "title": "Latent Dirichlet Allocation (LDA) topic models for Space Syntax studies on spatial experience",
        "authors": "Ju Hyun Lee, Michael J. Ostwald",
        "published": "2024-1-9",
        "citations": 1,
        "abstract": "AbstractSpatial experience has been extensively researched in various fields, with Space Syntax being one of the most widely used methodologies. Multiple Space Syntax techniques have been developed and used to quantitively examine the relationship between spatial configuration and human experience. However, due to the heterogeneity of syntactic measures and experiential issues in the built environment, a systematic review of socio-spatial topics has yet to be developed for Space Syntax research. In response to this knowledge gap, this article employs an ‘intelligent’ method to classify and systematically review topics in Space Syntax studies on spatial experience. Specifically, after identifying 66 articles using the ‘Preferred Reporting Items for Systematic reviews and Meta-Analyses’ (PRISMA) framework, this research develops generative probabilistic topic models to classify the articles using the Latent Dirichlet Allocation (LDA) method. As a result, this research automatically generates three architectural topics from the collected literature data (A1. Wayfinding behaviour, A2. Interactive accessibility, and A3. Healthcare design) and three urban topics (U1. Pedestrian movement, U2. Park accessibility, and U3. Cognitive city). Thereafter it qualitatively examines the implications of the data and its LDA classification. This article concludes with an examination of the limitations of both the methods and the results. Along with demonstrating a methodological innovation (combining PRISMA with LDA), this research identifies critical socio-spatial concepts and examines the complexity of Space Syntax applications. In this way, this research contributes to future Space Syntax research that empirically investigates the relationships between syntactic and experiential variables in architectural and urban spaces. The findings support a detailed discussion about research gaps in the literature and future research directions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40410-023-00223-3"
    },
    {
        "id": 19522,
        "title": "Topic Modelling of Swedish Newspaper Articles about Coronavirus: a Case Study using Latent Dirichlet Allocation Method",
        "authors": "Bernadeta Griciūtė, Lifeng Han, Goran Nenadic",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00110"
    },
    {
        "id": 19523,
        "title": "Analysis of Depression in News Articles Before and After the COVID-19 Pandemic Based on Unsupervised Learning and Latent Dirichlet Allocation Topic Modeling",
        "authors": "Seonjae Been, Haewon Byeon",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141018"
    },
    {
        "id": 19524,
        "title": "Topic Modelling using Latent Dirichlet Allocation (LDA) and Analysis of Students Sentiments",
        "authors": "Ontiretse Ishmael, Etain Kiely, Cormac Quigley, Donal McGinty",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jcsse58229.2023.10201965"
    },
    {
        "id": 19525,
        "title": "Topic Modelling Latent Dirichlet Allocation untuk Klasifikasi Komentar pada Layanan Streaming Platform",
        "authors": "Noorhanida Royani, Catur Edi Widodo, Budi Warsito",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Seiring dengan berkembangnya teknologi, memunculkan banyak platform online untuk streaming film. Streaming platform banyak digunakan masyarakat seperti netflix, disney+, hbo go, we tv, vidio. Banyaknya perbandingan antar streaming platform menjadi perbincangan dimedia sosial yaitu twitter. Opini yang disampaikan pengguna streaming platform berisi komentar positif dan komentar negatif yang mempengaruhi pengguna lainnya yang ingin menonton film. Penelitian ini dilakukan untuk mengkaji perbandingan antara komentar positif dan komentar negatif pengguna streaming platform pada media sosial Twitter. Metode Latent dirichlet allocation dapat digunakan sebagai topic modelling dan Support Vector Machine untuk klasifikasi. Pada tahapan pengambilan data dengan menggunakan tools framework scrapy dengan python, data diambil sebanyak 5.000 dan dilakukan preprocessing text. Metode LDA dapat mempresentasikan topik dan dokumen serta klasifikasi menggunakan Support Vector Machine (SVM) mendapatkan hasil komentar positif lebih banyak dari pada komentar negatif. Hasil evaluasi preforma didapatkan nilai akurasi 0,88, recall 0,88, F1score 0,87, precision 0,88. Topic Modelling Latent Dirichlet Allocation (LDA) untuk Klasifikasi Komentar pada Layanan Streaming Platform dengan menggunakan 5,000 data diambil dari sosial media yaitu twitter yang terbagi menjadi komentar positif dan komentar negatif. Hasil ini dipengaruhi dari jumlah komentar positif yang lebih dominan dari pada komentar negatif. Implikasi dari penelitian ini adalah pentingnya memperhatikan keseimbangan data dalam melakukan klasifikasi komentar pada platform streaming agar hasil prediksi klasifikasi dapat lebih akurat.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23887/jstundiksha.v12i3.68492"
    },
    {
        "id": 19526,
        "title": "Latent Dirichlet Allocation-Based Topic Mining Analysis of Educational Scientific Research Projects Based on 2360 NSF Education Projects",
        "authors": "Jining Han, Geping Liu, Yuying Yang",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "The National Science Foundation has promoted the development of education in the U.S., and its establishment reflects the trend of education development. This study collects the data on 2360 NSF educational projects over the last three years to answer two research questions: What are the major research topics of NSF educational projects? What are the key projects doing? Through Latent Dirichlet allocation topic modelling, content analysis is carried out on the titles and abstracts of the 2360 projects, and eight topics are obtained from them, including top-notch innovative talent cultivation, STEM education for low-income groups, undergraduate education, vocational education, cutting-edge technology education, big data-driven technology, artificial intelligence, and teacher development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18421/tem122-32"
    },
    {
        "id": 19527,
        "title": "Topic Sentiment Using Logistic Regression and  Latent Dirichlet Allocation as a Customer Satisfaction Analysis Model",
        "authors": "Puji Winar Cahyo, Ulfi Saidata Aesyi, Bagas Dwi Santosa",
        "published": "2024-1-23",
        "citations": 0,
        "abstract": "Buying and selling goods now is more interesting through e-commerce or marketplaces because of the ease of carrying out online transactions. Each transaction usually generates a response from the customer. The transaction response on the Shopee platform is still in paragraph form and needs to be more specific. Therefore, this research aims to build a model analysis of customer satisfaction using the best algorithm between support vector machine (SVM), random forest, and logistic regression. This research method uses sentiment classification with logistic regression because the logistic regression algorithm has the best accuracy, with an accuracy of 90.5. Meanwhile, the SVM algorithm achieved an accuracy of 90.4, and random forest reached 90.2. The three algorithms were tested three times, splitting data train:test at 80:20, 70:30, and 60:40. The best results were obtained by splitting data at 60:40. The best model is used to predict data without labels. The prediction produces 12,844 positive sentiment comment data, 112 negative sentiment comment data, and 70 neutral sentiment comment data. The results of this research continued to topic modeling using latent dirichlet allocation (LDA) to generate a trending topic of customer satisfaction on sales products. Implications of discussing each trend topic can be used as a reference for improving products and services, especially in communicating with customers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20895/infotel.v16i1.1081"
    },
    {
        "id": 19528,
        "title": "Fusing Latent Dirichlet Allocation with Fuzzy Matching for Improved Topic Expressiveness in Text Mining",
        "authors": "Jiahua Yu, Simon Fong, Qun Song, Lianggui Tang, Richard C. Millham",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ddp60485.2023.00050"
    },
    {
        "id": 19529,
        "title": "Modeling document labels using Latent Dirichlet allocation for archived documents in Integrated Quality Assurance System (IQAS)",
        "authors": "Freddie Prianes, Thelma Palaoag",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "Background As part of the transition of every higher education institution into an intelligent campus here in the Philippines, the Commission of Higher Education has launched a program for the development of smart campuses for state universities and colleges to improve operational efficiency in the country. With regards to the commitment of Camarines Sur Polytechnic Colleges to improve the accreditation operation and to resolve the evident problems in the accreditation process, the researchers propose this study as part of an Integrated Quality Assurance System that aims to develop an intelligent model that will be used in categorizing and automating tagging of archived documents used during accreditation. Methods As a guide in modeling the study, the researchers use an agile method as it promotes flexibility, speed, and, most importantly, continuous improvement in developing, testing, documenting, and even after delivery of the software. This method helped the researchers design the prototype with the implementation of the said model to aid the file searching process and label tagging. Moreover, a computational analysis is also included to understand the result from the devised model further. Results As a result, from the processed sample corpus, the document labels are faculty, activities, library, research, and materials. The labels generated are based on the total relative frequencies, which are 0.009884, 0.008825, 0.007413, 0.007413, and 0.006354, respectively, that have been computed between the ratio of how many times the term was used in the document and the total word count of the whole document. Conclusions The devised model and prototype support the organization in file storing and categorization of accreditation documents. Through this, retrieving and classifying the data is easier, which is the main problem for the task group. Further, other clustering, modeling, and text classification patterns can be integrated into the prototype.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12688/f1000research.130245.2"
    },
    {
        "id": 19530,
        "title": "Modeling document labels using Latent Dirichlet allocation for archived documents in Integrated Quality Assurance System (IQAS)",
        "authors": "Freddie Prianes, Thelma Palaoag",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "Background: As part of the transition of every higher education institution into an intelligent campus here in the Philippines, the Commission of Higher Education has launched a program for the development of smart campuses for state universities and colleges to improve operational efficiency in the country. With regards to the commitment of Camarines Sur Polytechnic Colleges in improving the accreditation operation and to resolve the evident problems in the accreditation process, the researchers propose this study as part of an Integrated Quality Assurance System that aims to develop an intelligent model that will be used in categorizing and automating tagging of archived documents used during accreditation. Methods: As a guide in modeling the study, the researchers use an agile method as it promotes flexibility, speed, and, most importantly, continuous improvement in developing, testing, documenting, and even after delivery of the software. This method helped the researchers in designing the prototype with the implementation of the said model to aid the process in file searching and label tagging. Moreover, a computational analysis is also included to further understand the result from the devised model. Results: As a result, from the processed sample corpus, the document labels are faculty, activities, library, research, and materials. The labels generated are based on the total relative frequencies which are 0.009884, 0.008825, 0.007413, 0.007413, 0.006354, respectively, that have been computed between the ratio on how many times the term was used in the document and the total word count of the whole document. Conclusions: The devised model and prototype support the organization in file storing and categorization of accreditation documents. Through this, it is easier to retrieve and classify the data, which is the main problem for the task group. Further, other patterns in clustering, modeling, and text classification can be integrated in the prototype.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12688/f1000research.130245.1"
    },
    {
        "id": 19531,
        "title": "Modeling document labels using Latent Dirichlet allocation for archived documents in Integrated Quality Assurance System (IQAS)",
        "authors": "Freddie Prianes, Thelma Palaoag",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "Background As part of the transition of every higher education institution into an intelligent campus here in the Philippines, the Commission of Higher Education has launched a program for the development of smart campuses for state universities and colleges to improve operational efficiency in the country. With regards to the commitment of Camarines Sur Polytechnic Colleges to improve the accreditation operation and to resolve the evident problems in the accreditation process, the researchers propose this study as part of an Integrated Quality Assurance System that aims to develop an intelligent model that will be used in categorizing and automating tagging of archived documents used during accreditation. Methods As a guide in modeling the study, the researchers use an agile method as it promotes flexibility, speed, and, most importantly, continuous improvement in developing, testing, documenting, and even after delivery of the software. This method helped the researchers design the prototype with the implementation of the said model to aid the file searching process and label tagging. Moreover, a computational analysis is also included to understand the result from the devised model further. Results As a result, from the processed sample corpus, the document labels are faculty, activities, library, research, and materials. The labels generated are based on the total relative frequencies, which are 0.009884, 0.008825, 0.007413, 0.007413, and 0.006354, respectively, that have been computed between the ratio of how many times the term was used in the document and the total word count of the whole document. Conclusions The devised model and prototype support the organization in file storing and categorization of accreditation documents. Through this, retrieving and classifying the data is easier, which is the main problem for the task group. Further, other clustering, modeling, and text classification patterns can be integrated into the prototype.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12688/f1000research.130245.3"
    },
    {
        "id": 19532,
        "title": "Insights Into Korean Public Perspectives on Urology: Online News Data Analytics Through Latent Dirichlet Allocation Topic Modeling",
        "authors": "Young Wook Oh, JungYoon Kim",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Purpose: The objective of the study was to explore how urology-related news, one of the medical specialties profoundly linked to human health and life, is communicated to the public through media outlets that serves as primary sources of medical information for the public.Methods: In this study, articles were retrieved using the keyword ‘Urology’ from the Bigkinds spanning from January 1, 1990 to August 17, 2023. The Beautifulsoup library in Python was utilized for parsing the text to collect both titles and bodies of the articles. The gathered data was then analyzed using the latent Dirichlet allocation (LDA) algorithm from the scikit-learn library. Additionally, tools such as Wordcloud and Networkx were employed to visualize the relationships and patterns within the data.Results: The keyword analysis led to the identification of various themes in the articles, with a clear distinction between those providing medical information and those promoting healthcare services, technologies, and products. Notably, the content frequently intertwined informational aspects with promotional ones. Articles on men’s health and pet diseases, for example, often combined educational material with product or procedure promotions. This overlap highlights the complexity of categorizing media content into distinct themes. Furthermore, the coverage of health insurance and treatment methods including recent advancements like robotic surgery reflected the evolving nature of healthcare discussions to emphasize the interplay between policy changes, medical advancements, and media portrayal.Conclusions: By identifying 10 distinct topics mentioned in the news, the analysis determined which topics are common in urology-related news coverage. The findings revealed a substantial volume of medical information on urology in the media with a wide range of topics including treatment and prevention of urologic conditions, insurance information, new treatments, and news stories promoting new products or hospitals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5213/inj.2346288.144"
    },
    {
        "id": 19533,
        "title": "Why Enroll in a Graduate-level Vocational Education Program?: Exploring Views of Graduate Students Using Latent Dirichlet Allocation Topic Modelling",
        "authors": "Ma. Zosima Tejero",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23960/jpp.v13.i2.202337"
    },
    {
        "id": 19534,
        "title": "Application Research on Semantic Analysis Using Latent Dirichlet Allocation and Collapsed Gibbs Sampling for Topic Discovery",
        "authors": "Yetunde Esther Ogunwale, Micheal Olalekan Ajinaja",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "Topic discovery is a process of identifying the main topics present in a collection of documents. It is a crucial step in text mining, digital humanities, and information retrieval, as it allows one to extract meaningful information from large volumes of unstructured text data. The most widely used algorithm for topic discovery is Latent Dirichlet Allocation (LDA). LDA assumes that the words in each document are generated by a small number of underlying topics, and the algorithm learns the topics from the text data automatically. One of the main problems of LDA is that the topics extracted are of poor quality if the document does not coherently belong to a single topic. However, Gibbs sampling operates on a word-by-word basis, which allows it to be used on documents with a variety of topics and modifies the topic assignment of a single word. The paper presents application research on Latent Dirichlet Allocation and Collapsed Gibbs Sampling Semantic Analysis for topic discovery.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ajrcos/2023/v16i4404"
    },
    {
        "id": 19535,
        "title": "Measuring Online Customer Satisfaction Based on Customer Reviews: Topic Modeling Method Using Latent Dirichlet Allocation (LDA) Algorithm",
        "authors": "Gehan S Dhameeth,  ",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Companies invest significant resources in retaining their customers. Nonetheless, organizations have witnessed customer attrition due to inadequate loyalty. This trend is particularly prevalent among online customer bases. The root cause of this issue lies in the absence of an effective tool for measuring online customer satisfaction that surpasses the capabilities of existing methods. To address this concern, a quantitative study explored the dimensions of online customer satisfaction measurement and established a model applicable across industries for gauging and predicting online customer satisfaction. This was accomplished by conducting an online survey via SurveyMonkey with 384 respondents, employing supervised and unsupervised machine learning techniques in conjunction with the topic modeling algorithm, Latent Dirichlet Allocation (LDA). The findings of this study revealed a significant relationship between predictor variables such as navigation, playfulness, information quality, trust, personalization, and responsiveness and the target variable, online customer satisfaction, employing multiple linear modeling (LSM). Furthermore, it was observed that this phenomenon transcends age groups, impacting both younger and older customers alike. However, it is essential to acknowledge certain limitations, including the risk of overfitting, challenges in establishing external validity, a narrow focus on the retail sector (B2C), and a restricted scope limited to the United States market.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47363/jmscm/2024(3)120"
    },
    {
        "id": 19536,
        "title": "Polarimetric Synthetic Aperture Radar Ship Potential Area Extraction Based on Neighborhood Semantic Differences of the Latent Dirichlet Allocation Bag-of-Words Topic Model",
        "authors": "Weixing Qiu, Zongxu Pan",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Recently, deep learning methods have been widely studied in the field of polarimetric synthetic aperture radar (PolSAR) ship detection. However, extracting polarimetric and spatial features on the whole PolSAR image will result in high computational complexity. In addition, in the massive data ship detection task, the image to be detected contains a large number of invalid areas, such as land and seawater without ships. Therefore, using ship coarse detection methods to quickly locate the potential areas of ships, that is, ship potential area extraction, is an important prerequisite for PolSAR ship detection. Since existing unsupervised PolSAR ship detection methods based on pixel-level features often rely on fine sea–land segmentation pre-processing and have poor applicability to images with complex backgrounds, in order to solve the abovementioned issue, this paper proposes a PolSAR ship potential area extraction method based on the neighborhood semantic differences of an LDA bag-of-words topic model. Specifically, a polarimetric feature suitable for the scattering diversity condition is selected, and a polarimetric feature map is constructed; the superpixel segmentation method is used to generate the bag of words on the feature map, and latent high-level semantic features are extracted and classified with the improved LDA bag-of-words topic model method to obtain the PolSAR ship potential area extraction result, i.e., the PolSAR ship coarse detection result. The experimental results on the self-established PolSAR dataset validate the effectiveness and demonstrate the superiority of our method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15235601"
    },
    {
        "id": 19537,
        "title": "A Study on the Conceptualization of Metaverse Tourism in the New Normal Era: Topic Modeling Analysis Using Latent Dirichlet Allocation",
        "authors": "Kyu Mee Kim,  ",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "While the COVID-19 pandemic has become commonplace recently, a new normal era has arrived. In particular, in the tourism industry, people's desire for tourism has changed the form of tourism and the way of leisure in line with the trend. And a shift to another new tourism paradigm called Metaverse tourism is imminent. In other words, it is necessary to discuss the shift of the tourism paradigm to the Metaverse n the new normal era. However, the concept of Metaverse tourism has not yet been established. Therefore, the purpose of this study is to conceptualize Metaverse Tourism using big data. The data collection period for big data is from January to December 2022, and frequency analysis, centrality analysis, and LDA topic modeling analysis were conducted using the Textom_v6.0 program. As a result of the analysis, Metaverse Tourism consisted of four topics. Based on this, a conceptual definition of Metaverse Tourism was established, and theoretical and practical implications were discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33645/cnc.2023.05.45.05.747"
    },
    {
        "id": 19538,
        "title": "Tweet topics on cancer among Indian Twitter users—computational approach using latent Dirichlet allocation topic modelling",
        "authors": "Thilagavathi Ramamoorthy, Bagavandas Mappillairaju",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42001-023-00222-x"
    },
    {
        "id": 19539,
        "title": "Detecting Outliers in CI/CD Pipeline Logs Using Latent Dirichlet Allocation",
        "authors": "Daniel Atzberger, Tim Cech, Willy Scheibel, Rico Richter, Jürgen Döllner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011858500003464"
    },
    {
        "id": 19540,
        "title": "Applying TRIZ and Kansei engineering to the eco-innovative product design towards waste recycling with latent Dirichlet allocation topic model analysis",
        "authors": "Chaoxiang Yang, Tengfei Xu, Junnan Ye",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.107962"
    },
    {
        "id": 19541,
        "title": "Latent Dirichlet Allocation modeling of environmental microbiomes",
        "authors": "Anastasiia Kim, Sanna Sevanto, Eric R. Moore, Nicholas Lubbers",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "Interactions between stressed organisms and their microbiome environments may provide new routes for understanding and controlling biological systems. However, microbiomes are a form of high-dimensional data, with thousands of taxa present in any given sample, which makes untangling the interaction between an organism and its microbial environment a challenge. Here we apply Latent Dirichlet Allocation (LDA), a technique for language modeling, which decomposes the microbial communities into a set of topics (non-mutually-exclusive sub-communities) that compactly represent the distribution of full communities. LDA provides a lens into the microbiome at broad and fine-grained taxonomic levels, which we show on two datasets. In the first dataset, from the literature, we show how LDA topics succinctly recapitulate many results from a previous study on diseased coral species. We then apply LDA to a new dataset of maize soil microbiomes under drought, and find a large number of significant associations between the microbiome topics and plant traits as well as associations between the microbiome and the experimental factors, e.g. watering level. This yields new information on the plant-microbial interactions in maize and shows that LDA technique is useful for studying the coupling between microbiomes and stressed organisms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pcbi.1011075"
    },
    {
        "id": 19542,
        "title": "Implementasi Klasifikasi Naive Bayes dan Pemodelan Topik dengan Latent Dirichlet Allocation untuk Data Ulasan Video Game Lokal Pada Platform Steam",
        "authors": "Yusra Sakti Wardhana, Ayundyah Kesumawati Ayundyah Kesumawati",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Industri video game global terus meroket dengan partisipasi pemain yang meningkat setiap tahun. Steam, sebagai platform distribusi digital terbesar yang dikembangkan oleh Valve Corporation, memungkinkan pengguna memberikan ulasan terbuka tentang video game. Prediksi sentimen yang akurat dalam ulasan online dapat meningkatkan peluang keuntungan bagi pengembang video game. Penelitian ini fokus pada klasifikasi dan pemodelan topik ulasan video game lokal di Steam menggunakan metode Naïve Bayes dan Latent Dirichlet Allocation. Sebelum penyeimbangan data, tingkat akurasi klasifikasi Naïve Bayes mencapai 86%, dan setelah penyeimbangan data, turun menjadi 81%.  Untuk pemodelan topik, penelitian ini mendapatkan 5 topik dengan nilai probabilitas 0.38807 untuk ulasan “Recommended” yaitu topik 1 membahas fitur video game stardew valley, topik 2 membahas puzzle dengan tema fantasy, topik 3 membahas visual art dan soundtrack, topik 4 membahas update patch disertai puzzle dengan musik, dan topik 5 membahas karakter dan gameplay, sedangkan 3 topik dengan nilai probabilitas 0.28095 untuk ulasan “Not Recommended” yaitu topik 1 membahas masalah bug gameplay, topik 2 membahas bug boss battle, dan topik 3 membahas masalah performa video game",
        "keywords": "",
        "link": "http://dx.doi.org/10.20885/esds.vol1.iss.3.art41"
    },
    {
        "id": 19543,
        "title": "Researched topics, patterns, barriers and enablers of artificial intelligence implementation in supply chain: a Latent-Dirichlet-allocation-based topic-modelling and expert validation",
        "authors": "Youssra Riahi, Tarik Saikouk, Ismail Badraoui, Samuel Fosso Wamba",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09537287.2023.2286523"
    },
    {
        "id": 19544,
        "title": "Modeling news topics on government youtube channels with latent Dirichlet allocation method",
        "authors": "Subhan Subhan, M. Faris Al Hakim, Prasetyo Listiaji, Wahyu Syafrizal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0125954"
    },
    {
        "id": 19545,
        "title": "Identifying Latent Topics and Trends in Premature Infant–Related Nursing Studies Using a Latent Dirichlet Allocation Method",
        "authors": "Myeong Seon Lee, Seonah Lee",
        "published": "2023-12",
        "citations": 0,
        "abstract": "This study aimed to identify topics and within-topic core keywords in premature infant–related nursing studies published in Korean and international academic journals using topic modeling and to compare and analyze the trends in Korean and international studies. Journal databases were searched to extract nursing studies involving premature infants from 1998 to 2020. Journal databases included MEDLINE, Web of Science, CINAHL, and EMBASE for international studies and DBpia, the National Digital Science Library, the Korea Citation Index, and the Research Information Sharing Service for Korean studies. Abstracts from the selected 182 Korean and 2502 international studies were analyzed using NetMiner4.4.3e. In results, four similar topics (Korean vs international) were “pain intervention” versus “pain management”; “breast feeding practice” versus “breast feeding”; “kangaroo mother care”; and “parental stress” versus “stress & depression.” Two topics that appeared only in the international studies were “infection management” and “oral feeding & respiratory care.” Overall, the international studies dealt with diverse topics directly associated with premature. Korean studies mainly dealt with topics related to mothers of premature infants, whereas studies related to premature infants were insufficient. Nursing research in Korea needs to be expanded to research topics addressing premature infants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/cin.0000000000001031"
    },
    {
        "id": 19546,
        "title": "Federated Latent Dirichlet Allocation for User Preference Mining",
        "authors": "Xing Wu, Yushun Fan, Jia Zhang, Zhenfeng Gao",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "In the field of Web services computing, a recent demand trend is to mine user preferences based on user requirements when creating Web service compositions, in order to meet comprehensive and ever evolving user needs. Machine learning methods such as the latent Dirichlet allocation (LDA) have been applied for user preference mining. However, training a high-quality LDA model typically requires large amounts of data. With the prevalence of government regulations and laws and the enhancement of people’s awareness of privacy protection, the traditional way of collecting user data on a central server is no longer applicable. Therefore, it is necessary to design a privacy-preserving method to train an LDA model without massive collecting or leaking data. In this paper, we present novel federated LDA techniques to learn user preferences in the Web service ecosystem. On the basis of a user-level distributed LDA algorithm, we establish two federated LDA models in charge of two-layer training scenarios: a centralized synchronous federated LDA (CSFed-LDA) for synchronous scenarios and a decentralized asynchronous federated LDA (DAFed-LDA) for asynchronous ones. In the former CSFed-LDA model, an importance-based partially homomorphic encryption (IPHE) technique is developed to protect privacy in an efficient manner. In the latter DAFed-LDA model, blockchain technology is incorporated and a multi-channel-based authority control scheme (MCACS) is designed to enhance data security. Extensive experiments over a real-world dataset ProgrammableWeb.com have demonstrated the model performance, security assurance and training speed of our approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/jwe1540-9589.2244"
    },
    {
        "id": 19547,
        "title": "Source Free Domain Adaptation Based on Latent Dirichlet Allocation",
        "authors": "Tian Liang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccwamtip60502.2023.10387035"
    },
    {
        "id": 19548,
        "title": "Gaussian hierarchical latent Dirichlet allocation: Bringing polysemy back",
        "authors": "Takahiro Yoshida, Ryohei Hisano, Takaaki Ohnishi",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "Topic models are widely used to discover the latent representation of a set of documents. The two canonical models are latent Dirichlet allocation, and Gaussian latent Dirichlet allocation, where the former uses multinomial distributions over words, and the latter uses multivariate Gaussian distributions over pre-trained word embedding vectors as the latent topic representations, respectively. Compared with latent Dirichlet allocation, Gaussian latent Dirichlet allocation is limited in the sense that it does not capture the polysemy of a word such as “bank.” In this paper, we show that Gaussian latent Dirichlet allocation could recover the ability to capture polysemy by introducing a hierarchical structure in the set of topics that the model can use to represent a given document. Our Gaussian hierarchical latent Dirichlet allocation significantly improves polysemy detection compared with Gaussian-based models and provides more parsimonious topic representations compared with hierarchical latent Dirichlet allocation. Our extensive quantitative experiments show that our model also achieves better topic coherence and held-out document predictive accuracy over a wide range of corpus and word embedding vectors which significantly improves the capture of polysemy compared with GLDA and CGTM. Our model learns the underlying topic distribution and hierarchical structure among topics simultaneously, which can be further used to understand the correlation among topics. Moreover, the added flexibility of our model does not necessarily increase the time complexity compared with GLDA and CGTM, which makes our model a good competitor to GLDA.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0288274"
    },
    {
        "id": 19549,
        "title": "Identification of Pavement Issues Using Latent Dirichlet Allocation Machine Learning",
        "authors": "Timothy A. Parsons, Aaron Pullen",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784484906.017"
    },
    {
        "id": 19550,
        "title": "Trends in Agroforestry Research from 1993 to 2022: A Topic Model Using Latent Dirichlet Allocation and HJ-Biplot",
        "authors": "Karime Montes-Escobar, Javier De la Hoz-M, Mónica Daniela Barreiro-Linzán, Carolina Fonseca-Restrepo, Miguel Ángel Lapo-Palacios, Douglas Andrés Verduga-Alcívar, Carlos Alfredo Salas-Macias",
        "published": "2023-5-11",
        "citations": 2,
        "abstract": "Background: There is an immense debate about the factors that could limit the adoption of agroforestry systems. However, one of the most important is the generation of scientific information that supports the viability and benefits of the proposed techniques. Statistical analysis: This work used the Latent Dirichlet Allocation (LDA) modeling method to identify and interpret scientific information on topics in relation to existing categories in a set of documents. It also used the HJ-Biplot method to determine the relationship between the analyzed topics, taking into consideration the years under study. Results: A review of the literature was conducted in this study and a total of 9794 abstracts of scientific articles published between 1993 and 2022 were obtained. The United States, India, Brazil, the United Kingdom, and Germany were the five countries that published the largest number of studies about agroforestry, particularly soil organic carbon, which was the most studied case. The five more frequently studied topics were: soil organic carbon, adoption of agroforestry practices, biodiversity, climatic change global policies, and carbon and climatic change. Conclusion: the LDA and HJ-Biplot statistical methods are useful tools for determining topicality in text analysis in agroforestry and related topics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11102250"
    },
    {
        "id": 19551,
        "title": "Evaluating the Coverage and Depth of Latent Dirichlet Allocation Topic Model in Comparison with Human Coding of Qualitative Data: The Case of Education Research",
        "authors": "Gaurav Nanda, Aparajita Jaiswal, Hugo Castellanos, Yuzhe Zhou, Alex Choi, Alejandra J. Magana",
        "published": "2023-5-14",
        "citations": 3,
        "abstract": "Fields in the social sciences, such as education research, have started to expand the use of computer-based research methods to supplement traditional research approaches. Natural language processing techniques, such as topic modeling, may support qualitative data analysis by providing early categories that researchers may interpret and refine. This study contributes to this body of research and answers the following research questions: (RQ1) What is the relative coverage of the latent Dirichlet allocation (LDA) topic model and human coding in terms of the breadth of the topics/themes extracted from the text collection? (RQ2) What is the relative depth or level of detail among identified topics using LDA topic models and human coding approaches? A dataset of student reflections was qualitatively analyzed using LDA topic modeling and human coding approaches, and the results were compared. The findings suggest that topic models can provide reliable coverage and depth of themes present in a textual collection comparable to human coding but require manual interpretation of topics. The breadth and depth of human coding output is heavily dependent on the expertise of coders and the size of the collection; these factors are better handled in the topic modeling approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5020029"
    },
    {
        "id": 19552,
        "title": "A study on urban flood damage topic model through news article text mining and latent Dirichlet allocation",
        "authors": "Dasom Hur, Jae-Eun Yoo, Se-Jin Jeung, Seung-Kwon Jung",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7465/jkdi.2023.34.2.315"
    },
    {
        "id": 19553,
        "title": "Multilabel Clustering Analysis of the Croatian-English Parallel Corpus Based on Latent Dirichlet Allocation Algorithm",
        "authors": "Erzsébet Tóth, Zoltán Gál",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/coginfocom59411.2023.10397493"
    },
    {
        "id": 19554,
        "title": "Latent Dirichlet Allocation for Uncovering Fraud Cases on Twitter",
        "authors": "Sallu Muharomah, Chanifah Indah Ratnasari",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "Fraud is a phenomenon that continues to exist in society with a modus operandi that continues to evolve with the times. The mode of operation of fraud is continually evolving with technological advancements, globalization, and consumer behavior shifts. In today's digital age, social media is important in spreading information regarding fraud. Twitter is a social media platform that is widely used. Twitter provides easy and fast access to relevant information. As a result, to raise fraud awareness, it is critical to study the mode of operation of fraud spread on social media, particularly on Twitter. The Latent Dirichlet Allocation (LDA) approach is used in this work to classify and identify fraud issues often addressed by Indonesian Twitter users. By applying LDA modeling, this study aims to understand more comprehensively the fraudulent topics that often appear on Twitter. The research found that seven fraud topics are most commonly discussed by Twitter users in Indonesia, with the highest cohesion value of 0.491899.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34288/jri.v5i3.551"
    },
    {
        "id": 19555,
        "title": "Latent Dirichlet Allocation for the Detection of Multi-Stage Attacks",
        "authors": "Moemedi Lefoane, Ibrahim Ghafir, Sohag Kabir, Irfan-Ullah Awan",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acit58888.2023.10453849"
    },
    {
        "id": 19556,
        "title": "Latent Dirichlet Allocation for Uncovering Fraud Cases on Twitter",
        "authors": "Sallu Muharomah, Chanifah Indah Ratnasari",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "Fraud is a phenomenon that continues to exist in society with a modus operandi that continues to evolve with the times. The mode of operation of fraud is continually evolving with technological advancements, globalization, and consumer behavior shifts. In today's digital age, social media is important in spreading information regarding fraud. Twitter is a social media platform that is widely used. Twitter provides easy and fast access to relevant information. As a result, to raise fraud awareness, it is critical to study the mode of operation of fraud spread on social media, particularly on Twitter. The Latent Dirichlet Allocation (LDA) approach is used in this work to classify and identify fraud issues often addressed by Indonesian Twitter users. By applying LDA modeling, this study aims to understand more comprehensively the fraudulent topics that often appear on Twitter. The research found that seven fraud topics are most commonly discussed by Twitter users in Indonesia, with the highest cohesion value of 0.491899.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34288/jri.v5i3.227"
    },
    {
        "id": 19557,
        "title": "Feedback Analysis of Learning Evaluation Applications using Latent Dirichlet Allocation",
        "authors": "Ibnu Daqiqil Id, Rahmad Kurniawan",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icvee59738.2023.10348307"
    },
    {
        "id": 19558,
        "title": "Big topic modeling based on a two-level hierarchical latent Beta-Liouville allocation for large-scale data and parameter streaming",
        "authors": "Koffi Eddy Ihou, Nizar Bouguila",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-024-01213-y"
    },
    {
        "id": 19559,
        "title": "A Comparison of Latent Semantic Analysis and Latent Dirichlet Allocation in Educational Measurement",
        "authors": "Jordan M. Wheeler, Allan S. Cohen, Shiyu Wang",
        "published": "2023-11-27",
        "citations": 1,
        "abstract": " Topic models are mathematical and statistical models used to analyze textual data. The objective of topic models is to gain information about the latent semantic space of a set of related textual data. The semantic space of a set of textual data contains the relationship between documents and words and how they are used. Topic models are becoming more common in educational measurement research as a method for analyzing students’ responses to constructed-response items. Two popular topic models are latent semantic analysis (LSA) and latent Dirichlet allocation (LDA). LSA uses linear algebra techniques, whereas LDA uses an assumed statistical model and generative process. In educational measurement, LSA is often used in algorithmic scoring of essays due to its high reliability and agreement with human raters. LDA is often used as a supplemental analysis to gain additional information about students, such as their thinking and reasoning. This article reviews and compares the LSA and LDA topic models. This article also introduces a methodology for comparing the semantic spaces obtained by the two models and uses a simulation study to investigate their similarities. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/10769986231209446"
    },
    {
        "id": 19560,
        "title": "Exploring Satisfaction Level of Customers in Restaurants by Using Latent Dirichlet Allocation(LDA) Algorithm",
        "authors": "Sona Karmakar, N Sivakumar, Anitha S Pillai",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134169"
    },
    {
        "id": 19561,
        "title": "latent Dirichlet allocation method-based nowcasting approach for prediction of silver price",
        "authors": "Selin Özge Öndin, Tarık Küçükdeniz",
        "published": "2023",
        "citations": 2,
        "abstract": "Silver is a metal that offers significant value to both investors and companies. The purpose of this study is to make an estimation of the price of silver. While making this estimation, it is planned to include the frequency of searches on Google Trends for the words that affect the silver price. Thus, it is aimed to obtain a more accurate estimate. First, using the Latent Dirichlet Allocation method, the keywords to be analyzed in Google Trends were collected from various articles on the Internet. Mining data from Google Trends combined with the information obtained by LDA is the new approach this study took, to predict the price of silver. No study has been found in the literature that has adopted this approach to estimate the price of silver. The estimation was carried out with Random Forest Regression, Gaussian Process Regression, Support Vector Machine, Regression Trees and Artificial Neural Networks methods. In addition, ARIMA, which is one of the traditional methods that is widely used in time series analysis, was also used to benchmark the accuracy of the methodology. The best MSE ratio was obtained as 0,000227131 ± 0.0000235205 by the Regression Trees method. This score indicates that it would be a valid technique to estimate the price of \"Silver\" by using Google Trends data using the LDA method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5267/j.ac.2023.3.004"
    },
    {
        "id": 19562,
        "title": "Pemodelan Topik Keluhan Masyarakat Pasca Pandemi Menggunakan Metode Latent Dirichlet Allocation (LDA)",
        "authors": "Ika Lailia Nur Rohmatun Nazila, Dina Tri Utari",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "Transparansi informasi publik dan reformasi birokrasi yang dicanangkan oleh pemerintah untuk mewujudkan clean goverment dan  good goverment dapat diimplementasikan dengan melibatkan partisipasi masyarakat. Pengaduan, kritik, dan saran  dari masyarakat kepada pemerintah terkait pelayanan publik yang tidak standar, menyimpang atau tidak teratur perlu diperhatikan untuk evaluasi di masa depan.  Seiring perkembangan teknologi, aspirasi masyarakat dapat tersampaikan melalui alat pengaduan publik yang telah dikembangkan oleh pemerintah pusat dan pemerintah daerah. Kabupaten Sleman sendiri telah memiliki sistem Lapor Sleman yang sejalan dengan Smart Regency. Ilmu matematika berperan penting dalam pemecahan masalah terkait dengan pemodelan topik yang sering dilaporkan masyarakat pada masa pasca pandemi. Oleh karena itu, tujuan penelitian ini untuk mengidentifikasi topik pengaduan masyarakat dengan algoritma Latent Dirichlet Allocation (LDA). LDA adalah suatu metode untuk pemodelan topik berdasarkan konsep probabilistik yang mencari kemiripan dalam sebuah dokumen yang kemudian dikelompokkan menjadi beberapa topik. Data yang digunakan pada penelitian ini merupakan data sekunder dari Kominfo Sleman. Tahapan penelitian diawali dengan pengambilan data, dilanjutkan dengan prepocessing data. Terdapat beberapa tahap prepocessing diantaranya case folding, remove punctuation, stopword removal, tokenizing, dan stemming. Tahap terakhir adalah topic modelling dengan algoritma LDA. Hasil analisis menunjukkan bahwa pemodelan LDA dengan 3 topik yang memiliki nilai coherence terbesar. Hasil pemodelan memberikan gambaran bahwa topik yang paling sering muncul dalam laporan pengaduan masyarakat terhadap pemerintah Sleman adalah pelayanan, jalan rusak, vaksin, dan terkait informasi yang dibutuhkan masyarakat.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21831/pspmm.v7i1.300"
    },
    {
        "id": 19563,
        "title": "PEMODELAN TOPIK TERKAIT BANJIR PADA TWITTER DENGAN MENGGUNAKAN LATENT DIRICHLET ALLOCATION",
        "authors": "MUHAMMAD SUTAN IRWANSYAH,  Muhammad Habibi, Fajar Syahruddin",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "In this background discusses the topic of tweet about Flooding on Twitter using the keyword \"Flood\". Tweet data was taken from June 1, 2021 to June 2, 2021 with the number of tweet data obtained, which was 2000 tweets. The number of tweets related to flooding has not been analyzed so that the topics contained in it are not yet known. Research . Modeling topics related to floods in Indonesia on Twitter social media with the LDA method. Research. This study uses experimental methods with several variables to test hypotheses. Then the data is processed with stages, namely web data extraction, preprocessing, feature extraction, topic modeling using latent dirichlet allocation algorithms, visualization, and analysis. Research. The results of the topic coherence stage were carried out a search for the most optimal topic from the 20 topics that had been determined at the beginning. The results of topic coherence for 20 topics concluded that for topic 10 it has a total topic value of 0.41 and has an ideal topic modeling result and is in accordance with the provisions. Conclusion : Based on the results of the discussion of topic coherence, it can be concluded that the most ideal number of topics is topic 10 because it has the highest value compared to other topics. The advice here is to be able to display or get flood information in Indonesia in real time and accurately.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30989/teknomatika.v16i1.1139"
    },
    {
        "id": 19564,
        "title": "An integrated latent Dirichlet allocation and Word2vec method for generating the topic evolution of mental models from global to local",
        "authors": "Jian Ma, Lei Wang, Yuan-Rong Zhang, Wei Yuan, Wei Guo",
        "published": "2023-2",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118695"
    },
    {
        "id": 19565,
        "title": "Pemodelan Topik Latent Dirichlet Allocation Buat Informasi Saham",
        "authors": "Ekka Pujo Ariesanto Akhmad, Carlos Lazaro Prawirosastro, Budi Priyono",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Penanam modal mendapatkan data ataupun informasi saham melalui halaman web Bursa Efek Indonesia. Penanam modal kadangkala memperoleh data lain mengenai analisa saham serta perkiraan saham yang profitabel dari laman website informasi online. Tetapi, penanam modal membutuhkan durasi buat memastikan topik yang kerap timbul serta jadi pembicaraan hangat pada informasi saham. Oleh sebab itu, pemodelan topik dibutuhkan buat inti informasi saham online. Tujuan riset ini merupakan pemodelan topik dicoba buat menganalisa topik- topik yang lagi diulas pada laman website informasi saham online. Informasi riset digabungkan sebesar 181 informasi saham sepanjang bulan Februari sampai Juli 2021 dari web kontan.co.id. Pemodelan topik dicoba dengan tata cara Latent Dirichlet Allocation. Pemodelan topik menciptakan 3 kelompok penting serta penyaluran 10 kata pembuat masing- masing topik dari informasi saham online. Penggambaran pemodelan topik menciptakan catatan tiga puluh kata yang sering muncul dari masing- masing topik.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30649/japk.v14i1.98"
    },
    {
        "id": 19566,
        "title": "Exploring Blockchain Research in Supply Chain Management: A Latent Dirichlet Allocation-Driven Systematic Review",
        "authors": "Abderahman Rejeb, Karim Rejeb, Steve Simske, John G. Keogh",
        "published": "2023-10-12",
        "citations": 6,
        "abstract": "Blockchain technology has emerged as a tool with the potential to enhance transparency, trust, security, and decentralization in supply chain management (SCM). This study presents a comprehensive review of the interplay between blockchain technology and SCM. By analyzing an extensive dataset of 943 articles, our exploration utilizes the Latent Dirichlet Allocation (LDA) method to delve deep into the thematic structure of the discourse. This investigation revealed ten central topics ranging from blockchain’s transformative role in supply chain finance and e-commerce operations to its application in specialized areas, such as the halal food supply chain and humanitarian contexts. Particularly pronounced were discussions on the challenges and transformations of blockchain integration in supply chains and its impact on pricing strategies and decision-making. Visualization tools, including PyLDAvis, further illuminated the interconnectedness of these themes, highlighting the intertwined nature of blockchain adoption challenges with aspects such as traceability and pricing. Despite the breadth of topics covered, the paper acknowledges its limitations due to the fast-evolving nature of blockchain developments during and after our analysis period. Ultimately, this review provides a holistic academic snapshot, emphasizing both well-developed and nascent research areas and guiding future research in the evolving domain of blockchain in SCM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14100557"
    },
    {
        "id": 19567,
        "title": "Latent Dirichlet Allocation Utilization as a Text Mining Method to Elaborate Learning Effectiveness",
        "authors": "Rudiman Rudiman, Netri Alia Rahmi",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "Learning method is a way to explain the lesson materials to students so that the learning process can occur in students as an effort to achieve the goals. Learning methods can be said to be a success if students are active, both physically, mentally, and socially in the learning process, in addition to showing high enthusiasm for learning and having self-confidence. The purpose of this study is to classify the opinions of Indonesian students regarding the existing learning methods and what learning methods they expected.  In order to evaluate existing learning methods using the latent dirichlet allocation method. The data used comes from tweets of Twitter users within the range of January to March 2022. The data is taken using the scrapping method through the help of the python twisel library and totaled to 3778 data, then preprocessed through the nltk and Sastrawi libraries. The results of this analysis stated that student opinions can be classified into 3 major topics which state students' opinions regarding effective learning methods, student difficulties in applicable learning methods, and high cross-departmental interest.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30650/jse.v1i1.3680"
    },
    {
        "id": 19568,
        "title": "Latent Dirichlet Allocation (LDA) Approximation Analysis of Financial-Related Text Messages",
        "authors": "JANKOVA ZUZANA",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24818/18423264/57.1.23.17"
    },
    {
        "id": 19569,
        "title": "Using Latent Dirichlet Allocation to Explore the Dimensionality of the U.S. Practice of Law",
        "authors": "Patrick H. Gaughan, En Cheng, Taylor C. Burgess, Aine C. Bolton",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "Over the centuries, the U.S. practice of law has evolved into a complex and amorphous profession. To facilitate improved analysis and understanding, this exploratory study seeks to partition law practice areas into meaningful subgroups. The study applies Latent Dirichlet Allocation (“LDA”) as a soft clustering method to 437,210 individual U.S. lawyer profiles in private practice in 2000. The profiles came from a nationally recognized directory. The resulting subgroupings contain terms consistent with the hypothesized relationships. The results also suggest the possibility of systematically binning individual practice areas into discrete practice area distributions. As such, this study makes contributions to the existing literature in at least three areas: 1) it provides support for the existence of the hypothesized law practice relationships; 2) it provides an empirical basis for developing an improved measurement of the U.S. practice of law; and 3) this study also suggests additional research to advance the field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140204"
    },
    {
        "id": 19570,
        "title": "Exploring Latent Dirichlet Allocation (LDA) in Topic Modeling: Theory, Applications, and Future Directions",
        "authors": "Ugorji C. Calistus,  , Moses O. Onyesolu, Asogwa C. Doris, Chukwudumebi V. Egwu,  ,  ,  ",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "In an era dominated by an unprecedented deluge of textual information, the need for effective methods to make sense of large datasets is more pressing than ever. This article takes a pragmatic approach to unraveling the intricacies of topic modeling, with a specific focus on the widely used Latent Dirichlet Allocation (LDA) algorithm. The initial segment of the article lays the groundwork by exploring the practical relevance of topic modeling in real-world scenarios. It addresses the everyday challenges faced by researchers and professionals dealing with vast amounts of unstructured text, emphasizing the potential of topic modeling to distill meaningful insights from seemingly chaotic data. Moving beyond theoretical abstraction, the article then delves into the mechanics of Latent Dirichlet Allocation. Developed in 2003 by Blei, Ng, and Jordan, LDA provides a probabilistic framework to identify latent topics within documents. The article takes a step-by-step approach to demystify LDA, offering a practical understanding of its components and the Bayesian principles governing its operation. A significant portion of the article is dedicated to the practical implementation of LDA. It provides insights into preprocessing steps, parameter tuning, and model evaluation, offering readers a hands-on guide to applying LDA in their own projects. Real-world examples and case studies showcase how LDA can be a valuable tool for tasks such as document clustering, topic summarization, and sentiment analysis. However, the journey through LDA is not without challenges, and the article candidly addresses these hurdles. Topics such as determining the optimal number of topics, the sensitivity of results to parameter settings, and the interpretability of outcomes are discussed. This realistic appraisal adds depth to the article, helping readers navigate the nuances and potential pitfalls of employing LDA in practice. Beyond the technical intricacies, the article explores the broad spectrum of applications where LDA has proven its efficacy. From text mining and information retrieval to social network analysis and healthcare informatics, LDA has left an indelible mark on diverse domains. Through practical examples, the article illustrates how LDA can be adapted to different contexts, showcasing its versatility as a tool for uncovering latent patterns. Keywords: Topic Modeling, Latent Dirichlet Allocation, Text Mining, Natural Language Processing, Document Clustering, Bayesian Inference.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59298/nijep/2024/41916.1.1100"
    },
    {
        "id": 19571,
        "title": "Latent Dirichlet Allocation Model for plurilingual Language Opinion Classification in Social media",
        "authors": "Aarthi B, Balika J Chelliah",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rmkmate59243.2023.10369063"
    },
    {
        "id": 19572,
        "title": "Improving the term weighting log entropy of latent dirichlet allocation",
        "authors": "Muhammad Muhajir, Dedi Rosadi, Danardono Danardono",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "<p class=\"AbstractText\">The process of analyzing textual data involves the utilization of topic modeling techniques to uncover latent subjects within documents. The presence of numerous short texts in the Indonesian language poses additional challenges in the field of topic modeling. This study presents a substantial enhancement to the term weighting log entropy (TWLE) approach within the latent dirichlet allocation (LDA) framework, specifically tailored for topic modeling of Indonesian short texts. This work places significant emphasis on the utilization of LDA for word weighting. The research endeavor aimed to enhance the coherence and interpretability of an Indonesian topic model through the integration of local and global weights. Local Weight focuses on the distinct characteristics of each document, whereas global weight examines the broader perspective of the entire corpus of documents. The objective was to enhance the effectiveness of LDA themes by this amalgamation. The TWLE model of LDA was found to be more informative and effective than the TF-IDF LDA when compared with short Indonesian text. This work improves topic modeling in brief Indonesian compositions. Transfer learning for NLP and Indonesian language adaptation helps improve subject analysis knowledge and precision, this could boost NLP and topic modeling in Indonesian.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v34.i1.pp455-462"
    },
    {
        "id": 19573,
        "title": "A Latent Dirichlet Allocation-Based Model for Mining Texts in China's Intelligent Elderly Care Policy",
        "authors": "Zhenyu Zhao, Xiang Xie, Zhongliang Guan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise-ie60962.2023.10456473"
    },
    {
        "id": 19574,
        "title": "ANALISIS TREN KONTEN PADA VTUBER INDONESIA MENGGUNAKAN LATENT DIRICHLET ALLOCATION",
        "authors": " Akdeas Oktanae Widodo, Farhan Septiadi,  Nur Aini Rakhmawati",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "YouTube merupakan bukti dari perkembangan teknologi digital terbaru dalam bidang media dan hiburan. Tidak semua youtuber atau orang yang membuat konten video di YouTube melakukan ekspresi diri secara langsung, ada yang menggunakan perantara karakter virtual dua dimensi atau tiga dimensi yang dibuat dengan bantuan perangkat lunak computer untuk berinteraksi dengan penonton yang kedepannya biasa disebut sebagai Virtual Youtuber (VTuber). Tren vtuber ini mulai terkenal pada tahun 2016 di jepang  makin tahun makin meningkat diseluruh dunia, Kemudian Semakin banyak orang-orang menyukai konten yang dibawakan oleh Vtuber dan tidak sedikit yang tertarik untuk menjadi bagian dari vtuber juga. Untuk membantu hal tersebut penelitian ini membantu untuk mengetahui topik konten yang ditayangkan oleh Vtuber Terkenal menggunakan metode Latent Dirichlet Allocation (LDA). Analisis dilakukan setelah menjalankan proses text mining terhadap 4312 video dari 10 channel vtuber Indonesia teratas. Penentuan topik yang optimal dari LDA yang diterapkan dapat melihat hasil nilai perplexity dan topic coherence. Dari implementasi metode LDA didapatkan hasil berupa lima topik yang sering ditayangkan oleh vtuber antara lain gim Minecraft dan reading donation, gim Apex Legend disertai collaboration dengan vtuber lain, tayangan siaran langsung video game,  cover dari lagu penyanyi lain dan terakhir tayangan gim multiplayer lain seperti Raft atau Phasmophobia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36595/jire.v6i1.718"
    },
    {
        "id": 19575,
        "title": "Public Opinion Mining on Construction Health and Safety: Latent Dirichlet Allocation Approach",
        "authors": "Liyun Zeng, Rita Yi Man Li, Tan Yigitcanlar, Huiling Zeng",
        "published": "2023-3-31",
        "citations": 7,
        "abstract": "The construction industry has been experiencing many occupational accidents as working on construction sites is dangerous. To reduce the likelihood of accidents, construction companies share the latest construction health and safety news and information on social media. While research studies in recent years have explored the perceptions towards these companies’ social media pages, there are no big data analytic studies conducted on Instagram about construction health and safety. This study aims to consolidate public perceptions of construction health and safety by analyzing Instagram posts. The study adopted a big data analytics approach involving visual, content, user, and sentiment analyses of Instagram posts (n = 17,835). The study adopted the Latent Dirichlet Allocation, a kind of machine learning approach for generative probabilistic topic extraction, and the five most mentioned topics were: (a) training service, (b) team management, (c) training organization, (d) workers’ work and family, and (e) users’ action. Besides, the Jaccard coefficient co-occurrence cluster analysis revealed: (a) the most mentioned collocations were ‘construction safety week’, ‘safety first’, and ‘construction team’, (b) the largest clusters were ‘safety training’, ‘occupational health and safety administration’, and ‘health and safety environment’, (c) the most active users were ‘Parallel Consultancy Ltd.’, ‘Pike Consulting Group’, and ‘Global Training Canada’, and (d) positive sentiment accounted for an overwhelming figure of 85%. The findings inform the industry on public perceptions that help create awareness and develop preventative measures for increased health and safety and decreased incidents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13040927"
    },
    {
        "id": 19576,
        "title": "Analyzing ESG News Articles and Research Papers through LDA (Latent Dirichlet Allocation)",
        "authors": "Shi Bowen, Yunkyung Min",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47116/apjcri.2023.08.07"
    },
    {
        "id": 19577,
        "title": "Predicting Drug Review Polarity Using the Combination Model of Multi-Sense Word Embedding and Fuzzy Latent Dirichlet Allocation (FLDA)",
        "authors": "Siyue Song, Anju P. Johnson",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3326757"
    },
    {
        "id": 19578,
        "title": "A Modified Latent Dirichlet Allocation Topic Approach for Driving Style Exploration Using Large-Scale Ride-Hailing GPS Data",
        "authors": "Ye Li, Yiqi Chen, Jie Bao, Lu Xing, Jinjun Tang, Changyin Dong, Ruifeng Gu",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "Driving style identification is of vital importance for intelligent driving system design and urban traffic management. This study aims to identify and analyze driving styles using large-scale ride-hailing GPS data taking different time periods, traffic, and weather conditions into account. The large-scale GPS data are collected and preprocessed, and then, the k-means clustering is implemented to acquire driving behavior. The modified latent Dirichlet allocation topic approach is applied to extract the driving states as the latent variables behind driving behaviors and finally recognize driving styles. The results show that driving styles are composed of five driving states with different probability combinations. Different driving styles in different situations are further analyzed and compared. When considering the impact of peak periods on the driving style, it indicates that styles tend to be conservative in the morning peak, free and dispersed in the evening peak, and diverse in the off-peak hours. While comparing styles regarding the influence of workdays, drivers act more cautiously and conservatively on weekdays but freer on weekends without the pressure of peak hours. The weather factor is also explored and rainy days are verified to be the resistance of driving so that most drivers become cautious and conservative. Finally, two aberrant driving styles are discovered and countermeasures are suggested to improve traffic safety.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/3203065"
    },
    {
        "id": 19579,
        "title": "Improving Aspect-Based Sentiment Analysis for Hotel Reviews with Latent Dirichlet Allocation and Machine Learning Algorithms",
        "authors": "Nuraisa Novia Hidayati",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "The rapid expansion of online platforms has resulted in a deluge of user-generated content, emphasizing the need for sentiment analysis to gauge public opinion. Aspect-based sentiment analysis is now essential for uncovering intricate opinions within product reviews, social media posts, and online texts. Despite their potential, the complexity of human emotions and diverse language nuances pose significant challenges. Our study focuses on the importance and trends of sentiment and aspect-based sentiment analysis in automated review analysis, with a primary focus on Indonesian-language hotel reviews. Our research underscores the need for nuanced tools to unravel multifaceted sentiments. We propose an automation framework that utilizes Latent Dirichlet Allocation (LDA) for feature extraction. We evaluate LDA's performance, enhance it through filtration, and enrich it by integrating it with Word2Vec and Doc2Vec. Our methodology encompasses various machine learning algorithms, including Logistic Regression (LR), Stochastic Gradient Descent (SGD), Support Vector Machine (SVM), Random Forest (RF), and Light Gradient Boosting Machine (LGBM). Empirical results reveal that the optimal combination involves LDA bigram and Word2Vec, alongside the LGBM classifier, yielding an average F1 score of 86.6 across ten aspects. This contribution advances automated aspect-based sentiment analysis, offering concrete implications for e-commerce, marketing, and customer service. Our insights inform precise marketing strategies and enhance customer experiences, underscoring the research's relevance in the digital landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26594/register.v9i2.3441"
    },
    {
        "id": 19580,
        "title": "Automatic topic boundary detection via Dirichlet allocation and CUSUM statistic",
        "authors": "Won Son",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7465/jkdi.2023.34.6.927"
    },
    {
        "id": 19581,
        "title": "Data-Driven Insights into Non-Purchasing Behaviours through Latent Dirichlet Allocation: Analysing Study Material Acquisition Among University Students",
        "authors": "Moeketsi Mosia",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "The advent of technology has shifted higher education students’ educational resource acquisition from traditional printed textbooks to digital formats. This shift is underscored by recent scholarship. The current study extended the discourse on student educational resource acquisition, beyond digital preference. It offers a nuanced view of strategies encompassing digital resources and traditional methods such as library and peer borrowing. The aim of this study was to investigate non-purchasing behaviours of university students in acquiring study material. An online survey link was sent through email to all registered students in the university, out of which a total of 1500 participated – this sample included all students from the four schools. The survey sought to answer the following questions: How do you access books? Besides buying, what other strategies have you employed to access books? Data were analysed using Dirichlet allocation for topic modelling to extract the topics from participants' qualitative responses. The study’s findings reveal a complex interplay of socio-economic factors that influence student behaviour. Digital downloads emerged as a prominent strategy, indicating a reliance on online resources. However, borrowing from libraries and peers was significant, which highlights the role of social learning communities. This study contributes to the understanding of how the cost of textbooks impacts academic choices and success, emphasising the social justice implications of textbook affordability. The rise of alternative media suggests a need to reimagine educational resources. It potentially reflects a generational shift in media consumption. This study’s insights advocate for educational institutions and policymakers to reassess resource provisioning to align with the evolving landscape of higher education students’ academic resource acquisition. This will ensure equitable access to educational material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46303/jcve.2024.5"
    },
    {
        "id": 19582,
        "title": "An Integrated Approach for Product Development using Latent Dirichlet Allocation and Gradient Boosting Decision Tree Methods",
        "authors": "Tzu-Chien Wang, Ruey-Shan Guo, Chialin Chen",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ickii58656.2023.10332609"
    },
    {
        "id": 19583,
        "title": "Analyze comments on Twitter about extreme weather based on the Latent Dirichlet Allocation (LDA) approach",
        "authors": "Zilan Cao, Senyao Hu, Zheng Tao",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2655859"
    },
    {
        "id": 19584,
        "title": "Empirical identification of the chief digital officer role: A latent Dirichlet allocation approach",
        "authors": "Francesca Culasso, Beata Gavurova, Edoardo Crocco, Elisa Giacosa",
        "published": "2023-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jbusres.2022.113301"
    },
    {
        "id": 19585,
        "title": "A Latent Dirichlet Allocation Approach to Determine the Antecedents of e-Satisfaction of Smart Lighting App",
        "authors": "Anand Kumar, Pradip Kumar Bala, Rajat Kumar Behera",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10253134"
    },
    {
        "id": 19586,
        "title": "Public opinion evolution in social networks based on latent Dirichlet allocation and sentiment analysis",
        "authors": "Xiao Li, Mengjie Ling, Chenyao Luo",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011657"
    },
    {
        "id": 19587,
        "title": "Performance evaluation of Latent Dirichlet Allocation on legal documents",
        "authors": "A. O. Ogundare, A. U. Saleh, O. A. James, E. E. Ajayi, S. Gostoji",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Latent Dirichlet Allocation (LDA) is an algorithm with the capability of processing large amount of text data. In this study, the LDA is used to produce topic modelling of topic clusters from corpus of legal texts generated under 4 topics within Nigeria context Employment Contract, Election Petition, Deeds, and Articles of Incorporation. Each topic has a substantial number of articles and the LDA method proves effective in extracting topics and generating index words that are in each topic cluster. At the end of experimentation, results are compared with manually pre-annotated dataset for validation purpose and the results show high accuracy.\nThe LDA output shows optimal performance in the word indexing processing for Election Petition as all the documents annotated under the topic were accurately classified. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/52/20241322"
    },
    {
        "id": 19588,
        "title": "Knowledge discovery from the texts of Nobel Prize winners in literature: sentiment analysis and Latent Dirichlet Allocation",
        "authors": "Bilal Barış Alkan, Leyla Karakuş, Bekir Direkci",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11192-023-04783-6"
    },
    {
        "id": 19589,
        "title": "Public sentiment analysis on urban regeneration: A massive data study based on sentiment knowledge enhanced pre-training and latent Dirichlet allocation",
        "authors": "Kehao Chen, Guiyu Wei",
        "published": "2023-4-27",
        "citations": 2,
        "abstract": "\nBackground\nPublic satisfaction is the ultimate goal and an important determinant of China’s urban regeneration plan. This study is the first to use massive data to perform sentiment analysis of public comments on China’s urban regeneration.\n\n\nMethods\nPublic comments from social media, online forums, and government affairs platforms are analyzed by a combination of Natural Language Processing, Knowledge Enhanced Pre-Training, Word Cloud, and Latent Dirichlet Allocation.\n\n\nResults\n(1) Public sentiment tendency toward China’s urban regeneration was generally positive but spatiotemporal divergences were observed; (2) Temporally, public sentiment was most negative in 2020, but most positive in 2021. It has remained consistently negative in 2022, particularly after February 2022; (3) Spatially, at the provincial level, Guangdong posted the most comments and Tibet, Shanghai, Guizhou, Chongqing, and Hong Kong are provinces with highly positive sentiment. At the national level, the east and south coastal, southwestern, and western China regions are more positive, as opposed to the northeast, central, and northwest regions; (4) Topics related to Shenzhen’s renovations, development of China’s urban regeneration and complaints from residents are validly categorized and become the public’s key focus. Accordingly, governments should address spatiotemporal disparities and concerns of local residents for future development of urban regeneration.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0285175"
    },
    {
        "id": 19590,
        "title": "Latent dirichlet allocation for double clustering (LDA-DC): discovering patients phenotypes and cell populations within a single Bayesian framework",
        "authors": "Elie-Julien El Hachem, Nataliya Sokolovska, Hedi Soula",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "Abstract\nBackground\nCurrent clinical routines rely more and more on “omics” data such as flow cytometry data from host and microbiota. Cohorts variability in addition to patients’ heterogeneity and huge dimensions make it difficult to understand underlying structure of the data and decipher pathologies. Patients stratification and diagnostics from such complex data are extremely challenging. There is an acute need to develop novel statistical machine learning methods that are robust with respect to the data heterogeneity, efficient from the computational viewpoint, and can be understood by human experts.\n\nResults\nWe propose a novel approach to stratify cell-based observations within a single probabilistic framework, i.e., to extract meaningful phenotypes from both patients and cells data simultaneously. We define this problem as a double clustering problem that we tackle with the proposed approach. Our method is a practical extension of the Latent Dirichlet Allocation and is used for the Double Clustering task (LDA-DC). We first validate the method on artificial datasets, then we apply our method to two real problems of patients stratification based on cytometry and microbiota data. We observe that the LDA-DC returns clusters of patients and also clusters of cells related to patients’ conditions. We also construct a graphical representation of the results that can be easily understood by humans and are, therefore, of a big help for experts involved in pre-clinical research.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12859-023-05177-4"
    },
    {
        "id": 19591,
        "title": "Aviation Safety Mandatory Report Topic Prediction Model using\n                        Latent Dirichlet Allocation (LDA)",
        "authors": "Jun Hwan Kim, Hyunjin Paek, Sungjin Jeon, Young Jae Choi",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12985/ksaa.2023.31.3.042"
    },
    {
        "id": 19592,
        "title": "Application of Latent Dirichlet Allocation (LDA) to Identify Research Topics in Journal Publications",
        "authors": "Puji Rahayu, Alfredo Julian Saputra, Erika Nurmaida, Brian DM Hutasoit, Kraugusteeliana Kraugusteeliana",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icimcis60089.2023.10349072"
    },
    {
        "id": 19593,
        "title": "Automatic detection of relevant information, predictions and forecasts in financial news through topic modelling with Latent Dirichlet Allocation",
        "authors": "Silvia García-Méndez, Francisco de Arriba-Pérez, Ana Barros-Vila, Francisco J. González-Castaño, Enrique Costa-Montenegro",
        "published": "2023-8",
        "citations": 3,
        "abstract": "AbstractFinancial news items are unstructured sources of information that can be mined to extract knowledge for market screening applications. They are typically written by market experts who describe stock market events within the context of social, economic and political change. Manual extraction of relevant information from the continuous stream of finance-related news is cumbersome and beyond the skills of many investors, who, at most, can follow a few sources and authors. Accordingly, we focus on the analysis of financial news to identify relevant text and, within that text, forecasts and predictions. We propose a novel Natural Language Processing (nlp) system to assist investors in the detection of relevant financial events in unstructured textual sources by considering both relevance and temporality at the discursive level. Firstly, we segment the text to group together closely related text. Secondly, we apply co-reference resolution to discover internal dependencies within segments. Finally, we perform relevant topic modelling with Latent Dirichlet Allocation (lda) to separate relevant from less relevant text and then analyse the relevant text using a Machine Learning-oriented temporal approach to identify predictions and speculative statements. Our solution outperformed a rule-based baseline system. We created an experimental data set composed of 2,158 financial news items that were manually labelled by nlp researchers to evaluate our solution. Inter-agreement Alpha-reliability and accuracy values, and rouge-l results endorse its potential as a valuable tool for busy investors. The rouge-l values for the identification of relevant text and predictions/forecasts were 0.662 and 0.982, respectively. To our knowledge, this is the first work to jointly consider relevance and temporality at the discursive level. It contributes to the transfer of human associative discourse capabilities to expert systems through the combination of multi-paragraph topic segmentation and co-reference resolution to separate author expression patterns, topic modelling with lda to detect relevant text, and discursive temporality analysis to identify forecasts and predictions within this text. Our solution may have compelling applications in the financial field, including the possibility of extracting relevant statements on investment strategies to analyse authors’ reputations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-04452-4"
    },
    {
        "id": 19594,
        "title": "Pemodelan Topik Menggunakan Latent Dirichlet Allocation pada Ulasan Aplikasi PeduliLindungi",
        "authors": "Jihadul Akbar, Tamrizal A. M., Yefta Tolla, Abdulrahmat E Ahmad, Ainul Yaqin, Ema Utami",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "Pandemi covid-19 yang melanda seluruh dunia termasuk Indonesia, membutuhkan langkah-langkah pencegahan seperti penelusuran (tracing), pelacakan (tracking) dan pemberian peringatan (warning dan fencing). Salah satu langkah pencegahan yang dilakukan Pemerintah adalah melalui Keputusan Menteri Komunikasi dan Informatika Nomor 171 Tahun 2020 tentang Penetapan Aplikasi Pedulilindungi Dalam Rangka Pelaksanaan Surveilans Kesehatan Penanganan Coronavirus Disease 2019 (Covid-19), menetapkan aplikasi Pedulilindungi sebagai aplikasi surveilans kesehatan penanganan COVID-19. Berbagai komentar disampaikan masyarakat terhadap aplikasi pedulilindungi termasuk melalui kolom ulasan pada playstore. Pada penelitian ini akan dilakukan pemodelan topik menggunakan LDA terhadap ulasan masyarakat tentang aplikasi pedulilindungi. Jumlah data yang digunakan pada penelitian ini sebanyak 13.731 data yang didapatkan dengan melakukan scraping pada google play mulai tanggal 15 september s/d 6 desember 2021 menggunakan library google scrapping. Langkah-langkah yang dilakukan dalam penelitian ini adalah preprocessing dataset, melakukan proses word2vec, menghitung nilai coherence dan melakukan pemodelan topik. Berdasarkan perhitungan nilai coherence pembagian jumlah topik yang ideal adalah 5, kemudian setelah diproses menggunakan algoritma LDA kesimpulan dari ke 5 topik tersebut didefinisikan sebagai kendala pendaftaran, sertifikat vaksin, tanggal lahir yang tidak sesuai, kendala membuka aplikasi dan keluhan pengguna aplikasi.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22441/incomtech.v13i1.15572"
    },
    {
        "id": 19595,
        "title": "Education hubs in Qatar and the United Arab Emirates: Analysis of discursive constructions using Latent Dirichlet Allocation",
        "authors": "Edmund Adam, Neil Adam",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijedudev.2024.103034"
    },
    {
        "id": 19596,
        "title": "IMPROVING ONLINE MEETING EFFICIENCY USING LATENT DIRICHLET ALLOCATION (LDA) AND SOCIAL NETWORK ANALYSIS (SNA) METHODS",
        "authors": "Megananda Hervita Permata Sari, Utomo Budiyanto",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "The pandemic period can change the habits of a person and organization, where all meetings are not held face-to-face/offline but virtually, so it is not uncommon for meetings to be attended by employees who are not Persons in Charge (PIC) on certain meeting topics. This study aims to identify trends in time, day, and duration of meetings within the Secretariat General of the Ministry of Finance and to cluster meeting matters into several themes so that further identification can be carried out to provide recommendations for units having duties related to the meeting using networking analysis. This study uses the Natural Language Processing (NLP) method with Latent Dirichlet Allocation (LDA) which can conclude the factors that represent topics to produce topic clustering and Social Network Analysis (SNA) modeling using the Degree Centrality method to find out the closest relationship between topics and names. unit based on the highest centrality value and the possibility of a unit attending a meeting that discusses a particular topic. Data used in this reseacrh are meetings held during April 2020 up to April 2022 with 59,891 data records. The modeling results shows clustering result dashboard based on meeting topics and  to produce an analysis of which meeting topics are often discussed and become a concern. The results of the research are expected to be used to provide recommendations to unit leaders to assign meeting dispositions for each PIC to attend the meeting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.3.751"
    },
    {
        "id": 19597,
        "title": "Utilizing Latent Dirichlet Allocation for Analyzing Topics in Undergraduate Theses",
        "authors": "Bambang Sugiantoro, Achmad Ibrahim Humam, Norma Latif Fitriyani, Ganjar Alfian, Muhammad Rifqi Maarif, Muhammad Syafrudin",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitacee58587.2023.10277046"
    },
    {
        "id": 19598,
        "title": "Uncovering the themes and trends in crowdfunding research using Latent Dirichlet Allocation",
        "authors": "Abderahman Rejeb, Karim Rejeb, Andrea Appolloni, Horst Treiblmaier, Mohammad Iranmanesh",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "AbstractCrowdfunding (CF) has become a significant force in the entrepreneurial landscape, offering an innovative alternative to traditional financing channels for startups and projects. As the field expands, it is crucial to systematically analyze the existing literature to identify key themes, patterns, and emerging areas of interest. To achieve this goal, this study investigates the CF literature using latent Dirichlet allocation (LDA)-based topic modeling based on 1,678 publications extracted from the Scopus database. The review reveals significant growth in CF research, with top journals spanning diverse disciplines. Eight main topics are identified, including CF campaign success and financing, donation-based CF, social effects of CF, entrepreneurial projects and rewards in CF, financial and fintech aspects of CF, CF project success and performance, P2P lending models and credit risk assessment, and equity CF and venture capital. Several research directions are suggested for each topic to advance the CF field. The theoretical and practical implications are also discussed. To the authors’ best knowledge, this study represents the first systematic analysis of the CF literature using the LDA approach, offering a comprehensive and up-to-date overview of this field and highlighting emerging areas of interest and potential research directions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11301-024-00427-y"
    },
    {
        "id": 19599,
        "title": "Sentiments prediction and thematic analysis for diabetes mobile apps using Embedded Deep Neural Networks and Latent Dirichlet Allocation",
        "authors": "Chinedu I. Ossai, Nilmini Wickramasinghe",
        "published": "2023-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.artmed.2023.102509"
    },
    {
        "id": 19600,
        "title": "Parallel inference for cross-collection latent generalized Dirichlet allocation model and applications",
        "authors": "Zhiwen Luo, Manar Amayri, Wentao Fan, Koffi Eddy Ihou, Nizar Bouguila",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121720"
    },
    {
        "id": 19601,
        "title": "A Latent Dirichlet Allocation (LDA) Semantic Text Analytics Approach to Explore Topical Features in Charity Crowdfunding Campaigns",
        "authors": "Prathamesh Muzumdar, George Kurian, Ganga Prasad Basyal",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "Crowdfunding in the realm of the Social Web has received substantial attention, with prior research examining various aspects of campaigns, including project objectives, durations, and influential project categories for successful fundraising. These factors are crucial for entrepreneurs seeking donor support. However, the terrain of charity crowdfunding within the Social Web remains relatively unexplored, lacking comprehension of the motivations driving donations that often lack concrete reciprocation. Distinct from conventional crowdfunding that offers tangible returns, charity crowdfunding relies on intangible rewards like tax advantages, recognition posts, or advisory roles. Such details are often embedded within campaign narratives, yet, the analysis of textual content in charity crowdfunding is limited. This study introduces an inventive text analytics framework, utilizing Latent Dirichlet Allocation (LDA) to extract latent themes from textual descriptions of charity campaigns. The study has explored four different themes, two each in campaign and incentive descriptions. Campaign description’s themes are focused on child and elderly health mainly the ones who are diagnosed with terminal diseases. Incentive description’s themes are based on tax benefits, certificates, and appreciation posts. These themes, combined with numerical parameters, predict campaign success. The study was successful in using Random Forest Classifier to predict success of the campaign using both thematic and numerical parameters. The study distinguishes thematic categories, particularly medical need-based charity and general causes, based on project and incentive descriptions. In conclusion, this research bridges the gap by showcasing topic modelling utility in uncharted charity crowdfunding domains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ajeba/2024/v24i11207"
    },
    {
        "id": 19602,
        "title": "Automated decision classification model for tax appeals commission in Morocco using latent dirichlet allocation",
        "authors": "Soufiane Aouichaty, Yassine Maleh, Abdelmajid Hajami, Hakim Allali",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "<p>This research paper focuses on extracting and classifying information from the Moroccan National Tax Appeals Commission, which is presently nonexistent in the country's legal and tax landscape. This study examines 201 decisions selected from a pool of 562, released between 1999 and 2018, pertaining to corporate tax and involving 550 disputes spanning various corporate tax classifications. The paper aims to propose latent dirichlet allocation (LDA) for topic modeling and compare it with our previous results obtained from the bidirectional encoder representations from transformers (BERT) model. The findings suggest that the rulings can be classified into two primary classifications: those that uphold or reject the tax administration's position. The proposed model shows a good performance, achieving a precision of 9.25% and an accuracy of 9.51%. This highlights the effectiveness of both LDA and BERT models for understanding and classifying topics in tax decision analysis.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v31.i3.pp1811-1820"
    },
    {
        "id": 19603,
        "title": "Supply chain research overview from the early eighties to Covid era – Big data approach based on Latent Dirichlet Allocation",
        "authors": "Peter Madzík, Lukáš Falát, Dominik Zimon",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cie.2023.109520"
    },
    {
        "id": 19604,
        "title": "The Latent Dirichlet Allocation (LDA) generative model for automating process of rendering judicial decisions",
        "authors": "Petr Pylov, Roman Maitak, Andrey Protodyakonov",
        "published": "2023",
        "citations": 0,
        "abstract": "The Latent Dirichlet Allocation (LDA) generative model is widely used in statistical analysis and machine learning due to its ability to model the probabilities of multidimensional categorical data, such as the frequencies of different categories or the probability distribution across multiple categories. This article explores the potential application of the LDA model for the practical task of topic separation in documents related to judicial proceedings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202343105005"
    },
    {
        "id": 19605,
        "title": "Multisubject Analysis and Classification of Books and Book Collections, Based on a Subject Term Vocabulary and the Latent Dirichlet Allocation",
        "authors": "Nikolaos Makris, Nikolaos Mitrou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3326722"
    },
    {
        "id": 19606,
        "title": "Pengelompokan Publikasi Ilmiah Berdasarkan Bidang  Kepakaran Menggunakan Latent Dirichlet Allocation dan Normalized PSO-K-means",
        "authors": "Fina Charisma Hayatina, Sony Hartono Wijaya, Medria Kusuma Dewi Hardhienata",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Salah satu cara untuk memvalidasi klaim kepakaran dosen adalah dengan meninjau dokumen publikasi ilmiah yang tersedia. Namun, menentukan kelompok kepakaran dari sejumlah dokumen memerlukan pengetahuan yang memadai dan waktu yang relatif lama, sehingga menjadi sulit dilakukan. Penelitian ini bertujuan untuk membangun suatu model yang dapat mengelompokkan dokumen berdasarkan bidang kepakaran. Penelitian ini menggunakan algoritma klasterisasi K-means untuk mengelompokkan dokumen berdasarkan bidang kepakaran dosen. Latent dirichlet allocation digunakan untuk mereduksi dimensi data, dan particle swarm optimization digunakan untuk menentukan centroid awal pada algoritma K-means. Hasil penelitian ini berhasil mengelompokkan dokumen publikasi ilmiah dengan nilai koefisien silhouette sebesar 0.42. Selain itu, penggunaan PSO sebagai penentu centroid optimal pada algoritma K-means dapat meningkatkan nilai koefisien silhouette sebesar 5.56%. Model yang dibangun dievaluasi dengan mencocokkan klaster yang dihasilkan dengan klaim yang diberikan. Hasilnya menunjukkan bahwa sebanyak 75% hasil pencocokan sesuai dan 25% tidak sesuai.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29244/jika.10.2.121-132"
    },
    {
        "id": 19607,
        "title": "Text Classification of Climate Change Tweets using Artificial Neural Networks, FastText Word Embeddings, and Latent Dirichlet Allocation",
        "authors": "John Daves S. Baguio, Billy A. Lu, Christine F. Peña",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apsit58554.2023.10201782"
    },
    {
        "id": 19608,
        "title": "A topic modeling and image classification framework: The Generalized Dirichlet variational autoencoder",
        "authors": "Akinlolu Oluwabusayo Ojo, Nizar Bouguila",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.110037"
    },
    {
        "id": 19609,
        "title": "Analisis pemodelan topik ulasan aplikasi BNI, BCA, dan BRI menggunakan latent dirichlet allocation",
        "authors": "Beny Alphon Tondang,  Muhammad Rizqan Fadhil,  Muhammad Nugraha Perdana,  Akhmad Fauzi,  Ugra Syahda Janitra",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "Teknologi telah memainkan peran penting dalam mengubah cara orang melakukan transaksi keuangan. Mobile banking merupakan salah satu bentuk teknologi yang digunakan untuk menyediakan layanan perbankan melalui perangkat mobile seperti smartphone atau tablet. Ulasan adalah bentuk pendapat atau tanggapan yang diberikan oleh individu terhadap suatu produk, layanan, atau pengalaman. Ulasan dapat berupa tulisan atau ungkapan yang disampaikan melalui media online maupun offline. Penelitian ini bertujuan untuk menganalisis hubungan antara teknologi dan mobile banking melalui pengelompokan ulasan yang diterima oleh aplikasi BNI Mobile Banking, BCA Mobile, dan BRImo menggunakan metode Latent Dirichlet Allocation (LDA). Dalam penelitian ini, ulasan diidentifikasi sebagai data yang digunakan untuk mengevaluasi kualitas layanan dari aplikasi mobile banking. Metode LDA digunakan untuk mengelompokkan ulasan ke dalam topik-topik yang mencerminkan pengalaman pengguna dengan aplikasi mobile banking. Hasil penelitian ini mengungkapkan bahwa melalui penggunaan metode Latent Dirichlet Allocation (LDA), kami berhasil mengelompokkan ulasan-ulasan yang diterima oleh aplikasi BNI Mobile Banking, BCA Mobile, dan BRImo menjadi topik-topik yang relevan dengan pengalaman pengguna dalam menggunakan layanan mobile banking. Analisis data menunjukkan adanya perbedaan dan kesamaan dalam kualitas layanan antara ketiga aplikasi tersebut. Pada BNI Mobile Banking, ditemukan tiga topik utama yaitu solusi masalah aplikasi, kelebihan transaksi, dan kepuasan pengguna. BCA Mobile Banking menunjukkan tiga topik utama yaitu kelebihan transaksi, masalah verifikasi, dan masalah saldo. Sedangkan pada BRImo, terdapat tiga topik utama yaitu pengalaman transaksi tunai, masalah transaksi, dan proses pendaftaran. Temuan ini memberikan wawasan penting tentang preferensi dan pengalaman pengguna dalam menggunakan aplikasi-aplikasi mobile banking, serta dapat digunakan untuk meningkatkan kualitas layanan dan memahami hubungan antara teknologi dan mobile banking",
        "keywords": "",
        "link": "http://dx.doi.org/10.37373/infotech.v4i1.601"
    },
    {
        "id": 19610,
        "title": "A hybrid approach for text summarization using semantic latent Dirichlet allocation and sentence concept mapping with transformer",
        "authors": "Bharathi Mohan Gurusamy, Prasanna Kumar Rengarajan, Parthasarathy Srinivasan",
        "published": "2023-12-1",
        "citations": 5,
        "abstract": "<span lang=\"EN-US\">Automatic text summarization generates a summary that contains sentences reflecting the essential and relevant information of the original documents. Extractive summarization requires semantic understanding, while abstractive summarization requires a better intermediate text representation. This paper proposes a hybrid approach for generating text summaries that combine extractive and abstractive methods. To improve the semantic understanding of the model, we propose two novel extractive methods: semantic latent Dirichlet allocation (semantic LDA) and sentence concept mapping. We then generate an intermediate summary by applying our proposed sentence ranking algorithm over the sentence concept mapping. This intermediate summary is input to a transformer-based abstractive model fine-tuned with a multi-head attention mechanism. Our experimental results demonstrate that the proposed hybrid model generates coherent summaries using the intermediate extractive summary covering semantics. As we increase the concepts and number of words in the summary the rouge scores are improved for precision and F1 scores in our proposed model.</span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i6.pp6663-6672"
    },
    {
        "id": 19611,
        "title": "Leveraging Latent Dirichlet Allocation for Feature Extraction in User Comments: Enhancements to User-Centered Design in Indonesian Financial Technology",
        "authors": "Albertus Dwiyoga Widiantoro, Mustafid Mustafid, Ridwan Sanjaya",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/isi.280530"
    },
    {
        "id": 19612,
        "title": "How open innovation specialists contribute to corporate sustainability and responsibility: A latent Dirichlet allocation approach",
        "authors": "Francesca Culasso, Elisa Giacosa, Daniele Giordino, Edoardo Crocco",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "AbstractThis study examines the job postings for open innovation (OI) specialists to determine a universal archetype of what competencies and tasks are requested from said professionals and their implications for corporate sustainability and responsibility. This research uses Bayesian statistics and latent Dirichlet allocation (LDA) topic modeling to measure multiple dimensions of the 341 sampled job postings. Our empirical findings unveil the pivotal role that OI specialists have in engaging with stakeholders and monitoring OI dynamics. Multiple dimensions are expected from OI specialists, addressing a multitude of concerns, such as the environment and technologies. Moreover, this study underlines the need for OI specialists to comprehend both internal and external stakeholders' needs. This research contributes to the literature as follows. First, it underlines the value of topic modeling analysis in job profiling research. Second, it bridges existing knowledge gaps on OI specialists' competencies and roles with empirical evidence obtained from a global dataset. Third, it outlines the current market expectations and requirements for OI specialists, which is useful to both candidates and companies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/beer.12620"
    },
    {
        "id": 19613,
        "title": "Latent Dirichlet Allocation in Public Procurement Documents Analysis for Determining Energy Efficiency Issues in Construction Works at Polish Universities",
        "authors": "Anna Pamula, Zbigniew Gontar, Beata Gontar, Tetiana Fesenko",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "This paper presents a comprehensive analysis of public procurement documents in the domain of university buildings taken from the e-procurement platform, particularly focusing on their transformation towards more efficient energy consumption. Using a corpus of the titles of the public procurement documents from 2020 to 2022, we used Latent Dirichlet Allocation (LDA) for topic modeling to understand the key thematic areas of focus. The methodology presented in this study incorporated a bifurcated approach. This two-stage procedure began with preprocessing and dictionary creation from the corpus of titles of procurement documents. Following this, the Latent Dirichlet Allocation (LDA) model was employed for topic extraction and trend analysis, thereby providing a comprehensive understanding of the thematic progression in procurement practices over time. Our analysis revealed a shift in emphasis from modernization towards the adoption of energy-saving technologies as well as a growing focus on broader sustainability initiatives. However, a less prevalent topic was adherence to cooling & heating systems, suggesting potential areas for improvement in procurement practices. These findings contribute to the growing body of knowledge on sustainable procurement in university buildings and offer valuable insight for universities to enhance their energy efficiency strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16124596"
    },
    {
        "id": 19614,
        "title": "Analisis Kepercayaan Masyarakat Tentang Kepolisian Indonesia di Twitter Menggunakan Latent Dirichlet Allocation (LDA)",
        "authors": " Bagas Dwi Santosa,  Nurul Fatimah,  Netania Indi Kusumaningtyas,  Ulfi Saidata Aesyi,  Herdiesel Santoso",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Kepolisian Negara Republik Indonesia merupakan instansi yang bertugas untuk menjaga ketertiban dan keamanan masyarakat, menerapkan hukum, memberikan perlindungan, dukungan dan layanan kepada warga negara guna menjaga stabilitas dalam negeri. Namun, ditengah peran dari kepolisian itu sendiri, justru banyak kasus yang menyeret beberapa anggota polisi. Hal tersebut yang membuat masyarakat ramai membicarakannya di sosial media, salah satunya Twitter. Bahkan tagar-tagar yang berkaitan dengan kasus lingkup kepolisian juga sempat trending di Twitter. Dari hal tersebut, maka perlu dilakukan analisis terhadap topik kepercayaan masyarakat terhadap kepolisian. Analisis yang dilakukan menggunakan Latent Dirichlet Allocation (LDA). Hasil dari analisis yang dilakukan yaitu kepercayaan masyarakat terhadap kepolisian berkurang atas banyaknya kasus yang dilakukan anggota polisi saat ini. Analisis yang dilakukan menggunakan Latent Dirichlet Allocation (LDA) mengungkapkan bahwa kepercayaan publik terhadap kepolisian telah terkikis secara signifikan akibat banyaknya kasus yang melibatkan anggota kepolisian. Kesimpulan ini didukung oleh prevalensi tagar terkait kepolisian dan diskusi di platform media sosial seperti Twitter.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30989/ijds.v1i2.1198"
    },
    {
        "id": 19615,
        "title": "Aspect Based Sentiment Analysis: Feature Extraction using Latent Dirichlet Allocation (LDA) and Term Frequency - Inverse Document Frequency (TF-IDF) in Machine Learning (ML)",
        "authors": "Shakirah Mohd Sofi, Ali Selamat",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "The growth and development of social networks, blogs, forums, and e-commerce websites has produced a number of data, notably textual data, which has increased tremendously. Twitter is one of the most popular media social platforms; during the COVID-19 pandemic, people all around the world use social media to share their opinions or concerns about the pandemic that has changed their lives. It revealed a significant rise in tweets on coronavirus, including positive, negative, and neutral tweets about the virus's impact. Sentiment analysis faces challenges: sparse data limits understanding, while topic coherence and interpretability demand improvement for clearer insights. The primary goal of this paper is to improve the accuracy and effectiveness of sentiment analysis during the COVID-19 pandemic through the application of advanced techniques and classifiers. In this article, we experiment with such Support Vector Machines (SVM) and Naive Bayes (NB) on Twitter data for high-accuracy machine learning models. Using Latent Dirichlet Allocation (LDA)for feature extraction, we aim to capture comprehensive aspects and topics for sentiment analysis. Additionally, we explore Count Vectorizer and Term Frequency - Inverse Document Frequency (TF-IDF) as word embedding techniques. The main objectives are to extract topics, understand public concerns about Covid-19, and compare classifier performance in Aspect-Based Sentiment Analysis on Covid-19 tweets. This paper introduces advanced sentiment analysis techniques, such as LDA, Count Vectorizer, and SVM, enhancing nuanced sentiment analysis during the COVID-19 pandemic with notable 85% accuracy in SVM classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53840/myjict8-2-102"
    },
    {
        "id": 19616,
        "title": "Real-Time Twitter Trends Analysis Using Latent Dirichlet Allocation and Machine Learning",
        "authors": "Ayush Ranjan,  ",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "As far as social media is concerned twitter has become a major source of public data in the form of tweets. Twitter is an emerging source of large textual data(big data).People can easily express their opinions , reviews, interests and tastes about a particular event, topic ,product  etc., occurring worldwide. This makes twitter a good source of valuable data which can be further used to perform sentiment analysis, know trending topics of public intrests and public opinion on a particular product or event which can be beneficial for business growth and political parties to know public choices and they can take actions accordingly. The extraction of meaningful insights from the vast and dynamic stream of social media data is greatly facilitated by the implementation of topic modeling and sentiment analysis on Twitter tweets. The identification of recurring themes or subjects within a collection of tweets, which is the essence of topic modeling, serves to reveal patterns in discussions, thereby aiding in the comprehension of prevalent topics and trends. Concurrently, sentiment analysis, through the evaluation of the emotional tone of tweets, enables the discernment of whether the expressed sentiments are positive, negative, or neutral. The combination of these techniques provides researchers and businesses with valuable perspectives on public opinions, emerging issues, and user sentiments, thereby empowering them to make informed decisions and develop effective engagement strategies in the ever-evolving landscape of social media. But twitter data(tweets) are unstructured ,contains noisy data, urls , stop words, re-tweets video ,emoji  etc., which need to be cleaned and preprocessed to perform proper sentiment analysis and  use it to  extract meaningful effective insights from it. This paper focuses on various methods of topic modeling and discovering latent topics ,text-mining approaches ,micro-blogging methods used in various researches .This paper focuses on latent dirichlet allocation method of topic modeling and text-mining to discover latent topics in tweets, micro-blogging ,text-mining approaches .A proper survey is done on previous researches on this topic in this article.   Keywords:-LDA, text-mining, topic modeling, micro-blogging ,machine learning ,sentiment analysis, NLP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem29198"
    },
    {
        "id": 19617,
        "title": "An interpretable single-cell RNA sequencing data clustering method based on latent Dirichlet allocation",
        "authors": "Qi Yang, Zhaochun Xu, Wenyang Zhou, Pingping Wang, Qinghua Jiang, Liran Juan",
        "published": "2023-7-20",
        "citations": 6,
        "abstract": "Abstract\nSingle-cell RNA sequencing (scRNA-seq) detects whole transcriptome signals for large amounts of individual cells and is powerful for determining cell-to-cell differences and investigating the functional characteristics of various cell types. scRNA-seq datasets are usually sparse and highly noisy. Many steps in the scRNA-seq analysis workflow, including reasonable gene selection, cell clustering and annotation, as well as discovering the underlying biological mechanisms from such datasets, are difficult. In this study, we proposed an scRNA-seq analysis method based on the latent Dirichlet allocation (LDA) model. The LDA model estimates a series of latent variables, i.e. putative functions (PFs), from the input raw cell–gene data. Thus, we incorporated the ‘cell-function-gene’ three-layer framework into scRNA-seq analysis, as this framework is capable of discovering latent and complex gene expression patterns via a built-in model approach and obtaining biologically meaningful results through a data-driven functional interpretation process. We compared our method with four classic methods on seven benchmark scRNA-seq datasets. The LDA-based method performed best in the cell clustering test in terms of both accuracy and purity. By analysing three complex public datasets, we demonstrated that our method could distinguish cell types with multiple levels of functional specialization, and precisely reconstruct cell development trajectories. Moreover, the LDA-based method accurately identified the representative PFs and the representative genes for the cell types/cell stages, enabling data-driven cell cluster annotation and functional interpretation. According to the literature, most of the previously reported marker/functionally relevant genes were recognized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bib/bbad199"
    },
    {
        "id": 19618,
        "title": "Matrix prior for data transfer between single cell data types in latent Dirichlet allocation",
        "authors": "Alan Min, Timothy Durham, Louis Gevirtzman, William Stafford Noble",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Single cell ATAC-seq (scATAC-seq) enables the mapping of regulatory elements in fine-grained cell types. Despite this advance, analysis of the resulting data is challenging, and large scale scATAC-seq data are difficult to obtain and expensive to generate. This motivates a method to leverage information from previously generated large scale scATAC-seq or scRNA-seq data to guide our analysis of new scATAC-seq datasets. We analyze scATAC-seq data using latent Dirichlet allocation (LDA), a Bayesian algorithm that was developed to model text corpora, summarizing documents as mixtures of topics defined based on the words that distinguish the documents. When applied to scATAC-seq, LDA treats cells as documents and their accessible sites as words, identifying “topics” based on the cell type-specific accessible sites in those cells. Previous work used uniform symmetric priors in LDA, but we hypothesized that nonuniform matrix priors generated from LDA models trained on existing data sets may enable improved detection of cell types in new data sets, especially if they have relatively few cells. In this work, we test this hypothesis in scATAC-seq data from whole C. elegans nematodes and SHARE-seq data from mouse skin cells. We show that nonsymmetric matrix priors for LDA improve our ability to capture cell type information from small scATAC-seq datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pcbi.1011049"
    },
    {
        "id": 19619,
        "title": "SPARRING: Sistem Rekomendasi Peneliti Terintegrasi Google Scholar via SerpAPI dan Latent Dirichlet Allocation pada Konteks Perguruan Tinggi",
        "authors": "Mochamad Nizar Palefi Ma'ady, Denny Daffa Rizaldy, Rahul Fahmi Satria, Purnama Anaking",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "The researcher partner recommendation system plays a crucial role in fostering academic collaboration in universities, where a challenge for new users is finding suitable research partners. In addressing the limitations of Naïve Bayes classifiers, this article introduces an innovative approach in the form of a non-linear sigmoid activation function. We highlight the urgency of this solution, detail its implementation steps, and describe its substantial contribution to research partner recommendations. This article not only identifies existing obstacles but also proposes revolutionary solutions to enhance the effectiveness of consultation systems in academic environments. A gap in this research is the manual input method for data retrieval, creating weaknesses, susceptibility to human errors, and reduced efficiency in collecting journal data. We propose SPARRING, a researcher recommendation system connected to Google Scholar, in the context of higher education. This approach uses a dataset of faculty members from the Faculty of Information Technology and Business at a private university in Indonesia. The results from Google Scholar extraction, with topic keywords determined by Latent Dirichlet Allocation, are then classified using the Naïve Bayes algorithm. Additionally, we integrate web scraping tools, particularly SerpAPI, to access data from Google Scholar. Through the integration of SerpAPI, the proposed web-based system is capable of providing more accurate recommendations, especially for new users with limited collaboration experience. By incorporating SerpAPI, the proposed web-based system can offer more accurate recommendations, particularly for new users without extensive collaboration experience.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26905/jtmi.v9i2.11111"
    },
    {
        "id": 19620,
        "title": "Analyzing society anti-vaccination attitudes towards COVID-19: combining latent dirichlet allocation and fuzzy association rule mining with a fuzzy cognitive map",
        "authors": "Nazmiye Eligüzel",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10700-023-09407-5"
    },
    {
        "id": 19621,
        "title": "Development of Reviewer Assignment Method with Latent Dirichlet Allocation and Link Prediction to Avoid Conflict of Interest",
        "authors": "Adi Setyo Nugroho, Ahmad Saikhu, Ratih Nur Esti Anggraini",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "The number of published academic papers has been increasing rapidly from year to year. However, this increase in publications must be linear with an emphasis on quality. To ensure that academic papers meet the required quality standard, the peer review process is necessary. The main objective of the assignment of reviewers is to find the appropriate reviewer who can conduct a review based on their field of research. However, there are potential obstacles when there is a conflict of interest in the process. This study aims to develop a method for assigning reviewers that overcomes such obstacles. Our approach involves combining the Latent Dirichlet Allocation (LDA), Classification, and Link Prediction methods. LDA is used to find topics from the research data of prospective reviewers to ensure that the assigned reviewers are well suited to the submitted article. These data were used as training data for classification using Random Forest. Finally, link prediction implemented to make reviewer recommendations. We evaluated and compared our proposed method with previous research that used cosine similarity as the last step in recommendation, using Mean Average Precision (MAP). Our proposed method achieved a MAP value of 0.87, which was an improvement compared to the previous approach. These results suggest that our approach has the potential to improve the effectiveness of academic peer review.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.29207/resti.v7i4.4900"
    },
    {
        "id": 19622,
        "title": "Understanding non-motorists' views on automated vehicle safety through Bayesian network analysis and latent dirichlet allocation",
        "authors": "Subasish Das, Abbas Sheykhfard, Jinli Liu, Md Nasim Khan",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijtst.2023.06.002"
    },
    {
        "id": 19623,
        "title": "Results and Methodological Implications of the Digital Epidemiology of Prescription Drug References Among Twitter Users: Latent Dirichlet Allocation (LDA) Analyses",
        "authors": "Maria A Parker, Danny Valdez, Varun K Rao, Katherine S Eddens, Jon Agley",
        "published": "2023-7-28",
        "citations": 2,
        "abstract": "\nBackground\nSocial media is an important information source for a growing subset of the population and can likely be leveraged to provide insight into the evolving drug overdose epidemic. Twitter can provide valuable insight into trends, colloquial information available to potential users, and how networks and interactivity might influence what people are exposed to and how they engage in communication around drug use.\n\n\nObjective\nThis exploratory study was designed to investigate the ways in which unsupervised machine learning analyses using natural language processing could identify coherent themes for tweets containing substance names.\n\n\nMethods\nThis study involved harnessing data from Twitter, including large-scale collection of brand name (N=262,607) and street name (N=204,068) prescription drug–related tweets and use of unsupervised machine learning analyses (ie, natural language processing) of collected data with data visualization to identify pertinent tweet themes. Latent Dirichlet allocation (LDA) with coherence score calculations was performed to compare brand (eg, OxyContin) and street (eg, oxys) name tweets.\n\n\nResults\nWe found people discussed drug use differently depending on whether a brand name or street name was used. Brand name categories often contained political talking points (eg, border, crime, and political handling of ongoing drug mitigation strategies). In contrast, categories containing street names occasionally referenced drug misuse, though multiple social uses for a term (eg, Sonata) muddled topic clarity.\n\n\nConclusions\nContent in the brand name corpus reflected discussion about the drug itself and less often reflected personal use. However, content in the street name corpus was notably more diverse and resisted simple LDA categorization. We speculate this may reflect effective use of slang terminology to clandestinely discuss drug-related activity. If so, straightforward analyses of digital drug-related communication may be more difficult than previously assumed. This work has the potential to be used for surveillance and detection of harmful drug use information. It also might be used for appropriate education and dissemination of information to persons engaged in drug use content on Twitter.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/48405"
    },
    {
        "id": 19624,
        "title": "Public opinion in Japanese newspaper readers’ posts under the prolonged COVID-19 infection spread 2019–2021: contents analysis using Latent Dirichlet Allocation",
        "authors": "Hideaki Kasuga, Shota Endo, Yusuke Masuishi, Tomoo Hidaka, Takeyasu Kakamu, Tetsuhito Fukushima",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "AbstractDuring the COVID-19 pandemic, information on what people are interested in and what they are disseminating can be an important public health resource. Most studies on public opinion during the pandemic have focused on social networking services in the context of the early phases of the pandemic or on a short-term basis; research on public opinion outside of social networking services that consider long-term changes has not been conducted. To examine this gap in the research, we analyzed readers’ posts on Japanese hardcopy newspaper articles in the public domain. A total of 1910 such posts published during four emergency declaration periods in Japan were included in the study. Latent Dirichlet Allocation was applied in our analysis to extract topics and Kendall rank correlation coefficients between the emergency declaration periods, and each topic was calculated to examine the effect size. We selected 10 topics and categorized them into three themes: (1) “Life” comprising “Family,” “Daily Life in the COVID-19 Disaster,” “Education in the COVID-19 Disaster,” “The Importance of Humanity,” and “Daily Life unrelated to COVID-19”; (2) “Awareness of the emergency” comprising, “Awareness of being a party to an emergency” and “Concerns about the medical environment,”; and (3) “Policy” comprising “Domestic and foreign policies,” “Opposition to hosting the Tokyo Olympics,” and “Criticisms of the Japanese Government.” This research revealed that, as a result of the exposure to COVID-19-related material over a prolonged period, awareness of the emergency decreased (r = −0.189, p < 0.000), while other topics remained. This study showed that it is possible to extract more everyday public opinion topics from the reader’s posts in newspapers and that these are issues that should be addressed from a long-term perspective since they do not change significantly in a stressful life.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1057/s41599-023-02014-0"
    },
    {
        "id": 19625,
        "title": "Supervised latent Dirichlet allocation with covariates: A Bayesian structural and measurement model of text and covariates.",
        "authors": "Kenneth Tyler Wilcox, Ross Jacobucci, Zhiyong Zhang, Brooke A. Ammerman",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/met0000541"
    },
    {
        "id": 19626,
        "title": "Analysis of pedestrian-related crossing behavior at intersections: A Latent Dirichlet Allocation approach",
        "authors": "Zhen Yang, Zhe Gong, Qiuchen Zhang, Jing Wang",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijtst.2022.12.003"
    },
    {
        "id": 19627,
        "title": "Drone Applications in Logistics and Supply Chain Management: A Systematic Review Using Latent Dirichlet Allocation",
        "authors": "Imen Zrelli, Abderahman Rejeb, Rawan Abusulaiman, Raghad AlSahafi, Karim Rejeb, Mohammad Iranmanesh",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13369-023-08681-0"
    },
    {
        "id": 19628,
        "title": "Mining meaning from online hotel reviews: identification of determinants of (dis-) satisfaction using Latent Dirichlet allocation",
        "authors": "Jelena Tepavcevic, Denis Dubover, Gojko Nikolic",
        "published": "2023",
        "citations": 0,
        "abstract": "User-generated content (UGC) is increasing, so it is critical to clearly\n   understand what customers think about the positive and negative aspects of\n   specific goods. Such information is crucial for customers as well as for\n   businesses. Online reviews are a powerful tool for a deep comprehension of\n   customer satisfaction and dissatisfaction. This research intended to\n   recognize the sources of satisfaction and dissatisfaction among business\n   travelers in city hotels in Serbia. A total of 5,596 online reviews from 120\n   city hotels in Serbia were collected. Keyword-based visualization was used\n   to display the most frequent words related to the experience during the\n   hotel stay, reflecting the satisfaction and dissatisfaction of consumers.\n   Latent Dirichlet allocation (LDA) was used for grouping positive and\n   negative reviews into various topics. Results showed that business\n   travelers' primary satisfaction sources are ?Conference facilities?,\n   ?Atmosphere?, ?Amenities?, ?Accessibility?, and ?Location?. On the other\n   hand, the sources of dissatisfaction are ?Dirtiness? and ?Internet\n   Connection?. Based on the obtained results, hotel managers can direct their\n   activities to improve the spheres that have proven to be the sources of\n   dissatisfaction for customers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2298/ijgi2303339t"
    },
    {
        "id": 19629,
        "title": "Integrating Structured and Unstructured EHR Data for Predicting Mortality by Machine Learning and Latent Dirichlet Allocation Method",
        "authors": "Chih-Chou Chiu, Chung-Min Wu, Te-Nien Chien, Ling-Jing Kao, Chengcheng Li, Chuan-Mei Chu",
        "published": "2023-2-28",
        "citations": 6,
        "abstract": "An ICU is a critical care unit that provides advanced medical support and continuous monitoring for patients with severe illnesses or injuries. Predicting the mortality rate of ICU patients can not only improve patient outcomes, but also optimize resource allocation. Many studies have attempted to create scoring systems and models that predict the mortality of ICU patients using large amounts of structured clinical data. However, unstructured clinical data recorded during patient admission, such as notes made by physicians, is often overlooked. This study used the MIMIC-III database to predict mortality in ICU patients. In the first part of the study, only eight structured variables were used, including the six basic vital signs, the GCS, and the patient’s age at admission. In the second part, unstructured predictor variables were extracted from the initial diagnosis made by physicians when the patients were admitted to the hospital and analyzed using Latent Dirichlet Allocation techniques. The structured and unstructured data were combined using machine learning methods to create a mortality risk prediction model for ICU patients. The results showed that combining structured and unstructured data improved the accuracy of the prediction of clinical outcomes in ICU patients over time. The model achieved an AUROC of 0.88, indicating accurate prediction of patient vital status. Additionally, the model was able to predict patient clinical outcomes over time, successfully identifying important variables. This study demonstrated that a small number of easily collectible structured variables, combined with unstructured data and analyzed using LDA topic modeling, can significantly improve the predictive performance of a mortality risk prediction model for ICU patients. These results suggest that initial clinical observations and diagnoses of ICU patients contain valuable information that can aid ICU medical and nursing staff in making important clinical decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ijerph20054340"
    },
    {
        "id": 19630,
        "title": "Applying Latent Dirichlet Allocation and Support Vector Regression to the Aesthetic Design of Medical Nursing Beds",
        "authors": "Bingkun Yuan, Junnan Ye, Xinying Wu, Chaoxiang Yang",
        "published": "2023-10-1",
        "citations": 2,
        "abstract": "Abstract\nWith the development of social productivity and the improvement in material living standards, emotional value has become the core driver of the enhancement of product market competitiveness. A medical nursing bed, one of the most typical types of medical devices, is designed with little attention to the emotional experience of the users. Therefore, this paper proposes an innovative perceptual design approach under the Kansei engineering (KE) framework for resource-limited and information-poor companies. It guides the aesthetic design of medical nursing beds by constructing a mapping relationship between users’ perceptual needs and the design characteristics of medical nursing beds to maximize users’ emotions. First, latent Dirichlet allocation (LDA) is used to extract usable Kansei semantics from big data, compensating for the subjectivity of traditional KE data input. Then, the design characteristics obtained after deconstructing a medical nursing bed are simplified with rough set theory (RST). Finally, a mapping model between users’ perceptual needs and the core design characteristics of nursing beds is established through support vector regression (SVR), and the optimal design solution is obtained by weighting calculation. The optimal combination of design characteristics for medical nursing beds is finally obtained. The results suggest that the design method proposed in this paper can help designers accurately grasp users’ emotional perceptions in terms of aesthetic design and scientifically guide and complete the design of new medical nursing beds, verifying the feasibility and scientificity of the proposed method in terms of aesthetic design.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/1.4062350"
    },
    {
        "id": 19631,
        "title": "Leveraging social media data using latent dirichlet  allocation and naïve bayes for mental health sentiment  analytics on Covid-19 pandemic",
        "authors": "Nurzulaikha Khalid, Shuzlina Abdul-Rahman, Wahyu Wibowo, Nur Atiqah Sia Abdullah, Sofianita Mutalib",
        "published": "2023-11-1",
        "citations": 1,
        "abstract": "In Malaysia, during the early stages of the COVID-19 pandemic, the negative impact on mental health became noticeable. The public's psychological and behavioral responses have risen as the COVID-19 outbreak progresses. A high impression of severity, vulnerability, impact, and fear was the element that influenced higher anxiety. Social media data can be used to track Malaysian sentiments in the COVID-19 era. However, it is often found on the internet in text format with no labels, and manually decoding this data is usually complicated. Furthermore, traditional data-gathering approaches, such as filling out a survey form, may not completely capture the sentiments. This study uses a text mining technique called Latent Dirichlet Allocation (LDA) on social media to discover mental health topics during the COVID-19 pandemic. Then, a model is developed using a hybrid approach, combining both lexicon-based and Naïve Bayes classifier. The accuracy, precision, recall, and F-measures are used to evaluate the sentiment classification. The result shows that the best lexicon-based technique is VADER with 72% accuracy compared to TextBlob with 70% accuracy. These sentiments results allow for a better understanding and handling of the pandemic. The top three topics are identified and further classified into positive and negative comments. In conclusion, the developed model can assist healthcare workers and policymakers in making the right decisions in the upcoming pandemic outbreaks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26555/ijain.v9i3.1367"
    },
    {
        "id": 19632,
        "title": "Search and classify topics in a corpus of text using the latent dirichlet allocation model",
        "authors": "Orlando Iparraguirre-Villanueva, Fernando Sierra-Liñan, Jose Luis Herrera Salazar, Saul Beltozar-Clemente, Félix Pucuhuayla-Revatta, Joselyn Zapata-Paulini, Michael Cabanillas-Carbonell",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "This work aims at discovering topics in a text corpus and classifying the most relevant terms for each of the discovered topics. The process was performed in four steps: first, document extraction and data processing; second, labeling and training of the data; third, labeling of the unseen data; and fourth, evaluation of the model performance. For processing, a total of 10,322 \"curriculum\" documents related to data science were collected from the web during 2018-2022. The latent dirichlet allocation (LDA) model was used for the analysis and structure of the subjects. After processing, 12 themes were generated, which allowed ranking the most relevant terms to identify the skills of each of the candidates. This work concludes that candidates interested in data science must have skills in the following topics: first, they must be technical, they must have mastery of structured query language, mastery of programming languages such as R, Python, java, and data management, among other tools associated with the technology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v30.i1.pp246-256"
    },
    {
        "id": 19633,
        "title": "Developing Indonesian Medical Corpora Using the Latent Dirichlet Allocation Method and Filtering Out Non-Medical Terms and Non-Noun Words",
        "authors": "Mohammad Teduh Uliniansyah, Agung Santosa, Dian Isnaeni Nurul Afra, Siska Pebiana, Lyla Ruslana Aini, Elvira Nurfadhilah,  Desiani,  Gunarso, Asril Jarin, Hammam Riza",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cosite60233.2023.10250069"
    },
    {
        "id": 19634,
        "title": "Province of Laguna Legislative Management and Tracking System with the Application of Latent Dirichlet Allocation (LDA) Algorithm",
        "authors": "Charles Alfred Cruz,  , Francis Balahadia,  ",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25147/ijcsr.2017.001.1.95"
    },
    {
        "id": 19635,
        "title": "Advancements of Artificial Intelligence Techniques in the Realm About Library and Information Subject—A Case Survey of Latent Dirichlet Allocation Method",
        "authors": "Xingzhou Pan, Yu Xue",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3334619"
    },
    {
        "id": 19636,
        "title": "Knowledge extraction about covid variant in social media (Twitter) using social network analysis (SNA) and latent dirichlet allocation (LDA)",
        "authors": "Anton Ade Purnama, Arsad Saifunas, Dana Indra Sensuse, Nadya Safitri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0181952"
    },
    {
        "id": 19637,
        "title": "Integrating Information Entropy and Latent Dirichlet Allocation Models for Analysis of Safety Accidents in the Construction Industry",
        "authors": "Yipeng Liu, Junwu Wang, Shanrong Tang, Jiaji Zhang, Jinyingjun Wan",
        "published": "2023-7-20",
        "citations": 7,
        "abstract": "Construction accident investigation reports contain critical information, but extracting useful insights from the voluminous Chinese text is challenging. Traditional methods rely on expert judgment, which leads to time-consuming and potentially inaccurate results. To overcome this problem, we propose a novel approach that combines text mining techniques and latent Dirichlet allocation (LDA) models to analyze standardized accident investigation reports in the Chinese construction industry. The proposed method integrates an information entropy term frequency-inverse document frequency (TF-IDF) weighting scheme to evaluate term importance and accounts for word and model uncertainty. The method was applied to a set of construction industry accident reports to identify the key factors leading to safety accidents. The results show that the causal factors of accidents in Chinese accident investigation reports consist of keywords and negative expressions, including “failure to timely identify safety hazards” and “inadequate site safety management”. Failure to timely identify safety hazards is the most common factor in accident investigation reports, and the negative expressions commonly used in the reports include “not timely” and “not in place”. The information entropy TF-IDF method is superior to traditional methods in terms of accuracy and efficiency, and the LDA model that considers word frequency and feature weights is better able to capture the underlying themes in the Chinese corpus. And the subject terms that make up the themes contain more information about the causes of accidents. This approach helps site managers more quickly and effectively understand the causal factors and key messages that lead to accidents from incident reports. It gives site managers insight into common patterns and themes associated with safety incidents, such as unsafe practices, hazardous work environments, and non-compliance with safety regulations. This enables them to make informed decisions to improve safety management practices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13071831"
    },
    {
        "id": 19638,
        "title": "Topic Modeling on Document Networks With Dirichlet Optimal Transport Barycenter",
        "authors": "Delvin Ce Zhang, Hady W. Lauw",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tkde.2023.3303465"
    },
    {
        "id": 19639,
        "title": "Enhancing occupant experience in defect repair services through text mining-based latent dirichlet allocation metric identification",
        "authors": "Jangsoon Kim, Wonwoo Shin, SangHyeok Han, Sungkon Moon, Jae-Jun Kim",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dibe.2024.100354"
    },
    {
        "id": 19640,
        "title": "Topic-VQ-VAE: Leveraging Latent Codebooks for Flexible Topic-Guided Document Generation",
        "authors": "YoungJoon Yoo, JongWon Choi",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "This paper introduces a novel approach for topic modeling utilizing latent codebooks from Vector-Quantized Variational Auto-Encoder~(VQ-VAE), discretely encapsulating the rich information of the pre-trained embeddings such as the pre-trained language model.\nFrom the novel interpretation of the latent codebooks and embeddings as conceptual bag-of-words, we propose a new generative topic model called Topic-VQ-VAE~(TVQ-VAE) which inversely generates the original documents related to the respective latent codebook.\nThe TVQ-VAE can visualize the topics with various generative distributions including the traditional BoW distribution and the autoregressive image generation.\nOur experimental results on document analysis and image generation demonstrate that TVQ-VAE effectively captures the topic context which reveals the underlying structures of the dataset and supports flexible forms of document generation.\nOfficial implementation of the proposed TVQ-VAE is available at https://github.com/clovaai/TVQ-VAE.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i17.29913"
    },
    {
        "id": 19641,
        "title": "Multi-scale Hybridized Topic Modeling: A Pipeline for Analyzing Unstructured Text Datasets via Topic Modeling",
        "authors": "Stefan Inzer, Keyi Cheng, Adrian Leung, Xiaoxian Shen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1137/22s1536832"
    },
    {
        "id": 19642,
        "title": "Who's To Blame for the COVID-19 pandemic? Perceptions of responsibility during the crisis using text mining and latent Dirichlet allocation",
        "authors": "Marianne Chevalier, Roxane de la Sablonnière, Simon-Olivier Harel, Sylvie Ratté, Mathieu Pelletier-Dumas, Anna Dorfman, Dietlind Stolle, Jean-Marc Lina, Éric Lacourse",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ssaho.2024.100825"
    },
    {
        "id": 19643,
        "title": "Unraveling dynamically encoded latent transcriptomic patterns in pancreatic cancer cells by topic modeling",
        "authors": "Yichen Zhang, Mohammadali (Sam) Khalilitousi, Yongjin P. Park",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.xgen.2023.100388"
    },
    {
        "id": 19644,
        "title": "Adaptive Priors for Burstiness Analysis in Topic Modeling with Generalized Dirichlet Distributions",
        "authors": "Shadan Ghadimi, Hafsa Ennajari, Nizar Bouguila, Manar Amayri",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/hpcc-dss-smartcity-dependsys60770.2023.00134"
    },
    {
        "id": 19645,
        "title": "Topic-Informed Dialogue Summarization using Topic Distribution and Prompt-based Modeling",
        "authors": "Jaeah You, Youngjoong Ko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.376"
    },
    {
        "id": 19646,
        "title": "Understanding the expectations of parents regarding their children's school commuting by public transport using latent Dirichlet Allocation",
        "authors": "Mariza Motta Queiroz, Carlos Roque, Filipe Moura, João Marôco",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tra.2024.103986"
    },
    {
        "id": 19647,
        "title": "Latent disease similarities and therapeutic repurposing possibilities uncovered by multi-modal generative topic modeling of human diseases",
        "authors": "Satoshi Kozawa, Hirona Yokoyama, Kyoji Urayama, Kengo Tejima, Hotaka Doi, Shunki Takagi, Thomas N Sato",
        "published": "2023-1-5",
        "citations": 2,
        "abstract": "Abstract\n\nMotivation\nHuman diseases are characterized by multiple features such as their pathophysiological, molecular and genetic changes. The rapid expansion of such multi-modal disease-omics space provides an opportunity to re-classify diverse human diseases and to uncover their latent molecular similarities, which could be exploited to repurpose a therapeutic-target for one disease to another.\n\n\nResults\nHerein, we probe this underexplored space by soft-clustering 6955 human diseases by multi-modal generative topic modeling. Focusing on chronic kidney disease and myocardial infarction, two most life-threatening diseases, unveiled are their previously underrecognized molecular similarities to neoplasia and mental/neurological-disorders, and 69 repurposable therapeutic-targets for these diseases. Using an edit-distance-based pathway-classifier, we also find molecular pathways by which these targets could elicit their clinical effects. Importantly, for the 17 targets, the evidence for their therapeutic usefulness is retrospectively found in the pre-clinical and clinical space, illustrating the effectiveness of the method, and suggesting its broader applications across diverse human diseases.\n\n\nAvailability and implementation\nThe code reported in this article is available at: https://github.com/skozawa170301ktx/MultiModalDiseaseModeling\n\n\nSupplementary information\nSupplementary data are available at Bioinformatics Advances online.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioadv/vbad047"
    },
    {
        "id": 19648,
        "title": "Topic Discovery in Operations Management Research Area Based on LDA Topic Modeling",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/fsst.2023.051713"
    },
    {
        "id": 19649,
        "title": "Efficient and Flexible Topic Modeling Using Pretrained Embeddings and Bag of Sentences",
        "authors": "Johannes Schneider",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012404000003636"
    },
    {
        "id": 19650,
        "title": "Implementation of Dynamic Topic Modeling to Discover Topic Evolution on Customer Reviews",
        "authors": "Valentinus Roby Hananto",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "Annotation and analysis of online customer reviews were identified as significant problems in various domains, including business intelligence, marketing, and e-governance. In the last decade, various approaches based on topic modeling have been developed to solve this problem. The known solutions, however, often only work well on content with static topics. As a result, it is challenging to analyze customer reviews that include dynamic and constantly expanding collections of short and noisy texts. A method was proposed to handle such dynamic content. The proposed system applied a dynamic topic model using BERTopic to monitor topics and word evolution over time. It would help decide when the topic model needs to be retrained to capture emerging topics. Several experiments were conducted to test the practicality and effectiveness of the proposed framework. It demonstrated how a dynamic topic model could handle the emergence of new and over-time-correlated topics in customer review data. As a result, improved performance was achieved compared to the baseline static topic model, with 25% of new segmented texts discovered using the dynamic topic model. Experimental results have, therefore, convincingly demonstrated that the proposed framework can be used in practice to develop automatic review annotation tools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15575/join.v8i2.963"
    },
    {
        "id": 19651,
        "title": "ROMANIAN TOPIC MODELING – AN EVALUATION OF PROBABILISTIC VERSUS TRANSFORMER-BASED TOPIC MODELING FOR DOMAIN CATEGORIZATION",
        "authors": "MELANIA NIȚU, MIHAI DASCĂLU, MARIA-IULIANA DASCĂLU",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "A primary challenge for digital library systems when digitizing millions of volumes is to automatically analyze and group the huge document collection by categories while identifying patterns and extracting the main themes. A common method to be leveraged on unlabeled texts is topic modeling. Given the wide range of datasets and evaluation criteria used by researchers, comparing the performance and outputs of existing unsupervised algorithms is a complex task. This paper introduces a domain-based topic modeling evaluation applied to Romanian documents. Several variants of Latent Dirichlet Allocation (LDA) combined with dimensionality reduction techniques were compared to Transformer-based models for topic modeling. Experiments were conducted on two datasets of varying text lengths: abstracts of novels and full-text documents. Evaluations were performed against coherence and silhouette scores, while the validation considered classification and clustering tasks. Results highlighted meaningful topics extracted from both datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59277/rrst-ee.2023.3.8"
    },
    {
        "id": 19652,
        "title": "Research Trends in Korean Local Public Finance: Based on Structural Topic Modeling",
        "authors": "Taeho Eom, Kihye Hong, Taecheon Lee",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18333/kpar.57.4.173"
    },
    {
        "id": 19653,
        "title": "An Iterative Method for Hyperspectral Pixel Unmixing Leveraging Latent Dirichlet Variational Autoencoder",
        "authors": "Kiran Mantripragada, Paul R. Adler, Peder A. Olsen, Faisal Z. Qureshi",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282175"
    },
    {
        "id": 19654,
        "title": "Quantum Topic Model: Topic Modeling Using Variational Quantum Circuits",
        "authors": "Wenbo Qiao, Peng Zhang, Jiaming Zhao, Chang Yang",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447349"
    },
    {
        "id": 19655,
        "title": "Implementation of Topic Modeling in the Analysis of Topic Trends in SDGs Goal 6 Research",
        "authors": "Fathonah Illia, Rani Nooraeni, Lya Hulliyyatus Suadaa",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceei59426.2023.10346917"
    },
    {
        "id": 19656,
        "title": "Understanding Fashion in the Metaverse: A Topic Modeling Approach",
        "authors": "Eonyou Shin, Chreston Miller",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31274/itaa.17562"
    },
    {
        "id": 19657,
        "title": "Term Weighting in Topic Modeling",
        "authors": "Yaşar Tekın",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223810"
    },
    {
        "id": 19658,
        "title": "Novel mixture allocation models for topic learning",
        "authors": "Kamal Maanicshah, Manar Amayri, Nizar Bouguila",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractLatent Dirichlet allocation (LDA) is one of the major models used for topic modelling. A number of models have been proposed extending the basic LDA model. There has also been interesting research to replace the Dirichlet prior of LDA with other pliable distributions like generalized Dirichlet, Beta‐Liouville and so forth. Owing to the proven efficiency of using generalized Dirichlet (GD) and Beta‐Liouville (BL) priors in topic models, we use these versions of topic models in our paper. Furthermore, to enhance the support of respective topics, we integrate mixture components which gives rise to generalized Dirichlet mixture allocation and Beta‐Liouville mixture allocation models respectively. In order to improve the modelling capabilities, we use variational inference method for estimating the parameters. Additionally, we also introduce an online variational approach to cater to specific applications involving streaming data. We evaluate our models based on its performance on applications related to text classification, image categorization and genome sequence classification using a supervised approach where the labels are used as an observed variable within the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/coin.12641"
    },
    {
        "id": 19659,
        "title": "Research Topic Trends on Turnover Intention among Korean Registered Nurses: An Analysis Using Topic Modeling",
        "authors": "Jung Lim Lee, Youngji Kim",
        "published": "2023-4-15",
        "citations": 0,
        "abstract": "This study aimed to explore research topic trends on turnover intention among Korean hospital nurses by analyzing the keywords and topics of related articles. Methods: This text-mining study collected, processed, and analyzed text data from 390 nursing articles published between 1 January 2010 and 30 June 2021 that were collected via search engines. The collected unstructured text data were preprocessed, and the NetMiner program was used to perform keyword analysis and topic modeling. Results: The word with the highest degree centrality was “job satisfaction”, the word with the highest betweenness centrality was “job satisfaction”, and the word with the highest closeness centrality and frequency was “job stress”. The top 10 keywords in both the frequency analysis and the 3 centrality analyses included “job stress”, “burnout”, “organizational commitment”, “emotional labor”, “job”, and “job embeddedness”. The 676 preprocessed key words were categorized into five topics: “job”, “burnout”, “workplace bullying”, “job stress”, and “emotional labor”. Since many individual-level factors have already been thoroughly investigated, future research should concentrate on enabling successful organizational interventions that extend beyond the microsystem.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11081139"
    },
    {
        "id": 19660,
        "title": "Topic Modeling Writing and Literacies Research, 1912–2020",
        "authors": "Emily Rainey",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2013747"
    },
    {
        "id": 19661,
        "title": "Similarity Metric of Categorical Distributions for Topic Modeling Problems with Akin Categories",
        "authors": "Serhiy Shtovba, Mykola Petrychko, Olena Shtovba",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/cmis/3392-7"
    },
    {
        "id": 19662,
        "title": "A Topic-Based Data Distribution Management for HLA",
        "authors": "Alberto Falcone, Alfredo Garro",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012051500003546"
    },
    {
        "id": 19663,
        "title": "Toward topic diversity in recommender systems: integrating topic modeling with a hashing algorithm",
        "authors": "Donghui Yang, Yan Wang, Zhaoyang Shi, Huimin Wang",
        "published": "2023-8-30",
        "citations": 1,
        "abstract": "PurposeImproving the diversity of recommendation information has become one of the latest research hotspots to solve information cocoons. Aiming to achieve both high accuracy and diversity of recommender system, a hybrid method has been proposed in this paper. This study aims to discuss the aforementioned method.Design/methodology/approachThis paper integrates latent Dirichlet allocation (LDA) model and locality-sensitive hashing (LSH) algorithm to design topic recommendation system. To measure the effectiveness of the method, this paper builds three-level categories of journal paper abstracts on the Web of Science platform as experimental data.Findings(1) The results illustrate that the diversity of recommended items has been significantly enhanced by leveraging hashing function to overcome information cocoons. (2) Integrating topic model and hashing algorithm, the diversity of recommender systems could be achieved without losing the accuracy of recommender systems in a certain degree of refined topic levels.Originality/valueThe hybrid recommendation algorithm developed in this paper can overcome the dilemma of high accuracy and low diversity. The method could ameliorate the recommendation in business and service industries to address the problems of information overload and information cocoons.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ajim-01-2023-0019"
    },
    {
        "id": 19664,
        "title": "Latent Trajectories of Subjective Well-Being: An Application of Latent Growth Curve and Latent Class Growth Modeling",
        "authors": "Esra Sozer-Boz, Nilüfer Kahraman",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "This study proposed a three-stage measurement model utilizing the Latent Growth Curve Modeling and Latent Class Growth Analysis. The measurement model was illustrated using repeated data collected through a four-week prospective study tracking the subjective well-being of volunteer college students (n=154). Firstly, several unconditional growth models were estimated to define the model providing a better representation of individual growth trajectories. Secondly, several conditional growth models were formulated to test the usefulness of covariate variables hypothesized to explain observed variance in growth factors. Finally, latent class models were estimated to explore different latent trajectory classes further. Results showed that students' subjective well-being changed over time, and the rate of this change, as well as its covariates, were not constant for the entire sample. This study clearly illustrates how a longitudinal measurement approach can enhance the scope of findings and the depth of inferences when repeated measurements are available.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52380/ijcer.2023.10.2.308"
    },
    {
        "id": 19665,
        "title": "Joining LDA and Word Embeddings for Covid-19 Topic Modeling on English and Arabic Data",
        "authors": "Amina Amara, Mohamed Ali Hadj Taieb, Mohamed Ben Aouicha",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012320900003636"
    },
    {
        "id": 19666,
        "title": "Supplemental Material for Latent State–Trait and Latent Growth Curve Modeling of Inhibitory Control",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/xge0001344.supp"
    },
    {
        "id": 19667,
        "title": "A topic-enhanced dirichlet model for short text stream clustering",
        "authors": "Kan Liu, Jiarui He, Yu Chen",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-024-09480-w"
    },
    {
        "id": 19668,
        "title": "A Cross-Domain Multimodal Supervised Latent Topic Model for Item Tagging and Cold-Start Recommendation",
        "authors": "Rui Tang, Cheng Yang, Yuxuan Wang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mmul.2023.3242455"
    },
    {
        "id": 19669,
        "title": "Exploring Latent Themes-Analysis of various Topic Modelling Algorithms",
        "authors": " Reetesh Kumar Srivastava,  Shalini Sharma,  Dr. Piyush Pratap Singh",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "This research explores the effectiveness of four common topic modelling methods for identifying latent themes and topics in unstructured text data: Latent Dirich- let Allocation(LDA), Non-Negative Matrix Factorization(NMF), Top2Vec, and BERTopic. Topic modelling is an essential method for gaining insights from massive amounts of textual data. Top2Vec and BERTopic are recent approaches that use unsupervised neural networks to develop distributed representations of texts and words, whereas NMF and LDA are traditional techniques frequently utilised for topic modelling. This document gives a timeline of important advances in topic modelling, including the development of NMF and LDA, as well as many refinements and additions to LDA. According to the study’s findings, BERTopic surpasses the other approaches, particularly in recognising overlapping and fine- grained subjects. This work emphasises the significance of text processing quality, the variety of subjects in the text, and the right selection of topic modelling methods in efficiently breaking down topics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-11635"
    },
    {
        "id": 19670,
        "title": "Masked Latent Semantic Modeling: an Efficient Pre-training Alternative to Masked Language Modeling",
        "authors": "Gábor Berend",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.876"
    },
    {
        "id": 19671,
        "title": "Intelligence system for sentiment classification with deep topic embedding using N-gram based topic modeling",
        "authors": "E.S. Smitha, S. Sendhilkumar, G.S. Mahalakshmi",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "Multi-modal information outbreak is consistently increasing in social media. Classification of tweet sentiments using various information modalities will help the recommender systems to achieve success in digital marketing. Moreover, aspect-level sentiment analysis categorizes a target’s sentiment polarity in a specific environment. Using topic modelling in aspect-level sentiment analysis enables the identification of more accurate aspect-based tweet sentiments. The existing sentiment classification techniques used for the development of recommendation systems do not focus on the aspect-based approach modelled using deep learning classifier with temporal analysis on the social media data. Hence, this paper proposes an efficient sentiment classification model that highlights the impact of topic modelling-based word feature embedding for improvising the classification of Twitter sentiments and product reviews based on temporal reasoning and analysis for performing predictive analysis. For tweets context analysis, Latent Dirichlet Allocation based topic modelling is used in this work which generates the topics. For each topic, the sentiment is calculated separately and the topic guided feature expansion is done using Senti-wordnet. Moreover, an extended deep learning classification algorithm called Long Short-Term Memory (LSTM) with word embedding and temporal reasoning(LSTMWTR) is proposed in this paper for improving the classification accuracy. Finally, the labelled data are classified using the existing machine learning algorithms namely Naïve Bayes, Support Vector Machines and also using the deep learning models such as Convolution Neural Network(CNN),LSTM, Recurrent Neural Networks (RNN) and the transformer model namelyBi-directional Encoder Representation from Transformers (BERT),Convolution Bi-directional Recurrent Neural Network (CBRNN) and the proposed deep learning algorithm namelyLSTMWTR. These sentiment classification algorithms have been evaluated with word embedding for tweet sentiment classification and product review classification. The results obtained from this work show that the proposed LSTMWTR algorithm emerges as the highly accurate model for tweet sentiment and product review classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-230246"
    },
    {
        "id": 19672,
        "title": "Event Detection in News Articles: A Hybrid Approach Combining Topic Modeling, Clustering, and Named Entity Recognition",
        "authors": "Nikos Kapellas, Sarantos Kapidakis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012234300003598"
    },
    {
        "id": 19673,
        "title": "Guided Topic Modeling with Word2Vec: A Technical Note",
        "authors": "Thomas Dangl, Stefan Salbrechter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4575985"
    },
    {
        "id": 19674,
        "title": "Revealing Students&amp;amp;#39; Interdisciplinary Understanding of Carbon Cycling Using the Topic Modeling Technique",
        "authors": "Minju Hong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2006703"
    },
    {
        "id": 19675,
        "title": "A latent topic‐aware network for dense video captioning",
        "authors": "Tao Xu, Yuanyuan Cui, Xinyu He, Caihua Liu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "AbstractMultiple events in a long untrimmed video possess the characteristics of similarity and continuity. These characteristics can be considered as a kind of topic semantic information, which probably behaves as same sports, similar scenes, same objects etc. Inspired by this, a novel latent topic‐aware network (LTNet) is proposed in this article. The LTNet explores potential themes within videos and generates more continuous captions. Firstly, a global visual topic finder is employed to detect the similarity among events and obtain latent topic‐level features. Secondly, a latent topic‐oriented relation learner is designed to further enhance the topic‐level representations by capturing the relationship between each event and the video themes. Benefiting from the finder and the learner, the caption generator is capable of predicting more accurate and coherent descriptions. The effectiveness of our proposed method is demonstrated on ActivityNet Captions and YouCook2 datasets, where LTNet shows a relative performance of over 3.03% and 0.50% in CIDEr score respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/cvi2.12195"
    },
    {
        "id": 19676,
        "title": "3D Multi-Views Object Classification Based on a Fully Generalized Dirichlet Allocation Model",
        "authors": "Ahmed Yasser Eita, Hafsa Ennajari, Nizar Bouguila",
        "published": "2023-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icit58465.2023.10143102"
    },
    {
        "id": 19677,
        "title": "Buffer Allocation Problem modeling by means of Timed Petri Nets",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46354/i3m.2023.emss.041"
    },
    {
        "id": 19678,
        "title": "Automated Audio Captioning With Topic Modeling",
        "authors": "Aysegul Ozkaya Eren, Mustafa Sert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3235733"
    },
    {
        "id": 19679,
        "title": "Detecting Malicious Users on Twitter Using Topic Modeling",
        "authors": "MyoMyo Swe, Nyein Nyein Myo",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca51723.2023.10181604"
    },
    {
        "id": 19680,
        "title": "Do Neural Topic Models Really Need Dropout? Analysis of the Effect of Dropout in Topic Modeling",
        "authors": "Suman Adhya, Avishek Lahiri, Debarshi Kumar Sanyal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.162"
    },
    {
        "id": 19681,
        "title": "A Topic Modeling Perspective on Investor Uncertainty",
        "authors": "Daniel Perico Ortiz, Matthias Schnaubelt, Oleg Seifert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4437121"
    },
    {
        "id": 19682,
        "title": "A Broad View of the Problem-Based Learning Field Based on Machine Learning: A Large-Scale Study Based on Topic Modeling",
        "authors": "Özcan ÖZYURT, Alper ASLAN",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "The aim of the study is to examine Problem Based Learning (PBL) studies in terms of descriptive and semantic content analysis by using topic modeling. For this purpose, descriptive and topic modeling analyzes were used together in the research. In order to include the highest number of articles on Scopus, the term \"problem based learning\" was searched in the title, abstract and keywords and only journal articles (research and review) were selected. Thus, 7289 articles in 1987-2021 were included in the study. Firstly, the subject area, author and country distributions are listed. In addition, it showed that the most studied topics were education curriculum (39.15%), teaching strategies (14.90%), critical thinking skill (12.29%) and patient simulation (8.88%). When examined in seven five-year periods between 1987 and 2021, it was determined that the most voluminous topic was education curriculum, and the most accelerated topic was clinical education. Considering the number of publications in five-year periods, it was determined that the topics of critical thinking skills and teaching strategies accelerated more in the percentages calculated according to the topics. It is expected that the results obtained will be important reference points for the studies to be carried out in the field of PBL",
        "keywords": "",
        "link": "http://dx.doi.org/10.31458/iejes.1320491"
    },
    {
        "id": 19683,
        "title": "Research trend analysis in college general English program before and after the COVID-19 Pandemic: Utilizing topic modeling",
        "authors": "Eun-Hye Lee,  , Hye-Seong Ahn, Mae-Ran Park",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15858/engtea.78.3.202309.125"
    },
    {
        "id": 19684,
        "title": "Navigating the technical analysis in stock markets: Insights from bibliometric and topic modeling approaches",
        "authors": "Sarveshwar Kumar Inani, Harsh Pradhan, Surender Kumar, Baidyanath Biswas",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "In stock markets, technical analysis plays a vital role by offering valuable insights into price trends, patterns, and anticipated market movements, aiding investors in making well-informed decisions. This study employs bibliometric and topic modelling approaches on 589 English-language journal articles indexed in Scopus in the last two decades (from 2003 to 2023), exclusively focusing on technical analysis in stock markets. The keyword co-occurrence analysis identifies five topic clusters. The application of structural topic modelling also unravels five prominent thematic clusters, namely pattern-based forecasting, rule-based trading, algorithmic trading, techno-fundamental trading, and machine learning &amp;amp; sentiment analysis. The topic of pattern-based forecasting involves researching the application of various patterns or models to predict stock prices. Rule-based trading concentrates on utilizing technical analysis tools to generate buy and sell signals, aiming for profitability. The algorithmic trading cluster explores the use of algorithms to systematically execute buy and sell actions, especially in high-frequency trading scenarios. Techno-fundamental trading investigates the integration of both fundamental and technical analysis in trading and investment decisions. Lastly, machine learning &amp;amp; sentiment analysis focus on applying advanced machine learning techniques and sentiment analysis for predicting stock prices, highlighting the use of sophisticated methods in this domain. The three predominant topics in the dataset are &quot;rule-based trading,&quot; &quot;machine learning &amp;amp; sentiment analysis,&quot; and &quot;algorithmic trading&quot; constituting 26.79%, 23.52%, and 21.11% of the dataset, respectively. These findings underscore the prominence and significance of these themes within the context of the research domain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21511/imfi.21(1).2024.21"
    },
    {
        "id": 19685,
        "title": "Deep Sentiment Classification using Topic Modeling for Covid-19",
        "authors": "P Velvizhy,  , K Arul Deepa, E Shanmuga Priya",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i36.1464"
    },
    {
        "id": 19686,
        "title": "ניתוח דוחות כספיים של בנקים – גישת מידול נושאים (Topic Modeling) לזיהוי סיכונים",
        "authors": "Avinoam Blum",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4757029"
    },
    {
        "id": 19687,
        "title": "Debugging Practices of High- and Low-Performing Students&amp;amp;#39; Scratch Programming Using Structural Topic Modeling",
        "authors": "Eunsung Park",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2012263"
    },
    {
        "id": 19688,
        "title": "Latent Topic Extraction as a Source of Labeling in Natural Language Processing",
        "authors": "Andrew Hornback, Yuanda Zhu, Monica Isgut, Wenqi Shi, Arjita Nema, Blake Anderson, May D. Wang",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibm58861.2023.10385618"
    },
    {
        "id": 19689,
        "title": "A Comparison of Topic Modeling Techniques for Sinhala",
        "authors": "Dinithi Pallawala, Prasanna S. Haddela",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icac60630.2023.10417327"
    },
    {
        "id": 19690,
        "title": "Accurate Classification of Ovarian Cyst Using Topic Modeling",
        "authors": "Aditi Gupta, Hoor Fatima",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425472"
    },
    {
        "id": 19691,
        "title": "Tourist Place Classification Using Topic Modeling Algorithms",
        "authors": "Apeksha Arun Wadhe, Shraddha S. Suratkar",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccst59048.2023.10474232"
    },
    {
        "id": 19692,
        "title": "Alt-Tech Topic Modeling Incorporating Atopic Model Selection Strategy",
        "authors": "Sanaz Rasti, Sarah Anne Dunne, Eugenia Siapera",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "The rapid growth of Alt-tech platforms and concerns over their less stringent content moderation policies, make them a good case for opinion mining. This study aims at investigating the topic models that exist in specific Alt-tech channel on Telegram, using data collected in two time points of 2021 and 2023. Three different topic models of LDA, NMF and Contextualized NTM were explored and a model selection procedure was proposed to choose the best performing model among all. To validate the model selection algorithm quantitatively and qualitatively, the approach was tested on publicly available labelled datasets. For all the experiments, data was pre-processed employing an effective NLP pre-processing procedure along with an Alt-tech customised list of stop-words. Using the validated topic model selection algorithm, LDA topics with Ngram range = (4, 4) were extracted from the targeted Alt-tech dataset. The findings from topic models were qualitatively evaluated by a social scientist and are further discussed. The conclusion of the work suggests that the proposed model selection procedure is effective for corresponding corpus length and context. Future work avenues are suggested to improve the outcome of Alt-tech topic modeling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131601"
    },
    {
        "id": 19693,
        "title": "Topic analysis of news articles related to high school credit system using LDA topic modeling",
        "authors": "Eunjeong Jeon, Youn-Jeng Choi",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15854/jes.2023.09.54.3.101"
    },
    {
        "id": 19694,
        "title": "Thematic Trends in YouTube Research: A Structural Topic Model-Based Approach",
        "authors": "Kyungeun Jang",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5392/jkca.2024.24.01.011"
    },
    {
        "id": 19695,
        "title": "Hot Topic Recognition of Health Rumors Based on Anti-Rumor Articles on the WeChat Official Account Platform: Topic Modeling",
        "authors": "Ziyu Li, Xiaoqian Wu, Lin Xu, Ming Liu, Cheng Huang",
        "published": "2023-9-21",
        "citations": 2,
        "abstract": "\nBackground\nSocial networks have become one of the main channels for obtaining health information. However, they have also become a source of health-related misinformation, which seriously threatens the public’s physical and mental health. Governance of health-related misinformation can be implemented through topic identification of rumors on social networks. However, little attention has been paid to studying the types and routes of dissemination of health rumors on the internet, especially rumors regarding health-related information in Chinese social media.\n\n\nObjective\nThis study aims to explore the types of health-related misinformation favored by WeChat public platform users and their prevalence trends and to analyze the modeling results of the text by using the Latent Dirichlet Allocation model.\n\n\nMethods\nWe used a web crawler tool to capture health rumor–dispelling articles on WeChat rumor-dispelling public accounts. We collected information from health-debunking articles posted between January 1, 2016, and August 31, 2022. Following word segmentation of the collected text, a document topic generation model called Latent Dirichlet Allocation was used to identify and generalize the most common topics. The proportion distribution of the themes was calculated, and the negative impact of various health rumors in different periods was analyzed. Additionally, the prevalence of health rumors was analyzed by the number of health rumors generated at each time point.\n\n\nResults\nWe collected 9366 rumor-refuting articles from January 1, 2016, to August 31, 2022, from WeChat official accounts. Through topic modeling, we divided the health rumors into 8 topics, that is, rumors on prevention and treatment of infectious diseases (1284/9366, 13.71%), disease therapy and its effects (1037/9366, 11.07%), food safety (1243/9366, 13.27%), cancer and its causes (946/9366, 10.10%), regimen and disease (1540/9366, 16.44%), transmission (914/9366, 9.76%), healthy diet (1068/9366, 11.40%), and nutrition and health (1334/9366, 14.24%). Furthermore, we summarized the 8 topics under 4 themes, that is, public health, disease, diet and health, and spread of rumors.\n\n\nConclusions\nOur study shows that topic modeling can provide analysis and insights into health rumor governance. The rumor development trends showed that most rumors were on public health, disease, and diet and health problems. Governments still need to implement relevant and comprehensive rumor management strategies based on the rumors prevalent in their countries and formulate appropriate policies. Apart from regulating the content disseminated on social media platforms, the national quality of health education should also be improved. Governance of social networks should be clearly implemented, as these rapidly developed platforms come with privacy issues. Both disseminators and receivers of information should ensure a realistic attitude and disseminate health information correctly. In addition, we recommend that sentiment analysis–related studies be conducted to verify the impact of health rumor–related topics.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/45019"
    },
    {
        "id": 19696,
        "title": "CNN-Based Topic Modeling and Semantic Sentiment Analysis Using Machine Learning",
        "authors": "Avni Garg",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10244788"
    },
    {
        "id": 19697,
        "title": "Debugging Practices of High- and Low-Performing Students' Scratch Programming Using Structural Topic Modeling",
        "authors": "Eunsung Park",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2012263"
    },
    {
        "id": 19698,
        "title": "Revealing Students' Interdisciplinary Understanding of Carbon Cycling Using the Topic Modeling Technique (Poster 27)",
        "authors": "Minju Hong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2006703"
    },
    {
        "id": 19699,
        "title": "ניתוח דוחות כספיים של בנקים – גישת מידול נושאים (Topic Modeling) לזיהוי סיכונים",
        "authors": "Avinoam Blum, Alon Raviv",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4762761"
    },
    {
        "id": 19700,
        "title": "Advancing Multinomial Regression and Topic Modeling with Beta-Liouville Distributions",
        "authors": "Pantea Koochemeshkian, Nizar Bouguila",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00292"
    },
    {
        "id": 19701,
        "title": "AI-Based Literature Reviews: A Topic Modeling Approach",
        "authors": "Manoj Kumar Verma, Mayank Yuvaraj",
        "published": "2023-5-13",
        "citations": 0,
        "abstract": "The purpose of this paper is to highlight the importance of topic modelling in conducting literature reviews using the opensource LDAShiny package in the R environment, with green libraries literature as a case study. To conduct the analysis, a title and abstract dataset were prepared using the Scopus database and imported into the LDAShiny package for further analysis. It was found that the green libraries' literature ranged from 1989-2023, with a sharp increase in research topics since 2003. The study also identified key themes and documents associated with green libraries research, revealing that energy efficiency, waste reduction and recycling, and the use of sustainable materials have been extensively discussed in the literature. However, further research is needed on the implementation of these practices in libraries, as well as the impact of the COVID-19 pandemic on green libraries. The findings will be beneficial to researchers interested in using topic modelling for literature reviews.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17821/srels/2023/v60i2/170967"
    },
    {
        "id": 19702,
        "title": "Incremental Topic Modeling for Scientific Trend Topics Extraction",
        "authors": "Nikolai Gerasimenko, Alexander Chernyavskiy, Maria Nikiforova, Anastasia Ianina, Konstantin Vorontsov",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Rapid growth of scientific publications and intensive emergence of new directions and approaches poses a challenge to the scientific community to identify trends in a timely and automatic manner. We denote trend as a semantically homogeneous theme that is characterized by a lexical kernel steadily evolving in time and a sharp, often exponential, increase in the number of publications. In this paper, we investigate recent topic modeling approaches to accurately extract trending topics at an early stage. In particular, we customize the standard ARTM-based approach and propose a novel incremental training technique which helps the model to operate on data in real-time. We further create the Artificial Intelligence Trends Dataset (AITD) that contains a collection of early-stage articles and a set of key collocations for each trend. The conducted experiments demonstrate that the suggested ARTM-based approach outperforms the classic PLSA, LDA models and a neural approach based on BERT representations. Our models and dataset are open for research purposes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.28995/2075-7182-2023-22-88-103"
    },
    {
        "id": 19703,
        "title": "SimilarBERT: A Framework for Similarity-based Topic Modeling",
        "authors": "Sule Mohammed, Bhavesh M. Patel",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486804"
    },
    {
        "id": 19704,
        "title": "Sentiment Analysis and Customer Satisfaction Factors Based on LSTM and Topic Modeling",
        "authors": "Sakshi Nazirkar,  , Siddhivinayak Kulkarni",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i28.1109"
    }
]