[
    {
        "id": 16505,
        "title": "Improved convolutional neural network chiller early fault diagnosis by gradient-based feature-level model interpretation and feature learning",
        "authors": "Guannan Li, Liang Chen, Cheng Fan, Jiajia Gao, Chengliang Xu, Xi Fang",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.applthermaleng.2023.121549"
    },
    {
        "id": 16506,
        "title": "BORT-RD: An Improved Model for Software Engineering Design Feature Generation",
        "authors": "Zhenhao Li, Hang Lei",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnisc60562.2023.00051"
    },
    {
        "id": 16507,
        "title": "Performance Prediction Method of Centrifugal Pump Based on Improved QP Model",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3901/jme.2023.13.280"
    },
    {
        "id": 16508,
        "title": "PSO-Stacking improved ensemble model for campus building energy consumption forecasting based on priority feature selection",
        "authors": "Yisheng Cao, Gang Liu, Jian Sun, Durga Prasad Bavirisetti, Gang Xiao",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jobe.2023.106589"
    },
    {
        "id": 16509,
        "title": "Enhancing Search Advertisement Performance with Effective Feature Engineering",
        "authors": "Saravanan K, Sathish G, Aadhityan S, Srinidhi S",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.423.38744"
    },
    {
        "id": 16510,
        "title": "Retracted: Improved Blockchain Technology for Performance Optimization Model Design of Sports Clubs",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9862625"
    },
    {
        "id": 16511,
        "title": "A Robust Stock Price Prediction using improved Linear Regression Model with LSTM improved Feature Selection Process",
        "authors": "Jaideep Gupta, Jaytrilok Choudhary, Dhirendra Pratap Singh",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307362"
    },
    {
        "id": 16512,
        "title": "Analyzing the performance of a bio-sensor integrated improved blended learning model for accurate pneumonia prediction",
        "authors": "Lekshmy S, Sridhar K.P., Michaelraj Kingston Roberts",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rineng.2024.102063"
    },
    {
        "id": 16513,
        "title": "An Optimal Insider-Threats Detection Model Based on Improved Deep Belief Network with Feature Reduction Scheme for E-Healthcare System",
        "authors": "G.Kranthi Kumar, T. Sasirooba, M. Madhavi",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsse.2025.10059055"
    },
    {
        "id": 16514,
        "title": "An Improved Classification Model Based on Feature Fusion for Orchid Species",
        "authors": "Jianhua Wang, Haozhan Wang, Yongbing Long, Yubin Lan",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42835-023-01705-7"
    },
    {
        "id": 16515,
        "title": "Prediction of Vehicle Form Feature for Cross-model Evolution Based on Improved Nonlinear Grey Bernoulli Model",
        "authors": "Qiuying Xu, Ju Chen, Hemin Yan",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.1074-1093"
    },
    {
        "id": 16516,
        "title": "Improved Object Detectors Based on Semantic Feature Fusion",
        "authors": "Chuyi Wang, Tong Wang",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scset58950.2023.00013"
    },
    {
        "id": 16517,
        "title": "Feature Selection Improves Speech Based Parkinson's Disease Detection Performance",
        "authors": "Ayşe Tekindor, Eda Aydın",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012347300003657"
    },
    {
        "id": 16518,
        "title": "Towards Multi-Level Structuring of Goal-Oriented Models for Improved Model-Based Systems Engineering",
        "authors": "Christophe Ponsard, Robert Darimont",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011866200003402"
    },
    {
        "id": 16519,
        "title": "Comparison of Feature Selection Techniques for Improved Diabetes Prediction using Random Forest",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/6-3-675"
    },
    {
        "id": 16520,
        "title": "Acoustic tomography temperature reconstruction based on improved sparse reconstruction model and multi-scale feature fusion network",
        "authors": "Xianghu Dong, Lifeng Zhang, Lifeng Qian, Chuanbao Wu, Zhihao Tang, Ao Li",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108168"
    },
    {
        "id": 16521,
        "title": "Multi Feature Immigration Handling and Recommendation Model for Improved Migration Management Using Remittance and Psychology",
        "authors": "Nazalia Rosadanti Hanan ‘Adila",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Immigrant management and recommendation has been approached with several approaches. However, the existing models does not handle the problem with most efficient way as they does not consider variety of features related to the problem. To support the problem, an efficient multi feature immigration handling and recommendation model (MFIHRM) is presented in this article. The MFIHRM model focused on considering remittance provided to the immigrant and psychology of the migrant in handling them with more efficient way.  To perform this, the immigrant data set has been utilized to obtain features like purpose of migration, educational standard, economic support, lifestyle, criminal records, remittance of country, and behavior of migrant. The data set has been preprocessed to eliminate the noisy records by applying Deep Averaging Technique. From the normalized data set, the method extracts the above mentioned features. With the features extracted, the method performs Immigrant Management by computing various support measures like Migration Target Support (MTS), Educational Support (ES), Economic Support (EcS), Social Support (SS), Remittance Support (RS). Using these support values, the method computes Migration Handling Measure (MHM). Similarly, the method performs Migration Recommendation by computing Migration Score (MS) for various countries to produce recommendations. The proposed method improves the performance of migration management and recommendation handling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47059/ml.v20i4.3191"
    },
    {
        "id": 16522,
        "title": "DarkNet19 and multiple feature selectors based deep feature engineering model for fake signature detection",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.61"
    },
    {
        "id": 16523,
        "title": "Improved DSFD Algorithm with Enhanced Feature Fusion and Information Utilization",
        "authors": "Lihui Wang, Xichuan Hu",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ceect59667.2023.10420631"
    },
    {
        "id": 16524,
        "title": "Improved Artificial Bee Colony Based Feature Selection for Epileptic Seizure Detection",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0630.27"
    },
    {
        "id": 16525,
        "title": "Prediction of Intention to Use Social Media in Online Blended Learning Using Two Step Hybrid Feature Selection and Improved SVM Stacked Model",
        "authors": "Shrawan Kumar Trivedi, Ankit Sharma, Pradipta Patra, Shubhamoy Dey",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tem.2022.3212901"
    },
    {
        "id": 16526,
        "title": "Feature representation improved Faster R-CNN model for high-efficiency pavement crack detection",
        "authors": "Junzhi Zhai, Zhaoyun Sun, Ju Huyan, Wei Li, Handuo Yang",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": " Two optimization methods are proposed to improve faster region-based convolutional neural network (Faster R-CNN), which are (1) restructuring Faster R-CNN's backbone network and the classification and regression (C&R) network using residual networks and (2) designing the feature ensemble structure for Faster R-CNN to combine the shallow with deep feature maps of the backbone. In addition, this paper proposed a method to evaluate the model's performance, which is pixel mean value ( Pmean) distribution of different channel feature maps, and quantitatively evaluate the feature representation capability of the model. Experimental results show that mean average precision (mAP) of the model optimized by the first method can reach 86.5%, which is 1.9% higher than that of baseline. However, mAP of the model optimized by the second method reaches 87.5%, which is 2.9% higher than the baseline model. The Pmean statistics of each channel feature map extracted by different backbones show that the model accuracy is higher when the Pmean of its channel feature maps is bigger, which can effectively improve the interpretability of the model accuracy. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1139/cjce-2022-0137"
    },
    {
        "id": 16527,
        "title": "Autoencoder Feature Residuals for Network Intrusion Detection: One-Class Pretraining for Improved Performance",
        "authors": "Brian Lewandowski, Randy Paffenroth",
        "published": "2023-7-31",
        "citations": 1,
        "abstract": "The proliferation of novel attacks and growing amounts of data has caused practitioners in the field of network intrusion detection to constantly work towards keeping up with this evolving adversarial landscape. Researchers have been seeking to harness deep learning techniques in efforts to detect zero-day attacks and allow network intrusion detection systems to more efficiently alert network operators. The technique outlined in this work uses a one-class training process to shape autoencoder feature residuals for the effective detection of network attacks. Compared to an original set of input features, we show that autoencoder feature residuals are a suitable replacement, and often perform at least as well as the original feature set. This quality allows autoencoder feature residuals to prevent the need for extensive feature engineering without reducing classification performance. Additionally, it is found that without generating new data compared to an original feature set, using autoencoder feature residuals often improves classifier performance. Practical side effects from using autoencoder feature residuals emerge by analyzing the potential data compression benefits they provide.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5030046"
    },
    {
        "id": 16528,
        "title": "Research on distortion correction of fisheye image based on improved linear feature model",
        "authors": "Peishuang Sun, Jianwu Xie",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsca59871.2023.10393293"
    },
    {
        "id": 16529,
        "title": "A Regional Feature Analysis Based Deep Learning Model for  Improved Retail Management Using Block Chain",
        "authors": "",
        "published": "2023-4-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33168/jsms.2023.0222"
    },
    {
        "id": 16530,
        "title": "Lipoprotein detection: Hybrid deep classification model with improved feature set",
        "authors": "Pravin Narayan Kathavate, J. Amudhavel",
        "published": "2023-2-3",
        "citations": 1,
        "abstract": "Patients with chronic liver diseases typically experience lipid profile problems, and mortality from cirrhosis complicated by portal vein thrombosis (PVT) is very significant. A lipoprotein (Lp) is a bio-chemical assemblage with the main job of moving fat molecules in water that are hydrophobic. Lipoproteins are present in all eubacterial walls. Lipoproteins are of tremendous interest in the study of spirochaetes’ pathogenic mechanisms. Since spirochaete lipobox sequences are more malleable than other bacteria, it’s proven difficult to apply current prediction methods to new sequence data. The major goal is to present a Lipoprotein detection model in which correlation features, enhanced log energy entropy, raw features, and semantic similarity features are extracted. These extracted characteristics are put through a hybrid model that combines a Gated Recurrent Unit (GRU) and a Long Short-Term Memory (LSTM). Then, the outputs of GRU and LSTM are averaged to obtain the output. Here, GRU weights are optimized via the Selfish combined Henry Gas Solubility Optimization with cubic map initialization (SHGSO) model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/mgs-220329"
    },
    {
        "id": 16531,
        "title": "Research on Fault Feature Extraction of Gearbox Bearing Based on Improved Genetic Algorithm",
        "authors": "Weiming Qin",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00133"
    },
    {
        "id": 16532,
        "title": "Row Feature Tracking for Improved Localization of Agricultural Robots",
        "authors": "Dominik Moss, Kevin Bregler, Werner Kraus",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/case56687.2023.10260546"
    },
    {
        "id": 16533,
        "title": "Semi-feature Sharing Deep Ensemble Model based on Sensor Data",
        "authors": "Zhao Zhongkai, Tatsuhito Hasegawa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/iciae2023.011"
    },
    {
        "id": 16534,
        "title": "Improved bald eagle search algorithm for global optimization and feature selection",
        "authors": "Amit Chhabra, Abdelazim G. Hussien, Fatma A. Hashim",
        "published": "2023-4",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aej.2022.12.045"
    },
    {
        "id": 16535,
        "title": "ENHANCING MACHINE LEARNING PERFORMANCE THROUGH ALGORITHMIC OPTIMIZATION AND FEATURE ENGINEERING TECHNIQUES",
        "authors": "",
        "published": "2023-6-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets41531"
    },
    {
        "id": 16536,
        "title": "An aero-engine remaining useful life prediction model based on feature selection and the improved TCN",
        "authors": "Wenting Zha, Yunhong Ye",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.fraope.2024.100083"
    },
    {
        "id": 16537,
        "title": "Enhancing Welding Defect Detection: An Improved YOLOv8 Model with Feature Augmentation and Scale Fusion",
        "authors": "Jialun Chen, Jinyu Liu",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itaic58329.2023.10408771"
    },
    {
        "id": 16538,
        "title": "A novel hybrid feature extraction approach of marine vessel signal via improved empirical mode decomposition and measuring complexity",
        "authors": "Mehdi Zare, Nowrouz Mohammad Nouri",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.113727"
    },
    {
        "id": 16539,
        "title": "SAC-IA Algorithm Based on Parallel KD-Tree Search and Improved Feature Point Selection",
        "authors": "Wei Wei",
        "published": "2023-1-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccece58074.2023.10135352"
    },
    {
        "id": 16540,
        "title": "On Enhancing Transmission Performance for IoV Based on Improved Greedy Algorithm",
        "authors": "",
        "published": "2023-4-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55162/mcet.04.136"
    },
    {
        "id": 16541,
        "title": "A Gas Emission Prediction Model Based on Feature Selection and Improved Machine Learning",
        "authors": "Liangshan Shao, Kun Zhang",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "This paper proposed a gas emission prediction method based on feature selection and improved machine learning, as traditional gas emission prediction models are neither accurate nor universally applicable. Through analysis, this paper identified 12 factors that affected gas emissions. A total of 30 groups of typical data for gas outflow were standardized, after which a full subset regression feature selection method was used to categorize 12 influencing factors into different regular patterns and select 18 feature parameter sets. Meanwhile, based on nuclear principal component analysis (KPCA), an optimized gas emission prediction model was constructed where the dimensionality of the original data was reduced. An optimized algorithm set was constructed based on the hybrid kernel extreme learning machine (HKELM) and the least squares support vector machine (LSSVM). The performance of feature parameters adopted in the prediction algorithm was evaluated according to certain metrics. By comparing the results of different sets, the final prediction sequence could be obtained, and a model that was composed of the optimal feature parameters was applied to the optimal machine learning algorithm. The results showed that the HKELM outperformed LSSVM in prediction accuracy, running speed, and stability. The root meant square error (RMSE) for the final prediction sequence was 0.22865, the determination coefficient (R2) was 0.99395, the mean absolute error (MAE) was 0.20306, and the mean absolute percentage error (MAPE) was 1.0595%. Every index of accuracy evaluation performed well and the constructed prediction model had high-prediction accuracy and a wide application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/pr11030883"
    },
    {
        "id": 16542,
        "title": "Retracted: The Feature Recognition of Motor Noise Based on the Improved EEMD Model",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9756480"
    },
    {
        "id": 16543,
        "title": "Transaction fraud detection by CatBoost model with feature engineering",
        "authors": "Jiahan Shi",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "In the digital era, the ubiquitous nature of online transactions has placed a spotlight on the imperative for robust fraud detection systems. This research tackles this pressing issue, with a particular emphasis on the nuanced process of feature engineering tailored for the IEEE-CIS dataset, a representative sample of contemporary transactional behaviors. The enhancement of data attributes, through meticulous feature engineering, acts as the bedrock for the application of the CatBoost model - a gradient-boosting technique revered for its precision. The paper dedicates significant attention to both these pivotal stages, showcasing the synergistic effect they have when applied in tandem. With this refined data and sophisticated modeling, the proposed method manifests exceptional performance, establishing a new benchmark when juxtaposed with other gradient-boosting methodologies. Conclusively, this study offers valuable insights for enhancing online transaction security and sets the stage for further innovation in fraud detection within the machine learning community.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/48/20241485"
    },
    {
        "id": 16544,
        "title": "Improved spell corrector algorithm and deepspeech2 model for enhancing end-to-end Gujarati language ASR performance",
        "authors": "Bhavesh Bhagat, Mohit Dua",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.prime.2024.100441"
    },
    {
        "id": 16545,
        "title": "Effective Feature Selection Using Multi-Objective Improved Ant Colony Optimization for Breast Cancer Classification",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0630.48"
    },
    {
        "id": 16546,
        "title": "Mechanical Equipment Performance Degradation Assessment Method Based on Improved Degradation Feature Extraction and Sample Completeness",
        "authors": "Saige Lv, Xiong Hu, Bing Wang",
        "published": "2023-3-26",
        "citations": 1,
        "abstract": "Performance degradation assessment (PDA), as an important part of health management, is playing a crucial role in evaluating the degenerate state of mechanical equipment. To evaluate the performance degradation state more effectively by using monitoring data of mechanical equipment, a PDA method based on improved degradation feature extraction technology and considering sample completeness is proposed in this paper. Firstly, multiple degradation features, including statistical features and intrinsic energy features, are extracted to construct a high-dimensional feature set calculated by time-domain analysis and the EMD method. Then, a sensitive feature set, which has significant robustness, correlation, and monotonicity in the degenerate process, is reduced and processed by the improved PCA method to obtain the final health index. Secondly, the degradation assessment model is established by considering the completeness of the samples. As for the complete sample dataset, which has both normal and failure state data, a logistic regression model (LRM) is built to assess the performance degradation status. In addition, an SVDD model is established for the incomplete sample dataset, which only has normal state data. Finally, the reliability of the proposed method is verified by the public XJTU-SY dataset, and the comparative experiment further verifies the superiority of this method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20855/ijav.2023.28.11891"
    },
    {
        "id": 16547,
        "title": "An Improved ORB Feature Point Extraction Algorithm based on Image Enhancement and Adaptive Threshold",
        "authors": "Tao Jiang, Yuchen Xue",
        "published": "2023-9-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291977"
    },
    {
        "id": 16548,
        "title": "Improved feature ranking fusion process with Hybrid model for crop yield prediction",
        "authors": "Swanth Boppudi, Sheela Jayachandran",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2024.106121"
    },
    {
        "id": 16549,
        "title": "Retracted: Surface Defect Detection Method Based on Improved Attention Mechanism and Feature Fusion Model",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9827489"
    },
    {
        "id": 16550,
        "title": "Multi-Feature Short-Term Electricity Load Forecasting Based On Improved CNN-LSTM Combined Forecasting Model",
        "authors": "Haoyi Sun, Huiqun Yu, Chunmei Xu, Chenkun Du",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apet59977.2023.10489536"
    },
    {
        "id": 16551,
        "title": "Golden eagle based improved Att-BiLSTM model for big data classification with hybrid feature extraction and feature selection techniques",
        "authors": "Gnanendra Kotikam, Lokesh Selvaraj",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0954898x.2023.2293895"
    },
    {
        "id": 16552,
        "title": "An Improved Fake News Detection Model Using Hybrid Time Frequency-Inverse Document Frequency for Feature Extraction and AdaBoost Ensemble Model as a Classifier",
        "authors": "Lakshmi Holla, K. S. Kavitha",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.15.2.202-211"
    },
    {
        "id": 16553,
        "title": "An exploration of the impact of Feature quality versus Feature quantity on the performance of a machine learning model",
        "authors": "Krupa Bhayani, Devansh Tanna, Vinod Maan,  Dhiraj, Sandeep Kumar",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inc457730.2023.10262824"
    },
    {
        "id": 16554,
        "title": "A Novel Scheduling Algorithm for Improved Performance of Multi-Objective Safety-Critical WSN Using Spatial Self-Organizing Feature Map",
        "authors": "Issam Al-Nader, Aboubaker Lasebae, Rand Raheem",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Technological advances in the internet of things (IoT) allowed a low-cost, yet small sensor device to operate with limited power in a dynamic harsh environment where human intervention is impossible. The wireless sensor network (WSN) is an example of the IoT in which physical devices’ software and sensors can interconnect to provide application services. It is important that such applications be dependable to meet the required quality of service (QoS) and function as expected. Consequently, the multi-objective optimization (MOO) problem in WSNs aims to address the trade-off among coverage, connectivity, and network lifetime requirements. Node scheduling is one approach of many used to optimize energy in WSNs. The contribution of this work is the proposal of a self-organizing feature map (SOFM) to enhance the node scheduling in WSNs. The proposed SOFM node-scheduling algorithm aims to spatially explore the state space domain and obtain an optimal solution. In our experiment, the proposed SOFM node-scheduling algorithm is evaluated against a comparable algorithm, namely the BAT node-scheduling algorithm, via MATLAB simulator. The results showed that the SOFM node-scheduling algorithm outperformed the latter by 27% and 28% for the maximum and minimum coverage, respectively, with similar performance of 99% of connectivity and network lifetime.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13010019"
    },
    {
        "id": 16555,
        "title": "Multi-objective structure optimization and performance analysis of catalytic micro-reactor channel designed by an improved topology optimization model",
        "authors": "Jiahao Wang, Umberto Desideri, Xiaomin Liu",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.applthermaleng.2024.122742"
    },
    {
        "id": 16556,
        "title": "Improved Malnutrition Classification: A Grey Wolf Optimization-Based Feature Selection Approach with Random Forest Model",
        "authors": "Ramdhansyach Sasmita, Muhammad Sam’An, Luqman Assafaat, Akhmad Faturrohman,  Safuan",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icic60109.2023.10381980"
    },
    {
        "id": 16557,
        "title": "Automating Feature Requests for User-Driven Model Evolution at Runtime",
        "authors": "Karl Kegel",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/models-c59198.2023.00149"
    },
    {
        "id": 16558,
        "title": "D-SVM: A Deep Support Vector Machine Model with Different Kernel Types for Improved Intrusion Detection Performance",
        "authors": "Razdan Sanjay, Gupta Himanshu, Seth Ashish",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23940/ijpe.23.09.p5.598606"
    },
    {
        "id": 16559,
        "title": "Feature Engineering Methods in Intrusion Detection System: A Performance Evaluation",
        "authors": "F. Zare, P. Mahmoudi-Nasr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5829/ije.2023.36.07a.15"
    },
    {
        "id": 16560,
        "title": "An Spodoptera Frugiperda pest detection algorithm based on improved feature fusion",
        "authors": "Xiaojuan Chen, Yunda Guan, Guohua Li",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2668034"
    },
    {
        "id": 16561,
        "title": "Feature extraction based on improved ORB algorithm",
        "authors": "Fengyun Huang, yulin zuo, Xiaoxiong Wang",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2682276"
    },
    {
        "id": 16562,
        "title": "Interpretable Model-Agnostic Explanations Based on Feature Relationships for High-Performance Computing",
        "authors": "Zhouyuan Chen, Zhichao Lian, Zhe Xu",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "In the explainable artificial intelligence (XAI) field, an algorithm or a tool can help people understand how a model makes a decision. And this can help to select important features to reduce computational costs to realize high-performance computing. But existing methods are usually used to visualize important features or highlight active neurons, and few of them show the importance of relationships between features. In recent years, some methods based on a white-box approach have taken relationships between features into account, but most of them can only work on some specific models. Although methods based on a black-box approach can solve the above problems, most of them can only be applied to tabular data or text data instead of image data. To solve these problems, we propose a local interpretable model-agnostic explanation approach based on feature relationships. This approach combines the relationships between features into the interpretation process and then visualizes the interpretation results. Finally, this paper conducts a lot of experiments to evaluate the correctness of relationships between features and evaluates this XAI method in terms of accuracy, fidelity, and consistency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/axioms12100997"
    },
    {
        "id": 16563,
        "title": "Short Text Classification Model based on Pre-trained Language Model with Feature Fusion",
        "authors": "Haihui Huang, Shiyang Hu",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": " In response to the low accuracy of Chinese short text classification in the current data mining field and the defects of existing deep learning models with more model parameters and higher time complexity, this paper proposes a new text classification model - short text classification model (ACBSM) based on pre-trained language model with feature expansion. In ACBSM, to address the problem of high dimensionality of text data without accurate text representation, the Bert model is used to train word vector representation to solve the problem of multiple meanings of a word. From the parallelization acceleration level, a parallel acceleration strategy of two-channel neural network is designed to improve the efficiency of the algorithm in processing massive data. To address the sparsity of text data and the more complex semantics, an attention mechanism is introduced and a CNN model is used to enhance the extraction of keyword information; secondly, BiSRU is used to capture the contextual features of the text, and finally, experimental validation is conducted on a news dataset. The experimental results show that ACBSM improves the accuracy of text classification to 95.83% under the same environment and dataset, and its classification performance is better than other text classification methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56028/aetr.9.1.534.2024"
    },
    {
        "id": 16564,
        "title": "MVFSIGM: multi-variant feature-based synthesis image generation model for improved stability using generative adversarial network",
        "authors": "D. Vathana, S. Babu",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08929-9"
    },
    {
        "id": 16565,
        "title": "STOA based Feature Selection with Improved LSTM Model for Breast Cancer Diagnosis in IoT",
        "authors": "Vudutha Sravanthi, T Annapurna, V Rama Krishna, B Jyothi",
        "published": "2023-2-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecct56650.2023.10179785"
    },
    {
        "id": 16566,
        "title": "Performance Evaluation of a Feature-Importance-based Feature Selection Method for Time Series Prediction",
        "authors": "Hyun Ahn",
        "published": "2023-3-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56977/jicce.2023.21.1.82"
    },
    {
        "id": 16567,
        "title": "Tool Condition Monitoring for High Performance Milling Based on Feature Adaptive Fusion and Ensemble Learning",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3901/jme.2024.01.149"
    },
    {
        "id": 16568,
        "title": "Effect of Repetitions and Entanglement on Performance of Pauli Feature Map",
        "authors": "Annika Daspal",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10241"
    },
    {
        "id": 16569,
        "title": "Improved QoS-Secure Routing in MANET Using Real-Time Regional ME Feature Approximation",
        "authors": "Y. M. Mahaboob John, G. Ravi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.036916"
    },
    {
        "id": 16570,
        "title": "Improved Neural Collaborative Filtering Recommendation Method based on Multi-Head Attention and Feature Fusion",
        "authors": "Yan Tang, Xin Zhang, Xiu Zhang",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ispce-asia60405.2023.10365943"
    },
    {
        "id": 16571,
        "title": "Dual-channel Feature Fusion Model for Air Pollutants Forecast",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/wcse.2023.06.051"
    },
    {
        "id": 16572,
        "title": "An artificial intelligence model based on multi-step feature engineering and deep attention network for optical network performance monitoring",
        "authors": "Yang Zhou, Zhuojia Yang, Qiang Sun, Chengqing Yu, Chengming Yu",
        "published": "2023-2",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijleo.2022.170443"
    },
    {
        "id": 16573,
        "title": "Liver cancer classification via deep hybrid model from CT image with improved texture feature set and fuzzy clustering based segmentation",
        "authors": "Vinnakota Sai Durga Tejaswi, Venubabu Rachapudi",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "One of the leading causes of death for people worldwide is liver cancer. Manually identifying the cancer tissue in the current situation is a challenging and time-consuming task. Assessing the tumor load, planning therapies, making predictions, and tracking the clinical response can all be done using the segmentation of liver lesions in Computed Tomography (CT) scans. In this paper we propose a new technique for liver cancer classification with CT image. This method consists of four stages like pre-processing, segmentation, feature extraction and classification. In the initial stage the input image will be pre processed for the quality enhancement. This preprocessed output will be subjected to the segmentation phase; here improved deep fuzzy clustering technique will be applied for image segmentation. Subsequently, the segmented image will be the input of the feature extraction phase, where the extracted features are named as Improved Gabor Transitional Pattern, Grey-Level Co-occurrence Matrix (GLCM), Statistical features and Convolutional Neural Network (CNN) based feature. Finally the extracted features are subjected to the classification stage, here the two types of classifiers used for classification that is Bi-GRU and Deep Maxout. In this phase we will apply the Crossover mutated COOT optimization (CMCO) for tuning the weights, So that we will improve the quality of the image. This proposed technique, present the best accuracy of disease identification. The CMCO gained the accuracy of 95.58%, which is preferable than AO = 92.16%, COA = 89.38%, TSA = 88.05%, AOA = 92.05% and COOT = 91.95%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/web-230042"
    },
    {
        "id": 16574,
        "title": "Stress Prediction Using Enhanced Feature Selection and KNN Model",
        "authors": "A.S Maria, R Sunder, Anly M Antony",
        "published": "2023-1-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accthpa57160.2023.10083348"
    },
    {
        "id": 16575,
        "title": "A fusion kernel in SVM and improved evolutionary algorithm in feature selection for Parkinson's disease detection",
        "authors": "Jiachen Wang",
        "published": "2023-7-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2684724"
    },
    {
        "id": 16576,
        "title": "Wavelet Based Feature Extraction for Multi-Model Ensemble Approach for Mental Workload Classification Using EEG",
        "authors": "Fiza Parveen, Arnav Bhavsar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012381300003657"
    },
    {
        "id": 16577,
        "title": "Effective Feature Selection Strategy for Supervised Classification based on an Improved Binary Aquila Optimization Algorithm",
        "authors": "Amr A. Abd El-Mageed, Amr A. Abohany, Ahmed Elashry",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cie.2023.109300"
    },
    {
        "id": 16578,
        "title": "Predefined-time prescribed performance control for AUV with improved performance function and error transformation",
        "authors": "Yanchao Sun, Yuang Zhang, Hongde Qin, Lingpeng Ouyang, Ruijie Jing",
        "published": "2023-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.114817"
    },
    {
        "id": 16579,
        "title": "Feature selections based on three improved condition entropies and one new similarity degree in interval-valued decision systems",
        "authors": "Benwei Chen, Xianyong Zhang, Jilin Yang",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.107165"
    },
    {
        "id": 16580,
        "title": "Deep hybrid model for attack detection in IoT-fog architecture with improved feature set and optimal training",
        "authors": "Navnath B. Pokale, Pooja Sharma, Deepak T. Mane",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "IoT-Fog computing provides a wide range of services for end-based IoT systems. End IoT devices interface with cloud nodes and fog nodes to manage client tasks. Critical attacks like DDoS and other security risks are more likely to compromise IoT end devices while they are collecting data between the fog and the cloud layer. It’s important to find these network vulnerabilities early. By extracting features and placing the danger in the network, DL is crucial in predicting end-user behavior. However, deep learning cannot be carried out on Internet of Things devices because to their constrained calculation and storage capabilities. In this research, we suggest a three-stage Deep Hybrid Detection Model for Attack Detection in IoT-Fog Architecture. Improved Z-score normalization-based data preparation will be carried out in the initial step. On the basis of preprocessed data, features like IG, raw data, entropy, and enhanced MI are extracted in the second step. The collected characteristics are used as input to hybrid classifiers dubbed optimized Deep Maxout and Deep Belief Network (DBN) in the third step of the process to classify the assaults based on the input dataset. A hybrid optimization model called the BMUJFO (Blue Monkey Updated Jellyfish Optimization) technique is presented for the best Deep Maxout training. Additionally, the suggested model produced higher accuracy, precision, sensitivity, and specificity results, with values of 95.26 percent, 94.84%, 96.28%, and 97.84%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/web-230187"
    },
    {
        "id": 16581,
        "title": "Feature engineering process on well log data for machine learning-based SAGD performance prediction",
        "authors": "Namhwa Kim, Hyundon Shin, Kyungbook Lee",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geoen.2023.212057"
    },
    {
        "id": 16582,
        "title": "Improved polarization scattering imaging using local-global context polarization feature learning framework",
        "authors": "Xueqiang Fan, Weiyun Chen, Bing Lin, Peng Peng, Zhongyi Guo",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.optlaseng.2024.108194"
    },
    {
        "id": 16583,
        "title": "Real- Time Intradialytic Hypotension Prediction Model Using an Improved Equilibrium Optimizer for Feature Selection",
        "authors": "Lei Gu, Jiadong Xiang, Shenghuang He, Yuanyuan Huang, Xueyan Bian, Jing Yuan",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451473"
    },
    {
        "id": 16584,
        "title": "Finger Vein Identification based on Feature Extraction using Line Tracking Method over Edge Detection for Improved Accuracy",
        "authors": "M.S. Sriram, I. Sudha",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccebs58601.2023.10449270"
    },
    {
        "id": 16585,
        "title": "System Model Evaluation of RISC-V Cores for improved performance and fault tolerance",
        "authors": "Tom Jose, Deepak Shankar",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scc57168.2023.00022"
    },
    {
        "id": 16586,
        "title": "Improved Model to Detect Cancer from Cervical Histopathology Images by Optimizing Feature Selection and Ensemble Classifier",
        "authors": "R. Baghia Laxmi, B. Kirubagari, Lakshmana Pandian",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.4.777-787"
    },
    {
        "id": 16587,
        "title": "An Improved Computational Learning-Based Model for Estimating Total Organic Carbon in Unconventional Shale Reservoirs",
        "authors": "Chaohua Guo",
        "published": "2023",
        "citations": 0,
        "abstract": "Unconventional resources have emerged as one of the crucial alternatives to the rapidly depleting of conventional hydrocarbon resources. The hydrocarbon potential of shale source rocks is assessed by the percentage of the organic index such as total organic carbon (TOC). Correct estimation of TOC is very important since minor deviations in anticipated results can lead to wastage of investments and time. A slight improvement in estimation practices, on the other hand, can increase the value of an exploration project. Therefore, the objective of this study is to present an improved classification and regression tree (CART) computational learning-based model as an improved alternative in estimating TOC from well logging data. Conventional well logs suite of bulk density, gamma-ray, deep resistivity, sonic transit time, spontaneous potential, and neutron porosity from Mihambia, Mbuo and, Nondwa, Formations of the Mandawa Basin Tanzania, were used as input variables. Results from the developed CART TOC model were compared with the random forest (RF) and backpropagation neural network (BPNN). It was observed that the proposed CART model trained better while generalizing better through unused testing data compared with RF and BPNN. CART model achieved R, RMSE, and MAPE values of 0.9615, 0.0840, and 0.5035 for training and 0.9703, 0.1162, and 0.3722 for testing respectively. The proposed model work with higher accuracy with the sensitivity analysis indicating that gamma-ray, deep resistivity, and sonic transit time significantly influenced the model outcome.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53902/tpe.2023.03.000519"
    },
    {
        "id": 16588,
        "title": "Network Defense Model Based on Multi scale Feature Fusion for Countering Cycle Generation",
        "authors": "Huang Kaiming, Jia Shijie, Chen Jie",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.57237/j.se.2023.02.003"
    },
    {
        "id": 16589,
        "title": "An improved model for predicting froth recovery",
        "authors": "S.J. Neethling, D. Mesa, P.R. Brito-Parada",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mineng.2023.108479"
    },
    {
        "id": 16590,
        "title": "Collaborative SVM parameters and feature selection optimization based on improved squirrel search algorithm",
        "authors": "Jia Jiang, Jinbo Cai, Sihuan He",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3010827"
    },
    {
        "id": 16591,
        "title": "An Improved Firefly-Based Feature Selection Method for Software Fault Identification and Classification",
        "authors": "Arya Ashima, Kumar Malik Sanjay",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23940/ijpe.23.11.p5.744752"
    },
    {
        "id": 16592,
        "title": "An improved hibbard interpolation algorithm based on edge gradient feature detection using Sobel operator",
        "authors": "Shuaiming Chen, Shuhui Yin, Yizhan Zhao",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Color interpolation algorithms have important applications in color image processing, and many interpolation algorithms have been proposed one after another. The bilinear interpolation algorithm, Cok interpolation algorithm and gradient edge interpolation are three classical interpolation algorithms, however, they may cause problems such as zipper effect and Mohr's stripe effect. In this paper, this paper optimize the gradient edge algorithm, calculate the gradient by using Sobel operator and fit the direction of the edge in a weighted way, and propose a gradient edge weighted interpolation algorithm based on Sobel operator to improve the performance of the interpolation algorithm. Through the validation of color image recovery, the results show that the subjective visual effect and objective evaluation indexes such as structural similarity index, peak signal-to-noise ratio and minimum mean square error of the improved algorithm proposed in this paper are better than the traditional algorithm, which is of great significance to the improvement of the interpolation algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/2023424"
    },
    {
        "id": 16593,
        "title": "Performance Analysis of Feature based Multiple Descriptors with Histogram Equalization for Image Mosaicing",
        "authors": "H Shridhar,  , Sunil S Harakannanavar, Vidyashree Kanabur, H Jayalaxmi",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i31.433"
    },
    {
        "id": 16594,
        "title": "An improved YOLOv5s model using feature concatenation with attention mechanism for real-time fruit detection and counting",
        "authors": "Olarewaju Mubashiru Lawal, Shengyan Zhu, Kui Cheng",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "An improved YOLOv5s model was proposed and validated on a new fruit dataset to solve the real-time detection task in a complex environment. With the incorporation of feature concatenation and an attention mechanism into the original YOLOv5s network, the improved YOLOv5s recorded 122 layers, 4.4 × 106 params, 12.8 GFLOPs, and 8.8 MB weight size, which are 45.5%, 30.2%, 14.1%, and 31.3% smaller than the original YOLOv5s, respectively. Meanwhile, the obtained 93.4% of mAP tested on the valid set, 96.0% of mAP tested on the test set, and 74 fps of speed tested on videos using improved YOLOv5s is 0.6%, 0.5%, and 10.4% higher than the original YOLOv5s model, respectively. Using videos, the fruit tracking and counting tested on the improved YOLOv5s observed less missed and incorrect detections compared to the original YOLOv5s. Furthermore, the aggregated detection performance of improved YOLOv5s outperformed the network of GhostYOLOv5s, YOLOv4-tiny, and YOLOv7-tiny, including other mainstream YOLO variants. Therefore, the improved YOLOv5s is lightweight with reduced computation costs, can better generalize against complex conditions, and is applicable for real-time detection in fruit picking robots and low-power devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpls.2023.1153505"
    },
    {
        "id": 16595,
        "title": "Modality-Specific Feature Selection, Data Augmentation and Temporal Context for Improved Performance in Sleep Staging",
        "authors": "Ritika Jain, Ramakrishnan A. G.",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jbhi.2023.3339713"
    },
    {
        "id": 16596,
        "title": "A Hybrid Feature Selection Method Using an Improved Binary Butterfly Optimization Algorithm and Adaptive β–Hill Climbing",
        "authors": "Anurag Tiwari",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3274469"
    },
    {
        "id": 16597,
        "title": "Intelligent fault diagnosis for rail transit switch machine based on adaptive feature selection and improved LightGBM",
        "authors": "Zhenpeng Lao, Deqiang He, Zexian Wei, Hui Shang, Zhenzhen Jin, Jian Miao, Chonghui Ren",
        "published": "2023-6",
        "citations": 34,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engfailanal.2023.107219"
    },
    {
        "id": 16598,
        "title": "Speech Emotion Feature Extraction Method Based on Improved MFCC and IMFCC Fusion Features",
        "authors": "Zhongqing Wang, Jinghua Yan, Yifan Wang, Xinran Wang",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda56825.2023.10090810"
    },
    {
        "id": 16599,
        "title": "Research on comprehensive performance evaluation model of multi-energy micro-grid based on prospect theory improved VIKOR technique",
        "authors": "Xiuna Wang, Dongwei Li, Weiyang You",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.24-2-2023.2330646"
    },
    {
        "id": 16600,
        "title": "Rolling bearing fault feature extraction based on maximum correlated kurtosis deconvolution and improved autocorrelation spectral kurtograph",
        "authors": "Chencheng He, Wenbo Wang",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2689626"
    },
    {
        "id": 16601,
        "title": "Model reference adaptive controllers with improved performance for applications in LCL-filtered grid-connected converters",
        "authors": "Guilherme Vieira Hollweg, Rodrigo Varella Tambara, Jorge Rodrigo Massing, Lucas Cielo Borin, Everson Mattos, Gustavo Guilherme Koch, Caio Ruviaro Dantas Osório, Vinícius Foletto Montagner",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.conengprac.2023.105591"
    },
    {
        "id": 16602,
        "title": "Sensitivity Analysis-Based Validation of the Modified NERA Model for Improved Performance",
        "authors": " Atta Ullah,  Hamzah Sakidin,  Shehza Gul,  Kamal Shah,  Mohana Sundaram Muthuvalu,  Thabet Abdeljawad,  Mudassar Iqbal",
        "published": "2023-10-2",
        "citations": 1,
        "abstract": "Marijuana is an illicit narcotic with multiple negative health effects as it continues to pose a severe danger to the health of people in emerging regions. Marijuana is spread through interactions between users and non-users. This study utilizes first-order non-linear ordinary differential equations to modify the Non-user, Experimental, Recreational, and Addicted (NERA) users’ model by adding a new class known as the hospitalized class of marijuana smokers. Moreover, this paper focuses on validating the NERA model using the sensitivity analysis concept. The NERA model presented in a previous study for marijuana usage among the target population consists of four distinct stages: the first stage is known as the non-user stage and is represented by the letter N; the second stage is known as the experimental stage of marijuana smoking and is represented by the letter E; the third stage is known as the recreational stage of marijuana smoking and is represented by the letter R; the fourth stage is represented by the letter A; and this last stage is known as the addicted stage of marijuana smoking. The suggested mathematical method achieved the reproduction number () for marijuana use. The results of the sensitivity tests indicate how crucial a variety of variables are to the spread of marijuana. The parameters that have a key impact on marijuana consumption were discovered based on sensitivity analysis. All these procedures, including the reproductive number and invariant region, using the sensitivity analysis concept were utilized to validate the updated model. In this study, the NERA model is modified by utilizing first-order non-linear ordinary differential equations. Furthermore, as demonstrated by the graphical and technique sections, the proposed modified models were successfully validated for improved performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37934/araset.32.3.111"
    },
    {
        "id": 16603,
        "title": "Comprehensive risk mitigation for improved UAV reliability and\n\t\t\t\t\t\tperformance",
        "authors": "Aungshula Chowdhury, Michael G. Lipsett",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17118/11143/21090"
    },
    {
        "id": 16604,
        "title": "Command Differential Learning Rate in Model Reference Adaptive Control for Improved System Performance",
        "authors": "Jesse Jaramillo, Tansel Yucelen",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-1390"
    },
    {
        "id": 16605,
        "title": "A Feature Learning-Based Model for Analyzing Students’ Performance in Supportive Learning",
        "authors": "P. Prabhu, P. Valarmathie, K. Dinakaran",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.028659"
    },
    {
        "id": 16606,
        "title": "Retracted: Design of Artistic Creation Style Extraction Model Based on Color Feature Data",
        "authors": "",
        "published": "2023-7-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9823940"
    },
    {
        "id": 16607,
        "title": "IMPROVING PERFORMANCE OF STUDENTS’ GRADE CLASSIFICATION MODEL USES NAÏVE BAYES GAUSSIAN TUNING MODEL AND FEATURE SELECTION",
        "authors": " M Hafidz Ariansyah,  Esmi Nur Fitri,  Sri Winarno",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Student grades are a relevant variable for predicting student academic performance. In achieving good and quality student performance, it is necessary to analyze or evaluate the factors that influence student performance. When a educator can predict students' academic performance from the start, the educator can adjust the way of learning so that learning can run effectively. The purpose of this research is to study how it is applied to determine the interrelationships between variables and find out which variables have an effect, then use it as a feature selection technique. Then, researchers review the most popular classifier, Gaussian Naïve Bayes (GNB). Next, we survey the feature selection models and discuss the feature selection approach. In this study, researchers will classify student grades based on existing features to evaluate student performance, so it can guide educators in selecting learning methods and assist students in planning the learning process. The result is that applying Gaussian Naïve Bayes (GNB) without feature selection has a lower accuracy of 10.12% while using feature selection the accuracy increases to 10.12%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.3.737"
    },
    {
        "id": 16608,
        "title": "Research on Adaptive Learning Model Based on Multidimensional Feature Fusion",
        "authors": "Lulu Dong, Xu Chen",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isceic59030.2023.10271182"
    },
    {
        "id": 16609,
        "title": "Seizure Prediction on EEG Signals using Feature Augmentation based Multi Model Ensemble",
        "authors": "A. Anandaraj, P.J.A. Alphonse",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "\nBackground::\nEpilepsy is a neurological disorder that leads to seizures. This occurs due\nto excessive electrical discharge by the brain cells. An effective seizure prediction model can aid\nin improving the lifestyle of epilepsy patients. After analyzing various patents related to seizure\nprediction, it is observed that monitoring electroencephalography (EEG) signals of epileptic patients\nis an important task for the early diagnosis of seizures.\n\n\nObjective::\nThe main objective of this paper is to assist epileptic patients to enhance their way of\nliving by predicting the seizure in advance.\n\n\nMethods::\nThis paper builds a feature augmentation-based multi-model ensemble-based architecture\nfor seizure prediction. The proposed technique is divided into 2 broad categories; feature\naugmentation and ensemble modeling. The feature augmentation process builds temporal features\nwhile the multi-model ensemble has been designed to handle the high complexity levels of the\nEEG data. The first phase of the multi-model ensemble has been designed with heterogeneous\nclassifier models. The second phase is based on the prediction results obtained from the first\nphase. Experiments were performed using the seizure prediction dataset from the University Hospital\nof Bonn.\n\n\nResults::\nComparison indicates 98.7% accuracy, with improvement of 5% from the existing model.\nHigh prediction levels indicate that the model is highly capable of providing accurate seizure\npredictions, hence ensuring its applicability in real time.\n\n\nConclusion::\nThe result of this paper has been compared with existing methods of predicting seizures\nand it indicated that the proposed model has better enhancement in the accuracy levels.\n\n\nother:\n.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/0118722121256663231019061211"
    },
    {
        "id": 16610,
        "title": "An improved parametric model for marine propeller: iPM4MP",
        "authors": "Long Zheng, Shunhuai Chen, Shengchen Ji, Zhenlin Chen",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.115712"
    },
    {
        "id": 16611,
        "title": "An effective feature selection using improved marine predators algorithm for Alzheimer’s disease classification",
        "authors": "Preeti Sadanand Topannavar, Dinkar M. Yadav",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "<span lang=\"EN-US\">Alzheimer’s disease (AD) is an irremediable neurodegenerative illness developed by the fast deterioration of brain cells. AD is mostly common in elder people and it extremely disturbs the physical and mental health of patients, therefore early detection is essential to prevent AD development. However, the precise detection of AD and mild cognitive impairment (MCI) is difficult during classification. In this paper, the Residual network i.e., ResNet-18 is used for extracting the features, and the proposed improved marine predators algorithm (IMPA) is developed for choosing the optimum features to perform an effective classification of AD. The multi-verse optimizer (MVO) used in the IMPA helps to balance exploration and exploitation, which leads to the selection of optimal relevant features. Further, the classification of AD is accomplished using the multiclass support vector machine (MSVM). Open access series of imaging studies-1 (OASIS-1) and Alzheimer disease neuroimaging initiative (ADNI) datasets are used to evaluate the IMPA-MSVM method. The performance of the IMPA-MSVM method is analyzed using accuracy, sensitivity, specificity, positive predictive value (PPV) and matthews correlation coefficient (MCC). The existing methods such as the <a name=\"_Hlk134426295\"></a>deep learning-based segmenting method using SegNet (DLSS), mish activation function (MAF) with spatial transformer network (STN) and BrainNet2D are used to evaluate the IMPA-MSVM method. The accuracy of IMPA-MSVM for the ADNI dataset is 98.43% which is more when compared to the DLSS and MAF-STN.</span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i5.pp5126-5134"
    },
    {
        "id": 16612,
        "title": "An improved peridynamic model for failure analysis of composite laminates",
        "authors": "X.W. Yang, W.C. Gao",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engfracmech.2023.109815"
    },
    {
        "id": 16613,
        "title": "YOLOv7-based attention and improved feature fusion small object detection algorithm",
        "authors": "Jingfeng Jingfeng Xiao, Xinxin Meng, Tao Wang, Wenzhong Yang",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3023546"
    },
    {
        "id": 16614,
        "title": "Gaussian kernelized feature selection and improved multilayer perceptive deep learning classifier for software fault prediction",
        "authors": "Sureka Sivavelu, Venkatesh Palanisamy",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "Software fault prediction is the significant process of identifying the errors or defects or faults in a software product. But, accurate and timely detection is the major challenging issue in different existing approaches to predicting software defects. A novel Gaussian linear feature embedding-based statistical test piecewise multilayer perceptive deep learning classifier (GLFE-STPMPDLC) is introduced to improve software fault prediction accuracy and minimize time consumption. First, the input data are collected from the dataset. Next, the software metrics selection is carried out to select the significant metrics using Gaussian kernelized locally linear embedding with lesser software fault prediction. Then classification is carried out by Kaiser Meyer piecewise multilayer perceptive deep learning classifier for software fault prediction. The novelty of Kaiser–Meyer–Olkin (KMO) correlation test analyzes testing and training instances. The innovation of the Heaviside step activation function is applied for analyzing the KMO correlation test results and providing the final software fault prediction results. Finally, accurate fault prediction outcomes are achieved at the output layer with lesser error. Simulation of proposed GLFE-STPMPDLC technique achieves better 5%, 3%, 3% and 3% enhancement of fault prediction accuracy, precision, recall, and f-measure and 13% faster prediction time compared to conventional methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v30.i3.pp1534-1547"
    },
    {
        "id": 16615,
        "title": "Improved bald eagle search optimization with entropy-based deep feature fusion model for breast cancer diagnosis on digital mammograms",
        "authors": "P. Ashwini, N. Suguna, N. Vadivelan",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17144-5"
    },
    {
        "id": 16616,
        "title": "Air Quality Prediction Based on Improved LSTM Model",
        "authors": "Ziqi Zhou",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccea58433.2023.10135512"
    },
    {
        "id": 16617,
        "title": "An Ensemble Feature Optimization for an Effective Heart Disease Prediction Model",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0430.42"
    },
    {
        "id": 16618,
        "title": "Machine Learning Based Customer Churn Prediction Using Improved Feature Selection Techniques",
        "authors": "Dr. Manish Sharma, Vaibhav Patel, Anurag Shrivastava",
        "published": "2023-10",
        "citations": 0,
        "abstract": "In the contemporary, fiercely competitive business environment, the retention of customers holds utmost significance for the continued growth and profitability of companies. Customer churn, which entails the defection of customers to rival services, stands out as a critical and prevalent challenge in a variety of sectors, spanning from telecommunications to e-commerce. This study delves into the realm of customer churn prediction, presenting an innovative approach that leverages machine learning and advanced feature selection techniques. The research utilizes a comprehensive dataset encompassing customer attributes, historical behavior, and churn labels. Employing state-of-the-art machine learning algorithms, including decision trees, random forests, and support vector machines, a predictive model is developed to identify potential churners accurately. The distinctive aspect of this study lies in its feature selection methodology, which integrates recursive feature elimination (RFE) with feature importance ranking. This hybrid approach refines the feature set, eliminating irrelevant or redundant variables, thereby enhancing model efficiency and interpretability. Empirical results showcase the effectiveness of the enhanced feature selection approach in improving predictive accuracy and model performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55083/irjeas.2023.v11i04005"
    },
    {
        "id": 16619,
        "title": "An Effective Anomaly Detection Model Combined Feature Selection with Improved CNN in SDN",
        "authors": "Yu Wang, Xiushuang Yi, Zhangjun Bao, Beiming Yu",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acctcs58815.2023.00048"
    },
    {
        "id": 16620,
        "title": "Improved Arabic image captioning model using feature concatenation with pre-trained word embedding",
        "authors": "Samar Elbedwehy, T. Medhat",
        "published": "2023-9",
        "citations": 1,
        "abstract": "AbstractAutomatic captioning of images contributes to identifying features of multimedia content and helps in the detection of interesting patterns, trends, and occurrences. English image captioning has recently made incredible progress; however, Arabic image captioning is still lagging. In the field of machine learning, Arabic image-caption generation is generally a very difficult problem. This paper presents a more accurate model for Arabic image captioning by using transformer models in both the encoder and decoder phases as feature extractors from images in the encoder phase and a pre-trained word embedding model in the decoder phase. The models are demonstrated, and all of them are implemented, trained, and tested on Arabic Flickr8k datasets. For the image feature extraction subsystem, we compared using three different individual vision models (SWIN, XCIT, and ConvNexT) with concatenation to get among them the most expressive extracted feature vector of the image, and for the caption generation lingual subsystem, which is tested by four different pre-trained language embedding models: (ARABERT, ARAELECTRA, MARBERTv2, and CamelBERT), to select from them the most accurate pre-trained language embedding model. Our experiments showed that building an Arabic image captioning system that uses a concatenation of the three transformer-based models ConvNexT combined with SWIN and XCIT as an image feature extractor, combined with the CamelBERT language embedding model produces the best results among the other combinations, having scores of 0.5980 with BLEU-1 and with ConvNexT combined with SWIN the araelectra language embedding model having a score of 0.1664 with BLEU-4 which are higher than the previously reported values of 0.443 and 0.157.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08744-1"
    },
    {
        "id": 16621,
        "title": "An Improved Fake News Detection Model by Applying a Recursive Feature Elimination Approach for Credibility Assessment and Uncertainty",
        "authors": "I. Y. Agarwal, D. P. Rana",
        "published": "2023-3",
        "citations": 1,
        "abstract": " World Health Organization (W.H.O) has coined the word “Infodemic” to refer to the dissemination of fake news during this pandemic, which is considered to be as harmful as the virus itself. Verifying the information available on the internet is a prerequisite to ensuring the ecosystem is maintained which is the driving force behind this work. The primary goal of this study is to address the problem of time-consuming automatically voluminous fake news detection of certain data and consider the uncertainty of data from causal relations using a rich feature set. This research produces significant feature reduction for reduced time and improved accuracy by filtering out significant features using recursive feature selection (RFE). The retained features by the RFE algorithm are also compared to a standard statistical measure of Pearson’s correlation to ensure no information loss while reducing features. The suggested methodology has also defined appropriate class output assurance levels and accurate prediction ambiguity for the fake identification jobs. Comparative analysis for existing methods for feature selection is performed. The result of experimentation testifies the improvement of a 6% increase in precision and a 97% reduction in execution time. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1752890922420089"
    },
    {
        "id": 16622,
        "title": "Multi-strategy augmented Harris hawks optimization: performance design for feature selection",
        "authors": "Zisong Zhao, Helong Yu, Hongliang Guo, Huiling Chen",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "Abstract\nIn the context of increasing data scale, contemporary optimization algorithms struggle with cost and complexity in addressing the feature selection (FS) problem. This paper introduces a Harris hawks optimization (HHO) variant, enhanced with a multi-strategy augmentation (CXSHHO), for FS. The CXSHHO incorporates a communication and collaboration strategy (CC) into the baseline HHO, facilitating better information exchange among individuals, thereby expediting algorithmic convergence. Additionally, a directional crossover (DX) component refines the algorithm's ability to thoroughly explore the feature space. Furthermore, the soft-rime strategy (SR) broadens population diversity, enabling stochastic exploration of an extensive decision space and reducing the risk of local optima entrapment. The CXSHHO's global optimization efficacy is demonstrated through experiments on 30 functions from CEC2017, where it outperforms 15 established algorithms. Moreover, the paper presents a novel FS method based on CXSHHO, validated across 18 varied datasets from UCI. The results confirm CXSHHO's effectiveness in identifying subsets of features conducive to classification tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jcde/qwae030"
    },
    {
        "id": 16623,
        "title": "Dynamic model and application analysis of flow field interference between marine risers based on improved shielding effect model",
        "authors": "Yongli Hu, Lijie Li, Xiangyin He, Xiong Hu",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.115001"
    },
    {
        "id": 16624,
        "title": "Retracted: Improved Design of Engineering Cost Model Based on Improved Genetic Algorithm",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9792173"
    },
    {
        "id": 16625,
        "title": "Multi-strategy improved tuna swarm optimization algorithm for feature selection of network intrusion detection",
        "authors": "Zhengbin Qin, Hui Xu, Yang Jin, Lang Huang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2684691"
    },
    {
        "id": 16626,
        "title": "A Condensed Hybrid Feature Selector for Enhancing the Classifiers Performance using TOPSIS and Improved Rao Optimization",
        "authors": "S.Appavu Alias Balamurugan, Karthik Kannan A. S, Millie Pant",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbidm.2024.10062647"
    },
    {
        "id": 16627,
        "title": "Model Predictive Current Control Improved Performance on SRM Drive for Electric Vehicles",
        "authors": "M. Deepak, G. Janaki, C. Bharatiraja",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itec-india59098.2023.10471377"
    },
    {
        "id": 16628,
        "title": "Performance Analysis of Improved Technique for Optimal Frequency Spectrum Utilization Considering Energy and Eigenvalue Detectors",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7176/isde/13-2-04"
    },
    {
        "id": 16629,
        "title": "Improved Interpretation of Feature Relevances:  Iterated Relevance Matrix Analysis (IRMA)",
        "authors": "Michael Biehl, Sofie Lövdal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-127"
    },
    {
        "id": 16630,
        "title": "Categorical Feature Encoding Techniques for Improved Classifier Performance when Dealing with Imbalanced Data of Fraudulent Transactions",
        "authors": "Dalia Breskuvienė, Gintautas Dzemyda",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "Fraudulent transaction data tend to have several categorical features with high cardinality. It makes data preprocessing complicated if categories in such features do not have an order or meaningful mapping to numerical values. Even though many encoding techniques exist, their impact on highly imbalanced massive data sets is not thoroughly evaluated.\r\nTwo transaction datasets with an imbalance lower than 1\\% of frauds have been used in our study. Six encoding methods were employed, which belong to either target-agnostic or target-based groups. The experimental procedure has involved the use of several machine-learning techniques, such as ensemble learning, along with both linear and non-linear learning approaches.\r\nOur study emphasizes the significance of carefully selecting an appropriate encoding approach for imbalanced datasets and machine learning algorithms. Using target-based encoding techniques can enhance model performance significantly. Among the various encoding methods assessed, the James-Stein and Weight of Evidence (WOE) encoders were the most effective, whereas the CatBoost encoder may not be optimal for imbalanced datasets. Moreover, it is crucial to bear in mind the curse of dimensionality when employing encoding techniques like hashing and One-Hot encoding.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15837/ijccc.2023.3.5433"
    },
    {
        "id": 16631,
        "title": "Hybrid Feature Extraction Based Deep Learning Model for Offline Signature Verification",
        "authors": "Tong Xiong, Xin Zhang",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csecs60003.2023.10428270"
    },
    {
        "id": 16632,
        "title": "Breast cancer prediction and feature importance estimation leveraging logistic regression model",
        "authors": "Ruining Han",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "In 2022, breast cancer become the largest cancer among the world. It is necessary to help people know how to prevent breast cancer. Machine learning use algorithms and statistic models to help the computer find some rules based on mass data. It can rapidly analyse, predict, and process the data in a timely enough manner. By significantly reducing errors caused by data duplication and other inaccuracies, it can simplify time-intensive documentation in data entry. In medicine, it can facilitate accurate medical prediction and diagnosis by quickly identifying high-risk patients, recommending a range of drugs, and predicting readmission rates. This paper will use Logistic Regression to build a model to predict the whether a patient will develop cancer and find the dominant factors from the characteristic values. The research found that Bare Nuclei, Clump Thickness, and Single Epithelial Cell Size are the key factors that will create a large impact to the result of the predication.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/17/20230929"
    },
    {
        "id": 16633,
        "title": "Heterogeneous Ensemble Feature Selection Model (HEFSM) for Big Data Analytics",
        "authors": "M. Priyadharsini, K. Karuppasamy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.031115"
    },
    {
        "id": 16634,
        "title": "Feature Engineering and Model Optimization Based Classification Method for Network Intrusion Detection",
        "authors": "Yujie Zhang, Zebin Wang",
        "published": "2023-8-18",
        "citations": 3,
        "abstract": "In light of the escalating ubiquity of the Internet, the proliferation of cyber-attacks, coupled with their intricate and surreptitious nature, has significantly imperiled network security. Traditional machine learning methodologies inherently exhibit constraints in effectively detecting and classifying multifarious cyber threats. Specifically, the surge in high-dimensional network traffic data and the imbalanced distribution of classes exacerbate the predicament of ideal classification performance. Notably, the presence of redundant information within network traffic data undermines the accuracy of classifiers. To address these challenges, this study introduces a novel approach for intrusion detection classification which integrates advanced techniques of feature engineering and model optimization. The method employs a feature engineering approach that leverages mutual information maximum correlation minimum redundancy (mRMR) feature selection and synthetic minority class oversampling technique (SMOTE) to process network data. This transformation of raw data into more meaningful features effectively addresses the complexity and diversity inherent in network data, enhancing classifier accuracy by reducing feature redundancy and mitigating issues related to class imbalance and the detection of rare attacks. Furthermore, to optimize classifier performance, the paper applies the Optuna method to fine-tune the hyperparameters of the Catboost classifier, thereby determining the optimal model configuration. The study conducts binary and multi-classification experiments using publicly available datasets, including NSL_KDD, UNSW-NB15, and CICIDS-2017. Experimental results demonstrate that the proposed method outperforms traditional approaches regarding accuracy, recall, precision, and F-value. These findings highlight the method’s potential and performance in network intrusion detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13169363"
    },
    {
        "id": 16635,
        "title": "Introducing feature matching and smoothing loss: a novel GAN for improved sample generation",
        "authors": "J. Yang, F. Liu, J. Mi, S. Yin, L. Bai",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1699"
    },
    {
        "id": 16636,
        "title": "Nanostructured coating strategies of cathode for improved sodium ion battery performance",
        "authors": "Vimal K. Tiwari, Rajendra Kumar Singh",
        "published": "2023-9",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cej.2023.144592"
    },
    {
        "id": 16637,
        "title": "Improved feature selection using a hybrid side-blotched lizard algorithm and genetic algorithm approach",
        "authors": "Amr Abdel-aal, Ibrahim El-Henawy",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "<span lang=\"EN-US\">Feature selection entails choosing the significant features among a wide collection of original features that are essential for predicting test data using a classifier. Feature selection is commonly used in various applications, such as bioinformatics, data mining, and the analysis of written texts, where the dataset contains tens or hundreds of thousands of features, making it difficult to analyze such a large feature set. Removing irrelevant features improves the predictor performance, making it more accurate and cost-effective. In this research, a novel hybrid technique is presented for feature selection that aims to enhance classification accuracy. A hybrid binary version of side-blotched lizard algorithm (SBLA) with genetic algorithm (GA), namely SBLAGA, which combines the strengths of both algorithms is proposed. We use a sigmoid function to adapt the continuous variables values into a binary one, and evaluate our proposed algorithm on twenty-three standard benchmark datasets. Average classification accuracy, average number of selected features and average fitness value were the evaluation criteria. According to the experimental results, SBLAGA demonstrated superior performance compared to SBLA and GA with regards to these criteria. We further compare SBLAGA with four wrapper feature selection methods that are widely used in the literature, and find it to be more efficient.</span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i5.pp5737-5746"
    },
    {
        "id": 16638,
        "title": "An improved continuous and discrete Harris Hawks optimiser applied to feature selection for image steganalysis",
        "authors": "Ankita Gupta, Rita Chhikara, Prabha Sharma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcse.2023.10060447"
    },
    {
        "id": 16639,
        "title": "Improved YOLOv5-based detection model for Mycobacterium",
        "authors": "Baoliang Lv, Hong Lan",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291703"
    },
    {
        "id": 16640,
        "title": "Sequence-based prediction of protein–protein interaction using auto-feature engineering of RNN-based model",
        "authors": "Bhawna Mewara, Soniya Lalwani",
        "published": "2023-2-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42600-023-00273-z"
    },
    {
        "id": 16641,
        "title": "Deep spatial-temporal travel time prediction model based on trajectory feature",
        "authors": "Zhaoyu Sheng, Zhiqiang Lv, Jianbo Li, Zhihao Xu",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compeleceng.2023.108868"
    },
    {
        "id": 16642,
        "title": "Phonetic Feature Extraction and Recognition Model in Korean Pronunciation Practice Based on AdaBoost",
        "authors": "Chunying Wang",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "This paper proposes a phonetic feature extraction and recognition model in Korean pronunciation exercises based on AdaBoot moments. Feature extraction algorithms have a great influence on speech emotion recognition algorithms, among which Mel-frequency Cepstral Coefficients (MFCC) is the most commonly used feature in speech emotion recognition. The feature extraction method and the influence of SVM kernel function and parameter selection on the recognition result are studied, and the existing speech feature extraction algorithms and their respective advantages and disadvantages are analyzed, as well as the influence of different kernel functions, kernel parameters and penalty parameters on the recognition performance. An improved grid optimization method is used to further improve the recognition time of voice information.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1204.1036"
    },
    {
        "id": 16643,
        "title": "An improved feature point-based LK optical flow algorithm for robotic arm control",
        "authors": "xingrui shi, wei xu, jiyao wang",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2680052"
    },
    {
        "id": 16644,
        "title": "The performance of MFCC feature extraction for guitar chord recognition",
        "authors": "Linggo Sumarno",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0115118"
    },
    {
        "id": 16645,
        "title": "Retracted: High-Performance Computational Recognition of Communication Signals Based on Bispectral Quadratic Feature Model",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9873784"
    },
    {
        "id": 16646,
        "title": "Real-Time Multi-Feature Approximation Model-Based Efficient Brain Tumor Classification Using Deep Learning Convolution Neural Network Model",
        "authors": "Amarendra Reddy Panyala, M. Baskar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.037050"
    },
    {
        "id": 16647,
        "title": "A Model-Agnostic Feature Selection Technique to Improve the Performance of One-Class Classifiers",
        "authors": "John Hancock, Richard Bauder, Taghi M. Khoshgoftaar",
        "published": "2023-11-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictai59109.2023.00021"
    },
    {
        "id": 16648,
        "title": "An improved semi-analytical model for evaluating performance of gas turbine power plants",
        "authors": "Samira Pourhedayat, Eric Hu, Lei Chen",
        "published": "2023-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2022.126583"
    },
    {
        "id": 16649,
        "title": "Artificial Intelligence based Technique for Solar Irradiance Prediction Model with Improved Performance",
        "authors": "Rishabh Singh, Ashish Kumar Singhal",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/resem57584.2023.10236416"
    },
    {
        "id": 16650,
        "title": "Improved Fractional Feature Analysis for Face Recognition",
        "authors": "Lin Yang, Dinghua Xu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4363960"
    },
    {
        "id": 16651,
        "title": "Improved Swarm Intelligence Optimization Model with Mutual Information Estimation for Feature Selection in Microarray Bioinformatics Datasets for Diseases Diagnosis",
        "authors": "Peddarapu Rama Krishna, Pothuraju Rajarajeswari",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5391/ijfis.2023.23.2.117"
    },
    {
        "id": 16652,
        "title": "Design of prediction model for multiple feature-type problems based on improved PSO-RBF neural network",
        "authors": "Ruiqi Yang, Yujing Shang, Jiangxiu Yao, Rui Su, Junjie Zhou, Liulu Tang",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciscae59047.2023.10393737"
    },
    {
        "id": 16653,
        "title": "Multi-Feature Fusion Book Recommendation Model Based on Deep Neural Network",
        "authors": "Zhaomin Liang, Tingting Liang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.037124"
    },
    {
        "id": 16654,
        "title": "Visualising instance selection for improved explainability using feature extraction",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.yeo34"
    },
    {
        "id": 16655,
        "title": "Semi-supervised fault diagnosis of gearbox based on feature pre-extraction mechanism and improved generative adversarial networks under limited labeled samples and noise environment",
        "authors": "Lijie Zhang, Bin Wang, Pengfei Liang, Xiaoming Yuan, Na Li",
        "published": "2023-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2023.102211"
    },
    {
        "id": 16656,
        "title": "A hybrid model with combined feature selection based on optimized VMD and improved multi-objective coati optimization algorithm for short-term wind power prediction",
        "authors": "Chao Wang, Hong Lin, Heng Hu, Ming Yang, Li Ma",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2024.130684"
    },
    {
        "id": 16657,
        "title": "Regional Dance Image Feature Recognition Model and Contemporary Inheritance Modeling Algorithm Based on Intangible Cultural Heritage Filter Algorithm",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1207.1030"
    },
    {
        "id": 16658,
        "title": "An ECG Biometric System Based on Empirical Mode Decomposition and Hilbert-Huang Transform for Improved Feature Extraction",
        "authors": "Hatem Zehir, Toufik Hafs, Sara Daas, Amine Nait-Ali",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/biosmart58455.2023.10162055"
    },
    {
        "id": 16659,
        "title": "An Improved Anchor-Free Nodule Detection System Using Feature Pyramid Network",
        "authors": "Wenjia Song, Fangfang Tang, Henry Marshall, Kwun M Fong, Feng Liu",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/embc40787.2023.10340341"
    },
    {
        "id": 16660,
        "title": "An improved integration strategy for prediction of shear wave velocity using petrophysical logs: Integration of spatiotemporal and small sample nonlinear feature",
        "authors": "Jiuqiang Yang, Niantian Lin, Kai Zhang, Lingyun Jia, Dong Zhang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geoen.2023.212270"
    },
    {
        "id": 16661,
        "title": "Oil Price Forecasting based on Improved SARIMA Model",
        "authors": "Yaobin Wang",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Oil Price is important to countries and people. As Black Gold, Oil is considered the blood of the industry. People in modern cities are surrounded by crude oil and its derivatives, such as petrol for cars, plastic products for storing food, etc. Thus, the changing price of oil can have a profound effect on people and countries. The prediction of oil prices can lessen the impact. Once people and the government know the future price of oil, then people and government can adjust their behavior. This study leverages the Seasonal Autoregressive Integrated Moving Average (SARIMA) model to find the parameters of estimation and forecasts. The study uses Brent crude oil prices from May 1987 to July 2022. The study result shows that the price of oil is hard to predict based on the Brent crude oil prices. The study also discussed some protentional reasons why the SARIMA model cannot predict the price so accurately even if the method is correct.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v39i.6535"
    },
    {
        "id": 16662,
        "title": "Optimizing multimodal feature selection using binary reinforced cuckoo search algorithm for improved classification performance",
        "authors": "Kalaipriyan Thirugnanasambandam, Jayalakshmi Murugan, Rajakumar Ramalingam, Mamoon Rashid, R. S. Raghav, Tai-hoon Kim, Gabriel Avelino Sampedro, Mideth Abisado",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "\nBackground\nFeature selection is a vital process in data mining and machine learning approaches by determining which characteristics, out of the available features, are most appropriate for categorization or knowledge representation. However, the challenging task is finding a chosen subset of elements from a given set of features to represent or extract knowledge from raw data. The number of features selected should be appropriately limited and substantial to prevent results from deviating from accuracy. When it comes to the computational time cost, feature selection is crucial. A feature selection model is put out in this study to address the feature selection issue concerning multimodal.\n\n\nMethods\nIn this work, a novel optimization algorithm inspired by cuckoo birds’ behavior is the Binary Reinforced Cuckoo Search Algorithm (BRCSA). In addition, we applied the proposed BRCSA-based classification approach for multimodal feature selection. The proposed method aims to select the most relevant features from multiple modalities to improve the model’s classification performance. The BRCSA algorithm is used to optimize the feature selection process, and a binary encoding scheme is employed to represent the selected features.\n\n\nResults\nThe experiments are conducted on several benchmark datasets, and the results are compared with other state-of-the-art feature selection methods to evaluate the effectiveness of the proposed method. The experimental results demonstrate that the proposed BRCSA-based approach outperforms other methods in terms of classification accuracy, indicating its potential applicability in real-world applications. In specific on accuracy of classification (average), the proposed algorithm outperforms the existing methods such as DGUFS with 32%, MBOICO with 24%, MBOLF with 29%, WOASAT 22%, BGSA with 28%, HGSA 39%, FS-BGSK 37%, FS-pBGSK 42%, and BSSA 40%.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1816"
    },
    {
        "id": 16663,
        "title": "Combining feature fusion link prediction with graph neural networks",
        "authors": "Yamin Zheng, Yongli Wang, Xiaoze Gong",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2673308"
    },
    {
        "id": 16664,
        "title": "Adaptive Feature Engineering via Attention-based LSTM towards High Performance Reconnaissance Attack Detection",
        "authors": "Hamidah Alanazi, Shengping Bi, Tao Wang, Tao Hou",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/milcom58377.2023.10356354"
    },
    {
        "id": 16665,
        "title": "Performance Comparison of Boosting Algorithms in Spices Classification Using Histogram of Oriented Gradient Feature Extraction",
        "authors": "",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30596/jcositte.v4i1.13710"
    },
    {
        "id": 16666,
        "title": "Improved multistep model predictive control method with reduced finite set for MMC-UPQC",
        "authors": "Chang Jiang, Shaohua Zhang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.conengprac.2023.105773"
    },
    {
        "id": 16667,
        "title": "Research on Construction Risk Assessment of Desert Roadbed Engineering Based on Improved Expandable Cloud Model",
        "authors": "Hui Shan, Zhen Luo, Shouxu Wang",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3724/j.issn.1674-4969.20240011"
    },
    {
        "id": 16668,
        "title": "Application of multi-algorithm mixed feature extraction model in underwater acoustic signal",
        "authors": "Feng Liu, Guohui Li, Hong Yang",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2024.116959"
    },
    {
        "id": 16669,
        "title": "A charged particle-inspired sampling scheme for improved surrogate model quality",
        "authors": "Andriy Prots, Matthias Voigt, Ronald Mailach",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.probengmech.2023.103447"
    },
    {
        "id": 16670,
        "title": "Improved plastic-damage cap model for shear behavior predictions of plain and reinforced concrete members",
        "authors": "Yang He, Wei Fan",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2023.116070"
    },
    {
        "id": 16671,
        "title": "A spectrum improved peridynamic model for shock wave problems",
        "authors": "Jinggao Zhu, Xiaodan Ren",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijimpeng.2022.104387"
    },
    {
        "id": 16672,
        "title": "A deep learning prediction model of DenseNet-LSTM for concrete gravity dam deformation based on feature selection",
        "authors": "Ye Zhang, Wen Zhong, Yanlong Li, Lifeng Wen",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2023.116827"
    },
    {
        "id": 16673,
        "title": "A novel high-performance junctionless 4H-SiC trench MOSFET with improved switching characteristics",
        "authors": "B. Zerroumda, H. Ferhati, F. Djeffal, S. Benaggoune",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mee.2023.112011"
    },
    {
        "id": 16674,
        "title": "An Improved Shallow Feature Extraction Structure and Fused Attention Module for Aided Diagnosis of Avionic Electrical Fault Phenomena Method",
        "authors": "Lishan Jia, Junwen Chen",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbaie59714.2023.10281340"
    },
    {
        "id": 16675,
        "title": "Prediction of stock price movement using an improved NSGA-II-RF algorithm with a three-stage feature engineering process",
        "authors": "Xiaohua Zeng, Jieping Cai, Changzhou Liang, Chiping Yuan",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "Prediction of stock price has been a hot topic in artificial intelligence field. Computational intelligent methods such as machine learning or deep learning are explored in the prediction system in recent years. However, making accurate predictions of stock price direction is still a big challenge because stock prices are affected by nonlinear, nonstationary, and high dimensional features. In previous works, feature engineering was overlooked. How to select the optimal feature sets that affect stock price is a prominent solution. Hence, our motivation for this article is to propose an improved many-objective optimization algorithm integrating random forest (I-NSGA-II-RF) algorithm with a three-stage feature engineering process in order to decrease the computational complexity and improve the accuracy of prediction system. Maximizing accuracy and minimizing the optimal solution set are the optimization directions of the model in this study. The integrated information initialization population of two filtered feature selection methods is used to optimize the I-NSGA-II algorithm, using multiple chromosome hybrid coding to synchronously select features and optimize model parameters. Finally, the selected feature subset and parameters are input to the RF for training, prediction, and iterative optimization. Experimental results show that the I-NSGA-II-RF algorithm has the highest average accuracy, the smallest optimal solution set, and the shortest running time compared to the unmodified multi-objective feature selection algorithm and the single target feature selection algorithm. Compared to the deep learning model, this model has interpretability, higher accuracy, and less running time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0287754"
    },
    {
        "id": 16676,
        "title": "E-Learning Model to Improve Students' Performance",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7176/isde/14-1-02"
    },
    {
        "id": 16677,
        "title": "Age Estimation from Facial Photos: A CNN-Based Approach with Multi-Model Feature Fusion",
        "authors": "Zixuan Lyu",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "This study was designed to improve the accuracy and efficiency of facial age recognition by training and tuning advanced deep learning models. This study evaluated the performance using the UTK Face dataset and multiple deep learning models for the facial age recognition task and found that a three-model fusion (EfficientNetB0, DenseNet121, and Inception V3) had the best accuracy and generalization ability. The study also tried adding a Transformer layer, but the results were not significantly improved. Triple Model Fusion (EfficientNetB0, DenseNet121, and Inception V3) with the addition of the Transformer layer had an overall accuracy of 64%, which was slightly lower than the version without the Transformer (65% accuracy). Triple Model Fusion performed in all tested configurations Best with 65% accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/g24fan25"
    },
    {
        "id": 16678,
        "title": "A video description model integrating feature reinforcement and knowledge supplement",
        "authors": "Wanwan Cao, Shuai Gong, Xiaoling Dong, Min Zhang",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291493"
    },
    {
        "id": 16679,
        "title": "Time Domain Feature Enhancement Model Based on Correlated B-spline Wavelet Base Convolutional Sparse",
        "authors": "Jiawei Lin",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14270/ijce2023.a00250.9"
    },
    {
        "id": 16680,
        "title": "Walmart sales prediction based on random forest model and application of feature importance",
        "authors": "Deli Chen",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": " Sales forecasting is crucial for efficient resource allocation and inventory management in retail. This study employs Random Forest to predict weekly sales for 45 Walmart stores, leveraging a diverse dataset with store-specific sales and external factors. Through meticulous preprocessing and model application, one achieves outstanding accuracy, with a Weighted Mean Absolute Error (WMAE) as low as 1.2030 and an impressive accuracy rate of 98.8%. Additionally, integrating feature importance ranking sheds light on influential variables in sales forecasting. This study provides a blueprint for developing precise and adaptable sales forecasting models, offering profound significance for the retail industry. It underscores the effectiveness of machine learning techniques, e.g., Random Forest and insightful feature engineering in achieving highly accurate predictions. By enhancing the industry's understanding of intricate sales dynamics, this research contributes to optimizing resource allocation, inventory management, and strategic planning. Ultimately, it drives operational efficiency and success in the dynamic landscape of the retail sector.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/53/20241461"
    },
    {
        "id": 16681,
        "title": "A High-Temperature Strain-Compensated Arrhenius-Type Constitutive Model and an Improved Avrami-Type Dynamic Recrystallization Model of 40CrNiMo",
        "authors": "Huo Yuan-ming, Huo Cun-long, He Tao, Seyed Reza Elmi Hosseini, Chen Gang, Jia Chang-yuan, Liu Ke-ran, Wang Bao-yu, Du Xiang-yang",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11665-023-08600-2"
    },
    {
        "id": 16682,
        "title": "DR-XGBoost: An XGBoost model for field-road segmentation based on dual feature extraction and recursive feature elimination",
        "authors": "Yuzhen Xiao,  , Guozhao Mo, Xiya Xiong, Jiawen Pan, Bingbing Hu, Caicong Wu, Weixin Zhai",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25165/j.ijabe.20231603.8187"
    },
    {
        "id": 16683,
        "title": "Aeroengine Remaining Life Prediction Using Feature Selection and Improved SE Blocks",
        "authors": "Hairui Wang, Shijie Xu, Guifu Zhu, Ya Li",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "Aeroengines use numerous sensors to detect equipment health and ensure proper operation. Currently, filtering useful sensor data and removing useless data is challenging in predicting the remaining useful life (RUL) of an aeroengine using deep learning. To reduce computational costs and improve prediction performance, we use random forest to evaluate the feature importance of sensor data. Based on the size of the feature corresponding to the Gini index, we select the appropriate sensor. This helps us to determine which sensor to use and ensures that the computational resources are not wasted on unnecessary sensors. Considering that the RUL of equipment changes in a progressively more complex manner as the equipment is used over time, we propose an improved squeeze and excitation block (SSE) and combine it with a convolutional neural network (CNN). By enhancing the feature selection ability of CNN through segmented squeeze and excitation block, the model can focus on important information within features to effectively improve prediction performance. We compared our experiments with other RUL experiments on the CMAPSS aeroengine dataset and then conducted ablation experiments to verify the critical role of the methods we used.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/6465566"
    },
    {
        "id": 16684,
        "title": "Retracted: Parameter Identification of 3D Elastic-Plastic Model for Tunnel Engineering Based on Improved Genetic Algorithm",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9828940"
    },
    {
        "id": 16685,
        "title": "An improved on-state model for trench gate IGBT",
        "authors": "Yong Tang, Hui Liu",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011619"
    },
    {
        "id": 16686,
        "title": "Automated feature selection using improved migrating birds optimization for enhanced medical diagnosis",
        "authors": "Naoual El aboudi, Youness Riouali, Ahmed Reda Maminou, Hassane Jabri, Laila Benhlima",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "The feature selection task is a crucial phase in data analysis, aiming to identify a minimized set of relevant features for the target class, thereby eliminating irrelevant and redundant attributes used for model training. While population-based feature selection approaches offer prominent solutions for classification performance, their computational time can be prohibitive. To mitigate delays and optimize resource utilization, this study adopts machine learning operations (MLOps). MLOps involves the seamless transition of experimental Machine Learning models into production, serving them to end users and automating the feature selection phase. This paper introduces a novel feature selection method based on improved migrating bird optimization and its automated variant integrated into MLOps. Experiments conducted on six medical datasets validate the effectiveness of our proposed feature selection method in improving the outcomes of medical diagnosis systems. The results showcase satisfactory performance in terms of classification compared to concurrent feature selection algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v14i3.pp3159-3167"
    },
    {
        "id": 16687,
        "title": "An improved lift model for Euler-Lagrange simulations of bubble columns",
        "authors": "Rahul Subburaj, Yali Tang, Niels G. Deen",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ces.2022.118182"
    },
    {
        "id": 16688,
        "title": "BILSTM-SimAM: An improved algorithm for short-term electric load forecasting based on multi-feature",
        "authors": "Mingju Chen, Fuhong Qiu, Xingzhong Xiong, Zhengwei Chang, Yang Wei, Jie Wu",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract>\n\t\t\t<p>With the growing number of user-side resources connected to the distribution system, an occasional imbalance between the distribution side and the user side arises, making short-term power load forecasting technology crucial for addressing this issue. To strengthen the capability of load multi-feature extraction and improve the accuracy of electric load forecasting, we have constructed a novel BILSTM-SimAM network model. First, the entirely non-recursive Variational Mode Decomposition (VMD) signal processing technique is applied to decompose the raw data into Intrinsic Mode Functions (IMF) with significant regularity. This effectively reduces noise in the load sequence and preserves high-frequency data features, making the data more suitable for subsequent feature extraction. Second, a convolutional neural network (CNN) mode incorporates Dropout function to prevent model overfitting, this improves recognition accuracy and accelerates convergence. Finally, the model combines a Bidirectional Long Short-Term Memory (BILSTM) network with a simple parameter-free attention mechanism (SimAM). This combination allows for the extraction of multi-feature from the load data while emphasizing the feature information of key historical time points, further enhancing the model's prediction accuracy. The results indicate that the R<sup>2</sup> of the BILSTM-SimAM algorithm model reaches 97.8%, surpassing mainstream models such as Transformer, MLP, and Prophet by 2.0%, 2.7%, and 3.6%, respectively. Additionally, the remaining error metrics also show a reduction, confirming the validity and feasibility of the method proposed.</p>\n\t\t</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2024102"
    },
    {
        "id": 16689,
        "title": "Implementation of Six Single Classifiers and Feature Selection for Performance Enhancement in Anomaly-Based Intrusion Detection",
        "authors": "",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/23488549/ijece-v11i3p118"
    },
    {
        "id": 16690,
        "title": "Construction of an Improved Intuitionistic Fuzzy Cloud Theory Performance Evaluation Model",
        "authors": "Caichuan Wang, Jiajun Li, Yun He",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390051"
    },
    {
        "id": 16691,
        "title": "Flower image classification based on an improved lightweight neural network with multi-scale feature fusion and attention mechanism",
        "authors": "Zhigao Zeng, Cheng Huang, Wenqiu Zhu, Zhiqiang Wen, Xinpan Yuan",
        "published": "2023",
        "citations": 2,
        "abstract": "<abstract><p>In order to solve the problem that deep learning-based flower image classification methods lose more feature information in the early feature extraction process, and the model takes up more storage space, a new lightweight neural network model based on multi-scale feature fusion and attention mechanism is proposed in this paper. First, the AlexNet model is chosen as the basic framework. Second, a multi-scale feature fusion module (MFFM) is used to replace the shallow single-scale convolution. MFFM, which contains three depthwise separable convolution branches with different sizes, can fuse features with different scales and reduce the feature loss caused by single-scale convolution. Third, two layers of improved Inception module are first added to enhance the extraction of deep features, and a layer of hybrid attention module is added to strengthen the focus of the model on key information at a later stage. Finally, the flower image classification is completed using a combination of global average pooling and fully connected layers. The experimental results demonstrate that our lightweight model has fewer parameters, takes up less storage space and has higher classification accuracy than the baseline model, which helps to achieve more accurate flower image recognition on mobile devices.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023619"
    },
    {
        "id": 16692,
        "title": "Improved Engine Performance Using Ozone Generator",
        "authors": "Herlang Anantama, Erika Achmad Fuad, Budi Waluyo, Saifudin Saifudin",
        "published": "2023-7-22",
        "citations": 0,
        "abstract": "An increase in the number of vehicles today will result in an increase in fuel oil consumption and emission pollution. Therefore, it is necessary to optimize for fuel oil economy and emission reduction by improving engine performance. Improving engine performance can be done through several factors, including; with compression ratio, volumetric efficiency and fuel quality. The purpose of this study is to prove that with the addition of ozone (O3) the combustion process will be more reactive than oxygen (O2) so that it can produce faster and more complete combustion, This study will convert oxygen (O2) into more reactive ozone (O3) by using a 15 g/h plasma plasma generator ozone installed on an air filter. Engine performance testing includes engine power and torque using a 50L super dyno type dynamometer chassis. The test results showed, with ozone generator engine torque increased from 0 – 0.5 Nm and increased engine power from 0 – 0.4 KW compared to without using an ozone generator. Nevertheless, the use of ozone (O3) at a high equivalent ratio can lead to knocking",
        "keywords": "",
        "link": "http://dx.doi.org/10.31603/benr.9083"
    },
    {
        "id": 16693,
        "title": "Dew-point evaporative cooling of PV panels for improved performance",
        "authors": "Cheng Yang, Jie Lin, Frantisek Miksik, Takahiko Miyazaki, Kyaw Thu",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.applthermaleng.2023.121695"
    },
    {
        "id": 16694,
        "title": "Low lateral stiffness underground structures for improved seismic performance. Application to the Kobe Daikai station",
        "authors": "Xiangbo Bu, Alberto Ledesma, Francisco López-Almansa",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2023.116388"
    },
    {
        "id": 16695,
        "title": "Design and Improved performance of High gain Wearable Textile Antenna",
        "authors": "K. Thilagam, K. Poyamozhi",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecie58751.2024.10457350"
    },
    {
        "id": 16696,
        "title": "Vehicle Feature Recognition via a Convolutional Neural Network with an Improved Bird Swarm Algorithm",
        "authors": "Xuan Chen Xuan Chen",
        "published": "2023-3",
        "citations": 0,
        "abstract": "\n                        <p>Accurate vehicle feature recognition is an important element in traffic intelligence systems. To address the problems of slow convergence and weak generalization ability in using convolutional neural networks to improve vehicle feature recognition, we propose an improved bird swarm algorithm to optimize convolutional neural networks (IBSA-CNNs) for vehicle recognition strategies. First, we use the center of gravity backward learning strategy and similarity- and aggregation-based optimization strategy in population initialization and foraging behavior, respectively, to improve the algorithm performance and avoid falling into a local optimum. Second, the improved bird swarm algorithm is used to optimize the weights of the convolutional and pooling layers of the convolutional neural network to improve the neural network performance. Finally, we tested the performance of the improved bird swarm algorithm in simulation experiments using benchmark functions. The recognition performance of IBSA-CNN was tested by the UCI dataset, and in the traffic vehicle dataset BIT-Vehicle, it improved 4.9% and 6.8% compared with R-CNN and CNN, respectively, indicating that IBSA-CNN has better vehicle feature recognition.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/160792642023032402020"
    },
    {
        "id": 16697,
        "title": "An Hybrid of Ensemble Model and Feature Extraction Algorithm for Classification of Protein Structural Class Prediction",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/7-2-556"
    },
    {
        "id": 16698,
        "title": "Kinship Detection Based on Hand Geometry Using ResNet50 Model for Feature Extraction",
        "authors": "Sarah Fathi, Mazin Aziz",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33899/arej.2024.145748.1321"
    },
    {
        "id": 16699,
        "title": "Enhancing Performance of End-to-End Gujarati Language ASR using combination of Integrated Feature Extraction and Improved Spell Corrector Algorithm",
        "authors": "Bhavesh Bhagat, Mohit Dua",
        "published": "2023",
        "citations": 0,
        "abstract": "A number of intricate deep learning architectures for effective End-to-End (E2E) speech recognition systems have emerged due to recent advancements in algorithms and technical resources. The proposed work develops an ASR system for the publicly accessible dataset on Gujarati language. The approach provided in this research combines features like Mel frequency Cepstral Coefficients (MFCC) and Constant Q Cepstral Coefficients (CQCC) at front-end feature extraction methodologies. Enhanced spell corrector with BERT-based algorithm and Gated Recurrent Units (GRU) based DeepSpeech2 architecture are used to implement the back end portion of the proposed ASR system. The proposed study shown that combining the MFCC features and CQCC features extracted from speech with the GRU-based DeepSpeech2 model and the upgraded or enhanced spell corrector improves the Word Error Rate (WER) by 17.46% when compared to the model without post processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/itmconf/20235401016"
    },
    {
        "id": 16700,
        "title": "A Time Series Regression Model via Improved PCA and Bagging Algorithms",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajets.2023.060505"
    },
    {
        "id": 16701,
        "title": "Evaluating the impact of tuned pre-trained architectures' feature maps on deep learning model performance for tomato disease detection",
        "authors": "Halit Bakır",
        "published": "2023-11-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17503-2"
    },
    {
        "id": 16702,
        "title": "Time and performance comparison on suicide detection using various feature engineering and machine learning models",
        "authors": "Kittisak Thongsi, Nannaphas Booncherd, Pokpong Songmuang",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/kst57286.2023.10086874"
    },
    {
        "id": 16703,
        "title": "Improved BP neural network application model based on PSO",
        "authors": "Nan Qian, Ke Li",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263337"
    },
    {
        "id": 16704,
        "title": "Aircraft Trajectory Prediction Model Based on Improved GRU Structure",
        "authors": "Zexuan Chen, Lan Wang",
        "published": "2023-1-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccece58074.2023.10135263"
    }
]