[
    {
        "id": 1301,
        "title": "VC dimensions of group convolutional neural networks",
        "authors": "Philipp Christian Petersen, Anna Sepliarskaia",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.012"
    },
    {
        "id": 1302,
        "title": "Logarithmic Learning Differential Convolutional Neural Network",
        "authors": "Magombe Yasin, Mehmet Sarıgül, Mutlu Avci",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106114"
    },
    {
        "id": 1303,
        "title": "HybridBranchNet: A novel structure for branch hybrid convolutional neural networks architecture",
        "authors": "Ebrahim Parcham, Mansoor Fateh",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.025"
    },
    {
        "id": 1304,
        "title": "Approximation bounds for convolutional neural networks in operator learning",
        "authors": "Nicola Rares Franco, Stefania Fresca, Andrea Manzoni, Paolo Zunino",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.029"
    },
    {
        "id": 1305,
        "title": "Convolutional and LSTM Neural Networks for Solar Power Forecasting",
        "authors": "Gavin Fungtammasan, Irena Koprinska",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191813"
    },
    {
        "id": 1306,
        "title": "Reduced-complexity Convolutional Neural Network in the compressed domain",
        "authors": "Hamdan Abdellatef, Lina J. Karam",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.020"
    },
    {
        "id": 1307,
        "title": "Creating Deep Convolutional Neural Networks for Image Classification",
        "authors": "Nabeel Siddiqui",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "\n            This lesson provides a beginner-friendly introduction to convolutional neural networks (CNNs) for image classification. The tutorial provides a conceptual understanding of how neural networks work by using Google's Teachable Machine to train a model on paintings from the ArtUK database. This lesson also demonstrates how to use Javascript to embed the model in a live website.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.46430/phen0108"
    },
    {
        "id": 1308,
        "title": "Convolutional Neural Networks Do Work with Pre-Defined Filters",
        "authors": "Christoph Linse, Erhardt Barth, Thomas Martinetz",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191449"
    },
    {
        "id": 1309,
        "title": "Cardiac Arrhythmia Classification in Electrocardiogram Signals with Convolutional Neural Networks",
        "authors": "Igor Souza, Daniel Dantas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011682800003411"
    },
    {
        "id": 1310,
        "title": "PSE-Net: Channel pruning for Convolutional Neural Networks with parallel-subnets estimator",
        "authors": "Shiguang Wang, Tao Xie, Haijun Liu, Xingcheng Zhang, Jian Cheng",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106263"
    },
    {
        "id": 1311,
        "title": "Efficient and accurate compound scaling for convolutional neural networks",
        "authors": "Chengmin Lin, Pengfei Yang, Quan Wang, Zeyu Qiu, Wenkai Lv, Zhenyi Wang",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.053"
    },
    {
        "id": 1312,
        "title": "A novel feature-scrambling approach reveals the capacity of convolutional neural networks to learn spatial relations",
        "authors": "Amr Farahat, Felix Effenberger, Martin Vinck",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.021"
    },
    {
        "id": 1313,
        "title": "Multi-relational graph convolutional networks: Generalization guarantees and experiments",
        "authors": "Xutao Li, Michael K. Ng, Guangning Xu, Andy Yip",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.044"
    },
    {
        "id": 1314,
        "title": "Image-based time series forecasting: A deep convolutional neural network approach",
        "authors": "Artemios-Anargyros Semenoglou, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.006"
    },
    {
        "id": 1315,
        "title": "Foreground segmentation network using transposed convolutional neural networks and up sampling for multiscale feature encoding",
        "authors": "Vishruth B. Gowda, M.T. Gopalakrishna, J. Megha, Shilpa Mohankumar",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.015"
    },
    {
        "id": 1316,
        "title": "Filter pruning for convolutional neural networks in semantic image segmentation",
        "authors": "Clara I. López-González, Esther Gascó, Fredy Barrientos-Espillco, Eva Besada-Portas, Gonzalo Pajares",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.010"
    },
    {
        "id": 1317,
        "title": "TCGAN: Convolutional Generative Adversarial Network for time series classification and clustering",
        "authors": "Fanling Huang, Yangdong Deng",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.033"
    },
    {
        "id": 1318,
        "title": "Connections Between Pairs of Filters Improve the Accuracy of Convolutional Neural Networks",
        "authors": "Kathleen Anderson, Philipp Grüning, Erhardt Barth",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191082"
    },
    {
        "id": 1319,
        "title": "Stereoscopic scalable quantum convolutional neural networks",
        "authors": "Hankyul Baek, Won Joon Yun, Soohyun Park, Joongheon Kim",
        "published": "2023-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.027"
    },
    {
        "id": 1320,
        "title": "Improvement in Alzheimer's Disease MRI Images Analysis by Convolutional Neural Networks Via Topological Optimization",
        "authors": "",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "This research underscores the efficacy of Fourier topological optimization in refining MRI imagery, thereby bolstering the classification precision of Alzheimer's Disease through convolutional neural networks (CNNs). Recognizing that MRI scans are indispensable for neurological assessments, but frequently grapple with issues like blurriness and contrast irregularities, the deployment of Fourier topological optimization offered enhanced delineation of brain structures, ameliorated noise, and superior contrast. The applied techniques prioritized boundary enhancement, contrast and brightness adjustments, and overall image lucidity. Employing CNN architectures—VGG16, ResNet50, InceptionV3, and Xception—the post-optimization analysis revealed a marked elevation in performance. Prior to optimization, accuracy rates for 10 and 20 epochs stood at 38.19% and 74.255% respectively; these surged to 78.16% and 88.66% post-optimization. Moreover, balanced accuracy witnessed a leap from 78.16% to 88.13%, paralleled by an escalation in the Matthews correlation coefficient from 74.98% to 85.43%. A meticulous examination of the 20-epoch CNN training post MRI image enhancement disclosed a salient advancement in the Moderate-Demented category, with 393 accurate classifications. Conclusively, the amalgamation of Fourier topological optimization with CNNs delineates a promising trajectory for the nuanced classification of Alzheimer's Disease, portending a transformative impact on its diagnostic paradigms",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/eoa.01.04.05"
    },
    {
        "id": 1321,
        "title": "Corrigendum to “Lower and upper bounds for numbers of linear regions of graph convolutional networks” [Neural Networks Volume 168, November 2023, Pages 394–404]",
        "authors": "Hao Chen, Yu Guang Wang, Huan Xiong",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.061"
    },
    {
        "id": 1322,
        "title": "A survey on cancer detection via convolutional neural networks: Current challenges and future directions",
        "authors": "Pallabi Sharma, Deepak Ranjan Nayak, Bunil Kumar Balabantaray, M. Tanveer, Rajashree Nayak",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.006"
    },
    {
        "id": 1323,
        "title": "Speech to Text Recognition for Videogame Controlling with Convolutional Neural Networks",
        "authors": "Joaquin Aguirre-Peralta, Marek Rivas-Zavala, Willy Ugarte",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011782900003411"
    },
    {
        "id": 1324,
        "title": "Real-Time Face Recognition System with Fine-tune Convolutional Neural Networks",
        "authors": "",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.8.nq221055"
    },
    {
        "id": 1325,
        "title": "Alzheimer’s Disease Classification via Convolutional Neural Networks",
        "authors": "",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17756/nwj.2023-s4-094"
    },
    {
        "id": 1326,
        "title": "Implementation of an Object Detection System using Convolutional Neural Networks",
        "authors": "P. Divakar, V. Pavani",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0769"
    },
    {
        "id": 1327,
        "title": "A Performance Study: Convolutional Deep Belief Networks and Convolutional Neural Networks for Audio Classification",
        "authors": "Maharshi Patel, Aaditya Darakh",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csitss60515.2023.10334214"
    },
    {
        "id": 1328,
        "title": "Self-supervised Learning for DNA sequences with circular dilated convolutional networks",
        "authors": "Lei Cheng, Tong Yu, Ruslan Khalitov, Zhirong Yang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.12.002"
    },
    {
        "id": 1329,
        "title": "Night Fatigue Driving Detection Technology Using Infrared Images and Convolutional Neural Networks",
        "authors": "Huei-Yung Lin, Kai-Chun Tu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011847400003479"
    },
    {
        "id": 1330,
        "title": "Convolutional Neural Networks: A Survey",
        "authors": "Moez Krichen",
        "published": "2023-7-28",
        "citations": 73,
        "abstract": "Artificial intelligence (AI) has become a cornerstone of modern technology, revolutionizing industries from healthcare to finance. Convolutional neural networks (CNNs) are a subset of AI that have emerged as a powerful tool for various tasks including image recognition, speech recognition, natural language processing (NLP), and even in the field of genomics, where they have been utilized to classify DNA sequences. This paper provides a comprehensive overview of CNNs and their applications in image recognition tasks. It first introduces the fundamentals of CNNs, including the layers of CNNs, convolution operation (Conv_Op), Feat_Maps, activation functions (Activ_Func), and training methods. It then discusses several popular CNN architectures such as LeNet, AlexNet, VGG, ResNet, and InceptionNet, and compares their performance. It also examines when to use CNNs, their advantages and limitations, and provides recommendations for developers and data scientists, including preprocessing the data, choosing appropriate hyperparameters (Hyper_Param), and evaluating model performance. It further explores the existing platforms and libraries for CNNs such as TensorFlow, Keras, PyTorch, Caffe, and MXNet, and compares their features and functionalities. Moreover, it estimates the cost of using CNNs and discusses potential cost-saving strategies. Finally, it reviews recent developments in CNNs, including attention mechanisms, capsule networks, transfer learning, adversarial training, quantization and compression, and enhancing the reliability and efficiency of CNNs through formal methods. The paper is concluded by summarizing the key takeaways and discussing the future directions of CNN research and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12080151"
    },
    {
        "id": 1331,
        "title": "Different Types of Neural Networks and Applications: Evidence from Feedforward, Convolutional and Recurrent Neural Networks",
        "authors": "Yumin Pan",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Neural networks have achieved great process in the 90 years since they were officially introduced in 1943. Because of its wide application and huge research and development potential, this technology attracts more and more scientific and technological workers to the research of neural networks. Neural network technology is an essential component of AI development, and it is a significant indicator of a country's overall strength. In this paper, this study will demonstrate Feedforward Neural Network, Convolution Neural Network and Recurrent Neural networks and evaluate them through datasets from kaggle.com. and CSDN (China IT community). Through this paper, readers can have a better outlook and understanding of the operating principles of each type of neural network as well as their specific jobs (what kind of jobs they specialized in) and each application of these neural networks. So that this paper can promote readers' thoughts and help them start learning neural networks or be a supplement or reference for future scholars. In the end, this paper will present the outcome, which is the evaluation of the accuracy, loss curve, and accuracy curve of neural networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/6rn1wd81"
    },
    {
        "id": 1332,
        "title": "Applying Convolutional Neural Networks to data on unstructured meshes with space-filling curves",
        "authors": "Claire E. Heaney, Yuling Li, Omar K. Matar, Christopher C. Pain",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106198"
    },
    {
        "id": 1333,
        "title": "Noise Removal from the Image Using Convolutional Neural Networks-Based Denoising Auto Encoder",
        "authors": "Younus FAROOQ, Serkan SAVAŞ",
        "published": "2024-3-10",
        "citations": 0,
        "abstract": "With the exponential growth in the volume of digital images captured daily, there is an escalating demand for elevating image quality to achieve both accuracy and visual appeal. Addressing this need, the development of techniques for reducing image noise while preserving crucial features, such as edges, corners, and sharp structures, has become imperative. This paper delves into the significance of image denoising and introduces a novel approach utilizing a denoising autoencoder based on convolutional neural networks (CNNs). The proposed method adopts a meticulous two-step process to effectively eliminate noise. Initially, input images are segregated into training and testing sets. Subsequently, a denoising autoencoder model is trained using the designated training data. This model is then further refined through training on a CNN, enhancing its noise reduction capabilities. The evaluation of the system's performance is conducted using testing data to gauge its effectiveness. The study employs the MATLAB programming language for implementation and evaluation. Results, measured through RMSE (Root Mean Square Error) and PSNR (Peak Signal-to-Noise Ratio) criteria on two distinct datasets—the Covid19-radiography-database and SIIM-medical-images—reveal that our proposed method outperforms existing approaches significantly. This approach is particularly promising for applications demanding enhanced image quality, such as the resolution enhancement of medical images. The study contributes to the ongoing efforts in noise reduction research, offering a robust solution for improving visual perception in diverse image processing applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57020/ject.1390428"
    },
    {
        "id": 1334,
        "title": "Convolutional Neural Networks: An Analysis of Varying Factors",
        "authors": "Brixx-John Garcia Panlaqui, Debzani Deb",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/southeastcon51012.2023.10115075"
    },
    {
        "id": 1335,
        "title": "Graph Convolutional Networks Based Standard Essential Patents Identification",
        "authors": "Weidong Liu, Rui Li, Wei Tang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191321"
    },
    {
        "id": 1336,
        "title": "Quantum Convolutional Neural Network Architecture for Multi-Class Classification",
        "authors": "Samarth Kashyap, Shayan Srinivasa Garani",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191561"
    },
    {
        "id": 1337,
        "title": "An Automatic Ant Counting and Distribution Estimation System Using Convolutional Neural Networks",
        "authors": "Mateus Silva, Breno Felisberto, Mateus Batista, Andrea Bianchi, Servio Ribeiro, Ricardo Oliveira",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011968900003467"
    },
    {
        "id": 1338,
        "title": "Spiral Drawing Test and Explainable Convolutional Neural Networks for Parkinson’s Disease Detection",
        "authors": "Francesco Mercaldo, Luca Brunese, Mario Cesarelli, Fabio Martinelli, Antonella Santone",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012407100003636"
    },
    {
        "id": 1339,
        "title": "Classification of coma etiology using convolutional neural networks and long-short term memory networks",
        "authors": "Sérgio Baldo Júnior, Murillo G. Carneiro, João-Batista Destro-Filho, Liang Zhao, Renato Tinós",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191203"
    },
    {
        "id": 1340,
        "title": "Using a Genetic Algorithm to Update Convolutional Neural Networks for Abnormality Classification in Mammography",
        "authors": "Steven Wessels, Dustin van der Haar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011648500003411"
    },
    {
        "id": 1341,
        "title": "Layered Batch Inference Optimization Method for Convolutional Neural Networks Based on CPU",
        "authors": "Hongzhi Zhao, Xun Liu, Jingzhen Zheng, Jingjing He",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012277100003807"
    },
    {
        "id": 1342,
        "title": "Robust Drone Detection and Classification from Radio Frequency Signals Using Convolutional Neural Networks",
        "authors": "Stefan Glüge, Matthias Nyfeler, Nicola Ramagnano, Claus Horn, Christof Schüpbach",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012176800003595"
    },
    {
        "id": 1343,
        "title": "Siamese Neural Networks for Kinship Prediction: A Deep Convolutional Neural Network Approach",
        "authors": "Tukaram Navghare,  , Aniket Muley, Vinayak Jadhav",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i4.3018"
    },
    {
        "id": 1344,
        "title": "Brain Tumor Segmentation of Lower-Grade Glioma Across MRI Images Using Hybrid Convolutional Neural Networks",
        "authors": "Amal Jlassi, Khaoula ElBedoui, Walid Barhoumi",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011895900003393"
    },
    {
        "id": 1345,
        "title": "Exploring the role of texture features in deep convolutional neural networks: Insights from Portilla-Simoncelli statistics",
        "authors": "Yusuke Hamano, Shoko Nagasaka, Hayaru Shouno",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.028"
    },
    {
        "id": 1346,
        "title": "Spectral Graph Convolutional Neural Networks in the Context of Regularization Theory",
        "authors": "Asif Salim, S. Sumitra",
        "published": "2024-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3177742"
    },
    {
        "id": 1347,
        "title": "Understanding of Feature Representation in Convolutional Neural Networks and Vision Transformer",
        "authors": "Hiroaki Minoura, Tsubasa Hirakawa, Takayoshi Yamashita, Hironobu Fujiyoshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011621300003417"
    },
    {
        "id": 1348,
        "title": "On-Board Estimation of Vehicle Speed and the Need of Braking Using Convolutional Neural Networks",
        "authors": "Razvan Itu, Radu Danescu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012163800003543"
    },
    {
        "id": 1349,
        "title": "CONVOLUTIONAL NEURAL NETWORKS FOR SOLVING COMPUTER VISION PROBLEMS",
        "authors": "Anatoly Sayfutdinov",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32743/unitech.2023.115.10.16127"
    },
    {
        "id": 1350,
        "title": "An Efficient Backbone for Early Forest Fire Detection Based on Convolutional Neural Networks",
        "authors": "Deepamoni Mahanta, Deepika Hazarika, Vijay Kumar Nath",
        "published": "2023-9",
        "citations": 0,
        "abstract": "Forest fires cause disastrous damage to both human life and ecosystem. Therefore, it is essential to detect forest fires in the early stage to reduce the damage. Convolutional Neural Networks (CNNs) are widely used for forest fire detection. This paper proposes a new backbone network for a CNN-based forest fire detection model. The proposed backbone network can detect the plumes of smoke well by decomposing the conventional convolution into depth-wise and coordinate ones to better extract information from objects that spread along the vertical dimension. Experimental results show that the proposed backbone network outperforms other popular ones by achieving a detection accuracy of up to 52.6 AP.1",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/joig.11.3.227-232"
    },
    {
        "id": 1351,
        "title": "Convolutional Neural Networks with Neural Memory Ordinary Differential Equations",
        "authors": "Yixuan Liu, Yuanyuan Chen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csis-iac60628.2023.10364241"
    },
    {
        "id": 1352,
        "title": "Retracted: Improving Convolutional Neural Networks with Competitive Activation Function",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9761609"
    },
    {
        "id": 1353,
        "title": "Node-personalized multi-graph convolutional networks for recommendation",
        "authors": "Tiantian Zhou, Hailiang Ye, Feilong Cao",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106169"
    },
    {
        "id": 1354,
        "title": "Use of artificial neural networks in architecture: determining the architectural style of a building with a convolutional neural networks",
        "authors": "Ece Cantemir, Ozlem Kandemir",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractThe discussion of \"can machines think?\" which started with the invention of the modern computer, brought along the question of \"can machines design?\" by researchers in the design field. These developments in information technologies have also affected the architecture. Artificial intelligence applications are encountered in many areas such as pricing estimation, energy conservation security systems of buildings, ventilation systems, user-oriented interactive design solutions, computer-aided programs used in the plan production phase and design process. When the literature on artificial intelligence applications in the architecture is reviewed, it can be seen that it generally includes shape grammars, graph theory, decision trees, constraint-based models, machine learning methods, RNN (Recursive Neural Networks), CNN (Convolutional Neural Network) and GAN (Generative Adversarial Network) algorithms. In this study, the use of artificial intelligence algorithms in architecture was examined, and an example was designed to determine the architectural structures of different periods by using CNN (Convolutional Neural Network). In the study, the open source TensorFlow library developed by Google and the Python programming language were used. Employing a statistical approach and utilizing convolutional neural networks (CNNs), a study has successfully classified the current flow patterns of buildings based on datasets comprising facades of Gothic, Modern, and Deconstructivist architectural styles. The findings demonstrate the efficacy of CNNs in accurately distinguishing the intricate details of diverse architectural styles. Recognizing elements from different periods using the CNN algorithm can examine not only individual buildings but also the relationship of buildings with their environments. It can also gain an important place in the field of conservation of the architectural discipline. The historical processes, aesthetic features and changes of protected buildings can be learned with the CNN algorithm and can guide restoration decisions. As a result of the study, the employed CNN-based model can correctly classify structures with 84.66% accuracy rate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-09395-y"
    },
    {
        "id": 1355,
        "title": "Revisiting multi-view learning: A perspective of implicitly heterogeneous Graph Convolutional Network",
        "authors": "Ying Zou, Zihan Fang, Zhihao Wu, Chenghui Zheng, Shiping Wang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.052"
    },
    {
        "id": 1356,
        "title": "Railway Infrastructure Instance Segmentation Based on Convolutional Neural Networks",
        "authors": "V. A. Fedorov",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rusautocon58002.2023.10272908"
    },
    {
        "id": 1357,
        "title": "Evaluating the Use of Interpretable Quantized Convolutional Neural Networks for Resource-Constrained Deployment",
        "authors": "Harry Rogers, Beatriz De La Iglesia, Tahmina Zebin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012231900003598"
    },
    {
        "id": 1358,
        "title": "Pixel-Wise Gradient Uncertainty for Convolutional Neural Networks Applied to Out-of-Distribution Segmentation",
        "authors": "Kira Maag, Tobias Riedlinger",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012353300003660"
    },
    {
        "id": 1359,
        "title": "Just a Matter of Scale? Reevaluating Scale Equivariance in Convolutional Neural Networks",
        "authors": "Thomas Altstidl, An Nguyen, Leo Schwinn, Franz Köferl, Christopher Mutschler, Björn Eskofier, Dario Zanca",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191724"
    },
    {
        "id": 1360,
        "title": "Multi-atlas Graph Convolutional Networks and Convolutional Recurrent Neural Networks-Based Ensemble Learning for Classification of Autism Spectrum Disorders",
        "authors": "Manjunath Ramanna Lamani, P. Julian Benadit, Krishnakumar Vaithinathan",
        "published": "2023-2-17",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-022-01617-9"
    },
    {
        "id": 1361,
        "title": "Lower and upper bounds for numbers of linear regions of graph convolutional networks",
        "authors": "Hao Chen, Yu Guang Wang, Huan Xiong",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.025"
    },
    {
        "id": 1362,
        "title": "Learning Korobov Functions by Correntropy and Convolutional Neural Networks",
        "authors": "Zhiying Fang, Tong Mao, Jun Fan",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "Abstract\nCombining information-theoretic learning with deep learning has gained significant attention in recent years, as it offers a promising approach to tackle the challenges posed by big data. However, the theoretical understanding of convolutional structures, which are vital to many structured deep learning models, remains incomplete. To partially bridge this gap, this letter aims to develop generalization analysis for deep convolutional neural network (CNN) algorithms using learning theory. Specifically, we focus on investigating robust regression using correntropy-induced loss functions derived from information-theoretic learning. Our analysis demonstrates an explicit convergence rate for deep CNN-based robust regression algorithms when the target function resides in the Korobov space. This study sheds light on the theoretical underpinnings of CNNs and provides a framework for understanding their performance and limitations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/neco_a_01650"
    },
    {
        "id": 1363,
        "title": "An Deep Convolutional Neural Networks are used to Detect Cyberbullying on Social Networks.",
        "authors": "B.S. Rawat",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353375"
    },
    {
        "id": 1364,
        "title": "Detection of Handwriting Characteristics using Convolutional Neural Networks",
        "authors": "Daniel Gagiu, Dorin Sendrescu",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57093.2023.10178936"
    },
    {
        "id": 1365,
        "title": "Application of Graph Convolutional Neural Networks Combined with Single-Model Decision-Making Fusion Neural Networks in Structural Damage Recognition",
        "authors": "Xiaofei Li, Langxing Xu, Hainan Guo, Lu Yang",
        "published": "2023-11-22",
        "citations": 1,
        "abstract": "In cases with a large number of sensors and complex spatial distribution, correctly learning the spatial characteristics of the sensors is vital for structural damage identification. Graph convolutional neural networks (GCNs), unlike other methods, have the ability to learn the spatial characteristics of the sensors, which is targeted at the above problems in structural damage identification. However, under the influence of environmental interference, sensor instability, and other factors, part of the vibration signal can easily change its fundamental characteristics, and there is a possibility of misjudging structural damage. Therefore, on the basis of building a high-performance graphical convolutional deep learning model, this paper considers the integration of data fusion technology in the model decision-making layer and proposes a single-model decision-making fusion neural network (S_DFNN) model. Through experiments involving the frame model and the self-designed cable-stayed bridge model, it is concluded that this method has a better performance of damage recognition for different structures, and the accuracy is improved based on a single model and has good damage recognition performance. The method has better damage identification performance in different structures, and the accuracy rate is improved based on the single model, which has a very good damage identification effect. It proves that the structural damage diagnosis method proposed in this paper with data fusion technology combined with deep learning has a strong generalization ability and has great potential in structural damage diagnosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23239327"
    },
    {
        "id": 1366,
        "title": "The role of capacity constraints in Convolutional Neural Networks for learning random versus natural data",
        "authors": "Christian Tsvetkov, Gaurav Malhotra, Benjamin D. Evans, Jeffrey S. Bowers",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.011"
    },
    {
        "id": 1367,
        "title": "Detection of Malaria Infection Using Convolutional Neural Networks",
        "authors": "Farah Sherif, Ammar Mohammed",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imsa58542.2023.10217455"
    },
    {
        "id": 1368,
        "title": "Audioset classification with Graph Convolutional Attention model",
        "authors": "Xuliang Li, Junbin Gao",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191960"
    },
    {
        "id": 1369,
        "title": "Deep Learning for Early Diagnosis of Diabetic Retinopathy: a Study Using Convolutional Neural Network",
        "authors": "Ali Sultan Mayya",
        "published": "2023-6-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/neuront58640.2023.10175853"
    },
    {
        "id": 1370,
        "title": "Video Classification-Based Action Recognition with Enhanced Convolutional Neural Networks",
        "authors": "Bo Mei",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "The classification of videos has become increasingly important in the field of data science research, as it has numerous practical applications in modern society. Compared to image classification, video classification poses a significantly greater challenge. One of the most obvious difficulties is that video classification tasks require more powerful computers due to the large number of features that need to be computed. Additionally, conventional 2D Convolutional Neural Networks (2D CNNs) are not effective in handling such tasks. This paper proposes a novel 2-layer Convolutional Neural Network (CNN) architecture for action recognition that addresses these challenges. The proposed architecture achieved a high test accuracy of 79.66% for classifying large video clips. The results indicate the effectiveness of the proposed approach for video classification tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131506"
    },
    {
        "id": 1371,
        "title": "Microwave Imaging Using Cascaded Convolutional Neural Networks",
        "authors": "Fei Xue, Lei Guo, Amin Abbosh",
        "published": "2023-2-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ams57822.2023.10062327"
    },
    {
        "id": 1372,
        "title": "Novel predictive analysis for leaf diseases using convolutional neural networks comparing over artificial neural networks",
        "authors": "B. Vamsi Krishna, T. P. Anithaashri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0172887"
    },
    {
        "id": 1373,
        "title": "Recognition of Mentally Pronounced Russian Phonemes Using Convolutional Neural Networks and Electroencephalography Data",
        "authors": "L. E. Seleznyev, A. A. Chupakhin, V. A. Kostenko, A. O. Shevchenko, A. V. Vartanov",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020066"
    },
    {
        "id": 1374,
        "title": "Implementation Challenges and Strategies for Hebbian Learning in Convolutional Neural Networks",
        "authors": "A. V. Demidovskij, M. S. Kazyulina, I. G. Salnikov, A. M. Tugaryov, A. I. Trutnev, S. V. Pavlov",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23060048"
    },
    {
        "id": 1375,
        "title": "Computing the Traversability of the Environment by Means of Sparse Convolutional 3D Neural Networks",
        "authors": "Antonio Santo, Arturo Gil, David Valiente, Mónica Ballesta, Adrián Peidró",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012160300003543"
    },
    {
        "id": 1376,
        "title": "Image Classification of Stroke Blood Clot Origin Using Deep Convolutional Neural Networks and Visual Transformers: A Kaggle Competition",
        "authors": "",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "Stroke is one of two main causes of death worldwide. Many individuals suffer from ischemic stroke every year. Only in US, more over 700,000 individuals meet ischemic stroke due to blood clot blocking an artery to the brain every year. «Stroke symptoms typically start suddenly, over seconds to minutes, and in most cases do not progress further. The symptoms depend on the area of the brain affected. The more extensive the area of the brain affected, the more functions that are likely to be lost. »  «Ischemic stroke occurs because of a loss of blood supply to part of the brain, initiating the ischemic cascade. » In the case of subsequent strokes, it is possible to mitigate consequences if physicians can determine stroke etiology. The paper describes particular approach how to apply Artificial Intelligence for purposes of separating two major acute ischemic stroke (AIS) etiology subtypes: cardiac and large artery atherosclerosis. Four deep neural network architectures and simple ensemble method are used in the approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.14"
    },
    {
        "id": 1377,
        "title": "Vehicle Assistance System Using Convolutional Neural Networks",
        "authors": "Filip Žemla, Ján Cigánek",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsci59259.2023.10315836"
    },
    {
        "id": 1378,
        "title": "Convolutional Neural Networks for Beginners",
        "authors": "Shaharyar Ahmed Khan Tareen, Filza Khan Tareen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4566310"
    },
    {
        "id": 1379,
        "title": "Implementierung von Convolutional Neural Networks zur echtzeitfähigen Bildklassifizierung auf konventionellen Industriesteuerungen",
        "authors": "Rando Raßmann, Christoph Wree",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33968/2023.22"
    },
    {
        "id": 1380,
        "title": "BIOMETRIC AUTHENTICATION UTILIZING CONVOLUTIONAL NEURAL NETWORKS",
        "authors": "Serhii Datsenko, Heorhii Kuchuk",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "Relevance. Cryptographic algorithms and protocols are important tools in modern cybersecurity. They are used in various applications, from simple software for encrypting computer information to complex information and telecommunications systems that implement various electronic trust services. Developing complete biometric cryptographic systems will allow using personal biometric data as a unique secret parameter instead of needing to remember cryptographic keys or using additional authentication devices. The object of research the process of generating cryptographic keys from biometric images of a person's face with the implementation of fuzzy extractors. The subject of the research is the means and methods of building a neural network using modern technologies. The purpose of this paper to study new methods for generating cryptographic keys from biometric images using convolutional neural networks and histogram of oriented gradients. Research results. The proposed technology allows for the implementation of a new cryptographic mechanism - a technology for generating reliable cryptographic passwords from biometric images for further use as attributes for access to secure systems, as well as a source of keys for existing cryptographic algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20998/2522-9052.2023.2.12"
    },
    {
        "id": 1381,
        "title": "Convolutional neural networks for early melanoma detection using dermoscopic images - a literature review",
        "authors": "",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53453/ms.2024.3.9"
    },
    {
        "id": 1382,
        "title": "Performance Analysis of Convolutional Neural Networks and Multilayer Perceptron in Generative Adversarial Networks",
        "authors": "Siyuan Guan",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10076041"
    },
    {
        "id": 1383,
        "title": "Document AI: A Comparative Study of Transformer-Based, Graph-Based Models, and Convolutional Neural Networks for Document Layout Analysis",
        "authors": "",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Document AI aims to automatically analyze documents by leveraging natural language processing and computer vision techniques. One of the major tasks of Document AI is document layout analysis, which structures document pages by interpreting the content and spatial relationships of layout, image, and text. This task can be image-centric, wherein the aim is to identify and label various regions such as authors and paragraphs, or text-centric, where the focus is on classifying individual words in a document. Although there are increasingly sophisticated methods for improving layout analysis, doubts remain about the extent to which their findings can be generalized to a broader context. Specifically, prior work developed systems based on very different architectures, such as transformer-based, graph-based, and CNNs. However, no work has mentioned the effectiveness of these models in a comparative analysis. Moreover, while language-independent Document AI models capable of knowledge transfer have been developed, it remains to be investigated to what degree they can effectively transfer knowledge. In this study, we aim to fill these gaps by conducting a comparative evaluation of state-of-the-art models in document layout analysis and investigating the potential of cross-lingual layout analysis by utilizing machine translation techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.17"
    },
    {
        "id": 1384,
        "title": "Retracted: Beat Wash-Sale Tax with Multigraph Convolutional Neural Networks Based Trading Strategy",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9840831"
    },
    {
        "id": 1385,
        "title": "Application of Convolutional Neural Networks for Creation of Photoluminescent Carbon Nanosensor for Heavy Metals Detection",
        "authors": "G. N. Chugreeva, O. E. Sarmanova, K. A. Laptinskiy, S. A. Burikov, T. A. Dolenko",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23060036"
    },
    {
        "id": 1386,
        "title": "Detection and Prediction of Breast Cancer Using Improved Faster Regional Convolutional Neural Network Based on Multilayer Perceptron’s Network",
        "authors": " Poonam Rana, Pradeep Kumar Gupta, Vineet Sharma",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020054"
    },
    {
        "id": 1387,
        "title": "Adversarial Attacks with Defense Mechanisms on Convolutional Neural Networks and Recurrent Neural Networks for Malware Classification",
        "authors": "Sharoug Alzaidy, Hamad Binsalleeh",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "In the field of behavioral detection, deep learning has been extensively utilized. For example, deep learning models have been utilized to detect and classify malware. Deep learning, however, has vulnerabilities that can be exploited with crafted inputs, resulting in malicious files being misclassified. Cyber-Physical Systems (CPS) may be compromised by malicious files, which can have catastrophic consequences. This paper presents a method for classifying Windows portable executables (PEs) using Recurrent Neural Networks (RNNs) and Convolutional Neural Networks (CNNs). To generate malware executable adversarial examples of PE, we conduct two white-box attacks, Jacobian-based Saliency Map Attack (JSMA) and Carlini and Wagner attack (C&W). An adversarial payload was injected into the DOS header, and a section was added to the file to preserve the PE functionality. The attacks successfully evaded the CNN model with a 91% evasion rate, whereas the RNN model evaded attacks at an 84.6% rate. Two defense mechanisms based on distillation and training techniques are examined in this study for overcoming adversarial example challenges. Distillation and training against JSMA resulted in the highest reductions in the evasion rates of 48.1% and 41.49%, respectively. Distillation and training against C&W resulted in the highest decrease in evasion rates, at 48.1% and 49.9%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14041673"
    },
    {
        "id": 1388,
        "title": "Handwritten Recognition Based on Convolutional Neural Networks",
        "authors": "Mohan Wang",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10442130"
    },
    {
        "id": 1389,
        "title": "in-Memory Processing to Accelerate Convolutional Neural Networks",
        "authors": "Van - Khoa Pham",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsse58758.2023.10227155"
    },
    {
        "id": 1390,
        "title": "CONVOLUTIONAL NEURAL NETWORKS FOR CAMERA SELF-CALIBRATION WITH VARYING INTRINSIC PARAMETERS",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35741/issn.0258-2724.58.5.18"
    },
    {
        "id": 1391,
        "title": "Multiscale convolutional neural networks for in-loop video restoration",
        "authors": "Kiran Misra, Andrew Segall, Byeongdoo Choi",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dcc55655.2023.00027"
    },
    {
        "id": 1392,
        "title": "Enhancing marine debris identification with convolutional neural networks",
        "authors": "Victoria Wahlig, Ricardo A Gonzales",
        "published": "2024",
        "citations": 0,
        "abstract": "Oceanic debris, predominantly plastic, inflicts catastrophic damage on marine ecosystems, threatens aquatic life through entanglement, strangulation, and starvation, and increasingly accumulates as microplastics within the tissues of marine species consumed by humans. Assessing and mitigating this crisis is complicated by the wide-ranging distribution of waste by ocean currents to remote and deep-sea locations. In this study, we developed a deep learning model to discern and identify components of images captured by an underwater remotely operated vehicle (ROV). We hypothesized that the model would achieve an 80% accuracy. We utilized image segmentation, a process that groups or \"masks\" all pixels associated with a specific object in the image, to recognize and delineate image components (trash, animal, plant, ROV). We trained our model using the established TrashCan 1.0 dataset, which comprises images captured by ROVs in the Sea of Japan. Our model, a convolutional neural network employing U-Net architecture, formulated feature maps for each object within the images, enabling prediction of object classes. During the testing phase, we compared the model-generated object masks against reference masks to establish the Dice Similarity Coefficient (DSC) for each object class (trash = 0.81 ± 0.38, animal = 0.85 ± 0.35, plant = 0.88 ± 0.31, ROV = 0.86 ± 0.29, overall average = 0.84 ± 0.36). The consistent categorization of image components by our model demonstrates its potential as an effective ROV-borne tool capable of identifying and targeting hitherto inaccessible ocean trash. Our study lays a robust foundation for future research and additional applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/23-150"
    },
    {
        "id": 1393,
        "title": "Automated Fish Measurement and Classification Using Convolutional Neural Networks (CNNs)",
        "authors": "Soad El Hiak, Xu He",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.cbb.20231102.12"
    },
    {
        "id": 1394,
        "title": "Global Entropy Pooling layer for Convolutional Neural Networks",
        "authors": "Katarzyna Filus, Joanna Domańska",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126615"
    },
    {
        "id": 1395,
        "title": "Applying Modified Convolutional Neural Networks for Detecting Intrusion",
        "authors": "Kanin Siritharagul, Sunantha Sodsee",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incit60207.2023.10412982"
    },
    {
        "id": 1396,
        "title": "Convolutional Neural Networks for Classifying Electronic Components in Industrial Applications",
        "authors": "Stanisław Hożyń",
        "published": "2023-1-12",
        "citations": 4,
        "abstract": "Electronic component classification often constitutes the uncomplicated task of classifying a single object on a simple background. It is because, in many applications, a technological process employs constant lighting conditions, a fixed camera position, and a designated set of classified components. To date, there has not been an adequate attempt to develop a method for object classification under the above conditions in industrial applications. Therefore, this work focuses on the classification problem of a particular technological process. The process classifies electronic components on an assembly line using a fixed-mounted camera. The research investigated all the essential steps required to build a classification system, such as image acquisition, database creation, and neural network development. The first part of the experiment was devoted to creating an image dataset utilising the proposed image acquisition system. Then, custom and pre-trained networks were developed and tested. The results indicated that the pre-trained network (ResNet50) attained the highest accuracy (99.03%), which was better than the 98.99% achieved in relevant research on classifying elementary components. The proposed solution can be adapted to similar technological processes, where a defined set of components is classified under comparable conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16020887"
    },
    {
        "id": 1397,
        "title": "Activation Functions for Convolutional Neural Networks: Proposals and Experimental Study",
        "authors": "Víctor Manuel Vargas, Pedro Antonio Gutiérrez, Javier Barbero-Gómez, César Hervás-Martínez",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3105444"
    },
    {
        "id": 1398,
        "title": "Characterizing functional brain networks via Spatio-Temporal Attention 4D Convolutional Neural Networks (STA-4DCNNs)",
        "authors": "Xi Jiang, Jiadong Yan, Yu Zhao, Mingxin Jiang, Yuzhong Chen, Jingchao Zhou, Zhenxiang Xiao, Zifan Wang, Rong Zhang, Benjamin Becker, Dajiang Zhu, Keith M. Kendrick, Tianming Liu",
        "published": "2023-1",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.004"
    },
    {
        "id": 1399,
        "title": "Speaker age and gender recognition using 1D and 2D convolutional neural networks",
        "authors": "Ergün Yücesoy",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-09153-0"
    },
    {
        "id": 1400,
        "title": "Chess Piece Classification Via Convolutional Neural Networks",
        "authors": "Shashank Parmar,  Rahul",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331716"
    }
]