[
    {
        "id": 5505,
        "title": "Real-time Autonomous Vehicle Navigation under Unknown Dynamics",
        "authors": "Shubham Kedia, Sambhu H. Karumanchi",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10421962"
    },
    {
        "id": 5506,
        "title": "Intelligent vehicle navigation systems and autonomous driving technology: A comprehensive analysis",
        "authors": "Haoan Zhai",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "This paper conducts a comprehensive study and analysis of intelligent vehicle navigation systems and autonomous driving technology. We review the historical development of autonomous driving technology, discuss key concepts such as perception, decision-making, and control, explore various types of autonomous vehicles, and examine various aspects of intelligent vehicle navigation systems. Additionally, we investigate safety, reliability, legal frameworks in the field of autonomous driving, as well as future trends and ethical considerations. Finally, we summarize the main findings of the research and provide recommendations for future studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/41/20230725"
    },
    {
        "id": 5507,
        "title": "Terrain Depth Estimation for Improved Inertial Data Prediction in Autonomous Navigation Systems",
        "authors": "Norbert Markó, Tamás Szirányi, Áron Ballagi",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iavvc57316.2023.10328139"
    },
    {
        "id": 5508,
        "title": "Robust Stabilization of an Autonomous Marine Vehicle on Programmed Trajectories",
        "authors": "V.L. Timchenko, V.Y. Horbov",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/msnmc61017.2023.10329125"
    },
    {
        "id": 5509,
        "title": "Advanced Deep Reinforcement Learning Strategies for Enhanced Autonomous Vehicle Navigation Systems",
        "authors": "M Dhinakaran, R.Thalapathi Rajasekaran, V. Balaji, V. Aarthi, S. Ambika",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486336"
    },
    {
        "id": 5510,
        "title": "Autonomous Navigation of Underwater Vehicle with Static and Dynamic Obstacles using PTEM",
        "authors": "Braylee Brown, Hakki Erhan Sevil",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/southeastcon51012.2023.10115077"
    },
    {
        "id": 5511,
        "title": "Autonomous Vehicle Development and Navigation on Lane-Less Roads Using Enhanced Lane Detection Techniques",
        "authors": "Felix Alexander Vaidhyan, Sreedhar Madichetty",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeev58650.2023.10391893"
    },
    {
        "id": 5512,
        "title": "Next-Generation Autonomous Vehicle Navigation: A DDPG Reinforcement Learning Approach to Dynamic HD Map Caching",
        "authors": "Deekshitula Sreeteja, Shashwat Kumar, Antony Franklin A.",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets59351.2024.10427147"
    },
    {
        "id": 5513,
        "title": "Deep Learning-Based Inertial Navigation Technology for Autonomous Underwater Vehicle Long-Distance Navigation—A Review",
        "authors": " QinYuan He,  HuaPeng Yu,  YuChen Fang",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s2075108723030070"
    },
    {
        "id": 5514,
        "title": "Game Theory-Based Simultaneous Prediction and Planning for Autonomous Vehicle Navigation in Crowded Environments",
        "authors": "Kunming Li, Yijun Chen, Mao Shan, Jiachen Li, Stewart Worrall, Eduardo Nebot",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422696"
    },
    {
        "id": 5515,
        "title": "Q-Learning for Autonomous Vehicle Navigation",
        "authors": "Oscar González-Miranda, Luis Antonio Lopez Miranda, Juan Manuel Ibarra-Zannatha",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comrob60035.2023.10349747"
    },
    {
        "id": 5516,
        "title": "End-To-End Autonomous Vehicle Navigation Using Imitation Learning",
        "authors": "M Vijayalakshmi, D Suvitha, P Sivaguru",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoac59537.2023.10249804"
    },
    {
        "id": 5517,
        "title": "Autonomous Navigation of Unmanned Aerial Vehicle: Investigating Architectures and Techniques for a Flexible Platform",
        "authors": "Hervé B. Olou, Eugène C. Ezin, Jean Marie Dembele, Christophe Cambier",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": " Unmanned aerial vehicles (UAVs) have a significant impact on the aircraft industry and are used for both military and civilian purposes. The partial or full automation of UAVs is an active research domain that is attracting interest from both the industrial and academic sectors. This paper presents a comprehensive review of UAVs, their architectures, and techniques used for autonomous navigation. Autonomous navigation requires the ability to recognize and avoid obstacles, which can be achieved using visual, non-visual, or hybrid techniques. These methods use computer vision and machine learning algorithms and are implemented on a computer system, which may or may not be embedded in the vehicle. After investigating the existing architectures and techniques, a flexible platform is designed. This platform combines the advantages of the existing architectures, materials, and methods. It is based on a compact architecture with the possibility of external communication. This platform is mainly composed of a companion computer for complex tasks like obstacle detection and path planning during mission. When implementing this platform, it is crucial to take into account the capabilities of the companion computer processor and appropriately select techniques. Finally, the paper suggests potential areas for future research in this field. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s2301385025500128"
    },
    {
        "id": 5518,
        "title": "Autonomous multicopter landing on a moving vehicle based on RSSI",
        "authors": "Jongwoo An, Hosun Kang, Jiwook Choi, Jangmyung Lee",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractCurrently, most of the studies on unmanned aerial vehicle (UAV) automatic landing systems mainly depend on image information to determine the landing location. However, the system requires a camera, a gimbal system and a separate image-processing device, which increases the weight and power consumption of the UAV, resulting in a shorter flight time. In addition, a large amount of computation and slow reaction speed can cause the camera to miss a proper landing moment. To solve these problems, in this study, the moving direction and relative distance between an object and the automatic landing system were measured using a receive signal strength indicator of the radio-frequency (RF) signal. To improve the movement direction and relative distance estimation accuracy, the noise in the RF signal was minimised using a low pass filter and moving average filter. Based on the filtered RF signal, the acceleration of the multicopter to reach the object was estimated by adopting the proportional navigation algorithm. The performance of the proposed algorithm for precise landing on a moving vehicle was demonstrated through experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s0373463321000850"
    },
    {
        "id": 5519,
        "title": "Novel Aiding Algorithm for Autonomous Pedestrian Navigation",
        "authors": "A. Bragin, Yu. Bolotin",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168390"
    },
    {
        "id": 5520,
        "title": "Vehicle physics simulation, as the key component of the autonomous navigation algorithm",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46354/i3m.2023.dhss.009"
    },
    {
        "id": 5521,
        "title": "A review of UAV autonomous navigation in GPS-denied environments",
        "authors": "Yingxiu Chang, Yongqiang Cheng, Umar Manzoor, John Murray",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104533"
    },
    {
        "id": 5522,
        "title": "Autonomous Underwater Vehicle navigation: A review",
        "authors": "Bingbing Zhang, Daxiong Ji, Shuo Liu, Xinke Zhu, Wen Xu",
        "published": "2023-4",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.113861"
    },
    {
        "id": 5523,
        "title": "Enhancing Autonomous Vehicle Navigation with a Clothoid-Based Lateral Controller",
        "authors": "Aashish Shaju, Steve Southward, Mehdi Ahmadian",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "This study introduces an advanced lateral control strategy for autonomous vehicles using a clothoid-based approach integrated with an adaptive lookahead mechanism. The primary focus is on enhancing lateral stability and path-tracking accuracy through the application of Euler spirals for smooth curvature transitions, thereby reducing passenger discomfort and the risk of vehicle rollover. An innovative aspect of our work is the adaptive adjustment of lookahead distance based on real-time vehicle dynamics and road geometry, which ensures optimal path following under varying conditions. A quasi-feedback control algorithm constructs optimal clothoids at each time step, generating the appropriate steering input. A lead filter compensates for the vehicle’s lateral dynamics lag, improving control responsiveness and stability. The effectiveness of the proposed controller is validated through a comprehensive co-simulation using TruckSim® and Simulink®, demonstrating significant improvements in lateral control performance across diverse driving scenarios. Future directions include scaling the controller for higher-speed applications and further optimization to minimize off-track errors, particularly for articulated vehicles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14051817"
    },
    {
        "id": 5524,
        "title": "Improved Preintegration Method for Vehicle Navigation Based on Factor Graph Optimization",
        "authors": "Shouyi Wang, Qinghua Zeng, Fangdong Li, Rui Xu, Chen Shao",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164519"
    },
    {
        "id": 5525,
        "title": "Unmanned Aircraft Systems with Autonomous Navigation",
        "authors": "Umberto Papa",
        "published": "2023-3-28",
        "citations": 1,
        "abstract": "Unmanned aerial systems play an increasingly remarkable role in widely diffused application fields, from military defense programs and strategies to civil and commercial utilization [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12071591"
    },
    {
        "id": 5526,
        "title": "Integration of Vehicle Dynamic Model and System Identified Model for Navigation in Autonomous Mobile Robots",
        "authors": "Penggao Yan, Li-Ta Hsu, Weisong Wen",
        "published": "2023-2-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33012/2023.18637"
    },
    {
        "id": 5527,
        "title": "PARALLEL AND DISTRIBUTED COMPUTING TECHNOLOGIES FOR AUTONOMOUS VEHICLE NAVIGATION",
        "authors": "L. I. Mochurad, M. V. Mamchur",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "Context. Autonomous vehicles are becoming increasingly popular, and one of the important modern challenges in their development is ensuring their effective navigation in space and movement within designated lanes. This paper examines a method of spatial orientation for vehicles using computer vision and artificial neural networks. The research focused on the navigation system of an autonomous vehicle, which incorporates the use of modern distributed and parallel computing technologies.\r\nObjective. The aim of this work is to enhance modern autonomous vehicle navigation algorithms through parallel training of artificial neural networks and to determine the optimal combination of technologies and nodes of devices to increase speed and enable real-time decision-making capabilities in spatial navigation for autonomous vehicles.\r\nMethod. The research establishes that the utilization of computer vision and neural networks for road lane segmentation proves to be an effective method for spatial orientation of autonomous vehicles. For multi-core computing systems, the application of parallel programming technology, OpenMP, for neural network training on processors with varying numbers of parallel threads increases the algorithm’s execution speed. However, the use of CUDA technology for neural network training on a graphics processing unit significantly enhances prediction speeds compared to OpenMP. Additionally, the feasibility of employing PyTorch Distributed Data Parallel (DDP) technology for training the neural network across multiple graphics processing units (nodes) simultaneously was explored. This approach further improved prediction execution times compared to using a single graphics processing unit.\r\nResults. An algorithm for training and prediction of an artificial neural network was developed using two independent nodes, each equipped with separate graphics processing units, and their synchronization for exchanging training results after each epoch, employing PyTorch Distributed Data Parallel (DDP) technology. This approach allows for scalable computations across a higher number of resources, significantly expediting the model training process.\r\nConclusions. The conducted experiments have affirmed the effectiveness of the proposed algorithm, warranting the recommendation of this research for further advancement in autonomous vehicles and enhancement of their navigational capabilities. Notably, the research outcomes can find applications in various domains, encompassing automotive manufacturing, logistics, and urban transportation infrastructure. The obtained results are expected to assist future researchers in understanding the most efficient hardware and software resources to employ for implementing AI-based navigation systems in autonomous vehicles. Prospects for future investigations may encompass refining the accuracy of the proposed parallel algorithm without compromising its efficiency metrics. Furthermore, there is potential for experimental exploration of the proposed algorithm in more intricate practical scenarios of diverse nature and dimensions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15588/1607-3274-2023-4-11"
    },
    {
        "id": 5528,
        "title": "Probabilistic motion planning for non-Euclidean and multi-vehicle problems",
        "authors": "Anton Lukyanenko, Damoon Soudbakhsh",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104487"
    },
    {
        "id": 5529,
        "title": "RobustStateNet: Robust ego vehicle state estimation for Autonomous Driving",
        "authors": "Pragyan Dahal, Simone Mentasti, Luca Paparusso, Stefano Arrigoni, Francesco Braghin",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104585"
    },
    {
        "id": 5530,
        "title": "GNSS-Assisted System Identification of Autonomous Ground Vehicle Model and Sensor Parameters",
        "authors": "Aaron Hunter, Renwick Curry, Gabriel Hugh Elkaim",
        "published": "2023-4-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/plans53410.2023.10140092"
    },
    {
        "id": 5531,
        "title": "Digital twin‐based multi‐objective autonomous vehicle navigation approach as applied in infrastructure construction",
        "authors": "Tingjun Lei, Timothy Sellers, Chaomin Luo, Lei Cao, Zhuming Bi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "AbstractThe widespread adoption of autonomous vehicles has generated considerable interest in their autonomous operation, with path planning emerging as a critical aspect. However, existing road infrastructure confronts challenges due to prolonged use and insufficient maintenance. Previous research on autonomous vehicle navigation has focused on determining the trajectory with the shortest distance, while neglecting road construction information, leading to potential time and energy inefficiencies in real‐world scenarios involving infrastructure development. To address this issue, a digital twin‐embedded multi‐objective autonomous vehicle navigation is proposed under the condition of infrastructure construction. The authors propose an image processing algorithm that leverages captured images of the road construction environment to enable road extraction and modelling of the autonomous vehicle workspace. Additionally, a wavelet neural network is developed to predict real‐time traffic flow, considering its inherent characteristics. Moreover, a multi‐objective brainstorm optimisation (BSO)‐based method for path planning is introduced, which optimises total time‐cost and energy consumption objective functions. To ensure optimal trajectory planning during infrastructure construction, the algorithm incorporates a real‐time updated digital twin throughout autonomous vehicle operations. The effectiveness and robustness of the proposed model are validated through simulation and comparative studies conducted in diverse scenarios involving road construction. The results highlight the improved performance and reliability of the autonomous vehicle system when equipped with the authors’ approach, demonstrating its potential for enhancing efficiency and minimising disruptions caused by road infrastructure development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/csy2.12110"
    },
    {
        "id": 5532,
        "title": "Exploration of robust and intelligent navigation algorithms to ensure off-road autonomous vehicle mobility",
        "authors": "Paramsothy Jayakumar, Christopher Goodin, Jordan Ewing, Seth Tau, Kumar B. Kulkarni, Michael Cole",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvp.2024.10062615"
    },
    {
        "id": 5533,
        "title": "Deep Reinforcement Learning for Autonomous Vehicle Intersection Navigation",
        "authors": "Badr Ben Elallid, Hamza El Alaoui, Nabil Benamar",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/3ict60104.2023.10391453"
    },
    {
        "id": 5534,
        "title": "Waveguide invariant navigation of an autonomous underwater vehicle",
        "authors": "Junsu Jang, Florian Meyer",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Reliable navigation of an autonomous underwater vehicle (AUV) remains a challenge due to the unavailability of a global positioning system underwater. However, the self-localization uncertainty of an AUV with an acoustic receiver can potentially be reduced by leveraging passive acoustic ranging techniques. In particular, in shallow water, the range between an acoustic source and a passive receiver can be estimated using the waveguide invariant. In this work, we develop a sequential Bayes navigation filter that fuses passive recordings of an acoustic source with the measurements of an inertial sensor. The acoustic source can either be cooperative or a source of opportunity, e.g., a container ship. Using particle-based processing, our filter can either estimate the waveguide invariant or the AUV position by making use of a detailed nonlinear statistical model of the received signal. If the position of the AUV is accurately known, e.g., in the beginning of the AUV’s mission, the waveguide invariant can be estimated. Alternatively, assuming that accurate waveguide invariant information is available, range information can be obtained and used to improve the estimate of the AUV’s position. The navigation capability provided by the proposed sequential Bayes filter is demonstrated using simulated and real data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1121/10.0023618"
    },
    {
        "id": 5535,
        "title": "A lumen-adapted navigation scheme with spatial awareness from monocular vision for autonomous robotic endoscopy",
        "authors": "Tao Yang, Yongming Yang, Peng Wang, Yang Cao, Zhuo Yang, Hao Liu",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104444"
    },
    {
        "id": 5536,
        "title": "Enhancing Autonomous Ground Vehicle Positioning and Navigation through Cascaded Multi-Sensor Integration",
        "authors": "Adrian Aryaputra Firmansyah, Abdullah Alkaff",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icamimia60881.2023.10427562"
    },
    {
        "id": 5537,
        "title": "Radar-based path planning of autonomous surface vehicle with static and dynamic obstacles in a Frenet Frame",
        "authors": "Zhihuan Hu, Ziheng Yang, Xiaocheng Liu, Weidong Zhang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractNavigation safety at sea is vital for each autonomous surface vehicle (ASV), which involves the problem of motion planning in dynamic environments and their robust tracking through feedback control. We present a practical path-planning method that generates smooth trajectories for a marine vehicle traveling in an unknown environment, where obstacles are detected in real time by millimetre wave (mmWave) radar. Our approach introduces a polynomial curve to describe the lateral and longitudinal trajectories in the Frenet frame, known as the ‘motion primitives’, whose combination ensures that the planning area is properly covered. In addition, we can select a feasible, optimal and collision-free trajectory from such a set of motion primitives that is generated by considering the vehicle dynamics and comfort. The capabilities of proposed algorithm are demonstrated in the experiment with static and dynamic obstacles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s037346332300019x"
    },
    {
        "id": 5538,
        "title": "Strategical Implementation of Autonomous Vehicle Navigation System",
        "authors": "Srikanta Kumar Mohapatra, Farida A. Ali, Prakash Kumar Sarangi, Premananda Sahu, Jayashree Mohanty",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cisct57197.2023.10351257"
    },
    {
        "id": 5539,
        "title": "Integrated Perception and Planning for Autonomous Vehicle Navigation: An Optimization-based Approach",
        "authors": "Shubham Kedia, Yu Zhou, Sambhu H. Karumanchi",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00323"
    },
    {
        "id": 5540,
        "title": "Transformer-Based Multi-Modal Probabilistic Pedestrian Prediction for Risk-Aware Autonomous Vehicle Navigation",
        "authors": "Murad Mebrahtu, Awet Araia, Abiel Ghebreslasie, Jorge Dias, Majid Khonji",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10436505"
    },
    {
        "id": 5541,
        "title": "A deep multi-agent reinforcement learning framework for autonomous aerial navigation to grasping points on loads",
        "authors": "Jingyu Chen, Ruidong Ma, John Oyekan",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104489"
    },
    {
        "id": 5542,
        "title": "Social navigation framework for autonomous vehicle with hierarchical cyber-physical system architecture",
        "authors": "Yuto Imanishi, Hiroyuki Yamada",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2279601"
    },
    {
        "id": 5543,
        "title": "Challenges of Autonomous Navigation and Perception Technology for Unmanned Special Vehicles in Underground Mine",
        "authors": "Xiaowei Xu, Lijuan Li, Wenhua Jiao, Qing Zhang",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164322"
    },
    {
        "id": 5544,
        "title": "Design and Development of Navigation System for an Autonomous Vehicle",
        "authors": "Benjamas Panomruttanarug, Thanakorn Ketnoi, Ashis Kumar Ojha, Natthawut Boonruam",
        "published": "2023-1-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ica-symp56348.2023.10044952"
    },
    {
        "id": 5545,
        "title": "Autonomous Unmanned Aerial Vehicle Indoor Navigation Based on Deep Learning Approaches",
        "authors": "Hamed Ghasemi, Elnaz Balazadeh, Shayan Malekpour, Ahmad Kalhor, Mehdi Tale Masouleh",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrom60803.2023.10412578"
    },
    {
        "id": 5546,
        "title": "Submarine Geophysical Navigation of Autonomous Underwater Vehicle Using Extended Kalman Filter",
        "authors": "Zetian Yu, Qiang Zhang, Guobang Chen, Chuanzhi Huang, Jinshou Lan",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10442118"
    },
    {
        "id": 5547,
        "title": "Dynamics-aware navigation among moving obstacles with application to ground and flying robots",
        "authors": "Spyridon G. Tarantos, Tommaso Belvedere, Giuseppe Oriolo",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104582"
    },
    {
        "id": 5548,
        "title": "Sequential learning navigation method and general correction model for Autonomous Underwater Vehicle",
        "authors": "Xin Zhang, Bo He, Shuang Gao, Liqian Zhou, Runhua Huang",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.114347"
    },
    {
        "id": 5549,
        "title": "Perception-Map Generation for Autonomous Driving Vehicle",
        "authors": "Kwanho Kim, Kanghyun Jo",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwis58789.2023.10284617"
    },
    {
        "id": 5550,
        "title": "Data-Driven Vehicle Dynamic Model for Autonomous Vehicle Applications",
        "authors": "Jack Gregory, Mohammad Rokonuzzaman, Navid Mohajer, Mohammadali Ghafarian",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394125"
    },
    {
        "id": 5551,
        "title": "Autonomous Navigation, Mapping and Exploration with Gaussian Processes",
        "authors": "Mahmoud Ali, Hassan Jardali, Nicholas Roy, Lantao Liu",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.104"
    },
    {
        "id": 5552,
        "title": "Dynamic model based integrated navigation for a small and low cost autonomous surface/underwater vehicle",
        "authors": "Daxiong Ji, Huifang Cheng, Shuai Zhou, Shuo Li",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2023.114091"
    },
    {
        "id": 5553,
        "title": "An autonomous navigation system for an unmanned surface vehicle for plastic waste collection",
        "authors": "Piero Figueroa, Luis Marsano, Leonardo Vinces, Dante Vargas",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/intercon59652.2023.10326047"
    },
    {
        "id": 5554,
        "title": "Unmanned Ground Vehicle Autonomous Navigation in Unknown Indoor Environments",
        "authors": "Mengjiao Xie, Chunlei Song, Jiahui Wang, Xiaohui Wu, Man Li, Jianhua Xu",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci57876.2023.10176610"
    },
    {
        "id": 5555,
        "title": "Optimal Design of UUV Autonomous Navigation and Positioning Algorithm Based on TDOA Positioning Model",
        "authors": "Kaixuan Cong, Genjia Xu, Lezhong Wang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiars59518.2023.00046"
    },
    {
        "id": 5556,
        "title": "Distributed strategy for communication between multiple robots during formation navigation task",
        "authors": "Rubisson Duarte Lamperti, Lucia Valéria Ramos de Arruda",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104509"
    },
    {
        "id": 5557,
        "title": "Accelerated and Refined Lane-Level Route-Planning Method Based on a New Road Network Model for Autonomous Vehicle Navigation",
        "authors": "Ke He, Haitao Ding, Nan Xu, Konghui Guo",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "Lane-level route planning is a critical issue for a lane-level navigation system for autonomous vehicles. Current route-planning methods mainly focus on the road level and applying them directly to search for lane-level routes results in a reduction in search efficiency. In addition, previously developed lane-level methods lack consideration for vehicle characteristics and adaptability to multiple road network structures. To solve this issue, this study proposes an accelerated and refined lane-level route-planning algorithm based on a new lane-level road network model. First, five sub-layers are designed to refine the internal structure of the divided road and intersection areas so that the model can express multiple variations in road network structures. Then, a multi-level route-planning algorithm is designed for sequential planning at the road level, lane group level, lane section level, and lane level to reduce the search space and significantly improve routing efficiency. Last, an optimal lane determination algorithm considering traffic rules, vehicle characteristics, and optimization objectives is developed at the lane level to find the optimal lanes on roads with different configurations, including those with a constant or variable number of lanes while satisfying traffic rules and vehicle characteristics. Tests were performed on simulated road networks and a real road network. The results demonstrate the algorithm’s better adaptability to changing road network structures and vehicle characteristics compared with past hierarchical route planning, and its higher efficiency compared with direct route planning, past hierarchical route planning, and the Apollo route-planning method, which can better support autonomous vehicle navigation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/wevj14040098"
    },
    {
        "id": 5558,
        "title": "Cooperative Tracking of Autonomous Underwater Vehicle with Quantized Relative Measurement",
        "authors": "Pengfei Yang, Xiaolei Li, Jiange Wang, Yuliang Fu, Xiaoyuan Luo",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoias61634.2023.00036"
    },
    {
        "id": 5559,
        "title": "Computer-Vision Based Real Time Waypoint Generation for Autonomous Vineyard Navigation with Quadruped Robots",
        "authors": "Lee Milburn, Juan Gamba, Miguel Fernandes, Claudio Semini",
        "published": "2023-4-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarsc58346.2023.10129563"
    },
    {
        "id": 5560,
        "title": "Autonomous Underwater Vehicle Navigation via Sensors Maximum-Ratio Combining in Absence of Bearing Angle Data",
        "authors": "Vadim Kramar, Aleksey Kabanov, Kirill Dementiev",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "This paper proposes a maximum-ratio combining sensor fusion scheme for using an extended Kalman filter in the underwater vehicle positioning task by means of communication devices (buoys) providing location information using a slant-range mechanism, inertial sensors, a Doppler velocity log, and a pressure sensor in the absence of bearing angle data. The parameter estimation methods for all navigation system components are described. The results of simulation modeling with corresponding quality metrics are presented. The outcomes were supported by conducted field experiments. The results obtained allowed us to obtain a position determination model for the underwater vehicle, which is still a relevant and complex task for seabed explorers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse11101847"
    },
    {
        "id": 5561,
        "title": "Camera Calibration Method for Autonomous Navigation based on Space Non-cooperative Target Features",
        "authors": "Bowen Hou, Han Yuan, Xuanying Zhou, Runran Deng, E Wei, Ping Liu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164618"
    },
    {
        "id": 5562,
        "title": "A novel end to end framework for autonomous vehicle navigation &amp; training",
        "authors": "Mandeep Singh Saini, Ruhul Amin Choudhury, Vasudeva Kilaru",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0196286"
    },
    {
        "id": 5563,
        "title": "An Improved Autonomous Inertial-Based Integrated Navigation Scheme Based on Vehicle Motion Recognition",
        "authors": "Pei Yu, Wei Wei, Jing Li, Fang Wang, Lili Zhang, Zengqiang Chen",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3318548"
    },
    {
        "id": 5564,
        "title": "Autonomous Control Method for Object Grasping of Logistics Sorting Manipulator Considering Changes in Lighting Environment",
        "authors": "Ying Liu",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "The autonomous grasping operation is the key to the intelligent logistics sorting manipulators. Since the current logistics sorting manipulators mostly use visual sensors to identify objects, they are extremely vulnerable to the changes in the lighting environment. Therefore, the research considers the influence of complex lighting environment on the autonomous grasping of logistics sorting manipulators. Furthermore, it verifies the effectiveness of SAC-AE-ICM algorithm through simulations and experiments. The experimental results show that SAC-AE-ICM algorithm can quickly achieve convergence in many experiments and can obtain global optimization. In the process of automatic capture, the success rate of SAC-AE-ICM algorithm can reach 90%, which is 25% higher than that of the method without ICM and has better convergence. The success rate was as high as 77% for unknown or irregular targets. In practical experiments, SAC-AE-ICM can effectively capture under good lighting conditions. However, under low light conditions, the probability of capturing unknown targets is about 72.5%. Overall, the success rates for single-object and multi-object capture are 88% and 85%, respectively. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4273/ijvss.15.2.06"
    },
    {
        "id": 5565,
        "title": "Deep learning-based heterogeneous system for autonomous navigation",
        "authors": "Timothy Sellers, Tingjun Lei, Daniel W. Carruth, Chaomin Luo",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2665844"
    },
    {
        "id": 5566,
        "title": "Autonomous Vehicle Cyber-Attacks Classification Framework",
        "authors": "Yazan Aref, Abdelkader Ouda",
        "published": "2023-1-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets56262.2023.10041387"
    },
    {
        "id": 5567,
        "title": "Vehicle-Centered Global Path Generation for Autonomous Vehicle",
        "authors": "Runsheng Wang, Songyi Zhang, Jiawei Fu, Shitao Chen, Jingmin Xin, Nanning Zheng",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422074"
    },
    {
        "id": 5568,
        "title": "Dynamic Vehicle Modelling and Controlling Techniques for Autonomous Vehicle Systems",
        "authors": " R. Sushma,  J. Satheesh Kumar",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "The driving scenario of an automated vehicle is the crucial technology in the design of autonomous cars. This suggested approach aims to address the shortcomings of autonomous cars, such as their poor real- time performance and low control precision. The process for building a virtual simulation environment for autonomous vehicle testing and validation is described in this study. Model Predictive Control and Proportional Integral and Derivative Control are used in MATLAB simulation to build three car models. These are related to the 2D and 3D animation used in collision detection and visualization. The virtual engine visualization is included throughout the model. A variety of test circumstances are used to validate the simulation model, and the model’s performance is assessed in the presence of various barriers. The simulation's findings demonstrate that the autonomous vehicle has a strong potential for self-adaptation even in challenging and complex working environments. No instances of car sideslip or track departure have been noted. It is discovered that this autonomous car performs remarkably well overall when compared to other autonomous vehicles. The suggested approach is essential for enhancing autonomous vehicle driving safety, maintaining vehicle control in challenging situations, and improving the advancement of intelligent vehicle driving assistance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36548/jeea.2022.4.007"
    },
    {
        "id": 5569,
        "title": "Human Acceptance of Autonomous Mobility: A Literature Review",
        "authors": "Dalia Hafiz",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uvs59630.2024.10467165"
    },
    {
        "id": 5570,
        "title": "End-to-end autonomous vehicle navigation control method guided by the dynamic window approach",
        "authors": "Longfei Gao, Yan Wu, Liye Wang, Lifang Wang, Junzhi Zhang, Kui Li",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cieec58067.2023.10167001"
    },
    {
        "id": 5571,
        "title": "A review of the automated guided vehicle systems: dispatching systems and navigation concept",
        "authors": "Patrick Siegfried, Rami Bourafa",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Problem. As one of the three key elements of flexible manufacturing systems (FMS), automated guided vehicles (AGVs) play a significant role in material handling systems. They've been around for more than a decade, primarily in Europe. AGVs were formerly utilized mostly in production lines, but due to recent industrial development, they now play a vital role in a variety of different applications and domains, including warehouses, port facilities, transportation systems, and even the medical sector. Goal. The purpose of the work is to analyze two methods of AGV control and the paths that the AGV should follow during transport operations, taking into account safety and limitations for heavy loads that need to be transported in difficult conditions. Methodology. We attempted to provide a summary of the two existing AGV control methods, centralized and decentralized control offered by major manufacturers in this study. Almost all function in a centralized manner, with a single central controller controlling the whole fleet of AGVs. The author sees a tendency toward decentralized systems in which AGVs make individual decisions in favor of transportation flexibility, robustness, and adaptability. A brief explanation of well-known and mature navigation technologies used by AGVs in the industry is also provided, along with both physical and virtual paths to be followed by the AGV during transportation operations, since these technologies get to be a key issue given the safety constraints, particularly for heavy loads to be transported in challenging environments. Results. This paper covers one of the key tasks that must be completed in order to control an AGV system for a central and decentral architecture, for which we have already given a broad overview, as well as the differences between the architectures and their benefits and drawbacks. Originality. The author sees that the merging of various techniques we have will lead to more and new challenges as well as innovations, however, that practical application of distributed control still requires further research and studies and has a way to go in terms of taking other sections such as safety and sustainability into account. Practical value. The primary benefits and drawbacks of various technologies are discussed, as well as how we might improve the efficiency of some of them.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30977/at.2219-8342.2023.52.0.09"
    },
    {
        "id": 5572,
        "title": "Pulsar-Leveraged Autonomous Navigation Testbed System (PLANTS): A Low-Cost Software-Hardware Hybrid Testbed for Pulsar-based Autonomous Navigation (XNAV) Positioning, Navigation, and Timing (PNT) Solutions",
        "authors": "Sarah Hasnain, Michael Berkson, Sharon Maguire, Evan Sun, Katie Zaback",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/plans53410.2023.10139942"
    },
    {
        "id": 5573,
        "title": "Convergence of Communications, Control, and Machine Learning for Secure and Autonomous Vehicle Navigation",
        "authors": "Tengchan Zeng, Aidin Ferdowsi, Omid Semiari, Walid Saad, Choong Seon Hong",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mwc.005.2300030"
    },
    {
        "id": 5574,
        "title": "A non-potential orthogonal vector field method for more efficient robot navigation and control",
        "authors": "Yan Gao, Chenggang Bai, Rao Fu, Quan Quan",
        "published": "2023-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2022.104291"
    },
    {
        "id": 5575,
        "title": "Research on Lead Aircraft Navigation Algorithm in Cluster Aircraft Navigation",
        "authors": "Fangdong Li, Qinghua Zeng, Shouyi Wang, Jianye Liu, Rongbing Li, Xiaorong Sun",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164298"
    },
    {
        "id": 5576,
        "title": "Perception-aware online trajectory generation for a prescribed manoeuvre of unmanned surface vehicle in cluttered unstructured environment",
        "authors": "Amirmehdi Yazdani, Somaiyeh MahmoudZadeh, Oleg Yakimenko, Hai Wang",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104508"
    },
    {
        "id": 5577,
        "title": "Autonomous Navigation and Control of a Quadrotor Using Deep Reinforcement Learning",
        "authors": "Mohamed Mokhtar, Ayman El-Badawy",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icuas57906.2023.10156126"
    },
    {
        "id": 5578,
        "title": "Semantic interpretation of raw survey vehicle sensory data for lane-level HD map generation",
        "authors": "Matteo Bellusci, Paolo Cudrano, Simone Mentasti, Riccardo Erminio Filippo Cortelazzo, Matteo Matteucci",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104513"
    },
    {
        "id": 5579,
        "title": "Key Requirements for Autonomous Micromobility Vehicle Simulators",
        "authors": "Lennart Luttkus, Lars Mikelsons",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394587"
    },
    {
        "id": 5580,
        "title": "Localization Uncertainty Estimation for Autonomous Underwater Vehicle Navigation",
        "authors": "Yong Zhang, Feihu Zhang, Zhiliang Wang, Xiaofang Zhang",
        "published": "2023-8-2",
        "citations": 1,
        "abstract": "High-precision positioning capability is a crucial technology for achieving accurate navigation in autonomous underwater vehicles (AUVs). However, due to severe electromagnetic wave attenuation underwater and the unavailability of the global positioning system (GPS), inertial-navigation-based dead reckoning is considered the primary method for underwater positioning. Unfortunately, errors accumulated during the navigation process lead to unbounded drift, and filtering-based methods have been used to mitigate the errors, but with limited success. In this paper, we propose a precise underwater dead-reckoning mathematical model that recursively calculates the ground truth and corresponding errors based on an AUV’s motion model, and we derive empirical formulas. Compared to related methods, this approach not only models the cumulative errors of relative noise measurements, but also provides recursive expressions with corresponding statistical moments. The experimental results demonstrate that this formula significantly reduces positioning errors in underwater navigation tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse11081540"
    },
    {
        "id": 5581,
        "title": "Pedestrian and vehicle behaviour prediction in autonomous vehicle system — A review",
        "authors": "Luiz G. Galvão, M. Nazmul Huda",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121983"
    },
    {
        "id": 5582,
        "title": "Enhanced SSD Algorithm-Based Object Detection and Depth Estimation for Autonomous Vehicle Navigation",
        "authors": "Vaibhav Saini, MVV Prasad Kantipudi, Pramoda Meduri",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ijtdi.070408"
    },
    {
        "id": 5583,
        "title": "Path Planning of Autonomous Underwater Vehicle Departing from Port Based on Improved Deep Q-Network",
        "authors": "Chen Li, Meng Joo Er, Tianhe Liu, Guohong Jiang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoias61634.2023.00043"
    },
    {
        "id": 5584,
        "title": "A mixed-reality framework based on depth camera for safety testing of autonomous navigation systems",
        "authors": "Imane Argui, Maxime Guériau, Samia Ainouz",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10421982"
    },
    {
        "id": 5585,
        "title": "Modelling and simulation of an autonomous vehicle based on Alexnet for traffic sign recognition",
        "authors": "Chao Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvsmt.2024.10061510"
    },
    {
        "id": 5586,
        "title": "Reactive navigation of nonholonomic robots for search and tight circumnavigation of group objects through singular inter-object gaps",
        "authors": "V.A. Chernov, A.S. Matveev",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2024.104649"
    },
    {
        "id": 5587,
        "title": "Navigation and docking maneuvers control of an autonomous omnidirectional platform in a dynamic internal logistics environment",
        "authors": "João Correia, Luís Louro, Sérgio Monteiro, Wolfram Erlhagen, Estela Bicho",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarsc58346.2023.10129639"
    },
    {
        "id": 5588,
        "title": "Extremum seeking control for the trajectory tracking of a skid steering vehicle via averaged sub-gradient integral sliding-mode theory",
        "authors": "A. Hernandez Sanchez, A. Poznyak, I. Chairez",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104609"
    },
    {
        "id": 5589,
        "title": "Research on Navigation and Positioning Technology for Autonomous Recovery of Unmanned Surface Vehicles",
        "authors": "Chen Xu, Li-Ming Cai, Xue-Jiao Sun, Chang-Qing Hu, Qing-Zhou Li",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168363"
    },
    {
        "id": 5590,
        "title": "Application of the Self-Organization Algorithm with the Trend Redundancy in Navigation and Mapping of the Vehicle",
        "authors": "J. Yi, M.S. Selezneva, K.A. Neusypin, J. Zheng",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168497"
    },
    {
        "id": 5591,
        "title": "Autonomous Drone Takeoff and Navigation Using Reinforcement Learning",
        "authors": "Sana Ikli, Ilhem Quenel",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012296300003636"
    },
    {
        "id": 5592,
        "title": "Computer Vision-Based Position Estimation for an Autonomous Underwater Vehicle",
        "authors": "Jacek Zalewski, Stanisław Hożyń",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "Autonomous Underwater Vehicles (AUVs) are currently one of the most intensively developing branches of marine technology. Their widespread use and versatility allow them to perform tasks that, until recently, required human resources. One problem in AUVs is inadequate navigation, which results in inaccurate positioning. Weaknesses in electronic equipment lead to errors in determining a vehicle’s position during underwater missions, requiring periodic reduction of accumulated errors through the use of radio navigation systems (e.g., GNSS). However, these signals may be unavailable or deliberately distorted. Therefore, in this paper, we propose a new computer vision-based method for estimating the position of an AUV. Our method uses computer vision and deep learning techniques to generate the surroundings of the vehicle during temporary surfacing at the point where it is currently located. The next step is to compare this with the shoreline representation on the map, which is generated for a set of points that are in a specific vicinity of a point determined by dead reckoning. This method is primarily intended for low-cost vehicles without advanced navigation systems. Our results suggest that the proposed solution reduces the error in vehicle positioning to 30–60 m and can be used in incomplete shoreline representations. Further research will focus on the use of the proposed method in fully autonomous navigation systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs16050741"
    },
    {
        "id": 5593,
        "title": "Real-time human search and monitoring system using unmanned aerial vehicle",
        "authors": "Cheok Jun Hong, Vimal Rau Aparow, Hishamuddin Jamaluddin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvas.2023.10061509"
    },
    {
        "id": 5594,
        "title": "Semantic Navigation Applied to Narrow Passages for Intelligent Wheelchairs",
        "authors": "Daniel Correia, Artur Pereira, Eurico Pedrosa",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarsc58346.2023.10129568"
    },
    {
        "id": 5595,
        "title": "Development of Fuzzy Logic Controller in Automatic Vehicle Navigation using IoT",
        "authors": " S Devikala",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "The integration of fuzzy logic controllers in automatic vehicle navigation systems represents a significant advancement in intelligent transportation systems, especially when paired with Internet of Things (IoT) functionalities and optimized through genetic algorithms. This innovative fusion harnesses the precision of fuzzy logic, the connectivity of IoT, and the optimization capabilities of genetic algorithms to transform automatic vehicle navigation. Fuzzy logic controllers excel in managing uncertainty and imprecision, providing decision-making capabilities akin to human reasoning. By simultaneously assessing multiple inputs and determining actions based on degrees of truth, fuzzy logic enables safe and efficient navigation in dynamic driving environments with fluctuating variables like obstacle proximity and traffic flow. IoT integration enhances navigation systems by enabling real-time data collection and sharing among vehicles and infrastructure, fostering adaptive route planning and improving the overall navigation experience. Genetic algorithms further optimize system performance by iteratively adjusting fuzzy logic controller parameters, ensuring efficient decision-making tailored to specific performance criteria such as travel time and fuel consumption. This collaborative integration of fuzzy logic controllers, IoT, and genetic algorithms offers a holistic solution to the challenges of automatic vehicle navigation, enhancing safety, efficiency, and adaptability in complex driving scenarios. Beyond enhancing individual vehicle performance, this approach contributes to overall transportation system efficiency and safety by mitigating traffic congestion, reducing emissions, and minimizing accidents. Consequently, these integrated systems address crucial societal challenges and pave the way for widespread adoption of autonomous vehicles in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1254"
    },
    {
        "id": 5596,
        "title": "Filtering-RRT for Autonomous Indoor Navigation",
        "authors": "Akshat Vikram Singh, Yash Agrawal, Rahul Gupta, Vivek Ashok Bohara",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets59351.2024.10427090"
    },
    {
        "id": 5597,
        "title": "A Push-Pull Train for Safety of Autonomous Vehicle Software",
        "authors": "Suhrid A. Wadekar",
        "published": "2023-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets56262.2023.10041324"
    },
    {
        "id": 5598,
        "title": "Optimization of Localization Error in Multi-Agent Systems through Cooperative Positioning: Autonomous Navigation in Partially Denied GNSS Environments",
        "authors": "Shahram Shahkar, Khashayar Khorasani",
        "published": "2023-3-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inertial56358.2023.10103968"
    },
    {
        "id": 5599,
        "title": "Modelling and simulation of an autonomous vehicle based on Alexnet for traffic sign recognition",
        "authors": "Chao Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvsmt.2024.136760"
    },
    {
        "id": 5600,
        "title": "Development of autopilot control algorithm for an unmanned aerial vehicle based on simulation",
        "authors": "Jae Cheon Lee, Hao Liu, Masri Hakiki",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvas.2023.10057322"
    },
    {
        "id": 5601,
        "title": "An All-Terrain Intelligent Autonomous Vehicle with Sensor Fusion Based Navigation Capabilities",
        "authors": " Gadakh Sankalp Ashok,  Hase Alok Dattatraya,  Bagul Akshay Arvind,  Prof. Dighe Y. N.",
        "published": "2024-3-3",
        "citations": 0,
        "abstract": "An automated defense robot building is planned, that has a laser gun attached, which is utilized for pointing laser rays to destroy the target object. One of the most important things about these robots is that they have the capability to perform missions remotely in the field, without any actual danger to human lives. In the proposed system, a robot is developed that is controlled through Microcontroller. For the aiming purpose and to view the road and the surroundings in which the robot is travelling, wireless cameras are installed. Radio frequency can be used to control the robot.\nThese defense robots used in military are usually employed with the integrated system including gripper, cameras and sensors. This is specially designed for defense robotic system to save human life and protect the country from enemies. In the existing systems, personal computer using ZigBee protocol is used to monitor the robot.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-15618"
    },
    {
        "id": 5602,
        "title": "Unveiling the Road Ahead: An MPC-Based Approach for Autonomous Intersection Navigation with Occlusion",
        "authors": "Zheyu Zhang, Jingjing Jiang, Wen-Hua Chen",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iavvc57316.2023.10328095"
    },
    {
        "id": 5603,
        "title": "Autonomous Estimation of the Stochastic State Vector of an Uncorrected Gyrostabilized Platform",
        "authors": "V.A. Pogorelov, Elena Chub",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168361"
    },
    {
        "id": 5604,
        "title": "A Method for Constructing Semantic Navigation Maps in Urban Environments",
        "authors": "Fanxiao Yi, Lei Ye, Mengjie Huang, Qian Wang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoias61634.2023.00031"
    },
    {
        "id": 5605,
        "title": "Intelligent Ship Navigation Method Based on Deep Reinforcement Learning Algorithm",
        "authors": "Youyu Chai, Wei Guan, Husheng Han, Zhewen Cui",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoias61634.2023.00030"
    },
    {
        "id": 5606,
        "title": "Improved Navigation System of Marine Unmanned Robot Based on Sensor Fusion",
        "authors": "Radmanesh Meysam, Darabi Samira",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uvs59630.2024.10467151"
    },
    {
        "id": 5607,
        "title": "Proportional Navigation-Based Guidance for an Autonomous Interdiction Mission Against a Stationary Target",
        "authors": "Aman Choudhary, Vivek A, Satadal Ghosh",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icuas57906.2023.10155962"
    },
    {
        "id": 5608,
        "title": "Cost-effective Platform for Validating Optical Autonomous Navigation Systems and Algorithms on Earth",
        "authors": "Paulo Kemper, Hyogeun Han, Hyosang Yoon",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-1861"
    },
    {
        "id": 5609,
        "title": "A Modified Block Backstepping Controller for Autonomous Vehicle Lane Changing",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0430.20"
    },
    {
        "id": 5610,
        "title": "Terrain Referenced Navigation Technique Using Correlation Algorithms for Cruise Vehicle",
        "authors": "",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37285/bsp.sasat2023.11"
    },
    {
        "id": 5611,
        "title": "3D Vision Aided GNSS Real-Time Kinematic Positioning for Autonomous Systems in Urban Canyons",
        "authors": "Weisong Wen, Xiwei Bai,, Li-Ta Hsu",
        "published": "2023",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33012/navi.590"
    },
    {
        "id": 5612,
        "title": "Design and development of software stack of an autonomous vehicle using robot operating system",
        "authors": "Abhisek Omkar Prasad, Pradumn Mishra, Urja Jain, Anish Pandey, Anushka Sinha, Anil Singh Yadav, Rajan Kumar, Abhishek Sharma, Gaurav Kumar, Karrar Hazim Salem, Avdhesh Sharma, Anil Kumar Dixit",
        "published": "2023-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2022.104340"
    },
    {
        "id": 5613,
        "title": "LiDAR View Synthesis for Robust Vehicle Navigation Without Expert Labels",
        "authors": "Jonathan Schmidt, Qadeer Khan, Daniel Cremers",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422174"
    },
    {
        "id": 5614,
        "title": "A Non-Autonomous Doppler Navigation Method With Navigation Beacon",
        "authors": "Tao Yu",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/metroaerospace57412.2023.10190010"
    },
    {
        "id": 5615,
        "title": "GPS-Aided Auto Navigation System for Autonomous Vehicles",
        "authors": "Manchala Shivamani, K.C. Meghavardhan Reddy, Shaik Shakeera, Hrishikesh Venkataraman",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/esdc56251.2023.10149881"
    },
    {
        "id": 5616,
        "title": "Passive underwater Acoustic IDentification (AID) tags for enhancing Autonomous Underwater Vehicle (AUV) navigation during docking or homing operations",
        "authors": "Nizar Somaan, Ananya Bhardwaj, Karim G. Sabra",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "Autonomous underwater vehicle (AUV) navigation requires accurate positioning information from the surrounding environment, especially for tasks such as AUV homing or docking operations. Previous literature has introduced a class of low-cost passive underwater acoustic markers, termed Acoustic IDentification (AID) tags [Satish and Sabra, J. Acoust. Soc. Am. 149(5), 3387–3405 (2021)] built of multi-layer shells with different acoustic properties and thicknesses to generate a uniquely engineered acoustic signature, composed of the multiple reflections created by the layer interfaces. These passive AID tags can be detected by an AUV instrumented with a high-frequency sonar transducer at significantly greater distances than conventional optical methods, especially in turbid waters. Additionally using AID tags as navigation-aid can also alleviate the need of relying on active acoustic transponders. An implementation of a constellation of AID tags enabling fine underwater positioning an AUV towards a docking station or for homing purposes will be presented to provide proof of concept. Furthermore, the optimization of the design of the AID tags for this application aswell as specific signal processing detection methodologies to improve thedetectability of AID tags in the presence of interfering signals (e.g., clutter) will be discussed. [Work supported by the Office of Naval Research].",
        "keywords": "",
        "link": "http://dx.doi.org/10.1121/10.0019102"
    },
    {
        "id": 5617,
        "title": "Intelligent path planning algorithm of Autonomous Underwater Vehicle based on vision under ocean current",
        "authors": "Yibo Wang, Meng Xi, Yubo Weng",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "AbstractAutonomous Underwater Vehicle (AUV) is an important tool for intelligent ocean applications, which can be applied to detect underwater environment and search target. Path planning is the key technology to realize AUV intelligence, which has important research significance. Aiming at the dynamic path planning problem, the Regional Ocean Modeling System (ROMS) was first applied to the AUV three‐dimensional (3D) dynamic path planning, and a Gate Recurrent Unit Proximal Policy Optimization with Local Vision (GPPO‐LV) model based on local vision is proposed. The 3D ocean current environment is constructed based on the ROMS simulation data. The local vision matrix is constructed based on underwater images, and the features of local vision are extracted using convolutional neural network. Furthermore, Gate Recurrent Unit (GRU) network is used to mine the hidden information between observation states. Finally, the Actor network for strategy output and the Critical network for action value evaluation are constructed, and strategies are optimized in the process of interaction with the environment. The experiment shows that under various unknown environments, AUV can carry out real‐time path planning under real ocean current data, and has good obstacle avoidance ability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/exsy.13399"
    },
    {
        "id": 5618,
        "title": "Real-time human search and monitoring system using unmanned aerial vehicle",
        "authors": "Cheok Jun Hong, Vimal Rau Aparow, Hishamuddin Jamaluddin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvas.2023.136180"
    },
    {
        "id": 5619,
        "title": "Stereo matching algorithm for autonomous vehicle navigation using integrated matching cost and non-local aggregation",
        "authors": "Madiha Zahari, Rostam Affendi Hamzah, Nurulfajar Abd Manap, Adi Irwan Herman",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Stereo matching algorithm plays an important role in an autonomous vehicle navigation system to ensure accurate three-dimensional (3D) information is provided. The disparity map produced by the stereo matching algorithm directly impacts the quality of the 3D information provided to the navigation system. However, the accuracy of the matching algorithm is a challenging part to be solved since it is directly affected by the surrounding environment such as different brightness, less texture surface, and different image pair exposure. In this paper, a new framework of stereo matching algorithm that used the integration of census transform (CT) and sum of absolute difference (SAD) at the matching cost computation step, non-local cost aggregation at the second step, winner take all strategy at the third step, and a median filter at the final step to minimize disparity map error. The results show that the accuracy of the disparity map is improved using the proposed methods after some parameter adjustment. Based on the standard Middlebury and KITTI benchmarking dataset, it shows that the proposed framework produced accurate results compared with other established methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v12i1.4122"
    },
    {
        "id": 5620,
        "title": "Outdoor Tests of Autonomous Navigation System Based on Two Different Reference Points of PurePursuit Algorithm for 10-ton Articulated Vehicle",
        "authors": "Saira Latif, Torbjörn Lindbäck, Håkan Lideskog, Magnus Karlberg",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3353616"
    },
    {
        "id": 5621,
        "title": "Incorporating Stochastic Human Driving States in Cooperative Driving Between a Human-Driven Vehicle and an Autonomous Vehicle",
        "authors": "Sanzida Hossain, Jiaxing Lu, He Bai, Weihua Sheng",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341565"
    },
    {
        "id": 5622,
        "title": "Model-based and machine learning-based high-level controller for autonomous vehicle navigation: lane centering and obstacles avoidance",
        "authors": "Marcone Ferreira Santos, Alessandro Corrêa Victorino, Hugo Pousseur",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "<p>Researchers have been attempting to make the car drive autonomously. The environment perception together with safe guidance and control is an important task and are one of the big challenges when developing this kind of system. Geometrical or physical based models, machine learning based models and those based on a mixture of both models, are the three types of navigation methods used to resolve this problem. The last method takes advantage of the learning capability of machine learning models and uses the safeness of geometric models in order to better perform the navigation task. This paper presents a hybrid autonomous navigation methodology, which takes advantage of the learning capability of machine learning and uses the safeness of the dynamic window approach geometric method. Using a single camera and a 2D lidar sensor, this method actuates as a high-level controller, where optimal vehicle velocities are found, then applied by a low-level controller. The final algorithm is validated on CARLA Simulator environment, where the system proved to be capable to guide the vehicle in order to achieve the following tasks: lane keeping and obstacle avoidance.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijra.v12i1.pp84-97"
    },
    {
        "id": 5623,
        "title": "Fully Autonomous Orbit Determination and Synchronization for Satellite Navigation and Communication Systems in Halo Orbits",
        "authors": "Gheorghe Sirbu, Mauro Leonardi",
        "published": "2023-2-21",
        "citations": 4,
        "abstract": "This paper presents a solution for autonomous orbit determination and time synchronization of spacecraft in Halo orbits around Lagrange points using inter-satellite links. Lagrange points are stable positions in the gravitational field of two large bodies that allow for a sustained presence of a spacecraft in a specific region. However, a challenge in operating at these points is the lack of fixed landmarks for orbit determination. The proposed solution involves using inter-satellite links to perform range and range-rate measurements, allowing for accurate computation of the spacecraft’s orbit parameters without the need for any facilities on Earth. Simulations using a fleet of three satellites in Near Rectilinear Halo Orbits around the Earth–Moon Lagrange point, proposed for the Lunar Gateway stations, were conducted to demonstrate the feasibility of the approach. The results show that inter-satellite links can provide reliable and accurate solutions for orbit determination with a DRMS error lower than one meter (90th percentile) and synchronization errors of around one nanosecond. This solution paves the way for a fully autonomous fleet of spacecraft that can be used for observation, telecommunication, and navigation missions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15051173"
    },
    {
        "id": 5624,
        "title": "SMaNa: Semantic Mapping and Navigation Architecture for Autonomous Robots",
        "authors": "Quentin Serdel, Julien Marzat, Julien Moras",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012192800003543"
    },
    {
        "id": 5625,
        "title": "Revolution in Campus Transportation: The Autonomous Electric Vehicle With Smart Features",
        "authors": "Arnob Paul, Nainaiu Rakhaine, Arif Ahammad",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icps60393.2023.10429029"
    },
    {
        "id": 5626,
        "title": "Autonomous Perching on Cylindrical Objects for Wild Aerial Vehicle System",
        "authors": "Ao Sun, Tao Jiang, Jiangshuai Huang, Ren Jin",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icus58632.2023.10318333"
    },
    {
        "id": 5627,
        "title": "Terrain-aware autonomous robot navigation in outdoor environments",
        "authors": "Kasun Weerakoon, Adarsh Jagan Sathyamoorthy, Dinesh Manocha",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663626"
    },
    {
        "id": 5628,
        "title": "From Social Robots to Autonomous Surface Vessels' Navigation",
        "authors": "Ghassan Al-Falouji, Tom Beyer, Sven Tomforde",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acsos-c58168.2023.00037"
    },
    {
        "id": 5629,
        "title": "Refining autonomous vehicle situational awareness due to varying sensor error",
        "authors": "Donald Costello, Nicholas Hanlon, Huan Xu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractPilots use their senses and training to generate situational awareness (SA). They then use this SA to make sound aeronautical decisions. Autonomous vehicles, by contrast, cannot rely on pilot expertise in off‐nominal situations. They must rely on their onboard sensors to build SA of the environment. As these sensors degrade, it is hypothesized that a point exists where the SA generated by these sensors is inadequate to allow the autonomous vehicle to make sound aeronautical decisions. In previous work, a point was defined based on broad assumptions within a modeling and simulation environment (i.e., the error within each sensor was known and not random). This research used a larger data set that contained random errors within the sensors. The data was then used to build predictive equations through a Monte Carlo simulation in the same simulation environment as previous work. While the data showed there was a statistically significant relationship between the error values in each sensor and the fused distance value, the resulting predictive equations were not able to provide adequate SA to make sound aeronautical decisions. This research highlights multiple issues the test and evaluation community will face when trying to develop new techniques for the verification and validation of autonomous systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/sys.21729"
    },
    {
        "id": 5630,
        "title": "Prediction of Autonomous Vehicle Trajectories in Turnaround Scenarios",
        "authors": "George Daoud, Mohamed El-Darieby, Khalid Elgazzar",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsa59317.2023.00089"
    },
    {
        "id": 5631,
        "title": "Autonomous Vehicle Image Classification using Deep Learning",
        "authors": "P Ramakrishnan, K Dhanavel, K Deepak, R Dhinakaran",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscds56580.2023.10104830"
    },
    {
        "id": 5632,
        "title": "Coordination of Marine Multi-Vehicle Autonomous Systems via the Distributed Command Governor Approach",
        "authors": "Alessandro Casavola, Ayman El Qemmah, Francesco Tedesco, Franco Angelo Torchiaro",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oceanslimerick52467.2023.10244738"
    },
    {
        "id": 5633,
        "title": "Evaluation of autonomous underwater vehicle motion trajectory optimization algorithms",
        "authors": "Noorulden Basil, M.E. Alqaysi, Muhammet Deveci, A.S. Albahri, O.S. Albahri, A.H. Alamoodi",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110722"
    },
    {
        "id": 5634,
        "title": "ViSem: A Visual and Semantic Information Fusion Based Place Recognition for Long Term Autonomous Navigation",
        "authors": "Saba Arshad, Tae-Hyoung Park",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422539"
    },
    {
        "id": 5635,
        "title": "Software for UAS Control and Navigation Support using the Centered Meteorological Dataspace",
        "authors": "Maxim Ivanytskyi, Yevheniia Znakovska, Yuliya Averyanova",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uvs59630.2024.10467171"
    },
    {
        "id": 5636,
        "title": "A navigation scheme for autonomous mobile service robots working in GPS denied commercial indoor spaces",
        "authors": "Rushikesh A. Deshmukh, Meghana A. Hasamnis",
        "published": "2023-5-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3s57698.2023.10169514"
    },
    {
        "id": 5637,
        "title": "Feedback linearisation and disturbance observer based path following control for autonomous ground vehicle",
        "authors": "Pengpeng Feng, Jianwu Zhang, Tongli Lu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvsmt.2023.135438"
    },
    {
        "id": 5638,
        "title": "Feedback linearisation and disturbance observer based path following control for autonomous ground vehicle",
        "authors": "Pengpeng Feng, Jianwu Zhang, Tongli Lu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijvsmt.2023.10060988"
    },
    {
        "id": 5639,
        "title": "Continued development of autonomous mobile ground control point for increasing the accuracy of unmanned aerial-vehicle-based phenotyping",
        "authors": "Collin McLeod, John A. Thomasson",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663661"
    },
    {
        "id": 5640,
        "title": "ANROLA: Autonomous Navigation with ROS and Laser Odometry",
        "authors": "Akshat Vikram Singh, Yash Agrawal, Rahul Gupta, Abhishek Kumar, Vivek Ashok Bohara",
        "published": "2023-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets56262.2023.10041368"
    },
    {
        "id": 5641,
        "title": "An Autonomous Dynamic Navigation Model for Shortest Path Routing of Electrical Vehicles",
        "authors": "Ahmad Nahar Quttoum, Suhieb Nawaf",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mass58611.2023.00087"
    },
    {
        "id": 5642,
        "title": "Path optimization research for in-vehicle navigation systems",
        "authors": "Gang Wu, Junbo Ma",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3015759"
    },
    {
        "id": 5643,
        "title": "Efficient Weed Detection Using CNN with an Autonomous Robot",
        "authors": "Vijaya Bhaskar Reddy Muvva, Ramesh Kumpati, Wojciech Skarka",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uvs59630.2024.10467043"
    },
    {
        "id": 5644,
        "title": "Nonlinear Low-level Controller Design for an Autonomous Surface Vehicle",
        "authors": "Helmi Abrougui, Samir Nejim, Habib Dallagi",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic_aset58101.2023.10150772"
    },
    {
        "id": 5645,
        "title": "Using Autonomous Modular Vehicle Technology as an Alternative for Last-Mile Delivery",
        "authors": "Amir Shafiee, Hanieh Rastegar Moghaddam, Jane Lin",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/fists60717.2024.10485532"
    },
    {
        "id": 5646,
        "title": "Survey of Relative Navigation Methods for Multi-Agent Unmanned Aerial Vehicle Systems",
        "authors": "A. R. Abdrashitov",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "Multi-agent Unmanned Aerial Vehicle (UAV) systems require stable and high-precision navigation. The existing navigation solutions, such as global navigation satellite systems (GNSS) and inertial navigation systems, may perform inefficiently in some application scenarios. The relative navigation methods can help solve this problem. Relative navigation enables UAVs to precisely estimate their positions relative to each other, as opposed to absolute navigation, which calculates the UAVs’ position relative to the Earth. Despite the abundance of relative navigation articles, there are no systematic reviews of relative navigation methods. Additionally, various articles on relative navigation use a variety of terms for comparable concepts, which makes it more difficult to understand the subject. Therefore, this review comprehensively studies systematizes relative navigation methods, and analyzes their strengths and weaknesses. We categorize relative navigation methods appropriate for multi-UAV systems, compare them, and make conclusions based on our findings. The relative navigation methods discussed in this review include differential GNSS, radio-frequency-based, visual, and their combinations. We evaluate the achievable accuracy and range for each type of method according to related studies. We also describe the limitations and vulnerabilities of each method. As a result, we outline relative navigation’s primary capabilities and assess its condition now.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17587/mau.24.364-373"
    },
    {
        "id": 5647,
        "title": "ANROL: Autonomous Navigation based on ROS and Laser Odometry",
        "authors": "Akshat Vikram Singh, Yash Agrawal, Rahul Gupta, Abhishek Kumar, Vivek Ashok Bohara",
        "published": "2023-1-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets56262.2023.10041273"
    },
    {
        "id": 5648,
        "title": "AUTONOMOUS NAVIGATION PATH PLANNING OF SERVICE ROBOT BASED ON MULTI-SENSOR FUSION, 76-82.",
        "authors": "Haopeng He, Wei Xiang, Haibo Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2316/j.2024.201-0394"
    },
    {
        "id": 5649,
        "title": "Vision-based heading estimation for navigation of a micro-aerial vehicle in GNSS-denied staircase environment using vanishing point",
        "authors": "B. Anbarasu",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42401-024-00282-5"
    },
    {
        "id": 5650,
        "title": "Vehicle Supervision System Using Navigation Systems and Internet of Things",
        "authors": "A. Shanmugapriya, S.R.Ashok Kumar, K. Suganyadevi, A. Sangeetha Devi",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370270"
    },
    {
        "id": 5651,
        "title": "Artificial Intelligence-Based Autonomous Vehicle for Making Real-Time Decisions, and Navigating Safely",
        "authors": "Amanveer Singh",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icses60034.2023.10465299"
    },
    {
        "id": 5652,
        "title": "Dynamic Balancing-Charging Management for Shared Autonomous Electric Vehicle Systems: A Two-Stage Learning-Based Approach",
        "authors": "Xiaolei Zhu, Xindi Tang, Jiaohong Xie, Yang Liu",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422187"
    },
    {
        "id": 5653,
        "title": "Relative navigation method for unmanned aerial vehicles formation using consensus unscented Kalman filter",
        "authors": "Zhixing Zhuang, Baichun Gong, Xin Ding, Mingrui Hao, Linxiu Chen",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164423"
    },
    {
        "id": 5654,
        "title": "Global Motion Planning for Unmanned Aerial Vehicle Automation",
        "authors": "Hervé B. Olou, Eugène C. Ezin, Jean Marie Dembele, Christophe Cambier",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoias61634.2023.00045"
    },
    {
        "id": 5655,
        "title": "Low-Cost Small Scale Autonomous Vehicle",
        "authors": "Ismail Bogrekci, Pinar Demircioglu, Mustafa Yasir Goren",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "A low-cost small-scale autonomous vehicle refers to a self-driving vehicle that is affordable and designed for smaller applications or purposes. The firefly algorithm was used to solve obstacle-avoiding problems due to dynamic or static uncertain positioned obstacles. The autonomous vehicle reached the determined position, which could be considered accurate. Regardless of the starting point, it arrived at the defined destination in an area with a diameter of 5 meters. Considering the costs of the sensors, simple algorithm, not very powerful processor and circuit elements, sufficient success has been achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14313/jamris/1-2024/3"
    },
    {
        "id": 5656,
        "title": "Reinforcement Learning-Based Navigation Approach for a Downscaled Autonomous Vehicle in Simplified Urban Scenarios",
        "authors": "Rolando Bautista-Montesano, Renato Galluzzi, Xuan Di, Rogelio Bustamante-Bello",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isem59023.2023.10334911"
    },
    {
        "id": 5657,
        "title": "Research on Status Monitoring of Autonomous Navigation Vehicle Based on ROS and Unity",
        "authors": "超 王",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/mos.2023.123222"
    },
    {
        "id": 5658,
        "title": "Research on Cooperative Navigation Method of Cluster UAV Based on Target-driven",
        "authors": "Zhaolong Wu, Jizhou Lai, Xudong Zhu, Sheng Chen, Pin Lvu, Qieqie Zhang",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164610"
    },
    {
        "id": 5659,
        "title": "Towards Autonomous Robot Navigation in Human Populated Environments Using an Universal SFM and Parametrized MPC",
        "authors": "Enrico Fiasché, Philippe Martinet, Ezio Malis",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341814"
    },
    {
        "id": 5660,
        "title": "Open-Source Hardware/Software Architecture for Autonomous Powerline-Aware Drone Navigation and Recharging",
        "authors": "Frederik Falk Nyboe, Nicolaj Haarhøj Malle, Viet Duong Hoang, Emad Ebeid",
        "published": "2023-6-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icuas57906.2023.10155937"
    },
    {
        "id": 5661,
        "title": "Solving the Problem of Unmanned Aerial Vehicle Automatic Runway Landing",
        "authors": "A. N. Alexeev, E. S. Zemlyanyy, K. A. Chekanov",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168487"
    },
    {
        "id": 5662,
        "title": "Kilometer Sign Positioning-Aided INS/Odometer Integration for Land Vehicle Autonomous Navigation",
        "authors": "Huawei Hu, Kui Li, Wenwei Liang, Qihang Li, Ziyu Xie",
        "published": "2023-2-15",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jsen.2023.3236063"
    },
    {
        "id": 5663,
        "title": "Intelligent Spatial Modeling for Autonomous Drone Navigation Enhancement",
        "authors": "Jyi-Shane Liu, Chi-Wei Ma, Gong-Yi Lee",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268570"
    },
    {
        "id": 5664,
        "title": "Natural Language Navigation for Robotic Systems: Integrating GPT and Dense Captioning Models with Object Detection in Autonomous Inspections",
        "authors": "Nilay R. Choudhury, Yining Wen, Kaiwen Chen",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485262.099"
    },
    {
        "id": 5665,
        "title": "Autonomous Navigation of Mobile Robot Assisted by Its Identified Neural Network Model",
        "authors": "Igor Prokopiev, Elizaveta Shmalko, Askhat Diveev",
        "published": "2023-5-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023033008"
    },
    {
        "id": 5666,
        "title": "AutoNav in C-L-U-E: A Baseline Autonomous Software Stack for Autonomous Navigation in Closed Low-Speed Unstructured Environments",
        "authors": "Mohamed Sabry, Amr Farag, Bassem Magued, Ahmed Mazhr, Amr El Mougy, Slim Abdennadher",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012295500003636"
    },
    {
        "id": 5667,
        "title": "Autonomous navigation of mobile robots in unknown environments using off-policy reinforcement learning with curriculum learning",
        "authors": "Yan Yin, Zhiyu Chen, Gang Liu, Jiasong Yin, Jianwei Guo",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123202"
    },
    {
        "id": 5668,
        "title": "A Comfort-Based Vehicle Routing Methodology for Autonomous Vehicles",
        "authors": "Chun-Chien Hsiao, Gihyeob An, Jun Han Bae, Alireza Talebpour",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10421831"
    },
    {
        "id": 5669,
        "title": "Analysis of Lidar-Based Autonomous Vehicle Detection Technologies for Recognizing Objects",
        "authors": "Anshit Kumar Srivastava, Abhishek Singhal, Aarti Sharma",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112089"
    },
    {
        "id": 5670,
        "title": "3D Object Detection for Autonomous Driving: A Practical Survey",
        "authors": "Álvaro Ramajo-Ballester, Arturo de la Escalera Hueso, José María Armingol Moreno",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011748400003479"
    },
    {
        "id": 5671,
        "title": "Soft Computing based Implementation of Autonomous Drone Vehicle using Fuzzy Logic based Control Systems",
        "authors": "Soni Mishra, S. Punitha, T. Harikrishns, K. Narayana Swamy, Loganayagi S",
        "published": "2023-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250582"
    },
    {
        "id": 5672,
        "title": "Sensor-based multi-waypoint autonomous robot navigation with graph-based models",
        "authors": "Huston Rogers, Timothy Sellers, Tingjun Lei, Daniel W. Carruth, Chaomin Luo",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663830"
    },
    {
        "id": 5673,
        "title": "Highly Autonomous Underwater Vehicle Control Systems Synthesis via Asymptotic Methods",
        "authors": "Sergei A. Dubovik, Aleksey A. Kabanov",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icieam57311.2023.10139233"
    },
    {
        "id": 5674,
        "title": "Vehicle-to-Infrastructure Communication for Real-Time Object Detection in Autonomous Driving",
        "authors": "Faisal Hawlader, François Robinet, Raphaël Frank",
        "published": "2023-1-30",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/wons57325.2023.10061953"
    },
    {
        "id": 5675,
        "title": "Autonomous Guidance and Control of Mini-Satellites in a Low-Orbit Constellation during Areal Scanning Survey",
        "authors": "Yevgeny Somov, Sergey Butyrin, Tatyana Somova",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/icins51816.2023.10168317"
    },
    {
        "id": 5676,
        "title": "Passive Electro-Optical Tracking of Resident Space Objects for Distributed Satellite Systems Autonomous Navigation",
        "authors": "Khaja Faisal Hussain, Kathiravan Thangavel, Alessandro Gardi, Roberto Sabatini",
        "published": "2023-3-22",
        "citations": 8,
        "abstract": "Autonomous navigation (AN) and manoeuvring are increasingly important in distributed satellite systems (DSS) in order to avoid potential collisions with space debris and other resident space objects (RSO). In order to accomplish collision avoidance manoeuvres, tracking and characterization of RSO is crucial. At present, RSO are tracked and catalogued using ground-based observations, but space-based space surveillance (SBSS) represents a valid alternative (or complementary asset) due to its ability to offer enhanced performances in terms of sensor resolution, tracking accuracy, and weather independence. This paper proposes a particle swarm optimization (PSO) algorithm for DSS AN and manoeuvring, specifically addressing RSO tracking and collision avoidance requirements as an integral part of the overall system design. More specifically, a DSS architecture employing hyperspectral sensors for Earth observation is considered, and passive electro-optical sensors are used, in conjunction with suitable mathematical algorithms, to accomplish autonomous RSO tracking and classification. Simulation case studies are performed to investigate the tracking and system collision avoidance capabilities in both space-based and ground-based tracking scenarios. Results corroborate the effectiveness of the proposed AN technique and highlight its potential to supplement either conventional (ground-based) or SBSS tracking methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15061714"
    },
    {
        "id": 5677,
        "title": "First Real-World Results of a Deep Neural Network Assisted GNSS/INS Kalman-Filter with MEMS Inertial Sensors for Autonomous Vehicle",
        "authors": "Shuo Li, Maxim Mikhaylov, Nikolay Mikhaylov, Thomas Pany",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33012/2023.19301"
    },
    {
        "id": 5678,
        "title": "Using Deep Reinforcement Learning for Navigation in Simulated Hallways",
        "authors": "Gonçalo Leão, Filipe Almeida, Emanuel Trigo, Henrique Ferreira, Armando Sousa, Luís Paulo Reis",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarsc58346.2023.10129605"
    },
    {
        "id": 5679,
        "title": "Bubble Plume Tracking Using a Backseat Driver on an Autonomous Underwater Vehicle",
        "authors": "Jimin Hwang, Neil Bose, Gina Millar, Craig Bulger, Ginelle Nazareth",
        "published": "2023-10-16",
        "citations": 1,
        "abstract": "Autonomous underwater vehicles (AUVs) have been applied in various scientific missions including oceanographic research, bathymetry studies, sea mine detection, and marine pollution tracking. We have designed and field-tested in the ocean a backseat driver autonomous system for a 5.5 m survey-class Explorer AUV to detect and track a mixed-phase oil plume. While the first driver is responsible for controlling and safely operating the vehicle; the second driver processes real-time data surrounding the vehicle based on in situ sensor measurements and adaptively modifies the mission details. This adaptive sensing and tracking method uses the Gaussian blur and occupancy grid method. Using a large bubble plume as a proxy, our approach enables real-time adaptive modifications to the AUV’s mission details, and field tests show successful plume detection and tracking. Our results provide for remote detection of underwater oil plumes and enhanced autonomy with these large AUVs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/drones7100635"
    },
    {
        "id": 5680,
        "title": "Mechatronic Design and Control of a Hybrid Ground-Air-Water Autonomous Vehicle",
        "authors": "Dimitris Chaikalis, Nikolaos Evangeliou, Muhammed Nabeel, Nikolaos Giakoumidis, Anthony Tzes",
        "published": "2023-6-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icuas57906.2023.10156577"
    },
    {
        "id": 5681,
        "title": "Towards Developing an Ontology for Safety of Navigation Sensors in Autonomous Vehicles",
        "authors": "Mohammed Alharbi, Hassan Karimi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012207300003598"
    },
    {
        "id": 5682,
        "title": "Autonomous Site Inspection of Power Transmission Line Insulators with Unmanned Aerial Vehicle System",
        "authors": "MD. Faiyaz Ahmed, J. C. Mohanta",
        "published": "2024-2-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15325008.2024.2313588"
    },
    {
        "id": 5683,
        "title": "Recent Advancement in Autonomous Vehicle and Driver Assistance Systems",
        "authors": "Abhishek Mishra, Jahanvi Purohit, Maruf Nizam, Suresh Kumar Gawre",
        "published": "2023-2-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs57921.2023.10063089"
    },
    {
        "id": 5684,
        "title": "Autonomous Vehicle Traffic Accident Prevention using Mobile-Integrated Deep Reinforcement Learning Technique",
        "authors": "J. Praveenchandar, Saju Raj T, Geetha Ponnaian",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "When it concerns autonomous traffic management, the most effective decision-making reinforcement learning methods are often utilized for vehicle control. Surprisingly demanding circumstances, however, aggravate the collisions and, as a consequence, the chain collisions. In order to potentially offer guidance on eliminating and decreasing the danger of chain collision malfunctions, we first evaluate the main types of chain collisions and the chain events typically proceed. In an emergency, this study proposes mobile-integrated deep reinforcement learning (DRL) for autonomous vehicles to control collisions. Three essential influencing substances are completely taken into consideration and ultimately achieved by the offered strategy: accuracy, efficiency, and passenger comfort. Following this, we investigate the safety performance currently employed in security-driving solutions by interpreting the chain collision avoidance problem as a Markov Decision Process problem and offering a decision-making strategy based on mobile-integrated reinforcement learning. All of the analysis's findings have the objective of aid academics and policymakers to appreciate the positive aspects of a more reliable autonomous traffic infrastructure and to smooth out the way for the actual adoption of a driverless traffic scenario.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1252"
    },
    {
        "id": 5685,
        "title": "Time-Driven and Privacy-Preserving Navigation Model for Vehicle-to-Vehicle Communication Systems",
        "authors": "Congcong Zhu, Zishuo Cheng, Dayong Ye, Farookh Khadeer Hussain, Tianqing Zhu, Wanlei Zhou",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tvt.2023.3248613"
    },
    {
        "id": 5686,
        "title": "Integrating IoT and Artificial intelligent for Enhanced Electric Vehicle Charging and Autonomous Driving for sustainable transportation",
        "authors": " Y.Madhu Sudhana Reddy",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "This research explores the confluence of Internet of things and artificial intelligence towards fostering electric vehicle charging and autonomous driving for sustainable transportation. By meticulously collecting and preprocessing, and executing multiple machine learning models such as Artificial Neural Network , Decision Trees , Naive Bayes , and Random Forest , the research delves into charging infrastructure and easy autonomous driving. Particularly, real-time datasets, such as EV station data, road geography and mapping data, weather and telematics data, were properly collected and processed . Then, the preprocessing stage, which included data cleaning, normalization, and feature engineering had improved the datasets’ predictability. Consequently, the datasets such as charging recommendation, predicting energy use, predicting of optimal route, had produced highly accurate training and testing for forecasting elelctric vehicles’ demands. The ML models indicated their proficiency in predicting not only the optimal charging schedules, but also predictive energy consumption, and predictive routes. Specifically, ANN with 0.945 held the highest precision, while DT 0.912, NB 0.887, and RF 0.819 were almost identical . Likewise, the recall scores, F1 scores, and AUC ROC scores also coincided the prized outcome of the models. The findings of the research are groundbreaking for both transportation sector, policymakers, as well as urban planners and stakeholders at large. Following the data-fed recommendations would not be excessively challenging, and they would yield favourable results whether the stakeholders are dealing with EV charging infrastructure, or dealing with traffic congestions, or are establishing their own sustainable solution for future mobility via not just electric vehicles but also other tools and devices. Hence, we are hopeful that our research serves as a lighthouse for the transportation domain towards a greener future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1686"
    },
    {
        "id": 5687,
        "title": "Joint Imitation Learning of Behavior Decision and Control for Autonomous Intersection Navigation",
        "authors": "Zeyu Zhu, Huijing Zhao",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342405"
    },
    {
        "id": 5688,
        "title": "A Limited, Real-World Assessment of Key Autonomous Vehicle Car Following Models",
        "authors": "Tanmay Das, Shoaib Samandar, Nagui Rouphail, Billy Williams",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10421835"
    },
    {
        "id": 5689,
        "title": "Development of Programmed Autonomous Electric Heavy Vehicle: An Application of IoT",
        "authors": "P. Nagasekhar Reddy, P. Umaeswari, L. Natrayan, Ankur Choudhary",
        "published": "2023-3-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icears56392.2023.10085492"
    },
    {
        "id": 5690,
        "title": "Hierarchical Reinforcement Learning for Dynamic Autonomous Vehicle Navigation at Intelligent Intersections",
        "authors": "Qian Sun, Le Zhang, Huan Yu, Weijia Zhang, Yu Mei, Hui Xiong",
        "published": "2023-8-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3580305.3599839"
    },
    {
        "id": 5691,
        "title": "Autonomous Endoscope Navigation Base on Image Contour Data and Pixel Ratio",
        "authors": "Zhoukai Lv, Mingqiang Li, Jing Wang, Dawei Wu",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icus58632.2023.10318234"
    },
    {
        "id": 5692,
        "title": "Robust Structural-Parametric Synthesis of Stabilization Systems for Ground Moving Vehicle Equipment",
        "authors": "Olha Sushchenko, Yuliya Averyanova, Ivan Ostroumov, Maksym Zaliskyi, Oleksandr Solomentsev, Oleksii Holubnychyi",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/msnmc61017.2023.10329013"
    },
    {
        "id": 5693,
        "title": "Demonstrating Arena-Web: A Web-based Development and Benchmarking Platform for Autonomous Navigation Approaches",
        "authors": "Linh K�stner, Reyk Carstens, Lena Nahrwold, Christopher Liebig, Volodymyr Shcherbyna, Subhin Lee, Jens Lambrecht",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.088"
    },
    {
        "id": 5694,
        "title": "Study on Smooth Trajectory Planning for Autonomous Navigation of Quadrotor UAVs in 3D Space for Enhanced Target Recognition",
        "authors": "Shibo Chen, Ruinan Fang, Yutao Zhang",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isaes58852.2023.10281309"
    },
    {
        "id": 5695,
        "title": "Route Planning for Autonomous Transmission of Large Sport Utility Vehicle",
        "authors": "V. A. Vijayakumar, J. Shanthini, S. Karthik, K. Srihari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.028400"
    },
    {
        "id": 5696,
        "title": "Autonomous Water Quality Monitoring Surface Vehicle",
        "authors": "Manushri Saljith Nambiar, Arjun Ramakrishnan, Anirudh Lakshman, Abhiram P V, Girish P",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rasse60029.2023.10363576"
    },
    {
        "id": 5697,
        "title": "Dual license plate recognition and visual features encoding for vehicle identification",
        "authors": "Álvaro Ramajo-Ballester, José María Armingol Moreno, Arturo de la Escalera Hueso",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104608"
    },
    {
        "id": 5698,
        "title": "Trajectory optimization for autonomous modular vehicle or platooned autonomous vehicle split operations",
        "authors": "Qianwen Li, Xiaopeng Li",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.tre.2023.103115"
    },
    {
        "id": 5699,
        "title": "Investigation of Formal Verification of the Autonomous Vehicle Control System by Specification Translation",
        "authors": "Yifan Wang, Masaki Nakamura, Kazutoshi Sakakibara",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itc-cscc58803.2023.10212820"
    },
    {
        "id": 5700,
        "title": "State transformation extended Kalman filter–based tightly coupled strapdown inertial navigation system/global navigation satellite system/laser Doppler velocimeter integration for seamless navigation of unmanned ground vehicle in urban areas",
        "authors": "Xue-Yu Du, Mao-song Wang, Wen-qi Wu, Pei-yuan Zhou, Jia-rui Cui",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": " With the rapid development of unmanned ground vehicle industry, how to achieve continuous, reliable, and high-accuracy navigation becomes very important. At present, the integrated navigation with global navigation satellite system and strapdown inertial navigation system is the most mature and effective navigation technology for unmanned ground vehicle. However, this technique depends on the signal accuracy of global navigation satellite system. When the receiver cannot capture four or more satellite signals for a long time or the satellite completely invalid, it cannot provide accurate navigation and positioning information for the unmanned ground vehicle. Therefore, this article combine the observation information of strapdown inertial navigation system, global navigation satellite system, and laser Doppler velocimeter to propose a high-precision seamless navigation technique of unmanned ground vehicle based on state transformation extended Kalman filter. Under different land vehicle driving environments and global navigation satellite system signal quality conditions, the seamless navigation technique is evaluated through global navigation satellite system interruption simulation and land vehicle experiments. The experimental results show that the strapdown inertial navigation system/global navigation satellite system/laser Doppler velocimeter tightly coupled integration seamless navigation has good environmental adaptability and reliability and can maintain high navigation accuracy under high frequency global navigation satellite system–signal blockage conditions in urban areas. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/17298806231158462"
    },
    {
        "id": 5701,
        "title": "Leveraging Multimodal Sensing and Topometric Mapping for Human-Like Autonomous Navigation in Complex Environments",
        "authors": "Kosmas Tsiakas, Dimitrios Alexiou, Dimitrios Giakoumis, Antonios Gasteratos, Dimitrios Tzovaras",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341358"
    },
    {
        "id": 5702,
        "title": "DNFOMP: Dynamic Neural Field Optimal Motion Planner for Navigation of Autonomous Robots in Cluttered Environment",
        "authors": "Maksim Katerishich, Mikhail Kurenkov, Sausar Karaf, Artem Nenashev, Dzmitry Tsetserukou",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394025"
    },
    {
        "id": 5703,
        "title": "Lane-Changing Decision-Making Method for Autonomous Vehicles Considering Multi-Vehicle Interactions",
        "authors": "Tianqi Qie, Weida Wang, Chao Yang, Ying Li",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsa59317.2023.00111"
    },
    {
        "id": 5704,
        "title": "A GPR-Aided Method for Collaborative Relative Navigation for Multiple Unmanned Aerial Vehicles During Ranging Measurement Outages",
        "authors": "Xin Ding, Mingrui Hao, Baichun Gong, Linxiu Chen, Zhixing Zhuang",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isas59543.2023.10164570"
    }
]