[
    {
        "id": 11471,
        "title": "DEFINITION OF TRANSLATION, TRANSLATION STRATEGY, TRANSLATION PROCEDURE, TRANSLATION METHOD, TRANSLATION TECHNIQUE, TRANSLATION TRANSFORMATION",
        "authors": "Corina Iordan",
        "published": "2021-3-2",
        "citations": 0,
        "abstract": "In modern linguistics, one of the current topics is the study of the relationships between languages, as one of the main means of transmission of meanings and the socio-cultural reality. Among the many challenges studied by the modern linguistics, an important place is the study of the linguistic aspects of cross-language speech activity, which is called «translation» or «translation activity». It is through the translation, we have access to the systems of meanings of other cultures, which with the help of translators acquire its interpretation. Translation implies a correct and clear rendering of what is expressed in one language by means of another language. Within the field of translation theory, certain notions have been researched from a wide range of perspectives and have been assigned a multitude of labels. Due to the confusing use of concepts and terms, we aim to present and define the most important ones, with which the translation theory operates, such as: translation procedure, translation strategy, translation method, translation technique and translation transformation. Also, in this paper, we discuss the types of translation, its purposes and the difficulties that translators encounter in the process of translation.",
        "link": "http://dx.doi.org/10.51582/interconf.19-20.02.2021.049"
    },
    {
        "id": 11472,
        "title": "Translation activities on oral translation and written translation",
        "authors": "James P. Woang",
        "published": "2021",
        "citations": 0,
        "abstract": "Translation activities and studies from one language to another must be carried out to understand the thoughts, ideas, culture, and knowledge of other nations who have different styles. Put translation activities can be divided into two types, namely oral translation or what is often referred to as oral translation and written translation, whereas translation studies are divided into two types, namely descriptive translation studies and translation theory studies. In the field of descriptive translation studies have two objects, namely the work of translation and the process of translation. Translation activities certainly require translation techniques or styles. Translation techniques are procedures or procedures for analyzing and classifying translation equivalents from source languages to target languages and can be used in a variety of lingual units. In translation activities, the use of techniques used by translators is not an important thing. The most important thing for a translator is the technique chosen can fulfill the purpose of the translation. Among the objectives of the translation, activity as a communication tool that connects the writer in the source language with the reader in the target language, and the translator as the mediator or the liaison of both.",
        "link": "http://dx.doi.org/10.51708/apptrans.v15n1.1402"
    },
    {
        "id": 11473,
        "title": "Chapter 11. Dynamic Translation Index",
        "authors": " PACTE GROUP",
        "published": "2017-1-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.127.11pac"
    },
    {
        "id": 11474,
        "title": "Literal translation: A study with several translation techniques to get a good translation result",
        "authors": "Vartina Riecher",
        "published": "2019",
        "citations": 1,
        "abstract": "In translating advertisements, there are things to keep in mind. First, ad text has a different type of character from other text, secondly, there are limitations in the ad itself. An advertisement is limited to customs and habits, religion and beliefs, norms and ethics as well as the use of language and language style. This implies that an advertisement cannot freely express the ideas or ideas of producers to potential consumers, especially if the advertisement is aimed at consumers who have different languages ​​and of course different cultures. A picture or sentence that can be considered neutral in one area but has a different interpretation in another. For example: in a print media commercial advertisement issued by the local government, one type of regional superior product is written which is called 'sarong goyor'. If this advertisement is given to an audience outside the area where the source text originates, then the word sarong goyor may become lepas in its meaning. For this reason, in translating a text, the translator needs to understand the approach, strategy and ideology used by the translator.",
        "link": "http://dx.doi.org/10.51708/apptrans.v13n2.810"
    },
    {
        "id": 11475,
        "title": "Fortuna in Translation, Fortuna as Translation",
        "authors": "Daniele Miano",
        "published": "2018-4-19",
        "citations": 0,
        "abstract": "This chapter considers the relationship between Fortuna and Tyche as one of translatability. The first half of the chapter focuses on Tyche, with the aim of determining semantic and structural elements common with Fortuna. The second part of the chapter looks at instances in which Fortuna is translated in Greek. The appearance of bronze strigils bearing the epithet soteira from Praeneste in the fourth century BC seems to presuppose this translation, and also points to the salvific meanings of Fortuna as a base for the process of translation. This process of translation had probably occurred through early contacts between Latium, Sicily, and Magna Graecia, where Tyche seems to be associated with salvation already from the fifth century BC. Other instances of translations of Fortuna and Tyche are studied across the Aegean.",
        "link": "http://dx.doi.org/10.1093/oso/9780198786566.003.0007"
    },
    {
        "id": 11476,
        "title": "Translation in Transnational/Transnational in Translation",
        "authors": "Emek Ergun",
        "published": "2023-4-4",
        "citations": 0,
        "abstract": "Conclusion highlights translation’s potential to facilitate empowering interactions between resistant texts and feminist readers and mobilize feminist connectivities across borders. The chapter first brings up cautionary tales about transnational feminisms by asking what would happen if the geopolitical composition and direction of the traveling text were reversed. It then discusses two scenarios illustrating some disturbing reactions Virgin Crossing Borders received at western academic settings, which reveals the urgency of assuming ethical responsibility when it comes to hearing one another across borders. The chapter ends by underlining the importance of cultivating a new ethos of cross-border translation and reception that simultaneously celebrates the indeterminate alienness of the other, the fluidity and vulnerability of the self, and the fine possibility of hybridization.",
        "link": "http://dx.doi.org/10.5622/illinois/9780252044939.003.0008"
    },
    {
        "id": 11477,
        "title": "Translation in Feminism/Feminism in Translation",
        "authors": "Emek Ergun",
        "published": "2023-4-4",
        "citations": 0,
        "abstract": "Following a brief preface that describes the author’s transnational/translational journey that led her to Hanne Blank’s Virgin: The Untouched History, the introduction introduces the theoretical and methodological framework of the research project, which is inspired by Edward Said’s “traveling theory.” This chapter particularly explains how Said’s theory is supplemented by the critical theories of transnational and women of color feminisms, translation studies, indigenous feminisms, reception studies, and comparative literature so that it pays analytical attention to translational procedures and agents of cross-border  travel, geopolitical directionality of global flows of feminist texts, politics of reading translation, and ethical formations of post-oppositional connectivities across border. The introduction ends with chapter summaries.",
        "link": "http://dx.doi.org/10.5622/illinois/9780252044939.003.0001"
    },
    {
        "id": 11478,
        "title": "Translation studies, audiovisual translation and reception",
        "authors": "Yves Gambier",
        "published": "2018-6-4",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.141.04gam"
    },
    {
        "id": 11479,
        "title": "Paradoxes and Aporias in Translation and Translation Studies [2002]",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-4"
    },
    {
        "id": 11480,
        "title": "Translating Translation",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0016"
    },
    {
        "id": 11481,
        "title": "‘Orts, Scraps, and Fragments’: Translation, Non-Translation, and the Fragments of Ancient Greece",
        "authors": "Nora Goldschmidt",
        "published": "2019-10-24",
        "citations": 2,
        "abstract": "This chapter shows how a wide range of writers—including Richard Aldington, Ezra Pound, T. S. Eliot, C. P. Cavafy, and James Joyce—deployed contemporary interpretations and translations of fragments of Ancient Greek. A wealth of newly discovered source texts on papyrus was uncovered in the nineteenth and early twentieth centuries. Together with recent scholarly commentaries on fragmentary Greek authors, these were taken up by modernist writers, foregrounding the difficulties of textual and cultural transmission. The chapter emphasizes the remoteness of the ancient texts and examines how modern attempts to downplay this historical difference, as in Liddell and Scott’s celebrated dictionary, could perversely prove to be barriers to understanding. The chapter contends that attempts to express the meaning of an alien and irrecoverable ancient past can be more estranging even than non-translation.",
        "link": "http://dx.doi.org/10.1093/oso/9780198821441.003.0004"
    },
    {
        "id": 11482,
        "title": "The ideology of translation vs translation procedures",
        "authors": "Anne Ryan",
        "published": "2020",
        "citations": 1,
        "abstract": "Translation plays an important role in the transfer of knowledge between cultures, languages ​​and nations different. As an activity to transfer the message or purpose contained in one language into another language appropriately and naturally, translation work becomes complex. Therefore various approaches were initiated to understand the process translation, including the theory of translation ideology. The terms domestication and foreignization in translation are two terms put forward is often referred to as an ideology or translation strategy. Domestication is a strategy which is used to reduce the \"alienation\" of the term from the source language, thus the reader feel like a translation is not a translation product. While foreignization is on the contrary, this strategy is more towards the source language to introduce the term or foreign culture to the target audience. In practice, translators cannot be separated from both, but different biases are often based on the purpose of translation and who is the user of the translation. This article provides a brief overview of the ideology of translation and how important this theory is to raise awareness translation about the impact of their choice on the translation result.",
        "link": "http://dx.doi.org/10.51708/apptrans.v14n2.1232"
    },
    {
        "id": 11483,
        "title": "Chapter 1. Translation and Translation Competence",
        "authors": "Amparo Hurtado Albir",
        "published": "2017-1-24",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.127.01hur"
    },
    {
        "id": 11484,
        "title": "The “Non-Translation”",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0020"
    },
    {
        "id": 11485,
        "title": "Interpretation and machine translation towards google translate as a part of machine translation and teaching translation",
        "authors": "Vichard L. Kane",
        "published": "2021",
        "citations": 2,
        "abstract": "Language comprehension is the capacity of someone to properly understand the language to fully communicate the message and details. When dialects are distinct, the problem arises. This condition can lead to misconception as understudies, particularly those whose specialty is not English, cannot gain real importance. Along these lines, interpreting is regarded as one of the suggested arrangements in this area. As the results, the message's basic significance and setting in an unknown dialect can be precisely seen in English. Interpretation is a help to resolve this language boundary for this case. Moreover, finding an individual who is accessible to decipher each and every language is found troublesome. Furthermore, the aftereffect of interpretation is by one way or another influenced and impacted by the interpreter's abilities. In this manner, interpretation application turns into the one to be depended on. A lot of online interpretation applications have been made available for the last few years. The best one is Google Translate which is a multi-lingual online computer interpretation (MT) system. It is said as a multilanguage interpretation programme, as it can decode material from over 90 dialects.",
        "link": "http://dx.doi.org/10.51708/apptrans.v15n1.1337"
    },
    {
        "id": 11486,
        "title": "From Slavish Translation to Bridge Translation",
        "authors": "Corine Tachtiris",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003180166-2"
    },
    {
        "id": 11487,
        "title": "Human Evaluation for Translation Quality of ChatGPT: A Preliminary Study",
        "authors": "Yanqing Zhao,  , Min Zhang, Xiaoyu Chen, Yadong Deng, Aiju Geng, Limin Liu, Xiaoqin Liu, Wei Li, Yanfei Jiang, Hao Yang, Yu Han, Shimin Tao, Ning Xie, Xiaochun Li, Miaomiao Ma, Zhaodi Zhang,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26615/issn.2683-0078.2023_023"
    },
    {
        "id": 11488,
        "title": "Translating Artaud and Non-Translation",
        "authors": "Alexandra Lukes",
        "published": "2019-10-24",
        "citations": 0,
        "abstract": "What does it mean to translate someone? If translation, as it is conventionally understood, refers to that activity by which meaning is transferred from one language to another, where and how does the self come into it? In Artaud le Mômo, Antonin Artaud marks his return to society after nine years of internment by creating a new man, endowed with a new language—a mixture of French and strange syllables, as incomprehensible as they are unreadable. Artaud’s later texts not only help to clarify the role of the syllables within Artaud’s poetics, but, by revealing a tension between translation and non-translation, they also deepen understanding of what translation might be. Asking what it means to translate Artaud uncovers the significance of the physical dimension that is involved in the process of translation and the role of the non-verbal (or pre-verbal), while testing the limits of identity, language, and understanding.",
        "link": "http://dx.doi.org/10.1093/oso/9780198821441.003.0012"
    },
    {
        "id": 11489,
        "title": "Computer-assisted translation (CAT) tools, translation memory, and literary translation",
        "authors": "Roy Youdale, Andrew Rothwell",
        "published": "2022-4-26",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003273417-28"
    },
    {
        "id": 11490,
        "title": "Cultural Translation, or, the Political Logic of Prismatic Translation",
        "authors": "Jernej Habjan",
        "published": "2020-1-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv16km05j.14"
    },
    {
        "id": 11491,
        "title": "Audiovisual translation",
        "authors": "Lynne Bowker",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003217718-11"
    },
    {
        "id": 11492,
        "title": "Translation and publishing in Translation Studies: an old partnership revisited",
        "authors": "Gisele Dionísio da Silva",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm2_1a1"
    },
    {
        "id": 11493,
        "title": "Translation and Translation as a Weapon",
        "authors": "Gisèle Sapiro",
        "published": "2019-6-25",
        "citations": 1,
        "abstract": "Translation is a social activity that fulfills other functions than mere communication: political, economic and cultural. Thus translation can be used as a political weapon to export or import texts conveying an ideological message, such as socialist realism. As evidenced by the promotion of world bestsellers, translation may in other cases serve economic interests. Literary translations also serve cultural purposes, such as the building of collective (national, social, gendered) identities, the representations of other cultures, or the subversion of the dominant norms in a literary field (as defined by Pierre Bourdieu), which can be illustrated by the reception and uses of William Faulkner’s novels in France in the 1930s (namely by Jean-Paul Sartre).\nThe study of translation has become a research field called “Translation Studies,” which underwent a “sociological turn” at the beginning of the 21st century, and was also renewed at the same time by the rise of “world literature” studies in comparative literature. While translation studies are interested in norms of translation (as defined by Gideon Toury), which may vary across cultures, especially between domesticating and foreignizing strategies, the sociology of translation and of (world) literature asks how literary texts circulate across cultures: who are the mediators? Why do they select certain texts and not others? What obstacles stand in the way of the transfer process? How are translations used as weapons in cultural struggles?\nThe circulation of texts in translation can be studied through a quantitative analysis of flows of translation (across languages, countries, publishing houses) and through qualitative methods: interviews with specialized intermediaries and cultural mediators (publishers, translators, state representatives, literary critics), ethnographic observation (of book fairs, literature festivals), documentary sources (critical reception), archives (of publishers), and text analysis. However, internal (text analysis) and external (sociological) approaches still wait to be fully connected.",
        "link": "http://dx.doi.org/10.1093/acrefore/9780190201098.013.942"
    },
    {
        "id": 11494,
        "title": "Imagining Translation and Translators",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0004"
    },
    {
        "id": 11495,
        "title": "Miracles in Translation",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-17"
    },
    {
        "id": 11496,
        "title": "Machine translation",
        "authors": "Lynne Bowker",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003217718-7"
    },
    {
        "id": 11497,
        "title": "Use of vocabulary translation strategies: A semantic translation analysis",
        "authors": "Laurent Rietveld",
        "published": "2019",
        "citations": 0,
        "abstract": "Translation is the process of transferring source language text messages into the target language. The practical objective of the message transfer process is to assist the reader of the target language text in understanding the message intended by the original author of the source language text. There are many types of translations available, but semantic translation is considered the type of translation that is the most accurate in conveying meaning. Semantic translation tries to divert as closely as possible the semantic and syntactic structures of the target language with the exact same contextual meaning in the source language text, as well as word meanings and sentence meanings from the perspective of the source text context. Semantic translation is found to be the most flexible and flexible translation.",
        "link": "http://dx.doi.org/10.51708/apptrans.v13n2.419"
    },
    {
        "id": 11498,
        "title": "Translaboration",
        "authors": "Cornelia Zwischenberger",
        "published": "2020-9-11",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/target.20106.zwi"
    },
    {
        "id": 11499,
        "title": "Images of Translation",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-15"
    },
    {
        "id": 11500,
        "title": "Translation criticism meets multimodality: evaluating the translation of a picturebook – an experiment",
        "authors": "Katrin Pieper",
        "published": "2021",
        "citations": 0,
        "abstract": "The German picturebook Eins Zwei Drei Tier(one, two, three, animal) (1999), written and illustrated by Nadia Budde for children aged three years and over, contains a total of 98 words, 64 humorous illustrations of people and animals, 18 pages and 17 rhymes. At first sight, it seems untranslatable,  yet  it  has  been  published  in  many  languages,  one  of  which  is  Portuguese.  A picturebook is usually read to and by children, which means that its message is transmitted through the  auditory  and  visual  channels,  and  sometimes  also  through  the  tactile  one  too.  Given  these multimodal  characteristics,  how  can  the  translation  be  evaluated?Translation  criticism  theories from  the  1990s  have  usually  focused  on  the  text-level,  and  Heidrun  Gerzymisch-Arbogast’s translation criticism model (1994, 1997, 1998) is no exception. This paper conducts the experiment to apply her model to a picturebook.",
        "link": "http://dx.doi.org/10.21747/21844585/tm3_2a2"
    },
    {
        "id": 11501,
        "title": "Reflection of Translation Theory in Teaching Practical Translation: Legal Translation as Case Analysis",
        "authors": "AWEJ-tls for Translation &amp; Literary Studies, Dawn TSANG Fei-yue",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper discusses the applicability of translation theory in teaching practical translation. It examines the Chinese translation of an English legal judgment “Attorney General v Lee Kwong-kut and Attorney General v Lo Chak-man and another”(Hong Kong Public Law Reports, 1993) by the Privy Council. It combines the source-text analysis with translation strategies from the perspective of semantics, syntax and register, in order to discuss how theories can be applied in real-life legal translation setting. The source text contains distinctive examples of legalese, convoluted sentence structure and honorific addresses specific to Anglo legal context. The Chinese translation is challenging as to how to cope with the linguistic and cultural differences, and most significantly, how to carry over the central meanings while retaining the equivalent effect and the authenticity of a legal judgment. Furthermore, this paper is based on the author’s teaching experiences, and will refer to the syllabuses and curriculum design of the “Programme Intended Learning Outcomes” and the “Course Intended Learning Outcomes”. It demonstrates the applicable value of translation theory, and how practical translation can be taught with theoretical explanation and vice versa.Translation bases on practice, all kinds of theories area guideline to be applied.",
        "link": "http://dx.doi.org/10.31235/osf.io/vgf2n"
    },
    {
        "id": 11502,
        "title": "The Third Language of Translation",
        "authors": "Gabriele Frasca",
        "published": "2021-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474483827.003.0016"
    },
    {
        "id": 11503,
        "title": "Introducing IPEM–Translation",
        "authors": "Richard A. Black",
        "published": "2022-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ipemt.2021.100002"
    },
    {
        "id": 11504,
        "title": "What is Translation? [2013]",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-6"
    },
    {
        "id": 11505,
        "title": "Complete Translation and Variational Translation",
        "authors": "Zhonglian Huang, Yongzhong Zhang",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-9271-3_1"
    },
    {
        "id": 11506,
        "title": "The conceptualisation of translation in translation studies: a response",
        "authors": "Yves Gambier",
        "published": "2023-5-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14781700.2023.2209576"
    },
    {
        "id": 11507,
        "title": "What? Defining Translation",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781350363656.ch-001"
    },
    {
        "id": 11508,
        "title": "Conclusion:",
        "authors": "",
        "published": "2019-4-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv6q5315.11"
    },
    {
        "id": 11509,
        "title": "Found in translation",
        "authors": "Bárbara Sofia Oliveira",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm1_2r1"
    },
    {
        "id": 11510,
        "title": "The translation of theatre before Translation Studies",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781350195653.ch-1"
    },
    {
        "id": 11511,
        "title": "Translation and/as Global Communication",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0012"
    },
    {
        "id": 11512,
        "title": "Translation and Normativity [1998]",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-10"
    },
    {
        "id": 11513,
        "title": "Chapter 6. The Latin translation of Philosophical Transactions (1671–1681)",
        "authors": "Pablo Toribio",
        "published": "2020-10-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.154.06tor"
    },
    {
        "id": 11514,
        "title": "Leveraging ChatGPT and Multilingual Knowledge Graph for Automatic Post-Editing",
        "authors": "Min Zhang,  , Xiaofeng Zhao, Yanqing Zhao, Hao Yang, Xiaosong Qiao, Junhao Zhu, Wenbing Ma, Chang Su, Yilun Liu, Yinglu Li, Minghan Wang, Song Peng, Shimin Tao, Yanfei Jiang,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26615/issn.2683-0078.2023_010"
    },
    {
        "id": 11515,
        "title": "Implications of computer code translation for translation studies",
        "authors": "James St. André",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14781700.2023.2205418"
    },
    {
        "id": 11516,
        "title": "Translation and Localization in Advertisement",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0018"
    },
    {
        "id": 11517,
        "title": "Introduction:",
        "authors": "",
        "published": "2019-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv6q5315.6"
    },
    {
        "id": 11518,
        "title": "Translation",
        "authors": "Jacques Lezra",
        "published": "2017-8-1",
        "citations": 0,
        "abstract": "This chapter sketches the outlines of the prevailing, but conceptually trivial, sense of translation we might be tempted to press into service as a political concept. It describes a different sense of translation, with different futures as a political concept, that flows from the rise of so-called machine translation and which may already organize, and if not already may soon come to organize, the semantic field covered by the term “translation.” Finally, with the help of different sorts of machines entirely, or different sorts of mechanical entities, the chapter attempts to show how these two senses of “translation” should be thought in relation to one another, and then reworked into our understanding of the practices of translation we encounter today.",
        "link": "http://dx.doi.org/10.5422/fordham/9780823276684.003.0013"
    },
    {
        "id": 11519,
        "title": "The professional world of translation Review of Translation as a Profession by Daniel Gouadec",
        "authors": "Aloísio Ferreira",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm4_2r2"
    },
    {
        "id": 11520,
        "title": "Trembling in translation: teachings from Kierkegaard and Derrida about ethics in translation",
        "authors": "Eivor Jordà Mathiasen",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14781700.2023.2280183"
    },
    {
        "id": 11521,
        "title": "On Subtitle Translation from the Perspectives of Semantic Translation and Communicative Translation",
        "authors": "Liping Lai",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-6000-0_3"
    },
    {
        "id": 11522,
        "title": "Contemporary Translation Studies: Introduction",
        "authors": "Tian Chuanmao,  ",
        "published": "2021-11-15",
        "citations": 0,
        "abstract": "This edited volume has tried to explore contemporary developments and trends in the translation studies. This book will be useful to the subject readers, interpreters, and those interested in the developmental studies in the translation discipline.",
        "link": "http://dx.doi.org/10.46679/978819484830100"
    },
    {
        "id": 11523,
        "title": "Predicting Translation Performance with Referential Translation Machines",
        "authors": "Ergun Biçici",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-4759"
    },
    {
        "id": 11524,
        "title": "Translation, Irritation and Resonance [2007]",
        "authors": "Theo Hermans",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003011033-5"
    },
    {
        "id": 11525,
        "title": "Algorithmic Translation:",
        "authors": "Eran Hadas",
        "published": "2020-1-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv16km05j.18"
    },
    {
        "id": 11526,
        "title": "Translation",
        "authors": "Sara Laviosa",
        "published": "2018-11-29",
        "citations": 0,
        "abstract": "The theoretical, empirical, and pedagogic study of translation is the concern of the interdisciplinary and international field of scholarship known, since 1972, as translation studies. The aim of theoretical translation studies is to elaborate principles that explain and predict the linguistic, cognitive, cultural, and ideological phenomena inherent in the process of transferring a written, oral, or multimodal text from the source language to the target language in a specific sociocultural context. Moreover, theory aims to account for the variegated and complex nature of the translated product resulting from that process. The goal of descriptive translation studies is threefold. It undertakes synchronic and diachronic text-focused analyses of translations (product-oriented studies). It investigates the influence of translations in the recipient sociocultural context (function-oriented studies). It examines the mental processes involved in the translation act (process-oriented descriptive studies). Translation description and translation theory constitute the two branches of the discipline that focus on pure research. The third branch, applied translation studies, concerns itself with translator training, translation aids, translation policy, and translation criticism. Translator training includes teaching methods (approach, design, and procedures), testing techniques (the diagnostic, formative, and summative assessment of the various components of translation competence), and curriculum planning. Translation aids comprise translation-specific lexicographical and terminological resources as well as grammars. Translation policy involves giving sound advice on the place and role of translators and translation in society, including language education. Translation criticism subsumes translation interpretation and evaluation. The three main branches of translation studies are interdependent, since each provides data and insights for the other two. Thus, translation scholars elaborate theories and models by combining the observational and experimental results yielded by descriptive and applied studies. Researchers working in descriptive and applied studies draw on the insights provided by translation theory, and they put forward operational hypotheses they test empirically. In each of the three branches of translation studies there are two additional dimensions. The historical dimension deals with the history of translation theory, translation description, and applied translation studies. The methodological dimension discusses issues concerning the definition of the object of study of the discipline together with the choice of the research styles, methods, and tools that are most appropriate in the different subdivisions of the field. Interdisciplinarity in translation studies is now more evident than ever, since scholars are becoming acutely aware of the multitude of practices that are subsumed under the umbrella term “translation.”",
        "link": "http://dx.doi.org/10.1093/obo/9780199772810-0224"
    },
    {
        "id": 11527,
        "title": "An Introduction to Modernist Non-Translation",
        "authors": "Jason Harding, John Nash",
        "published": "2019-10-24",
        "citations": 0,
        "abstract": "This first essay in the volume constitutes a substantial and wide-ranging introduction to this neglected topic, establishing the importance of untranslated fragments in modernist writing. The chapter expounds the complexities of the term ‘non-translation’, differentiating the practice from multilingualism, reading it alongside modern translation theory and practice. It situates modernist non-translation among a number of crucial contexts in intellectual history and literary theory: the ‘linguistic turn’ explored by contemporary philosophers, linguists, literary theorists, and critics; and examines broader sociopolitical issues relating to nationalism and language, the rise of English as an (imperial) global language, and the standardization of English. This introduction foregrounds key hermeneutical difficulties surrounding untranslatability and concerning reading or interpreting modernist non-translation, thus preparing the ground for the following chapters.",
        "link": "http://dx.doi.org/10.1093/oso/9780198821441.003.0001"
    },
    {
        "id": 11528,
        "title": "Translation and Rewriting in the Age of Post-Translation Studies",
        "authors": "George Henson",
        "published": "2018-9-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/07374836.2018.1508180"
    },
    {
        "id": 11529,
        "title": "Brief history of translation",
        "authors": "Lynne Bowker",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003217718-3"
    },
    {
        "id": 11530,
        "title": "The translation profession today",
        "authors": "Lynne Bowker",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003217718-4"
    },
    {
        "id": 11531,
        "title": "Jargon translation",
        "authors": "Hussein Abdul-Raof",
        "published": "2022-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003268956-7"
    },
    {
        "id": 11532,
        "title": "Translation and Translators in New Media",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501333903.0010"
    },
    {
        "id": 11533,
        "title": "On Manuscripts, Type-Translation, and Translation (Im?)proper: Emily Dickinson and the Translation of Scriptural Form",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501329944.ch-003"
    },
    {
        "id": 11534,
        "title": "Managing the translation workflow with a Computer Assisted Translation Tool:",
        "authors": "Laura Ramírez Polo",
        "published": "2019-1-3",
        "citations": 0,
        "abstract": "Reviewed by Laura Ramírez PoloUniversitat de Valencia, Spain\r\n \r\n1. INTRODUCTION\r\nOver the past 30 years, translators have been continuously incorporating the new advances in technology into their daily work. Nowadays, it is inconceivable that a professional does not use a computer with at least a word processor and some tool allowing terminology to be managed and looked up, be it some application on the Internet or a simple spreadsheet.",
        "link": "http://dx.doi.org/10.6035/languagev.2013.5.10"
    },
    {
        "id": 11535,
        "title": "What can research on indirect translation do for Translation Studies?",
        "authors": "Hanna Pięta, Laura Ivaska, Yves Gambier",
        "published": "2022-10-11",
        "citations": 7,
        "abstract": "Abstract\nThis special issue is about indirect translation (ITr). To counter the traditional disinterest of Translation Studies in\n\t\t\t\t\tresearching ITr, it explores and showcases what research on the topic can do for our discipline as a whole. This introductory article\n\t\t\t\t\tprepares the ground for and provides an overview of what is discussed in the seven articles included in the special issue. Before\n\t\t\t\t\tintroducing the contributions to this issue, we briefly explain the terminology and definitions used throughout this issue. In the spirit of\n\t\t\t\t\ttransparency, and making this special issue useful to everyone in Translation Studies, this introduction also devotes space to discussing\n\t\t\t\t\thow this issue came into being, sharing some of the lessons learnt through guest editing.",
        "link": "http://dx.doi.org/10.1075/target.00012.pie"
    },
    {
        "id": 11536,
        "title": "Translation of cohesion",
        "authors": "Hussein Abdul-Raof",
        "published": "2022-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003268956-6"
    },
    {
        "id": 11537,
        "title": "Translation equivalent but different, impossible but necessary, interlingual or intercultural: conceptualizing translation",
        "authors": "Vazmur Zag",
        "published": "2020",
        "citations": 0,
        "abstract": "In this study I will try to outline a common emancipatory program for the politically-engaged translator based on the work of these thinkers. We will pay special attention to the counter-hegemonic potential of translation as developed by our authors and to the concept of “constellation” advanced by Santos in his works. Another chief concern will be to explore the divide between these two different concepts of translation (interlingual and “cultural”), trying to answer several pressing questions. Can these different notions be unified in such a way that the insights from these thinkers can be reconciled with mainstream translation theory? Do we run the risk of diluting the concept of translation to such an extent, in this constant conceptual broadening, that it ceases to have any solid foundation?",
        "link": "http://dx.doi.org/10.51708/apptrans.v14n2.1305"
    },
    {
        "id": 11538,
        "title": "Variational Translation Theory: An Emerging Translation Theory",
        "authors": "Zhonglian Huang, Yongzhong Zhang",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-9271-3_2"
    },
    {
        "id": 11539,
        "title": "Introduction: (re-)conceptualizing translation in translation studies",
        "authors": "Binghan Zheng, Sergey Tyulenev, Kobus Marais",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14781700.2023.2207577"
    },
    {
        "id": 11540,
        "title": "Biology of Translation: The Role of Agents",
        "authors": "ALEXEI A. SHAROV",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781350192140.ch-4"
    },
    {
        "id": 11541,
        "title": "Colonizing the past? Antiquarian translation revisited",
        "authors": "Kelly Washbourne",
        "published": "2023",
        "citations": 0,
        "abstract": "This  study  seeks  a  comprehensive  dialogue  between  the  adherents  of  archaizing translation,  its  opponents,  and  those  in  the  middle.  It  revisits  archaism  as  a  literary  strategy, comparing  the  practice  with  archaizing  translation  as  a  translation  strategy,  and  surveying  its grammatical and syntactic features. Why have contemporary archaizing translations been held to be failed, and why—less often--have they been championed? Three main positions--the theoretical defenses,  compromises  such  as  Robinson's  'strange  loop',  and  excoriations  of  the  practice--are chronicled.  I  attend  to  each  side’s  (sometimes  faulty)  assumptions.  Is  translational  pastness  but patina, pastiche, and appropriation, or a revitalization?",
        "link": "http://dx.doi.org/10.21747/21844585/tm5_2a7"
    },
    {
        "id": 11542,
        "title": "Review article: Translation, Creativity and Experimentalism",
        "authors": "África Vidal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm5_1r1"
    },
    {
        "id": 11543,
        "title": "Human vs. Machine Translation:",
        "authors": "",
        "published": "2019-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv6q5315.9"
    },
    {
        "id": 11544,
        "title": "Translation between Non-humans and Humans",
        "authors": "XANY JANSEN VAN VUUREN",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781350192140.ch-11"
    },
    {
        "id": 11545,
        "title": "No Title",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm3_1"
    },
    {
        "id": 11546,
        "title": "Why Should Cisnormative Translation Scholars Care About Translation and Transgender?",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501345579.0007"
    },
    {
        "id": 11547,
        "title": "Translation Style in Sight Translation",
        "authors": "Wenchao Su",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-5675-3_3"
    },
    {
        "id": 11548,
        "title": "No Title",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm4_1"
    },
    {
        "id": 11549,
        "title": "No Title",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm2_1"
    },
    {
        "id": 11550,
        "title": "Cultural translation",
        "authors": "",
        "published": "2017-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315857633-8"
    },
    {
        "id": 11551,
        "title": "No Title",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm1_2"
    },
    {
        "id": 11552,
        "title": "No Title",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm4_2"
    },
    {
        "id": 11553,
        "title": "Political Translation and Civic Translation Capacities for Democracy in Post-Migrant Societies",
        "authors": "Nicole Doerr",
        "published": "2021-3-4",
        "citations": 0,
        "abstract": "Translation’s transformative potential has been studied by students of comparative literature, culture, gender, and social movements; but it has received less attention in theories of democracy. This contribution gives a survey of theories of translation, democratic dialogue, and social change drawing on migration and citizenship studies, gender and intersectionality, and research on political participation, transnational social movements, and diffusion. Based on an interdisciplinary conceptualization of translation in the literature, it first reviews existing political theories of democratic dialogue and deliberation. It then provides a sociological critique of democratic theories to explore how structural inequality creates conflict and “positional” misunderstandings within culturally diverse settings for civic participation and deliberation in globalized, unequal, and increasingly diverse societies and transnational publics. Finally, it reviews contemporary practices and radical democratic interventions used by migrants and activists, civic volunteer translators and interpreters, in order to address power inequality and diversity within contemporary democratic processes. By interpreting these grassroots democratic practices, the contribution of this chapter is to infuse democratic theory with timely sociological insights into the potential of activist “political” translations and comparative research on civic translation capacities. Political translation, distinct from conventional definitions of linguistic translation, is a disruptive and communicative practice for challenging power asymmetries and inequality in democratic processes or institutions. Based on cross-national empirical evidence, it discusses the benefits and challenges of political translation and civic translation capacities benefiting female asylum seekers and low–socioeconomic status groups who face structural barriers to access social and civic rights and education.",
        "link": "http://dx.doi.org/10.1093/oxfordhb/9780190067205.013.17"
    },
    {
        "id": 11554,
        "title": "Intersemiotic translation",
        "authors": "Elin Sütiste",
        "published": "2021-10-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.int7"
    },
    {
        "id": 11555,
        "title": "Translation and money — a meaningful symbiosis",
        "authors": "Karen Bennett",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm4_2int"
    },
    {
        "id": 11556,
        "title": "No Title",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21747/21844585/tm5_1"
    },
    {
        "id": 11557,
        "title": "Metaphor and Translation",
        "authors": "Mark Shuttleworth",
        "published": "2017-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315678085-4"
    },
    {
        "id": 11558,
        "title": "NGOs and translation",
        "authors": "Wine Tesseur",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.ngo1"
    },
    {
        "id": 11559,
        "title": "The Outsourced Legal Translation Environment",
        "authors": "Juliette R. Scott",
        "published": "2019-3-21",
        "citations": 0,
        "abstract": "Chapter 1 situates outsourced legal translation in its environment, examining the specific features of the market, and introduces corporate agency theory as a lens through which to research the commissioning and performance of legal translation from and by external practitioners, enriched with certain functionalist translation theories. Issues of status, cursory orders, and heterogeneous quality are discussed, together with the effects of accelerated technological developments and globalization. The complexity of interaction and power play between actors in the market and associated risk potential are discussed, and a model of the chain of supply is presented, along with profiles of key stakeholders.",
        "link": "http://dx.doi.org/10.1093/oso/9780190900014.003.0002"
    },
    {
        "id": 11560,
        "title": "Museums and translation",
        "authors": "Robert Neather",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.mus2"
    },
    {
        "id": 11561,
        "title": "Ecology of translation",
        "authors": "Michael Cronin",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.eco1"
    },
    {
        "id": 11562,
        "title": "Chapter 3. Travelling knowledge in nineteenth-century science",
        "authors": "Laura Meneghello",
        "published": "2020-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.154.03men"
    },
    {
        "id": 11563,
        "title": "Literal Translation Vs. Self-Translation: The Beckett–Pinget Collaboration On The Radio Play CENDRES ( Embers )",
        "authors": "Pim Verhulst",
        "published": "2021-10-20",
        "citations": 0,
        "abstract": "Although Beckett is generally known as a self-translator, he did not systematically render his own work into French and English before the 1970s. Until that time, he enlisted the help of various third parties, either translating his texts together with them on the spot or revising their work afterwards. Many of these collaborations left behind material traces which offer unique insight into the little-studied practice of co-translation. This chapter focuses on the French version of Beckett’s radio play Embers. Using unpublished information from the Pinget papers at the Bibliothèque littéraire Jacques Doucet in Paris and Beckett’s letters to Barbara Bray at TCD, this chapter compares some of the choices made by Beckett and Pinget throughout the remaining drafts of Cendres. Its purpose is to study genetically the differences between a ‘transliteration’ and a ‘(self)-translation’, showing how the former seeks to imitate or stand in for the original, while the latter continues its – in this case bilingual – genesis with more creative leeway.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474483827.003.0006"
    },
    {
        "id": 11564,
        "title": "‘Making Strange’: Non-Translation in The Waste Land",
        "authors": "Jason Harding",
        "published": "2019-10-24",
        "citations": 0,
        "abstract": "This chapter employs concepts and terms drawn from Russian Formalism to assist reading key moments of non-translation in The Waste Land. Treated as avant-garde linguistic ‘shifts’ that disrupt and estrange the poetic form, particular instances of non-translation in the poem—from the epigraph to the wild cacophony of different languages at the end of the poem—are seen as covert and coded expressions of powerful affect. This chapter considers these experimental disruptions of form in the social and political contexts of post-war avant-garde revolt and recognition of individual and collective trauma.",
        "link": "http://dx.doi.org/10.1093/oso/9780198821441.003.0008"
    },
    {
        "id": 11565,
        "title": "Translation Problems Arising from Culturally Marked Translation Units in Children's Literature",
        "authors": "Nieves Jiménez-Carra, Inma Mendoza-García",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003253594-10"
    },
    {
        "id": 11566,
        "title": "Community translation",
        "authors": "Wine Tesseur",
        "published": "2018-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14781700.2018.1447991"
    },
    {
        "id": 11567,
        "title": "Intralingual translation",
        "authors": "Karen Korning Zethsen",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.int8"
    },
    {
        "id": 11568,
        "title": "Food and translation",
        "authors": "Renée Desjardins",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.foo1"
    },
    {
        "id": 11569,
        "title": "Risk in translation",
        "authors": "Kayo Matsushita",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/hts.5.ris1"
    },
    {
        "id": 11570,
        "title": "Introduction",
        "authors": "",
        "published": "2018-5-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1075/btl.140.intro"
    }
]