[
    {
        "id": 27505,
        "title": "Explainable Deep Semantic Segmentation for Flood Inundation Mapping with Class Activation Mapping Techniques",
        "authors": "Jacob Sanderson, Hua Mao, Naruephorn Tengtrairat, Raid Al-Nima, Wai Woo",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012432300003636"
    },
    {
        "id": 27506,
        "title": "Vision-Based Corrosion Identification Using Data-Driven Semantic Segmentation Techniques",
        "authors": "Rui Pimentel de Figueiredo, Simon Bøgh",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ist59124.2023.10355698"
    },
    {
        "id": 27507,
        "title": "Cross domain matching for semantic point cloud segmentation based on image segmentation and geometric reasoning",
        "authors": "Jan Martens, Timothy Blut, Jörg Blankenbach",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2023.102076"
    },
    {
        "id": 27508,
        "title": "Exploring FMU-NET: A Comprehensive Study on Person Identification Through Novel Semantic Segmentation Techniques",
        "authors": "Prateeth Rao, Devesh Bhaskaran,  Lakshmeesha",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10392590"
    },
    {
        "id": 27509,
        "title": "Determination of the Live Weight of Farm Animals with Deep Learning and Semantic Segmentation Techniques",
        "authors": "Erdal Guvenoglu",
        "published": "2023-6-8",
        "citations": 3,
        "abstract": "In cattle breeding, regularly taking the animals to the scale and recording their weight is important for both the performance of the enterprise and the health of the animals. This process, which must be carried out in businesses, is a difficult task. For this reason, it is often not performed regularly or not performed at all. In this study, we attempted to estimate the weights of cattle by using stereo vision and semantic segmentation methods used in the field of computer vision together. Images of 85 animals were taken from different angles with a stereo setup consisting of two identical cameras. The distances of the animals to the camera plane were calculated by stereo distance calculation, and the areas covered by the animals in the images were determined by semantic segmentation methods. Then, using all these data, different artificial neural network models were trained. As a result of the study, it was revealed that when stereo vision and semantic segmentation methods are used together, live animal weights can be predicted successfully.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13126944"
    },
    {
        "id": 27510,
        "title": "Contrastive-Aware ViT for Weakly Supervised Semantic Segmentation",
        "authors": "Pranav Pativada, Zeeshan Hayder, Ali Zia, Nick Barnes",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00010"
    },
    {
        "id": 27511,
        "title": "Domain adaptation method for semantic segmentation in marine vessel inspection",
        "authors": "Mateusz Dyduch, Rasmus Eckholdt Andersen, Evangelos Boukas",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ist59124.2023.10355726"
    },
    {
        "id": 27512,
        "title": "Dynamic convolution layer based optimization techniques for object classification and semantic segmentation",
        "authors": "Jaswinder Singh, B. K. Sharma",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "<p>Providing meaningful classification for each pixel in an image is a primary goal of computer vision, and the tasks of object classification and semantic segmentation are among the field’s greatest challenges. To improve object classification, this study presents a novel method that combines semantic segmentation with dynamic convolution layer-based optimization techniques. In the proposed method, a Refined Convolution Neural Network (R-CNN) is used, which uses non-extensive entropy to dynamically increase the size of its convolutional layers. The Common Objects in Context (COCO) dataset is used to assess the performance of the model. The model performs exceptionally well at different Intersections over Union (IoU) cutoffs, with average precision values of 40.1, 61.9, and 45.4, respectively, for Average Precision (AP), AP<sub>50</sub>, and AP<sub>75</sub>. These results demonstrate the model’s efficiency in discriminating between various image contents. Additionally, the model predicts an image’s outcome on average in just 0.901 s. The model has been proven to be superior through various performance evaluation parameters, showing an average mean precision of 91.78%. This study demonstrates the power of combining dynamic convolution layers with semantic segmentation to improve object classification accuracy, a key component in the development of computer vision applications.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v7i3.944"
    },
    {
        "id": 27513,
        "title": "Revisiting Image Reconstruction for Semi-supervised Semantic Segmentation",
        "authors": "Yuhao Lin, Haiming Xu, Lingqiao Liu, Jinan Zou, Javen Shi",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00014"
    },
    {
        "id": 27514,
        "title": "SegFormer: Semantic Segmentation Based Tranformers For Corrosion Detection",
        "authors": "Abid Safa, Amroune Mohamed, Bendib Issam, Haouam Mohamed-Yassine",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnas59892.2023.10330461"
    },
    {
        "id": 27515,
        "title": "IUCNet: A Novel Semantic Segmentation Network for Overlapping Industrial Parts Detection",
        "authors": "Kedi Wu, Qingcheng Yang",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cipae60493.2023.00078"
    },
    {
        "id": 27516,
        "title": "Enhanced Neural SLAM with Semantic Segmentation in Dynamic Environments",
        "authors": "Zhengcheng Shen, Minzhe Mao, Linh Kästner, Jens Lambrecht",
        "published": "2023-7-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218889"
    },
    {
        "id": 27517,
        "title": "Object-Based Image Analysis of Hyper Spectral Imagery Using Semantic Segmentation Techniques",
        "authors": "Amit Kumar Sharma, Manju Bargavi, Akhilendra Pratap Singh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470905"
    },
    {
        "id": 27518,
        "title": "Semantic Segmentation of Dental Caries using Improved Deeplab V3Network",
        "authors": "Manusha Kaki, Suryanarayana Gunnam, Sravani Dhanavath, Prathap Kumar Gorantla, Rakesh Saripineni",
        "published": "2023-1-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icct56969.2023.10075992"
    },
    {
        "id": 27519,
        "title": "Clustering-TinyPointNet for Fast Large-scale Point Cloud Semantic Segmentation",
        "authors": "Zhenglin Wang, Kerry Walsh, Fariza Sabrina, Lasitha Piyathilaka, Yufeng Lin",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00039"
    },
    {
        "id": 27520,
        "title": "Semantic Segmentation for Improved Cell Nuclei Analysis",
        "authors": "Joren Regan, Chaki Ramesh, Saurabh Gupta, Ankur Sharma, Duc-Son Pham, Aneesh Krishna",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00019"
    },
    {
        "id": 27521,
        "title": "A Survey on Image Semantic Segmentation Using Deep Learning Techniques",
        "authors": "Jieren Cheng, Hua Li, Dengbo Li, Shuai Hua, Victor S. Sheng",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.032757"
    },
    {
        "id": 27522,
        "title": "A semantic segmentation-based collision recognition method for motorcycle slalom through poles in Motorcycle Driving License Test",
        "authors": "Jiakai Zhou, Xiaoliang Wu, Wanlin Zhou, Yang Wang",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2023.101912"
    },
    {
        "id": 27523,
        "title": "Improving Zero-Shot Semantic Segmentation using Dynamic Kernels",
        "authors": "Tauseef Tajwar, Muftiqur Rahman, Taukir Azam Chowdhury, Sabbir Ahmed, Moshiur Farazi, Md. Hasanul Kabir",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00061"
    },
    {
        "id": 27524,
        "title": "Semantic Segmentation",
        "authors": " Aakanksha, Arushi Seth, Shanu Sharma",
        "published": "2023-3-31",
        "citations": 1,
        "abstract": "Semantic segmentation was traditionally performed using primitive methods; however, in recent times, a significant growth in the advancement of deep learning techniques for the same is observed. In this paper, an extensive study and review of the existing deep learning (DL)-based techniques used for the purpose of semantic segmentation is carried out along with a summary of the datasets and evaluation metrics used for the same. The paper begins with a general and broader focus on semantic segmentation as a problem and further narrows its focus on existing DL-based approaches for this task. In addition to this, a summary of the traditional methods used for semantic segmentation is also presented towards the beginning. Since the problem of scene understanding is being vastly explored in the computer vision community, especially with the help of semantic segmentation, the authors believe that this paper will benefit active researchers in reviewing and studying the existing state-of-the-art as well as advanced methods for the same.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/jitr.299388"
    },
    {
        "id": 27525,
        "title": "SSNet: Learning Self-Similarity for Few-Shot Semantic Segmentation",
        "authors": "Weisheng Lan, Yu Liu",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218769"
    },
    {
        "id": 27526,
        "title": "Semantic Segmentation on 3D Point Clouds with High Density Variations",
        "authors": "Ryan Faulkner, Luke Haub, Simon Ratcliffe, Ian Reid, Tat-Jun Chin",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00037"
    },
    {
        "id": 27527,
        "title": "An Advanced Real-Time Semantic Segmentation Algorithm for Water Level Detection",
        "authors": "Nan Wang, Wei He, Huaze Ding, Haoxuan Li",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecc60864.2023.10456656"
    },
    {
        "id": 27528,
        "title": "Event-Based Semantic-Aided Motion Segmentation",
        "authors": "Chenao Jiang, Julien Moreau, Franck Davoine",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012308100003660"
    },
    {
        "id": 27529,
        "title": "Investigation of Deep Learning Based Semantic Segmentation Models for Autonomous Vehicles",
        "authors": "Xiaoyan Wang, Huizong Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141136"
    },
    {
        "id": 27530,
        "title": "SGNet: a fast and accurate semantic segmentation network based on semantic guidance",
        "authors": "Hengyu Li, Shuang Han, Jingyi Liu, Hongzhou Wang, Yueying Wang, Shaorong Xie",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2263063"
    },
    {
        "id": 27531,
        "title": "Predicting Visual Importance of Mobile UI Using Semantic Segmentation",
        "authors": "Ami Yamamoto, Yuichi Sei, Yasuyuki Tahara, Akihiko Ohsuga",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011655800003393"
    },
    {
        "id": 27532,
        "title": "Novel Framework for Real-Time Semantic Image Segmentation",
        "authors": "Sukirti Maskey, Chetan Shrestha, Sandeep Dhungana, Yashpal Singh, Anantha Babu",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47392/irjash.2023.s016"
    },
    {
        "id": 27533,
        "title": "Background Image Editing with HyperStyle and Semantic Segmentation",
        "authors": "Syuusuke Ishihata, Ryohei Orihara, Yuichi Sei, Yasuyuki Tahara, Akihiko Ohsuga",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011661500003393"
    },
    {
        "id": 27534,
        "title": "Deforestation detection using deep learning-based semantic segmentation techniques: a systematic review",
        "authors": "Imran Md Jelas, Mohd Asyraf Zulkifley, Mardina Abdullah, Martin Spraggon",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "Deforestation poses a critical global threat to Earth’s ecosystem and biodiversity, necessitating effective monitoring and mitigation strategies. The integration of deep learning with remote sensing offers a promising solution for precise deforestation segmentation and detection. This paper provides a comprehensive review of deep learning methodologies applied to deforestation analysis through satellite imagery. In the face of deforestation’s ecological repercussions, the need for advanced monitoring and surveillance tools becomes evident. Remote sensing, with its capacity to capture extensive spatial data, combined with deep learning’s prowess in recognizing complex patterns to enable precise deforestation assessment. Integration of these technologies through state-of-the-art models, including U-Net, DeepLab V3, ResNet, SegNet, and FCN, has enhanced the accuracy and efficiency in detecting deforestation patterns. The review underscores the pivotal role of satellite imagery in capturing spatial information and highlights the strengths of various deep learning architectures in deforestation analysis. Multiscale feature learning and fusion emerge as critical strategies enabling deep networks to comprehend contextual nuances across various scales. Additionally, attention mechanisms combat overfitting, while group and shuffle convolutions further enhance accuracy by reducing dominant filters’ contribution. These strategies collectively fortify the robustness of deep learning models in deforestation analysis. The integration of deep learning techniques into remote sensing applications serves as an excellent tool for deforestation identification and monitoring. The synergy between these fields, exemplified by the reviewed models, presents hope for preserving invaluable forests. As technology advances, insights from this review will drive the development of more accurate, efficient, and accessible deforestation detection methods, contributing to the sustainable management of the planet’s vital resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/ffgc.2024.1300060"
    },
    {
        "id": 27535,
        "title": "Experimental Application of Semantic Segmentation Models Fine-Tuned with Synthesized Document Images to Text Line Segmentation in a Handwritten Japanese Historical Document",
        "authors": "Sayaka Mori, Tetsuya Suzuki",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012433100003654"
    },
    {
        "id": 27536,
        "title": "Uncertainty-Based Detection of Adversarial Attacks in Semantic Segmentation",
        "authors": "Kira Maag, Asja Fischer",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012303500003660"
    },
    {
        "id": 27537,
        "title": "CAFseg: A Semantic segmentation network with cross aggregation fusion strategy for RGB-thermal semantic segmentation",
        "authors": "Shi Yi, Lang Wu, Xi Liu, Junjie Li, Gang Jiang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.infrared.2023.105077"
    },
    {
        "id": 27538,
        "title": "IFC-Based Semantic Segmentation and Semantic Enrichment of BIM for Bridges",
        "authors": "Hang Li, Fan Yang, Jiansong Zhang",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485262.061"
    },
    {
        "id": 27539,
        "title": "Enhancing synthetic data generation for semantic segmentation of point clouds",
        "authors": "Romain Cazorla, Line Poinel, Panagiotis Papadakis, Cédric Buche",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663812"
    },
    {
        "id": 27540,
        "title": "A Motion Target SAR Imaging Algorithm Based on Back-Projection and Scene Segmentation: Enhancing SAR Imaging of Moving Targets through Advanced Back-Projection and Scene Segmentation Techniques",
        "authors": "YongQiang Zhang, ZhiYong Song",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/grsm60169.2023.10425593"
    },
    {
        "id": 27541,
        "title": "Research on Semantic Segmentation Method of Remote Sensing Image Based on Self-supervised Learning",
        "authors": "Wenbo Zhang, Achuan Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140855"
    },
    {
        "id": 27542,
        "title": "Brain Tumor Semantic Segmentation using Residual U-Net++ Encoder-Decoder Architecture",
        "authors": "Mai Mokhtar, Hala Abdel-Galil, Ghada Khoriba",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01406119"
    },
    {
        "id": 27543,
        "title": "Protrusion-oriented Point Cloud Semantic Segmentation",
        "authors": "Alexander Agathos, Philip Azariadis",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadconfp.2023.95-100"
    },
    {
        "id": 27544,
        "title": "Optimizing Brain Tumor Segmentation with Advanced Superpixel Techniques in Conjunction with Deep Learning Methods",
        "authors": "Kanegonda Ravi Chythanya, Aruna S, Jayakumar Karuppaiah, S. Benjamin Arul, Piyush Kumar Pareek",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10393810"
    },
    {
        "id": 27545,
        "title": "Advanced Image Segmentation Techniques for Neural Activity Detection via C-fos Immediate Early Gene Expression",
        "authors": "Peilin Cai",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cait59945.2023.10469227"
    },
    {
        "id": 27546,
        "title": "Semantic Segmentation of Cracks on Masonry Surfaces Using Deep-Learning Techniques",
        "authors": "Sudhir Babu Patel, Pranjal Bisht, Krishna Kant Pathak",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/ppscfx.sceng-1410"
    },
    {
        "id": 27547,
        "title": "Semantic Segmentation by Semi-Supervised Learning Using Time Series Constraint",
        "authors": "Takahiro Mano, Sota Kato, Kazuhiro Hotta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011721800003417"
    },
    {
        "id": 27548,
        "title": "ATTransUNet: Semantic Segmentation Model for Building Segmentation from Aerial Image and Laser Data",
        "authors": "YUNUS SERHAT BICAKCI, Beytullah Sarica",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "The segmentation of buildings using aerial images and laser data (LIDAR) is a key area of study in computer vision and artificial intelligence. In this paper, we proposed a new deep learning-based framework architecture based on U-Net for the MapAI competition, which required participants to perform two tasks for segmenting buildings. On segmentation task 1, our model achieved an Intersection-over-Union (IoU) score of 0.7551 and a Boundary Intersection-over-Union (BIoU) score of 0.5613. On segmentation task 2, our model achieved an IoU score of 0.8555 and a BIoU score of 0.7127. These results demonstrate that our proposed method achieves competitive IoU and BIoU accuracies in building segmentation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5617/nmi.10039"
    },
    {
        "id": 27549,
        "title": "Lightweight Semantic Segmentation Network for Semantic Scene Understanding on Low-Compute Devices",
        "authors": "Hojun Son, James Weiland",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342110"
    },
    {
        "id": 27550,
        "title": "SGN: Semantic-Guided Net for 3D Semantic Segmentation in Cluttered Scenes",
        "authors": "Zihao Wan, Jianhua Hu, Yunkuan Wang",
        "published": "2024-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crc60659.2023.10488583"
    },
    {
        "id": 27551,
        "title": "Leveraging Deep Learning Techniques to Obtain Efficacious Segmentation Results",
        "authors": "Rushit Dave,  , Joy Purohit,  ",
        "published": "2023",
        "citations": 7,
        "abstract": "Image segmentation is a critical task in the field of computer vision. In the past, traditional segmentation algorithms were frequently used to tackle this problem but had various shortcomings. However, the advent of deep learning has revolutionized this field, leading to the development of novel image segmentation algorithms. This paper presents a comprehensive overview of deep learning-based models applied to medical imaging, iris recognition, pedestrian detection, and autonomous driving. The study encompasses various techniques, such as convolutional neural networks, fully convolutional neural networks, encoder-decoder architectures, multiscale approaches, attention mechanisms, and image transformers. Moreover, the paper evaluates the performance of these models on relevant datasets, providing insightful recommendations for researchers to integrate promising techniques into their work for specific applications. The discussion also explores the challenges, constraints, and potential research directions in these domains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47852/bonviewaaes32021220"
    },
    {
        "id": 27552,
        "title": "Transforming Semantic Segmentation into Instance Segmentation with a Guided U-Net",
        "authors": "Roman Lavrynenko, Nataliya Ryabova",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csit61576.2023.10324276"
    },
    {
        "id": 27553,
        "title": "FingerSeg: Highly-Efficient Dual-Resolution Architecture for Precise Finger-Level Semantic Segmentation",
        "authors": "Gibran Benitez-Garcia, Hiroki Takahashi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012575000003660"
    },
    {
        "id": 27554,
        "title": "Lightweight Bilateral Network for Real-Time Semantic Segmentation",
        "authors": "Pengtao Wang, Lihong Li, Feiyang Pan, Lin Wang",
        "published": "2023-7-20",
        "citations": 4,
        "abstract": "Herein, a dual-branch semantic segmentation model based on depth-separable convolution and attention mechanism is proposed for the real-time and accuracy requirement of semantic segmentation. The proposed approach overcomes the problems of poor segmentation effect and over-simplification of feature fusion arising from the constant downsample operations in semantic segmentation. The network is divided into spatial detail and semantic information paths. The spatial detail path utilizes a smaller downsample multiplier to maintain resolution and efficiently extract spatial information. The semantic information path is constructed by a non-bottleneck residual unit with dilated convolution; it extracts semantic features. For the feature aggregation problem, the feature-guided fusion module is designed to assign different weights to the parts of the two paths and fuse them to obtain the final output. The proposed algorithm achieves a segmentation accuracy of 69.6% and speed of 70 fps on the Cityscapes dataset, with a model parameter count of only 0.76 M, thus indicating some advantages over recent real-time semantic segmentation algorithms. The proposed method with depth separable convolution and attention mechanism can effectively extract features and compensate for the loss of accuracy caused by downsampling. The experiments demonstrate that the proposed fusion module outperforms other methods in fusing different features.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20965/jaciii.2023.p0673"
    },
    {
        "id": 27555,
        "title": "False Negative Reduction in Semantic Segmentation Under Domain Shift Using Depth Estimation",
        "authors": "Kira Maag, Matthias Rottmann",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011607400003417"
    },
    {
        "id": 27556,
        "title": "Few-Shot Image Semantic Segmentation based on Contextual Information Encoding Strategy",
        "authors": "Hao Chen, Xiaogen Zhou, Xingqing Nie, Tong Tong, Tao Tan",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00015"
    },
    {
        "id": 27557,
        "title": "A transformer-based semantic segmentation model for street fashion images",
        "authors": "DINGJIE PENG, Wataru Kameyama",
        "published": "2023-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2666583"
    },
    {
        "id": 27558,
        "title": "OCT layer segmentation using U-NET semantic segmentation and RESNET34 encoder-decoder",
        "authors": "K. Yojana, L. Thillai Rani",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100817"
    },
    {
        "id": 27559,
        "title": "Analysis and Evaluation of PointNet for Indoor Office Point Cloud Semantic Segmentation",
        "authors": "Calvin Wijaya, - Harintaka",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Indoor modeling is one of the primary sources of information in building management due to the increased use of BIM in the AEC industry. The indoor model can be acquired with several survey instruments, but TLS is the most popular resulting point cloud that can be processed into a 3D model. However, the process commonly still uses inefficient manual methods. Point cloud data have irregular, unordered, unstructured characteristics, making them more challenging to process. The deep learning algorithm can be a solution to solve the problem. PointNet is the first deep learning algorithm that directly accepts point cloud data as input. This study aims to analyze and evaluate the office indoor point cloud segmentation using PointNet. The office indoor point cloud data was acquired using TLS and then pre-processed for deep learning input. Transfer learning strategy is used as a weight initialization technique. The pre-trained model was trained with the S3DIS dataset and then fine-tuned to segment nine indoor classes in this study. The result shows PointNet achieves 85% overall accuracy and 66% average class IoU score to predict indoor classes using this studyâ€™s point cloud data. Geometry control shows that the predicted point cloud has an RMSE score of 1.8 cm, meaning the geometries of the segmented point cloud are accurate. Using the transfer learning method has increased the performance of the deep learning model. Further research is needed to evaluate the model thoroughly using more training and evaluation data and different transfer learning strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18517/ijaseit.13.6.18887"
    },
    {
        "id": 27560,
        "title": "Analysis and Evaluation of PointNet for Indoor Office Point Cloud Semantic Segmentation",
        "authors": "Calvin Wijaya, - Harintaka",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Indoor modeling is one of the primary sources of information in building management due to the increased use of BIM in the AEC industry. The indoor model can be acquired with several survey instruments, but TLS is the most popular resulting point cloud that can be processed into a 3D model. However, the process commonly still uses inefficient manual methods. Point cloud data have irregular, unordered, unstructured characteristics, making them more challenging to process. The deep learning algorithm can be a solution to solve the problem. PointNet is the first deep learning algorithm that directly accepts point cloud data as input. This study aims to analyze and evaluate the office indoor point cloud segmentation using PointNet. The office indoor point cloud data was acquired using TLS and then pre-processed for deep learning input. Transfer learning strategy is used as a weight initialization technique. The pre-trained model was trained with the S3DIS dataset and then fine-tuned to segment nine indoor classes in this study. The result shows PointNet achieves 85% overall accuracy and 66% average class IoU score to predict indoor classes using this studyâ€™s point cloud data. Geometry control shows that the predicted point cloud has an RMSE score of 1.8 cm, meaning the geometries of the segmented point cloud are accurate. Using the transfer learning method has increased the performance of the deep learning model. Further research is needed to evaluate the model thoroughly using more training and evaluation data and different transfer learning strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18517/ijaseit.v13i6.18887"
    },
    {
        "id": 27561,
        "title": "Bird’s-Eye View Semantic Segmentation and Voxel Semantic Segmentation Based on Frustum Voxel Modeling and Monocular Camera",
        "authors": "Chao Qin, Yafei Wang, Yuchao Zhang, Chengliang Yin",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12204-023-2573-3"
    },
    {
        "id": 27562,
        "title": "Localization-Enhanced Voting-based Ensemble of Semantic Segmentation Models for Cervical Polyp Segmentation",
        "authors": "Norbert Serban, Balazs Harangi",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cbms58004.2023.00305"
    },
    {
        "id": 27563,
        "title": "Retinal Vessel Classification and Segmentation Using Advanced Machine Learning Techniques",
        "authors": "N. Ragavendran, G. Aravind Swaminathan,  Nithin, M. Mariammal, B. Diviyapriya,  Euodial",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331799"
    },
    {
        "id": 27564,
        "title": "1D-SalsaSAN: Semantic Segmentation of LiDAR Point Cloud with Self-Attention",
        "authors": "Takahiro Suzuki, Tsubasa Hirakawa, Takayoshi Yamashita, Hironobu Fujiyoshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011624100003417"
    },
    {
        "id": 27565,
        "title": "CoDA-Few: Few Shot Domain Adaptation for Medical Image Semantic Segmentation",
        "authors": "Arthur Pinto, Jefersson Santos, Hugo Oliveira, Alexei Machado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011616800003417"
    },
    {
        "id": 27566,
        "title": "Semantic Segmentation for Moon Rock Recognition Using U-Net with Pyramid-Pooling-Based SE Attention Blocks",
        "authors": "Antoni Jaszcz, Dawid Połap",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012424600003636"
    },
    {
        "id": 27567,
        "title": "A Comparative Analysis of CNN-based Deep Learning Models for Semantic Segmentation of PolSAR data",
        "authors": "",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18699/sblai2023-61"
    },
    {
        "id": 27568,
        "title": "Gastro-Intestine Tract Image Segmentation using Semantic Segmentation and U-Net: Enhancing Cancer Diagnosis and Treatment",
        "authors": "",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets50795"
    },
    {
        "id": 27569,
        "title": "Design of an Efficient Model for Enhanced Liver and Tumor Segmentation Using Advanced Deep Learning Techniques",
        "authors": " Shashi Rathore,  Dr. Parul Share",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "The rapidly evolving landscape of medical imaging necessitates innovative approaches to enhance diagnostic accuracy, particularly in liver and tumor segmentation. Current methodologies often grapple with limitations such as the need for extensive labeled datasets and the challenge of generalizing across diverse pathological presentations. Addressing these constraints, this study introduces a novel deep learning model that amalgamates the prowess of U-Net architecture, Generative Adversarial Networks (GANs), and Monte Carlo Dropout techniques, each contributing uniquely to overcome the existing barriers. Predominantly, the traditional segmentation models are hindered by their dependency on large, annotated datasets, which are not only scarce but also labor-intensive to produce. Further, these models frequently struggle to maintain consistent performance across varying imaging conditions, a pivotal requirement in medical diagnostics. To surmount these challenges, our proposed model employs a fine-tuning methodology using a U-Net architecture pre-trained on extensive medical image datasets like NIH Chest X-ray or MIMIC-CXR. This strategy leverages the pre-existing knowledge within the network, significantly enhancing the model's ability to discern and adapt to the specific characteristics inherent in liver and tumor images & samples. In a parallel vein, the model harnesses the capabilities of GANs for data augmentation, generating synthetic yet realistic medical images. This innovative use of GANs addresses the issue of dataset variability, equipping the model to generalize more effectively across a spectrum of liver and tumor appearances, ultimately bolstering its robustness. This approach is particularly advantageous in handling cases with diverse lighting, angles, or pathological conditions, traditionally a stumbling block for segmentation models. Moreover, the incorporation of Monte Carlo Dropout for uncertainty estimation marks a significant stride in the realm of clinical applicability. This technique yields pixel-wise uncertainty maps, offering invaluable insights into the model's confidence levels in its predictions. Such transparency is crucial in clinical settings, where understanding the model's certainty can guide more informed and cautious decision-making, particularly in scenarios where the cost of erroneous segmentation is high for different scenarios. Empirical evaluation of this composite model on Kaggle datasets has demonstrated its superior performance, evidenced by improvements in precision (3.9%), accuracy (4.9%), recall (4.5%), AUC (8.5%), and a reduction in delay (3.5%) compared to existing methods. The culmination of these advancements not only enhances the efficacy of liver and tumor segmentation but also paves the way for broader applications in medical imaging diagnostics. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47392/irjaem.2024.0085"
    },
    {
        "id": 27570,
        "title": "Ameliorating Semantic Search Through Advanced AI Techniques",
        "authors": "Ravikumar V, Dharmesh Dhabliya, Mala Mathur, Sidhant Das, Ritesh Kumar, Srikrishna B Rao",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442780"
    },
    {
        "id": 27571,
        "title": "Using Data Mining Techniques To Enhance The Student Performance. A semantic review.",
        "authors": "Abdulkream Alsulami, Abdullah S Al-Malaise Al-Ghamdi, Mahmoud Ragab",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc56366.2023.10084963"
    },
    {
        "id": 27572,
        "title": "PBSNet: pseudo bilateral segmentation network for real-time semantic segmentation",
        "authors": "Hui-Lan Luo, Chun-Yan Liu, Soroosh Mahmoodi",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.4.043033"
    },
    {
        "id": 27573,
        "title": "Brain Tumor Classification using SLIC Segmentation with Superpixel Fusion, GoogleNet, and Linear Neighborhood Semantic Segmentation",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56042/jsir.v82i2.70214"
    },
    {
        "id": 27574,
        "title": "Boosting Semantic Segmentation by Conditioning the Backbone with Semantic Boundaries",
        "authors": "Haruya Ishikawa, Yoshimitsu Aoki",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "In this paper, we propose the Semantic-Boundary-Conditioned Backbone (SBCB) framework, an effective approach to enhancing semantic segmentation performance, particularly around mask boundaries, while maintaining compatibility with various segmentation architectures. Our objective is to improve existing models by leveraging semantic boundary information as an auxiliary task. The SBCB framework incorporates a complementary semantic boundary detection (SBD) task with a multi-task learning approach. It enhances the segmentation backbone without introducing additional parameters during inference or relying on independent post-processing modules. The SBD head utilizes multi-scale features from the backbone, learning low-level features in early stages and understanding high-level semantics in later stages. This complements common semantic segmentation architectures, where features from later stages are used for classification. Extensive evaluations using popular segmentation heads and backbones demonstrate the effectiveness of the SBCB. It leads to an average improvement of 1.2% in IoU and a 2.6% gain in the boundary F-score on the Cityscapes dataset. The SBCB framework also improves over- and under-segmentation characteristics. Furthermore, the SBCB adapts well to customized backbones and emerging vision transformer models, consistently achieving superior performance. In summary, the SBCB framework significantly boosts segmentation performance, especially around boundaries, without introducing complexity to the models. Leveraging the SBD task as an auxiliary objective, our approach demonstrates consistent improvements on various benchmarks, confirming its potential for advancing the field of semantic segmentation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23156980"
    },
    {
        "id": 27575,
        "title": "Image Semantic Segmentation Based on Few-Shot Learning",
        "authors": "Renjie Ma, An-Min Zou",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451379"
    },
    {
        "id": 27576,
        "title": "A novel comparison of image semantic segmentation techniques for detecting dust in photovoltaic panels using machine learning and deep learning",
        "authors": "Tonatiuh Cruz-Rojas, Jesus Alejandro Franco, Quetzalcoatl Hernandez-Escobedo, Dante Ruiz-Robles, Jose Manuel Juarez-Lopez",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.renene.2023.119126"
    },
    {
        "id": 27577,
        "title": "Data Quality Aware Approaches for Addressing Model Drift of Semantic Segmentation Models",
        "authors": "Samiha Mirza, Vuong Nguyen, Pranav Mantini, Shishir Shah",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012316000003660"
    },
    {
        "id": 27578,
        "title": "Noise-Robust Diffusion Based Semantic Segmentation",
        "authors": "Ahmet Kağan Kaya",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223870"
    },
    {
        "id": 27579,
        "title": "Semantic Segmentation: A Zoology of Deep Architectures",
        "authors": "Aitor Artola",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5201/ipol.2023.447"
    },
    {
        "id": 27580,
        "title": "Semantic-Aware Superpixel for Weakly Supervised Semantic Segmentation",
        "authors": "Sangtae Kim, Daeyoung Park, Byonghyo Shim",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Weakly-supervised semantic segmentation aims to train a semantic segmentation network using weak labels. Among weak labels, image-level label has been the most popular choice due to its simplicity. However, since image-level labels lack accurate object region information, additional modules such as saliency detector have been exploited in weakly supervised semantic segmentation, which requires pixel-level label for training. In this paper, we explore a self-supervised vision transformer to mitigate the heavy efforts on generation of pixel-level annotations. By exploiting the features obtained from self-supervised vision transformer, our superpixel discovery method finds out the semantic-aware superpixels based on the feature similarity in an unsupervised manner. Once we obtain the superpixels, we train the semantic segmentation network using superpixel-guided seeded region growing method. Despite its simplicity, our approach achieves the competitive result with the state-of-the-arts on PASCAL VOC 2012 and MS-COCO 2014 semantic segmentation datasets for weakly supervised semantic segmentation. Our code is available at https://github.com/st17kim/semantic-aware-superpixel.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i1.25196"
    },
    {
        "id": 27581,
        "title": "DoG-Loss for Semantic Segmentation",
        "authors": "Ali Solak, Cihan Topal",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223899"
    },
    {
        "id": 27582,
        "title": "Simple Scalable Multimodal Semantic Segmentation Model",
        "authors": "Yuchang Zhu, Nanfeng Xiao",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Visual perception is a crucial component of autonomous driving systems. Traditional approaches for autonomous driving visual perception often rely on single-modal methods, and semantic segmentation tasks are accomplished by inputting RGB images. However, for semantic segmentation tasks in autonomous driving visual perception, a more effective strategy involves leveraging multiple modalities, which is because different sensors of the autonomous driving system bring diverse information, and the complementary features among different modalities enhance the robustness of the semantic segmentation modal. Contrary to the intuitive belief that more modalities lead to better accuracy, our research reveals that adding modalities to traditional semantic segmentation models can sometimes decrease precision. Inspired by the residual thinking concept, we propose a multimodal visual perception model which is capable of maintaining or even improving accuracy with the addition of any modality. Our approach is straightforward, using RGB as the main branch and employing the same feature extraction backbone for other modal branches. The modals score module (MSM) evaluates channel and spatial scores of all modality features, measuring their importance for overall semantic segmentation. Subsequently, the modal branches provide additional features to the RGB main branch through the features complementary module (FCM). Leveraging the residual thinking concept further enhances the feature extraction capabilities of all the branches. Through extensive experiments, we derived several conclusions. The integration of certain modalities into traditional semantic segmentation models tends to result in a decline in segmentation accuracy. In contrast, our proposed simple and scalable multimodal model demonstrates the ability to maintain segmentation precision when accommodating any additional modality. Moreover, our approach surpasses some state-of-the-art multimodal semantic segmentation models. Additionally, we conducted ablation experiments on the proposed model, confirming that the application of the proposed MSM, FCM, and the incorporation of residual thinking contribute significantly to the enhancement of the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24020699"
    },
    {
        "id": 27583,
        "title": "Hierarchical Semantic Contrast for Weakly Supervised Semantic Segmentation",
        "authors": "Yuanchen Wu, Xiaoqiang Li, Songmin Dai, Jide Li, Tong Liu, Shaorong Xie",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Weakly supervised semantic segmentation (WSSS) with image-level annotations has achieved great processes through class activation map (CAM). Since vanilla CAMs are hardly served as guidance to bridge the gap between full and weak supervision, recent studies explore semantic representations to make CAM fit for WSSS and demonstrate encouraging results. However, they generally exploit single-level semantics, which may hamper the model to learn a comprehensive semantic structure. Motivated by the prior that each image has multiple levels of semantics, we propose hierarchical semantic contrast (HSC) to ameliorate the above problem. It conducts semantic contrast from coarse-grained to fine-grained perspective, including ROI level, class level, and pixel level, making the model learn a better object pattern understanding. To further improve CAM quality, building upon HSC, we explore consistency regularization of cross supervision and develop momentum prototype learning to utilize abundant semantics across different images. Extensive studies manifest that our plug-and-play learning paradigm, HSC, can significantly boost CAM quality on both non-saliency-guided and saliency-guided baselines, and establish new state-of-the-art WSSS performance on PASCAL VOC 2012 dataset. Code is available at https://github.com/Wu0409/HSC_WSSS.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/171"
    },
    {
        "id": 27584,
        "title": "Dataset and Performance Metrics towards Semantic Segmentation",
        "authors": "Rajalakshmi TS, R Senthilnathan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4352476"
    },
    {
        "id": 27585,
        "title": "Fusion attention-ASPP and context semantic for complex scene semantic segmentation",
        "authors": "Yinghao Lin, Shihao Zhao, Kun Cai, Baojun Qiao",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2674281"
    },
    {
        "id": 27586,
        "title": "Temporally Consistent Semantic Segmentation using Spatially Aware Multi-view Semantic Fusion for Indoor RGB-D videos",
        "authors": "Fengyuan Sun, Sezer Karaoglu, Theo Gevers",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00459"
    },
    {
        "id": 27587,
        "title": "RailCloud-HdF: A Large-Scale Point Cloud Dataset for Railway Scene Semantic Segmentation",
        "authors": "Mahdi Abid, Mathis Teixeira, Ankur Mahtani, Thomas Laurent",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012394800003660"
    },
    {
        "id": 27588,
        "title": "Deep Learning Semantic Segmentation Models for Detecting the Tree Crown Foliage",
        "authors": "Danilo Jodas, Giuliana Velasco, Reinaldo Araujo de Lima, Aline Machado, João Papa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011604600003417"
    },
    {
        "id": 27589,
        "title": "BiSeNet V3: Bilateral segmentation network with coordinate attention for real-time semantic segmentation",
        "authors": "Tsung-Han Tsai, Yu-Wei Tseng",
        "published": "2023-5",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.02.025"
    },
    {
        "id": 27590,
        "title": "OntoSeg - Segmentation of Large Volumetric Datasets Using Semantic Knowledge",
        "authors": "Thomas Lang, Tomas Sauer, Thomas Wittenberg, Stefan Gerth, Norman Uhlmann",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc56153.2023.00016"
    },
    {
        "id": 27591,
        "title": "Attention-based Self-Supervised Hierarchical Semantic Segmentation for Underwater Imagery",
        "authors": "Kurran Singh, Nick Rypkema, John Leonard",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oceanslimerick52467.2023.10244736"
    },
    {
        "id": 27592,
        "title": "Joint 2D and 3D semantic segmentation with consistent instance semantic",
        "authors": "Yingcai WAN, Lijin FANG",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1587/transfun.2023eap1095"
    },
    {
        "id": 27593,
        "title": "Semantic Segmentation for Various Applications: Research Contribution and Comprehensive Review",
        "authors": "Madiha Mazhar, Saba Fakhar, Yawar Rehman",
        "published": "2023-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023032021"
    },
    {
        "id": 27594,
        "title": "Image Semantic Segmentation Used in Automatics",
        "authors": "Viorica Spoiala",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/emes58375.2023.10171699"
    },
    {
        "id": 27595,
        "title": "Deep Learning-Based Semantic Segmentation Models for Prostate Gland Segmentation",
        "authors": "Rajesh M N, Chandrasekar B S",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/23488379/ijeee-v10i2p115"
    },
    {
        "id": 27596,
        "title": "SSEC: Semantic Segmentation and Ensemble Classification Framework for Static Hand Gesture Recognition using RGB-D Data",
        "authors": "Dayananda Kumar NC, K. V Suresh, Chandrasekhar V, Dinesh R",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01403104"
    },
    {
        "id": 27597,
        "title": "AUTOMATIC POLYP SEMANTIC SEGMENTATION USING WIRELESS CAPSULE ENDOSCOPY IMAGES WITH VARIOUS CONVOLUTIONAL NEURAL NETWORK AND OPTIMIZATION TECHNIQUES: A COMPARISON AND PERFORMANCE EVALUATION",
        "authors": "Jothiraj Selvaraj, A. K. Jayanthy",
        "published": "2023-12",
        "citations": 1,
        "abstract": " Colorectal cancer (CRC), ranking third most prevalent cancer type, can be diagnosed with the detection of polyps in the colon and rectum through endoscopic procedures facilitating prompt treatment. During visualization of gastrointestinal tract by the physician, there is high probability of miss rates and reviewing of the images is laborious. Automatic segmentation and detection are enabled with the convolutional neural networks (CNN). We segmented the polyps from the wireless capsule endoscopy images of Kvasir dataset using various CNN models. We have presented nine optimizers for each architecture and evaluated the performance parameters. The optimizers were graded based on the performance metrics in order to provide an insight for the researchers on the selection of optimizer and architecture. On comparison of the performance metrics of the pretrained and U-net-based architecture, the Adaptive Moment Estimation (ADAM) and Root Mean Squared Propagation (RMSPROP) optimizers received the highest score of 43 in the ranking, DiffGrad and Nesterov-accelerated Adaptive Moment Estimation (NADAM) ranked second with the score of 13, the Adaptive Delta (ADADELTA) ranked third with a score of 2, whereas Stochastic Gradient Descent (SGD), Adaptive Gradient Descent (ADAGRAD), and Adaptive Max (ADAMAX) optimizers performed least in the evaluation. Based on the deep learning application, the optimizer employed varies by considering computational speed, memory and computational time. This preliminary research provides the necessary key information for consideration in the development of an architecture with utilization of an optimizer. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.4015/s1016237223500266"
    },
    {
        "id": 27598,
        "title": "Segmentation from localization: a weakly supervised semantic segmentation method for resegmenting CAM",
        "authors": "Jingjing Jiang, Hongxia Wang, Jiali Wu, Chun Liu",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17779-4"
    },
    {
        "id": 27599,
        "title": "Supervised Semantic Segmentation of Murine THz Spectroscopy Images with Imprecise Annotations",
        "authors": "Haoyan Liu, Nagma Vohra, Keith Bailey, Magda El-Shenawee, Alexander Nelson",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc59802.2024.00017"
    },
    {
        "id": 27600,
        "title": "Multimodal MR Brain Image Segmentation using Hybrid Optimization Techniques for Earlier Prognosis of Tumor",
        "authors": "Baiju Karun, T. Arun Prasath, M. Pallikonda Rajasekaran, M Rakhee",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accthpa57160.2023.10083352"
    },
    {
        "id": 27601,
        "title": "Review of Unsupervised Segmentation Techniques on Long Wave Infrared Images",
        "authors": "Mohammed Abuhussein, Aaron L. Robinson, Iyad Almadani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01406138"
    },
    {
        "id": 27602,
        "title": "Height Estimation Based on Semantic Segmentation",
        "authors": "Yuxuan Guo, Zhe Wang",
        "published": "2023-7-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10281926"
    },
    {
        "id": 27603,
        "title": "Protrusion-oriented Point Cloud Semantic Segmentation",
        "authors": "Alexander Agathos, Philip Azariadis",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.328-349"
    },
    {
        "id": 27604,
        "title": "Two-step Domain Adaptive Semantic Segmentation Algorithm of Driving Scene",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/autml.2023.040105"
    },
    {
        "id": 27605,
        "title": "Computational Intelligent Techniques and Analysis on Automated Retinal Layer Segmentation and Detection of Retinal Diseases",
        "authors": "T. M. Sheeba, S. Albert Antony Raj, M. Anand",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10112832"
    },
    {
        "id": 27606,
        "title": "Semantic Segmentation on Neuromorphic Vision Sensor Event-Streams Using PointNet++ and UNet Based Processing Approaches",
        "authors": "Tobias Bolten, Regina Pohle-Fröhlich, Klaus Tönnies",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011622700003417"
    },
    {
        "id": 27607,
        "title": "Boundary refinement network with semantic embedding connections for UAV aerial image semantic segmentation",
        "authors": "Runzeng Li, Zaifeng Shi, Fanning Kong, Xiangyang Zhao, Tao Luo",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.6.063003"
    },
    {
        "id": 27608,
        "title": "Automatic Fracture Detection and Characterization in Borehole Images Using Deep Learning-Based Semantic Segmentation",
        "authors": "Andrei Baraian, Vili Kellokumpu, Räty Tomi, Leena Kallio",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011673100003417"
    },
    {
        "id": 27609,
        "title": "Efficient Disentangled Attention Network for Semantic Segmentation",
        "authors": "Yuhang Xie",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263368"
    },
    {
        "id": 27610,
        "title": "Combination of Semantic Segmentation and Skeleton Estimation for Human Hands Detection",
        "authors": "Chao-Lung Yang, Yang-Hsiu Tung, Tzu-Ching Kao, Chao-Hung Huang, En Liou, Po-Ting Lin, Kai-Lung Hua",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268564"
    },
    {
        "id": 27611,
        "title": "Detection of moss coverage and growth rate on rock surfaces based on semantic segmentation",
        "authors": "Qingyi Zhai, Huiling Liu, Bo Wan, Quanhua Xie, Xuefeng He, Yang Liu, Lei Wu, Dong Lai, Yuanyuan He, Xiaoling Peng, Yang Liu, Nianbing Zhong",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3022678"
    },
    {
        "id": 27612,
        "title": "Enhancing Style Transfer with GANs: Perceptual Loss and Semantic Segmentation",
        "authors": "A Satchidanandam, R. Mohammed Saleh Al Ansari, A L Sreenivasulu, Vuda Sreenivasa Rao, Sanjiv Rao Godla, Chamandeep Kaur",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141132"
    },
    {
        "id": 27613,
        "title": "Exploiting the Joint Potential of Instance Segmentation and Semantic Segmentation in Autonomous Driving",
        "authors": "Mohammed Usman, Thirumala Akash K, Mohammed Riyaz Ahmed, Raveendra Gudodagi, Nitesh Kumar T",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080167"
    },
    {
        "id": 27614,
        "title": "Analysis and Study of Conventional and Advanced Image Segmentation Techniques for Machine Learning-Based Leaf Disease Detection and Classification",
        "authors": "Sreya John, P. J. Arul Leena Rose",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425270"
    },
    {
        "id": 27615,
        "title": "Relationship Between Semantic Segmentation Model and Additional Features for 3D Point Clouds Obtained from on-Vehicle LIDAR",
        "authors": "Hisato Hashimoto, Shuichi Enokida",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012374400003660"
    },
    {
        "id": 27616,
        "title": "Synthesis for Dataset Augmentation of H&amp;E Stained Images with Semantic Segmentation Masks",
        "authors": "Peter Sakalik, Lukas Hudec, Marek Jakab, Vanda Benešová, Ondrej Fabian",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011679300003417"
    },
    {
        "id": 27617,
        "title": "Comparision Through Architectures of Semantic Segmentation in Breast Ultrasound Images Across Differents Input Data Dimensions",
        "authors": "Clécio Silva, Salomão Mafalda, Emili Bezerra, Gustavo Oliveira de Castro, Paulo Santos Júnior, Ana Alvarez",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012322500003657"
    },
    {
        "id": 27618,
        "title": "Unsupervised Ensemble Semantic Segmentation for Foreground-Background Separation on Satellite Image",
        "authors": "Jaelen Tarry, Xishuang Dong, Xiangfang Li, Lijun Qian, Leah Chance, Philip Morrone",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc59802.2024.00040"
    },
    {
        "id": 27619,
        "title": "A Novel Semantic Segmentation Approach Using Improved SegNet and DSC in Remote Sensing Images",
        "authors": "Wanjun Chang, Dongfang Zhang",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "An improved SegNet semantic segmentation model is proposed to address the issue of traditional classification algorithms and shallow learning algorithms not being suitable for extracting information from high-resolution remote sensing images. During the research process, space remote sensing images obtained from the GF-1 satellite were used as the data source. In order to improve the operational efficiency of the encoding network, the pooling layer in the encoding network is removed and the ordinary convolutional layer is replaced with a depth-wise separable convolution. By decoding the last layer of the network to obtain the reshaped output results, and then calculating the probability of each classification using a Softmax classifier, the classification of pixels can be achieved. The output result of the classifier is the final result of the remote sensing image semantic segmentation model. The results showed that the proposed algorithm had the highest Kappa coefficient of 0.9531, indicating good classification performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijswis.332769"
    },
    {
        "id": 27620,
        "title": "Semantic Guidance Fusion Network for Cross-Modal Semantic Segmentation",
        "authors": "Pan Zhang, Ming Chen, Meng Gao",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "Leveraging data from various modalities to enhance multimodal segmentation tasks is a well-regarded approach. Recently, efforts have been made to incorporate an array of modalities, including depth and thermal imaging. Nevertheless, the effective amalgamation of cross-modal interactions remains a challenge, given the unique traits each modality presents. In our current research, we introduce the semantic guidance fusion network (SGFN), which is an innovative cross-modal fusion network adept at integrating a diverse set of modalities. Particularly, the SGFN features a semantic guidance module (SGM) engineered to boost bi-modal feature extraction. It encompasses a learnable semantic guidance convolution (SGC) designed to merge intensity and gradient data from disparate modalities. Comprehensive experiments carried out on the NYU Depth V2, SUN-RGBD, Cityscapes, MFNet, and ZJU datasets underscore both the superior performance and generalization ability of the SGFN compared to the current leading models. Moreover, when tested on the DELIVER dataset, the efficiency of our bi-modal SGFN displayed a mIoU that is comparable to the hitherto leading model, CMNEXT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24082473"
    },
    {
        "id": 27621,
        "title": "Discrepancy-guided dual-branch semantic segmentation",
        "authors": "Jinghai Cheng",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2685757"
    },
    {
        "id": 27622,
        "title": "Semantic Segmentation Based Copy Paste Forgery Detection",
        "authors": "Abdurrahman Yavuz Aslantaş, Fehim Köylü",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296832"
    },
    {
        "id": 27623,
        "title": "Semantic segmentation-based semantic communication system for image transmission",
        "authors": "Jiale Wu, Celimuge Wu, Yangfei Lin, Tsutomu Yoshinaga, Lei Zhong, Xianfu Chen, Yusheng Ji",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2023.02.006"
    },
    {
        "id": 27624,
        "title": "Enhancing Gearbox Fault Diagnosis through Advanced Feature Engineering and Data Segmentation Techniques",
        "authors": "Khyati Shukla, William Holderbaum, Theodoros Theodoridis, Guowu Wei",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "Efficient gearbox fault diagnosis is crucial for the cost-effective maintenance and reliable operation of rotating machinery. Despite extensive research, effective fault diagnosis remains challenging due to the multitude of features available for classification. Traditional feature selection methods often fail to achieve optimal performance in fault classification tasks. This study introduces diverse ranking methods for selecting the relevant features and utilizes data segmentation techniques such as sliding, windowing, and bootstrapping to strengthen predictive model performance and scalability. A comparative analysis of these methods was conducted to identify the potential causes and future solutions. An evaluation of the impact of enhanced feature engineering and data segmentation on predictive maintenance in gearboxes revealed promising outcomes, with decision trees, SVM, and KNN models outperforming others. Additionally, within a fully connected network, windowing emerged as a more robust and efficient segmentation method compared to bootstrapping. Further research is necessary to assess the performance of these techniques across diverse datasets and applications, offering comprehensive insights for future studies in fault diagnosis and predictive maintenance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines12040261"
    },
    {
        "id": 27625,
        "title": "Road Scene Semantic Segmentation Based on Deep Learning",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ijfet.2023.051113"
    },
    {
        "id": 27626,
        "title": "Bi-Branch Weakly Supervised Semantic Segmentation with Transformer",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2024.070303"
    },
    {
        "id": 27627,
        "title": "Study of an Expansion Method Based on an Image-Specific Classifier and Multi-Features for Weakly Supervised Semantic Segmentation",
        "authors": "Zhengyang Lyu, Pierre Beauseroy, Alexandre Baussard",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012462100003654"
    },
    {
        "id": 27628,
        "title": "Domain Adaptation for Semantic Segmentation",
        "authors": "Archana Mohan, Anu S S, Joseph Zacharias",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57789.2023.10165580"
    },
    {
        "id": 27629,
        "title": "Using Weakly Supervised Semantic Segmentation for Post-Disaster Scene Understanding",
        "authors": "Yuhan Jiang, Benjamin Uwakweh",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485262.129"
    },
    {
        "id": 27630,
        "title": "Occlusion-Based Approach for Interpretable Semantic Segmentation",
        "authors": "Rokas Gipiškis, Olga Kurasova",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/cisti58278.2023.10212017"
    },
    {
        "id": 27631,
        "title": "MCLSS: Multi-level Contrastive Learning for Semantic Segmentation",
        "authors": "Di Wang",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263424"
    },
    {
        "id": 27632,
        "title": "Domain adaptation semantic segmentation for self-driving cars",
        "authors": "Y. Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1892"
    },
    {
        "id": 27633,
        "title": "Synthetic Data for Semantic Image Segmentation of Imagery of Unmanned Spacecraft",
        "authors": "Will Armstrong, Spencer Drakontaidis, Nicholas Lui",
        "published": "2023-3-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115564"
    },
    {
        "id": 27634,
        "title": "SD-SLAM: Visual SLAM Combining Semantic Segmentation and Dynamic Feature Point Detection",
        "authors": "Yu Zhang, Xuedong Wu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451659"
    },
    {
        "id": 27635,
        "title": "Semantic Segmentation of Remote Sensing Images of Urban Areas using Deep Learning Methods",
        "authors": "V. Pranathi, D. Vignan, B. Akshay, B. Yaswanth, Dr. S. Akila Agnes",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0779"
    },
    {
        "id": 27636,
        "title": "Visual Enhancement and Semantic Segmentation of Murine Tissue Scans with Pulsed THz Spectroscopy",
        "authors": "Haoyan Liu, Nagma Vohra, Keith Bailey, Magda El-Shenawee, Alexander Nelson",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc56153.2023.00018"
    },
    {
        "id": 27637,
        "title": "Semantic-Based Optimization of Deep Learning for Efficient Real-Time Medical Image Segmentation",
        "authors": "Zhenkun Wei, Jia Liu, Yu Yao",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "In response to the critical need for advanced solutions in medical imaging segmentation, particularly for real-time applications in diagnostics and treatment planning, this study introduces SM-UNet. This novel deep learning architecture efficiently addresses the challenge of real-time, accurate medical image segmentation by integrating convolutional neural network (CNN) with multilayer perceptron (MLP). The architecture uniquely combines an initial convolutional encoder for detailed feature extraction, MLP module for capturing long-range dependencies, and a decoder that merges global features with high-resolution CNN map. Further optimization is achieved through a tokenization approach, significantly reducing computational demands. Its superior performance is confirmed by evaluations on standard datasets, showing interaction times drastically lower than comparable networks—between 1/6 to 1/10, and 1/25 compared to SOTA models. These advancements underscore SM-UNet's potential as a groundbreaking tool for facilitating real-time, precise medical diagnostics and treatment strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijswis.340938"
    },
    {
        "id": 27638,
        "title": "Differential Activation-Based Facial Attribute Editing Using Semantic Segmentation",
        "authors": "Chongyu Gu, Maxim Gromov",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rusautocon58002.2023.10272804"
    },
    {
        "id": 27639,
        "title": "Joint Image Restoration For Weakly Supervised Semantic Segmentation",
        "authors": "Jiren Mai, Congwei Zhang, Chenning Ma, Wankou Yang",
        "published": "2023-7-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10239739"
    },
    {
        "id": 27640,
        "title": "Foundation Model Assisted Weakly Supervised Semantic Segmentation",
        "authors": "Xiaobo Yang, Xiaojin Gong",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00058"
    },
    {
        "id": 27641,
        "title": "Efficient 3D Semantic Segmentation with Superpoint Transformer",
        "authors": "Damien Robert, Hugo Raguet, Loic Landrieu",
        "published": "2023-10-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01577"
    },
    {
        "id": 27642,
        "title": "Semantic segmentation-assisted instance feature fusion for multi-level 3D part instance segmentation",
        "authors": "Chun-Yu Sun, Xin Tong, Yang Liu",
        "published": "2023-12",
        "citations": 1,
        "abstract": "AbstractRecognizing 3D part instances from a 3D point cloud is crucial for 3D structure and scene understanding. Several learning-based approaches use semantic segmentation and instance center prediction as training tasks and fail to further exploit the inherent relationship between shape semantics and part instances. In this paper, we present a new method for 3D part instance segmentation. Our method exploits semantic segmentation to fuse nonlocal instance features, such as center prediction, and further enhances the fusion scheme in a multi- and cross-level way. We also propose a semantic region center prediction task to train and leverage the prediction results to improve the clustering of instance points. Our method outperforms existing methods with a large-margin improvement in the PartNet benchmark. We also demonstrate that our feature fusion scheme can be applied to other existing methods to improve their performance in indoor scene instance segmentation tasks.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41095-022-0300-x"
    },
    {
        "id": 27643,
        "title": "Image Style Transfer based on DeepLabV3+ Semantic Segmentation",
        "authors": "Jixiang Zhang",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Image style transfer has always been a popular research method in the computer vision community, which aims to learn the style of a given image and the content distribution of other images to generate new images with both the above style and content. Thanks to the rapid development of convolutional neural networks, the accuracy, and visualization of image segmentation and migration have been continuously improved, but there is still the problem of local content distortion. Some recent works introduce the segmentation branch to obtain pixel-level content information in order to obtain a more perfect transfer effect. In this paper, we use the VGG19 convolutional neural network model to extract high-level feature maps representing image content information and perform image style transfer based on the DeepLabV3+ semantic segmentation network, which can move images to the same or similar semantic regions during the entire transmission process. In order to prevent content distortion after image migration, we also introduce an affine function to control the content change of the image during image migration. Extensive experimental results show that the method in this paper can further clarify the segmentation boundary and improve the semantic accuracy of the transferred image. In addition, we also evaluated the expectations of different individuals on the degree of style transfer. By distributing the survey, this paper demonstrates that the method described in this study results in better image quality, more in line with the expectations of the majority of respondents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v39i.6729"
    },
    {
        "id": 27644,
        "title": "Promising Semi-Supervised Semantic Segmentation Using CNN Based Pseudo-Labels",
        "authors": "Shubham Trean",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245300"
    },
    {
        "id": 27645,
        "title": "A Reversible Transformer for LiDAR Point Cloud Semantic Segmentation",
        "authors": "Perpertual Hope Akwensi, Ruisheng Wang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crv60082.2023.00011"
    },
    {
        "id": 27646,
        "title": "The Application of Semantic Segmentation on 2D images",
        "authors": "Yutong Li",
        "published": "2023-2-10",
        "citations": 0,
        "abstract": "A fundamental problem in computer vision is semantic segmentation, which calls for the algorithm to categorize each pixel in the picture and provide the precise details of the category. Semantic segmentation is being employed extensively in a variety of applications, including autonomous vehicles and medical imaging. An overview of similar semantic segmentation approaches is given in this study. First, this paper gives a brief overview of the history and vocabulary of semantic segmentation. The key datasets for semantic segmentation, conventional segmentation models, and fundamental deep learning techniques for semantic segmentation will then be covered. In particular, traditional methods centered on context models and deep learning-centered methods are discussed in detail. Finally, we review several assessment techniques, including their benefits and drawbacks, and outline the key issues facing semantic segmentation today. In addition, this study seeks to provide an overview of the relevant literature and the difficulties in semantic segmentation. Finally, the paper summarizes the semantic segmentation and prospects the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v31i.4818"
    },
    {
        "id": 27647,
        "title": "Rethinking Dilated Convolution for Real-time Semantic Segmentation",
        "authors": "Roland Gao",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00493"
    },
    {
        "id": 27648,
        "title": "Semantic segmentation-based skin cancer detection",
        "authors": "N. Renuka",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08557-3"
    },
    {
        "id": 27649,
        "title": "Image semantic segmentation using deep learning technique",
        "authors": "Yifei Fan",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "With the deepening research on image understanding in many application fields, including auto drive system, unmanned aerial vehicle (UAV) landing point judgment, virtual reality wearable devices, etc., computer vision and machine learning researchers are paying more and more attention to image semantic segmentation (ISS). In this paper, according to the different region generation algorithms, the regional classification image semantic segmentation methods are classified into the candidate region method and the segmentation mask method, according to different learning methods, the image semantic segmentation methods based on super pixels are divided into fully supervised learning method and weakly supervised learning method. The typical algorithms in these various categories are summarized and compared. In addition, this paper also systematically expounds the role of DL technology in the field of ISS, and discusses the main challenges and future development prospects in this field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/2023439"
    },
    {
        "id": 27650,
        "title": "Effects of Architectures on Continual Semantic Segmentation",
        "authors": "Tobias Kalb, Niket Ahuja, Jingxing Zhou, Jürgen Beyerer",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv55152.2023.10186597"
    },
    {
        "id": 27651,
        "title": "Development of Semantic Segmentation Based on Deep Learning",
        "authors": "Yang Zhao",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "In recent years, the discipline of computer vision has seen a lot of interest in the study of image semantic segmentation. Deep learning has grown in popularity, and deep learning and image segmentation have combined and improved. These technologies are now widely employed in autonomous vehicles, intelligent robots, and other devices. In the beginning, Fully Convolutional Networks (FCN) or U-net-based semantic segmentation techniques were proposed; FCN realized an end-to-end training network and effectively applied Convolutional Neural Networks (CNN) to the semantic segmentation domain. To improve outcomes in the field of semantic segmentation, the encoder-decoder structure from the FCN approach was later implemented, and the Atrous Convolution approach was also proposed. Transformer-based semantic segmentation techniques are another recent trend, in addition to CNN-based networks. The Transformer model was first proposed in 2017, and subsequent Transformer-based semantic segmentation methods have also achieved good results. In this paper, these various methods will be compared and discussed to provide a guidance for this field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v34i.5485"
    },
    {
        "id": 27652,
        "title": "Land Cover Classification in the Antioquia Region of the Tropical Andes Using NICFI Satellite Data Program Imagery and Semantic Segmentation Techniques",
        "authors": "Luisa F. Gomez-Ossa, German Sanchez-Torres, John W. Branch-Bedoya",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "Land cover classification, generated from satellite imagery through semantic segmentation, has become fundamental for monitoring land use and land cover change (LULCC). The tropical Andes territory provides opportunities due to its significance in the provision of ecosystem services. However, the lack of reliable data for this region, coupled with challenges arising from its mountainous topography and diverse ecosystems, hinders the description of its coverage. Therefore, this research proposes the Tropical Andes Land Cover Dataset (TALANDCOVER). It is constructed from three sample strategies: aleatory, minimum 50%, and 70% of representation per class, which address imbalanced geographic data. Additionally, the U-Net deep learning model is applied for enhanced and tailored classification of land covers. Using high-resolution data from the NICFI program, our analysis focuses on the Department of Antioquia in Colombia. The TALANDCOVER dataset, presented in TIF format, comprises multiband R-G-B-NIR images paired with six labels (dense forest, grasslands, heterogeneous agricultural areas, bodies of water, built-up areas, and bare-degraded lands) with an estimated 0.76 F1 score compared to ground truth data by expert knowledge and surpassing the precision of existing global cover maps for the study area. To the best of our knowledge, this work is a pioneer in its release of open-source data for segmenting coverages with pixel-wise labeled NICFI imagery at a 4.77 m resolution. The experiments carried out with the application of the sample strategies and models show F1 score values of 0.70, 0.72, and 0.74 for aleatory, balanced 50%, and balanced 70%, respectively, over the expert segmented sample (ground truth), which suggests that the personalized application of our deep learning model, together with the TALANDCOVER dataset offers different possibilities that facilitate the training of deep architectures for the classification of large-scale covers in complex areas, such as the tropical Andes. This advance has significant potential for decision making, emphasizing sustainable land use and the conservation of natural resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/data8120185"
    },
    {
        "id": 27653,
        "title": "A locality capacity enhancement attention network for semantic segmentation",
        "authors": "Shuyi Geng",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263332"
    },
    {
        "id": 27654,
        "title": "Blind Domain Adaptation For Semantic Segmentation via Edge Attention",
        "authors": "Ali SOLAK, Cihan TOPAL",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223801"
    },
    {
        "id": 27655,
        "title": "Evaluation of Multiclass Extraction of Representative Road Lines Found on Highway Pavement Using Supervised Semantic Segmentation Techniques and Aerial Imagery",
        "authors": "Calimanut-Ionut Cira, José-Juan Arranz-Justel, Elemer-Emanuel Şuba, Miguel-Ángel Manso-Callejo, Mircea-Emil Nap, Tudor Sălăgean",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdsa59508.2024.10467671"
    },
    {
        "id": 27656,
        "title": "A mechanical assembly monitoring method based on domain adaptive semantic segmentation",
        "authors": "Jinlei Wang, Chengjun Chen, Chenggang Dai",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00170-023-11878-0"
    },
    {
        "id": 27657,
        "title": "FetSAM: Advanced Segmentation Techniques for Fetal Head Biometrics in Ultrasound Imagery",
        "authors": "Mahmood Alzubaidi, Uzair Shah, Marco Agus, Mowafa Househ",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ojemb.2024.3382487"
    },
    {
        "id": 27658,
        "title": "VTSeg: Video Transformer for Semantic Segmentation",
        "authors": "Vasile Lup, Ion Giosan",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccp60212.2023.10398651"
    },
    {
        "id": 27659,
        "title": "Semantic segmentation using GSAUNet",
        "authors": "Sangita B. Nemade, Shefali P. Sonavane",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.icte.2022.09.007"
    },
    {
        "id": 27660,
        "title": "EPSSNet",
        "authors": "Zechun Cao, German Zavala Villafuerte, Joseph Almaznaai",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "Fast and accurate segmentation is important for robot judgement, e.g. robot detection, segmentation, and control. Most researchers have focused on deploying lightweight semantic segmentation models into robot services. The problem is that the critical interaction between semantic segmentation and boundaries is ignored. In this chapter, the authors propose a lightweight parallel execution model (EPSSNet) based on semantic flow branch (SFB), edge flow branch (EFB) and self-adapting weighting fusion (SAWF) for mobile robot service projects. The semantic flow branching module is used to obtain accurate object shape features. The boundary constraint module uses multiple convolution and upsampling to distinguish boundary features from semantic features. In order to adaptively fuse boundary features with semantic segmentation features, the SAWF is proposed. It adaptively fuses semantic and boundary features by learning boundary and semantic feature fusion weights. Detailed experimental results on Cityscapes, Pascal VOC 2012 and ADE20k datasets demonstrate the superior performance of our approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijswis.342087"
    },
    {
        "id": 27661,
        "title": "Whole Spine Segmentation Using Object Detection and Semantic Segmentation",
        "authors": "Raffaele Da Mutten, Olivier Zanier, Sven Theiler, Seung-Jun Ryu, Luca Regli, Carlo Serra, Victor E. Staartjes",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Objective: Virtual and augmented reality have enjoyed increased attention in spine surgery. Preoperative planning, pedicle screw placement, and surgical training are among the most studied use cases. Identifying osseous structures is a key aspect of navigating a 3-dimensional virtual reconstruction. To automate the otherwise time-consuming process of labeling vertebrae on each slice individually, we propose a fully automated pipeline that automates segmentation on computed tomography (CT) and which can form the basis for further virtual or augmented reality application and radiomic analysis.Methods: Based on a large public dataset of annotated vertebral CT scans, we first trained a YOLOv8m (You-Only-Look-Once algorithm, Version 8 and size medium) to detect each vertebra individually. On the then cropped images, a 2D-U-Net was developed and externally validated on 2 different public datasets.Results: Two hundred fourteen CT scans (cervical, thoracic, or lumbar spine) were used for model training, and 40 scans were used for external validation. Vertebra recognition achieved a mAP50 (mean average precision with Jaccard threshold of 0.5) of over 0.84, and the segmentation algorithm attained a mean Dice score of 0.75 ± 0.14 at internal, 0.77 ± 0.12 and 0.82 ± 0.14 at external validation, respectively.Conclusion: We propose a 2-stage approach consisting of single vertebra labeling by an object detection algorithm followed by semantic segmentation. In our externally validated pilot study, we demonstrate robust performance for our object detection network in identifying individual vertebrae, as well as for our segmentation model in precisely delineating the bony structures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14245/ns.2347178.589"
    },
    {
        "id": 27662,
        "title": "Region-Aware Semantic Consistency for Unsupervised Domain-Adaptive Semantic Segmentation",
        "authors": "Jun Xie, Yixuan Zhou, Xing Xu, Guoqing Wang, Fumin Shen, Yang Yang",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00024"
    },
    {
        "id": 27663,
        "title": "Few-Shot Segmentation and Semantic Segmentation for Underwater Imagery",
        "authors": "Imran Kabir, Shubham Shaurya, Vijayalaxmi Maigur, Nikhil Thakurdesai, Mahesh Latnekar, Mayank Raunak, David Crandall, Md Alimoor Reza",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342227"
    },
    {
        "id": 27664,
        "title": "Comparative Analysis of Segmentation Techniques for Reticular Structures",
        "authors": "Francisco Soler, Luis Jiménez, David Valiente, Luis Payá, Óscar Reinoso",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012177100003543"
    },
    {
        "id": 27665,
        "title": "Real-time semantic segmentation via mutual optimization of spatial details and semantic information",
        "authors": "Mengyuan Ma, Huiling Huang, Jun Han, Yanbing Feng, Yi Yang",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "Semantic segmentation is a pivotal task in the field of computer vision, encompassing diverse applications and undergoing continuous development. Despite the growing dominance of deep learning methods in this field, many existing network models suffer from trade-offs between accuracy and computational cost, or between speed and accuracy. In essence, semantic segmentation aims to extract semantic information from deep features and optimize them before upsampling output. However, shallow features tend to contain more detailed information but also more noise, while deep features have strong semantic information but lose some spatial information. To address this issue, we propose a novel mutual optimization strategy based on shallow spatial information and deep semantic information, and construct a details and semantic mutual optimization network (DSMONet). This effectively reduces the noise in the shallow features and guides the deep features to reconstruct the lost spatial information, avoiding cumbersome side auxiliary or complex decoders. The Mutual Optimization Module (MOM) includes Semantic Adjustment Details Module (SADM) and Detail Guided Semantic Module (DGSM), which enables mutual optimization of shallow spatial information and deep semantic information. Comparative evaluations against other methods demonstrate that DSMONet achieves a favorable balance between accuracy and speed. On the Cityscapes dataset, DSMONet achieves performances of 79.3% mean of class-wise intersection-over-union (mIoU)/44.6 frames per second (FPS) and 78.0% mIoU/102 FPS. The code is available at https://github.com/m828/DSMONet.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-235929"
    },
    {
        "id": 27666,
        "title": "Semantic Segmentation and Augmentation of salt in seismic images using Deep Learning",
        "authors": "",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/ijfans/v11/i12/215"
    },
    {
        "id": 27667,
        "title": "Extended U-Net for Satellite Image Semantic Segmentation",
        "authors": "Jin Won Jung, Yoan Shin",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10200474"
    },
    {
        "id": 27668,
        "title": "Remote Sensing Image Semantic Segmentation Method Based on a Deep Convolutional Neural Network and Multiscale Feature Fusion",
        "authors": "Guangzhen Zhang, Wangyang Jiang",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "There are many problems with remote sensing images, such as large data scales, complex illumination conditions, occlusion, and dense targets. The existing semantic segmentation methods for remote sensing images are not accurate enough for small and irregular target segmentation results, and the edge extraction results are poor. The authors propose a remote sensing image segmentation method based on a DCNN and multiscale feature fusion. Firstly, an end-to-end remote sensing image segmentation model using complete residual connection and multiscale feature fusion was designed based on a deep convolutional encoder–decoder network. Secondly, weighted high-level features were obtained using an attention mechanism, which better preserved the edges, texture, and other information of remote sensing images. The experimental results on ISPRS Potsdam and Urban Drone datasets show that compared with the comparison methods, this method has better segmentation effect on small and irregular objects and achieves the best segmentation performance while ensuring the computation speed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijswis.333712"
    },
    {
        "id": 27669,
        "title": "A review on current progress of semantic segmentation",
        "authors": "Jinqi Liu",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "Semantic segmentation, as an important task in the field of computer vision, has wide applications in image analysis and scene analysis. These application domains include autonomous driving, medical image analysis, image identification, and intelligent video surveillance. However, it faces many challenges due to the complex image structures and some confusing relationships between objects. This paper aims to provide an overview of key concepts in the field of semantic segmentation, including datasets and annotations, data augmentation, some relevant algorithms and models, and loss functions. By introducing and analyzing these concepts, we can gain a comprehensive understanding of the research progress and future directions in semantic segmentation. This paper also provides research advancements in the field of semantic segmentation. Through the introduction and analysis of these different concepts, we gain a deeper understanding of the current state and challenges of semantic segmentation. With the continuous development of deep learning techniques, we can expect semantic segmentation to have broader applications in the fields of computer vision and artificial intelligence. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/33/20230242"
    },
    {
        "id": 27670,
        "title": "Degraded Image Semantic Segmentation Using Intra-image and Inter-image Contrastive Learning",
        "authors": "Lusen Dong, Sichen Li, Jin Zheng",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10452132"
    },
    {
        "id": 27671,
        "title": "Multiclass Classification of Road Scene Traffic Images Using Semantic Segmentation",
        "authors": "Yuvraj Hembade, Arun Gaikwad, Suresh Shirbahadurkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4379996"
    },
    {
        "id": 27672,
        "title": "A serial semantic segmentation model based on encoder-decoder architecture",
        "authors": "Yan Zhou",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2024.111819"
    },
    {
        "id": 27673,
        "title": "Improving Network Architectures for Semantic Segmentation with Transformers",
        "authors": "Shuaikun Fan, Chunmei Ma",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsp58490.2023.10248916"
    },
    {
        "id": 27674,
        "title": "TransRSS: Transformer-based Radar Semantic Segmentation",
        "authors": "Hao Zou, Zhen Xie, Jiarong Ou, Yutao Gao",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10161200"
    },
    {
        "id": 27675,
        "title": "Semantic Segmentation Using Transfer Learning on Fisheye Images",
        "authors": "Sneha Paul, Zachary Patterson, Nizar Bouguila",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00068"
    },
    {
        "id": 27676,
        "title": "Semantic road segmentation using encoder-decoder architectures",
        "authors": "Burhanuddin Latsaheb, Sanjeev Sharma, Sanskar Hasija",
        "published": "2024-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-19175-y"
    },
    {
        "id": 27677,
        "title": "Deep Learning-Based Semantic Segmentation Methods for Pavement Cracks",
        "authors": "Yu Zhang, Xin Gao, Hanzhong Zhang",
        "published": "2023-3-15",
        "citations": 1,
        "abstract": "As road mileage continues to expand, the number of disasters caused by expanding pavement cracks is increasing. Two main methods, image processing and deep learning, are used to detect these cracks to improve the efficiency and quality of pavement crack segmentation. The classical segmentation network, UNet, has a poor ability to extract target edge information and small target segmentation, and is susceptible to the influence of distracting objects in the environment, thus failing to better segment the tiny cracks on the pavement. To resolve this problem, we propose a U-shaped network, ALP-UNet, which adds an attention module to each encoding layer. In the decoding phase, we incorporated the Laplacian pyramid to make the feature map contain more boundary information. We also propose adding a PAN auxiliary head to provide an additional loss for the backbone to improve the overall network segmentation effect. The experimental results show that the proposed method can effectively reduce the interference of other factors on the pavement and effectively improve the mIou and mPA values compared to the previous methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14030182"
    },
    {
        "id": 27678,
        "title": "Hadamard Layer to Improve Semantic Segmentation",
        "authors": "Angello Hoyos, Mariano Rivera",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095190"
    },
    {
        "id": 27679,
        "title": "Parameter Optimisation for Context-Adaptive Deep Layered Network for Semantic Segmentation",
        "authors": "Ranju Mandal, Brijesh Verma",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10371960"
    },
    {
        "id": 27680,
        "title": "Analysis of Training Data Augmentation for Diabetic Foot Ulcer Semantic Segmentation",
        "authors": "Arturas Kairys, Vidas Raudonis",
        "published": "2023-11-12",
        "citations": 0,
        "abstract": "Deep learning model training and achieved performance relies on available data. Diabetic foot ulcers and other image processing applications in the medical domain add another layer of complexity to training data collection. Data collection is troublesome and data annotation requires medical expertise. This problem is usually solved by employing training data augmentation. Although in previous research augmentation was facilitated in various ways, it is rarely evaluated or reported how much it contributes to achieved performance. The current research seeks to answer this question by applying individual photometric and geometric augmentation techniques and comparing the model performance achieved for semantic segmentation of diabetic foot ulcers. It was found that geometric augmentation techniques help achieve a better model performance when compared with photometric techniques. The model trained using an augmented dataset and applying a shear technique was found to improve segmentation results the most; the benchmark dice score was increased by 6%. An additional improvement over the benchmark was observed (a total of 6.9%) when the model was trained using data combining image sets generated by the three best-performing augmentation techniques. The highest test dice score achieved was 91%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12224624"
    },
    {
        "id": 27681,
        "title": "UAV sensing-based semantic image segmentation of litchi tree crown using deep learning",
        "authors": "Debarun Chakraborty, Bhabesh Deka",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apscon56343.2023.10101133"
    },
    {
        "id": 27682,
        "title": "Real-time Semantic Segmentation with Bilateral Patch Attention",
        "authors": "Minseok Kang, Minhyeok Lee, Sangyoun Lee",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic61013.2024.10457099"
    },
    {
        "id": 27683,
        "title": "Global-feature Enhanced Network for Fast Semantic Segmentation",
        "authors": "Jiayang Cheng",
        "published": "2023-10-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccasit58768.2023.10351652"
    },
    {
        "id": 27684,
        "title": "Construction of semantic pool and acquisition of semantic categories for automobile styling stance: A domain knowledge perspective",
        "authors": "Tiantian Li, Yiyu Li, Lucia Rampino",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2023.101995"
    },
    {
        "id": 27685,
        "title": "Saliency-Assisted Collaborative Learning Network for Road Scene Semantic Segmentation",
        "authors": "",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3837/tiis.2023.03.010"
    },
    {
        "id": 27686,
        "title": "Malaria detection using custom Semantic Segmentation Neural Network Architecture",
        "authors": "NATALIA WOJTAS, MICHAŁ WIECZOREK, ZBIGNIEW BEŁKOT",
        "published": "2023",
        "citations": 0,
        "abstract": "Malaria is a significant disease that affects both animals and humans. The four main Plasmodium species that cause human malaria are Plasmodium falciparum, Plasmodium vivax, Plasmodium malariae, and Plasmodium ovale. Plasmodium knowlesi, a parasite typically infecting forest macaque monkeys, was recently revealed to be able to be transmitted by anophelines and provoke malaria in humans. This provides an increasing risk of spreading the disease to areas previously unaffected with it and infecting people during the increasingly popular travels abroad. Microscopic examination remains one of the most often used methods for its laboratory confirmation. These tests, however, should be performed immediately after receiving samples from a firstcontact doctor to allow immediate therapy. This research presents a novel, semantic segmentation neural network architecture designed to quickly create a classification mask, giving the doctor information about the position, shape, and possible affiliation of detected elements. The evaluation method is based on a light microscope imagery and was created to overcome problems resulting from the human diagnosis specifics. There are 3 abstract classes containing healthy cells, cells with malaria and background. The outputted mask can be later mapped to a more readable form with the inclusion of contrasting colors, next to an original image for quick validation. Such an approach allows for semi-automatic recognition of possible disease, nevertheless still giving the final verdict to the specialist. The developed solution has achieved a high recognition accuracy of 96.65%, while the computer power requirements are kept at a minimum. The proposed solution can help reduce misclassification rates by providing additional data for the doctor and speed up the entire process with the early diagnosis made by a deep learning model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21521/mw.6804"
    },
    {
        "id": 27687,
        "title": "Toward Open-World Semantic Segmentation of Remote Sensing Images",
        "authors": "Yuxing Chen, Lorenzo Bruzzone",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10281814"
    },
    {
        "id": 27688,
        "title": "SG2Path: a two-branch semantic guided backbone network for semantic segmentation",
        "authors": "Shuang Han, Hengyu Li, Jingyi Liu, Hongzhou Wang, Yueying Wang, Shaorong Xie",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675233"
    },
    {
        "id": 27689,
        "title": "Predicting diabetes mellitus with segmentation &amp; classification techniques",
        "authors": "Srinivasa Rao Talagadadeevi, Syed Inthiyaz, Hasane Ahammad Shaik, Siva Kumar Muniswamy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0143168"
    },
    {
        "id": 27690,
        "title": "Transformer Scale Gate for Semantic Segmentation",
        "authors": "Hengcan Shi, Munawar Hayat, Jianfei Cai",
        "published": "2023-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00298"
    },
    {
        "id": 27691,
        "title": "A dynamic loss function for improved semantic segmentation",
        "authors": "Haroon Haider Khan, Majid Iqbal Khan",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08818-1"
    },
    {
        "id": 27692,
        "title": "Crack Detection Based on Semi-Supervised Semantic Segmentation",
        "authors": "Jiandong Du, Xiangyang Xu, Yueheng Wang, Yan Zhao, Jingxin Shi",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451003"
    },
    {
        "id": 27693,
        "title": "Cascaded Contextual Reasoning for Large-Scale Point Cloud Semantic Segmentation",
        "authors": "Fengyi Zhang, Xiuyu Xia",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3248963"
    },
    {
        "id": 27694,
        "title": "A Semantic Segmentation Framework for Small Objects Segmentation in Remote Sensing Images",
        "authors": "Chen Jin, Shuke He, Yunan Hou, Xuzhi He, Mingyi Wang, Gang Liu",
        "published": "2023-11-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cbase60015.2023.10439123"
    },
    {
        "id": 27695,
        "title": "Class Probability-guided Ensemble Learning-based Semantic Segmentation to Predict Cancerous Regions on Hematoxylin and Eosin-stained Images",
        "authors": "Sanghoon Lee, Sai Chandana Koganti, InChan Hwang, MinJae Woo",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc59802.2024.00014"
    },
    {
        "id": 27696,
        "title": "Automatic liver segmentation in computed tomography scans using deep semantic segmentation",
        "authors": "Kadry Ali Ezzat, Lamia Nabil Omran, Ahmed Ibrahim Bahgat El Seddawy",
        "published": "2023-2-1",
        "citations": 2,
        "abstract": "Division of the liver from figured computed tomography (CT) images is fundamental for the greater part of the PC supported clinical applications, for instance, the arranging period of a liver transfer, liver volume assessment, and radiotherapy. In this paper, a programmed liver location model from clinical CT filters utilizing profound semantic division convolutional neural organization will be introduced, this model will actually want to subsequently isolate the liver utilizing CT images. The proposed model presents simultaneously the liver ID and the probabilistic division utilizing a profound convolutional neural organization. The proposed approach was endorsed on 10 CT volumes taken from open data sets 3Dircadb1. The proposed model is totally programmed with no requirement for client mediation. Quantitative results show that proposed model is reliable and exact for hepatic volume assessment in a clinical course of action with testing exactness 98.8%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v12i1.4022"
    },
    {
        "id": 27697,
        "title": "How many appropriate added synthetic data to improve semantic segmentation?",
        "authors": "Punyapat Areerob, Chanon Khongprasongsiri, Vanee Prikboonchan, Disorn Thampithakpong",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieecon56657.2023.10127010"
    },
    {
        "id": 27698,
        "title": "Semantic-Based Clustering for 3D Instance Segmentation In Sparse Radar Point Clouds",
        "authors": "Qingwen Yuan",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdp59959.2023.00041"
    },
    {
        "id": 27699,
        "title": "MemorySeg: Online LiDAR Semantic Segmentation with a Latent Memory",
        "authors": "Enxu Li, Sergio Casas, Raquel Urtasun",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00075"
    },
    {
        "id": 27700,
        "title": "SegSemPuzzle: Solving Jigsaw Puzzles with Semantic Segmentation",
        "authors": "Miguel Silva Taciano, Victor Pugliese, Fabio Augusto Faria",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "The traditional Jigsaw Puzzle is a challenging task performed by humans, mainly due to its hardness and proven to be a NP-Complete problem. Even so, recent efforts show better performance in this task using different methods involving complex computer vision and machine learning techniques. In this sense, this paper proposes new approaches based on the semantic segmentation (SS) task to solve jigsaw puzzles (visual puzzles) in reduced training scenario. To the best of our knowledge, this is the first work in the literature that uses SS for the target application. In the performed experiments, it was possible to demonstrate that SegSemPuzzle and SegSemPuzzle-G obtained excellent results when compared with other approaches existing in literature for 3 × 3 puzzle solving tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5753/wvc.2023.27545"
    },
    {
        "id": 27701,
        "title": "ACR2UNet: Semantic Segmentation of Remotely Sensed Images using Residual-Recurrent UNet and Asymmetric Convolutions",
        "authors": "Aarabhi Putty, Annappa B",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apscon56343.2023.10101256"
    },
    {
        "id": 27702,
        "title": "3D Large Scene Semantic Segmentation System",
        "authors": "Yu-Cheng Fan, Wei-Zhe Yan, Yu-Sheng Liu",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226875"
    },
    {
        "id": 27703,
        "title": "DFNet: Towards Real-Time Semantic Segmentation with Depthwise Separable Convolution",
        "authors": "Zhiwei Huang, Luping Wang, Wuming Wu",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icid60307.2023.10396720"
    },
    {
        "id": 27704,
        "title": "Effects of different synthetic training data on real test data for semantic segmentation",
        "authors": "William Zhang, Stephan Lemmer",
        "published": "2023",
        "citations": 0,
        "abstract": "Semantic segmentation - labelling each pixel in an image to a specific class- models require large amounts of manually labeled and collected data to train. These huge datasets often are lacking in many fields such as specific weather events and climates. They also lack variety as most datasets are of city and street scenes as opposed to more rural scenes. Synthetic-to-real domain adaptation can be used to fill those gaps. Although there has been prior work on how to generate virtual data, in this paper we present insight on how features of the training data can affect the model and ultimately, the outcome. They can also provide insight on the dataset selection process. We hypothesized that different synthetic training data on real test data will affect the outcome of semantic segmentation. By testing real-world data on two iterations of a model trained by two separate virtual datasets using Python and deep learning models, we compared the results and analyzed the differences and similarities the datasets yielded for semantic segmentation. We unearthed critical insights that shed light on the dataset selection process, enabling researchers and practitioners to make more informed decisions when choosing the appropriate dataset type for semantic segmentation tasks. We contributed valuable findings, unveiling the limitations of substituting real datasets with virtual counterparts and offering guidance for dataset selection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/22-090"
    }
]