[
    {
        "id": 8701,
        "title": "Overview of neuro-linguistic programming",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-2"
    },
    {
        "id": 8702,
        "title": "Neuro-Linguistic Programming (NLP)",
        "authors": "Andrea Cordell",
        "published": "2018-8-16",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351239547-9"
    },
    {
        "id": 8703,
        "title": "Consulting with NLP",
        "authors": "Lewis Walker, Ian McDermott, John Duncan",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922"
    },
    {
        "id": 8704,
        "title": "Special situations",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-8"
    },
    {
        "id": 8705,
        "title": "Developing personally",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-9"
    },
    {
        "id": 8706,
        "title": "Gathering information",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-4"
    },
    {
        "id": 8707,
        "title": "Explanation and planning",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-6"
    },
    {
        "id": 8708,
        "title": "Closing the session",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-7"
    },
    {
        "id": 8709,
        "title": "The NLP paradigm",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-7"
    },
    {
        "id": 8710,
        "title": "NLP and OD",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-16"
    },
    {
        "id": 8711,
        "title": "Building the relationship",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-5"
    },
    {
        "id": 8712,
        "title": "Initiating the session",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-3"
    },
    {
        "id": 8713,
        "title": "Before we finish …",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-10"
    },
    {
        "id": 8714,
        "title": "Before we start …",
        "authors": "Lewis Walker",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315375922-1"
    },
    {
        "id": 8715,
        "title": "Neuro Linguistic Programming (NLP) and coaching",
        "authors": "Bruce Grimley",
        "published": "2018-11-16",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315758510-24"
    },
    {
        "id": 8716,
        "title": "NLP and the Law of Requisite Variety",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-6"
    },
    {
        "id": 8717,
        "title": "NLP as a field of applied sociology",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-2"
    },
    {
        "id": 8718,
        "title": "The Use of NLP (Neuro Linguistic Programming) at Dentistry",
        "authors": "M Murat Gozubuyuk",
        "published": "2020-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32474/ipdoaj.2020.04.000189"
    },
    {
        "id": 8719,
        "title": "Pelatihan Neuro Linguistic Programming (NLP) untuk Meningkatkan  Kepercayaan Diri",
        "authors": "Nur Khumaidatuz Zahro",
        "published": "2018-10-4",
        "citations": 0,
        "abstract": "AbstractÂ Â Â  This study aims to examine the effectiveness of NLP (Neuro Languistic Programming) training in increasing adolescent self-confidence. This study uses an experimental approach with a quasi-experimental research design. The research subjects were taken by purposive sampling technique with the condition of low self-confidence. The data collection technique used is the confidence scale. Data analysis techniques used in this study used the analysis of independent sample test using Mann-Whitney. The results of the study based on the Independent Sample Test analysis obtained t value of 6.439 with a significance of 0.000 (p <0.05). This shows that the respondents' confidence varies significantly. So it is known that the mean of the experimental group is higher than the control group (36.04> 12.96). This shows that NLP (Neuro Languistic Programming) training is effective significantly to increase the confidence of adolescents who experience self-confidence barriers.Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â  Keywords: NLP training, self-confidence, education levelÂ ",
        "link": "http://dx.doi.org/10.30996/persona.v6i1.1629"
    },
    {
        "id": 8720,
        "title": "Penerapan Neuro Linguistic Programming (Nlp) dalam Kecerdasan Emosional untuk Keberhasilan Siswa",
        "authors": "Asep Sutisna Sanjaya",
        "published": "2022-9-23",
        "citations": 1,
        "abstract": "Tujuan penelitian ini yaitu untuk menemukan kebenaran melalui penerapan neuro linguistic programming dalam kecerdasan emosional dapat meningkatkan keberhasilan siswa. Hasil dalam best practices ini adalah kualitatif dari hasil atau efek dari keberhasilan perubahan tingkah laku pada siswa, dan kuantitatif untuk mengukur keberhasilan dalam bidang akademiknya yang merupakan pengaruh dari penerapan neuro linguistic programming dalam kecerdasan emosional siswa.Pelaksanaan pada best practices ini adalah seluruh siswa kelas VI C yang merupakan siswa sendiri yang setiap hari saya ajar. Dilaksanakan di SDN Pisangan Baru 01, yang berlokasi tepatnya di Jalan Jendral Ahmad Yani No. 30 Kelurahan Pisangan Baru Kecamatan Matraman Kota Administrasi Jakarta Timur. Dengan penerapan neuro linguistic programming  dalam kecerdasan emosional siswa mempunyai hasil secara Kualitatif (1) Lebih mengenal siapa dirinya, dimana dirinya, dan mau kemana dirinya (2) Memiliki arti hidup (3) Mengenal apa tujuan hidupnya dan apa yang harus dilakukannya (4) Tau bagaimana cara memperlakukan orang di sekitarnya, temannya, adik kelasnya, gurunya, orang tuanya bahkan orang lain yang ia temukan (5)Lebih peka terhadap apa yang terjadi di sekelilingnya (6)Lebih memaknai hidup, sedangkan secara Kuantitatif ada peningkatan hasil belajarnya dengan rata-rata nilai Ilmu Pengetahuan Alam 73,70 yang sebelumnya rata-rata nilai 63,20.",
        "link": "http://dx.doi.org/10.46799/jst.v3i09.616"
    },
    {
        "id": 8721,
        "title": "MENURUNKAN MASALAH MENYUSUI DENGAN METODE NLP  (NEURO LINGUISTIC PROGRAMMING)",
        "authors": "Rahayu Widaryanti, Lestariningsih Lestariningsih",
        "published": "2022-11-27",
        "citations": 0,
        "abstract": "Latar belakang: Menyusui mempunyai banyak manfaat baik bagi bayi maupun ibu, meskipun mempunyai banyak manfaat namun kenyataannya tingkat menyusui secara global belum mencapai durasi yang disarankan. Penyebab kegagalan ASI eksklusif yaitu karena persepsi ASI yang tidak cukup, radang payudara serta ibu terinfeksi Covid-19, ibu bekerja. Tujuan: Untuk memberikan dukungan upaya lain yang dapat dilakukan untuk mengurangi masalah kecemasan dan ketidakpercayaan diri ibu menyusui adalah menggunakan metode Neuro Linguistic Programming (NLP). Metode : Desain penelitian menggunakan quasi eksperimen dengan pendekatan one group pre post test design. Populasi Penelitian ini adalah ibu menyusui yang memiliki balita usia 0-12 bulan sejumlah 15 peserta yang berdomisili di Provinsi D.I.Y. Pengumpulan data dilakukan dengan melakukan pre-test kemudian pemberian intervensi selanjutnya melakukan post test sesaat dan setelah 3 hari pasca terapi. Hasil: Masalah yang sering muncul adalah Sindroma ASI Kurang (80%), Putting lecet dan sakit saat menyusui 13,33% dan Cemas karena Covid-19 (6,67%). Persepsi tentang banyaknya ASI sebelum dilakukan terapi NLP sebagian besar (80%) klien mengalami syndrome ASI kurang dan setelah dilakukan terapi dengan metode NLP menggunakan teknik submodality dan anchoring dilakukan evaluasi sesaat dan 3 hari pasca terapi sebagian kecil (13.33%) mengatakan ASI belum keluar banyak. Kesimpulan: Metode NLP dengan teknik submodality dan anchoring dapat menurunkan masalah menyusui.",
        "link": "http://dx.doi.org/10.35842/mr.v17i4.784"
    },
    {
        "id": 8722,
        "title": "Pengaruh Metode Neuro Linguistic Programming (NLP) terhadap Kemampuan Menulis Teks Nnaratif",
        "authors": "Sahrina Nasution, Fitra Audina",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "<p> Peneliti menyumpulkan hasil pengamatan dan materi, mulai dari penerapan metode kepada kemampuan menulis teks naratif siswa mendapatkan perbedaan hasil nilai Tengah post test kemampuan menulis teks naratif ruang percobaan yang menggunakan metode neuro linguistik ukreming atau NLP dengan ruang pengaturan yang menggunakan metode ekspositori yaitu nilai hasil pertengahan postes selesai eksperimen jauh lebih baik daripada ruang pengaturan nilai 70,81 adalah hasil nilai pertengahan kemampuan menulis teks naratif oleh kelas eksperimen dan 65,2 ialah nilai post test pertengahan kemampuan menulis teks naratif oleh ruang pengaturan.</p>",
        "link": "http://dx.doi.org/10.30821/eunoia.v3i2.3019"
    },
    {
        "id": 8723,
        "title": "Neuro-linguistic programming: A review of NLP research and the application of NLP in coaching",
        "authors": "Jonathan Passmore, Tatiana Rowson",
        "published": "2019",
        "citations": 10,
        "abstract": "The huge popularity of neuro-linguistic programming (NLP) over the past three decades has in some ways mirrored the growth in coaching psychology. This paper is part of a series of four papers in a special issue within ICPR that aims to explore NLP coaching from diverse perspectives, offering personal insights or reviews of evidence. As part of this process a pair of authors were invited to advance the case for and the case against NLP. This paper aims to adopt a critical stance; reviewing the concept of NLP, exploring the claims made by advocates and critically reviewing the evidence from a psychological perspective. In undertaking this review we completed a series of literature searches using a range of discovery tools to identify research papers, based on pre-determined search criteria. This review led us to the conclusion that unique NLP practices are poorly supported by research evidence.",
        "link": "http://dx.doi.org/10.53841/bpsicpr.2019.14.1.57"
    },
    {
        "id": 8724,
        "title": "Neuro-linguistic Programming and its Applicability in EFL Classrooms: Perceptions of NLP-Trained English Teachers",
        "authors": "Mitra Rayati",
        "published": "2021-12",
        "citations": 0,
        "abstract": "The present study is an attempt to examine the applicability of NLP techniques in English Language Teaching (ELT), an under-investigated topic in the literature on EFL contexts. The researcher also attempts to examine the extent to which Iranian EFL instructors in language schools implement NLP techniques in their classrooms. In an effort to achieve the research aims, a sixteen-hour NLP training workshop for 20 conveniently chosen inservice EFL instructors was designed and held by the author. The workshop aimed at helping the participants to achieve a working knowledge of the concept of NLP. Prior to conducting the workshop, in order to gain a better understanding of the participants’ needs and the benefits of the implementation of the training program in teachers’ instructional practices, 60 class sessions of the 20 teachers were observed using a researcher-made observation checklist. To identify any changes in the teachers’ pedagogical skills and to assess any perceived learning outcomes from participating in the workshop, the researcher repeated the observations almost seven months after the last session of the workshop. Subsequently, in-depth semi-structured interviews were carried out to explore the teachers’ perceptions of the topic under investigation. According to the findings of the thematic analysis, almost all the EFL teachers used NLP techniques to varying degrees in their language classes. The results of this study, provided at the end of the article, offer some valuable suggestions for different stakeholders in the field.",
        "link": "http://dx.doi.org/10.32038/ltrq.2021.24.03"
    },
    {
        "id": 8725,
        "title": "Neuro-Linguistic Programming (NLP)",
        "authors": "Allan J. Katz, Mary Hickam Bellofatto",
        "published": "2018-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351183345-27"
    },
    {
        "id": 8726,
        "title": "How Japanese managers use NLP in their daily work",
        "authors": "Yasuhiro Kotera, William Van Gordon",
        "published": "2019-7-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b22180-3"
    },
    {
        "id": 8727,
        "title": "Effect of Neuro-Linguistic Programming (NLP) on Anxiety: A Systematic Literature Review",
        "authors": "Rifki S. Nompo, Andria Pragholapati, Angela L. Thome",
        "published": "2021-3-15",
        "citations": 5,
        "abstract": "Anxiety is a feeling of helplessness, and worry about things that are not clear, as well as a comprehensive feeling that something bad is going to happen. Anxiety is experienced subjectively and communicated interpersonally, at the same time feelings of anxiety are a necessary survival instinct. The Neuro-Linguistic Programming (NLP) is a communicative approach employs a positive view of anxiety and how it can help shape life changes, and that is the topic of this article. This research method uses a Systematic Literature Review, investigating Garuda, Pubmed, ScienceDirect, and Proquest, using boolean for keyword neurolinguistics programming (NLP) and anxiety. The inclusion criteria used were Indonesian and English language articles written within the last 5 years (from 2015 until 2020). The exclusion criteria used by the article were abstract writing style, inaccessible, or lacking national accreditation. Articles were tested with Critical Appraisal Tools. The studies indicate that good communication using NLP can help reduce anxiety and can promote changes in a person’s behavior patterns. There are several NLP techniques including sensory acuity, reframing, anchoring, rapport, and pacing, and leading. NLP can improve knowledge, skills and attitudes, communication skills, self-management, mental health, reduce work stress, and self-efficacy.\r\n \r\nKeywords: Anxiety, Neuro-Linguistic Programming, NLP",
        "link": "http://dx.doi.org/10.18502/kls.v6i1.8640"
    },
    {
        "id": 8728,
        "title": "Pengembangan modul hipno-Neuro Linguistic Programming (NLP) untuk mengatasi stage fright Mahasiswa",
        "authors": "Rapikah Rapikah, Casmini Casmini",
        "published": "2020-11-24",
        "citations": 1,
        "abstract": "<p class=\"Normal1\"><em>Stage fright </em>sebagai sebuah masalah yang sering kali dialami oleh mahasiswa baru dapat menghambat mahasiswa dalam menjalankan tugas lapangan pada proses perkuliahan dan dalam proses menyampaikan materi di dalam kelas. Dalam peneitian ini, metode penelitian yang digunakan adalah metode penelitian R&amp;D, peneliti mengembangkan sebuah panduan terapi yang menggabungkan teknik hipnosis dan <em>Neuro Linguistic Programming</em> (NLP) yang diujicobakan kepada Mahasiswa baru UIN Sunan Kalijaga. Hasil uji coba dari modul panduan tersebut menunjukkan bahwa <em>satge fright</em> dapat diminimalisir dengan <em>hypnosis</em> dan NLP yang dalam penelitian ini berfungsi sebagai media untuk memasukkan nilai baru kepada klien dengan menggunakan pengembangan model Hipno-NLP untuk membuat bentuk <em>anchor</em> baru yang bertujuan mengatasi <em>stage </em>fright.</p><p align=\"center\"><br /><strong><em></em></strong><em></em></p><p><em> <em></em><strong><em></em><em>Abstract</em></strong>: Stage fright as a problem that is oftentimes be experienced by new college students is obstructive in obeying assignment of study, either field assignment or presenting assignment in class. This research used Research and Development method and developed a therapeutic guide which combines hypnosis and Neuro Linguistic Programming (NLP) techniques and were tested on new students of UIN Sunan Kalijaga. The trial results of the guide module indicate that there is a significant effect on the subjects within both of these tools serve as a medium for entering new values to clients by using the development of the Hipno-NLP model to create new anchor that aim to overcome the stage fright</em></p>",
        "link": "http://dx.doi.org/10.25273/counsellia.v10i2.5816"
    },
    {
        "id": 8729,
        "title": "SPEECH THERAPY MODEL BASED ON NEURO LINGUISTIC PROGRAMMING (NLP): OPTIMIZATION OF DEAF                   SPEECH ABILITY",
        "authors": "Sakaria Sakaria, Asia M",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "This study aims to describe the feasibility and effectiveness of a Neuro Linguistic Programming (NLP) based speech therapy model. The speech therapy model was developed using the Borg and Gall model at Makassar State SLB through the stages of research and information gathering, planning, development of initial product forms, and preliminary field trials. Data from expert validation results were analyzed using descriptive statistics, and data on the ability to speak with the deaf was analyzed using inferential statistical tests (t-test paired samples). The results of the study indicate that the developed speech therapy model is appropriate and effective for use in speech therapy for the deaf. The feasibility speech therapy model is used because it meets the feasibility aspects, namely the feasibility of supporting theory, the feasibility of orientation and goals, the feasibility of the reaction principle, the feasibility of therapeutic procedures, the feasibility of support systems, and the feasibility of implementing therapy. Speech therapy models based on Neuro Linguistic Programming (NLP) can improve the ability of the deaf to pronounce and understand the meaning of vocabulary and reduce anxiety when speaking.",
        "link": "http://dx.doi.org/10.26858/retorika.v16i1.46721"
    },
    {
        "id": 8730,
        "title": "Analysis of Success of Mobilization to Terror Using Tools of Neuro-Linguistic Programming (NLP)",
        "authors": "Marina Shorer-Zeltser, Galit M. Ben-Israel",
        "published": "2019",
        "citations": 0,
        "abstract": "The current research is dedicated to put forward the ways the Internet surfers are mobilized for the aims of illegal and harmful actions and even terror. We introduced usage of a psychological-linguistic approach known as NLP (Neuro-Linguistic Programming) which constructs new realities and a fast shift in the behavior of the treated subjects after the beginning of the exposure. This approach is not accepted widely in academic circles yet its tools are frequently used by security forces for interrogations, hostages incidents and evidences collection. In the recent years the data on mobilization for illegal actions and even for terror intends continues to grow and this article is our modest attempt to shed a light and to simulate and analyze the content environment of the surfers exposed to the substance of the sites propagating terror. Using NLP techniques, the article analyzes Muslim Internet sites which are perceived to belong to different groups and communities. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-7119-3.ch006"
    },
    {
        "id": 8731,
        "title": "The Effect of Neuro-Linguistic Programming (NLP) on Reading Comprehension in English for Specific Purposes Courses",
        "authors": "Fahimeh Farahani",
        "published": "2018-1-31",
        "citations": 4,
        "abstract": "Neuro-Linguistic Programming (NLP) has potential to help language learners; however, it has received scant attention. The present study was an attempt to investigate the effect of NLP techniques on reading comprehension of English as a Foreign Language (EFL) learners at an English for Specific Purposes (ESP) course. To achieve this goal, two intact classes of students were selected to form an experimental group (n=30) and a control group (n=30). A reading pretest (based on the course content) was given to all participants. The sensory learning styles of the participants were diagnosed using Reid's (1987) leaning style questionnaire, and the participants in the experimental group were familiarized with NLP techniques to be able to implement these techniques in their reading. In the control group, the conventional approach to teach ESP reading was used. Considering the analysis of posttest results through ANCOVA, it was found that implementation of NLP techniques can have significant effect on reading comprehension of Iranian undergraduate EFL learners. Pedagogical implications are discussed.",
        "link": "http://dx.doi.org/10.7575/aiac.ijels.v.6n.1p.79"
    },
    {
        "id": 8732,
        "title": "Analytical Study of the Relationship between Spirituality, Sufism, Muraqaba and Neuro-Linguistic Programming (NLP)",
        "authors": "Hafiza Ambreen Fatima, Sami Ullah",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "This paper aims to explore the common principles and concepts between Sufism, a mystical branch of Islam focused on spiritual growth and divine connection, and Neuro-Linguistic Programming (NLP), a psychological approach rooted in the exploration of human consciousness, personal transformation, and effective communication techniques. By understanding the shared connection between the two, we can gain a deeper understanding of both thereby highlighting the interactions between these two areas that offer the tools, practices, and perspectives to enhance self-awareness, personal growth, and spiritual development. By analysing the works of scholars including William Chittick, Reynold A. Nicholson, and Carl Ernst, this paper aims to shed light on the potential connections and overlaps between NLP, Sufism and The findings indicate a significant alignment between NLP and Sufism, particularly in terms of their core principles concerning human consciousness, communication, and personal transformation. This invites reflection on the sixth sense bestowed by Allah, as described in Sufi teachings. The research methodology involves a comprehensive literature review, examining relevant texts and scholarly articles to identify shared aims, principles, and practices adopted by NLP and Sufism and the significance of practices such as Muraqaba, Silva and Tasawwuf.",
        "link": "http://dx.doi.org/10.54692/abh.2023.08312017"
    },
    {
        "id": 8733,
        "title": "Yabancı Dil Olarak Türkçe Öğretiminde Alternatif Bir Model Önerisi: Neuro-Linguistic Programming (NLP)",
        "authors": "Prof. Dr. Fahri TEMİZYÜREK, Yasin KANAL",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29228/ijlet.62662"
    },
    {
        "id": 8734,
        "title": "The Impact of Neuro-Linguistic Programming on English Language Teaching: Perceptions of NLP-Trained English Teachers",
        "authors": "Muhammed Salim Keezhatta",
        "published": "2019-11-24",
        "citations": 3,
        "abstract": "This study aims at exploring the feasibility of Neuro-Linguistic Programming (NLP) in English Language Teaching (ELT) by analysing the perceptions of NLP-trained English teachers. The study applied a qualitative method based on interviews with 20 NLP-trained English teachers of high schools in India. To acquire an in-depth perspective of the extensive and comprehensive material available, the interview comprised open-ended detailed questions on the innovation, role, different techniques, and benefits and limitations of NLP, while also dwelling upon the different perceptions of NLP-trained language teachers, motivations of the learners towards NLP, and the positive changes brought about by NLP in the education sector. The researcher used a manual thematic analysis method to identify similarities in pattern while performing the analysis. Also, reliable studies from verifiable sources were selected for further analysis. Findings showed that NLP facilitated communication and encouraged learners of English. In addition, the finding strongly suggests NLP as an effective tool for developing teacher-student relationship and for promoting interactive learning environment. ",
        "link": "http://dx.doi.org/10.5539/ijel.v9n6p454"
    },
    {
        "id": 8735,
        "title": "Examining the Effectiveness of Neuro-Linguistic Programming (NLP) techniques in improving Emotional Intelligence (EI) scores",
        "authors": "Kamarul Zaman Bin Ahmad",
        "published": "2019-4-8",
        "citations": 0,
        "abstract": "Purpose – Whether selected NLP techniques can improve EI scores. (Although there are many self-development training courses advertised on the internet claiming to be able to improve EI, yet no credible research has been published in peer-reviewed academic journals to show whether such techniques can improve EI.)Design/methodology/approach - This experimental research involved 35 test subjects and 35 control group subjects. Measurements were taken just before and just after the experiments in the test group and compared the results with the control group.Findings –Statistical t-tests revealed that with the test group, there were significant improvements in EI scores after undergoing the training compared with before. There were no significant changes in the control group.Originality/value - Since, Ahmad (2011) who looked at the effectiveness of the alternative techniques of NLP, Time Line Therapy®, and Hypnosis, there has been no further research regarding the effectiveness of NLP. Research limitations/implications - This study improves the study by Ahmad (2011) by ensuring that most of the respondents were not self-selected and ensured the use of other NLP techniques, in the context of improving EI.Paper type - Research paperKeywords: Emotional Intelligence, Neuro-Linguistic Programming, Experiments",
        "link": "http://dx.doi.org/10.30585/jrems.v1i1.313"
    },
    {
        "id": 8736,
        "title": "Case Study: Meta Model of Neuro Linguistic Programming (NLP) as an effective mode of therapy for Moderate Depression",
        "authors": " Taniya Ahuja",
        "published": "2018-9-30",
        "citations": 0,
        "abstract": "Aim: The present case study looks at the effectiveness of Meta Model of Neuro Linguistic Programming (NLP) for therapeutic treatment of Clinical Depression. Method: The present case-study is a qualitative research on 18 years old teenager, clinically diagnosed with Moderate Depression using Beck’s Depression Inventory-II, and received Neuro Linguistic Programming Sessions thrice a week over a duration of 2 months (18 sessions – 60 minutes each). Evaluation was done by comparing the scores of Becks Depression Inventory-II at the time of joining with progress at 2 months of therapeutic treatment. Comparisons were made for Depressed Mood, Loss of interest & Enjoyment, increased fatigability, performance in Work related activities and Social Engagements, and Worries. Techniques of Meta Model were used for delivering therapeutic treatment. Results: The BDI-II score recorded at the time of joining was 29 and at the end of18thsession, the scores dipped down to 10. Hence, result evidenced that consistent application and training of techniques of Meta Model (Neuro Linguistic Programming) can be used as an effective treatment of moderate depression.",
        "link": "http://dx.doi.org/10.25215/0603.86"
    },
    {
        "id": 8737,
        "title": "NEURO-LINGUISTIC PROGRAMMING (NLP) AS A CUPPING MEDIA: A Living Hadith Discourse",
        "authors": "Ahmad Murtaza MZ, Subi Nur Isnaini, Satria Tenun Syahputra",
        "published": "2023-1-26",
        "citations": 0,
        "abstract": "<p class=\"06IsiAbstrak\">As a method of traditional medicine, cupping began to be in great demand by the public. Of course, this is an interesting phenomenon to be discussed. With the development of science, especially in the field of therapy, cupping is combined with modern communication techniques, namely Neuro-Linguistic Programming (NLP). The attempt to combine cupping with NLP is a novelty aspect in the study of cupping. This practice is carried out at Kopsen Rumah Sehat Thibbunnabawi, one of the few cupping clinics that use NLP techniques as a medium. Therefore, this article examines how Neuro-Linguistic Programming becomes a medium used in cupping practice. This research is a type of qualitative research using a phenomenological approach. Data collection methods used are interviews, observation, and documentation. Using the descriptive analysis method, there were five research informants, consisting of one therapist and four patients. This study found that: first, understanding of text internalization from cupping hadiths is still limited to the patient’s educational background or practical experience of each individual. Thus, various reasons from patients believe in cupping as a treatment. Second, the application of NLP as a cupping medium makes patients more comfortable and confident in doing therapy. Third, the application of NLP might be a solution so that patients who come are healed physically and psychologically.</p><p class=\"07KatakunciKeywords\">[Sebagai metode pengobatan tradisional, bekam mulai banyak diminati masyarakat. Tentu ini menjadi fenomena yang menarik untuk di diskusikan dan dikaji. Terlebih seiring berkembangnya ilmu pengetahuan terkhusus dalam bidang terapi, bekam dipadukan dengan teknik komunikasi modern yakni Neuro Linguistic Programming (NLP). Upaya untuk memadukan antara bekam dengan NLP merupakan aspek kebaharuan dalam ranah kajian mengenai bekam. Praktik seperti ini dilakukan di Kopsen Rumah Sehat Thibbunnabawi menjadi salah satu dari sedikit klinik bekam yang menggunakan teknik NLP sebagai medianya. Oleh karenanya, artikel ini mengkaji bagaimana Neuro Linguistic Programming menjadi media yang digunakan dalam praktik bekam. Penelitian ini merupakan jenis penelitian kualitatif dengan menggunakan pendekatan fenomenologis. Metode pengumpulan data yang digunakan yaitu wawancara, observasi, dan dokumentasi. Informan penelitian berjumlah 5 orang, terdiri dari 1 orang terapis, dan 4 pasien. Dengan menggunakan metode analisis deskriptif. Penelitian ini menemukan bahwa: pertama, pemahaman mengenai internalisasi teks dari hadis berbekam masih sebatas latar belakang pendidikan pasien ataupun pengalaman empiris dari tiap individu. Sehingga beragam alasan dari pasien meyakini bekam sebagai sebuah pengobatan. Kedua, pengaplikasian NLP sebagai media bekam menjadikan pasien lebih nyaman dan percaya diri untuk melakukan terapi. Ketiga, penerapan NLP mungkin bisa menjadi solusi agar pasien yang datang tidak hanya sembuh secara fisik namun sembuh pula dari segi psikologis.]</p>",
        "link": "http://dx.doi.org/10.21043/riwayah.v8i2.15021"
    },
    {
        "id": 8738,
        "title": "The Development of Story Methods in Learning Islamic Education Based on NLP (Neuro-Linguistic Programming) in Elementary Schools",
        "authors": "Muh Zulfikar Amar",
        "published": "2020-6-6",
        "citations": 0,
        "abstract": "The purpose of this study was to determine the results of the analysis of the need for PAI learning methods in grade V students at SDN 50 Bulu 'datu Palopo, to find out the validity of developing NLP-based story methods in PAI learning and assessing the effectiveness of NLP-based story methods in PAI learning. This research method is the Research & Development (R&D) method. The development model used is ADDIE which consists of five stages, namely: Analysis, design, development, implementation, and evaluation. Research subjects in class V SDN 50 Bulu 'Datu Palopo amounted to 15 students. Data collection techniques are questionnaires, documentation, observation, interview, and validation. Data analysis techniques to test their validity using the Aiken's formula and student questionnaire responses using descriptive statistical analysis. The results of this study indicate that in learning PAI especially the material of the stories of the Prophet and the Apostle needed the development of learning methods namely the NLP-based story method. The NLP-based story method developed was declared valid by three validators with a recapitulation of 0.67. Learning methods have been effective in using students' questionnaire responses.",
        "link": "http://dx.doi.org/10.24256/pijies.v3i1.1248"
    },
    {
        "id": 8739,
        "title": "Terapi Neuro Linguistic Programming (NLP) untuk meningkatkan resiliensi pada remaja dengan Non-Suicidal Self Injury (NSSI)",
        "authors": "Niken Titi Pratitis, Sabella Sacharissa Azalia",
        "published": "2020-12-25",
        "citations": 0,
        "abstract": "Abstract Adolescents with non-suicidal self-injury (NSSI) are vulnerable to resilience or resilience to their problems. Resilience is an important part for adolescents to have in order to overcome their problems. One of the psychological interventions that can be done is to increase resilience by using the Neuro-Linguistic Therapy Program (NLP), in which this therapy focuses on thinking patterns and information processing so that adolescents can practice independently when the desire to hurt themselves arises. This study aims to determine the effectiveness of NLP therapy to increase the resilience of adolescents with NSSI. This research is a quantitative study using a pre-experimental design approach with one group pretest-posttest design. The data collection method used was the Self-Harm Behavior Questionnaire (SHBQ) scale to determine the NSSI behavior in adolescents, and to use a resilience scale before and after therapy to measure the results of NLP therapy treatment. Participants in this study were students with NSSI behavior consisting of three female students and two male students. The results showed that NLP therapy was effective in increasing the resilience of students with NSSI. The implications and limitations of the study are discussed.Keywords: Adolescent Resilience; Neuro Linguistic Programming Therapy; Non-Suicidal Self Injury. AbstrakRemaja dengan non-suicidal self-injury (NSSI) rentan dengan ketahanan atau resilien dalam menghadapi permasalahannya. Resilien menjadi bagian penting untuk dimiliki remaja agar dapat mengatasi permasalahannya. Salah satu Intervensi psikologi yang bisa dilakukan adalah meningkatkan resiliensi dengan menggunakan terapi Neuro Linguistic Program (NLP), yang mana terapi ini berfokus pada pola pikir dan pengolahan informasi sehingga remaja dapat mempraktikkan secara mandiri di saat keinginan untuk menyakiti diri sendiri muncul. Penelitian ini bertujuan untuk mengetahui efektivitas terapi NLP untuk meningkatkan resiliensi remaja dengan NSSI. Penelitian ini berupa penelitian kuantitatif menggunakan pendekatan pre-experimental design dengan one group pretest posttest design. Metode pengumpulan data yang digunakan adalah skala Self Harm Behaviour Questionnare (SHBQ) untuk mengetahui perilaku NSSI pada remaja, serta menggunakan skala resiliensi sebelum terapi dan sesudah terapi untuk mengukur hasil dari perlakuan terapi NLP. Partisipan dalam penelitian ini adalah siswa yang memiliki perilaku NSSI yang terdiri dari tiga siswi perempuan dan dua siswa laki-laki. Hasil penelitian menunjukkan bahwa Terapi NLP efektif meningkatkan resiliensi siswa dengan NSSI. Implikasi dan keterbatasan penelitian dibahas.Kata Kunci: Non-Suicidal Self Injury; Resiliensi Remaja; Terapi Neuro Linguistic Programming",
        "link": "http://dx.doi.org/10.30996/persona.v9i2.4099"
    },
    {
        "id": 8740,
        "title": "Improving Emotional Intelligence (EI) using Neuro Linguistic Programming (NLP) techniques",
        "authors": "Kamarul Zaman Ahmad",
        "published": "2017-12-24",
        "citations": 1,
        "abstract": "Since, Ahmad (2011) who looked at the effectiveness of the alternative techniques of NLP, Time Line Therapy®, and Hypnosis, there has been no further research regarding the effectiveness of NLP. This study improves the said research by ensuring that most of the respondents were not self-selected and ensured the use of other NLP techniques, in the context of improving EI. Although there are many self-development training courses advertised on the internet claiming to be able to improve EI, yet no credible research has been published in peer-reviewed academic journals to show whether such techniques can improve EI. This experimental research involved 35 test subjects and 35 control group subjects. Statistical t-tests revealed that with the test group, there were significant improvements in EI scores after undergoing the training compared with before. There were no significant changes in the control group.\r\nKeywords: Emotional Intelligence, Neuro Linguistic Programming, Experiments",
        "link": "http://dx.doi.org/10.30585/icabml-cp.v1i1.19"
    },
    {
        "id": 8741,
        "title": "The Application of Neuro Linguistic Programming (NLP) on Cognitive Function and Stress Reduction",
        "authors": "Deni Hendriana, Komarudin Komarudin, Raden Boyke Mulyana",
        "published": "2021-6-22",
        "citations": 1,
        "abstract": "An approach or analysis of a problem that is expressed in the description of cognitive function and the reduction in stress levels experienced by athletes as a result of a pandemic situation so that there is no decrease in athlete's performance, several alternatives are needed that can maintain the athlete's condition. Based on the problems mentioned, the aim of this research is to evaluate the application of Neuro-Linguistic Programming (NLP) on cognitive function and stress reduction of basketball athletes. The method used in this research is the experimental method. The population in this study was 25 athletes in the sport of basketball at the Crows club. The number of samples is the total population of 25 athletes and the technique used is purposive sampling. The instrument for cognitive function uses the Montreal Cognitive Assessment (MoCA) and the instrument used for the level of stress is the DASS-21 Questionnaire (Depression Anxiety Stress Scale) developed by Lovibond. S. H and Lovibond. P. H (1995). The results of the study regarding the effect of the application of Neuro-Linguistic Programming (NLP) on cognitive function and stress levels can be concluded that there is a significant effect indicated by a significance value (sig.) Of 0.000, less than 0.05 (0.000 <0.05). The different test between the application of Neuro-Linguistic Programming (NLP) on cognitive function and stress reduction found that there was a difference in the effect between the application of Neuro-Linguistic Programming (NLP) on cognitive function and stress reduction marked with a 2-way (t-tailed) significance value of 0.000 < 0.05. Overall, the conclusion of this study is that the application of psychological training, especially the use of the Neuro-Linguistic Programming (NLP) method have positive effect on cognitive function and stress levels of basketball athletes during the COVID-19 pandemic.",
        "link": "http://dx.doi.org/10.26858/cjpko.v13i2.20793"
    },
    {
        "id": 8742,
        "title": "Pelatihan Membangun Karakter Anak dengan NLP (Neuro Linguistic Programming) Untuk Anggota TP-PKK Desa Kumutug Lor, Banyumas",
        "authors": "Ade Tuti Turistiati, Angel Septia Anggreani, Eyora Jasmine Nan Kinasih",
        "published": "2021-6-17",
        "citations": 0,
        "abstract": "ABSTRAKPembelajaran secara daring di masa pandemi Covid-19 seringkali membuat komunikasi antara orang tua dan anak menjadi masalah. Orang tua menganggap anaknya lebih banyak menghabiskan waktu menggunakan gadget untuk keperluan di luar belajar, seperti untuk bermain games, menonton tayangan di kanal Youtube, berinteraksi  dengan teman melalui media sosial, dan berselancar mengakses berbagai informasi.  Anak-anak berdalih bahwa gadget-nya digunakan untuk keperluan belajar. Ketegangan hubungan dan miskomunikasi antara orang tua dan anak pun sering terjadi karena adanya perbedaan persepsi tersebut. Orang tua berharap anak-anaknya mempunyai karakter yang baik.  Kegiatan pengabdian pada masyarakat ini bertujuan untuk membantu anggota Tim Penggerak-PKK desa Kemutug Lor, Banyumas dalam membangun karakter anak dengan presuposisi NLP.  Dosen sebagai Fasilitator dibantu 2 orang mahasiswa memberikan materi pelatihan kepada TP-PKK yang berjumlah 25 orang.  Materi pelatihan disampaikan secara interaktif. Fasilitator melibatkan peserta dalam sharing, diskusi, role play, dan perenungan untuk evaluasi dan perbaikan diri. Berdasarkan evaluasi pasca pelatihan, peserta menyatakan bahwa mereka merasakan manfaat praktis dari pelatihan ini.  Mereka mempunyai bekal pengetahuan dan tips berkomunikasi dengan presuposisi NLP yang telah dipahami dan akan dipraktikkan dalam kehidupan sehari-hari dalam membangun karakter anak.Kata kunci: Komunikasi; Membangun Karakter; Pelatihan; NLP ABSTRACTOnline learning during the Covid-19 pandemic often makes communication between parents and children a problem. Parents consider their children to spend more time using gadgets not for learning purposes, such as playing games, watching various programs via YouTube channel, interacting with friends via social media, and browsing various information. The children argued that their gadgets were used for learning purposes. Relationship tensions and miscommunication between parents and children often occur because of these different perceptions. Parents hope their children have good character. This community service activity aims to help the members of the Kemutug Lor Village TP-PKK Team, Banyumas in building children's character with the NLP presupposition. Lecturer as a facilitator, assisted by 2 students, provided training materials to 25 members of TP-PKK. The training material is delivered interactively. The facilitator engaged participants in sharing, discussion, role play, and reflection for self-evaluation and improvement. Based on the post-training evaluation, participants stated that this training is very practical. They have the knowledge and tips to communicate using the NLP presuppositions that have been understood and will be implemented in building children's character. Key words: Communication; Build Character; Training; NLP",
        "link": "http://dx.doi.org/10.26858/publikan.v11i2.20381"
    },
    {
        "id": 8743,
        "title": "Optimalisasi Menghafal Al-Qur'an: Penerapan Metode Neuro Linguistic Programming (NLP) di Pesantren Islamic Centre Sumut",
        "authors": "Syamsu Nahar, Nurul Sakinah Daulay, M. Nazri",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "This research aims to analyze the application of NLP/Neuro Linguistic Programming methods in improving the quality of memorizing the Quran at the Islamic Center. Sumut is well organized from the formation of the tasmi class, creating a conversational atmosphere to memorize, reminding that everything is aimed at and meaningful, understanding the learning style of the pupils, stimulating the brain performance to the maximum, giving judgment, identifying the problems of central and central difficulties in memorizing, giving motivation and solutions in the form of positive advice to the central and central, and giving reinforcement or strengthening. The data collection techniques used are observations, interviews, and documentation studies. The results of the research show that the implementation of the NLP/Neuro Linguistic Programming method improves the quality of memorizing the Qur'an at the Islamic Centre. Sumut is well organized starting from the formation of the tasmi class, creates a conversation atmosphere to memorize, reminds that everything is aimed at and meaningful, understands the learning style of the pupils, stimulates the brain performance to the maximum, gives judgment, identifies the problems of the centri and santriwati difficulties in falsifying, gives motivation and solutions in the form of positive advice to the santri and santriwati, gives reinforcement or strengthening, and evaluates the application of the NLP method in the Madrasah Hifzil Islamic Quran Centre.",
        "link": "http://dx.doi.org/10.32806/jf.v12i02.7420"
    },
    {
        "id": 8744,
        "title": "Comparison Between the Effectiveness of Group Hope Training and Neuro-Linguistic Programming (NLP) on Hope and Quality of Life among Children with Cancer",
        "authors": "Sanaz Aghakhani, Farshad Bahari",
        "published": "2022-12-20",
        "citations": 0,
        "abstract": "Background: This study was conducted to determine the effectiveness of group hope training and neuro-linguistic programming (NLP) on hope and quality of life among children with cancer.\r\nMethods: This study aimed to determine the effectiveness of group hopefulness and group training of psycho-neurological programming (NLP) on the level of hope and quality of life of children with cancer. This was a quasi-experimental study with pre-test, post-test, and follow-up with a control group. The study participants include all literate 7-18-year-old girls and boys with cancer treated at Amirkabir Hospital (Central Province Children’s Cancer Hospital) and Tabassum Cancer Association (Central Province Cancer Association) in 2016. In total, 60 people were selected by the available sampling method and randomly divided into three groups: group hope training (20 people), NLP (20 people), and a control group without any therapeutic intervention (20 people). The Children’s Quality of Life Questionnaire and the Snyder Children’s Hope Scale were used. Multivariate and one-way analyses of covariance were applied to analyze the data.\r\nResults: There was a significant difference between group hope training and the NLP group. Both interventions had almost the same effect on the quality of life, while group hope training had a higher effect on dependent variables. Results showed that LNP group training led to increased quality of life and hope, predicting 70% and 40% of their variances. In addition, findings showed the effectiveness of group hope training on increased quality of life and hope and could predict 53% and 84% of their variances, respectively. The findings showed that NLP training and group hope training increased quality of life and hope.\r\nConclusion: According to the findings from this study, LNP group training and hope group training can increase the quality of life and hope. Based on the findings of the present study and the results of previous studies, it can be concluded that group hope and group training of neuro-linguistic programming, based on their basic principles and techniques and changing beliefs and attitudes of individuals and hope for learning, helps children with cancer change the way they react to these events, thus reduce their stress and frustration, and set specific goals for the future that inspires them. These studies show that these psychological interventions lead to positive changes and increase hope and quality of life of children with cancer.",
        "link": "http://dx.doi.org/10.18502/bccr.v13i3.11400"
    },
    {
        "id": 8745,
        "title": "The Effectiveness of Neuro-Linguistic Programming (NLP) on Shooters’ Mental Skills and Shooting Performance",
        "authors": "Shiva Ahmadzadeh, Rokhsareh Badami, Asghar Aghaei",
        "published": "2019-9-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5812/ijpbs.84124"
    },
    {
        "id": 8746,
        "title": "Cracking the code: A research study on neuro-linguistic programming (NLP) and its impact on organizational success",
        "authors": " Shradha Bohra,  Nikita Shukla",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "Neuro-Linguistic Programming (NLP) is a valuable technique for enhancing communication skills, motivation, and mentality in organizations. It helps individuals build rapport, understand others' perspectives, and convey messages with clarity and impact. NLP can help individuals achieve personal goals that go beyond monetary and performance targets, boost employee morale, loyalty, effort, and profitability. The study uses a secondary research method, which involves using existing data and research reports. The data required for conducting the study is available online, such as websites, articles, and reports mainly helps individuals in achieving organizational goals by improving communication, motivation, and mentality. It helps individuals set clear, well-defined objectives aligned with their values and aspirations, and develops appealing objectives that drive action and attention. Techniques like anchoring, reframing negative thoughts, and using positive language patterns can help individuals maintain a good view, overcoming challenges, and remaining motivated while working towards organizational goals. Communicating and influencing skills are equally important for organizational performance, and NLP provides excellent tools for improving these talents. Individuals can learn to create rapport with others, enhance their listening skills, and successfully communicate their message with NLP. These abilities are especially useful when working with team members, stakeholders, or clients, as they allow individuals to influence and convince others. NLP provides problem-solving and decision-making tools and models, such as the Disney Strategy and the Well-Formed Outcome model, which help individuals develop innovative solutions, evaluate their practicality, and develop successful action plans to attain their goals. The significance of rapport and understanding others is highlighted in NLP, allowing individuals to form deeper connections and cooperate more successfully with colleagues and team members. NLP offers a range of techniques and strategies that can greatly support individuals in achieving their organizational goals. By utilizing NLP, individuals can enhance goal setting, motivation, communication skills, mindset, and problem-solving abilities, ultimately leading to improved performance and success.",
        "link": "http://dx.doi.org/10.30574/ijsra.2023.9.2.0521"
    },
    {
        "id": 8747,
        "title": "Managing Test Anxiety and its influences on academic achievements using Neuro-Linguistic Programming (NLP) among College Students - Follow-up Study",
        "authors": "Mohammed Fakehy",
        "published": "2022-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21608/jass.2022.121903.1076"
    },
    {
        "id": 8748,
        "title": "Exploratory Study of the Effectiveness of Neuro-Linguistic Programming (NLP) Techniques for Promoting De Addiction and Prevention of Relapse among People Who Inject Drugs in India",
        "authors": " Mary Philip Sebastian",
        "published": "2017-4-25",
        "citations": 0,
        "abstract": "People who inject drugs (PWID) are vulnerable to infection with HIV and other blood borne viruses. Substance abuse disorders are relapsing conditions and treatment outcomes are often poor. Hence it is important to try novel methods and new therapies to find a way to improve treatment outcomes. An exploratory study was conducted with 10 PWIDs, undergoing de-addiction to understand the scope of Neuro-linguistic programming (NLP) as a therapy for PWIDs and its ability to keep them clean after leaving the centre. Fear was the uppermost feeling in all the PWIDs that caused them to start drug use. Participants described benefiting from the NLP therapy sessions. Using NLP as an alternative therapy with PWIDs for de-addiction can be investigated.",
        "link": "http://dx.doi.org/10.25215/0403.019"
    },
    {
        "id": 8749,
        "title": "Exploring Neuro-Linguistic programming (NLP) Techniques for Reducing Public Speaking Anxiety: A Study of Practitioner Approaches during Training",
        "authors": "Robing Robing, Eska Dirga, Ariandi Zulkarnain",
        "published": "2022-10-31",
        "citations": 0,
        "abstract": "The application of Neuro-Linguistic Programming (NLP) techniques has garnered attention as a prospective method for mitigating speaking anxiety in public. This research investigates the utilisation of neuro-linguistic programming (NLP) techniques by a proficient instructor within the framework of the 'Art of Public Speaking' training program, with the primary objective of alleviating the anxiety linked to delivering speeches to a public audience.\r\nThe current study was conducted at Cita Dines Hotel Makassar on August 4th, 2022. The methodology employed in this study encompassed a thorough gathering of data, which was achieved by actively participating as a trainer assistant, employing observational techniques, conducting detailed interviews, and carefully documenting the training sessions.\r\nThe collected data underwent a rigorous analytical process guided by Burn's theory on Neuro linguistic Programming. This theoretical framework encompasses various strategies, such as rapport, Flexibility, Outcomes and VAKOG model (Visual, Auditory, Kinesthetic, Olfactory, Gustatory). \r\nThe proficient incorporation of these NLP tactics by the trainer not only emphasised their importance but also demonstrated their efficacy in improving the quality of training sessions and promoting meaningful interpersonal connections. This study provides insights into the practical implementation of neuro linguistic programming (NLP) techniques and their capacity to improve the difficulties commonly encountered in public speaking.",
        "link": "http://dx.doi.org/10.33019/berumpun.v5i2.103"
    },
    {
        "id": 8750,
        "title": "Intelligent Pedagogical Model with Kinesthetic-Static Immersion based on the Neuro-Linguistic Programming Approach (NLP)",
        "authors": "Simón Choquehuayta Palomino, José Herrera, Luis Alfaro, Blas Choquehuayta",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14569/ijacsa.2019.0101176"
    },
    {
        "id": 8751,
        "title": "The world of communication: non-verbal communication (NVC), neuro-linguistic programming (NLP) and persuasion strategies",
        "authors": "Noemi Martini, Vincenzo M. Mastronardi",
        "published": "2020-12-21",
        "citations": 0,
        "abstract": "What are the forms, methods and characteristics of communication? Communication, understood as the exchange of information from an issuer to a recipient, comes into contact with all the social and cultural spheres belonging to it and is focused here to show the main markers that characterize it. The work is based on an analysis of all those aspects that can influence the communication exchange or even distort the meaning of the message sent. The research questions were also addressed to the fascinating field of non-verbal communication and the characteristics of body gestures, understood as distinctive signals with a strong social impact, also and above all in police interviews and interrogations. Particular reserve was addressed to the many years of experience of Michael Napier, special agent of the prestigious Quantico FBI Behavioral Sciences Unit, for his meticulous work on the aspects necessary in the proper execution of an investigative investigation. The work ends with a current reflection and deepening on the techniques of persuasion and manipulation of communication, which can become a real weapon to strike, on the one hand positively convincing and working on self-esteem and to help individuals achieve their own objectives, on the other hand by manipulating and misinforming a large slice of the population with psychological, political and digital tools.",
        "link": "http://dx.doi.org/10.4081/psyco.2020.547"
    },
    {
        "id": 8752,
        "title": "Neuro-Linguistic Programming for Change Leaders",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569"
    },
    {
        "id": 8753,
        "title": "The Exploring Participation in Neuro-Linguistic Programming : Teacher and Senior High School Students' Perceptions [Eksplorasi Partisipasi dalam  Neuro-Linguistic Programming : Perspepsi Guru dan Siswa SMA",
        "authors": "Risa Mufliharsi, Eva Nurul Candra",
        "published": "2019-2-21",
        "citations": 0,
        "abstract": "Neuro-linguistic programming is known as an alternative approach and technique especially in English. However, in praxis, many teachers didn’t apply it in the classroom. that is why in this community service, the team will have training for teacher and simulation for tenth-grade students about NLP. To differentiate conventional techniques by a teacher, a team focused on the exploration of teacher and students’ participation through the training and simulation. To find out whether NLP as an approach and technique can increase teacher and students’ participation during classroom instruction, the team investigated teacher and students’ perception. The team used four sets opened questionnaires. Each of them is five opened questions. There are two similar sets of opened questionnaires which administered before and after simulation for students. Besides, there are two equivalent sets of opened questionnaires for a teacher that administered before and after training.",
        "link": "http://dx.doi.org/10.30874/comdev.2018.107"
    },
    {
        "id": 8754,
        "title": "The Role of Neuro-Linguistic Programming (NLP) to enhance speaking comprehension among EFL Students with Special Reference to Ghazi University Dera Ghazi Khan",
        "authors": "Hafeez Ullah, Anam Zahra, Allah Wasaya Babbar",
        "published": "2021-9-20",
        "citations": 0,
        "abstract": "The study is applied in the Ghazi University Dera Ghazi Khan Punjab, Pakistan. The research included 42 learners. Quantitative analysis was being used to perform the study of randomly selected groups. The learners were separated into experimental groups and control groups. The researcher used NLP concepts and techniques to detect the achievement of the learners in the experimental group after a few weeks of assessing the course, all classes were given pre-test and post-test. The data was compiled using a questionnaire. The result of the study indicated that learners who were instructed by the programming approach of neurolinguistics were better than those taught by the approach of regular teachers. The method of Neurolinguistics programming’s suggested to English teachers to improve the interest of their students in speaking comprehension.",
        "link": "http://dx.doi.org/10.53575/irjei.16-v2.2(21)149-159"
    },
    {
        "id": 8755,
        "title": "Neuro Linguistic Programming (NLP) as a Promising Technique of Communicative English Language Teaching",
        "authors": "Dr. A. Jahitha Begum, Dr. I. Joseph Milton Paulraj, Dr. S. Hameedha Banu",
        "published": "2022-3-16",
        "citations": 1,
        "abstract": "The present study discusses Neuro Linguistic Programming (NLP) in terms of enhancement of communication skills of the language learners. Communication skills are in high demand because multinational companies require a candidate with good communication skills. So, It is the need of hour for teaching fraternity to improve the communication skills of the language learners by identifying new strategies and techniques. NLP is now gaining momentum in enhancing the communication skills of the learners. NLP is defined as an art of communication and contributes positively in language learning. It is also an important and unavoidable part of the learning process to achieve the needs of the learner. NLP is found to help the students to develop their communication skills with confidence and viewed as contributing tool to the development of human communication and behaviour. Besides, it increases the communication skills of the employees, motivation, success. Many authors also cited that NLP offers the desired result. Hence the present article felt the need of analytical discussion on NLP in terms of the enhancement of communication of the language learners.",
        "link": "http://dx.doi.org/10.36348/sijll.2022.v05i03.004"
    },
    {
        "id": 8756,
        "title": "الهندسة النفسية وعلاقتها بالقوة التنظيمية لدى مدراء المدارس الثانوية Neuro-linguistic programming (NLP) The organizational force and its relation to the organizational force of high school principals.",
        "authors": "Maha Sabry Salem",
        "published": "2018-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21608/siaqat.2018.203794"
    },
    {
        "id": 8757,
        "title": "Implementing Neuro-Linguistic Programming (NLP) as Teaching Innovation for Islamic Religious Education (IRE): A Study on Student’s Perception",
        "authors": "Titis Thoriquttyas, Nur Faizin, Nur Ahsin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/978-2-494069-15-2_17"
    },
    {
        "id": 8758,
        "title": "Neuro-Linguistic Programming",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781483369532.n344"
    },
    {
        "id": 8759,
        "title": "IDENTIFICATION OF ATTRIBUTES OF NEURO-LINGUISTIC PROGRAMMING (NLP) STRUCTURE WITH THE FOCUS ON COMMUNICATION AND TECHNIQUES OF ITS IMPLEMENTATION IN MANAGERIAL WORK",
        "authors": "Arief Budiman, Miroslav Frankovský, Zuzana Birknerová, Eva Benková, Ismi Rajiani",
        "published": "2018-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17512/pjms.2018.17.2.04"
    },
    {
        "id": 8760,
        "title": "CAN THE USE OF FOUR SUPPOSITIONS AND TWO TECHNIQUES OF CHANGE ASSOCIATED WITH NEURO-LINGUISTIC PROGRAMMING (NLP) ENHANCE THE EXPERIENCE AND PERCEPTIONS ABOUT LEARNING FOR BOYS IN POST-16 EDUCATION?",
        "authors": "Voldis Kudliskis",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "Living Educational Theory (LET), which sits within the interpretivist paradigm, provides pragmatic enquiries in real life educational contexts. This form of research provides a platform for examining four suppositions and two Techniques of Change associated with neuro-linguistic programming (NLP) particularly in the context of boys’ engagement with learning. NLP is proposed as a powerful personal development method. However, the credibility of NLP is questioned due to limited research-based evidence. Four NLP suppositions and two NLP Techniques of Change are examined. Thereafter, a description of an exploratory study into how these suppositions and Techniques of Change may enhance engagement with learning is provided. The study utilised a single method (semi-structured interview) approach. It is a single-site, multi-voice study capturing the perceptions of NLP, for boys in post-16 education, situated in a rural community college. ‘Positions of Consensus’ and individual narratives are explored and suggest that four suppositions and two Techniques of Change may enhance boys’ experiences and perceptions about learning. Possibly these NLP strategies may be helpful at an indirect level in enhancing boys’ engagement with learning in post-16 education. Inferences provide tentative evidence that these suppositions and Techniques of Change may aid engagement with learning in this specific context. It is suggested that these NLP suppositions and Techniques of Change could be implemented, via a cost-effective training programme, to enhance engagement with learning and to drive a culture of excellence in schools and FE colleges.",
        "link": "http://dx.doi.org/10.29121/granthaalayah.v11.i3.2023.5096"
    },
    {
        "id": 8761,
        "title": "INCORPORATION OF NEURO-LINGUISTIC PROGRAMMING (NLP) TECHNIQUES IN THE CLASSIC COACHING SESSIONS",
        "authors": "Maria Alekseevna Maricheva,  , Vladimir Igorevich Esaulov,  ",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15863/tas.2023.03.119.43"
    },
    {
        "id": 8762,
        "title": "Neuro-Linguistic Programming and Managerial Communication",
        "authors": "Miroslav Frankovský, Zuzana Birknerová, Eva Benková, Ladislav Suhányi",
        "published": "2018-9-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.75301"
    },
    {
        "id": 8763,
        "title": "Meta-programmes",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-11"
    },
    {
        "id": 8764,
        "title": "TECHNIQUES OF NEURO-LINGUISTIC PROGRAMMING IN LEGAL DISCOURSE",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46320/2073-4506-2023-3-178-409-411"
    },
    {
        "id": 8765,
        "title": "Communication models",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-15"
    },
    {
        "id": 8766,
        "title": "Conscious leadership",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-1"
    },
    {
        "id": 8767,
        "title": "How can emotional intelligence (EI) and neuro-linguistic programming (NLP) help leaders with the ability to deal with the impact of COVID-19?",
        "authors": "Jude-Martin Etuka, Vidya Sagar Athota, Sean Kearney",
        "published": "2021-10-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14778238.2020.1860667"
    },
    {
        "id": 8768,
        "title": "Caretaking and guiding",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-13"
    },
    {
        "id": 8769,
        "title": "New management practices",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-3"
    },
    {
        "id": 8770,
        "title": "A Structural Framework for Neuro-Linguistic Programming (NLP) and its Consequence on Leadership Succession Planning Strategy Applying to the Leaders of King Khalid University and Qualified Personnel for Leadership Position",
        "authors": "Fatimah Mohamed Mahdy Hassan, Faiz Binzafrah, Mohammad Alqahtani",
        "published": "2022",
        "citations": 0,
        "abstract": "The research paper pursues to know the effect of NLP practices on leadership succession planning strategy by applying to The Leaders of King Khalid University and Qualified Personnel for the Leadership position. After reviewing the literature, the researchers formulated a hypothetical model for the study that includes the central hypothesis from which six sub-hypotheses emerge, including measuring the impact of NLP pillars on leadership succession planning strategy. A sample size of 100 individuals was selected, representing the research population represented by the deans and deans of the university and colleges and heads of departments in colleges at King Khalid University in Saudi Arabia. The response rate was 82%, with 82 valid questionnaires for analysis. The study relied on Structural Equation Modeling (SEM) by AMOS (V.26) and SPSS (V.25) for data analysis and hypotheses. The study found a positive and significant effect between NLP and leadership succession planning strategy. NLP confirmed its re-formulation of standard mental models to understand and facilitate the process of thinking and training, which helps successive leaders understand the ideas and beliefs of current leaders and their ways of thinking in solving problems and facing crises. In addition, NLP plays a vital role in increasing the successive leader’s sense of the need to establish their reputation for outstanding performance after similarity and learning from the model. Finally, the novice leader needs a model and role model to help him control the way he feels, transforming it into positive thinking that stimulates energy and focuses on goals, which the application of NLP practices does. So, this study is recommended the necessity of activating leadership succession planning strategy within universities through establishing a leadership academy in which NLP methods are practiced, as this academy has a significant impact on achieving leadership succession and the continuation of pipelines of leaders.",
        "link": "http://dx.doi.org/10.21272/bel.6(2).24-43.2022"
    },
    {
        "id": 8771,
        "title": "NEURO-LINGUISTIC PROGRAMMING: SOLUSI TINGKATKAN SELF-EFFICACY PERAWAT DI RUMAH SAKIT “Neuro-Linguistic Programming: A Solution to Improve Nurse’s Self-Efficacy at Hospital”",
        "authors": "I Ketut Dian Lanang Triana, Ni Putu Emy Darma Yanti",
        "published": "2020-2-27",
        "citations": 0,
        "abstract": "Self-efficacy perawat didefinisikan sebagai persepsi perawat dalam melakukan tindakan keperawatan professional sesuai dengan kompetensi keperawatan. Berdasarkan penelitian sebelumnya, self-efficacy perawat diketahui memiliki pengaruh yang signifikan terhadap beberapa aspek seperti komunikasi, perilaku asertif hingga kinerja keperawatan. Berbagai cara dapat dilakukan untuk meningkatkan self-efficacy perawat salah satunya adalah pendekatan Neuro-linguistic programming. Artikel ini dibuat untuk mengetahui dampak positif Neuro-Linguistic Programming terhadap self-efficacy perawat. Neuro-linguistic programming terdiri dari beberapa metode seperti sensory acuity, reframing, anchoring, rapport, pacing dan leading. Melalui beberapa penelitian diketahui bahwa neuro-linguistic programming dapat meningkatkan pengetahuan, keterampilan dan sikap perawat, kemampuan berkomunikasi perawat, manajemen diri, kesehatan mental, stress kerja higga self-efficacy perawat dalam melakukan kompetensi keperawatan. Neuro-linguistic programming dapat menjadi sebuah solusi untuk meningkatkan self-efficacy perawat yang kemudian berdampak pada kinerja dan kualitas tenaga keperawatan professional.",
        "link": "http://dx.doi.org/10.53345/bimiki.v6i2.31"
    },
    {
        "id": 8772,
        "title": "Framing of experience",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-12"
    },
    {
        "id": 8773,
        "title": "Emotional Intelligence and Neuro-linguistic Programming",
        "authors": "",
        "published": "2019-7-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b22180"
    },
    {
        "id": 8774,
        "title": "Building psychological safety",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-9"
    },
    {
        "id": 8775,
        "title": "It starts with oneself",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-5"
    },
    {
        "id": 8776,
        "title": "THE HISTORY AND TRANSFORMATION OF NEURO-LINGUISTIC PROGRAMMING",
        "authors": "Jahongir KHASANOV",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "Neuro-Linguistic Programming (NLP): method of acting on human consciousness and knowledge, linked to an influence at the level of ideology and Ideas about the World concerning the human mind and moral conscience. In many circles of psychologists, there is the conviction of the pseudo-scientific nature of this method or the conviction that its use causes superficial and short-term effects; despite the lack of full support in scientific circles, this notion has already entered the vocabulary of psychology, education, business and various systems of the so-called \"self-development\", and it continues to be popularized. NLP or neuro-linguistic programming refers to a whole set of techniques (dissociation, reframing) and methods aimed at promoting the personal development of the individual. This article investigates NLP in detail: its principles, its history, its benefits, and the progress of a session.",
        "link": "http://dx.doi.org/10.36078/1696489965"
    },
    {
        "id": 8777,
        "title": "Neuro Linguistic Programming in Empowerment Staff",
        "authors": "Sevim Şen, Esra Uğur",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5222/shyd.2019.65487"
    },
    {
        "id": 8778,
        "title": "Neuro-Linguistic Programming training to enhance Reading Comprehension of Children with Dyslexia",
        "authors": "",
        "published": "2020-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/aj9.6/025"
    },
    {
        "id": 8779,
        "title": "Nourishing Critical Thinking Skills using Neuro-Linguistic Programming",
        "authors": " Editor PJE",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Neuro-Linguistic Programming (NLP) is a widely used approach, introduced by Bandler and Grinder (1970). In this study, the researcher explores different techniques involved in NLP, which can be utilized by teachers in teaching different genres of literature such as drama, prose, etc. In this quasi-experimental research, the researcher selected two groups: one experimental group consisting of 108 students, and the other a control group consisting of 141 students, enrolled in the Master’s Program in English Literature and Linguistics. The sample was selected through random sampling.",
        "link": "http://dx.doi.org/10.30971/pje.v39i1.865"
    },
    {
        "id": 8780,
        "title": "Un-packing the mindset mix",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-10"
    },
    {
        "id": 8781,
        "title": "A model of rapport building",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-14"
    },
    {
        "id": 8782,
        "title": "Neuro Linguistic Programming: A Novel Approach to Sentiment Analysis",
        "authors": "Arun Kumar, Supriya Panda",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3565867"
    },
    {
        "id": 8783,
        "title": "Building the case for change",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-8"
    },
    {
        "id": 8784,
        "title": "Neurolinguistic programming for managers and engineers as evidence-based practitioners",
        "authors": "Tomasz Witkowski, Stawomir Jarmuz",
        "published": "2019-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b22180-4"
    },
    {
        "id": 8785,
        "title": "The Effect of Group Art Therapy with NLP(Neuro Linguistic Programming) Technic on the Self-directed Learning Readiness of Lower-income Group Students in a Middle School",
        "authors": "Ae-Ri Kim,  , Kyung-Mi Yoo",
        "published": "2019-12-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32451/kjoaps.2019.15.4.367"
    },
    {
        "id": 8786,
        "title": "Emotional Intelligence",
        "authors": "Ana Lúcia Rodrigues, Carolina Machado",
        "published": "2019-7-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b22180-2"
    },
    {
        "id": 8787,
        "title": "‘The map is not the territory’",
        "authors": "Dr David Potter",
        "published": "2018-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315099569-4"
    },
    {
        "id": 8788,
        "title": "Keefektifan pembelajaran berbasis neuro linguistic programming dalam menulis argumentasi",
        "authors": "Abdul Haliq",
        "published": "2020-12-8",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk mengkaji keefektifan keterampilan menulis paragraf argumentasi berdasarkan metode NLP pada siswa kelas X SMA Negeri 11 Makassar. Jenis penelitian yang digunakan dalam penelitian ini adalah penelitian eksperimen.desain penelitian yang digunakan yaitu pretest-post test non-equivalent control group design. Peneltian ini dilaksanakan di SMA Negeri 11 Makassar. Yang menjadi populasi yaitu keseluruhan siswa kelas X yang berjumlah 352 siswa. pengambilan sampel dilakukan dengan teknik purposive sampling. Sampel yang terpilih yaitu kelas X-1 sebagai kelas eksperimen dan kelas X-2 sebagai kelas kontrol. Instrumen yang digunakan dalam penelitian ini berupa tugas menulis paragraf argumentasi. Data yang terkumpul kemudian dianalisis dengan menggunakan statistik deskriptif dan stattistik inferensial. Hasil penelitian menunjukkan bahwa, terdapat perbedaan yang signifikan antara pembelajaran menulis paragraf argumentasi berbasis NLP dengan pembelajaran keterampilan menulis paragraf argumentasi dengan menggunakan metode ceramah dan penugasan. Hal ini ditunjukkan pada hasil uji hipotesis menggunakan analisis inferensial jenis uji-t independen (independent sample test)  dan diperoleh nilai t-hitung = 4,263 dengan signifikansi atau p-value = 0,000. Karena nilai p-value = 0,000  0,05 maka dapat disimpulkan bahwa terdapat perbedaan yang signifikan antara pembelajaran keterampilan menulis paragraf argumentasi berbasis NLP dengan pembelajaran menulis paragraf argumentasi menggunakan metode ceramah dan penugasan. Dengan demikian, pembelajaran berbasis NLP efektif digunakan dalam keterampilan menulis paragraf argumentasi pada siswa kelas X SMA Negeri 11 Makassar.  The effectiveness of neuro-linguistic programming on learning writing arguments Abstract: This study aims to examine the effectiveness of argumentation writing skills based on the NLP method at the tenth-grade students of SMA Negeri 11 Makassar. This was an experimental study. The research design used is the pretest-posttest non-equivalent control group design. This research was carried out in SMA Negeri 11 Makassar. The population was all the tenth-grade students which were 352 students. The sampling technique used was the purposive sampling technique. The selected samples were class X-1 as an experimental class and class X-2 as a control class. The instrument used in this study was an exercise on writing argumentative paragraphs. The collected data was then analyzed using descriptive and inferential statistics. The results showed that there was a significant difference between learning of writing argumentative paragraph based on the NLP method and the lecturing and assignment methods. This was indicated in the results of hypothesis testing from the independent t-test (independent sample test) of inferential analysis where the value of t-count obtained was 4.263 and the significance or p-value was 0.000. Because the p-value was  0.05, it can be concluded that there was a significant difference between the learning of writing argumentative paragraph based on the NLP method and the lecturing and assignment methods. Thus, NLP-based learning was effectively used in writing argumentation paragraph for the tenth-grade students of SMA Negeri 11 Makassar.",
        "link": "http://dx.doi.org/10.21831/lt.v7i2.27529"
    },
    {
        "id": 8789,
        "title": "NEURO-LINGUISTIC PROGRAMMING IN ARMENIAN ONLINE GAMING COMMERCIALS",
        "authors": "LILIT MOVSESYAN",
        "published": "2022",
        "citations": 0,
        "abstract": "The approaches and concepts of neurolinguistics come from such \nscientific fields as neuroscience, linguistics, cognitive science and \nneuropsychology. The sphere of neurolinguistics is predominantly concerned \nwith the development and perception of language through the functions of \nthe human brain. This is why it is also called Language neurology. One of the \ncore notions of neurolinguistics is neuro-linguistic programming (hereinafter \nreferred to as NLP) which is engaged with new, positive ways of thinking, \nspeaking and acting with deep intentions to pursue success in various fields. \nAnd business is one of the fields where NLP is necessary in order to intensify \ncompetence and productivity. Therefore, NLP is of great value for \nadvertising, as it allows convincingly convey messages and pursue business \ngoals, thereby create trust in the transaction process.",
        "link": "http://dx.doi.org/10.51307/18293107/laph/22.62-252"
    },
    {
        "id": 8790,
        "title": "SYSTEMATICS OF COMMUNICATIVE INFLUENCE IN THE ASPECT OF NEURO-LINGUISTIC PROGRAMMING",
        "authors": "Anastasia Kovalevskaya",
        "published": "2017-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18007/gisap:ps.v0i14.1672"
    },
    {
        "id": 8791,
        "title": "Neurolinguistic Programming and English Language Teaching: An Exploration of Linguistic Variants in NLP for its Connection to ELT",
        "authors": " Faiza Zeb,  Ansa Hameed",
        "published": "2020-12-25",
        "citations": 0,
        "abstract": "The human brain, which can be programmed through a multiplicity of practices, is the foundation of NLP. Language teachers can effectively program their students for improved language output if made aware of the Neuro-functioning of the brain. This new-fangled aspect of language teaching is, hitherto, an uncharted area in the Pakistani teaching context. The current study seeks to look into the existing estate of English language pedagogy in Pakistani scenario with the assistance of the NLP Milton Model, based on the employment of the language patterns by famous hypnotist-Milton Erickson. The focal point of this model is- presupposition, mind read, lost performative, unspecified verb, comparative deletion, cause and effect, universal quantifier, complex equivalence, modal operator, nominalization, and unspecified referential index. It has implications, to a great extent, in ELT to generate preferred results. For this study, the sample population is chosen through purposive sampling technique and encompasses language skills’ classes; whereas, the five English Language institutions were preferred through random sampling method. This study, accordingly, underpins the exploitation of NLP as a toolkit for effectual language pedagogy. Besides, it also advocates copious ways for meaningful, motivational, and momentous communication between language teachers and learners.",
        "link": "http://dx.doi.org/10.36902/sjesr-vol3-iss4-2020(96-105)"
    },
    {
        "id": 8792,
        "title": "Bridging the Un-Bridged Yet: The Learning Innovation through Neuro Linguistic Programming (NLP) for Islamic Religious Education in Higher Education",
        "authors": "Titis Thoriquttyas, Nurul Ahsin, Nur Faizin, M. Rizal Ramadhan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/978-2-38476-114-2_99"
    },
    {
        "id": 8793,
        "title": "THE USE OF NEURO-LINGUISTIC PROGRAMMING TECHNIQUES IN INVESTIGATIVE PRACTICE. CURRENT ISSUES. THEORY AND PRACTICE",
        "authors": "Andrey Morozov",
        "published": "2021-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32743/26870142.2021.36.212.302683"
    },
    {
        "id": 8794,
        "title": "KEEFEKTIFAN PEMBELAJARAN BERBASIS NEURO LINGUISTIC PROGRAMMING DALAM KETERAMPILAN MENULIS PARAGRAF ARGUMENTASI PADA SISWA KELAS X SMA NEGERI 11 MAKASSAR",
        "authors": "Abdul Haliq",
        "published": "No Date",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk mengkaji keefektifan keterampilan menulis paragraf argumentasi berdasarkan metode NLP pada siswa kelas X SMA Negeri 11 Makassar. Jenis penelitian yang digunakan dalam penelitian ini adalah penelitian eksperimen.desain penelitian yang digunakan yaitu quasi eksperimen. Peneltian ini dilaksanakan di SMA Negeri 11 Makassar. Yang menjadi populasi yaitu keseluruhan siswa kelas X yang berjumlah 352 siswa. pengambilan sampel dilakukan dengan cara acak dengan teknik penentuan sampel yaitu cluster sampling. Sampel yang terpiih yaitu kelas X-1 sebagai kelas eksperimen dan kelas X-2 sebagai kelas kontrol. Instrument yang digunakan dalam penelitian ini berupa tugas menulis paragraf argumentasi dengan teknik pengumpulan data yaitu pemberian tugas. Data yang terkumpul kemudian dianalisis dengan menggunakan statistic deskriptif dan stattistik inferensial. Hasil penelitian menunjukkan bahwa, terdapat perbedaan yang signifikan antara pembelajaran menulis paragraf argumentasi berbasis NLP dengan pembelajaran keterampilan menulis paragraf argumentasi dengan menggunakan metode ceramah dan penugasan. Hal ini ditunjukkan pada hasil uji hipotesis menggunakan analisis inferensial jenis uji-t independen (independent sample test)  dan diperoleh nilai t-hitung = -4,263 dengan signifikansi atau p-value = 0,000. Karena nilai p-value = 0,000 &lt; 0,05 maka dapat disimpulkan bahwa terdapat perbedaan yang signifikan antara pembelajaran keterampilan menulis paragraf argumentasi berbasis NLP dengan pembelajaran menulis paragraf argumentasi menggunakan metode ceramah dan penugasan. Dengan demikian, pembelajaran berbasis NLP efektif digunakan dalam keterampilan menulis paragraf argumentasi pada siswa kelas X SMA Negeri 11 Makassar.  Berdasarkan hasil penelitian yang diperoleh, maka dapat diajukan saran yaitu (1) Guru senantiasa menerapkan pembelajaran berbasis NLP pada siswa SMA Negeri 11 Makassar dalam pembelajaran bahasa dan sastra Indonesia, khususnya dalam keterampilan menulis. (2) untuk meningkatkan kualitas pembelajaran, hendaknya guru memprioritaskan pembelajaran berbasis NLP, karena pendekatan ini efektif diterapkan dalam meningkatkan kemampuan dan motivasi belajar siswa. (3) diharapkan bagi para peneliti selanjutnya untuk terus melakukan penelitian terhadap pendekatan NLP pada setiap aspek pembelajaran bahasa Indonesia dan juga pada mata pelajaran lain.",
        "link": "http://dx.doi.org/10.31227/osf.io/bpmqa"
    },
    {
        "id": 8795,
        "title": "The Limitations of Corpus-Based Methods in NLP",
        "authors": "Max Silberztein",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-43811-0_1"
    },
    {
        "id": 8796,
        "title": "Academic authenticity of neuro-linguistic programming as a discursive practice",
        "authors": "Yu. V. Gilyasev",
        "published": "2019-12-25",
        "citations": 0,
        "abstract": "Neuro-linguistic programming (NLP) is considered to be one of the socially valued practices whose conceptual and methodological grounds can be articulated when seen in the light of its discursive representation. Characterization and evaluation of this area in applied psychology proceeds through analysis of expert standpoints and views rendered in secondary sources where they express the conformity level of the discourse in question to academic standards existent in psychology as a theory. Special attention is given to the propositional expression of the ideas defining NLP studies as well as to the exposure of presuppositional attitudes of the NLP expert whose textbook is under discussion in the article. The logical correctness and validity of those presuppositions are analyzed in relation to their adequate representation of scientific or mass worldview. After having exposed the author’s intentions one can state the pragmatic strategy and ideology pursued by the NLP expert in the textbook alongside with the identity of NLP as a discursive and social practice, its position among other discursive practices. The results obtained after the analysis of a particular piece of NLP discourse are congruent with the current trends typical of postmodernist consumerist society. Characteristic postmodernist ways to organize verbal interaction – in particular, forms of discourse imitation, its variation and hybridization – are found in the examples provided. A practical workbook on NLP in English was taken as a source for evidence. Critical discourse-analysis (CDA) served as the guiding approach to the problem, which was realized at some points of the study as contextual analysis, definitive analysis, interpretation method, statistical procedures altogether with quantitative estimation.",
        "link": "http://dx.doi.org/10.24833/2687-0126-2019-1-4-33-44"
    },
    {
        "id": 8797,
        "title": "Learning Law Using Augmented Reality and Neuro-Linguistic Programming",
        "authors": "Puteri Sofia Amirnuddin, Jason J. Turner",
        "published": "2022-4-1",
        "citations": 0,
        "abstract": "In the era of the Fourth Industrial Revolution (4 IR), there are various legal tasks that are becoming increasingly automated, and hence, it is no longer sufficient for law students to only know the law. Today's law graduates have to be equipped with skills that can future-proof their careers from automation; hence, the onus is on education providers to embed those skills in the curriculum. In an attempt to address the identified skills gap and better enable graduate work readiness, augmented reality (AR) and neuro-linguistic programming (NLP) have been introduced into a law module at Taylor's University to encourage first-year law students to learn law using AR and utilise NLP techniques to deliver a human element through digital learning. Through the interpretation of students' feedback from a module survey, this chapter aims to understand student learning experience on the role of AR and NLP in facilitating and enhancing their legal studies and preparing the graduate more effectively for the workplace. ",
        "link": "http://dx.doi.org/10.4018/978-1-6684-5682-8.ch032"
    },
    {
        "id": 8798,
        "title": "MANIFESTATIONS OF LEARNED HELELESS PHENOMENON IN NEURO-LINGUISTIC PROGRAMMING TRAINING PARTICIPANTS",
        "authors": "S.I. Yakovenko, V.K. Ponomarova, D.O. Trofimova",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32843/2663-5208.2022.38.29"
    },
    {
        "id": 8799,
        "title": "Neuro-linguistic Programming, Teacher’s Identity, and Teachers’ Effectiveness",
        "authors": "Yaghoob Javadi, Solmaz Azizzadeh Asl",
        "published": "2020-5-1",
        "citations": 0,
        "abstract": "Education especially “teaching” is considered as a valuable profession through which future generations are generated and educated. In order to have a successful educational system, the main components of the system must work together. It is believed that teachers are active decision-makers of any educational system who can bring on success to the education, accounting for about 30 percent of the variance on pupils’ achievement. Based on different studies, developing rapport, critical thinking, self-efficacy, establishing clear goals, effective interpersonal communication, and a supportive classroom climate are some of the main determinant factors the teachers’ effectiveness. Among various variables which are related to teachers, identity is one of the important elements that affect teachers' performance. Neuro-linguistic programming, on the other hand, is considered as an approach which is claimed to help achieve excellence in performance and identity. It is also considered as a supplementary technique in teaching profession which helps the teachers to develop outstanding skills. In this article, the researcher defines the concept of teacher’s identity as a key element effective in the teaching profession. Then some factors that have significant impact on teachers’ effectiveness are taken into account. Also, the definition of neuro-linguistics programming, some of its characteristics, and its implications for developing teacher’s identity and teacher’s effectiveness are discussed.",
        "link": "http://dx.doi.org/10.17507/jltr.1103.07"
    },
    {
        "id": 8800,
        "title": "Customer product experience analysis using text mining: A neuro linguistic programming approach",
        "authors": "Nikhita Mangaonkar, Sudarshan Sirsat",
        "published": "2017-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccmc.2017.8282679"
    }
]