[
    {
        "id": 22971,
        "title": "Object Recognition",
        "authors": "Ming-Hsuan Yang",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-8265-9_1042"
    },
    {
        "id": 22972,
        "title": "Efficient Thumbnail Identification through Object Recognition",
        "authors": "Salvatore Carta, Eugenio Gaeta, Alessandro Giuliani, Leonardo Piano, Diego Recupero",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010108802090216"
    },
    {
        "id": 22973,
        "title": "Bio-inspired computational object classification model for object recognition",
        "authors": "Ivan Axel Dounce, Luis Adrian Parra, Félix Ramos",
        "published": "2022-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogsys.2021.10.007"
    },
    {
        "id": 22974,
        "title": "Object Recognition in Traffic Monitoring Systems",
        "authors": "Daniel Lorencik, Iveta Zolotova",
        "published": "2018-8",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/disa.2018.8490634"
    },
    {
        "id": 22975,
        "title": "Gesture recognition using Open-CV",
        "authors": "Mohd. Baqir Khan, Kavya Mishra, Mohammed Abdul Qadeer",
        "published": "2017-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csnt.2017.8418531"
    },
    {
        "id": 22976,
        "title": "Resnet Features and Optimization Enabled Deep Learning for Indoor Object Detection and Object Recognition",
        "authors": "Anandh N., Gopinath M. P.",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/01969722.2022.2151178"
    },
    {
        "id": 22977,
        "title": "Polycythemia with testosterone therapy increases CV risk",
        "authors": "Tim Dean",
        "published": "2022-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/tre.0030073"
    },
    {
        "id": 22978,
        "title": "Object Perception and Recognition",
        "authors": "Bruno and",
        "published": "2018-9-20",
        "citations": 0,
        "abstract": "Perceived objects are unitary entities that enter our consciousness as organized wholes distinct from other entities and from empty parts of the environment, that are amenable to bodily interactions, and that possess several features such as a three-dimensional structure, a location in space, a colour, a texture, a weight, a degree of rigidity, an odour, and so on. In this chapter, we will discuss perceptual processes responsible for forming such units within and between sensory channels, typically for the purpose of recognition. Our discussion of multisensory interactions in object perception will provide a useful domain for illustrating the key notion of optimal multisensory integration and for introducing Bayesian models of perception. These models provide important novel ways of addressing classical problems in the philosophy of perception, in influential historical approaches such as the Gestalt theory of perception, and in applications to rehabilitation based on sensory substitution.",
        "link": "http://dx.doi.org/10.1093/oso/9780198725022.003.0004"
    },
    {
        "id": 22979,
        "title": "Extended Object Detection: Flexible Object Description System for Detection in Robotic Tasks",
        "authors": "A. D. Moscowsky",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-97004-8_3"
    },
    {
        "id": 22980,
        "title": "Analysis of Object Following Robot Module Using Android, Arduino and Open CV, Raspberry Pi with OpenCV and Color Based Vision Recognition",
        "authors": "A. Ambikapathy, Jyotiraditya Sandilya, Ankit Tiwari, Gajendra Singh, Lochan Varshney",
        "published": "2021",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-7504-4_35"
    },
    {
        "id": 22981,
        "title": "A New Normalized Method of Object Shape-based Recognition and Localization",
        "authors": "B. Moradi, H. Abdulrahman, B. Magnier",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/cp.2019.0246"
    },
    {
        "id": 22982,
        "title": "Small-object detection based on YOLOv5 in autonomous driving systems",
        "authors": "Bharat Mahaur, K.K. Mishra",
        "published": "2023-4",
        "citations": 46,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2023.03.009"
    },
    {
        "id": 22983,
        "title": "ALGORITHM FOR PRIMARY OBJECT RECOGNITION IN THE WAREHOUSE MANAGEMENT SYSTEM",
        "authors": "M. Dementiev,  , O. Lashko",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "This article examines the peculiarities of warehouse management systems and presents the principles and implementation of an in-house software system for warehouse management using computer vision technology. A structural diagram of the application is developed, which consists of eight modules: image capture service, image storage, computer vision service, database, API server, client application, task scheduler, and task queue. The architecture is designed based on cloud technologies, namely Google Cloud Platform. A computer vision algorithm for determining the state of cells in the warehouse is proposed. A functional software product based on modern technologies has been developed. The purpose of this article is to reflect the results of the study of the subject area of warehouse management systems and to highlight the results of the implementation of a proprietary software system using computer vision. Keywords: Python, OpenCV, computer vision, Google Cloud, warehouse management system, cloud computing, serverless computing.",
        "link": "http://dx.doi.org/10.23939/csn2023.01.020"
    },
    {
        "id": 22984,
        "title": "Visual Object Recognition System",
        "authors": "Mykola Vasylenko, Maksym Haida",
        "published": "2022-11-24",
        "citations": 0,
        "abstract": "This article introduces the problem of object detection and recognition. The potential mobility of this solution, ease of installation and ease of initial setup, as well as the absence of expensive, resource-intensive and complex image collection and processing systems are presented. Solutions to the problem are demonstrated, along with the advantages and disadvantages of each. The selection of contours by a filter based on the Prewitt operator and a detector of characteristic points is an algorithm of the system, developed within the framework of object recognition techniques. The reader can follow the interim and final demonstrations of the system algorithm in this article to learn about its advantages over traditional video surveillance systems, as well as some of its disadvantages. A webcam with a video frame rate of 25 frames per second, a mobile phone and a PC with the Matlab2020 programming environment installed (due to its convenience and built-in image processing functions) are required to illustrate how the system works.",
        "link": "http://dx.doi.org/10.18372/1990-5548.73.17007"
    },
    {
        "id": 22985,
        "title": "Reassembly of Fractured Object Using Fragment Topology",
        "authors": "A. Alzaid, S. Dogramadzi",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/cp.2019.0256"
    },
    {
        "id": 22986,
        "title": "Guideline update says no to aspirin in primary CV prevention",
        "authors": "Tim Dean",
        "published": "2023-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/tre.0030138"
    },
    {
        "id": 22987,
        "title": "Object Novelty Recognition Memory",
        "authors": "Abdel Ennaceur",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00001-x"
    },
    {
        "id": 22988,
        "title": "Object Recognition and Object Location Recognition Memory – The Role of Dopamine and Noradrenaline",
        "authors": "Perla Moreno-Castilla, Kioko Guzman-Ramos, Federico Bermudez-Rattoni",
        "published": "2018",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00028-8"
    },
    {
        "id": 22989,
        "title": "Object Novelty and Object Location Recognition Memory in Fish – Recent Advances",
        "authors": "Trevor J. Hamilton",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00009-4"
    },
    {
        "id": 22990,
        "title": "A Multiple Object Recognition Approach via DenseNet-161 Model",
        "authors": "Anamika Dhillon, Gyanendra K. Verma",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-90789-7.00009-9"
    },
    {
        "id": 22991,
        "title": "Spatial Multi-object Recognition Based on Deep Learning",
        "authors": "Wang Liu, Hewen Xiao, Bai Chengchao",
        "published": "2019-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icus48101.2019.8995980"
    },
    {
        "id": 22992,
        "title": "Development of a Video Surveillance System for Motion Detection and Object Recognition",
        "authors": "Ruslan Lys,  , Yurii Opotyak",
        "published": "2023-5-15",
        "citations": 2,
        "abstract": "This article explores the development of a video surveillance system that utilizes cuttingedge technology to analyze the video stream in real-time, identify motion, and recognize objects within the video stream. The functionality of this system enables it to provide a high level of accuracy in identifying objects, even in low-light conditions or with low-resolution cameras. The software system has been designed as a user-friendly desktop application with the latest technologies and features that will ensure its relevance and easy maintenance in the future. To ensure that the developed desktop application meets common optimization requirements, extensive testing has been conducted to evaluate its resource usage. The resulting system is an efficient and reliable tool for monitoring and detecting movement in various locations, providing enhanced security measures and public safety.",
        "link": "http://dx.doi.org/10.23939/acps2023.01.050"
    },
    {
        "id": 22993,
        "title": "Action and Object Interaction Recognition for Driver Activity Classification",
        "authors": "Patrick Weyers, David Schiebener, Anton Kummert",
        "published": "2019-10",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itsc.2019.8917139"
    },
    {
        "id": 22994,
        "title": "Object recognition system of sports equipment based on convolutional neural network",
        "authors": " Ying-Chen",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00115"
    },
    {
        "id": 22995,
        "title": "Speed up biological inspired object recognition, HMAX",
        "authors": "Hiwa Sufikarimi, Karim Mohammadi",
        "published": "2017-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspis.2017.8311613"
    },
    {
        "id": 22996,
        "title": "Beyond Core Object Recognition: Recurrent processes account for object recognition under occlusion",
        "authors": "Karim Rajaei, Yalda Mohsenzadeh, Reza Ebrahimpour, Seyed-Mahdi Khaligh-Razavi",
        "published": "No Date",
        "citations": 11,
        "abstract": "AbstractCore object recognition, the ability to rapidly recognize objects despite variations in their appearance, is largely solved through the feedforward processing of visual information. Deep neural networks are shown to achieve human-level performance in these tasks, and explain the primate brain representation. On the other hand, object recognition under more challenging conditions (i.e. beyond the core recognition problem) is less characterized. One such example is object recognition under occlusion. It is unclear to what extent feedforward and recurrent processes contribute in object recognition under occlusion. Furthermore, we do not know whether the conventional deep neural networks, such as AlexNet, which were shown to be successful in solving core object recognition, can perform similarly well in problems that go beyond the core recognition. Here, we characterize neural dynamics of object recognition under occlusion, using magnetoencephalography (MEG), while participants were presented with images of objects with various levels of occlusion. We provide evidence from multivariate analysis of MEG data, behavioral data, and computational modelling, demonstrating an essential role for recurrent processes in object recognition under occlusion. Furthermore, the computational model with local recurrent connections, used here, suggests a mechanistic explanation of how the human brain might be solving this problem.Author SummaryIn recent years, deep-learning-based computer vision algorithms have been able to achieve human-level performance in several object recognition tasks. This has also contributed in our understanding of how our brain may be solving these recognition tasks. However, object recognition under more challenging conditions, such as occlusion, is less characterized. Temporal dynamics of object recognition under occlusion is largely unknown in the human brain. Furthermore, we do not know if the previously successful deep-learning algorithms can similarly achieve human-level performance in these more challenging object recognition tasks. By linking brain data with behavior, and computational modeling, we characterized temporal dynamics of object recognition under occlusion, and proposed a computational mechanism that explains both behavioral and the neural data in humans. This provides a plausible mechanistic explanation for how our brain might be solving object recognition under more challenging conditions.",
        "link": "http://dx.doi.org/10.1101/302034"
    },
    {
        "id": 22997,
        "title": "Research on Football object Recognition based on Mixed Gaussian model",
        "authors": "Guo-Hui Lu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00026"
    },
    {
        "id": 22998,
        "title": "Human-object Interaction Recognition Using Multitask Neural Network",
        "authors": "Weihao Yan, Yue Gao, Qiming Liu",
        "published": "2019-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isass.2019.8757767"
    },
    {
        "id": 22999,
        "title": "Active Object Perceiver: Recognition-Guided Policy Learning for Object Searching on Mobile Robots",
        "authors": "Xin Ye, Zhe Lin, Haoxiang Li, Shibin Zheng, Yezhou Yang",
        "published": "2018-10",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros.2018.8593720"
    },
    {
        "id": 23000,
        "title": "Image and Face Recognition using CV Lens Machine Learning Android Application",
        "authors": "C. N. Vanitha, V. N. Jeevaa, S. Prajith Shriman",
        "published": "2019-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaccs.2019.8728435"
    },
    {
        "id": 23001,
        "title": "Belief tree search for active object recognition",
        "authors": "Mohsen Malmir, Garrison W. Cottrell",
        "published": "2017-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros.2017.8206290"
    },
    {
        "id": 23002,
        "title": "Haptic Interface for Proximity Object Recognition Considering Hand Structure",
        "authors": "Takuma Yabe, Hiroaki Yano",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422270"
    },
    {
        "id": 23003,
        "title": "Object-to-Scene: Learning to Transfer Object Knowledge to Indoor Scene Recognition",
        "authors": "Bo Miao, Liguang Zhou, Ajmal Saeed Mian, Tin Lun Lam, Yangsheng Xu",
        "published": "2021-9-27",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros51168.2021.9636700"
    },
    {
        "id": 23004,
        "title": "Role of the secondary visual cortex in HMAX model for object recognition",
        "authors": "Hiwa Sufikarimi, Karim Mohammadi",
        "published": "2020-12",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogsys.2020.07.001"
    },
    {
        "id": 23005,
        "title": "Biologically Inspired Visual System Architecture for Object Recognition in Autonomous Systems",
        "authors": "Dan Malowany, Hugo Guterman",
        "published": "2020-7-11",
        "citations": 6,
        "abstract": "Computer vision is currently one of the most exciting and rapidly evolving fields of science, which affects numerous industries. Research and development breakthroughs, mainly in the field of convolutional neural networks (CNNs), opened the way to unprecedented sensitivity and precision in object detection and recognition tasks. Nevertheless, the findings in recent years on the sensitivity of neural networks to additive noise, light conditions, and to the wholeness of the training dataset, indicate that this technology still lacks the robustness needed for the autonomous robotic industry. In an attempt to bring computer vision algorithms closer to the capabilities of a human operator, the mechanisms of the human visual system was analyzed in this work. Recent studies show that the mechanisms behind the recognition process in the human brain include continuous generation of predictions based on prior knowledge of the world. These predictions enable rapid generation of contextual hypotheses that bias the outcome of the recognition process. This mechanism is especially advantageous in situations of uncertainty, when visual input is ambiguous. In addition, the human visual system continuously updates its knowledge about the world based on the gaps between its prediction and the visual feedback. CNNs are feed forward in nature and lack such top-down contextual attenuation mechanisms. As a result, although they process massive amounts of visual information during their operation, the information is not transformed into knowledge that can be used to generate contextual predictions and improve their performance. In this work, an architecture was designed that aims to integrate the concepts behind the top-down prediction and learning processes of the human visual system with the state-of-the-art bottom-up object recognition models, e.g., deep CNNs. The work focuses on two mechanisms of the human visual system: anticipation-driven perception and reinforcement-driven learning. Imitating these top-down mechanisms, together with the state-of-the-art bottom-up feed-forward algorithms, resulted in an accurate, robust, and continuously improving target recognition model.",
        "link": "http://dx.doi.org/10.3390/a13070167"
    },
    {
        "id": 23006,
        "title": "Online Continual Learning for Robust Indoor Object Recognition",
        "authors": "Umberto Michieli, Mete Ozay",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341474"
    },
    {
        "id": 23007,
        "title": "Object recognition in images using convolutional neural network",
        "authors": "Duth P Sudharshan, Swathi Raj",
        "published": "2018-1",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icisc.2018.8398893"
    },
    {
        "id": 23008,
        "title": "Using the Spontaneous Object Recognition Memory Tasks to Uncover the Neural Circuitry of Recognition Memory",
        "authors": "E.C. Warburton",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00013-6"
    },
    {
        "id": 23009,
        "title": "Phosphodiesterase Inhibitors in Object Recognition and Object Location Memory Tests",
        "authors": "Pim R.A. Heckman, Elentina K. Argyrousi, Jos Prickaerts",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00038-0"
    },
    {
        "id": 23010,
        "title": "Object recognition in images using convolutional neural network",
        "authors": "Duth P. Sudharshan, Swathi Raj",
        "published": "2018-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icisc.2018.8398912"
    },
    {
        "id": 23011,
        "title": "The Roles of Neurotrophins in Novel Object Recognition",
        "authors": "Áine Kelly",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00030-6"
    },
    {
        "id": 23012,
        "title": "An embedded FPGA architecture for efficient visual saliency based object recognition implementation",
        "authors": "Hanen Chenini",
        "published": "2017-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosc.2017.7958715"
    },
    {
        "id": 23013,
        "title": "Simple Domain Adaptation for CAD based Object Recognition",
        "authors": "Kripasindhu Sarkar, Didier Stricker",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007346504290437"
    },
    {
        "id": 23014,
        "title": "Hardware-Oriented Dual Stream Object Recognition System using Binarized Neural Networks",
        "authors": "Yuma Yoshimoto, Hakaru Tamukoh",
        "published": "2020-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscas45731.2020.9180921"
    },
    {
        "id": 23015,
        "title": "A novel one-stage object detection network for multi-scene vehicle attribute recognition",
        "authors": "Jiefei Zhang",
        "published": "2018-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4108/eai.22-11-2021.172217"
    },
    {
        "id": 23016,
        "title": "Nitrinergic Signalling in Object Novelty Recognition",
        "authors": "Elentina K. Argyrousi, Jos Prickaerts",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00037-9"
    },
    {
        "id": 23017,
        "title": "Speeding Up Exploratory Behavior Learning for Object Recognition",
        "authors": "Takuya Sugimoto, Manabu Gouko",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2316/p.2017.854-005"
    },
    {
        "id": 23018,
        "title": "Research on Novel Lightweight Object Detection and Recognition Algorithms",
        "authors": "Qi He, Hao Shen, Yang Jin",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00100"
    },
    {
        "id": 23019,
        "title": "Cone Transform for Size-Tolerant Object Recognition",
        "authors": "C. Lee, J. Lim, S. Woo",
        "published": "2018-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iisa.2018.8633650"
    },
    {
        "id": 23020,
        "title": "Object recognition using multidirectional vision system on soccer robot",
        "authors": "Dhimas Bintang Kusumawardhana, Kusprasapta Mutijarsa",
        "published": "2017-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitsi.2017.8267940"
    },
    {
        "id": 23021,
        "title": "CV of the participants",
        "authors": "",
        "published": "2021-2-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1ks0f3c.23"
    },
    {
        "id": 23022,
        "title": "Visual Object Recognition Task",
        "authors": "Daniela Braida, Luisa Ponzoni, Chiara Verpelli, Mariaelvina Sala",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00008-2"
    },
    {
        "id": 23023,
        "title": "Vehicle Object Detection Using Open CV",
        "authors": "Anshuman Singh, Mihir Raj Singh, Vipin Rai",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-3148-2_23"
    },
    {
        "id": 23024,
        "title": "Image-Based Icons: Effects of Object Recognition, Feature Recognition, and Visual Field for the Design of Learning Management Systems",
        "authors": "Shane Toyohara, Kim-Phuong L. Vu",
        "published": "2023",
        "citations": 0,
        "abstract": "Schools and universities are increasing incorporating digital technology with their curriculum implementation through use of Learning Management Systems (LMS) like Desire2Learn (Blackboard), Canvas, and Schoolloop, just to name a few. With the rise of instructor-side customization options in the LMS, educators may not be experienced in designing features, such as button design. Yet, buttons are the most common point of interaction between a user and the interface, and buttons direct students to information on a specified page. Thus, research on effective and usable options for button design in an educational framework is needed to ensure that LMS interfaces are designed with the user’s performance and ease of use in mind. The present study examined visual search performance using a 3 (button type: image, text, image+text), x 2 (border style: rounded or squared), x 2 (screen size: laptop size or mobile size) within-subjects design. In general, results showed longer search times for text only buttons compared to image and image+text buttons, rounded square borders compared to square borders, and larger than smaller screen sizes. However, these overall effects were qualified by two-way interactions between button type x border style, and button type x screen size, where text buttons paired with square borders and large screen sizes resulted in worse performance. Although image+text buttons yielded similar performance to image only buttons, users preferred image+text buttons. Implications of these findings for design are discussed.",
        "link": "http://dx.doi.org/10.54941/ahfe1004259"
    },
    {
        "id": 23025,
        "title": "Robust Object Recognition with Deep Learning on a Variety of Datasets",
        "authors": "",
        "published": "2023-8-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22266/ijies2023.0831.35"
    },
    {
        "id": 23026,
        "title": "Word-Piece Based Natural Language Recognition for Multimodal Object Retrieval",
        "authors": "Joonyoung Jung, Dong-Oh Kang",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/iccas59377.2023.10317009"
    },
    {
        "id": 23027,
        "title": "Nicotinic Receptor Ligands and Novel Object Recognition",
        "authors": "Patrick M. Callahan, Alvin V. Terry",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00026-4"
    },
    {
        "id": 23028,
        "title": "Active Whisker Placement and Exploration For Rapid Object Recognition",
        "authors": "Martin J. Pearson, Mohammed Salman",
        "published": "2019-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros40897.2019.8968517"
    },
    {
        "id": 23029,
        "title": "The Role of Ketamine in Object Recognition Memory in Rodents",
        "authors": "Nikolaos Pitsikas",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00036-7"
    },
    {
        "id": 23030,
        "title": "Perirhinal Cortex Lesions and Spontaneous Object Recognition Memory in Rats",
        "authors": "John P. Aggleton",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00012-4"
    },
    {
        "id": 23031,
        "title": "Object Recognition from Spherical Camera Images Based on YOLOv3",
        "authors": "Tomohiro Kai, Humin Lu, Tohru Kamiya",
        "published": "2020-10-13",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/iccas50221.2020.9268308"
    },
    {
        "id": 23032,
        "title": "Rhythmic Pruning of Perceptual Noise for Object Recognition in the Hippocampal Memory Systems",
        "authors": "Jae-Rong Ahn, Inah Lee",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3188330"
    },
    {
        "id": 23033,
        "title": "A hybrid active vision system for real time application running object recognition",
        "authors": "Duy Nguyen Phuong",
        "published": "2019-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isdcs.2019.8719101"
    },
    {
        "id": 23034,
        "title": "Object Recognition to Support Navigation Systems for Blind in Uncontrolled Environments",
        "authors": "Marlon Marcon, André Roberto Ortoncelli",
        "published": "2022-7-13",
        "citations": 1,
        "abstract": "Efficient navigation is a challenge for visually impaired people. Several technologies combine sensors, cameras, or feedback chan-nels to increase the autonomy and mobility of visually impaired people. Still, many existing systems are expensive and complexto a blind person’s needs. This work presents a dataset for indoornavigation purposes with annotated ground-truth representingreal-world situations. We also performed a study on the efficiencyof deep-learning-based approaches on such dataset. These resultsrepresent initial efforts to develop a real-time navigation systemfor visually impaired people in uncontrolled indoor environments.We analyzed the use of video-based object recognition algorithms for the automatic detection of five groups of objects: i) fire extin-guisher; ii) emergency sign; iii) attention sign; iv) internal sign, and v) other. We produced an experimental database with 20 minutesand 6 seconds of videos recorded by a person walking throughthe corridors of the largest building on campus. In addition to thetesting database, other contributions of this work are the study onthe efficiency of five state-of-the-art deep-learning-based models(YOLO-v3, YOLO-v3 tiny, YOLO-v4, YOLO-v4 tiny, and YOLO-v4scaled), achieving results above 82% performance in uncontrolledenvironments, reaching up to 93% with YOLO-v4. It was possible toprocess between 62 and 371 Frames Per Second (FPS) concerning thespeed, being the YOLO-v4 tiny architecture, the fastest one. Codeand dataset available at: https://github.com/ICDI/navigation4blind.",
        "link": "http://dx.doi.org/10.14210/cotb.v13.p274-281"
    },
    {
        "id": 23035,
        "title": "Face segmentation based object localisation with deep learning from unconstrained images",
        "authors": "T. Alzahrani, W. Al-Nuaimy",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/cp.2019.0247"
    },
    {
        "id": 23036,
        "title": "Proprioceptive shape signatures for object manipulation and recognition purposes in a robotic hand",
        "authors": "Alex Vásquez, Véronique Perdereau",
        "published": "2017-12",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2017.06.001"
    },
    {
        "id": 23037,
        "title": "Environmental Visual Object Recognition",
        "authors": "David Israel González Aguirre",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-97841-3_5"
    },
    {
        "id": 23038,
        "title": "Enhancing image categorization with the quantized object recognition model in surveillance systems",
        "authors": "Jinming Wang, Fengjun Hu, Ghulam Abbas, Mohammed Albekairi, Nasr Rashid",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122240"
    },
    {
        "id": 23039,
        "title": "Object Decision Task",
        "authors": "M. Jane Riddoch, Glyn W. Humphreys",
        "published": "2022-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003069645-10"
    },
    {
        "id": 23040,
        "title": "Novel object detection and recognition system based on points of interest selection and SVM classification",
        "authors": "R. Bhuvaneswari, Ravi Subban",
        "published": "2018-12",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogsys.2018.09.022"
    },
    {
        "id": 23041,
        "title": "DeepRecog: Threefold underwater image deblurring and object recognition framework for AUV vision systems",
        "authors": "M. V. Pranav, A. V. Shreyas Madhav, Janaki Meena",
        "published": "2022-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00530-021-00851-0"
    },
    {
        "id": 23042,
        "title": "Live Demonstration: Hardware-Oriented Dual Stream Object Recognition System using Binarized Neural Networks",
        "authors": "Yuma Yoshimoto, Hakaru Tamukoh",
        "published": "2020-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscas45731.2020.9180685"
    },
    {
        "id": 23043,
        "title": "Developmental Trajectories of Object and Spatial Recognition Memory in Infant Rhesus Macaques",
        "authors": "Jocelyne Bachevalier",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00011-2"
    },
    {
        "id": 23044,
        "title": "Zero-Shot Learning on Human-Object Interaction Recognition in Video",
        "authors": "Vali Ollah Maraghi, Karim Faez",
        "published": "2019-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspis48872.2019.9066160"
    },
    {
        "id": 23045,
        "title": "VISION SYSTEMS OF UAVs AND SIMULATION OF OBJECT RECOGNITION IN MATLAB ENVIRONMENT",
        "authors": "Tural Safarov",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "In recent years, we are aware of the increase in the production of unmanned aerial vehicles (UAVs), their application in various fields and their future potential. An unmanned aerial vehicle (UAV) is an aircraft without a crew. UAVs can have variable characteristics: they can be remotely piloted or fully automatic. In these articles, we will consider UAVs, which we consider as dynamic objects, to receive the coordinates of ground objects according to their flight modes, to simulate them, to observe them, to draw their images, and to classify the objects in the image according to various characteristics in real time. Among the researches of recent times, the researches related to the detection of moving or stationary objects from real-time images taken from unmanned vehicles are of special importance. Because continuous surveillance cannot be done with old video surveillance systems. Integration with systems that automatically detect and recognize objects is used for continuous monitoring.",
        "link": "http://dx.doi.org/10.31435/rsglobal_ws/30032023/7967"
    },
    {
        "id": 23046,
        "title": "Novel Object Recognition Test v1",
        "authors": "Marina Lorente Picón",
        "published": "No Date",
        "citations": 0,
        "abstract": "Novel Object Recognition Test for mice ",
        "link": "http://dx.doi.org/10.17504/protocols.io.81wgbx99qlpk/v1"
    },
    {
        "id": 23047,
        "title": "Comparative Analysis of Texture Features and Deep Learning Method for Real-time Indoor Object Recognition",
        "authors": "K Jayakanth",
        "published": "2019-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icces45898.2019.9002551"
    },
    {
        "id": 23048,
        "title": "Machine Learning: Object Recognition Web Platform",
        "authors": "Gupta AK, Gupta S",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4172/jcsb.1000289"
    },
    {
        "id": 23049,
        "title": "Extensive survey on smart classroom management system using object recognition systems",
        "authors": "Manit Malhotra, Indu Chhabra",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0074375"
    },
    {
        "id": 23050,
        "title": "Data Augmentation Using Replacement and Synthesis for Enhancing Object Recognition Accuracy in Vision Safety Management Systems",
        "authors": "Jaemin Kim, Ingook Wang, Seulki Lee, J-H Yu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4743459"
    },
    {
        "id": 23051,
        "title": "Situation-aware Framework for Moving Object Detection in Moving Cameras",
        "authors": " Kimin Yun,  Jongin Lim,  Jin Young Choi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/cp.2017.0146"
    },
    {
        "id": 23052,
        "title": "Evaluation of Object Recognition Intelligence of Social Robots",
        "authors": "Miyoung Cho, Minsu Jang, Choulsoo Jang, Daeha Lee",
        "published": "2019-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/iccas47443.2019.8971503"
    },
    {
        "id": 23053,
        "title": "The dorsal visual pathway represents object-centered spatial relations for object recognition",
        "authors": "Vladislav Ayzenberg, Marlene Behrmann",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractAlthough there is mounting evidence that input from the dorsal visual pathway is crucial for object processes in the ventral pathway, the specific functional contributions of dorsal cortex to these processes remain poorly understood. Here, we hypothesized that dorsal cortex computes the spatial relations among an object’s parts – a processes crucial for forming global shape percepts – and transmits this information to the ventral pathway to support object categorization. Using fMRI with human participants (females and males), we discovered regions in the intraparietal sulcus (IPS) that were selectively involved in computing object-centered part relations. These regions exhibited task-dependent functional and effective connectivity with ventral cortex, and were distinct from other dorsal regions, such as those representing allocentric relations, 3D shape, and tools. In a subsequent experiment, we found that the multivariate response of posterior IPS, defined on the basis of part-relations, could be used to decode object category at levels comparable to ventral object regions. Moreover, mediation and multivariate effective connectivity analyses further suggested that IPS may account for representations of part relations in the ventral pathway. Together, our results highlight specific contributions of the dorsal visual pathway to object recognition. We suggest that dorsal cortex is a crucial source of input to the ventral pathway and may support the ability to categorize objects on the basis of global shape.Significance StatementHumans categorize novel objects rapidly and effortlessly. Such categorization is achieved by representing an object’s global shape structure, that is, the relations among object parts. Yet, despite their importance, it is unclear how part relations are represented neurally. Here, we hypothesized that object-centered part relations may be computed by the dorsal visual pathway, which is typically implicated in visuospatial processing. Using fMRI, we identified regions selective for the part relations in dorsal cortex. We found that these regions can support object categorization, and even mediate representations of part relations in the ventral pathway, the region typically thought to support object categorization. Together, these findings shed light on the broader network of brain regions that support object categorization.",
        "link": "http://dx.doi.org/10.1101/2021.11.12.468414"
    },
    {
        "id": 23054,
        "title": "Lightweight Deep Convolutional Network for Tiny Object Recognition",
        "authors": "Thanh-Dat Truong, Vinh-Tiep Nguyen, Minh-Triet Tran",
        "published": "2018",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006752006750682"
    },
    {
        "id": 23055,
        "title": "Object Recognition",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-17885-1_100870"
    },
    {
        "id": 23056,
        "title": "Novel Object Recognition Test in Rodents:",
        "authors": "Valentine Bouet, Thomas Freret, Pascale Schumann-Bard, Michel Boulouard",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00027-6"
    },
    {
        "id": 23057,
        "title": "SISTEM OBJECT RECOGNITION PLAT NOMOR KENDARAAN UNTUK SISTEM PARKIR BANDARA",
        "authors": "Suhartono Suhartono, Satria Gunawan Zain, Sugiawan Sugiawan",
        "published": "2022-11-28",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk mengembangkan alat deteksi plat nomor dengan menggunakan Nvidia Jetson Nano sebagai device dan menggunakan algoritma Yolov5 dengan mendeteksi plat nomor lalu melakukan konversi ke text dalam bentuk excel. Jenis penelitian yang digunakan penulis adalah metode Research and Development. Metode pengumpulan data yang dipakai pada penelitian ini adalah metode teknik observasi. Penelitian dilaksanakan di Laboratorium Embedded System. Tahapan penelitian ini mulai dari tahap potensi dan masalah, pengumpulan kebutuhan, studi literasi, membangun prototype, perancangan sistem, dan pengujian system. Dataset dikumpulkan dengan menggunakan kamera webcam dan smarthphone dengan total 1497 dataset terhadap 2 kategori. Perancangan model dataset dengan yolov5 menghasilkan 2 model yakni best.pt dan last.pt dengan validasi 100% dan size model sebesar 14.3 MB total 24.6 MB. Pengujian sistem dilakukan dengan mendeteksi plat nomor kendaraan sebanyak 2 tahap. Tahap pertama sebesar 83% dan rata-rata akurasi konversi ke text dengan Tesseract-OCR sebesar 97.89%. sedangkan pengujian deteksi tahap kedua pada akurasi deteksi plat nomor sebesar 98% dan konversi ke text sebesar 99.49%..   ",
        "link": "http://dx.doi.org/10.26858/jessi.v3i2.38458"
    },
    {
        "id": 23058,
        "title": "Lifelong ensemble learning based on multiple representations for few-shot object recognition",
        "authors": "Hamidreza Kasaei, Songsong Xiong",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104615"
    },
    {
        "id": 23059,
        "title": "Object Recognition System under Hazy Condition for Automated Driving Systems",
        "authors": "Yucheng Xu, Keizo Miyahara",
        "published": "2023-6-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cis-ram55796.2023.10370756"
    },
    {
        "id": 23060,
        "title": "Correlates of Object Exploration and Recognition Memory in Mouse Anterior Cingulate Cortex",
        "authors": "Aldis Patrick Weible",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00016-1"
    },
    {
        "id": 23061,
        "title": "Disruption of Object Recognition Systems",
        "authors": "Utsav Das, Aman Gupta, Onkar Singh Bagga, Manoj Sabnis",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-30465-2_56"
    },
    {
        "id": 23062,
        "title": "The Amygdala and Emotional Arousal Effects on Object Recognition Memory",
        "authors": "Benno Roozendaal, Areg Barsegyan, Yanfen Chen",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00017-3"
    },
    {
        "id": 23063,
        "title": "Robust Object Recognition Through Symbiotic Deep Learning In Mobile Robots",
        "authors": "Joao Cartucho, Rodrigo Ventura, Manuela Veloso",
        "published": "2018-10",
        "citations": 57,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros.2018.8594067"
    },
    {
        "id": 23064,
        "title": "Moving object recognition based on SVM and binary decision tree",
        "authors": "Yingjie Fu, Dazhong Ma, Huaguang Zhang, Li Zheng",
        "published": "2017-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ddcls.2017.8068122"
    },
    {
        "id": 23065,
        "title": "Three-dimensional Object Recognition via Subspace Representation on a Grassmann Manifold",
        "authors": "Ryoma Yataka, Kazuhiro Fukui",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006204702080216"
    },
    {
        "id": 23066,
        "title": "Remote Perception Attacks against Camera-based Object Recognition Systems and Countermeasures",
        "authors": "Yanmao Man, Ming Li, Ryan Gerdes",
        "published": "2023-5-17",
        "citations": 0,
        "abstract": "In vision-based object recognition systems imaging sensors perceive the environment and then objects are detected and classified for decision-making purposes; e.g., to maneuver an automated vehicle around an obstacle or to raise alarms for intruders in surveillance settings. In this work we demonstrate how camera-based perception can be unobtrusively manipulated to enable an attacker to create spurious objects or alter an existing object, by remotely projecting adversarial patterns into cameras, exploiting two common effects in optical imaging systems, viz., lens flare/ghost effects and auto-exposure control. To improve the robustness of the attack, we generate optimal patterns by integrating adversarial machine learning techniques with a trained end-to-end channel model. We experimentally demonstrate our attacks using a low-cost projector on three different cameras, and under different environments. Results show that, depending on the attack distance, attack success rates can reach as high as 100%, including under targeted conditions. We develop a countermeasure that reduces the problem of detecting ghost-based attacks into verifying whether there is a ghost overlapping with a detected object. We leverage spatiotemporal consistency to eliminate false positives. Evaluation on experimental data provides a worst-case equal error rate of 5%.",
        "link": "http://dx.doi.org/10.1145/3596221"
    },
    {
        "id": 23067,
        "title": "On Metods of Graphic Object Recognition Based on DTW Metric",
        "authors": "Ivan M. Gostev",
        "published": "2019-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sosg.2019.8706717"
    },
    {
        "id": 23068,
        "title": "Marine Object Recognition Based on Deep Learning",
        "authors": "Bo Shi, Hao Zhou",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/cnci-19.2019.43"
    },
    {
        "id": 23069,
        "title": "Object Recognition System using Deep Learning with Depth Images for Service Robots",
        "authors": "Yuma Yoshimoto, Hakaru Tamukoh",
        "published": "2018-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ispacs.2018.8923533"
    },
    {
        "id": 23070,
        "title": "The Role of Cholinergic System in Novel Object Recognition",
        "authors": "Giancarlo Pepeu, Carla Scali, Maria Grazia Giovannini",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-812012-5.00025-2"
    }
]