[
    {
        "id": 19871,
        "title": "Analysis and Contributions of Classical Techniques for Path Planning",
        "authors": "Lidia Rocha, Kelen Vivaldini",
        "published": "2021-10-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre54079.2021.9605425"
    },
    {
        "id": 19872,
        "title": "Advancement in navigational path planning of robots using various artificial and computing techniques",
        "authors": "Dayal R Parhi",
        "published": "2018-4-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15406/iratj.2018.04.00109"
    },
    {
        "id": 19873,
        "title": "Preference Based Multi-Objective Optimization Techniques for Coverage Path Planning of a Mobile Robot",
        "authors": "Monex Sharma, Hari Kumar Voruganti",
        "published": "2023-7-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3610419.3610438"
    },
    {
        "id": 19874,
        "title": "Optimal guidance track generation for precision agriculture: A review of coverage path planning techniques",
        "authors": "Maria Höffmann, Shruti Patel, Christof Büskens",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "AbstractThe Complete Coverage Path Planning (CCPP) problem is a subfield of industrial motion planning that has applications in various domains, ranging from mobile robotics to treatment applications. Especially in precision agriculture with a high level of automation, the use of CCPP techniques is essential for efficient resource utilization, reduced soil compaction, and increased yields. This paper reviews the CCPP problem in the context of machines operating in agricultural fields and proposes a methodological approach consisting of three steps: Generating the Guidance Tracks (i.e., the track system along which the path should be oriented), determining the traversing sequence through these tracks, and planning a smooth and drivable path. This paper provides an in‐depth review of optimization‐based approaches that deal with the first step, the generation of the guidance track system. Thereby, a comprehensive and pedagogical approach for the generation of guidance tracks for arbitrarily shaped two‐dimensional regions of interest is provided, along with an overview and detailed elaboration on different exact cellular decomposition techniques found in literature. Furthermore, cost functions are outlined for the different approaches presented in this work, which are utilized to generate optimal guidance tracks. Finally, this survey serves as an introductory guide for research and practitioners to solve the CCPP problem effectively and efficiently.",
        "link": "http://dx.doi.org/10.1002/rob.22286"
    },
    {
        "id": 19875,
        "title": "Path Planning Techniques for Mobile Robots A Review",
        "authors": "Sean Campbell, Niall O'Mahony, Anderson Carvalho, Lenka Krpalkova, Daniel Riordan, Joseph Walsh",
        "published": "2020-2",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmre49073.2020.9065187"
    },
    {
        "id": 19876,
        "title": "Practical path planning techniques in overtaking for autonomous shuttles",
        "authors": "Ehsan Malayjerdi, Raivo Sell, Mohsen Malayjerdi, Andres Udal, Mauro Bellone",
        "published": "2022-6",
        "citations": 7,
        "abstract": "AbstractThis paper proposes a reliable optimized sigmoid‐based path planning algorithm that ensures smooth, fast and safe overtaking maneuver, while maintaining the necessary safety distance. In the proposed method, the desired smoothness of trajectories, the changes in steering angle and the lateral acceleration are controlled in a robust way. This paper describes the simulations, and the confirming real‐world experiments, conducted using the autonomous shuttle iseAuto. Our results suggest that the sigmoid A‐star algorithm leads to a smoother and more reliable motion when compared to other two standard methods. Specifically, the abruptness of necessary steering angle changes is reduced by factor of 4, and approaching the level of an experienced driver‐like maneuver.",
        "link": "http://dx.doi.org/10.1002/rob.22057"
    },
    {
        "id": 19877,
        "title": "Performance analysis of path planning techniques for autonomous robots",
        "authors": "Lidia G. S. Rocha, Pedro H. C. Kim, Kelen C. Teixeira Vivaldini",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s41315-023-00298-8"
    },
    {
        "id": 19878,
        "title": "A Time-Varying Adaptive Inertia Weight based Modified PSO Algorithm for UAV Path Planning",
        "authors": "Golam Moktader Nayeem, Mingyu Fan, Yasmin Akhter",
        "published": "2021-1-5",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icrest51555.2021.9331101"
    },
    {
        "id": 19879,
        "title": "Motion and Path Planning",
        "authors": "Kris Hauser",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-642-41610-1_165-1"
    },
    {
        "id": 19880,
        "title": "Smooth path and velocity planning under 3D path constraints for car-like vehicles",
        "authors": "He Zhang, Shaowei Yang",
        "published": "2018-9",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2018.05.013"
    },
    {
        "id": 19881,
        "title": "Robot Path Planning with Safety Zones",
        "authors": "Evis Plaku, Arben Çela, Erion Plaku",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012162100003543"
    },
    {
        "id": 19882,
        "title": "Mobile robot’s path-planning and path-tracking in static and dynamic environments: Dynamic programming approach",
        "authors": "Arash Marashian, Abolhassan Razminia",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104592"
    },
    {
        "id": 19883,
        "title": "Search-Based Planning and Replanning in Robotics and Autonomous Systems",
        "authors": "An T. Le, Than D. Le",
        "published": "2018-9-26",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.71663"
    },
    {
        "id": 19884,
        "title": "Path Planning",
        "authors": "Gregor Klančar, Andrej Zdešar, Sašo Blažič, Igor Škrjanc",
        "published": "2017",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-804204-5.00004-4"
    },
    {
        "id": 19885,
        "title": "AND/OR search techniques for chance constrained motion primitive path planning",
        "authors": "Geordan Gutow, Jonathan D. Rogers",
        "published": "2022-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2021.103991"
    },
    {
        "id": 19886,
        "title": "iPlanner: Imperative Path Planning",
        "authors": "Fan Yang, Chen Wang, Cesar Cadena, Marco Hutter",
        "published": "2023-7-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.064"
    },
    {
        "id": 19887,
        "title": "Multi-Agent Collaborative Path Planning Based on Staying Alive Policy",
        "authors": "Anton Koval, Sina Sharif Mansouri, George Nikolakopoulos",
        "published": "2020-11-28",
        "citations": 6,
        "abstract": "Modern mobile robots tend to be used in numerous exploration and search and rescue applications. Essentially they are coordinated by human operators and collaborate with inspection or rescue teams. Over the time, robots became more advanced and capable for various autonomous collaborative scenarios. Recent advances in the field of collaborative exploration and coverage provide different approaches to solve this objective. Thus scope of this article is to present a novel collaborative approach for multi-agent coordination in exploration and coverage of unknown complex indoor environments. Fundamentally, the task of collaborative exploration can be divided into two core components. The principal one is a sensor based exploration scheme that aims to guarantee complete area exploration and coverage. The second core component proposed is a staying alive policy that takes under consideration the battery charge level limitation of the agents. From this perspective the path planner assigns feasible tasks to each of the agents, including the capability of providing reachable, collision free paths. The overall efficacy of the proposed approach was extensively evaluated by multiple simulation results in a complex unknown environments.",
        "link": "http://dx.doi.org/10.3390/robotics9040101"
    },
    {
        "id": 19888,
        "title": "Bi-objective path planning using deterministic algorithms",
        "authors": "Mansoor Davoodi",
        "published": "2017-7",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2017.03.021"
    },
    {
        "id": 19889,
        "title": "Classical and Heuristic Approaches for Mobile Robot Path Planning: A Survey",
        "authors": "Jaafar Ahmed Abdulsaheb, Dheyaa Jasim Kadhim",
        "published": "2023-6-27",
        "citations": 8,
        "abstract": "The most important research area in robotics is navigation algorithms. Robot path planning (RPP) is the process of choosing the best route for a mobile robot to take before it moves. Finding an ideal or nearly ideal path is referred to as “path planning optimization.” Finding the best solution values that satisfy a single or a number of objectives, such as the shortest, smoothest, and safest path, is the goal. The objective of this study is to present an overview of navigation strategies for mobile robots that utilize three classical approaches, namely: the roadmap approach (RM), cell decomposition (CD), and artificial potential fields (APF), in addition to eleven heuristic approaches, including the genetic algorithm (GA), ant colony optimization (ACO), artificial bee colony (ABC), gray wolf optimization (GWO), shuffled frog-leaping algorithm (SFLA), whale optimization algorithm (WOA), bacterial foraging optimization (BFO), firefly (FF) algorithm, cuckoo search (CS), and bat algorithm (BA), which may be used in various environmental situations. Multiple issues, including dynamic goals, static and dynamic environments, multiple robots, real-time simulation, kinematic analysis, and hybrid algorithms, are addressed in a different set of articles presented in this study. A discussion, as well as thorough tables and charts, will be presented at the end of this work to help readers understand what types of strategies for path planning are developed for use in a wide range of ecological contexts. Therefore, this work’s main contribution is that it provides a broad view of robot path planning, which will make it easier for scientists to study the topic in the near future.",
        "link": "http://dx.doi.org/10.3390/robotics12040093"
    },
    {
        "id": 19890,
        "title": "Intelligent path planning for cognitive mobile robot based on Dhouib-Matrix-SPP method",
        "authors": "Souhail Dhouib",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogr.2024.02.001"
    },
    {
        "id": 19891,
        "title": "ECO-CPP: Energy constrained online coverage path planning",
        "authors": "Sedat Dogru, Lino Marques",
        "published": "2022-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2022.104242"
    },
    {
        "id": 19892,
        "title": "Path Planning",
        "authors": "Reza N. Jazar",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-93220-6_12"
    },
    {
        "id": 19893,
        "title": "Towards Establishing Path Planning Strategies For Autonomous UAVs; A Brief SurveySummary on Recent Techniques",
        "authors": "Anees Ul Husnain, Norrima Mokhtar, Noraisyah Mohamed Shah, Mahidzal Dahari",
        "published": "2021-1-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5954/icarob.2021.os1-4"
    },
    {
        "id": 19894,
        "title": "Retracted: Reinforcement Learning-Based Continuous Action Space Path Planning Method for Mobile Robots",
        "authors": "Journal of Robotics",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "link": "http://dx.doi.org/10.1155/2024/9819037"
    },
    {
        "id": 19895,
        "title": "Global path guided vehicle obstacle avoidance path planning with artificial potential field method",
        "authors": "Yangde Chen, Peiliang Wang, Zichen Lin, Chenhao Sun",
        "published": "2023-3",
        "citations": 0,
        "abstract": "AbstractAn artificial potential field method based on global path guidance (G‐APF) is proposed for target unreachability and local minima problems of the conventional artificial potential field (APF) method in complex environments with dynamic obstacles. First, for the target unreachability problem, the global path attraction is added to the APF; second, an obstacle detection optimisation method is proposed and the optimal virtual target point is selected by setting the evaluation function to improve the local minima problem; finally, based on the obstacle detection optimisation method, the gravitational and repulsive processes are improved so that the path can pass through the narrow channel smoothly and remain collision‐free. Experiments show that the method optimises 40.8% of the total path corners, reduces 81.8% of the number of path oscillations, and shortens 4.3% of the path length in Map 1. It can be applied to the vehicle obstacle avoidance path planning problem in complex environments with dynamic obstacles.",
        "link": "http://dx.doi.org/10.1049/csy2.12082"
    },
    {
        "id": 19896,
        "title": "Safe deep learning-based global path planning using a fast collision-free path generator",
        "authors": "Shirin Chehelgami, Erfan Ashtari, Mohammad Amin Basiri, Mehdi Tale Masouleh, Ahmad Kalhor",
        "published": "2023-5",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104384"
    },
    {
        "id": 19897,
        "title": "C2-continuous Path Planning by Combining Bernstein-Bézier Curves",
        "authors": "Gregor Klančar, Sašo Blažič, Andrej Zdešar",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006406602540261"
    },
    {
        "id": 19898,
        "title": "Path Planning Incorporating Semantic Information for Autonomous Robot Navigation",
        "authors": "Silya Achat, Julien Marzat, Julien Moras",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011134300003271"
    },
    {
        "id": 19899,
        "title": "Modified Spline-based Path Planning for Autonomous Ground Vehicle",
        "authors": "Evgeni Magid, Roman Lavrenov, Airat Khasianov",
        "published": "2017",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006442601320141"
    },
    {
        "id": 19900,
        "title": "Chance Constrained Simultaneous Path Planning and Task Assignment for Multiple Robots with Stochastic Path Costs",
        "authors": "Fan Yang, Nilanjan Chakraborty",
        "published": "2020-5",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra40945.2020.9197354"
    },
    {
        "id": 19901,
        "title": "Evolutionary Computation Techniques for Path Planning Problems in Industrial Robotics: A State-of-the-Art Review",
        "authors": "Martin Juříček, Roman Parák, Jakub Kůdela",
        "published": "2023-12-4",
        "citations": 1,
        "abstract": "The significance of robot manipulators in engineering applications and scientific research has increased substantially in recent years. The utilization of robot manipulators to save labor and increase production accuracy is becoming a common practice in industry. Evolutionary computation (EC) techniques are optimization methods that have found their use in diverse engineering fields. This state-of-the-art review focuses on recent developments and progress in their applications for industrial robotics, especially for path planning problems that need to satisfy various constraints that are implied by both the geometry of the robot and its surroundings. We discuss the most-used EC method and the modifications that suit this particular purpose, as well as the different simulation environments that are used for their development. Lastly, we outline the possible research gaps and the expected directions future research in this area will entail.",
        "link": "http://dx.doi.org/10.3390/computation11120245"
    },
    {
        "id": 19902,
        "title": "Autonomous Robot Path Planning and Internet of Things",
        "authors": "Hamed Fazlollahtabar",
        "published": "2017-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.19080/raej.2018.01.555574"
    },
    {
        "id": 19903,
        "title": "Coverage Path Planning in Belief Space",
        "authors": "Robert Schirmer, Peter Biber, Cyrill Stachniss",
        "published": "2019-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8793969"
    },
    {
        "id": 19904,
        "title": "Intelligent vehicle perpendicular parking path planning and tracking control",
        "authors": "Huan Guo",
        "published": "2022-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isoirs57349.2022.00026"
    },
    {
        "id": 19905,
        "title": "Time-energy consumption optimal path-constrained trajectory planning of excavator robotics",
        "authors": "Yunyue Zhang, Zhiyi Sun, Qianlai Sun, Yin Wang",
        "published": "No Date",
        "citations": 0,
        "abstract": "During the cyclic operation process of hydraulic excavators, based on\nmanual experience, issues such as low work efficiency and high energy\nconsumption can cause significantly high wearing of the joints of the\nexcavator; this markedly affects the service life of the excavator. To\nsolve such issues, we propose a secondary trajectory optimization method\nbased on time–energy consumption that enables the excavator to conduct\nsmooth, efficient, and low-energy-consumption work. Considering\ndifferent weight coefficient values and obtaining the optimal\ntime–energy trajectory, we compare the above-mentioned results with\nthose obtained through skilled manual operation of hydraulic excavators.\nThe experimental results demonstrate that through reasonable and\neffective planning of each joint movement, the large jerk that occurs\nduring joint movement processes may be effectively avoided, the working\nefficiency of the excavator is improved, unnecessary energy consumption\nis reduced, and the excavator can operate autonomously under stable\nconditions. These results verify the effectiveness and feasibility of\nthe proposed method.",
        "link": "http://dx.doi.org/10.22541/au.168537987.72396830/v1"
    },
    {
        "id": 19906,
        "title": "Coverage Path Planning Under the Energy Constraint",
        "authors": "Minghan Wei, Volkan Isler",
        "published": "2018-5",
        "citations": 36,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2018.8462867"
    },
    {
        "id": 19907,
        "title": "Path Planning and Collision Avoidance",
        "authors": "Hubert Gattringer, Andreas Müller, Klemens Springer",
        "published": "2020-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429347474-7"
    },
    {
        "id": 19908,
        "title": "Critical Path Method – II",
        "authors": "Vijay Kumar Bansal",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003428992-6"
    },
    {
        "id": 19909,
        "title": "Scheduling and Path-Planning for Operator Oversight of Multiple Robots",
        "authors": "Sebastián A. Zanlongo, Peter Dirksmeier, Philip Long, Taskin Padir, Leonardo Bobadilla",
        "published": "2021-4-6",
        "citations": 6,
        "abstract": "There is a need for semi-autonomous systems capable of performing both automated tasks and supervised maneuvers. When dealing with multiple robots or robots with high complexity (such as humanoids), we face the issue of effectively coordinating operators across robots. We build on our previous work to present a methodology for designing trajectories and policies for robots such that a few operators can supervise multiple robots. Specifically, we: (1) Analyze the complexity of the problem, (2) Design a procedure for generating policies allowing operators to oversee many robots, (3) Present a method for designing policies and robot trajectories to allow operators to oversee multiple robots, and (4) Include both simulation and hardware experiments demonstrating our methodologies.",
        "link": "http://dx.doi.org/10.3390/robotics10020057"
    },
    {
        "id": 19910,
        "title": "Critical Path Method – I",
        "authors": "Vijay Kumar Bansal",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003428992-5"
    },
    {
        "id": 19911,
        "title": "Separating Concerns in Robot Arm Motion Path Planning",
        "authors": "Evgeniy Krastev",
        "published": "2019-2-27",
        "citations": 0,
        "abstract": "The current state of robotic operating systems and application software does not offer enough ease of programming, reusability and adaptability to changes. Most of the algorithms for motion control are implemented in terms of older programming languages and concepts. This paper illustrates the advantages of employing object-oriented principles in designing computational algorithms in robotics. The novelty in the proposed approach is the application of the Separation of concerns principle in solving the inverse kinematic problem for motion control of redundant robot arms along a prescribed path in task space. The obtained model is ready for software implementation that adapts to changes in geometry and motion control subject to different quality criteria.",
        "link": "http://dx.doi.org/10.19080/raej.2019.04.555633"
    },
    {
        "id": 19912,
        "title": "Obstacle Recognition and Path Planning of UAV Flight",
        "authors": "Zhenwei Zhang",
        "published": "2021-10-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/crc52766.2021.9620154"
    },
    {
        "id": 19913,
        "title": "Motion planning in Irreducible Path Spaces",
        "authors": "Andreas Orthey, Olivier Roussel, Olivier Stasse, Michel Taïx",
        "published": "2018-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2018.08.012"
    },
    {
        "id": 19914,
        "title": "Vision-based intelligent path planning for SCARA arm",
        "authors": "Yogesh Gautam, Bibek Prajapati, Sandeep Dhakal, Bibek Pandeya, Bijendra Prajapati",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogr.2021.09.002"
    },
    {
        "id": 19915,
        "title": "Path Planning and Obstacles Avoidance using Switching Potential Functions",
        "authors": "Giuseppe Fedele, Luigi D'Alfonso, Francesco Chiaravalloti, Gaetano D'Aquila",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006427703430350"
    },
    {
        "id": 19916,
        "title": "Path planning at roundabouts using piecewise linear continuous curvature curves",
        "authors": "Junior A. R. Silva, Valdir Grassi",
        "published": "2017-11",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sbr-lars-r.2017.8215288"
    },
    {
        "id": 19917,
        "title": "OGPR: An Obstacle-Guided Path Refinement Approach for Mobile Robot Path Planning",
        "authors": "Mohamed G. B. Atia, Omar Salah, Haitham Ei-Hussieny",
        "published": "2018-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/robio.2018.8665080"
    },
    {
        "id": 19918,
        "title": "Real-time Model Based Path Planning for Wheeled Vehicles",
        "authors": "Julian Jordan, Andreas Zell",
        "published": "2019-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8794133"
    },
    {
        "id": 19919,
        "title": "Proposed Smooth-STC Algorithm for Enhanced Coverage Path Planning Performance in Mobile Robot Applications",
        "authors": "Hai Van Pham, Philip Moore, Dinh Xuan Truong",
        "published": "2019-6-11",
        "citations": 12,
        "abstract": "Robotic path planning is a field of research which is gaining traction given the broad domains of interest to which path planning is an important systemic requirement. The aim of path planning is to optimise the efficacy of robotic movement in a defined operational environment. For example, robots have been employed in many domains including: Cleaning robots (such as vacuum cleaners), automated paint spraying robots, window cleaning robots, forest monitoring robots, and agricultural robots (often driven using satellite and geostationary positional satellite data). Additionally, mobile robotic systems have been utilised in disaster areas and locations hazardous to humans (such as war zones in mine clearance). The coverage path planning problem describes an approach which is designed to determine the path that traverses all points in a defined operational environment while avoiding static and dynamic (moving) obstacles. In this paper we present our proposed Smooth-STC model, the aim of the model being to identify an optimal path, avoid all obstacles, prevent (or at least minimise) backtracking, and maximise the coverage in any defined operational environment. The experimental results in a simulation show that, in uncertain environments, our proposed smooth STC method achieves an almost absolute coverage rate and demonstrates improvement when measured against alternative conventional algorithms.",
        "link": "http://dx.doi.org/10.3390/robotics8020044"
    },
    {
        "id": 19920,
        "title": "An Effective Algorithmic Framework for Near Optimal Multi-robot Path Planning",
        "authors": "Jingjin Yu, Daniela Rus",
        "published": "2018",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-51532-8_30"
    },
    {
        "id": 19921,
        "title": "RL-based path planning for an over-actuated floating vehicle under disturbances",
        "authors": "Konstantinos Blekas, Kostas Vlachos",
        "published": "2018-3",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2017.12.009"
    },
    {
        "id": 19922,
        "title": "Inverse Kinematic Solver Based on Bat Algorithm for Robotic Arm Path Planning",
        "authors": "Mohamed Slim, Nizar Rokbani, Bilel Neji, Mohamed Ali Terres, Taha Beyrouthy",
        "published": "2023-3-9",
        "citations": 3,
        "abstract": "The bat algorithm (BA) is a nature inspired algorithm which is mimicking the bio-sensing characteristics of bats, known as echolocation. This paper suggests a Bat-based meta-heuristic for the inverse kinematics problem of a robotic arm. An intrinsically modified BA is proposed to find an inverse kinematics (IK) solution, respecting a minimum variation of the joints’ elongation from the initial configuration of the robot manipulator to the proposed new pause position. The proposed method is called IK-BA, it stands for a specific bat algorithm dedicated to robotic-arms’ inverse geometric solution, and where the elongation control mechanism is embedded in bat agents update equations. Performances analysis and comparatives to related state of art meta-heuristics solvers showed the effectiveness of the proposed IK bat solver for single point IK planning as well as for geometric path planning, which may have several industrial applications. IK-BA was also applied to a real robotic arm with a spherical wrist as a proof of concept and pertinence of the proposed approach.",
        "link": "http://dx.doi.org/10.3390/robotics12020038"
    },
    {
        "id": 19923,
        "title": "Terminal Path Planning of Industrial Robot",
        "authors": "Yixuan Yan, Jiancun Liu, Wei Li",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscer58777.2023.00060"
    },
    {
        "id": 19924,
        "title": "A novel collaborative path planning algorithm for 3-wheel omnidirectional Autonomous Mobile Robot",
        "authors": "Meltem Eyuboglu, Gokhan Atali",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104527"
    },
    {
        "id": 19925,
        "title": "Randomized algorithm for informative path planning with budget constraints",
        "authors": "Sankalp Arora, Sebastian Scherer",
        "published": "2017-5",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2017.7989582"
    },
    {
        "id": 19926,
        "title": "Path Planning Tolerant to Degraded Locomotion Conditions",
        "authors": "Xiaoling Long, Soren Schwertfeger",
        "published": "2019-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssrr.2019.8848980"
    },
    {
        "id": 19927,
        "title": "Optimal motion planning based on path length minimisation",
        "authors": "Jinu Krishnan, U.P. Rajeev, J. Jayabalan, D.S. Sheela",
        "published": "2017-8",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2017.04.014"
    },
    {
        "id": 19928,
        "title": "Aerial Robotics in Urban Environments: Optimized Path Planning and SITL Assessments",
        "authors": "Seyyed-Ahmad Abtahi, M.A. Amiri Atashgah, Bahram Tarvirdizadeh, Mohammad Shahbazi",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icrom60803.2023.10412604"
    },
    {
        "id": 19929,
        "title": "Improved Manipulator Obstacle Avoidance Path Planning Based on Potential Field Method",
        "authors": "Ming Zhao, Xiaoqing Lv",
        "published": "2020-1-22",
        "citations": 9,
        "abstract": "Aiming at the existing artificial potential field method, it still has the defects of easy to fall into local extremum, low success rate and unsatisfactory path when solving the problem of obstacle avoidance path planning of manipulator. An improved method for avoiding obstacle path of manipulator is proposed. First, the manipulator is subjected to invisible obstacle processing to reduce the possibility of its own collision. Second, establish dynamic virtual target points to enhance the predictive ability of the manipulator to the road ahead. Then, the artificial potential field method is used to guide the manipulator movement. When the manipulator is in a local extreme or oscillating, the extreme point jump-out function is used in real time to make the end point of the manipulator produce small displacements and change the action direction to effectively jump out of the dilemma. Finally, the manipulator is controlled to avoid all obstacles and move smoothly to form a spatial optimization path from the start point to the end point. The simulation experiment shows that the proposed method is more suitable for complex working environment and effectively improves the success rate of manipulator path planning, which provides a reference for further developing the application of manipulator in complex environment.",
        "link": "http://dx.doi.org/10.1155/2020/1701943"
    },
    {
        "id": 19930,
        "title": "CAPABILITY ITERATION NETWORK FOR ROBOT PATH PLANNING, 266-272.",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2316/j.2022.206-0598"
    },
    {
        "id": 19931,
        "title": "Fast Stochastic Functional Path Planning in Occupancy Maps",
        "authors": "Gilad Francis, Lionel Ott, Fabio Ramos",
        "published": "2019-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8794118"
    },
    {
        "id": 19932,
        "title": "An RRT-Based Path Planning Strategy in a Dynamic Environment",
        "authors": "Yijing Li",
        "published": "2021-2-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icara51699.2021.9376472"
    },
    {
        "id": 19933,
        "title": "Vision Based Collaborative Path Planning for Micro Aerial Vehicles",
        "authors": "Sai Vemprala, Srikanth Saripalli",
        "published": "2018-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2018.8462910"
    },
    {
        "id": 19934,
        "title": "Mobile Robot Path Planning in 2D space: A survey",
        "authors": "Zishu Chai, Zongyuan Zhang",
        "published": "2022-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscer55570.2022.00015"
    },
    {
        "id": 19935,
        "title": "Sub-1.5 Time-Optimal Multi-Robot Path Planning on Grids in Polynomial Time",
        "authors": "Teng Guo, Jingjin Yu",
        "published": "2022-6-27",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15607/rss.2022.xviii.057"
    },
    {
        "id": 19936,
        "title": "An indoor path planning and motion planning method based on POMDP",
        "authors": "Wenjie Dong, Xiaozhi Qi, Zhixian Chen, Chao Song, Xiaojun Yang",
        "published": "2017-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/robio.2017.8324640"
    },
    {
        "id": 19937,
        "title": "Informed sampling space driven robot informative path planning",
        "authors": "Pradeep Chintam, Tingjun Lei, Batuhan Osmanoglu, Ying Wang, Chaomin Luo",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2024.104656"
    },
    {
        "id": 19938,
        "title": "Moving object removal and surface mesh mapping for path planning on 3D terrain",
        "authors": "Yoshitaka Hara, Masahiro Tomono",
        "published": "2020-3-18",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/01691864.2020.1717375"
    },
    {
        "id": 19939,
        "title": "A Time-Efficient Co-Operative Path Planning Model Combined with Task Assignment for Multi-Agent Systems",
        "authors": "Sumana Biswas, Sreenatha G. Anavatti, Matthew A. Garratt",
        "published": "2019-4-26",
        "citations": 5,
        "abstract": "Dealing with uncertainties along with high-efficiency planning for task assignment problem is still challenging, especially for multi-agent systems. In this paper, two frameworks—Compromise View model and the Nearest-Neighbour Search model—are analyzed and compared for co-operative path planning combined with task assignment of a multi-agent system in dynamic environments. Both frameworks are capable of dynamically controlling a number of autonomous agents to accomplish multiple tasks at different locations. Furthermore, these two models are capable of dealing with dynamically changing environments. In both approaches, the Particle Swarm Optimization-based method is applied for path planning. The path planning approach combined with the obstacle avoidance strategy is integrated with the task assignment problem. In one framework, the Compromise View model is used for completing the tasks and a combination of clustering method with the Nearest-Neighbour Search model is used to assign tasks to the other framework. The frameworks are compared in terms of computational time and the resulting path length. Results indicate that the Nearest-Neighbour Search model is much faster than the Compromise View model. However, the Nearest-Neighbour Search model generates longer paths to accomplish the mission. By following the Nearest-Neighbour Search approach, agents can successfully accomplish their mission, even under uncertainties such as malfunction of individual agents. The Nearest-Neighbour Search framework is highly effective due to its reactive structure. As per requirements, to save time, after completing its own tasks, one agent can complete the remaining tasks of other agents. The simulation results show that the Nearest-Neighbour Search model is an effective and robust way of solving co-operative path planning combined with task assignment problems.",
        "link": "http://dx.doi.org/10.3390/robotics8020035"
    },
    {
        "id": 19940,
        "title": "Path Planning of a Mobile Robot in Grid Space using Boundary Node Method",
        "authors": "R. Saeed, Diego Recupero",
        "published": "2019",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007747301590166"
    },
    {
        "id": 19941,
        "title": "Path Planning of Autonomous Driving Based on Quadratic Optimization",
        "authors": "Yi Wei, Haiqin Xu",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccar57134.2023.10151702"
    },
    {
        "id": 19942,
        "title": "2D Path Planning by Lion Swarm Optimization",
        "authors": "Yinzuo Yang, Mingyan Jiang, Wenyang Li",
        "published": "2020-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icras49812.2020.9135053"
    },
    {
        "id": 19943,
        "title": "Optimal Path Planning for ω-regular Objectives with Abstraction-Refinement",
        "authors": "Yoke Peng Leong, Pavithra Prabhakar",
        "published": "2019-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8794209"
    },
    {
        "id": 19944,
        "title": "Manipulator path planning based on improved Informed RRT* and polynomial trajectory optimization",
        "authors": "Hui Qi, Kunwei Li",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosr59980.2023.00017"
    },
    {
        "id": 19945,
        "title": "Motion Planning (In)feasibility Detection using a Prior Roadmap via Path and Cut Search",
        "authors": "Yoonchang Sung, Peter Stone",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.060"
    },
    {
        "id": 19946,
        "title": "Efficient Path Planning and Real-Time Obstacle Avoidance for Mobile Robots",
        "authors": "Siyu Wan",
        "published": "2020-11-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icrae50850.2020.9310866"
    },
    {
        "id": 19947,
        "title": "Robot Path Planning based on Probabilistic Roadmaps and Velocity Potential Field in Complex Environment",
        "authors": "Long Zhang",
        "published": "2022-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosr57188.2022.00027"
    },
    {
        "id": 19948,
        "title": "Occlusion-aware UAV Path Planning for Reconnaissance and Surveillance in Complex Environments",
        "authors": "Jian Zhang",
        "published": "2019-12",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/robio49542.2019.8961649"
    },
    {
        "id": 19949,
        "title": "Unmanned Aerial Vehicle Path Planning for Exploration Mapping",
        "authors": "Victor Massague Respall, Dmitry Devitt, Roman Fedorenko",
        "published": "2020-12-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/nir50484.2020.9290232"
    },
    {
        "id": 19950,
        "title": "Autonomous hierarchy creation for computationally feasible near-optimal path planning in large environments",
        "authors": "Jelena Gregorić, Marija Seder, Ivan Petrović",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.robot.2023.104584"
    },
    {
        "id": 19951,
        "title": "Real-Time Serviceable Path Planning using UAVs for Waterborne Vehicle Navigation during Floods",
        "authors": "Armaan Garg, Shashi Shekhar Jha",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3610419.3610433"
    },
    {
        "id": 19952,
        "title": "Curved Surface Inspection by a Climbing Robot: Path Planning Approach for Aircraft Applications",
        "authors": "Silya Achat, Julien Marzat, Julien Moras",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012185300003543"
    },
    {
        "id": 19953,
        "title": "Simultaneous Planning of the Path and Supports of a Walking Robot",
        "authors": "Paula Mollá-Santamaría, Adrián Peidró, Arturo Gil, Óscar Reinoso, Luis Payá",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012184600003543"
    },
    {
        "id": 19954,
        "title": "A path planning and path‐following control framework for a general 2‐trailer with a car‐like tractor",
        "authors": "Oskar Ljungqvist, Niclas Evestedt, Daniel Axehill, Marcello Cirillo, Henrik Pettersson",
        "published": "2019-12",
        "citations": 54,
        "abstract": "AbstractManeuvering a general 2‐trailer with a car‐like tractor in backward motion is a task that requires a significant skill to master and is unarguably one of the most complicated tasks a truck driver has to perform. This paper presents a path planning and path‐following control solution that can be used to automatically plan and execute difficult parking and obstacle avoidance maneuvers by combining backward and forward motion. A lattice‐based path planning framework is developed in order to generate kinematically feasible and collision‐free paths and a path‐following controller is designed to stabilize the lateral and angular path‐following error states during path execution. To estimate the vehicle state needed for control, a nonlinear observer is developed, which only utilizes information from sensors that are mounted on the car‐like tractor, making the system independent of additional trailer sensors. The proposed path‐planning and path‐following control framework is implemented on a full‐scale test vehicle and results from simulations and real‐world experiments are presented.",
        "link": "http://dx.doi.org/10.1002/rob.21908"
    },
    {
        "id": 19955,
        "title": "Approximate Branch and Bound for Fast, Risk-Bound Stochastic Path Planning",
        "authors": "Daniel Strawser, Brian Williams",
        "published": "2018-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2018.8461070"
    },
    {
        "id": 19956,
        "title": "Uncertainty-Aware Path Planning for Navigation on Road Networks Using Augmented MDPs",
        "authors": "Lorenzo Nardi, Cyrill Stachniss",
        "published": "2019-5",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8794121"
    },
    {
        "id": 19957,
        "title": "Semantics-aware Exploration and Inspection Path Planning",
        "authors": "Mihir Dharmadhikari, Kostas Alexis",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160469"
    },
    {
        "id": 19958,
        "title": "Robot Dynamic Path Planning Based on Improved A* and DWA Algorithms",
        "authors": "Chenxi Guan, Shuying Wang",
        "published": "2022-12-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccr55715.2022.10053929"
    },
    {
        "id": 19959,
        "title": "Smooth Path Planning of 6-DOF Robot Based on Reinforcement Learning",
        "authors": "Jiawei Tian, Dazi Li",
        "published": "2022-12-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccr55715.2022.10053875"
    },
    {
        "id": 19960,
        "title": "Research on Path Planning of Intelligent Mowing System Based on Computer Vision",
        "authors": "Leizhe Bai",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icrss57469.2022.00013"
    },
    {
        "id": 19961,
        "title": "MULTI-UUV PATH PLANNING BASED ON IMPROVED ARTIFICIAL POTENTIAL FIELD METHOD",
        "authors": "",
        "published": "2021",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2316/j.2021.206-0531"
    },
    {
        "id": 19962,
        "title": "Active Matter as a Path Planning Interpreter",
        "authors": "Vincent Strong, William Holderbaum, Yoshikatsu Hayashi",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-91352-6_7"
    },
    {
        "id": 19963,
        "title": "Path Planning Optimization and Object Placement Through Visual Servoing Technique for Robotics Application",
        "authors": "Sumitkumar Patel, Dippal Israni, Parth Shah",
        "published": "2019-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14313/jamris/1-2020/5"
    },
    {
        "id": 19964,
        "title": "A Review of Path Planning and Control for Autonomous Robots",
        "authors": "Byron Hernandez, Eduardo Giraldo",
        "published": "2018-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccra.2018.8588152"
    },
    {
        "id": 19965,
        "title": "Optimizing Energy Consumption of Rotor UAV by Path Planning",
        "authors": "Shilei Zhang, Taining Cheng",
        "published": "2022-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gcrait55928.2022.00020"
    },
    {
        "id": 19966,
        "title": "Path Planning for Excavator Arm: Fuzzy Logic Control Approach",
        "authors": "Nga Thi-Thuy Vu, Nam Phuong Tran",
        "published": "2020-11-20",
        "citations": 4,
        "abstract": "This paper proposes an algorithm to design the path for automated excavator arm. The path designing is divided into two phases. Firstly, the fuzzy logic technique is used to determine the change of the path to adapt with the variation of the material after each digging period. Secondly, the B-spline algorithm is used to build the optimal trajectory. By this, the excavator can maximize the dug weight although the shape of the material is variation. The effectiveness of the algorithm is verified through computer simulation and real-time experiment. The simulation and experimental results show that the generated optimal path keeps the dug weight around the expected value regardless of the change of the environment.",
        "link": "http://dx.doi.org/10.1155/2020/8893260"
    },
    {
        "id": 19967,
        "title": "UAV path planning based on a dual-strategy ant colony optimization algorithm",
        "authors": "Xiaoming Mai, Na Dong, Shuai Liu, Hao Chen",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "With the rapid development of modern communication and automatic control technologies, unmanned aerial vehicles (UAVs) have increasingly gained importance in both military and civilian domains. Path planning, a critical aspect for achieving autonomous aerial navigation, has consistently been a focal point in UAV research. However, traditional ant colony algorithms need to be improved for the drawbacks of susceptibility to local optima and weak convergence capabilities. Consequently, a novel path planning methodology is proposed based on a dual-strategy ant colony algorithm. In detail, an improved state transition probability rule is introduced, redefining ant movement rules by integrating the state transition strategy of deterministic selection during the iterative process. Additionally, heuristic information on adjacent node distance and mountain height is added to further improve the search efficiency of the algorithm. Then, a new dynamically adjusted pheromone update strategy is proposed. The update strategy is continuously adjusted during the iteration process, which is beneficial to the algorithm’s global search in the early stage and accelerated convergence in the later stage, preventing the algorithm from falling into local optimality and improving its convergence. Based on the above improvements, a new variation of ant colony optimization (ACO) called dual-strategy ACO algorithm is formed. Experimental results prove that dual-strategy ACO has superior global search capabilities and convergence characteristics from four key aspects: path length, fitness values, iteration number, and running time.",
        "link": "http://dx.doi.org/10.20517/ir.2023.37"
    },
    {
        "id": 19968,
        "title": "A Novel Edge Detection Algorithm for Mobile Robot Path Planning",
        "authors": "Rami Al-Jarrah, Mohammad Al-Jarrah, Hubert Roth",
        "published": "2018-1-1",
        "citations": 22,
        "abstract": "A novel detection algorithm for vision systems has been proposed based on combined fuzzy image processing and bacterial algorithm. This combination aims to increase the detection efficiency and reduce the computational time. In addition, the proposed algorithm has been tested through real-time robot navigation system, where it has been applied to detect the robot and obstacles in unstructured environment and generate 2D maps. These maps contain the starting and destination points in addition to current positions of the robot and obstacles. Moreover, the genetic algorithm (GA) has been modified and applied to produce time-based trajectory for the optimal path. It is based on proposing and enhancing the searching ability of the robot to move towards the optimal path solution. Many scenarios have been adopted in indoor environment to verify the capability of the new algorithm in terms of detection efficiency and computational time.",
        "link": "http://dx.doi.org/10.1155/2018/1969834"
    },
    {
        "id": 19969,
        "title": "Path Planning for Industrial Robots in Free-Form Surface Polishing",
        "authors": "Zhaosheng Li, Wei Wang",
        "published": "2019-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccar.2019.8813451"
    },
    {
        "id": 19970,
        "title": "Efficient Path Planning Algorithm for Mobile Robots Performing Floor Cleaning Like Operations",
        "authors": "Vishnu G Nair",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "In this paper, we introduce an efficient path planning algorithm designed for floor cleaning applications, utilizing the concept of Spanning Tree Coverage (STC). We operate under the assumption that the environment, i.e., the floor, is initially unknown to the robot, which also lacks knowledge regarding obstacle positions, except for the workspace boundaries. The robot executes alternating phases of exploration and coverage, leveraging the local map generated during exploration to construct a STC tree, which then guides the subsequent coverage (cleaning) phase. The extent of exploration is determined by the range of the robot's sensors. The path generation algorithms for cleaning fall within the broader category of coverage path planning (CPP) algorithms. A key advantage of this algorithm is that the robot returns to its initial position upon completing the operation, minimizing battery usage since sensors are only active during the exploration phase. We classify the proposed algorithm as an offline-online scheme. To validate the effectiveness and non-repetitive nature of the algorithm, we conducted simulations using VRep/MATLAB environments and implemented real-time experiments using Turtlebot in the ROS-Gazebo environment. The results substantiate the completeness of coverage and underscore the algorithm's significance in applications akin to floor cleaning.",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20035"
    }
]