[
    {
        "id": 8301,
        "title": "Best-Fit Subspaces and Singular Value Decomposition (SVD)",
        "authors": "",
        "published": "2020-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108755528.003"
    },
    {
        "id": 8302,
        "title": "Evaluation of Singular Value Decomposition (Svd) Enhanced Upscaling in Reservoir Simulation",
        "authors": "Xu Zhou, Mayank Tyagi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1115/1.0000744v"
    },
    {
        "id": 8303,
        "title": "Evaluation of Singular Value Decomposition (Svd) Enhanced Upscaling in Reservoir Simulation",
        "authors": "Xu Zhou, Mayank Tyagi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1115/1.0005199v"
    },
    {
        "id": 8304,
        "title": "Singular Value Decomposition (SVD)",
        "authors": "",
        "published": "2022-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009089517.003"
    },
    {
        "id": 8305,
        "title": "Singular Value Decomposition (SVD)",
        "authors": "",
        "published": "2019-1-31",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108380690.002"
    },
    {
        "id": 8306,
        "title": "Appendix B: Singular Value Decomposition (SVD)",
        "authors": "",
        "published": "2017-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1137/1.9781611974966.appb"
    },
    {
        "id": 8307,
        "title": "Singular value decomposition (SVD)",
        "authors": "Mario Bertero, Patrizia Boccacci, Christine De MoI",
        "published": "2021-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003032755-7"
    },
    {
        "id": 8308,
        "title": "Evaluation of Singular Value Decomposition (SVD) Enhanced Upscaling in Reservoir Simulation",
        "authors": "Xu Zhou, Mayank Tyagi",
        "published": "2020-8-3",
        "citations": 0,
        "abstract": "Abstract\nReservoir upscaling is an important step in reservoir modeling for converting highly detailed geological models to simulation grids. It substitutes a heterogeneous model that consists of high-resolution fine grid cells with a lower resolution reduced-dimension homogeneous model using averaging schemes. Its objective is to use a coarse grid model to represent a fine grid model, thus to reduce simulation time. The benefit of upscaling in reservoir simulation is that it efficiently saves simulation time, and effectively preserves key features of data for flow simulation.\nSingular Vector Decomposition (SVD) is a matrix decomposition method. It has been used for image processing and compressing. It has been proved to be capable of providing a good compression ratio, and effectively saves digital image storage space. SVD also has been used in noise suppression and signal enhancement. It has been shown to be effective in reducing noise components arising from both the sound sampling and delivery system.\nThis study evaluates the effect of SVD in parameterization and upscaling for reservoir simulation. A two-phase flow reservoir model was created using data from the SPE tenth comparative solution project [1].\nSimulation results show that SVD is valid in the parameterization of permeability values. The reconstructed permeability matrices using certain amount of singular values are good approximations of the original permeability values. Simulation results from SVD processed permeability values are similar to that using the original values.\nSVD is then applied on the upscaled permeability value to evaluate the effectiveness on upscaling. Simulation results were compared between the base case, upscaled case, and SVD upscaled case. The simulation results did not show a significant improvement in the accuracy of predicting oil production by applying SVD on the upscaled permeability values. It could be because the reconstructed permeability matrix has the same dimension before and after the SVD processing, thus the model accuracy and efficiency are not significantly improved.\nFuture work includes adding more cases to further explore the effect of SVD on upscaling. The number of grid blocks may be increased, and more layers can be added to investigate whether SVD enhance upscaling for larger scale reservoir simulation models.",
        "link": "http://dx.doi.org/10.1115/omae2020-19259"
    },
    {
        "id": 8309,
        "title": "Singular Value Decomposition (SVD) based Image Tamper Detection Scheme",
        "authors": "Sandeep Kaur, Alka Jindal",
        "published": "2020-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icict48043.2020.9112432"
    },
    {
        "id": 8310,
        "title": "Chapter 23: Singular value decomposition (SVD)",
        "authors": "",
        "published": "2022-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1137/1.9781611976922.ch23"
    },
    {
        "id": 8311,
        "title": "Geometrical Interpretation of Singular Value Decomposition(Svd) &amp; Applications of SVD",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20431/2347-3142.0504004"
    },
    {
        "id": 8312,
        "title": "A Method for Mill Monitoring Based on Inter-insert Periodic Correlation Using Singular Value Decomposition (SVD)",
        "authors": "Xiaowen ZHU, François Girardin, Jérôme Antoni",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper introduces a method to monitor the wear of end milling tools in real-time production based on inter-insert periodic correlation. The aim is to detect abnormal behavior of the cutter as early as possible to prevent severe tool failure and subsequent losses. The approach takes advantage of the angular domain to segment the signal in periodic cycles of the same angular duration, which are then amenable to correlation analysis. An ordered separability index with latent correlation characteristics is proposed to assess the current operating state of the tool. A series of simulations with existing experimental data are run to test the feasibility of the proposed index and to calculate the corresponding confidence interval. This approach has a high potential to form an efficient tool condition monitoring system. Compared to the traditional teach-in method, this method is more independent of the cutting conditions (changes of velocity or direction) and has no requirement for a trial cut, making the method useful for small batch production and can reduce the rate of false alarms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1011007/v1"
    },
    {
        "id": 8313,
        "title": "ANALISIS EMPIRICAL ORTHOGONAL FUNCTION (EOF) BERBASIS SINGULAR VALUE DECOMPOSITION (SVD)  PADA DATA CURAH HUJAN INDONESIA",
        "authors": "Isnawati L Lestari, Sri Nurdiati, Ardhasena Sopaheluwakan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Analisis Empirical Orthogonal Function(EOF) digunakan untuk mereduksi dimensi data yang berukuran besar dengan mempertahankan sebanyak mungkin variasi dari himpunan data asal. EOF merupakan suatu metode untuk menentukan pola-pola dominan pada data yang berevolusi dalam ruang dan waktu. Secara aljabar, EOF atau komponen utama yang diperoleh merupakan kombinasi linear dari semua peubah asli yang memiliki varians terbesar secara berurutan dan tidak berkorelasi dengan komponen utama sebelumnya. Metode EOF yang dilakukan  pada penelitian inimenggunakan pendekatanSingular Value Decomposition (SVD).Analisis dilakukan pada data curah hujan TRMM 3B43 bulanan untuk wilayah cakupan Indonesia selama 204 bulan dan dihitung nilai kesalahan dari hasil reduksi data. Berdasarkan hasil analisis diperoleh lima nilai singular terbesar yang memilikitotal varians sebesar 90.03%. Mode pertama (EOF1) menjelaskan 30,68% dari total varians dan merupakan varians terbesar yang mewakili hampir seluruh data. Mode EOF kedua sampai EOF kelima masing-masing menjelaskan 19.89%, 16.82%, 11.43% dan 11.19% dari total varians. Setiap mode EOF yang diperoleh menggambarkan pola spasial, sedangkan vektor singular menggambarkan pola temporal. Efektifitas dari lima mode EOF yang dihasilkan tersebut diuji untuk dapat menghampiri data asli. Hampiran data aslidiperoleh dengan menentukan nilai kesalahan dari hasil reduksi menggunakan teknik error norm matriks.",
        "link": "http://dx.doi.org/10.31227/osf.io/g8zb3"
    },
    {
        "id": 8314,
        "title": "Optimized Singular Value Decomposition(Svd) Based Watermarking of Iris Biometric Data to Mitigate Replay Attack",
        "authors": "Richa Gupta, Priti Sehgal",
        "published": "2020-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003052098-18"
    },
    {
        "id": 8315,
        "title": "Audio signal deblurring using singular value decomposition (SVD)",
        "authors": "Nilesh M. Patil, Milind U. Nemade",
        "published": "2017-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpcsi.2017.8391912"
    },
    {
        "id": 8316,
        "title": "Clustering and analyzing microarray data of lymphoma using singular value decomposition (SVD) and hybrid clustering",
        "authors": "A. Bustamam, S. Formalidin, T. Siswantining",
        "published": "2018",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5064217"
    },
    {
        "id": 8317,
        "title": "Energy Efficient GNSS Signal Acquisition Using Singular Value Decomposition (SVD)",
        "authors": "Juan Bermúdez Ordoñez, Rosa Arnaldo Valdés, Fernando Gómez Comendador",
        "published": "2018-5-16",
        "citations": 6,
        "abstract": "A significant challenge in global navigation satellite system (GNSS) signal processing is a requirement for a very high sampling rate. The recently-emerging compressed sensing (CS) theory makes processing GNSS signals at a low sampling rate possible if the signal has a sparse representation in a certain space. Based on CS and SVD theories, an algorithm for sampling GNSS signals at a rate much lower than the Nyquist rate and reconstructing the compressed signal is proposed in this research, which is validated after the output from that process still performs signal detection using the standard fast Fourier transform (FFT) parallel frequency space search acquisition. The sparse representation of the GNSS signal is the most important precondition for CS, by constructing a rectangular Toeplitz matrix (TZ) of the transmitted signal, calculating the left singular vectors using SVD from the TZ, to achieve sparse signal representation. Next, obtaining the M-dimensional observation vectors based on the left singular vectors of the SVD, which are equivalent to the sampler operator in standard compressive sensing theory, the signal can be sampled below the Nyquist rate, and can still be reconstructed via     ℓ 1     minimization with accuracy using convex optimization. As an added value, there is a GNSS signal acquisition enhancement effect by retaining the useful signal and filtering out noise by projecting the signal into the most significant proper orthogonal modes (PODs) which are the optimal distributions of signal power. The algorithm is validated with real recorded signals, and the results show that the proposed method is effective for sampling, reconstructing intermediate frequency (IF) GNSS signals in the time discrete domain.",
        "link": "http://dx.doi.org/10.3390/s18051586"
    },
    {
        "id": 8318,
        "title": "BPTTD: Block-Parallel Singular Value Decomposition(SVD) Based Tensor Train Decomposition",
        "authors": "Fanshuo Meng, Peng Li, Weibei Fan, Hongjun Zhang, Zhuangzhuang Xue, Haitao Cheng",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cscwd57460.2023.10152799"
    },
    {
        "id": 8319,
        "title": "Singular Value Decomposition for Imaging Applications",
        "authors": "Christian D. Zuniga",
        "published": "2021-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2611523.ch1"
    },
    {
        "id": 8320,
        "title": "SVD-PINNs: Transfer Learning of Physics-Informed Neural Networks via Singular Value Decomposition",
        "authors": "Yihang Gao, Ka Chun Cheung, Michael K. Ng",
        "published": "2022-12-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci51031.2022.10022281"
    },
    {
        "id": 8321,
        "title": "A hybrid multimedia image encryption technique using singular value decomposition-linear sparsity regularization (SVD-LSR)",
        "authors": "M. Hema, S. Prayla Shyry",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-023-07937-z"
    },
    {
        "id": 8322,
        "title": "Improving TF-IDF with Singular Value Decomposition (SVD) for Feature Extraction on Twitter",
        "authors": "Ammar Ismael Kadhim, Yu-N Cheah, Inaam Abbas Hieder, Rawaa Ahmed Ali",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23918/iec2017.16"
    },
    {
        "id": 8323,
        "title": "Singular Value Decomposition (SVD) Berdasarkan Intensitas Pencahayaannya  Untuk Pengenal Wajah",
        "authors": "Samsurizal Samsurizal, Miftahul Fikri, Nurmiati Pasra",
        "published": "2021-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36055/setrum.v10i1.10376"
    },
    {
        "id": 8324,
        "title": "Implementasi Watermarking pada Citra Digital dengan Metode Singular Value Decomposition (svd)",
        "authors": "Aah Sumiah, Yan Alfian",
        "published": "2021-5-6",
        "citations": 0,
        "abstract": "Today computers have been used in all aspects of life as a means of processing digital data. The Development of computer makes digital files mostly used because the computer is an electronic equipment used to process digital file. Moreover with network technology developments internet it enables file exchange and process the file.This ease impacts to copyright, so that needs to be considered the protection of copyrights. Such protection insertion namely with a proprietary identity against certain files.one of them is watermarking technique. There are several techniques of digital watermarking which have developed. One technique is digital watermark image on singular value decomposition (svd), ie insertion a singular image. Watermarking method using singular value decomposition (svd) leads the overall in scattered watermark image, so that when the slightest changes occurred on with easy image can be known. In addition itu resistant against different attacks, such as croping, rotation changes. The author discusses about the digital image watermarking based svd. In making application he uses delphi 7.Keywords: Digital Image, Watermarking, Singular Value Decomposition.",
        "link": "http://dx.doi.org/10.25134/jejaring.v6i1.6720"
    },
    {
        "id": 8325,
        "title": "Engineering Applications of Adaptive Kalman Filtering Based on Singular Value Decomposition (SVD)",
        "authors": "Juan Bermúdez Ordoñez, Rosa Arnaldo Valdés, Victor Gómez Comendador",
        "published": "2020-7-27",
        "citations": 3,
        "abstract": "This paper presents the results of applying the new mechanization of the Kalman filter (KF) algorithm using singular value decomposition (SVD). The proposed algorithm is useful in applications where the influence of round-off errors reduces the accuracy of the numerical solution of the associated Riccati equation. When the Riccati equation does not remain symmetric and positive definite, the fidelity of the solution can degrade to the point where it corrupts the Kalman gain, and it can corrupt the estimate. In this research, we design an adaptive KF implementation based on SVD, provide its derivation, and discuss the stability issues numerically. The filter is derived by substituting the SVD of the covariance matrix into the conventional discrete KF equations after its initial propagation, and an adaptive estimation of the covariance measurement matrix Rk is introduced. The results show that the algorithm is equivalent to current methods in terms of robustness, and it outperforms the estimation accuracy of the conventional Kalman filter, square root, and unit triangular matrix diagonal (UD) factorization methods under ill-conditioned and dynamic applications, and is applicable to most nonlinear systems. Four sample problems from different areas are presented for comparative study from an ill-conditioned sensitivity matrix, navigation with a dual-frequency Global Positioning System (GPS) receiver, host vehicle dynamic models, and distance measuring equipment (DME) using simultaneous slant range measurements, performed with a conventional KF and SVD-based (K-SVD) filter.",
        "link": "http://dx.doi.org/10.3390/app10155168"
    },
    {
        "id": 8326,
        "title": "COLLABORATIVE FILTERING APPROACH: SKINCARE PRODUCT RECOMMENDATION USING SINGULAR VALUE DECOMPOSITION (SVD)",
        "authors": "Farhatun Nissa, Arum Handini Primandari, Achmad Kurniansyah Thalib",
        "published": "2023-4-6",
        "citations": 1,
        "abstract": "The recommendation system provides recommendations for something, be it goods, songs, or movies. The term system is not limited to a service system but concerns a model that can provide recommendations. With recent technological advances, many companies provide various skincare products because current generations are increasingly aware of self-care. With various choices, someone may experience confusion in determining the product they want to buy. Therefore, we need a system that can provide product recommendations run on any platform we use. The most common method for recommendation systems often comes with Collaborating Filtering (CF) where it relies on the past user and item dataset. The singular value decomposition (SVD) method uses a matrix factorization technique that predict the user's rating based on historical ratings. The measurement of the model's accuracy is the RMSE average of 1.01276, indicating that this value results from the best parameters. The results focus on showing skincare product recommendations to users sorted based on rating predictions.",
        "link": "http://dx.doi.org/10.14710/medstat.15.2.139-150"
    },
    {
        "id": 8327,
        "title": "Relative spectral-perceptual linear prediction (RASTA-PLP) speech signals analysis using singular value decomposition (SVD)",
        "authors": "Muhammad Amirul Azzim Zulkifly, Norashikin Yahya",
        "published": "2017-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/roma.2017.8231833"
    },
    {
        "id": 8328,
        "title": "Measure of Singular Value Decomposition (M-SVD) based Quality Assessment for Medical Images with Degradation",
        "authors": "Ersin Elbasi",
        "published": "2021",
        "citations": 3,
        "abstract": "We use images in several important areas such as military, health, security, and science. Images can be distorted during the capturing, recording, processing, and storing. Image quality metrics are the techniques to measure the quality and quality accuracy level of the images and videos. Most of the quality measurement algorithms does not affect by small distortions in the image. Magnetic Resonance Imaging (MRI), Computed Tomography (CT), and Ultrasonic Imaging (UI) are widely used in the health sector. Because of several reasons it might be artifacts in the medical images. Doctor decisions might be affected by these image artifacts. Image quality measurement is an important and challenging area to work on. There are several metrics that have been done in the literature such as mean square error, peak signal-noise ratio, gradient similarity measure, structural similarity index, and universal image quality. Patient information can be an embedded corner of the medical image as a watermark. Watermark can be considered one of the image distortions types. The most common objective evaluation algorithms are simple pixel based which are very unreliable, resulting in poor correlation with the human visual system. In this work, we proposed a new image quality metric which is a Measure of Singular Value Decomposition (M-SVD). Experimental results show that novel M-SVD algorithm gives very promising results against Peak Signal to Noise Ratio (PSNR), the Mean Square Error (MSE), Structural Similarity Index Measures (SSIM), and 3.4.\tUniversal Image Quality (UIQ) assessments in watermarked and distorted images such as histogram equalization, JPEG compression, Gamma Correction, Gaussian Noise, Image Denoising, and Contrast Change.",
        "link": "http://dx.doi.org/10.34028/iajit/18/5/14"
    },
    {
        "id": 8329,
        "title": "Apply Hybrid Recommender System Using Genetic Algorithms And Singular Value Decomposition (SVD)",
        "authors": "Nasshat Mohammed, Jawad Hameed",
        "published": "2019-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32792/utq.jceps.09.01.13"
    },
    {
        "id": 8330,
        "title": "Singular Value Decomposition (SVD) Based Optimal Image Compression Technique",
        "authors": " Kiran, B D Parameshachari, D S Sunil Kumar, P S Prafulla, J Yashwanth",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10392294"
    },
    {
        "id": 8331,
        "title": "Implementasi Teknik Watermarking Menggunakan Metode Discrete Wavelet Transform (DWT) dan Singular Value Decomposition (SVD) pada Citra Digital",
        "authors": "Verryna Adzillatul Fathiha",
        "published": "2021-2-11",
        "citations": 0,
        "abstract": "Watermarking merupakan teknik penyembunyian data/informasi kedalam suatu citra digital yang tidak kasat mata atau tidak dapat diketahui secara visual. Penyembunyian data/informasi kedalam citra tersebut bersifat rahasia. Karena tahan terhadap proses digitalisasi, teknik watermarking dapat digunakan untuk melindungi kepemilikan suatu citra digital. Ada tiga kriteria yang harus diperhatikan dalam watermarking pada citra digital, diantaranya adalah security, impreceptibily, dan robustness. Pada tugas Penulisan Karya Ilmiah (PI) ini dibuat suatu program watermarking menggunakan metode Discrete Wavelet Transform (DWT) dan Singular Value Decomposition (SVD) yang kemudian juga akan dipaparkan bagaimana cara menggunakan program watermarking yang telah dibuat. Keunggulan dari program ini citra yang digunakan dalam program watermarking ini dapat berupa citra berwarna maupun citra grayscale. Program watermarking ini dibuat menggunakan bahasa pemrograman C++ melalui aplikasi Matlab\r\nKata Kunci            : Wateramarking , Singular Value Decomposition (SVD), Discrete Wavelet Transform (DWT), Matlab, Bahasa Pemrograman C++.",
        "link": "http://dx.doi.org/10.32815/jitika.v14i2.262"
    },
    {
        "id": 8332,
        "title": "Additive Noise Level Estimation Based on Singular Value Decomposition (SVD) in Natural Digital Images",
        "authors": "Asem Khmag, Fahad Layth Malallah, Baraa T. Sharef",
        "published": "2019-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsipa45851.2019.8977764"
    },
    {
        "id": 8333,
        "title": "Vertical stripe correction in Hyperion image using wavelet transformation and singular value decomposition (SVD)",
        "authors": "Ankur Dixit, Shefali Agarwal",
        "published": "2022-5-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/10106049.2020.1844312"
    },
    {
        "id": 8334,
        "title": "Singular Value Decomposition (SVD) Based Attack on Different Watermarking Schemes",
        "authors": "Milind Engedy, Munaga. V.N.K. Prasad, Ashutosh Saxena",
        "published": "2019-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429076893-10"
    },
    {
        "id": 8335,
        "title": "The singular value decomposition",
        "authors": "",
        "published": "2021-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1090/stml/094/05"
    },
    {
        "id": 8336,
        "title": "Singular Value Decomposition (SVD)-Based Video Watermarking",
        "authors": "Ashish M. Kothari, Vedvyas Dwivedi, Rohit M. Thanki",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-92837-1_4"
    },
    {
        "id": 8337,
        "title": "Big Data implementation in the tourism industry with the integration of Singular Value Decomposition (SVD)",
        "authors": "Tanvinur Rahman Siam, Md Sakiluzzaman, Sanji Sahlan Gazi, Asef Hassan Amiz",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441537"
    },
    {
        "id": 8338,
        "title": "An Error Separation Algorithm in Radar Astronomic Calibration Based on Singular Value Decomposition (SVD)",
        "authors": "Xiao-yong Feng, Heng Yang, Xin-ming Liu, Li-jian Zhao, Qian-xue Wang",
        "published": "2017-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789813220362_0068"
    },
    {
        "id": 8339,
        "title": "Singular Values and Singular Value Decomposition",
        "authors": "Kenichi Kanatani",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-02544-0_4"
    },
    {
        "id": 8340,
        "title": "Climate Prediction of Satellite-Based Spring Eurasian Vegetation Index (NDVI) using Coupled Singular Value Decomposition (SVD) Patterns",
        "authors": "Liuqing Ji, Ke Fan",
        "published": "2019-9-12",
        "citations": 7,
        "abstract": "Satellite-based normalized difference vegetation index (NDVI) data are widely used for estimating vegetation greenness. Seasonal climate predictions of spring (April–May–June) NDVI over Eurasia are explored by applying the year-to-year increment approach. The prediction models were developed based on the coupled modes of singular value decomposition (SVD) analyses between Eurasian NDVI and climate factors. One synchronous predictor, the spring surface air temperature from the NCEP’s Climate Forecast System (SAT-CFS), and three previous-season predictors (winter (December–January–February) sea-ice cover over the Barents Sea (SICBS), winter sea surface temperature over the equatorial Pacific (SSTP), and winter North Atlantic Oscillation (NAO) were chosen to develop four single-predictor schemes: the SAT-CFS scheme, SICBS scheme, SSTP scheme, and NAO scheme. Meanwhile, a statistical scheme that involves the three previous-season predictors (i.e., SICBS, SSTP, and NAO) and a hybrid scheme that includes all four predictors are also proposed. To evaluate the prediction skills of the schemes, one-year-out cross-validation and independent hindcast results are analyzed, revealing the hybrid scheme as having the best prediction skill. The results indicate that the temporal correlation coefficients at 92% of grid points over Eurasia are significant at the 5% significance level in the hybrid scheme, which is the best among all the schemes. Furthermore, spatial correlation coefficients (SCCs) of the six schemes are significant at the 1% significance level in most years during 1983–2015, with the averaged SCC of the hybrid scheme being the highest (0.60). The grid-averaged root-mean-square-error of the hybrid scheme is 0.04. By comparing the satellite-based NDVI value with the independent hindcast results during 2010–2015, it can be concluded that the hybrid scheme shows high prediction skill in terms of both the spatial pattern and the temporal variability of spring Eurasian NDVI.",
        "link": "http://dx.doi.org/10.3390/rs11182123"
    },
    {
        "id": 8341,
        "title": "MEDICAL IMAGE COMPRESSION USING HYBRID METHOD OF SINGULAR VALUE DECOMPOSITION (SVD) AND DISCRETE WAVELET TRANSFORM (DWT) TO INCREASE ITS EFICIENCY OF SAVING AND TRANSMITION",
        "authors": "Subinarto Subinarto, Edy Susanto, Nina Indriyawati",
        "published": "2017-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31983/link.v12i2.1386"
    },
    {
        "id": 8342,
        "title": "Identification of Combined Power Quality Disturbances Using Singular Value Decomposition (SVD) and Total Least Squares-Estimation of Signal Parameters via Rotational Invariance Techniques (TLS-ESPRIT)",
        "authors": "Huaishuo Xiao, Jianchun Wei, Qingquan Li",
        "published": "2017-11-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/en10111809"
    },
    {
        "id": 8343,
        "title": "Aplikasi Multiple Correspondence Analysis (MCA) dengan Metode Singular Value Decomposition (SVD) pada Kasus Perkembangan Demam Berdarah Dengue di Provinsi Jawa Barat pada Tahun 2016-2020",
        "authors": "Dinda Tresna Utami,  Suwanda",
        "published": "2022-7-29",
        "citations": 0,
        "abstract": "Abstract. Correspondence analysis is a statistical visualization method to describe the relationship between levels of categorical variables. Specifically, the correspondence analysis is divided into Simple Correspondence Analysis (SCA) and Multiple Correspondence Analysis (MCA) which are used to analyze two-way and multi-way categorical data. The classic MCA method is a method that is often applied by users. MCA works with superindicator matrices, and it will be difficult to analyze if the number of variables and categoricals increases. In this study, MCA will be discussed with Separate SVDs which can overcome the problem of the large number of variables. Furthermore, MCA with Separate SVD will be implemented in the health sector, namely regarding the number of cases of Dengue Hemorrhagic Fever (DHF) suffered by individuals in West Java Province based on gender and year. The variables used in this study consisted of three variables, namely: the area of West Java Province with six categories, namely the Bodebek, Purwasuka, Ciayumajakuning, West Priangan, Central Priangan, and East Priangan areas. The second variable is gender which consists of two categories: male and female. The third variable is the year which consists of five categories: 2016, 2017, 2018, 2019, and 2020. The results obtained from this study are that there are associations between the three categorical variables with details of the associations can be seen from the Biplot.\r\nAbstrak. Analisis korespondensi adalah metode visualisasi statistik untuk menggambarkan hubungan antar tingkat variabel kategorik.  secara khusus, analisis korespondensi dibedakan menjadi Simple Correspondence Analysis (SCA) dan Multiple Correspondence Analysis (MCA) yang digunakan untuk menganalisis data kategorik dua arah dan multi arah. Metode MCA klasik merupakan metode yang sering diaplikasikan oleh pengguna. MCA bekerja dengan matriks superindikator, dan ini akan mengalami kesulitan dalam analisis jika banyaknya variabel  dan kategoriknya bertambah besar. Dalam penelitian ini akan dibahas  MCA dengan Separate SVDs yang dapat menanggulangi masalah banyaknya variabel cukup besar. Selanjutnya MCA dengan Separate SVD akan diiplentasikan pada bidang kesehatan yaitu mengenai jumlah kasus Demam Berdarah Dengue (DBD) yang diderita oleh individu yang ada di Provinsi Jawa Barat berdasarkan jenis kelamin dan tahun. Variabel yang digunakan dalam penelitian terdiri dari tiga variabel yaitu: wilayah Provinsi Jawa Barat dengan enam kategori yaitu wilayah Bodebek, Purwasuka, Ciayumajakuning, Priangan Barat, Priangan Tengah, dan Priangan Timur. Variabel kedua yaitu jenis kelamin yang terdiri dari dua kategori : laki-laki dan perempuan. Variabel ketiga yaitu tahun yang terdiri dari lima kategori : 2016, 2017, 2018, 2019, dan 2020. Hasil yang didapat dari penelitian ini adalah terdapat asosiasi antara ketiga variabel kategorik dengan rincian asosiasi dapat dilihat dari Biplot.",
        "link": "http://dx.doi.org/10.29313/bcss.v2i2.4472"
    },
    {
        "id": 8344,
        "title": "Singular Value Decomposition (SVD) Co-training: A Semi-supervised Method for Object Detection",
        "authors": "Siyang Fan, Rui Wang, Jingwen Xu, James Zhiqing Wen",
        "published": "2022-11-1",
        "citations": 1,
        "abstract": "Existing object detection algorithms based on Convolutional Neural Network (CNN) generally rely on supervised learning with a large amount of labeled samples, which is very time-consuming and laborious. To address the problem, we propose a semi-supervised learning method by using Singular Value Decomposition (SVD) co-training. Specifically, this paper uses two mutually independent features which are obtained by SVD to guide the co-training of two detectors in one CNN model, meanwhile an adaptive self-labeling strategy is used to ensure the quality of pseudo labels. To verify the efficacy of SVD co-training, we conducted experiments on GMU, AVD and self-made BHID datasets. The result shows that SVD co-training could achieve the accuracy comparable to full-supervised learning by using only 5% of labeled data.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2363/1/012017"
    },
    {
        "id": 8345,
        "title": "Multibiometric Watermarking Technique Using Discrete Wavelet Transform (DWT) and Singular Value Decomposition (SVD)",
        "authors": "Rohit M. Thanki, Vedvyas J. Dwivedi, Komal R. Borisagar",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-73183-4_6"
    },
    {
        "id": 8346,
        "title": "A Novel Parallel Texture Feature Extraction Method using Log-Gabor Filter and Singular Value Decomposition (SVD)",
        "authors": "Md. Aminur Rab Ratul, Sharif Ahmmad Raja, Jia Uddin",
        "published": "2017-1-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3036331.3036352"
    },
    {
        "id": 8347,
        "title": "Singular Value Decomposition for Imaging Applications",
        "authors": "Christian D. Zuniga",
        "published": "2021-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2611523"
    },
    {
        "id": 8348,
        "title": "High-Quality Evaluation for Invisible Watermarking Based on Discrete Cosine Transform (DCT) and Singular Value Decomposition (SVD)",
        "authors": "Ega Adiasa Sofyan, Christy Atika Sari, Eko Hari Rachmawanto, Nur Ryan Dwi Cahyo",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": ". In this research, we propose an innovative approach that integrates Discrete Cosine Transform (DCT) and Singular Value Decomposition (SVD) to enhance the quality and security of digital images. The purpose of this technique is to embed imperceptible watermarks into images, preserving their integrity and authenticity. The integration of DCT allows for an efficient transformation of image data into frequency components, forming the basis for embedding watermarks that are nearly invisible to the human eye. In this context, SVD offers an advantage by separating singular values and corresponding vectors, facilitating a more sophisticated watermarking process. The quality evaluation using metrics such as MSE, PSNR, UQI, and MSSIM demonstrates the effectiveness of this approach. Low average MSE values, ranging from 0.0058 to 0.0064, indicate minimal distortion in the watermarked images. Additionally, high PSNR values, ranging from 67.20 dB to 67.22 dB, affirm the high image quality achieved after watermarking. These results validate that the integration of DCT and SVD provides a high level of security while maintaining optimal visual quality in digital images. This approach is highly relevant and effective in addressing the challenges of image protection in this digital era.",
        "link": "http://dx.doi.org/10.26877/asset.v6i1.17186"
    },
    {
        "id": 8349,
        "title": "Secure protection for covid-19 infographic using blockchain and discrete cosine transform-singular value decomposition (DCT-SVD) watermarking",
        "authors": "Muhammad Fajar Sidiq, Akbari Indra Basuki, Didi Rosiyadi, Iwan Setiawan, Yusnan Hasani Siregar, Sriyadi Sriyadi",
        "published": "2022-5-31",
        "citations": 0,
        "abstract": "Covid-19 infographics have a crucial role in mitigating the covid-19 pandemic by conveying the complex Covid19 information in a form of a simple yet understandable image. However, keenly to contribute to mitigating Covid-19, numerous parties and agencies had released Covid-19 infographics that might contain incorrect or inaccurate information. To prevent such recurrent, this paper proposed an authentication system by using a blockchain-based authorization service that lets the authority guarantee the correctness and validity of the infographics in a transparent manner. We proposed smart contract-based watermarking requests and approval management that let anyone track the watermarking process. To prevent unauthorized infographic fabrications, we use the DCT-SVD method considering its robustness against various attacks. We deployed and evaluated the smart contract on Ethereum test networks (Ropsten, Rinkeby, Goerli, and Kovan) to compare the efficiency and the ease of use. The result showed that the test networks have similar efficiency while the Ropsten and Goerli have better ease of use. The watermark validation service is accessible via a web-based interface for anyone to check the validity of the infographic’s watermark.",
        "link": "http://dx.doi.org/10.20895/infotel.v14i2.749"
    },
    {
        "id": 8350,
        "title": "Comparison of K-Means &amp; K-Means++ Clustering Models using Singular Value Decomposition (SVD) in Menu Engineering",
        "authors": "Nina Setiyawati, Dwi Hosanna Bangkalang, Hindriyanto Dwi Purnomo",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "The menu is one of the most fundamental aspects of business continuity in the culinary industry. One of the tools that can be used for menu analysis is menu engineering. Menu engineering is an analytical tool that assists restaurants, companies, and small and medium-sized enterprises (SMEs) in assessing and making decisions on marketing strategies, menu design, and sales so that it can produce maximum profit. In this study, several menu engineering models were proposed, and the performance of these models was analyzed. This study used a dataset from the Point of Sales (POS) application in an SME engaged in the culinary field. This research consists of three stages. First, pre-processing the data, comparing the models, and evaluating the models using the Davies Bouldin index. At the model comparison stage, four models are being compared: K-Means, K-Means++, K-Means using Singular Value Decomposition (SVD), and K-Means++ using SVD. SVD is used in the dataset transformation process. K-Means and K-Means++ algorithms are used for grouping menu items. The experiments show that the K-Means++ model with SVD produced the most optimal cluster in this research. The model produced an average cluster distance value of 0.002; the smallest Davies-Bouldin Index (DBI) value is 0.141. Therefore, using the K-Means++ model with SVD in menu engineering analysis produces clusters containing menu items with high similarity and significant distance between groups. The results obtained from the proposed model can be used as a basis for strategic decision-making of managing price, marketing strategy, etc., for SMEs, especially in the culinary business.",
        "link": "http://dx.doi.org/10.30630/joiv.7.3.1053"
    },
    {
        "id": 8351,
        "title": "Pengaruh Kapasitas Dimensi Citra Watermark terhadap Audio Watermarking dengan Perpaduan Metode DWT (Discrete Wavelet Transform) dan SVD ( Singular Value Decomposition)",
        "authors": "Togu Novriansyah Turnip, Jenny Doloksaribu, Vedtra Purba, Immanuel Saragih",
        "published": "2019-2-25",
        "citations": 0,
        "abstract": "<p class=\"Abstrak\">Digital audio <em>watermarking</em> dibutuhkan untuk memberi perlindungan dari pembajakan musik secara ilegal dan pemberian hak cipta/kepemilikan. Penelitian ini menjelaskan perpaduan metode audio <em>watermarking</em> dimana informasi berupa hak cipta disisipkan ke dalam sinyal audio. Perpaduan dari metode DWT (<em>Discrete Wavelet Transfrom</em>) dan SVD (<em>Singular Value Decomposition</em>) digunakan untuk menyisipkan dan mengekstrak <em>watermark</em> dari sinyal audio. Informasi atau watermark tersebut dapat berupa gambar hitam putih (<em>biner</em>) atau huruf-huruf karakter ASCII. Pada penelitian ini sebuah gambar dijadikan sebagai <em>watermark</em> dengan berbagai variasi ukuran piksel seperti 10×10, 30×30, 40×40 dan 50×50 piksel. Hasil dari penyisipan <em>watermark</em> yang berukuran 30×30 piksel menghasilkan <em>imperceptibility</em> yang baik dengan nilai rata-rata diantara 43 sampai dengan 50 dB. Hasil eksperimen yang telah dilakukan juga menunjukkan bahwa kombinasi dari kedua metode tahan (<em>robustness</em>) terhadap beberapa serangan seperti <em>amplify</em>, <em>resampling</em> dan <em>invert</em>.</p><p class=\"Abstrak\"><strong><em>Abstract</em></strong></p><p class=\"Judul2\"><em>Digital audio watermarking is needed as a protection against online music piracy and </em><em>copyright issues</em><em>. This paper describes an audio watermarking</em><em> combination</em><em> method where </em><em>the </em><em>copyright information is imperceptibly added into the audio signal. The combination of discrete wavelet transform (DWT) and singular value decomposition (SVD) is used to embed and e</em><em>x</em><em>tract the watermark from the audio signal. The copyright information or watermark could be a binary logo or some unique binary pattern</em><em>s</em><em>. In this paper, a watermarked image </em><em>is </em><em>divided into four different capacities of dimension such as 10×10, 30×30</em><em>, </em><em>40×40 and 50×50 pi</em><em>x</em><em>el</em><em>s</em><em>.</em><em> </em><em>The result</em><em>s</em><em> of the watermarked image </em><em>are</em><em> imperceptibly added into the audio signal</em><em> and image with</em><em> 30×30 pixel </em><em>dimension </em><em>ha</em><em>s</em><em> the best mean result ranged from 43 to 50 dB</em><em>.</em><em> The experiment result also show</em><em>s</em><em> that the combination of DWT and SVD is robust against different attacks such as amplify, resampling and invert.</em></p><p class=\"Judul2\"> </p>",
        "link": "http://dx.doi.org/10.25126/jtiik.2019621269"
    },
    {
        "id": 8352,
        "title": "Rec-CFSVD++: Implementing Recommendation System Using Collaborative Filtering and Singular Value Decomposition (SVD)++",
        "authors": "Taushif Anwar, V. Uma, Gautam Srivastava",
        "published": "2021-7",
        "citations": 16,
        "abstract": " In recommender systems, Collaborative Filtering (CF) plays an essential role in promoting recommendation services. The conventional CF approach has limitations, namely data sparsity and cold-start. The matrix decomposition approach is demonstrated to be one of the effective approaches used in developing recommendation systems. This paper presents a new approach that uses CF and Singular Value Decomposition (SVD)[Formula: see text] for implementing a recommendation system. Therefore, this work is an attempt to extend the existing recommendation systems by (i) finding similarity between user and item from rating matrices using cosine similarity; (ii) predicting missing ratings using a matrix decomposition approach, and (iii) recommending top-N user-preferred items. The recommender system’s performance is evaluated considering Root Mean Square Error (RMSE) and Mean Absolute Error (MAE). Performance evaluation is accomplished by comparing the systems developed using CF in combination with six different algorithms, namely SVD, SVD[Formula: see text], Co-Clustering, KNNBasic, KNNBaseline, and KNNWithMeans. We have experimented using MovieLens 100[Formula: see text]K, MovieLens 1[Formula: see text]M, and BookCrossing datasets. The results prove that the proposed approach gives a lesser error rate when cross-validation ([Formula: see text]) is performed. The experimental results show that the lowest error rate is achieved with MovieLens 100[Formula: see text]K dataset ([Formula: see text], [Formula: see text]). The proposed approach also alleviates the sparsity and cold-start problems and recommends the relevant items. ",
        "link": "http://dx.doi.org/10.1142/s0219622021500310"
    },
    {
        "id": 8353,
        "title": "Singular Vector Decomposition (SVD) of satellite datasets:&amp;#160;relation between cloud properties, radiative fluxes and climate indices.",
        "authors": "Elisa Carboni, Gareth Thomas, Richard Siddans, Brian Kerridge",
        "published": "No Date",
        "citations": 0,
        "abstract": "We describe a technique, singular vector decomposition (SVD), that can identify the spatial patterns that best describe the temporal variability of a global satellite dataset. These patterns, and their temporal evolution are then correlated with established climate indices.&#160;We apply this technique to datasets of cloud properties and radiative&#160; fluxes over three decades ((A)ATSR/SLSTR, MODIS, IASI and CERES), but it can be more generically used to extract the pattern of variability of any regular gridded dataset such as different parameters from satellite retrieval and models.Leading singular vector for independent global data sets on both cloud properties (cloud fraction, cloud-top height)&#160;and TOA radiative fluxes, from polar orbiting satellites, covering different time periods is strongly correlated with ENSO index.SVD approach can provide incites into the underlying causes of observed changes in a particular dataset and provide a new tool in using global satellite observations in assessing global climate model (GCM) performance.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-18872"
    },
    {
        "id": 8354,
        "title": "Detecting Indonesian Monsoon Signals and Related Features Using Space–Time Singular Value Decomposition (SVD)",
        "authors": "Adi Mulsandi, Yonny Koesmaryono, Rahmat Hidayat, Akhmad Faqih, Ardhasena Sopaheluwakan",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Several investigations have proven the existence of monsoons in Indonesia. However, this has received little attention due to the scientific argument that the region of 10° N–10° S is not monsoonal because it receives precipitation all year round. This study used space–time SVD analysis of atmospheric and oceanic field data for 30 years (1990–2020) to detect monsoon signals and related features. The single-field SVD analysis of rainfall revealed that the first mode accounts for only 33% of the total variance, suggesting it is highly variable. Both the PC space and time series show the well-known monsoon pattern. Further, the Indonesian monsoon regimes and phases are defined based on the revealed rainfall features. The wet season lasts from November to April, accounting for more than 77% of annual precipitation. The coupled-field SVD analyses show that Indonesian monsoon rainfall strongly correlates with local SST (PC1 accounts for 70.4%), and the pattern is associated with the Asian winter monsoon. The heterogonous vector correlation map analysis revealed that the related features during the monsoon, including the strengthening and weakening of subtropical anticyclones, the intertwining of westerly wind in the Indian Ocean, and variations in the north–south dipole structure of the ocean temperature, are linked to variations in Indonesia’s monsoon rainfall. This result can serve as the dynamic basis for defining the Indonesian monsoon index in the context of the center of action.",
        "link": "http://dx.doi.org/10.3390/atmos15020187"
    },
    {
        "id": 8355,
        "title": "The Singular Value Decomposition",
        "authors": "",
        "published": "2022-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108942607.005"
    },
    {
        "id": 8356,
        "title": "Dimensionality Reduction of Speech Signals using Singular Value Decomposition and Karhunen-Loeve",
        "authors": "Domy Kristomo, Yudhi Kusnanto",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009432200780084"
    },
    {
        "id": 8357,
        "title": "Singular Value Decomposition and the Spectral Theorem",
        "authors": "",
        "published": "2018-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781316823200.006"
    },
    {
        "id": 8358,
        "title": "Singular Value Decomposition",
        "authors": "Kenichi Kanatani",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63416-2_802"
    },
    {
        "id": 8359,
        "title": "Review for \"Sensitivity considerations on denoising series of spectra by singular value decomposition\"",
        "authors": "",
        "published": "2023-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/mrc.5338/v1/review2"
    },
    {
        "id": 8360,
        "title": "Singular value decomposition",
        "authors": "Qingwen Hu",
        "published": "2017-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315172309-7"
    },
    {
        "id": 8361,
        "title": "Singular Value Decomposition",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_101076"
    },
    {
        "id": 8362,
        "title": "Review for \"Sensitivity considerations on denoising series of spectra by singular value decomposition\"",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/mrc.5338/v1/review1"
    },
    {
        "id": 8363,
        "title": "Singular Value Decomposition",
        "authors": "Hang Li",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-3917-6_15"
    },
    {
        "id": 8364,
        "title": "Application of Double Pictures to Audio Watermarking using Discrete Cosine Transform (DCT) and Singular Value Decomposition (SVD) Methods",
        "authors": " Togu Novriansyah Turnip,  Tegar Arifin Prasetyo,  Nevi Aktasia Banjarnahor,  Winda Mariana Pasaribu,  Sopian Manurung",
        "published": "2021-11-30",
        "citations": 0,
        "abstract": "One way to control the development of arbitrary distribution of audio is to apply audio watermarking. Audio Watermarking is used to identify the ownership rights of audio files by embedding a watermark while paying attention to the audio quality and the watermark's resistance to amplify, resampling, and invert attacks. Discrete Cosine Transform (DCT) and Singular Value Decomposition (SVD) methods are frequency-domain methods that have a good robustness. The DCT and SVD methods are combined with inserting and extracting watermarks using two images as watermarks. From the test results, the effect of inserting an audio watermark with two images does not significantly impact the durability of the watermark and the quality of the audio inserted with the watermark. However, the alpha value has a significant effect. The higher the alpha value, the lower the audio SNR value by an average of 1.93 dB from an alpha value of 0.0008 and 0.001 for each type of classical, jazz, and rock audio genre.",
        "link": "http://dx.doi.org/10.54074/jati.v1i2.32"
    },
    {
        "id": 8365,
        "title": "Application of recurrent neural network (RNN) in bitcoin price prediction using singular value decomposition (SVD) dimensionality reduction",
        "authors": "Edgar Adina, Julyver A. Tolentino, Jiaxin Shen, Hardy D. Sierra, Geldof B. Resuello",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.3012649"
    },
    {
        "id": 8366,
        "title": "Singular Value Decomposition",
        "authors": "Yanchun Zhang, Guandong Xu",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-8265-9_538"
    },
    {
        "id": 8367,
        "title": "A Conditional Singular Value Decomposition",
        "authors": "Qi Deng",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4736134"
    },
    {
        "id": 8368,
        "title": "A Filling Method Based on K-Singular Value Decomposition (K-SVD) for Missing and Abnormal Energy Consumption Data of Buildings",
        "authors": "Lihong Su, Manjia Liu, Zaixun Ling, Wenjie Gang, Chong Zhang, Ying Zhang, Xiuxia Hao",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "Massive data can be collected from meters to analyze the energy use behavior and detect the operation problems of buildings. However, missing and abnormal data often occur for the raw data. Effective data filling and smoothing methods are required to improve data quality before conducting the analysis. This paper introduces a data filling method based on K-SVD. The complete dictionary is trained and then utilized to reconstruct incomplete samples to fill the missing or abnormal data. The impacts of the dictionary size, the data missing continuity, and the sample size on the performance of the proposed method are studied. The results show that a smaller dictionary size is recommended considering the computational complexity and accuracy. The K-SVD method outperforms traditional methods, showing a reduction in the MAPE and CVRMSE by 3.8–5.4% and 6.7–87.8%. The proposed K-SVD filling method performs better for non-consecutive missing data, with an improvement in the MAPE and CVRMSE by 0.1–4% and 5.1–6.7%. Smaller training samples are recommended. The method proposed in this study would provide an effective solution for data preprocessing in building and energy systems.",
        "link": "http://dx.doi.org/10.3390/buildings14030696"
    },
    {
        "id": 8369,
        "title": "Singular Value Decomposition (SVD) based Thermal Resistance Matrix (TRM) Size Reduction for Fast Optimization of On-Die Floorplan and Temperature Sensor Placement",
        "authors": "Hyungyung Jo, Heeseok Lee, Heonwoo Kim, Young-Sang Cho, Jongkyu Yoo, Junso Pak",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itherm55368.2023.10177524"
    },
    {
        "id": 8370,
        "title": "Application of Singular Value Decomposition (SVD) to the Extraction of Gravity Anomalies Associated with Ag-Pb-Zn-W Polymetallic Mineralization in the Bozhushan Ore Field, Southwestern China",
        "authors": "Lingfen Guo, Yongqing Chen, Binbin Zhao",
        "published": "2021-4",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12583-020-1352-4"
    },
    {
        "id": 8371,
        "title": "Singular Value Decomposition",
        "authors": "Kenichi Kanatani",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-03243-2_802-1"
    },
    {
        "id": 8372,
        "title": "Singular Value Decomposition",
        "authors": "Darald J. Hartfiel",
        "published": "2017-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315273778-7"
    },
    {
        "id": 8373,
        "title": "Application of SVD Based on Correlated Singular Value Ratio in Bearing Fault Diagnosis",
        "authors": "",
        "published": "2021",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3901/jme.2021.21.138"
    },
    {
        "id": 8374,
        "title": "Kompresi Citra Menggunakan  Truncated Singular Value Decomposition (TSVD), Sebuah Eksplorasi Numerik",
        "authors": "Agah D. Garnadi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Citra atau image memiliki representasi sebagai sebuah matriks untuk citra grayscale, sementara citra berwarna dipandang sebagai tensor 3 tingkat dari matriks berukuran sama. Dikaji dalam tulisan ini masalah kompresi citra menggunakan dekomposisi singular. Pada tulisan ini, dilakukan eksplorasi numerik kompresi citra sebagai masalah TSVD atau Dekomposisi Nilai Singular Terpancung.",
        "link": "http://dx.doi.org/10.31227/osf.io/uqrwe"
    },
    {
        "id": 8375,
        "title": "Denoising with Singular Value Decomposition for Phase Identification in Power Distribution Systems",
        "authors": "Nicholas Zaragoza, Vittal Rao",
        "published": "No Date",
        "citations": 0,
        "abstract": "<div>Phase identification is the problem of determining what phase(s) that a load is connected to in a power distribution system. However, real-world sensor measurements used for phase identification have some level of noise that can hamper the ability to identify phase connections using data-driven methods. Knowing the phase connections is important to keep the distribution system balanced so that parts of the system are not overloaded, which can lead to inefficient operations, accelerated component degradation, and system destruction at worst. We present a feature engineering pipeline that combines Singular Value Decomposition (SVD) with an Interquartile Range (IQR)-based nonlinear filter to denoise matrices of voltage magnitude measurements. We empirically show that this pipeline is effective in denoising data that contains either additive Gaussian, Laplacian, Cauchy, or mixed Gaussian/Cauchy noise. This approach reduces Frobenius error and increases the average phase identification accuracy over a year of non-stationary time series data. K-medoids clustering is used on the denoised voltage magnitude measurements to perform phase identification.</div>",
        "link": "http://dx.doi.org/10.36227/techrxiv.15102072.v3"
    },
    {
        "id": 8376,
        "title": "Decision letter for \"Sensitivity considerations on denoising series of spectra by singular value decomposition\"",
        "authors": "",
        "published": "2023-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/mrc.5338/v1/decision1"
    },
    {
        "id": 8377,
        "title": "Singular Value Decomposition",
        "authors": "Ravi P. Agarwal, Cristina Flaut",
        "published": "2017-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315208657-19"
    },
    {
        "id": 8378,
        "title": "Denoising with Singular Value Decomposition for Phase Identification in Power Distribution Systems",
        "authors": "Nicholas Zaragoza, Vittal Rao",
        "published": "No Date",
        "citations": 0,
        "abstract": "<div>Phase identification is the problem of determining what phase(s) that a load is connected to in a power distribution system. However, real-world sensor measurements used for phase identification have some level of noise that can hamper the ability to identify phase connections using data-driven methods. Knowing the phase connections is important to keep the distribution system balanced so that parts of the system are not overloaded, which can lead to inefficient operations, accelerated component degradation, and system destruction at worst. We present a feature engineering pipeline that combines Singular Value Decomposition (SVD) with an Interquartile Range (IQR)-based nonlinear filter to denoise matrices of voltage magnitude measurements. We empirically show that this pipeline is effective in denoising data that contains either additive Gaussian, Laplacian, Cauchy, or mixed Gaussian/Cauchy noise. This approach reduces Frobenius error and increases the average phase identification accuracy over a year of non-stationary time series data. K-medoids clustering is used on the denoised voltage magnitude measurements to perform phase identification.</div>",
        "link": "http://dx.doi.org/10.36227/techrxiv.15102072"
    },
    {
        "id": 8379,
        "title": "Denoising with Singular Value Decomposition for Phase Identification in Power Distribution Systems",
        "authors": "Nicholas Zaragoza, Vittal Rao",
        "published": "No Date",
        "citations": 0,
        "abstract": "Phase identification is the problem of determining what phase(s) that a load is connected to in a power distribution<br>system. However, real world sensor measurements used for phase identification have some level of noise that can hamper the ability to identify phase connections using data driven methods. Knowing the phase connections is important to keep the distribution system balanced so that parts of the system aren’t overloaded which can lead to inefficient operations, accelerated component degradation, and system destruction at worst. We use Singular Value Decomposition (SVD) with the optimal Singular Value Hard Threshold (SVHT) as part of a feature engineering pipeline to denoise data matrices of voltage magnitude measurements. This approach results in a reduction in frobenius error and an increase in average phase identification accuracy over a year of time series data. K-medoids clustering is used on the denoised voltage magnitude measurements to perform phase identification.<br>",
        "link": "http://dx.doi.org/10.36227/techrxiv.15102072.v1"
    },
    {
        "id": 8380,
        "title": "Acceleration of Iterative Refinement for Singular Value Decomposition",
        "authors": "Yuki Uchino, Takeshi Terao, Katsuhisa Ozaki",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nWe propose fast numerical algorithms to improve the accuracy of singular vectors for a real matrix.Recently, Ogita and Aishima proposed an iterative refinement algorithm for singular value decomposition that is constructed with highly accurate matrix multiplications carried out six times per iteration.The algorithm runs for the problem that has no multiple and clustered singular values.In this study, we show that the same algorithm can be run with highly accurate matrix multiplications carried out five times.Also, we proposed four algorithms constructed with highly accurate matrix multiplications, two algorithms with the multiplications carried out four times, and the other two with the multiplications carried out five times. These algorithms adopt the idea of a mixed-precision iterative refinement method for linear systems.Numerical experiments demonstrate speed-up and quadratic convergence of the proposed algorithms.As a result, the fastest algorithm is 1.7 and 1.4 times faster than the Ogita-Aishima algorithm per iteration on a CPU and GPU, respectively.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1931986/v1"
    },
    {
        "id": 8381,
        "title": "Decision letter for \"Sensitivity considerations on denoising series of spectra by singular value decomposition\"",
        "authors": "",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/mrc.5338/v2/decision1"
    },
    {
        "id": 8382,
        "title": "Denoising with Singular Value Decomposition for Phase Identification in Power Distribution Systems",
        "authors": "Nicholas Zaragoza, Vittal Rao",
        "published": "No Date",
        "citations": 0,
        "abstract": "Phase identification is the problem of determining what phase(s) that a load is connected to in a power distribution system. However, real-world sensor measurements used for phase identification have some level of noise that can hamper the ability to identify phase connections using data-driven methods. Knowing the phase connections is important to keep the distribution system balanced so that parts of the system are not overloaded, which can lead to inefficient operations, accelerated component degradation, and system destruction at worst. We use Singular Value Decomposition (SVD) with the optimal Singular Value Hard Threshold (SVHT) as part of a feature engineering pipeline to denoise data matrices of voltage magnitude measurements. This approach reduces Frobenius error and increases the average phase identification accuracy over a year of time series data. K- medoids clustering is used on the denoised voltage magnitude measurements to perform phase identification.<br><br>",
        "link": "http://dx.doi.org/10.36227/techrxiv.15102072.v2"
    },
    {
        "id": 8383,
        "title": "Iraqi Plate Number Recognition Using Single Value Decomposition (SVD)",
        "authors": "Manar Muafak",
        "published": "2018-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24237/djps.1402.391a"
    },
    {
        "id": 8384,
        "title": "Singular Value Decomposition = Principal Component Analysis",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_101078"
    },
    {
        "id": 8385,
        "title": "Faculty Opinions recommendation of Accelerated Singular Value-Based Ultrasound Blood Flow Clutter Filtering With Randomized Singular Value Decomposition and Randomized Spatial Downsampling.",
        "authors": "Jianwen Luo",
        "published": "2017-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3410/f.727761939.793533792"
    },
    {
        "id": 8386,
        "title": "Variational Quantum Singular Value Decomposition",
        "authors": "Xin Wang, Zhixin Song, Youle Wang",
        "published": "2021-6-29",
        "citations": 32,
        "abstract": "Singular value decomposition is central to many problems in engineering and scientific fields. Several quantum algorithms have been proposed to determine the singular values and their associated singular vectors of a given matrix. Although these algorithms are promising, the required quantum subroutines and resources are too costly on near-term quantum devices. In this work, we propose a variational quantum algorithm for singular value decomposition (VQSVD). By exploiting the variational principles for singular values and the Ky Fan Theorem, we design a novel loss function such that two quantum neural networks (or parameterized quantum circuits) could be trained to learn the singular vectors and output the corresponding singular values. Furthermore, we conduct numerical simulations of VQSVD for random matrices as well as its applications in image compression of handwritten digits. Finally, we discuss the applications of our algorithm in recommendation systems and polar decomposition. Our work explores new avenues for quantum information processing beyond the conventional protocols that only works for Hermitian data, and reveals the capability of matrix decomposition on near-term quantum devices.",
        "link": "http://dx.doi.org/10.22331/q-2021-06-29-483"
    },
    {
        "id": 8387,
        "title": "Singular Value Decomposition",
        "authors": "J. Douglas Walker, Noah M. McLean",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432043-9"
    },
    {
        "id": 8388,
        "title": "Eigenvalues: Singular Value Decomposition",
        "authors": "Radu C. Cascaval",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_142"
    },
    {
        "id": 8389,
        "title": "Singular Value Decomposition",
        "authors": "",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789811276231_0011"
    },
    {
        "id": 8390,
        "title": "The Singular Value Decomposition and Applications⁎",
        "authors": "Fabrizio Gabbiani, Steven James Cox",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-801895-8.00016-6"
    },
    {
        "id": 8391,
        "title": "Real time SVD-based clutter filtering using randomized singular value decomposition and spatial downsampling for micro-vessel imaging on a Verasonics ultrasound system",
        "authors": "U-Wai Lok, Pengfei Song, Joshua D. Trzasko, Ron Daigle, Eric A. Borisch, Chengwu Huang, Ping Gong, Shanshan Tang, Wenwu Ling, Shigao Chen",
        "published": "2020-9",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ultras.2020.106163"
    },
    {
        "id": 8392,
        "title": "Singular Value Decomposition",
        "authors": "Robert E. White",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003304128-7"
    },
    {
        "id": 8393,
        "title": "A Review on An Efficient Singular Value Decomposition Based Filtering For GIF Image Denoising With Ridgelet Approach.",
        "authors": "",
        "published": "2018-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23883/ijrter.2018.4427.krqsa"
    },
    {
        "id": 8394,
        "title": "The Singular Value Decomposition",
        "authors": "Gerald Farin, Dianne Hansford",
        "published": "2021-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003051213-16"
    },
    {
        "id": 8395,
        "title": "Skeleton Action Recognition Based on Singular Value Decomposition",
        "authors": "Simkanic Radek",
        "published": "2020-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip40778.2020.9191009"
    },
    {
        "id": 8396,
        "title": "Randomized Algorithms for Singular Value Decomposition: Implementation and Application Perspective",
        "authors": "Darko Janekovic, Dario Bojanjac",
        "published": "2021-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/elmar52657.2021.9550979"
    },
    {
        "id": 8397,
        "title": "High quality high spatial resolution functional classification in low dose dynamic CT perfusion using singular value decomposition (SVD) and k-means clustering",
        "authors": "Francesco Pisana, Thomas Henzler, Stefan Schönberg, Ernst Klotz, Bernhard Schmidt, Marc Kachelrieß",
        "published": "2017-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2251161"
    },
    {
        "id": 8398,
        "title": "Multi-resolution Video Steganography Technique Based on Stationary Wavelet Transform (SWT) and Singular Value Decomposition (SVD)",
        "authors": "Reham A. El-Shahed, M. N. Al-Berry, Hala M. Ebeid, Howida A. Shedeed",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-3071-2_15"
    },
    {
        "id": 8399,
        "title": "Robust Video Steganography Technique Against Attack Based on Stationary Wavelet Transform (SWT) and Singular Value Decomposition (SVD)",
        "authors": "Reham A. El-Shahed, M. N. Al-Berry, Hala M. Ebied, Howida A. Shedeed",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-4538-9_26"
    },
    {
        "id": 8400,
        "title": "Plane-Wave Phase Coherence Imaging with Singular Value Decomposition",
        "authors": "Hideyuki Hasegawa, Ryo Nagaoka",
        "published": "2018-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ultsym.2018.8579969"
    }
]