[
    {
        "id": 30905,
        "title": "Deep reinforcement learning for continuous-time self-triggered control with experimental evaluation",
        "authors": "Ran Wang, Kenji Kashima",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2229886"
    },
    {
        "id": 30906,
        "title": "A Supervision Method for Online Violence Based on Blockchain and Deep Learning",
        "authors": "Yu Liu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00009"
    },
    {
        "id": 30907,
        "title": "Artificial intelligence, machine learning and deep learning in advanced robotics, a review",
        "authors": "Mohsen Soori, Behrooz Arezoo, Roza Dastres",
        "published": "2023",
        "citations": 102,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cogr.2023.04.001"
    },
    {
        "id": 30908,
        "title": "Density estimation based soft actor-critic: deep reinforcement learning for static output feedback control with measurement noise",
        "authors": "Ran Wang, Ye Tian, Kenji Kashima",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2024.2309621"
    },
    {
        "id": 30909,
        "title": "An Efficient Computational Performance Analysis Method for CGRA-based Deep Learning Accelerator",
        "authors": "Weiheng Liu, Xucan Chen",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00010"
    },
    {
        "id": 30910,
        "title": "A Deep Reinforcement Learning Decision-Making Approach for Adaptive Cruise Control in Autonomous Vehicles",
        "authors": "Dany Ghraizi, Reine Talj, Clovis Francis",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10406331"
    },
    {
        "id": 30911,
        "title": "Drone Control through Deep Learning based on Pose Recognition",
        "authors": "Andi Alfian Kartika Aji, Šimon Slabý, Po-Ting Tsai, Min-Fan Ricky Lee",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268532"
    },
    {
        "id": 30912,
        "title": "Cognitive robotics: Deep learning approaches for trajectory and motion control in complex environment",
        "authors": "Muhammad Usman Shoukat, Lirong Yan, Di Deng, Muhammad Imtiaz, Muhammad Safdar, Saqib Ali Nawaz",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2024.102370"
    },
    {
        "id": 30913,
        "title": "Analysis of Conventional Feature Learning Algorithms and Advanced Deep Learning Models",
        "authors": "Toshihiro Endo",
        "published": "2023-1-5",
        "citations": 1,
        "abstract": "Representation learning or feature learning refers to a collection of methods employed in machine learning, which allows systems to autonomously determine representations needed for classifications or feature detection from unprocessed data. Representation learning algorithms are specifically crafted to acquire knowledge of conceptual features that define data. The field of state representation learning is centered on a specific type of representation learning that involves the acquisition of low-dimensional learned features that undergo temporal evolution and are subject to the influence of an agent's actions. Over the past few years, deep architecture have been widely employed for representation learning and have demonstrated exceptional performance in various tasks, including but not limited to object detection, speech recognition, and image classification. This article provides a comprehensive overview of the evolution of techniques for data representation learning. Our research focuses on the examination of conventional feature learning algorithms and advanced deep learning models. This paper presents an introduction to data representation learning history, along with a comprehensive list of available resources such as online courses, tutorials, and books. Additionally, various tool-boxes are also provided for further exploration in this field. In conclusion, this article presents remarks and future prospects for data representation learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/9852/jrs202301001"
    },
    {
        "id": 30914,
        "title": "Deep Reinforcement Learning Based Backstepping Control for Underactuated AUV",
        "authors": "Hongxuan Chen, Tiechao Bo, Shufeng Wang, Guoyuan Tang",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218400"
    },
    {
        "id": 30915,
        "title": "Dynamic Control of a Cable-Driven Parallel Robot Allowing Wrapping Phenomenon through Sim-to-Real Deep Reinforcement Learning",
        "authors": "Haoda Zhu, Kaihong Ouyang, Hao Xiong, Wenjie Lu",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218923"
    },
    {
        "id": 30916,
        "title": "Misconduct in Post-Selections and Deep Learning",
        "authors": "Juyang Weng",
        "published": "2024-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crc60659.2023.10488526"
    },
    {
        "id": 30917,
        "title": "Obtaining emergent behaviors for swarm robotics singling with deep reinforcement learning",
        "authors": "Pilar Arques, Fidel Aznar, Mar Pujol, Ramón Rizo",
        "published": "2023-6-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2194952"
    },
    {
        "id": 30918,
        "title": "Solving Stabilize-Avoid via Epigraph Form Optimal Control using Deep Reinforcement Learning",
        "authors": "Oswin So, Chuchu Fan",
        "published": "2023-7-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.085"
    },
    {
        "id": 30919,
        "title": "Deep learning techniques applied to skin lesion classification",
        "authors": "Giuliana M. Silva, André E. Lazzaretti, Fernando C. Monteiro",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00013"
    },
    {
        "id": 30920,
        "title": "Cycle Life Prediction of Lithium-Ion Batteries Using Deep Learning",
        "authors": "Yu Fujitaki, Hiroyuki Kobayashi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012233500003543"
    },
    {
        "id": 30921,
        "title": "Robotics with Multi-Fingered Grippers and Deep Reinforcement Learning in Unity",
        "authors": "Jwu-Sheng Hu, Li-Jing Zheng",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cacs60074.2023.10326170"
    },
    {
        "id": 30922,
        "title": "Growing Robot Navigation Based on Deep Reinforcement Learning",
        "authors": "Ahmad Ataka, Andreas P. Sandiwan",
        "published": "2023-4-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccar57134.2023.10151740"
    },
    {
        "id": 30923,
        "title": "Early Crops Diseases Identification Using Deep Transfer Learning",
        "authors": "Zhao Jin, Yutong Wu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/raiic59453.2023.10280831"
    },
    {
        "id": 30924,
        "title": "Leveraging a Two-Level Attention Mechanism for Deep Face Recognition with Siamese One-Shot Learning",
        "authors": "Arkan Mahmood Albayati, Wael Chtourou, Faouzi Zarai",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "Discriminative feature embedding is used for largescale facial recognition. Many image-based facial recognition networks use CNNs like ResNets and VGG-nets. Humans prioritise different elements, but CNNs treat all facial pictures equally. NLP and computer vision use attention to learn the most important part of an input signal. The inter-channel and inter-spatial attention mechanism is used to assess face image component significance in this study. Channel scalars are calculated using Global Average Pooling in face recognition channel attention. A recent study found that GAP encodes low-frequency channel information first. We compressed channels using discrete cosine transform (DCT) instead of scalar representation to evaluate information at frequencies other than the lowest frequency for the channel attention mechanism. Later layers can acquire the feature map after spatial attention. Channel and spatial attention increase CNN facial recognition feature extraction. Channel-only, spatial-only, parallel, sequential, or channel-after-spatial attention blocks exist. Current face recognition attention approaches may be outperformed on public datasets (Labelled Faces in the Wild).",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20135"
    },
    {
        "id": 30925,
        "title": "Robotic Control Mechanism Based on Deep Reinforcement Learning",
        "authors": "Zhaoyan Pan, Junchao Zhou, Qianyi Fan, Zibin Feng, Xinlan Gao, Mu Su",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscer58777.2023.00018"
    },
    {
        "id": 30926,
        "title": "A Deep Learning Approach to Merge Rule-Based and Human-Operated Camera Control for Teleoperated Robotic Systems",
        "authors": "Luay Jawad, Arshdeep Singh-Chudda, Abhishek Shankar, Abhilash Pandya",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "Controlling a laparoscopic camera during robotic surgery represents a multifaceted challenge, demanding considerable physical and cognitive exertion from operators. While manual control presents the advantage of enabling optimal viewing angles, it is offset by its taxing nature. In contrast, current autonomous camera systems offer predictability in tool tracking but are often rigid, lacking the adaptability of human operators. This research investigates the potential of two distinct network architectures: a dense neural network (DNN) and a recurrent network (RNN), both trained using a diverse dataset comprising autonomous and human-driven camera movements. A comparative assessment of network-controlled, autonomous, and human-operated camera systems is conducted to gauge network efficacies. While the dense neural network exhibits proficiency in basic tool tracking, it grapples with inherent architectural limitations that hinder its ability to master the camera’s zoom functionality. In stark contrast, the recurrent network excels, demonstrating a capacity to sufficiently replicate the behaviors exhibited by a mixture of both autonomous and human-operated methods. In total, 96.8% of the dense network predictions had up to a one-centimeter error when compared to the test datasets, while the recurrent network achieved a 100% sub-millimeter testing error. This paper trains and evaluates neural networks on autonomous and human behavior data for camera control.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics13030047"
    },
    {
        "id": 30927,
        "title": "The Study of Sementic Deep Learning Segmentation for Durian Orchard",
        "authors": "Sungwan Boksuwan",
        "published": "2023-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ica-symp56348.2023.10044948"
    },
    {
        "id": 30928,
        "title": "Student Behavior Recognition Using Video-Based Deep Learning",
        "authors": "Xiangui Shi, Vladimir Y. Mariano",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489476"
    },
    {
        "id": 30929,
        "title": "Path Planning of Unmanned Underwater Vehicles Based on Deep Reinforcement Learning Algorithm",
        "authors": "Yu Wang, Zhenzhong Chu, Yongli Hu",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218902"
    },
    {
        "id": 30930,
        "title": "Air Pollution Prediction Method Based on Deep Learning",
        "authors": "Wang Qiang, Vladimir Y. Mariano",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489192"
    },
    {
        "id": 30931,
        "title": "Multimodal Fake News Detection Technology Based on Deep Learning",
        "authors": "Xiaocui Wang, Yue Qi",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489276"
    },
    {
        "id": 30932,
        "title": "Deep reinforcement learning of event-triggered communication and consensus-based control for distributed cooperative transport",
        "authors": "Kazuki Shibata, Tomohiko Jimbo, Takamitsu Matsubara",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.robot.2022.104307"
    },
    {
        "id": 30933,
        "title": "Proposal of a New Approach Using Deep Learning for QR Code Embedding",
        "authors": "Kanaru Kumabuchi, Hiroyuki Kobayashi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012238900003543"
    },
    {
        "id": 30934,
        "title": "Online 3D Bin Packing for Novel Objects Based on Deep Reinforcement Learning",
        "authors": "Shao-Yu Chien, Ching-Chang Wong",
        "published": "2023-8-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268559"
    },
    {
        "id": 30935,
        "title": "Decentralized Federated Deep Learning Image Recognition Models",
        "authors": "Sharun Kugan, Md Quyyum Ul Islam, Rasha Kashef",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/airc57904.2023.10303221"
    },
    {
        "id": 30936,
        "title": "Multi-level Deep Learning Kalman Filter",
        "authors": "Shi Yan, Yan Liang, Binglu Wang",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218866"
    },
    {
        "id": 30937,
        "title": "How Can Geostatistics Help Us Understand Deep Learning?",
        "authors": "Zhenhuan Fang, Lifu Chen, Jin Xing, Xingmin Cai",
        "published": "2024-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crc60659.2023.10488652"
    },
    {
        "id": 30938,
        "title": "Lung Diseases Detection Based on ResNet and Deep Learning Method",
        "authors": "Yiqian Zhang, Yan Ding, Yifei Zhang",
        "published": "2023-3-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccr56747.2023.10194223"
    },
    {
        "id": 30939,
        "title": "Machine Learning in Robotics with Fog/Cloud Computing and IoT",
        "authors": "Kiran Deep Singh, Prabh Deep Singh",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "Robotics has been transformed by machine learning (ML), enabling intelligent and adaptive autonomous systems. By delivering massive computational resources and real-time data, fog/cloud computing  and the Internet of Things boost ML-based robotics. Intelligent and linked robotics have emerged from fog/cloud computing, IoT, and machine learning. Robots using distributed computing, real-time IoT data, and advanced machine learning algorithms could alter industries and improve automation. To maximize its potential, this revolutionary combination must overcome several obstacles.  This paper discusses the benefits and drawbacks of integrating technologies. It offer rapid model training and deployment for robots ML algorithms like deep learning and reinforcement learning. Case studies demonstrate how this combination might enhance robotics across industries. This study discusses the benefits and drawbacks of fog/cloud computing, IoT, and machine learning in robots. We propose solutions for security and privacy, resource management, latency and bandwidth, interoperability, energy efficiency, data quality, and bias. By proactively addressing these difficulties, we can establish a secure, efficient, and privacy-conscious robotic ecosystem where robots seamlessly interact with the physical world, improving productivity, safety, and human-robot collaboration. As these technologies progress, appropriate integration and ethical principles are needed to maximize their benefits to society.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/airo.3621"
    },
    {
        "id": 30940,
        "title": "Adaptive Locomotion Control of Hexapod Robot Based on Deep Reinforcement Learning and Proprioception",
        "authors": "Ruiwen Li, Lei Wang, Yiyang Chen, Ping Ma",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rcae59706.2023.10398839"
    },
    {
        "id": 30941,
        "title": "Evaluating Deep Learning Assisted Automated Aquaculture Net Pens Inspection Using ROV",
        "authors": "Waseem Akram, Muhayyuddin Ahmed, Lakmal Seneviratne, Irfan Hussain",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012160900003543"
    },
    {
        "id": 30942,
        "title": "Real-Time Identification of Plant Diseases Using Aerial Robots and Deep Learning Techniques",
        "authors": "Prajwal Maski, Siddhant Panigrahi, Abhinav Azad, Asokan Thondiyath",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10406641"
    },
    {
        "id": 30943,
        "title": "A Multi Representation Deep Learning Approach for Epileptic Seizure Detection",
        "authors": "Arya Tandy Hermawan, Ilham Ari Elbaith Zaeni, Aji Prasetya Wibawa, Gunawan Gunawan, William Hartanto Hendrawan, Yosi Kristian",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "Epileptic seizures, unpredictable in nature and potentially dangerous during activities like driving, pose significant risks to individual and public safety. Traditional diagnostic methods, which involve labour-intensive manual feature extraction from Electroencephalography (EEG) data, are being supplanted by automated deep learning frameworks. This paper introduces an automated epileptic seizure detection framework utilizing deep learning to bypass manual feature extraction. Our framework incorporates detailed pre-processing techniques: normalization via L2 normalization, filtering with an 80 Hz and 0,5 Hz Butterworth low-pass and high-pass filter, and a 50 Hz IIR Notch filter, channel selection based on standard deviation calculations and Mutual Information algorithm, and frequency domain transformation using FFT or STFT with Hann windows and 50% hop. We evaluated on two datasets: the first comprising 4 canines and 8 patients with 2.299 ictal, 23.445 interictal, and 32.915 test data, 400-5000Hz sampling rate across 16-72 channels; the second dataset, intended for testing, 733 icatal, 4.314 interictal, and 1908 test data, each 10 minutes long, recorded at 400Hz across 16 channels. Three deep learning architectures were assessed: CNN, LSTM, and a hybrid CNN-LSTM model-stems from their demonstrated efficacy in handling the complex nature of EEG data. Each model offers unique strengths, with the CNN excelling in spatial feature extraction, LSTM in temporal dynamics, and the hybrid model combining these advantages.  The CNN model, comprising 31 layers, yielded highest accuracy, achieving 91% on the first dataset (precision 92%, recall 91%, F1-score 91%) and 82% on the second dataset using a 30-second threshold. This threshold was chosen for its clinical relevance. The research advances epileptic seizure detection using deep learning, indicating a promising direction for future medical technology. Future work will focus on expanding dataset diversity and refining methodologies to build upon these foundational results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20870"
    },
    {
        "id": 30944,
        "title": "Real-Time Pedestrian Detection and Tracking System Using Deep Learning and Kalman filter: Applications on Embedded Systems in Advanced Driver Assistance Systems.",
        "authors": "Diego Renan Bruno, Fernando Santos Osório",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10333032"
    },
    {
        "id": 30945,
        "title": "Exploring Deep Reinforcement Learning for Robust Target Tracking Using Micro Aerial Vehicles",
        "authors": "Alberto Dionigi, Mirko Leomanni, Alessandro Saviolo, Giuseppe Loianno, Gabriele Costante",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10407017"
    },
    {
        "id": 30946,
        "title": "Using Deep Reinforcement Learning to Solve a Navigation Problem for a Swarm Robotics System",
        "authors": "Alaa Iskandar, Hussam M. Rostum, Béla Kovács",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57093.2023.10178888"
    },
    {
        "id": 30947,
        "title": "A Feature Structure Based Interpretability Evaluation Approach for Deep Learning",
        "authors": "Xinyu Li, Xiaoguang Gao, Chenfeng Wang, Qianglong Wang",
        "published": "2023-4-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccre57112.2023.10155583"
    },
    {
        "id": 30948,
        "title": "Research on Unmanned Surface Vehicle Collision Avoidance Based on Deep Reinforcement Learning",
        "authors": "Hua Xiao, Qingnian Zhang",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489693"
    },
    {
        "id": 30949,
        "title": "RAM-CG: Relation-aware Adaptive Model for Continual Graph Learning",
        "authors": "Qinghua Shen, Guiquan Liu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00024"
    },
    {
        "id": 30950,
        "title": "Policy Learning with Deep Koopman Operator Networks",
        "authors": "Dongdong Zhao, Yichang Li, Xiaodi Yang, Shi Yan",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218748"
    },
    {
        "id": 30951,
        "title": "The Classification of Aflatoxin Contamination Level in Cocoa Beans using Fluorescence Imaging and Deep learning",
        "authors": "Muhammad Syukri Sadimantara, Bambang Dwi Argo, Sucipto Sucipto, Dimas Firmanda Al Riza, Yusuf Hendrawan",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Aflatoxin contamination in cacao is a significant problem in terms of trade losses and health effects. This calls for the need for a non-invasive, precise, and effective detection strategy. This research contribution is to determine the best deep-learning model to classify the aflatoxin contamination level in cocoa beans based on fluorescence images and deep learning to improve performance in the classification. The process involved inoculating and incubating Aspergillus flavus (6mL/100g) to obtain aflatoxin-contaminated cocoa beans for 7 days during the incubation period. Liquid Mass Chromatography (LCMS) was used to quantify the aflatoxin in order to categorize the images into different levels including “free of aflatoxin”, “contaminated below the limit”, and “contaminated above the limit”.  300 images were acquired through a mini studio equipped with UV lamps.  The aflatoxin level was classified using several pre-trained CNN approaches which has high accuracy such as GoogLeNet, SqueezeNet, AlexNet, and ResNet50. The sensitivity analysis showed that the highest classification accuracy was found in the GoogLeNet model with optimizer: Adam and learning rate: 0.0001 by 96.42%. The model was tested using a testing dataset and obtain accuracy of 96% based on the confusion matrix. The findings indicate that combining CNN with fluorescence images improved the ability to classify the amount of aflatoxin contamination in cacao beans. This method has the potential to be more accurate and economical than the current approach, which could be adapted to reduce aflatoxin's negative effects on food safety and cacao trade losses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.19081"
    },
    {
        "id": 30952,
        "title": "A review of robot grasping tactile perception based on deep learning",
        "authors": "Chi Zhang, Yingzhao Zhu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011588"
    },
    {
        "id": 30953,
        "title": "Obstacle Avoidance Based on Deep Reinforcement Learning and Artificial Potential Field",
        "authors": "Haoran Han, Zhilong Xi, Jian Cheng, Maolong Lv",
        "published": "2023-4-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccar57134.2023.10151771"
    },
    {
        "id": 30954,
        "title": "Dual Robot System for Autonomous Needle Insertion into Deep Vessels",
        "authors": "Lorenzo Civati,  , Maria Koskinopoulou, Andrea Santangelo, Leonardo S. Mattos,  ,  ,  ",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Precise needle insertion is a key operation in many  medical procedures such as peripheral catheterization,  cardiac endovascular treatments, biopsy and treatment  of tumours in soft tissues such as breast, prostate and  abdomen [1]. Among them, Central Venous Access (CVA)  is a routine procedure typically performed by experienced  clinicians under ultrasound or x-ray guidance in a surgical  room environment. CVA is most commonly conducted in  three deep vein locations: the internal jugular vein, the  subclavian vein, and the femoral vein. During CVA, clinician should insert the needle while  maintaining proper visualization of the target vessel (i.e.  ultrasound-guided access). However, performing the de-  tection and continuous visualization of the target vessel  and simultaneously precisely controlling the needle inser-  tion is not trivial. At the same time, complication rates  during CVA range up to 15% (mechanical in 5-19% of  patients; infectious in 5-26%; thrombotic in 2-26%) [2]. In this paper, we propose a dual robot system for  autonomous needle insertion into deep vessels by enabling  real-time visualization of the vein and adaptive trajectory  planning to provide safe and quick interactions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31256/hsmr2023.29"
    },
    {
        "id": 30955,
        "title": "End-to-end UAV Intelligent Training via Deep Reinforcement Learning",
        "authors": "Xin Liu, Caizheng Wang, Qiuquan Guo, Jun Yang",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489264"
    },
    {
        "id": 30956,
        "title": "Deep Learning Based COVID-19 Detection from Chest X-ray Images",
        "authors": "Pian Wan, Zhiwei Lu, Chen Chen, Teik Toe Teoh",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccr56747.2023.10194142"
    },
    {
        "id": 30957,
        "title": "A SAC-Based Deep Reinforcement Learning Approach for Autonomous Underwater Vehicle Combat",
        "authors": "Kai Zhang, Yang Xu, Junjie Zhu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489144"
    },
    {
        "id": 30958,
        "title": "Benchmarking Actor-Critic Deep Reinforcement Learning Algorithms for Robotics Control With Action Constraints",
        "authors": "Kazumi Kasaura, Shuwa Miura, Tadashi Kozuno, Ryo Yonetani, Kenta Hoshino, Yohei Hosoe",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lra.2023.3284378"
    },
    {
        "id": 30959,
        "title": "Deep Learning based Defect Detection Algorithm for Solar Panels",
        "authors": "Jiaqi Li, Hongxu Li, Yifan Wu, Hailiang Zhou, Luigi Manfredi, Peng Li, Hong Zhang",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wrcsara60131.2023.10261859"
    },
    {
        "id": 30960,
        "title": "Short term power load forecasting system based on improved neural network deep learning model",
        "authors": "Lulu Yuan",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "AbstractThe electricity load prediction is closely related to production and daily life. The electricity load prediction is also a very important task. With the widespread application of smart grids, load data shows an exponential growth trend. The huge amount of data in the load makes power prediction even more difficult. On the basis of traditional prediction algorithms, a power load prediction model based on machine learning and neural networks is designed. Because the single model prediction has the unstable results, a combined model is obtained based on the ensemble learning idea and two single model prediction method. The prediction results are detected by the load data. From the experimental results, the mean absolute percentage error (MAPE) of the AdaBoost‐GRU data fusion model is 0.066%. Compared to the AdaBoost‐GRU data fusion model, the MAPE decreases by 1.59% and 1.12%, respectively. The relative mass scores of the two groups decrease by 132.57% and 89.14%, respectively. The prediction accuracy is improved, which has advantages compared to traditional combination models. It can effectively enhance the accuracy of short‐term power grid load forecasting. It is an important scientific and practical reference for power grid decision‐making.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/adc2.197"
    },
    {
        "id": 30961,
        "title": "Deep Learning Based Approach for Human-like Driving Trajectory Planning",
        "authors": "Feifei Zhai, Hao Xu, Chen Chen, Guanyu Zhang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraic61978.2023.00075"
    },
    {
        "id": 30962,
        "title": "Deep Learning Methods for Ship Classification: From Visible to Infrared Images",
        "authors": "Tianci Liu, Hengjia Qin, Zhuo Zhan, Yunpeng Liu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489039"
    },
    {
        "id": 30963,
        "title": "A REVIEW OF QUALITY IMPROVEMENT IN ROBOTICS USING AI, REINFORCED LEARNING AND DEEP LEARNING",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.1.nq22359"
    },
    {
        "id": 30964,
        "title": "Keypoint Detection and Description through Deep Learning in Unstructured Environments",
        "authors": "Georgios Petrakis, Panagiotis Partsinevelos",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Feature extraction plays a crucial role in computer vision and autonomous navigation, offering valuable information for real-time localization and scene understanding. However, although multiple studies investigate keypoint detection and description algorithms in urban and indoor environments, far fewer studies concentrate in unstructured environments. In this study, a multi-task deep learning architecture is developed for keypoint detection and description, focused on poor-featured unstructured and planetary scenes with low or changing illumination. The proposed architecture was trained and evaluated using a training and benchmark dataset with earthy and planetary scenes. Moreover, the trained model was integrated in a visual SLAM (Simultaneous Localization and Maping) system as a feature extraction module, and tested in two feature-poor unstructured areas. Regarding the results, the proposed architecture provides a mAP (mean Average Precision) in a level of 0.95 in terms of keypoint description, outperforming well-known handcrafted algorithms while the proposed SLAM achieved two times lower RMSE error in a poor-featured area with low illumination, compared with ORB-SLAM2. To the best of the authors’ knowledge, this is the first study that investigates the potential of keypoint detection and description through deep learning in unstructured and planetary environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics12050137"
    },
    {
        "id": 30965,
        "title": "Research on Insulator Defect Detection by UAV Based on Deep Learning",
        "authors": "Zhiwei Jiang, Xiaojin Fu, Wenbin Chen, Sha Li",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489299"
    },
    {
        "id": 30966,
        "title": "A low computation-cost locomotion control for underwater snake robot based on Monte Carlo model predictive control and curvature derivative control",
        "authors": "Yiping Qiu, Hisashi Date",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2024.2340546"
    },
    {
        "id": 30967,
        "title": "Deep Learning based Visual Simultaneous Localization and Mapping for a Mobile Robot",
        "authors": "Yu-Hsiang Zhuang, Cheng-Zong Yuan, Greta Vedovato, Min-Fan Ricky Lee",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268511"
    },
    {
        "id": 30968,
        "title": "Exploring the Use of Deep Reinforcement Learning Algorithms for Wound-Approaching Trajectories in Robot-Assisted Minimally Invasive Surgery",
        "authors": "Marco Caianiello, Cristina Iacono, Antonella Imperato, Fanny Ficuciello",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10406708"
    },
    {
        "id": 30969,
        "title": "PIC4rl-gym: a ROS2 Modular Framework for Robots Autonomous Navigation with Deep Reinforcement Learning",
        "authors": "Mauro Martini, Andrea Eirale, Simone Cerrato, Marcello Chiaberge",
        "published": "2023-3-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccr56747.2023.10193996"
    },
    {
        "id": 30970,
        "title": "Deep Learning-Based Predictive Maintenance Model for Air Cylinder in Manufacturing Systems",
        "authors": "Mengfei Yuan, Songsong Zhang, Pingbao Yang, Yao Deng",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489303"
    },
    {
        "id": 30971,
        "title": "A Smart Sign Language Interpreter for Medical Environments Using Deep Learning: Morocco Case Study",
        "authors": "Oumaima Ben Soultane, Zaynab Amine, Yassine Salih-Alj",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmcr60777.2024.10482238"
    },
    {
        "id": 30972,
        "title": "Deep Reinforcement Learning-Based Control of Bicycle Robots on Rough Terrain",
        "authors": "Xianjin Zhu, Xudong Zheng, Yang Deng, Zhang Chen, Bin Liang, Yu Liu",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccar57134.2023.10151769"
    },
    {
        "id": 30973,
        "title": "Deep Learning in Robotics to Remove Ward of Weeds",
        "authors": " Dr. Savithri V,  Dr. R. Lakshmi Devi,  Ms. R. Arul Mathi",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "Weeds are the problematic unwanted plants in the fields that causes, 33.16% yield loss in food crops, 41.26% in cereals, 31.88% in pulses, 40.82% in oilseeds, 34.23% in fiber crops, and 40.28% in rice crops. The Proposed System helps to optimization the work to yield in rice crop by removing weed that grows along crop, focusing on these issue is important as to yield the crops only with rice crop. This study focus on the issue in rice crop plant which grows along with weed (unwanted plant).New methodology introduced to remove the weed plant that grows with crop by the means of robotics. The image will be captured through drone in the field and the same frame co-ordinate forwarded to robotic designed with agriculture drone sensor which is coded using python to predict the accurate weed plant for statistical prediction. The robot locate the plant after comparing with the captured co-ordinates of drone with its own captured image and decide to pluck the weed plant grown along with crop",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-15737"
    },
    {
        "id": 30974,
        "title": "Distributed control for flock navigation using nonlinear model predictive control",
        "authors": "Aneek Nag, Kaoru Yamamoto",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2299859"
    },
    {
        "id": 30975,
        "title": "Zeroth-Order Optimization Attacks on Deep Reinforcement Learning-Based Lane Changing Algorithms for Autonomous Vehicles",
        "authors": "Dayu Zhang, Nasser Azad, Sebastian Fischmeister, Stefan Marksteiner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012187700003543"
    },
    {
        "id": 30976,
        "title": "Deep Reinforcement Learning with Pedestrian Trajectory Prediction Model for Service Robot Navigation in Crowded Environments",
        "authors": "Shih-Hao Wang, Yu-Hsiung Wu, Tzuu-Hseng S. Li",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268571"
    },
    {
        "id": 30977,
        "title": "Learning Agile Flight Maneuvers: Deep SE(3) Motion Planning and Control for Quadrotors",
        "authors": "Yixiao Wang, Bingheng Wang, Shenning Zhang, Han Wei Sia, Lin Zhao",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160712"
    },
    {
        "id": 30978,
        "title": "A Lightweight Image Dehazing Algorithm Based on Deep Learning",
        "authors": "Jiashuo Zhang, Chunmei Chen, Guihua Liu, Zhongxiang Pang, Pingping Xiang, Wei Pu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/raiic59453.2023.10281130"
    },
    {
        "id": 30979,
        "title": "Editorial: Advanced learning control in physical interaction tasks",
        "authors": "Chao Zeng, Jing Guo, Qiang Li, Chenguang Yang",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frobt.2023.1166759"
    },
    {
        "id": 30980,
        "title": "Safe Autonomous Vehicle Cooperative Cruise Control With Deep Reinforcement Learning",
        "authors": "James Yang, Natnael M. Negash",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "Abstract\nRecently, intelligent control approaches through reinforcement learning have achieved robust performance. The practical complication of reinforcement learning in approximating complex functions is resolved through the introduction of deep learning into the framework. We developed such a deep reinforcement learning-based optimal vehicle cruise control. The most commonly used algorithm, deep deterministic policy gradient (DDPG), overestimates Q-functions that can lead to sub-optimal agent policy. We proposed the twin-delayed DDPG (TD3) algorithm, the extension of the DDPG algorithm. We have compared our proposed method with model-based control approaches and non-self-learning as physics-based car-following models to see the effectiveness of the proposed approach. The TD3 agent has achieved a minimum spacing error than MPC and PID. Moreover, the TD3 agent has shown effective tracking performance compared to physics-based models and risk assessments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-113683"
    },
    {
        "id": 30981,
        "title": "Provably Safe Deep Learning-Based Offset-Free Model Predictive Control and its Application to Safety-Critical Autonomous Driving",
        "authors": "Han Wang, Longyan Li, Chao Ning",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rcae59706.2023.10398830"
    },
    {
        "id": 30982,
        "title": "Deep Reinforcement Learning-Based Control of Stewart Platform With Parametric Simulation in ROS and Gazebo",
        "authors": "Hadi Yadavari, Vahid Tavakol Aghaei, Serhat İkizoğlu",
        "published": "2023-6-1",
        "citations": 2,
        "abstract": "AbstractThe Stewart platform is an entirely parallel robot with mechanical differences from typical serial robotic manipulators, which has a wide application area ranging from flight and driving simulators to structural test platforms. This work concentrates on learning to control a complex model of the Stewart platform using state-of-the-art deep reinforcement learning (DRL) algorithms. In this regard, to enhance the reliability of the learning performance and to have a test bed capable of mimicking the behavior of the system completely, a precisely designed simulation environment is presented. Therefore, we first design a parametric representation for the kinematics of the Stewart platform in Gazebo and robot operating system (ROS) and integrate it with a Python class to conveniently generate the structures in simulation description format (SDF). Then, to control the system, we benefit from three DRL algorithms: the asynchronous advantage actor–critic (A3C), the deep deterministic policy gradient (DDPG), and the proximal policy optimization (PPO) to learn the control gains of a proportional integral derivative (PID) controller for a given reaching task. We chose to apply these algorithms due to the Stewart platform’s continuous action and state spaces, making them well-suited for our problem, where exact controller tuning is a crucial task. The simulation results show that the DRL algorithms can successfully learn the controller gains, resulting in satisfactory control performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/1.4056971"
    },
    {
        "id": 30983,
        "title": "Reviewers",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00007"
    },
    {
        "id": 30984,
        "title": "Sponsors",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00008"
    },
    {
        "id": 30985,
        "title": "Adaptive MIMO PID Control of a Wheel-Leg Manipulator by Considering the Slippage Based on Deep Reinforcement Learning",
        "authors": "A.H. Asadi, N. Nikseresht, A.H. Korayem",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrom60803.2023.10412351"
    },
    {
        "id": 30986,
        "title": "Recognition and Position Estimation of Pears in Complex Orchards Using Stereo Camera and Deep Learning Algorithm",
        "authors": "Siyu Pan, Ayanori Yorozu, Akihisa Ohya, Tofeal Ahamed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012179200003543"
    },
    {
        "id": 30987,
        "title": "Deep-Reinforcement-Learning-Based Path Planning for Industrial Robots Using Distance Sensors as Observation",
        "authors": "Teham Bhuiyan, Linh Kästner, Yifan Hu, Benno Kutschank, Jens Lambrecht",
        "published": "2023-4-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccre57112.2023.10155608"
    },
    {
        "id": 30988,
        "title": "Preface",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00005"
    },
    {
        "id": 30989,
        "title": "Vision-Based Analytics of Flare Stacks Using Deep Learning Detection",
        "authors": "Muaz Al Radi, Said Boumaraf, Hamad Karki, Jorge Dias, Naoufel Werghi, Sajid Javed",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10406384"
    },
    {
        "id": 30990,
        "title": "Efficient Policy Learning for General Robotic Tasks with Adaptive Dual-memory Hindsight Experience Replay Based on Deep Reinforcement Learning",
        "authors": "Menghua Dong, Fengkang Ying, Xiangjian Li, Huashan Liu",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrca57894.2023.10087824"
    },
    {
        "id": 30991,
        "title": "Heating ventilation air‐conditioner system for multi‐regional commercial buildings based on deep reinforcement learning",
        "authors": "Juan Yang, Jing Yu, Shijing Wang",
        "published": "2024-2-3",
        "citations": 0,
        "abstract": "AbstractIn an era of significant energy consumption by commercial building HVAC systems, this study introduces a Deep Reinforcement Learning (DRL) approach to optimize these systems in multi‐zone commercial buildings, targeting reduced energy usage and enhanced user comfort. The research begins with the development of an energy consumption model for multi‐zone HVAC systems, considering the complexity and uncertainty of system parameters. This model informs the creation of a novel DRL‐based optimization algorithm, which incorporates multi‐stage training and a multi‐agent attention mechanism, enhancing stability and scalability. Comparative analysis against traditional control methods shows the proposed algorithm's effectiveness in reducing energy consumption while maintaining indoor comfort. The study presents an innovative DRL strategy for energy management in commercial HVAC systems, offering substantial potential for sustainable practices in building management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/adc2.190"
    },
    {
        "id": 30992,
        "title": "Conference Committee",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00006"
    },
    {
        "id": 30993,
        "title": "Learning global spatial information for multi-view object-centric models",
        "authors": "Yuya Kobayashi, Masahiro Suzuki, Yutaka Matsuo",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2183780"
    },
    {
        "id": 30994,
        "title": "Sponsors",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00008"
    },
    {
        "id": 30995,
        "title": "Bayesian controller fusion: Leveraging control priors in deep reinforcement learning for robotics",
        "authors": "Krishan Rana, Vibhavari Dasagi, Jesse Haviland, Ben Talbot, Michael Milford, Niko Sünderhauf",
        "published": "2023-3",
        "citations": 4,
        "abstract": " We present Bayesian Controller Fusion (BCF): a hybrid control strategy that combines the strengths of traditional hand-crafted controllers and model-free deep reinforcement learning (RL). BCF thrives in the robotics domain, where reliable but suboptimal control priors exist for many tasks, but RL from scratch remains unsafe and data-inefficient. By fusing uncertainty-aware distributional outputs from each system, BCF arbitrates control between them, exploiting their respective strengths. We study BCF on two real-world robotics tasks involving navigation in a vast and long-horizon environment, and a complex reaching task that involves manipulability maximisation. For both these domains, simple handcrafted controllers exist that can solve the task at hand in a risk-averse manner but do not necessarily exhibit the optimal solution given limitations in analytical modelling, controller miscalibration and task variation. As exploration is naturally guided by the prior in the early stages of training, BCF accelerates learning, while substantially improving beyond the performance of the control prior, as the policy gains more experience. More importantly, given the risk-aversity of the control prior, BCF ensures safe exploration and deployment, where the control prior naturally dominates the action distribution in states unknown to the policy. We additionally show BCF’s applicability to the zero-shot sim-to-real setting and its ability to deal with out-of-distribution states in the real world. BCF is a promising approach towards combining the complementary strengths of deep RL and traditional robotic control, surpassing what either can achieve independently. The code and supplementary video material are made publicly available at https://krishanrana.github.io/bcf . ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/02783649231167210"
    },
    {
        "id": 30996,
        "title": "Author Index",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00036"
    },
    {
        "id": 30997,
        "title": "Development of a Simulation Environment for Robot Soccer Game with Deep Reinforcement Learning and Role Assignment",
        "authors": "Hanzhong Zhong, Haier Zhu, Xiang Li",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wrcsara60131.2023.10261865"
    },
    {
        "id": 30998,
        "title": "Copyright Page",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00003"
    },
    {
        "id": 30999,
        "title": "Pixyz: a Python library for developing deep generative models",
        "authors": "Masahiro Suzuki, Takaaki Kaneko, Yutaka Matsuo",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2244568"
    },
    {
        "id": 31000,
        "title": "MFAP-Net: A Study on Deep Learning Semantic Segmentation Framework for LiDAR Point Clouds",
        "authors": "Yawu Liu, Lifu Chen, Bingnan Wang, Maosheng Xiang, Haoda Chen, Junqi Zhao",
        "published": "2024-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crc60659.2023.10488510"
    },
    {
        "id": 31001,
        "title": "Imitation learning based deep reinforcement learning for traffic signal control",
        "authors": "CunXiao Qiu, DaKe Zhou, Qingxian Wu, Tao Li",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004832"
    },
    {
        "id": 31002,
        "title": "Guest Editorial: Industrial Applications of Deep Learning Technology",
        "authors": "Youngbae Hwang, Wangheon Lee",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5302/j.icros.2023.23.9005"
    },
    {
        "id": 31003,
        "title": "Adaptive Stimulation Profiles Adjustment of Functional Electrical Stimulation for Foot Drop Based on Iterative Learning Control",
        "authors": "You Li, Qinlian Yang, Peng Fang, Rong Song",
        "published": "2023-7-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218922"
    },
    {
        "id": 31004,
        "title": "Real-Time Inverse Dynamic Deep Neural Network Tracking Control for Delta Robot Based on a COVID-19 Optimization",
        "authors": "Mohamed Shamseldin",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "This paper presents a new technique to design an inverse dynamic model for a delta robot experimental setup to obtain an accurate trajectory. The input/output data were collected using an NI DAQ card where the input is the random angles profile for the three-axis and the output is the corresponding measured torques. The inverse dynamic model was developed based on the deep neural network (NN) and the new COVID-19 optimization to find the optimal initial weights and bias values of the NN model. Due to the system uncertainty and nonlinearity, the inverse dynamic model is not enough to track accurately the preselected profile. So, the PD compensator is used to absorb the error deviation of the end effector. The experimental results show that the proposed inverse dynamic deep NN with PD compensator achieves good performance and high tracking accuracy. The suggested control was examined using two different methods. The spiral path is the first, with a root mean square error of 0.00258 m, while the parabola path is the second, with a root mean square error of 0.00152 m.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v4i5.18865"
    },
    {
        "id": 31005,
        "title": "Advanced Deep Learning-Based Approach for Tooth Detection, and Dental Cavity and Restoration Segmentation in X-Ray Images",
        "authors": "Tanaz Ghahremani, Mohammad Hoseyni, Mohammad Javad Ahmadi, Pouria Mehrabi, Amirhossein Nikoofard",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrom60803.2023.10412537"
    },
    {
        "id": 31006,
        "title": "Subgoal-Driven Navigation in Dynamic Environments Using Attention-Based Deep Reinforcement Learning",
        "authors": "Jorge De Heuvel, Weixian Shi, Xiangyu Zeng, Maren Bennewitz",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icar58858.2023.10406349"
    },
    {
        "id": 31007,
        "title": "Force Calibration and Prediction of Soft Stretch Sensor Based on Deep Learning",
        "authors": "Luying Feng, Lianghong Gui, Zehao Yan, Linfan Yu, Canjun Yang, Wei Yang",
        "published": "2023-7-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icarm58088.2023.10218756"
    },
    {
        "id": 31008,
        "title": "Multi-view dreaming: multi-view world model with contrastive learning",
        "authors": "Akira Kinose, Masashi Okada, Ryo Okumura, Tadahiro Taniguchi",
        "published": "2023-10-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2264363"
    },
    {
        "id": 31009,
        "title": "Table of Contents",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00004"
    },
    {
        "id": 31010,
        "title": "A 3D/2D Coronary Artery Registration Method Based on Deep Reinforcement Learning",
        "authors": "Jun Yan, Zhuang Fu, Zeyu Fu, Yisheng Guan",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccr56747.2023.10193905"
    },
    {
        "id": 31011,
        "title": "Keynote Lecture",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00009"
    },
    {
        "id": 31012,
        "title": "Author Index",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00044"
    },
    {
        "id": 31013,
        "title": "Title Page iii",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00002"
    },
    {
        "id": 31014,
        "title": "Title Page i",
        "authors": "",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00001"
    },
    {
        "id": 31015,
        "title": "New Model of Photovoltaic System Adapted by a Digital MPPT Control and Radiation Predictions Using Deep Learning",
        "authors": "Amal Zouhri, Mostafa El Mallahi",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Forecasting solar radiation is one of the most useful impacts that can give us a deep vision on maintaining the integrity of solar systems. The availability and ease of use of the data make this process simpler. Predictions may be produced using various data sources. In fact, there are two different forms that can be identified. The first one was the use of historical solar radiation data, while the second one was the use of other meteorological parameters. The availability and choice of the data source can have an effect on the choice of the model and methods used. Our proposed article aims to take research as an example to review the solar radiation situation in Morocco and outline the methods of predicting solar radiation using different machine learning and deep learning methods like ANN, MLP, BPNN, DNN, and LSTM, which are used in different regions in Morocco.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14313/2-2023/17"
    },
    {
        "id": 31016,
        "title": "Research on fire protection system based on deep learning",
        "authors": "Tiannian Zhou, Ping Liang, Zhi Zhang, Zhiyong Dai, Guangqi Li, Hongyuan Guo",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraic61978.2023.00069"
    },
    {
        "id": 31017,
        "title": "Program Committee",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00007"
    },
    {
        "id": 31018,
        "title": "Learning to Estimate Multivariate Uncertainty in Deep Pedestrian Trajectory Prediction",
        "authors": "Augusto R. Castro, Valdir Grassi",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10333011"
    },
    {
        "id": 31019,
        "title": "Organizing Committee",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00006"
    },
    {
        "id": 31020,
        "title": "Copyright Page",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00003"
    },
    {
        "id": 31021,
        "title": "Multi-scale ultrasound image denoising algorithm based on deep learning model for super-resolution reconstruction",
        "authors": "Jianhong Gan, Liping Wang, Zhiming Liu, Jiayun Wang",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3622896.3622898"
    },
    {
        "id": 31022,
        "title": "A Deep Reinforcement Learning Visual Servoing Control Strategy for Target Tracking Using a Multirotor UAV",
        "authors": "Andreas Mitakidis, Sotirios N. Aspragkathos, Fotis Panetsos, George C. Karras, Kostas J. Kyriakopoulos",
        "published": "2023-2-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icara56516.2023.10125971"
    },
    {
        "id": 31023,
        "title": "Deep Reinforcement Learning for Mapless Robot Navigation Systems",
        "authors": "Iure Rosa L. Oliveira, Alexandre S. Brandão",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10333043"
    },
    {
        "id": 31024,
        "title": "Variable Admittance Interaction Control of UAVs via Deep Reinforcement Learning",
        "authors": "Yuting Feng, Chuanbeibei Shi, Jianrui Du, Yushu Yu, Fuchun Sun, Yixu Song",
        "published": "2023-5-29",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160558"
    },
    {
        "id": 31025,
        "title": "Model Optimization in Deep Learning Based Robot Control for Autonomous Driving",
        "authors": "Sergio Paniego, Nikhil Paliwal, JoséMaría Cañas",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lra.2023.3336244"
    },
    {
        "id": 31026,
        "title": "Deep Learning and Machine Learning Algorithms for Enhanced Aircraft Maintenance and Flight Data Analysis",
        "authors": "Malene Helgo",
        "published": "2023-5-15",
        "citations": 1,
        "abstract": "This paper examines the use of machine learning and deep learning algorithms in the aviation industry, with a specific emphasis on aircraft diagnosis/prognosis, predictive maintenance, feature selection, and flight data monitoring (FDM). This study highlights the potential use of these algorithms in enhancing the efficacy and effectiveness of various aircraft operations. In the field of aviation prognosis and diagnosis, many designs have been acknowledged as efficient for defect identification, calculation of remaining usable life, and prediction of excessive vibration in aero-engines. The architectural models discussed in this paper include deep autoencoders, deep belief networks, long short-term memory networks, and convolutional neural networks. The use of feature selection and scalar feature selection methodologies has been seen to augment the efficacy of FDM (Feature Detection and Matching) algorithms by means of identifying noteworthy features and detecting highly linked features. The application of machine learning algorithms in the domain of predictive maintenance enables real-time assessment of equipment health, hence reducing possible hazards and improving overall equipment performance. The research results emphasize the importance of flight data monitoring in improving safety and operational efficiency in the field of civil aviation. The application of machine learning approaches, namely classification algorithms, facilitates the analysis of flight data for the aim of identifying unsafe behaviors or violations from established operational standards.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/9852/jrs202301009"
    },
    {
        "id": 31027,
        "title": "Utilizing Multi-Agent Deep Reinforcement Learning for Autonomous Intersection Management Systems: A Promising Approach",
        "authors": "Mostafa K. Ghaith, Mohamed M. Rehaan, N. Shouman, Y. Abdalla, Omar M. Shehata",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/airc57904.2023.10303022"
    },
    {
        "id": 31028,
        "title": "Deep learning technique for prediction of Covid-19 using CT images",
        "authors": "U. Vanitha, A. Albert Raj, T. Kavya, M. S. Khaashwini, A. Meena",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0175817"
    },
    {
        "id": 31029,
        "title": "Special issue on online motion planning and model predictive control",
        "authors": "Yuichi Tazaki, Kensuke Harada, Masaki Murooka, Adrien Escande",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2182533"
    },
    {
        "id": 31030,
        "title": "Feedback control of a pipe cleaning snake robot with two helixes connected",
        "authors": "Haruki Tanihira, Mizuki Nakajima, Motoyasu Tanaka",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2299844"
    },
    {
        "id": 31031,
        "title": "Individual axis control for industrial robots by posture-variant dynamic compensation and feedback control using the FDTD method",
        "authors": "Juan Padron, Kenta Tatsuda, Kiyoshi Ohishi, Yuki Yokokura, Toshimasa Miyazaki",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2291721"
    },
    {
        "id": 31032,
        "title": "Detection of Hidden Moving Targets by a Group of Mobile Agents with Deep Q-Learning",
        "authors": "Barouch Matzliach, Irad Ben-Gal, Evgeny Kagan",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "In this paper, we propose a solution for the problem of searching for multiple targets by a group of mobile agents with sensing errors of the first and the second types. The agents’ goal is to plan the search and follow its trajectories that lead to target detection in minimal time. Relying on real sensors’ properties, we assume that the agents can detect the targets in various directions and distances; however, they are exposed to first- and second-type statistical errors. Furthermore, we assume that the agents in the group have errorless communication with each other. No central station or coordinating agent is assumed to control the search. Thus, the search follows a fully distributed decision-making process, in which each agent plans its path independently based on the information about the targets, which is collected independently or received from the other agents. The suggested solution includes two algorithms: the Distributed Expected Information Gain (DEIG) algorithm, which implements dynamic Voronoi partitioning of the search space and plans the paths by maximizing the expected one-step look-ahead information per region, and the Collective Q-max (CQM) algorithm, which finds the shortest paths of the agents in the group by maximizing the cumulative information about the targets’ locations using deep Q-learning techniques. The developed algorithms are compared against previously developed reactive and learning methods, such as the greedy centralized Expected Information Gain (EIG) method. It is demonstrated that these algorithms, specifically the Collective Q-max algorithm, considerably outperform existing solutions. In particular, the proposed algorithms improve the results by 20% to 100% under different scenarios of noisy environments and sensors’ sensitivity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics12040103"
    },
    {
        "id": 31033,
        "title": "Title Page iii",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00002"
    },
    {
        "id": 31034,
        "title": "Retracted: Deep Learning BP Neural Network Guided Evaluation of Students’ Innovation and Entrepreneurship Education",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9845964"
    },
    {
        "id": 31035,
        "title": "Development industrial control learning model based on augmented reality at the polytechnic",
        "authors": " Mukhlisin, Hamsu Abdul Gani,  Purnamawati",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0106227"
    },
    {
        "id": 31036,
        "title": "Table of Contents",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00004"
    },
    {
        "id": 31037,
        "title": "Title Page i",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00001"
    },
    {
        "id": 31038,
        "title": "Automatic Detection of Natural Disaster Effect on Paddy Field from Satellite Images Using Deep Learning Techniques",
        "authors": "Tahmid Alavi Ishmam, Amin Ahsan Ali, Md Ahsraful Amin, A K M Mahbubur Rahman",
        "published": "2023-4-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccre57112.2023.10155582"
    },
    {
        "id": 31039,
        "title": "Differentially Flat Learning-Based Model Predictive Control Using a Stability, State, and Input Constraining Safety Filter",
        "authors": "Adam W. Hall, Melissa Greeff, Angela P. Schoellig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lcsys.2023.3285616"
    },
    {
        "id": 31040,
        "title": "Deep Learning Model Selection With Parametric Complexity Control",
        "authors": "Olga Grebenkova, Oleg Bakhteev, Vadim Strijov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011626900003393"
    },
    {
        "id": 31041,
        "title": "Implementing Deep Reinforcement Learning in Autonomous Control Systems",
        "authors": " Noureldin Ragheb,  Mervat M. A. Mahmoud",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "Developing a safe and reliable autonomous vehicle has been a significant focus in recent years. Supervised learning methods require large amounts of labelled data for training, making it expensive. The performance of these agents is limited to the data provided in training and the inability to generalize performance in different environments. In addition, some driving situations, such as near-accident scenarios, are difficult to cover in the training data. As a result, the autonomous driving agent may behave unexpectedly in safety-critical situations, making it unreliable for safe transportation. Reinforcement learning is a potential solution for these issues. This research paper explores the potential of applying deep reinforcement learning techniques to autonomous driving, with a spotlight on comparing two popular deep reinforcement learning algorithms: Deep Q-Network (DQN) and Deep Deterministic Policy Gradient (DDPG). The study uses the CARLA simulator, which provides a realistic environment and conditions for testing autonomous driving algorithms. The study finds that DDPG outperforms DQN regarding average reward, but DQN performs better regarding collision rate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37934/araset.41.1.168178"
    },
    {
        "id": 31042,
        "title": "Smart voice recognition based on deep learning for depression diagnosis",
        "authors": "Sukit Suparatpinyo, Nuanwan Soonthornphisaj",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10015-023-00852-4"
    },
    {
        "id": 31043,
        "title": "ILFMT-LS: Specific Target Detection in Mobile Crowds Based on Deep Learning",
        "authors": "Ao Zheng, Maojun Li, Dingxiang Wang, Chang You, Yawu Liu, Xudong Zeng",
        "published": "2024-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crc60659.2023.10488523"
    },
    {
        "id": 31044,
        "title": "STM Topography Image Noise Modeling And Blind Denoising Based On Deep Learning",
        "authors": "Xianguang Fan, Hanqing Pan, Yuchen Huang, Yingjie Xu, Xin Wang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraic61978.2023.00059"
    },
    {
        "id": 31045,
        "title": "UAMDynCon-DT: A Data-driven Dynamics and Robust Control Framework for UAM Vehicle Digitalization using Deep Learning",
        "authors": "Minseok Jang, Jeongseok Hyun, Taeho Kwag, Chan Gwak, Tuan Anh Nguyen, Jae-Woo Lee",
        "published": "2023-2-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmcr56776.2023.10181072"
    },
    {
        "id": 31046,
        "title": "Model predictive control of legged and humanoid robots: models and algorithms",
        "authors": "Sotaro Katayama, Masaki Murooka, Yuichi Tazaki",
        "published": "2023-3-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2168134"
    },
    {
        "id": 31047,
        "title": "Advanced Deep Reinforcement Learning Strategies for Enhanced Autonomous Vehicle Navigation Systems",
        "authors": "M Dhinakaran, R.Thalapathi Rajasekaran, V. Balaji, V. Aarthi, S. Ambika",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486336"
    },
    {
        "id": 31048,
        "title": "UAM Autonomous Guidance Control Command Generation Through Deep-learning-based Aircraft Marshalling Recognition",
        "authors": "Jeonghun Lee, Sungwook Cho, Yeondeuk Jeong",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5302/j.icros.2024.23.0193"
    },
    {
        "id": 31049,
        "title": "Stable posture tracking for modular spatial hyper-redundant serial arms using selective control points",
        "authors": "Aime Charles Alfred Dione, Shoichi Hasegawa",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2291715"
    },
    {
        "id": 31050,
        "title": "A Survey of Machine Learning Approaches for Mobile Robot Control",
        "authors": "Monika Rybczak, Natalia Popowniak, Agnieszka Lazarowska",
        "published": "2024-1-9",
        "citations": 1,
        "abstract": "Machine learning (ML) is a branch of artificial intelligence that has been developing at a dynamic pace in recent years. ML is also linked with Big Data, which are huge datasets that need special tools and approaches to process them. ML algorithms make use of data to learn how to perform specific tasks or make appropriate decisions. This paper presents a comprehensive survey of recent ML approaches that have been applied to the task of mobile robot control, and they are divided into the following: supervised learning, unsupervised learning, and reinforcement learning. The distinction of ML methods applied to wheeled mobile robots and to walking robots is also presented in the paper. The strengths and weaknesses of the compared methods are formulated, and future prospects are proposed. The results of the carried out literature review enable one to state the ML methods that have been applied to different tasks, such as the following: position estimation, environment mapping, SLAM, terrain classification, obstacle avoidance, path following, learning to walk, and multirobot coordination. The survey allowed us to associate the most commonly used ML algorithms with mobile robotic tasks. There still exist many open questions and challenges such as the following: complex ML algorithms and limited computational resources on board a mobile robot; decision making and motion control in real time; the adaptability of the algorithms to changing environments; the acquisition of large volumes of valuable data; and the assurance of safety and reliability of a robot’s operation. The development of ML algorithms for nature-inspired walking robots also seems to be a challenging research issue as there exists a very limited amount of such solutions in the recent literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics13010012"
    },
    {
        "id": 31051,
        "title": "Artificial Intelligence Based Deep Bayesian Neural Network (DBNN) Toward Personalized Treatment of Leukemia with Stem Cells",
        "authors": "Asma Khazaal Abdulsahib",
        "published": "2023-1-1",
        "citations": 2,
        "abstract": "The dynamic development of computer and software technology in recent years was accompanied by the expansion and widespread implementation of artificial intelligence (AI) based methods in many aspects of human life. A prominent field where rapid progress was observed are high‐throughput methods in biology that generate big amounts of data that need to be processed and analyzed. Therefore, AI methods are more and more applied in the biomedical field, among others for RNA‐protein binding sites prediction, DNA sequence function prediction, protein‐protein interaction prediction, or biomedical image classification. Stem cells are widely used in biomedical research, e.g., leukemia or other disease studies. Our proposed approach of Deep Bayesian Neural Network (DBNN) for the personalized treatment of leukemia cancer has shown a significant tested accuracy for the model. DBNNs used in this study was able to classify images with accuracy exceeding 98.73%. This study depicts that the DBNN can classify cell cultures only based on unstained light microscope images which allow their further use. Therefore, building a bayesian‐based model to great help during commercial cell culturing, and possibly a first step in the process of creating an automated/semiautomated neural network‐based model for classification of good and bad quality cultures when images of such will be available.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v3i6.16200"
    },
    {
        "id": 31052,
        "title": "Graph-based meta-learning for context-aware sensor management in nonlinear safety-critical environments",
        "authors": "Christopher Aaron O'Hara, Takehisa Yairi",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2024.2327083"
    },
    {
        "id": 31053,
        "title": "Message from General Chairs",
        "authors": "",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00005"
    },
    {
        "id": 31054,
        "title": "Path tracking control of a snake robot with a passive joint",
        "authors": "Kazunori Sakakibara, Ryo Ariizumi, Toru Asai, Shun-ichi Azuma",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2022.2163186"
    },
    {
        "id": 31055,
        "title": "Deep Adaptive Nonlinear H<sub>∞</sub> Control for Wheeled Mobile Robots",
        "authors": "Jose Ceron Neto, Roberto Santos Inoue",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10333000"
    },
    {
        "id": 31056,
        "title": "Deep Learning-based Sequence Modeling for Advanced Process Control in Semiconductor Manufacturing",
        "authors": "Filippo Dalla Zuanna, Natalie Gentner, Gian Antonio Susto",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.10.058"
    },
    {
        "id": 31057,
        "title": "Special issue on control technology for networked and distributed robotics (Part II)",
        "authors": "Masaaki Nagahara, Kai Cai, Debasish Chatterjee, Nikhil Chopra, Takeshi Hatanaka, Yutaka Hori, Hideaki Ishii, Daniel E. Quevedo, Michel Reniers",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2168316"
    },
    {
        "id": 31058,
        "title": "Deep Learning-Based Real-Time Hand Landmark Recognition with MediaPipe for R12 Robot Control",
        "authors": "Mohamed Bensaadallah, Noureddine Ghoggali, Lamir Saidi, Walid Ghoggali",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceeat60471.2023.10426264"
    },
    {
        "id": 31059,
        "title": "Research on Used Car Valuation Model Based on SVM Fusion Learning",
        "authors": "Wu Xuping, Ma Haohao, Feng Yanwei, Ma Lisha, Han Weiliang, Cong Miaomiao",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/arace60380.2023.00029"
    },
    {
        "id": 31060,
        "title": "DeepQRE: A QRE System Based on Deep Learning",
        "authors": "Shun Zhang, Quansheng Dou",
        "published": "2023-2-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmre56789.2023.10106580"
    },
    {
        "id": 31061,
        "title": "Special issue on control technology for networked and distributed robotics",
        "authors": "Masaaki Nagahara, Kai Cai, Debasish Chatterjee, Nikhil Chopra, Takeshi Hatanaka, Yutaka Hori, Hideaki Ishii, Daniel E. Quevedo, Michel Reniers",
        "published": "2023-1-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2022.2156058"
    },
    {
        "id": 31062,
        "title": "Research on Methods of Expressway Vehicle Detection under Abnormal Weather Conditions Based on Deep Learning",
        "authors": "Rong Cao, Xiaogang Ma, Xuehui Chen, Xinyi Ma, Liru Hua, Chihang Zhao, Teng Ma, Xinliang Wang",
        "published": "2023-1-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icrca57894.2023.10087528"
    },
    {
        "id": 31063,
        "title": "Addressing Challenges in Dynamic Modeling of Stewart Platform using Reinforcement Learning-Based Control Approach",
        "authors": "Hadi Yadavari, Vahid Tavakol Aghaei, Serhat İkizoğlu",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "In this paper, we focus on enhancing the performance of the controller utilized in the Stewart platform by investigating the dynamics of the platform. Dynamic modeling is crucial for control and simulation, yet challenging for parallel robots like the Stewart platform due to closed-loop kinematics. We explore classical methods to solve its inverse dynamical model, but conventional approaches face difficulties, often resulting in simplified and inaccurate models. To overcome this limitation, we propose a novel approach by replacing the classical feedforward inverse dynamic block with a reinforcement learning (RL) agent, which, to our knowledge, has not been tried yet in the context of the Stewart platform control. Our proposed methodology utilizes a hybrid control topology that combines RL with existing classical control topologies and inverse kinematic modeling. We leverage three deep reinforcement learning (DRL) algorithms and two model-based RL algorithms to achieve improved control performance, highlighting the versatility of the proposed approach. By incorporating the learned feedforward control topology into the existing PID controller, we demonstrate enhancements in the overall control performance of the Stewart platform. Notably, our approach eliminates the need for explicit derivation and solving of the inverse dynamic model, overcoming the drawbacks associated with inaccurate and simplified models. Through several simulations and experiments, we validate the effectiveness of our reinforcement learning-based control approach for the dynamic modeling of the Stewart platform. The results highlight the potential of RL techniques in overcoming the challenges associated with dynamic modeling in parallel robot systems, promising improved control performance. This enhances accuracy and reduces the development time of control algorithms in real-world applications. Nonetheless, it requires a simulation step before practical implementations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20582"
    },
    {
        "id": 31064,
        "title": "Deep Learning-Based Classification of Neurodegenerative Diseases Using Gait Dataset: A Comparative Study",
        "authors": "Zeyang Zhou, Ayush Kanwal, Kunal Chaturvedi, Rehan Raza, Shiv Prakash, Tony Jan, Mukesh Prasad",
        "published": "2023-7-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3608143.3608154"
    },
    {
        "id": 31065,
        "title": "Evaluating Reliability and Economics of EV Charging Configurations and Deep Reinforcement Learning in Robotics and Autonomy",
        "authors": "Chandru Lin",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "Growing EV popularity drives companies to focus on reliable charging station designs despite challenges in maintaining reliability. A proposed 36-ported design combines uniform and non-uniform port arrangements, tested with 50-350 kW systems. Failure rates are estimated using MILHDBK217F and MILHBK-338B standards, assessing port reliability and station success rates through binomial distribution and cost analysis. This design improves voltage stability and reduces maintenance costs through enhanced port reliability. In robotics and autonomous systems, Deep Reinforcement Learning (DRL) excels but faces challenges from unsafe policies leading to hazardous decisions. This study introduces a reliability assessment framework for DRL-controlled systems, using formal neural network analysis. A two-level verification approach evaluates safety locally using reachability tools and globally by aggregating local safety metrics across tasks. Experimental validation confirms the framework's effectiveness in enhancing RAS safety.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/pqujel"
    },
    {
        "id": 31066,
        "title": "Load-side acceleration control based on load-side velocity disturbance observer for geared actuator",
        "authors": "Yusuke Kawai, Yuki Yokokura, Kiyoshi Ohishi, Taiga Shinozaki",
        "published": "2023-5-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2185812"
    },
    {
        "id": 31067,
        "title": "Real-Time Ocean Waves Three-Dimensional Reconstruction Research Based on Deep Learning",
        "authors": "Junjie Huang, Feng Xu, Tianbao Chen, Yang Zeng, Jihua Ming, Xiaoming Niu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/raiic59453.2023.10281074"
    },
    {
        "id": 31068,
        "title": "Near-optimal sliding mode control for multi-robot consensus under dynamic events",
        "authors": "Anuj Nandanwar, Narendra Kumar Dhar, Laxmidhar Behera, Rajesh Sinha",
        "published": "2023-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2022.2155489"
    },
    {
        "id": 31069,
        "title": "A lifting approach to learning-based self-triggered control with Gaussian processes",
        "authors": "Wang Zhijun, Kazumune Hashimoto, Wataru Hashimoto, Shigemasa Takai",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2023.2301430"
    },
    {
        "id": 31070,
        "title": "Controlling Tiltrotors Unmanned Aerial Vehicles (UAVs) with Deep Reinforcement Learning",
        "authors": "Aline Gabriel De Almeida, Esther Luna Colombini, Alexandre Da Silva Simões",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10333034"
    },
    {
        "id": 31071,
        "title": "Autonomous Navigation of Wheelchairs in Indoor Environments using Deep Reinforcement Learning and Computer Vision",
        "authors": "Paulo De Almeida Afonso, Paulo Roberto Ferreira",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10332918"
    },
    {
        "id": 31072,
        "title": "Dynamic Modeling and Locomotion Control of Reconfigurable Robot Smorphi",
        "authors": "Ashish Prakash, Gagan Deep Meena, Abdullah Aamir Hayat",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3610419.3610462"
    },
    {
        "id": 31073,
        "title": "Calibration for Kinematic Control of Differential-Drive Mobile Robots: A Machine Learning Approach",
        "authors": "Yu-Hsiang Zhuang, Cheng-Zong Yuan, Chang-Yi Lin, Veronika Peconkova, Min-Fan Ricky Lee",
        "published": "2023-8-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268540"
    },
    {
        "id": 31074,
        "title": "Retracted: Online Control Method of Small- and Medium-Sized Electromechanical Equipment Based on Deep Neural Network",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9827679"
    },
    {
        "id": 31075,
        "title": "Efficient learning of power grid voltage control strategies via model-based deep reinforcement learning",
        "authors": "Ramij Raja Hossain, Tianzhixi Yin, Yan Du, Renke Huang, Jie Tan, Wenhao Yu, Yuan Liu, Qiuhua Huang",
        "published": "2023-11-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06422-w"
    },
    {
        "id": 31076,
        "title": "Predictive exposure control for vision-based robotic disassembly using deep learning and predictive learning",
        "authors": "Wupeng Deng, Quan Liu, Duc Truong Pham, Jiwei Hu, Kin-Man Lam, Yongjing Wang, Zude Zhou",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rcim.2023.102619"
    },
    {
        "id": 31077,
        "title": "Application of Machine Learning in Healthcare and Medicine: A Review",
        "authors": "Furizal Furizal, Alfian Ma'arif, Dianda Rifaldi",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "This extensive literature review investigates the integration of Machine Learning (ML) into the healthcare sector, uncovering its potential, challenges, and strategic resolutions. The main objective is to comprehensively explore how ML is incorporated into medical practices, demonstrate its impact, and provide relevant solutions. The research motivation stems from the necessity to comprehend the convergence of ML and healthcare services, given its intricate implications. Through meticulous analysis of existing research, this method elucidates the broad spectrum of ML applications in disease prediction and personalized treatment. The research's precision lies in dissecting methodologies, scrutinizing studies, and extrapolating critical insights. The article establishes that ML has succeeded in various aspects of medical care. In certain studies, ML algorithms, especially Convolutional Neural Networks (CNNs), have achieved high accuracy in diagnosing diseases such as lung cancer, colorectal cancer, brain tumors, and breast tumors. Apart from CNNs, other algorithms like SVM, RF, k-NN, and DT have also proven effective. Evaluations based on accuracy and F1-score indicate satisfactory results, with some studies exceeding 90% accuracy. This principal finding underscores the impressive accuracy of ML algorithms in diagnosing diverse medical conditions. This outcome signifies the transformative potential of ML in reshaping conventional diagnostic techniques. Discussions revolve around challenges like data quality, security risks, potential misinterpretations, and obstacles in integrating ML into clinical realms. To mitigate these, multifaceted solutions are proposed, encompassing standardized data formats, robust encryption, model interpretation, clinician training, and stakeholder collaboration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v4i5.19640"
    },
    {
        "id": 31078,
        "title": "Using Learning Focal Point Algorithm to Classify Emotional Intelligence",
        "authors": "Abdelhak Sakhi, Salah-Eddine Mansour, Abderrahim Sekkaki",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Recognizing the fundamental role of learners' emotions in the educational process, this study aims to enhance educational experiences by incorporating emotional intelligence (EI) into teacher robots through artificial intelligence and image processing technologies. The primary hurdle addressed is the inadequacy of conventional methods, particularly convolutional neural networks (CNNs) with pooling layers, in imbuing robots with emotional intelligence. To surmount this challenge, the research proposes an innovative solution—introducing a novel learning focal point (LFP) layer to replace pooling layers, resulting in significant enhancements in accuracy and other vital parameters. The distinctive contribution of this research lies in the creation and application of the LFP algorithm, providing a novel approach to emotion classification for teacher robots. The results showcase the LFP algorithm's superior performance compared to traditional CNN approaches. In conclusion, the study highlights the transformative impact of the LFP algorithm on the accuracy of classification models and, consequently, on emotionally intelligent teacher robots. This research contributes valuable insights to the convergence of artificial intelligence and education, with implications for future advancements in the field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20895"
    },
    {
        "id": 31079,
        "title": "Deep learning approaches for object recognition in plant diseases: a review",
        "authors": "Zimo Zhou, Yue Zhang, Zhaohui Gu, Simon X. Yang",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Plant diseases pose a significant threat to the economic viability of agriculture and the normal functioning of trees in forests. Accurate detection and identification of plant diseases are crucial for smart agricultural and forestry management. In recent years, the intersection of agriculture and artificial intelligence has become a popular research topic. Researchers have been experimenting with object recognition algorithms, specifically convolutional neural networks, to identify diseases in plant images. The goal is to reduce labor and improve detection efficiency. This article reviews the application of object detection methods for detecting common plant diseases, such as tomato, citrus, maize, and pine trees. It introduces various object detection models, ranging from basic to modern and sophisticated networks, and compares the innovative aspects and drawbacks of commonly used neural network models. Furthermore, the article discusses current challenges in plant disease detection and object detection methods and suggests promising directions for future work in learning-based plant disease detection systems. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.20517/ir.2023.29"
    },
    {
        "id": 31080,
        "title": "Adaptive Parallel Iterative Learning Control with A Time-Varying Sign Gain Approach Empowered by Expert System",
        "authors": "Phichitphon Chotikunnan, Rawiphon Chotikunnan, Panya Minyong",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "This study explores the incorporation of time-varying sign gain into a parallel iterative learning control (ILC) architecture, augmented by an expert system, to enhance the performance and stability of a robotic arm system. The methodology involves iteratively tuning the learning control gains using time-varying sign gain guided by an expert system. Stability analysis, encompassing asymptotic and monotonic convergence, demonstrates promising results across multiple joints, affirming the effectiveness of the proposed control architecture. In comparison with traditional PID control, fixed gain ILC, and ILC with adaptive learning in the expert system, the analysis focuses on stability, precision, and adaptability, using root mean square error (RMSE) as a key metric. The results show that ILC with adaptive learning from the expert system consistently reduces RMSE, even in the presence of learning transients. This adaptability effectively controls the learning transients, ensuring improved performance in subsequent iterations. In conclusion, the integration of time-varying sign gain with expert system assistance in a parallel ILC architecture holds promise for advancing adaptive control in robotic systems. Positive outcomes in stability, precision, and adaptability suggest practical applications in real-world scenarios. This research provides valuable insights into the implementation of dynamic learning mechanisms for enhanced robotic system performance, laying the groundwork for future refinement in robotic manipulator control systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v5i1.20890"
    },
    {
        "id": 31081,
        "title": "DreamWaQ: Learning Robust Quadrupedal Locomotion With Implicit Terrain Imagination via Deep Reinforcement Learning",
        "authors": "I Made Aswin Nahrendra, Byeongho Yu, Hyun Myung",
        "published": "2023-5-29",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10161144"
    },
    {
        "id": 31082,
        "title": "Recent Advances and Perspectives in Deep Learning Techniques for 3D Point Cloud Data Processing",
        "authors": "Zifeng Ding, Yuxuan Sun, Sijin Xu, Yan Pan, Yanhong Peng, Zebing Mao",
        "published": "2023-7-11",
        "citations": 2,
        "abstract": "In recent years, deep learning techniques for processing 3D point cloud data have seen significant advancements, given their unique ability to extract relevant features and handle unstructured data. These techniques find wide-ranging applications in fields like robotics, autonomous vehicles, and various other computer-vision applications. This paper reviews the recent literature on key tasks, including 3D object classification, tracking, pose estimation, segmentation, and point cloud completion. The review discusses the historical development of these methods, explores different model architectures, learning algorithms, and training datasets, and provides a comprehensive summary of the state-of-the-art in this domain. The paper presents a critical evaluation of the current limitations and challenges in the field, and identifies potential areas for future research. Furthermore, the emergence of transformative methodologies like PoinTr and SnowflakeNet is examined, highlighting their contributions and potential impact on the field. The potential cross-disciplinary applications of these techniques are also discussed, underscoring the broad scope and impact of these developments. This review fills a knowledge gap by offering a focused and comprehensive synthesis of recent research on deep learning techniques for 3D point cloud data processing, thereby serving as a useful resource for both novice and experienced researchers in the field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/robotics12040100"
    },
    {
        "id": 31083,
        "title": "Impact of modified Harris hawks optimization on hybrid deep learning for untrained plant leaf classification",
        "authors": "Bhanuprakash Dudi, V. Rajesh",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "AbstractPlants are extensively dispersed in nature, and they are essential for the survival and growth of the entire living creatures on the planet. Leaf classification and identification are critical in botany for recognizing new or endangered tree species. Leaf classification must be done quickly and accurately to sustain agricultural products. Traditional methods used manual classification of plant species. However, this method is costly, time‐consuming, and in some circumstances, impracticable. In the domains of image classification, target identification, and other fields, the new generation of Convolutional Neural Networks (CNNs) has shown outstanding outcomes. However, there exist some practical difficulties in executing these artificial neural networks. Owing to its high complexity and colossal running time, and also insufficient efficiency, the performance of classification is affected. An inappropriate count of neurons at each hidden layer may lead to an overfitting or underfitting problem. Thus, the core concept of this task is concerned with a novel technique for the growth of plant leaf classification for untrained data by hybridized classifiers. The core concept of this task is to find untrained data. The leaf images are collected from online sources. The images are further fed to the preprocessing phase. Pattern extraction is done on the preprocessed image using Weighted Weber Local Pattern. This preprocessed image is used for the classification of untrained data using hybridized deep‐structured architectures. Here, the combination of CNN with Recurrent Neural Network (RNN) and CNN with Support Vector Machine (SVM) is utilized for classification. Averaging the classification score of both hybrid techniques with parameter and threshold being optimized by the Best Searchable Modified Harris Hawks Optimization (BM‐HHO) produces the best classification outcome for untrained data. Here, the corresponding leaf type is classified if the input is given as the trained leaf images. Simultaneously, if the other types of data, like, palm tree leaf images, are given as input, and then explicitly shows the output as another type of leaves (or) untrained data. The experimental outcomes on the benchmark data set containing leaf images reveal that the introduced method achieved a higher accuracy than the conventional techniques. The accuracy of BM‐HHO‐CRNN + CSVM at the 65th learning rate is 3.43%, 0.84%, 1.80%, and 1.05% superior to HHO‐CRNN + CSVM, SS‐WOA‐CRNN + CSVM, WOA‐CRNN + CSVM, and SSO‐CRNN + CSVM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/rob.22306"
    },
    {
        "id": 31084,
        "title": "Deep Reinforcement Learning Integrated RRT Algorithm for Path Planning",
        "authors": "Huashan Liu, Yuqing Gu, Xiangjian Li, Xinjie Xiao",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wrcsara60131.2023.10261849"
    },
    {
        "id": 31085,
        "title": "Rapid trajectory planning method for hypersonic penetration based on sequential convex optimization and deep learning",
        "authors": "dong guo, xi li, jianyou huang, lei zhang, aojia ma, feng gao, zhipeng shen",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011469"
    },
    {
        "id": 31086,
        "title": "Motion Consistency Loss for Monocular Visual Odometry with Attention-Based Deep Learning",
        "authors": "André O. Françani, Marcos R. O. A. Maximo",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10332921"
    },
    {
        "id": 31087,
        "title": "Developing machine learning control of a non-axisymmetric x-wing flapping drone",
        "authors": "Edwin M. Lau, Gouda Chun-Cheng Peng, Wei-Cheng Chang, Jian-Ming Lin",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aris59192.2023.10268551"
    },
    {
        "id": 31088,
        "title": "On reward distribution in reinforcement learning of multi-agent surveillance systems with temporal logic specifications",
        "authors": "Keita Terashima, Koichi Kobayashi, Yuh Yamashita",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2024.2309634"
    },
    {
        "id": 31089,
        "title": "Advanced Deep Learning Techniques for Industry 4.0: Application to Mechanical Design and Structural Health Monitoring",
        "authors": "Fakhreddine Ababsa",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012364300003636"
    },
    {
        "id": 31090,
        "title": "Real-Time Neural MPC: Deep Learning Model Predictive Control for Quadrotors and Agile Robotic Platforms",
        "authors": "Tim Salzmann, Elia Kaufmann, Jon Arrizabalaga, Marco Pavone, Davide Scaramuzza, Markus Ryll",
        "published": "2023-4",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lra.2023.3246839"
    },
    {
        "id": 31091,
        "title": "Constrained footstep planning using model-based reinforcement learning in virtual constraint-based walking",
        "authors": "Takanori Jin, Taisuke Kobayashi, Takamitsu Matsubara",
        "published": "2024-4-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01691864.2024.2336253"
    },
    {
        "id": 31092,
        "title": "On Selecting Optimal Hyperparameters for Reinforcement Learning Based Robotics Applications: A Practical Approach",
        "authors": "Ignacio Fidalgo, Guillermo Villate, Alberto Tellaeche, Juan Vázquez",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012158200003543"
    },
    {
        "id": 31093,
        "title": "Advanced detection of cardiac arrhythmias using a three-stage CBD filter and a multi-scale approach in a combined deep learning model",
        "authors": "Zakaria Khatar, Dounia Bentaleb, Omar Bouattane",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2023.105551"
    },
    {
        "id": 31094,
        "title": "Design of control system of needle spinneret and collector control for nanofiber morphology in electrospinning",
        "authors": "Iim Fatimah, Diky Anggoro, Lutfi F. Ningsih",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0115237"
    },
    {
        "id": 31095,
        "title": "Plant Leaf Disease Detection Using Efficient Image Processing and Machine Learning Algorithms",
        "authors": "S M Kiran, D N Chandrappa",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "India is often described as a country of villages, where a majority of the population depends on agriculture for their livelihood. The landscape of Indian agriculture is approximately 159.7 million hectares. Agriculture plays a pivotal role in India's Gross Domestic Product (GDP), accounting for about 18% of the nation's economic output. Diseases and pests can have detrimental effects on crops, leading to reduced yields. These challenges can include the spread of plant diseases, infestations by insects or other pests, and the overall degradation of crop health. Early detection of diseases in crops is crucial for several reasons. Detecting diseases at an early stage allows for prompt intervention, such as applying appropriate pesticides or taking preventive measures. The main aim of this study is to develop a highly effective method for plant leaf disease detection using computer vision techniques. Here, leaf disease detection comprises histogram equalization, denoising, image color threshold masking, feature descriptors such as Haralick textures, Hu moments, and color histograms to extract the salient features of leaf images. These features are then used to classify the images by training Logistic Regression, Linear Discriminant Analysis, K-nearest neighbor, decision tree, Random Forest, and Support Vector Machine algorithms using K-fold validation. K-fold validation is used to separate the validation samples from the training samples, and the K indicates the number of times this is repeated for the generalization. The training and validation processes are performed in two approaches. The first approach uses default hyperparameters with segmented and non-segmented images. In the second approach, all hyperparameters of the models are optimized to train segmented datasets. The classification accuracy improved by 2.19% by utilizing segmentation and hyperparameter tuning further improved by 0.48%. The highest average classification accuracy of 97.92% is achieved using the Random Forest classifier to classify 40 classes of 10 different plant species. Accurate detection of plant disease leads to the sustained growth of plants throughout the growing span of the plants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18196/jrc.v4i6.20342"
    },
    {
        "id": 31096,
        "title": "Optimization of a Deep Reinforcement Learning Policy for Construction Manufacturing Control",
        "authors": "Ian Flood, Xiaoyan Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012091400003546"
    },
    {
        "id": 31097,
        "title": "Learning-Based Temporal Logic Control for Continuous POMDPs",
        "authors": "Keyi Zhang, Zhen Kan",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489669"
    },
    {
        "id": 31098,
        "title": "Enhancing The Accuracy of Image Classification Using Deep Learning and Preprocessing Methods",
        "authors": "Mohammed J Yousif",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "Deep learning is one of many methods in Artificial Intelligence (AI) that computers can use to process information like text, images, and audio. This manuscript will be focusing on image preprocessing, one of the many different techniques that are used to modify the neural network model training process, and how it affects the training speed and accuracy of the neural network. Six different image preprocessing techniques were picked for use in this study: Grayscale, Smoothing, Unmask Sharpening, Laplacian and Equalization, and Random Cropping and Rotation all of which were implemented using Python and the libraries NumPy, OpenCV, and PyTorch. For the dataset, a batch of 10000 images from the CIFAR10 dataset were used to train the model. This study explored the impact of preprocessing techniques on a deep learning model, employing the RESNET50 architecture. Notable improvements in model accuracy were observed, particularly with normalization and random cropping accompanied by rotation. The efficiency gains attributed to preprocessing were highlighted, leading to a more rapid training process and significant resource savings. This research underscores the importance of thoughtful preprocessing in enhancing the performance of deep learning models, offering valuable insights for practitioners in imageclassification tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52098/airdj.2023348"
    },
    {
        "id": 31099,
        "title": "Advanced Machine Learning and Deep Learning Approaches for Remote Sensing",
        "authors": "Gwanggil Jeon",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Unlike field observation or field sensing, remote sensing is the process of obtaining information about an object or phenomenon without making physical contact [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15112876"
    },
    {
        "id": 31100,
        "title": "Deep learning‐based crop row detection for infield navigation of agri‐robots",
        "authors": "Rajitha de Silva, Grzegorz Cielniak, Gang Wang, Junfeng Gao",
        "published": "2023-8-7",
        "citations": 3,
        "abstract": "AbstractAutonomous navigation in agricultural environments is challenged by varying field conditions that arise in arable fields. State‐of‐the‐art solutions for autonomous navigation in such environments require expensive hardware, such as Real‐Time Kinematic Global Navigation Satellite System. This paper presents a robust crop row detection algorithm that withstands such field variations using inexpensive cameras. Existing data sets for crop row detection do not represent all the possible field variations. A data set of sugar beet images was created representing 11 field variations comprised of multiple grow stages, light levels, varying weed densities, curved crop rows, and discontinuous crop rows. The proposed pipeline segments the crop rows using a deep learning‐based method and employs the predicted segmentation mask for extraction of the central crop using a novel central crop row selection algorithm. The novel crop row detection algorithm was tested for crop row detection performance and the capability of visual servoing along a crop row. The visual servoing‐based navigation was tested on a realistic simulation scenario with the real ground and plant textures. Our algorithm demonstrated robust vision‐based crop row detection in challenging field conditions outperforming the baseline.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/rob.22238"
    },
    {
        "id": 31101,
        "title": "Expert-guided Triple-memory Deep Reinforcement Learning for Robotic Motion Planning",
        "authors": "Huashan Liu, Guojing Zhang, Xiangjian Li, Xinjie Xiao",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wrcsara60131.2023.10261862"
    },
    {
        "id": 31102,
        "title": "Embroidery Robotics: An Innovative Approach to AI-based Online Learning and Image Generation",
        "authors": "Ling Chen, Tianxin Zhang, Jing Chen",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wrcsara60131.2023.10261779"
    },
    {
        "id": 31103,
        "title": "SLAYO-RL: A Target-Driven Deep Reinforcement Learning Approach with SLAM and YoLo for an Enhanced Autonomous Agent",
        "authors": "José Montes, Troy Costa Kohwalter, Esteban Clua",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lars/sbr/wre59448.2023.10332988"
    },
    {
        "id": 31104,
        "title": "DTC: Deep Tracking Control",
        "authors": "Fabian Jenelten, Junzhe He, Farbod Farshidian, Marco Hutter",
        "published": "2024-1-17",
        "citations": 1,
        "abstract": "Legged locomotion is a complex control problem that requires both accuracy and robustness to cope with real-world challenges. Legged systems have traditionally been controlled using trajectory optimization with inverse dynamics. Such hierarchical model-based methods are appealing because of intuitive cost function tuning, accurate planning, generalization, and, most importantly, the insightful understanding gained from more than one decade of extensive research. However, model mismatch and violation of assumptions are common sources of faulty operation. Simulation-based reinforcement learning, on the other hand, results in locomotion policies with unprecedented robustness and recovery skills. Yet, all learning algorithms struggle with sparse rewards emerging from environments where valid footholds are rare, such as gaps or stepping stones. In this work, we propose a hybrid control architecture that combines the advantages of both worlds to simultaneously achieve greater robustness, foot-placement accuracy, and terrain generalization. Our approach uses a model-based planner to roll out a reference motion during training. A deep neural network policy is trained in simulation, aiming to track the optimized footholds. We evaluated the accuracy of our locomotion pipeline on sparse terrains, where pure data-driven methods are prone to fail. Furthermore, we demonstrate superior robustness in the presence of slippery or deformable ground when compared with model-based counterparts. Last, we show that our proposed tracking controller generalizes across different trajectory optimization methods not seen during training. In conclusion, our work unites the predictive capabilities and optimality guarantees of online planning with the inherent robustness attributed to offline learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1126/scirobotics.adh5401"
    }
]