[
    {
        "id": 22471,
        "title": "Evaluation of Supervised Learning Models for Automatic Spam Email Detection",
        "authors": "Tsehay Admassu Assegie",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper compares the performance of different supervised learning algorithms for email spam detection. The comparison considered performance measures such as the area under the curve (AUC), F-score, precision, and confusion matrix. The paper evaluated the performance of eight supervised learning algorithms for email spam detection. The first stage collected the dataset of emails from the Kaggle repository. The second stage involves pre-processing, duplicate removal, and the dataset features scaling. After the pre-processing stage, the study employed a synthetic minority technique for balancing samples representing the spam and no spam emails in the dataset. In the final stage, the supervised learning algorithms are trained on the pre-processed dataset and then the test result is analyzed. The comparison shows the random forest (RF) model performing at higher accuracy than the other models. The RG model achieved 96.6% accuracy in email spam detection. Thus, the result demonstrates that different models tend to perform differently in email spam detection.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3191190/v1"
    },
    {
        "id": 22472,
        "title": "Performance Evaluation of User-Behaviour Techniques of Web Spam Detection Models",
        "authors": "",
        "published": "2019-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7176/ncs/10-07"
    },
    {
        "id": 22473,
        "title": "Bayesian Spam Detection System Using Hybrid Feature Selection Method",
        "authors": "JUNYING CHEN, SHUNFENG ZHOU, HUAQING MIN",
        "published": "2017-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12783/dtcse/icmsie2016/6357"
    },
    {
        "id": 22474,
        "title": "Bayesian Multiple Changepoint Detection for Stochastic Models in Continuous Time",
        "authors": "Lu Shaochuan",
        "published": "2021-6-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/20-ba1218"
    },
    {
        "id": 22475,
        "title": "Comparison of Three Machine Learning Models for the Detection of Emails Spam",
        "authors": "Shadi Ahmed Khattab, Raed Naser Alkaied, Mohammad Khaleel Sallam Ma'aitah",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nRecently, machine learning has been applied into different major areas such as text classification, machine translation, and spam detection. The great performance of machine learning algorithms into several fields provided the humans with opportunities to tackle some of their hard jobs to be handled by machine learning systems. These tasks seem effortless for machines, and need less time as the amount of texts or spams need to be classified is huge. Hence, in his paper, we propose three different models for the task of emails spam detection. The three models are trained and validated on a public spam dataset. Experimentally, the models performed differently and it was seen that the Naïve Bayes outperformed the other machine learning algorithms in terms of accuracy and other evaluation metrics.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1445507/v1"
    },
    {
        "id": 22476,
        "title": "Advances in spam detection for email spam, web spam, social network spam, and review spam: ML-based and nature-inspired-based techniques",
        "authors": "Andronicus A. Akinyelu",
        "published": "2021-8-25",
        "citations": 4,
        "abstract": "Despite the great advances in spam detection, spam remains a major problem that has affected the global economy enormously. Spam attacks are popularly perpetrated through different digital platforms with a large electronic audience, such as emails, microblogging websites (e.g. Twitter), social networks (e.g. Facebook), and review sites (e.g. Amazon). Different spam detection solutions have been proposed in the literature, however, Machine Learning (ML) based solutions are one of the most effective. Nevertheless, most ML algorithms have computational complexity problem, thus some studies introduced Nature Inspired (NI) algorithms to further improve the speed and generalization performance of ML algorithms. This study presents a survey of recent ML-based and NI-based spam detection techniques to empower the research community with information that is suitable for designing effective spam filtering systems for emails, social networks, microblogging, and review websites. The recent success and prevalence of deep learning show that it can be used to solve spam detection problems. Moreover, the availability of large-scale spam datasets makes deep learning and big data solutions (such as Mahout) very suitable for spam detection. Few studies explored deep learning algorithms and big data solutions for spam detection. Besides, most of the datasets used in the literature are either small or synthetically created. Therefore, future studies can consider exploring big data solutions, big datasets, and deep learning algorithms for building efficient spam detection techniques.",
        "link": "http://dx.doi.org/10.3233/jcs-210022"
    },
    {
        "id": 22477,
        "title": "Hyperparameter Optimization of Ensemble Models for Spam Email Detection",
        "authors": "Temidayo Oluwatosin Omotehinwa, David Opeoluwa Oyewola",
        "published": "2023-2-3",
        "citations": 8,
        "abstract": "Unsolicited emails, popularly referred to as spam, have remained one of the biggest threats to cybersecurity globally. More than half of the emails sent in 2021 were spam, resulting in huge financial losses. The tenacity and perpetual presence of the adversary, the spammer, has necessitated the need for improved efforts at filtering spam. This study, therefore, developed baseline models of random forest and extreme gradient boost (XGBoost) ensemble algorithms for the detection and classification of spam emails using the Enron1 dataset. The developed ensemble models were then optimized using the grid-search cross-validation technique to search the hyperparameter space for optimal hyperparameter values. The performance of the baseline (un-tuned) and the tuned models of both algorithms were evaluated and compared. The impact of hyperparameter tuning on both models was also examined. The findings of the experimental study revealed that the hyperparameter tuning improved the performance of both models when compared with the baseline models. The tuned RF and XGBoost models achieved an accuracy of 97.78% and 98.09%, a sensitivity of 98.44% and 98.84%, and an F1 score of 97.85% and 98.16%, respectively. The XGBoost model outperformed the random forest model. The developed XGBoost model is effective and efficient for spam email detection.",
        "link": "http://dx.doi.org/10.3390/app13031971"
    },
    {
        "id": 22478,
        "title": "Machine Learning Models for Email Spam Detection: A Review",
        "authors": "Deepak Yadav, Er. Bhupinder Kaur",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smarttechcon57526.2023.10391620"
    },
    {
        "id": 22479,
        "title": "Pervasive Online Spam Review Detection based on Ontology using Naive Bayesian",
        "authors": "Alok Katiyar, Rishi Kumar, Shri Kant, Y. D. S. Arya",
        "published": "2018-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacccn.2018.8748781"
    },
    {
        "id": 22480,
        "title": "Differential evolution detection models for SMS spam",
        "authors": "Sarab M. Hameed",
        "published": "2021-2-1",
        "citations": 2,
        "abstract": "With the growth of mobile phones, short message service (SMS) became an essential text communication service. However, the low cost and ease use of SMS led to an increase in SMS Spam. In this paper, the characteristics of SMS spam has studied and a set of features has introduced to get rid of SMS spam. In addition, the problem of SMS spam detection was addressed as a clustering analysis that requires a metaheuristic algorithm to find the clustering structures. Three differential evolution variants viz DE/rand/1, jDE/rand/1, jDE/best/1, are adopted for solving the SMS spam problem. Experimental results illustrate that the jDE/best/1 produces best results over other variants in terms of accuracy, false-positive rate and false-negative rate. Moreover, it surpasses the baseline methods.",
        "link": "http://dx.doi.org/10.11591/ijece.v11i1.pp596-601"
    },
    {
        "id": 22481,
        "title": "Adversarial Email Generation against Spam Detection Models through Feature Perturbation",
        "authors": "Qi Cheng, Anyi Xu, Xiangyang Li, Leah Ding",
        "published": "2022-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaa52185.2022.00019"
    },
    {
        "id": 22482,
        "title": "Extreme Learning machines and Support Vector Machines models for email spam detection",
        "authors": "Sunday Olusanya Olatunji",
        "published": "2017-4",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccece.2017.7946806"
    },
    {
        "id": 22483,
        "title": "Bayesian Generalized Linear Mixed Effects Models for Deception Detection Analyses",
        "authors": "Mircea Zloteanu, Matti Vuorre",
        "published": "No Date",
        "citations": 0,
        "abstract": "Historically, deception detection research has relied on factorial analyses of response accuracy to make inferences. But this practice overlooks important sources of variability resulting in potentially misleading estimates and may conflate response bias with participants’ underlying sensitivity to detect lies from truths. We offer an alternative approach using Bayesian Generalized Linear Mixed Models (BGLMMs) within a Signal Detection Theory (SDT) framework to address these limitations. Our approach incorporates individual differences from both judges and senders, which are a principal source of spurious findings in deception research. By avoiding data transformations and aggregations, this methodology outperforms traditional methods and provides more informative and reliable effect estimates. The proposed framework offers researchers a powerful tool for analyzing deception data and advances our understanding of veracity judgments. All code and data are openly available.",
        "link": "http://dx.doi.org/10.31234/osf.io/fdh5b"
    },
    {
        "id": 22484,
        "title": "PySpark-Powered ML Models for Accurate Spam Detection in Messages",
        "authors": "Balla Charishma Sulochana, Bhavya Sri Pragada, Kollepara Lokesh, Manju Venugopalan",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425231"
    },
    {
        "id": 22485,
        "title": "Advanced SMS Spam Detection using Deep Complex Models and Sine-Cosine Algorithm",
        "authors": "Sepehr Rezaei, Mohammadreza Shams, Mohsen Alambardar Meybodi",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ikt62039.2023.10433034"
    },
    {
        "id": 22486,
        "title": "Spam Detection using Reference Text: A Preliminary Study for Spam Ground Truth Generation",
        "authors": "Arunabha Tarafdar, Chayan Halder, Dinesh Dash",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nSpam detection is a large area of study that has been approached from many different angles. Spam has been a threat to the normal operation of the internet since the late 1990s and most recently. Today, spam is not just found in emails; it also affects several other platforms, including social media and chat web platforms. In recent years, there have been significant changes in both the variety and meaning of spam. We are throwing light on the topic of word spam in digital photographs distributed through an online chat platform in this paper. In this article, we’ll talk about spam texts as well as how to spot them.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3099460/v1"
    },
    {
        "id": 22487,
        "title": "Naive Bayesian Spam Filtering",
        "authors": "Yuhao Zhu",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "The spam filtering system is used to identify which emails in the received emails are completely meaningless to the recipient and perform operations such as interception and deletion. Nowadays, with the rapid development of the Internet, while e-mail provides convenience for people, spam also comes along with it, which brings many troubles to users. According to statistics, 80% of the emails in the world are spam, and e-spam is really annoying. Therefore, how to solve the problem of filtering emails has important practical significance. Spam filtering using Bayesian theory is a statistical technique applied to email filtering. It essentially uses Bayesian classification to discriminate the attributes of emails, including spam and non-spam. Bayesian-based spam filtering is a very effective technique that can modify the model to meet the needs of specific users and give a lower spam detection rate that is acceptable to users. In this experiment, we use Naive Bayes for experiments, and we use Unigram and bigram methods to preprocess the data, respectively. Finally, it is concluded that the data processing accuracy of unigram and bigram is greater than 0.75, and bigram performs better in four different evaluation indicators.",
        "link": "http://dx.doi.org/10.54097/hset.v38i.5734"
    },
    {
        "id": 22488,
        "title": "Filtering and Detection of Real-Time Spam Mail Based on a Bayesian Approach in University Networks",
        "authors": "Maksim Sharabov, Georgi Tsochev, Veska Gancheva, Antoniya Tasheva",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "With the advent of digital technologies as an integral part of today’s everyday life, the risk of information security breaches is increasing. Email spam, commonly known as junk email, continues to pose a significant challenge in the digital realm, inundating inboxes with unsolicited and often irrelevant messages. This relentless influx of spam not only disrupts user productivity but also raises security concerns, as it frequently serves as a vehicle for phishing attempts, malware distribution, and other cyber threats. The prevalence of spam is fueled by its low-cost dissemination and its ability to reach a wide audience, exploiting vulnerabilities in email systems. This paper marks the inception of an in-depth investigation into the viability and potential implementation of a robust spam filtering and prevention system tailored explicitly to university networks. With the escalating threat of email-based hacking attacks and the incessant deluge of spam, the need for a comprehensive and effective defense mechanism within academic institutions becomes increasingly imperative. In exploring potential solutions, this study delves into the applicability and efficacy of Bayesian filters, a class of probabilistic classifiers renowned for their aptitude in distinguishing between legitimate emails and spam messages. Bayesian filters utilize statistical algorithms to analyze email content, learning patterns and features to accurately categorize incoming emails.",
        "link": "http://dx.doi.org/10.3390/electronics13020374"
    },
    {
        "id": 22489,
        "title": "Spam and Non-Spam URL Detection using Machine Learning Approach",
        "authors": "Ritu Raj, Sandeep Singh Kang",
        "published": "2022-5-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet54531.2022.9825197"
    },
    {
        "id": 22490,
        "title": "Filtering Spam Messages Based on Improved Naive Bayesian Algorithm",
        "authors": "",
        "published": "2020-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.38007/ml.2020.010201"
    },
    {
        "id": 22491,
        "title": "Spam Tags Detection and Protection Using Tags' Relationship Based Anti-Spam Approach",
        "authors": "Urooj Mahatab, Fouzia Jabeen",
        "published": "2018-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/inmic.2018.8595581"
    },
    {
        "id": 22492,
        "title": "Enhancing Spam Detection on SMS performance using several Machine Learning Classification Models",
        "authors": "Tarandeep Singh, Tushar Anupam Kumar, Prashant Giridhar Shambharkar",
        "published": "2022-4-28",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoei53556.2022.9777157"
    },
    {
        "id": 22493,
        "title": "A Spam Transformer Model for SMS Spam Detection",
        "authors": "Xiaoxu Liu, Haoye Lu, Amiya Nayak",
        "published": "2021",
        "citations": 38,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2021.3081479"
    },
    {
        "id": 22494,
        "title": "Enhancing Security in SMS by Combining NLP Models Using Ensemble Learning for Spam Detection with Image Steganography Integration",
        "authors": "Aditya Kumar, C. Fancy",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212103"
    },
    {
        "id": 22495,
        "title": "Fake Email and Spam Detection: User Feedback with Naives Bayesian Approach",
        "authors": "Ayushi Gupta, Sushila Palwe, Devyani Keskar",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-0790-8_5"
    },
    {
        "id": 22496,
        "title": "Testing the Effectiveness of Signal Detection Theory Models: A Bayesian Workflow Approach",
        "authors": "Simon Busch Moreno, Etienne Benoit Roesch",
        "published": "No Date",
        "citations": 0,
        "abstract": "Signal detection theory (SDT) is an important tool for research in psychology and neuroscience. Estimating sensitivity (d’) and bias (c) of responses to stimuli is at the heart of a wide range of experimental domains. In the present work, we investigate a conventional Bayesian SDT model and incrementally build upon it to improve the model’s capacity to render precise estimates of sensitivity, bias, hit rate, false alarm rate, and correlation between sensitivity and bias. To test these models, we simulate responses from 100 participants to an oddball task with 25 targets and 75 foils. We simulate a high sensitivity group (d'≅2±0.5, c≅0.1±0.5), and a low accuracy group (d'≅1±0.5, c≅0.5±0.5). We test three variations of the model, one with fixed parameters, a second with varying parameters, and a third with multivariate varying parameters with Lewandowski-Kurowicka-Joe (LKJ) correlation priors. The models are assessed progressively via prior predictive checks, precision analysis, convergence checks, posterior assessment via similarity measures, posterior predictive checks, and model comparison. Results indicate that a basic/base model improves precision with increased sample size but does not improve accuracy of estimates. A model with adaptive priors (i.e. multilevel a.k.a. hierarchical) solves this problem, but cannot provide information about parameters’ correlations. A third model with LKJ priors performs similarly well and provides correlations. These outcomes exemplify the capacity of a gradual model design Bayesian approach to examine theoretical assumptions and provide more informative model outputs.",
        "link": "http://dx.doi.org/10.31234/osf.io/6an4w"
    },
    {
        "id": 22497,
        "title": "Destek Vektör Makineleri Kullanılarak Spam SMS Tespiti",
        "authors": "Adem TEKEREK",
        "published": "2019-9-1",
        "citations": 9,
        "abstract": "Short Message Service (SMS) is the most important communication tool in recent decades. With the increased popularity of mobile devices, the usage rate of SMS will increase more and more in years. SMS is a practical method used to reach individuals directly. But this practical and easy method can cause SMS to be misused. The advertising or promotional SMS of the companies are an examples of this misuse. In this study, a spam SMS detection technique is proposed using SVM. SMSSpamCollection dataset, which is contain 747 spam SMS and 4827 ham SMS, is used. 10 fold cross-validation technique is used to evaluate prediction of Spam SMS in the dataset. Therefore, proposed approach achieved 98.33 % true positive rate and 0,087 false positive rate for SVM classification algorithm.",
        "link": "http://dx.doi.org/10.2339/politeknik.429707"
    },
    {
        "id": 22498,
        "title": "Variable Generalization Evaluation of Supervised Learning Models for Detection of Spam Messages",
        "authors": "Muhammad Saad Shahbaz Khan, Muhammad Osama Akbar, Hassaan Malik, Ali Haider Khan, Zubair Akbar",
        "published": "2021-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icic53490.2021.9692957"
    },
    {
        "id": 22499,
        "title": "Spam Detection",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_101230"
    },
    {
        "id": 22500,
        "title": "Spam Detection",
        "authors": "",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100434"
    },
    {
        "id": 22501,
        "title": "Email spam detection: a comparison of svm and naive bayes using bayesian optimization and grid search parameters",
        "authors": "Dzaky Budiman, Zayyan Zayyan, Ainun Mardiana, Alfira Aulia Mahrani",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Spam emails are still a big problem, crowding out inboxes and annoying email users everywhere. SVM and Naive Bayes are frequently used algorithms that have demonstrated excellent performance in performing text classification, including spam detection. The purpose of this study is to evaluate the overall performance of SVM and Naive Bayes in the context of detecting spam emails using default parameters. This research utilizes Bayesian Optimization and Grid Search Parameters for both SVM and Naive Bayes models to help maximize the performance of the constructed models. This study uses a spam email dataset that has 2 sample groups, namely spam and ham. Of the three parameter selection methods that have been tested on the SVM Algorithm, Bayesian Optimization is a parameter tuning method that has the most satisfying results in accuracy, precision, recall, and f1 scores respectively with values of 98.5642%, 99.4048%, 89.",
        "link": "http://dx.doi.org/10.52465/josre.v2i1.260"
    },
    {
        "id": 22502,
        "title": "Web Spam Detection",
        "authors": "Marc Najork",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-8265-9_465"
    },
    {
        "id": 22503,
        "title": "Logistic regression and signal detection theory models",
        "authors": "Santiago Barreda, Noah Silbert",
        "published": "2023-4-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003285878-10"
    },
    {
        "id": 22504,
        "title": "Towards Automated Comprehensive Feature Engineering for Spam Detection",
        "authors": "Fred Kiwanuka, Ja’far Alqatawna, Anang Amin, Sujni Paul, Hossam Faris",
        "published": "2019",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007393004290437"
    },
    {
        "id": 22505,
        "title": "Bayesian Quickest Change Detection in a Single Population",
        "authors": "Alexander G. Tartakovsky",
        "published": "2019-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429155017-3"
    },
    {
        "id": 22506,
        "title": "A Spam Message Detection Model Based on Bayesian Classification",
        "authors": "Yitao Yang, Runqiu Hu, Chengyan Qiu, Guozi Sun, Huakang Li",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-59463-7_42"
    },
    {
        "id": 22507,
        "title": "Performance Evaluation of LSTM and RNN Models in the Detection of Email Spam Messages",
        "authors": "Elijah John-Africa, Victor T. Emmah",
        "published": "2022-11-26",
        "citations": 0,
        "abstract": "Email spam is an unwanted bulk message that is sent to a recipient’s email address without explicit consent from the recipient. This is usually considered a means of advertising and maximizing profit, especially with the increase in the usage of the internet for social networking, but can also be very frustrating and annoying to the recipients of these messages. Recent research has shown that about 14.7 billion spam messages are sent out every single day of which more than 45% of these messages are promotional sales content that the recipient did not specifically opt-in. This has gotten the attention of many researchers in the area of natural language processing. In this paper, we used the Long Short-Time Memory (LSTM) for classification tasks between spam and Ham messages. The performance of LSTM is compared with that of a Recurrent Neural Network( RNN) which can also be used for a classification task of this nature but suffers from short-time memory and tends to leave out important information from earlier time steps to later ones in terms of prediction. The evaluation of the result shows that LSTM achieved 97% accuracy with both Adams and RMSprop optimizers compared to RNN with an accuracy of 94% with RMSprop and 87% accuracy with Adams optimizer.",
        "link": "http://dx.doi.org/10.24018/compute.2022.2.6.80"
    },
    {
        "id": 22508,
        "title": "Enhanced Spam Detection Model Through Re-Training and RNN Models",
        "authors": "Sadam Manikantam, Doddamani John Vestly, Puri Santhosh, Basa Sindhu, Peddireddy Sriman Reddy, Shanmugasundaram Hariharan",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390287"
    },
    {
        "id": 22509,
        "title": "Spam Detection Using Machine Learning",
        "authors": "",
        "published": "2020-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7176/ceis/11-3-04"
    },
    {
        "id": 22510,
        "title": "Twitter Spam Accounts Detection Using Machine Learning Models",
        "authors": "Shikah J. Alsunaidi, Rawan Talal Alraddadi, Hamoud Aljamaan",
        "published": "2022-12-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cicn56167.2022.10008339"
    },
    {
        "id": 22511,
        "title": "Survey on Spam Review Detection Using Spam Filtering Algorithms",
        "authors": "Dand Shweta B.",
        "published": "2021-7-10",
        "citations": 0,
        "abstract": "Generally the people trust on product on the basis of that product reviews and rating. Reviews can affect an organization or profile of a brand. The corporation has to assess market reactions towards its goods. However, it is not straightforward to track and organize popular reviews. Many public views are hard to manually process in social media. A methodology is then required to categories positive or negative public assessments automatically. Online feedback will provide customers with an insight into the consistency, efficiency and advice of the product; this provides prospective buyers with a better understanding of the product. One such unrealized opportunity is the usability of web assessments from suppliers in order to fulfill client requirements by evaluating beneficial feedback. Good and negative reviews play a major role in assessing customer needs and in quicker collection of product input from consumers. Sentiment Analysis is a computer study that extracts contextual data from the text. In this study a vast number of online mobile telephone ratings are analyzed.  We classify the text as positive and negative, but we also included feelings of frustration, expectation, disgust, apprehension, happiness, regret, surprise and confidence for spam review detection. This delimited grouping of feedback helps to holistically assess the product, allowing buyers to decide better.",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.36333"
    },
    {
        "id": 22512,
        "title": "Harnessing the Nature of Spam in Scalable Online Social Spam Detection",
        "authors": "Hailu Xu, Boyuan Guan, Pinchao Liu, William Escudero, Liting Hu",
        "published": "2018-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata.2018.8621926"
    },
    {
        "id": 22513,
        "title": "Web Spam Detection",
        "authors": "Marc Najork",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7993-3_465-3"
    },
    {
        "id": 22514,
        "title": "Bayesian Models",
        "authors": "Mevin B. Hooten, Trevor J. Hefley",
        "published": "2019-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429243653-1"
    },
    {
        "id": 22515,
        "title": "A Hybrid Spam Detection Framework for Social Networks",
        "authors": "Oğuzhan ÇITLAK, Murat DÖRTERLER, İbrahim DOGRU",
        "published": "2023-7-5",
        "citations": 2,
        "abstract": "The widespread use of social networks has caused these platforms to become the target of malicious people. Although social networks have their own spam detection systems, these systems sometimes may not prevent spams in their social networks. Spam contents and messages threaten the security and performance of users of these networks. A spam account detection framework based on three components is proposed in this study. Short link analysis, machine learning and text analysis are the components used together in the proposed framework. First, a dataset was created for this purpose and the attributes of spam accounts were determined. Later, the hyperlinks in the messages in this dataset were analyzed through link analysis component. The machine learning component was modelled through attributes. Moreover, the messages of the social network users were analyzed through text analysis method. A web-based application of the proposed model was put into practice. As a result of the experimental studies carried out thanks to the framework, it was determined that the proposed framework showed a performance of 95.69 %. The success of this article was calculated according to the F-measure and precision evaluation metrics under the influence of sensitive content rate. It is aimed to detect spam accounts on social network and the spam detection policy of these networks is intended to support.",
        "link": "http://dx.doi.org/10.2339/politeknik.933785"
    },
    {
        "id": 22516,
        "title": "Detection and Prediction of Spam Emails Using Machine Learning Models",
        "authors": "Salma P. Z, Maya Mohan",
        "published": "2020-8-21",
        "citations": 1,
        "abstract": "One of today's important means of communication is email. The extensive use of email for communication has led to many problems. Spam emails being the most crucial among them. It is one the major issues in today's internet world. Spam emails contain mostly advertisements and offensive content, which are often sent without the recipient's request and are generally annoying, time consuming, and wasting space on the communication media's resources. It creates inconveniences and financial loss to the recipients. Hence, there is always the need to filter the spam emails and separate them from the legitimate emails. There are a lot of content-based machine learning techniques that have proven to be effective in detecting and filtering spam emails. Due to a large increase in email spamming, the emails are studied and classified as spam or not spam. In this chapter, three machine learning models, Recurrent Neural Network (RNN), Long Short-Term Memory (LSTM), and Bidirectional LSTM (BLSTM), are used classify the emails as spam and benign. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-5728-0.ch011"
    },
    {
        "id": 22517,
        "title": "Application of Bayesian e-mail filtering to detect spam",
        "authors": "M. V. Volkov,  ",
        "published": "2022",
        "citations": 1,
        "abstract": "A study of the impact of spam messages and modern threats on the process of e-mail exchange in the corporate information system was conducted. The role of spam and its influence in corporate information systems has been studied. Peculiarities of countermeasures and technologies for e-mail protection against spam have been studied. On the basis of the research carried out in the work, a Bayesian classifier was developed for filtering e-mails of postal exchange in the corporate information system.",
        "link": "http://dx.doi.org/10.31673/2409-7292.2022.034854"
    },
    {
        "id": 22518,
        "title": "Bayesian Spam Filter for Wolaytta",
        "authors": "Tewodros Abebe",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22161/ijaers.612.64"
    },
    {
        "id": 22519,
        "title": "LBP Özellik Çıkarma ve İstatistiksel Havuzlama Tabanlı Görüntü Spam Tespit Modeli",
        "authors": "Aytaç KAŞOĞLU, Orhan YAMAN",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Email, which stands for electronic mail, is a form of digital communication between two or more individuals. These technological instruments that facilitate communication can have a positive and negative impact on our lives due to junk e-mails, widely known as spam mail. These spam messages, which are typically delivered for commercial purposes by organizations/individuals for indirect or direct benefits, not only distract people but also consume a significant amount of system resources such as processing power, memory, and network bandwidth. In this study, a method based on LBP (Local Binary Patterns) feature extraction and statistical pooling is proposed to classify spam or raw (non-spam) images. Two datasets are used to test the proposed method. The ISH dataset is widely used in the literature and contains 1738 images. In addition to this dataset, the dataset our collect consists of 1015 images in total. Feature extraction was performed on these images. Obtained features were classified by SVM (Support Vector Machine) algorithm. In the proposed method, 98.56% and 79.01% accuracy were calculated for the ISH dataset and our collected dataset, respectively. The results obtained were compared with the studies in the literature.",
        "link": "http://dx.doi.org/10.53070/bbd.1268221"
    },
    {
        "id": 22520,
        "title": "Linear Statistical Models and Bayesian Inference",
        "authors": "Lyle D. Broemeling",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315138145-2"
    },
    {
        "id": 22521,
        "title": "Spam detection system: a new approach based on interval type-2 fuzzy sets",
        "authors": "Reza Ariaeinejad",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Today, most Internet users use email to communicate electronically. They depend on the Internet to deliver their important emails safely and to the right recipients. However, the fast growth of Internet users and their use of email together with the exponential increase of unsolicited users sending spam have made the email system less reliable. An email can falsely be markedly a spam filter on its way to the recipient  or even get buried among junk mailing the recipient’s inbox. There are several intelligent anti-spam filters which use different artificial intelligence methods to detect spam including neural networks and fuzzy logic systems. This paper presents an interval based type-2 fuzzy spam detection system. Our results show that interval type-2 fuzzy set is an effective technique for spam detection and email classification. The proposed system enables the user to have more control over the various categories of spam and allows for filter personalization.</p>",
        "link": "http://dx.doi.org/10.32920/ryerson.14652015.v1"
    },
    {
        "id": 22522,
        "title": "DETECTION OF SPAM REVIEWS IN WEBSITES USING NET SPAM ALGORITHM",
        "authors": "D Sowmya,  ",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Now-a-days, people in general choose to purchase an online item depending on the reviews and feedback given in social media. The probability of leaving a scrutiny gives a glorious chance for person who writing a spam reviews regarding the product for individual reasons. Categorizing these kinds of spammers and the spam content create an interesting issue of analysis. Though a generous range of studies are done recently towards this, till date the methodologies used still hardly find the spam reviews. Here, propose an exclusive framework called Net-Spam that exploit spam options for creating review datasets as heterogeneous data networks to map spam detection procedure into further classifications. Maltreatment of spam options helps us to get the best output pertaining to various metrics experimented on realtime review datasets from Amazon and Yelp websites. The results show that Net-Spam outperforms the current ways from among the three classes of features namely detection of review, detection of user and detection of Spam Groupers.",
        "link": "http://dx.doi.org/10.33564/ijeast.2023.v07i11.008"
    },
    {
        "id": 22523,
        "title": "Hybrid ensemble and soft computing approaches for review spam detection on different spam datasets",
        "authors": "Irtiqa Amin, Mithilesh Kumar Dubey",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.matpr.2022.03.342"
    },
    {
        "id": 22524,
        "title": "Bayesian Multilevel Models",
        "authors": "Peter D. Congdon",
        "published": "2019-9-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429113352-8"
    },
    {
        "id": 22525,
        "title": "Spam detection system: a new approach based on interval type-2 fuzzy sets",
        "authors": "Reza Ariaeinejad",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Today, most Internet users use email to communicate electronically. They depend on the Internet to deliver their important emails safely and to the right recipients. However, the fast growth of Internet users and their use of email together with the exponential increase of unsolicited users sending spam have made the email system less reliable. An email can falsely be markedly a spam filter on its way to the recipient  or even get buried among junk mailing the recipient’s inbox. There are several intelligent anti-spam filters which use different artificial intelligence methods to detect spam including neural networks and fuzzy logic systems. This paper presents an interval based type-2 fuzzy spam detection system. Our results show that interval type-2 fuzzy set is an effective technique for spam detection and email classification. The proposed system enables the user to have more control over the various categories of spam and allows for filter personalization.</p>",
        "link": "http://dx.doi.org/10.32920/ryerson.14652015"
    },
    {
        "id": 22526,
        "title": "Email Spam Detection Using Hierarchical Attention Hybrid Deep Learning Method",
        "authors": "Sultan Zavrak, Seyhmus YILMAZ",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nEmail is one of the most widespread ways of communication utilized on a regular basis by millions of people around the world, businesses, and individuals more and more dependent upon emails to communicate and share knowledge and information. Nevertheless, the rise in email users has occurred a dramatic increase in spam emails in recent years. Processing and managing emails properly for individuals and companies are getting increasingly difficult. This article proposes a novel technique for email spam detection that is based on a combination of convolutional neural networks, gated recurrent units, and attention mechanisms. During system training, the network is selectively focused on necessary parts of the email text. The usage of convolution layers to extract more meaningful, abstract, and generalizable features by hierarchical representation is the major contribution of this study. Additionally, this contribution incorporates cross-dataset evaluation, which enables the generation of more independent performance results from the model's training dataset. According to cross-dataset evaluation results, the proposed technique advances the results of the present attention-based techniques by utilizing temporal convolutions, which give us more flexible receptive field sizes are utilized. The suggested technique's findings are compared to those of state-of-the-art models and show that our approach outperforms them.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1393162/v1"
    },
    {
        "id": 22527,
        "title": "Spam Email Detection on Data Mining: A Review",
        "authors": "",
        "published": "2019-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7176/jiea/9-2-01"
    },
    {
        "id": 22528,
        "title": "Bayesian Design of Experiments for Intractable Likelihood Models Using Coupled Auxiliary Models and Multivariate Emulation",
        "authors": "Antony Overstall, James McGree",
        "published": "2020-3-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/19-ba1144"
    },
    {
        "id": 22529,
        "title": "Machine learning algorithms-based spam detection in social networks",
        "authors": "M. Sumathi, S. P. Raja",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nMany social media platforms have emerged as a result of the online social network's (OSN) rapid expansion. They have become important in day-to-day life, and spammers have turned their attention to them. Spam detection is done in two different ways, such as machine learning (ML) and expert-based detection. The expert-based detection technique’s accuracy depends on expert knowledge, and the manual process is a time consuming task. Thus, ML-based spam detection is preferred in OSN. Spam identification on social networks is a difficult operation involving a variety of factors, and spam and ham have resulted in an imbalanced data distribution, which gives an advantage to spammers for corrupting our devices. Spam detection based on ML algorithms like Logistic Regression (LR), K-Nearest Neighbor (KNN), Decision Trees (DT), Random Forest (RF), Support Vector Machine (SVM), and XGB, Voting Classifier (VC), and many other algorithms are used to design the address balance and to attain high assessment accuracy. There is a non-balance issue. Text is vectorized by vectorizers and all the relative results are stored. The experimental result shows that, as compared to KN, NB, ETC, RF, SVC, LR, XGB, and DT, the proposed VC provides a higher classification accuracy rate of 97.96%. The proposed methods are effective in identifying balanced and imbalanced datasets, as evidenced by the validation results. The website was created to detect messages as spam or not.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3069722/v1"
    },
    {
        "id": 22530,
        "title": "A Bayesian detection of structural changes in autoregressive time series models",
        "authors": "Abdeldjalil Slama",
        "published": "2022-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32372/chjs.13-01-03"
    },
    {
        "id": 22531,
        "title": "Bayesian Estimation for Covariate Defect Detection Model Based on Discrete Cox Proportional Hazard Models",
        "authors": "Maskura Nafreen, Priscila Silva, Lasitha Dharmasena, Vidhyashree Nagaraju, Lance Fiondella",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4581017"
    },
    {
        "id": 22532,
        "title": "Spam Recognition Based on Bayesian Classification",
        "authors": "Jun-Kai YI, Yang-Ping ZHANG, Xiang-Hui ZHAO",
        "published": "2017-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12783/dtcse/aice-ncs2016/5707"
    },
    {
        "id": 22533,
        "title": "Anomaly Detection and Explanation of Wind Turbine Main Bearings using Autoencoder and Bayesian Network Models",
        "authors": "Ahmed Mabrouk",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21428/594757db.53bdc8c7"
    },
    {
        "id": 22534,
        "title": "Chapter Thirty-Two. Spam, Spam, Spam, Spam, Spam,Trust, and Spam",
        "authors": "Richard Hardack",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5771/9781538177747-207"
    },
    {
        "id": 22535,
        "title": "Detection of spam and threads identification in E-mail spam corpus using content based text analytics method",
        "authors": "U. Murugavel, R. Santhi",
        "published": "2020",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.matpr.2020.04.742"
    },
    {
        "id": 22536,
        "title": "Bayesian Models for Dynamic Scene Analysis",
        "authors": "Csaba Benedek",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-83654-2_3"
    },
    {
        "id": 22537,
        "title": "Cooks Distance and Mahanabolis Distance Outlier Detection Methods to identify Review Spam",
        "authors": "Siddu P. Algur,  ",
        "published": "2017-6-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijecs/v6i6.16"
    },
    {
        "id": 22538,
        "title": "BAYESIAN QUICKEST CHANGE POINT DETECTION WITH MULTIPLE CANDIDATES OF POST-CHANGE MODELS",
        "authors": "Samrat Nath, Jingxian Wu",
        "published": "2018-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/globalsip.2018.8646596"
    },
    {
        "id": 22539,
        "title": "Hybrid Email Spam Detection Model Using Artificial Intelligence",
        "authors": "Samira. Douzi,  , Feda A. AlShahwan, Mouad. Lemoudden, Bouabid. El Ouahidi",
        "published": "2020-2",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijmlc.2020.10.2.937"
    },
    {
        "id": 22540,
        "title": "E-Mail Spam Classification using Naive Bayesian Classifier",
        "authors": "Mr. B. Krishna",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "— E-mail spam is the very recent problem for every individual. The e-mail spam is nothing it’s an advertisement of any company/product or any kind of virus which is receiving by the email client mailbox without any notification. To solve this problem the different spam filtering technique is used. The spam filtering techniques are used to protect our mailbox for spam mails. In this project, we are using the Naïve Bayesian Classifier for spam classification. The Naïve Bayesian Classifier is very simple and efficient method for spam classification. Here we are using the Lingspam dataset for classification of spam and non-spam mails. The feature extraction technique is used to extract the feature. The result is to increase the accuracy of the system.",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.36153"
    },
    {
        "id": 22541,
        "title": "Evidence Aggregation Based Spam Detection in e-Commerce Social Network",
        "authors": "Lavanya M P, Nandini B M",
        "published": "2018-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21467/proceedings.1.70"
    },
    {
        "id": 22542,
        "title": "Comparative Study of Machine Learning Algorithms for SMS Spam Detection",
        "authors": "Amani Alzahrani, Danda B. Rawat",
        "published": "2019-4",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/southeastcon42311.2019.9020530"
    },
    {
        "id": 22543,
        "title": "Spam Detection on Summarized Graph",
        "authors": " Sakshi Srivastava, Anil Kumar Singh",
        "published": "2022-2-8",
        "citations": 0,
        "abstract": "As the popularity of social networking sites continues to increase, spam accounts are also on the rise. Over the past few years, social networking and information-sharing microblogging websites such as Twitter and Sina Weibo have gained popularity. Unsolicited content, such as social spam, has also been exploited by spammers to overwhelm most users unfairly. In contrast to existing work, this paper uses a novel graph-based approach for spam detection. The problem of graph summarization has practical applications involving visualization and graph compression. As graph-structured databases become popular and prominent, summarizing and compressing graph-structured databases can become more and more valuable. Our experimental results demonstrate the usefulness and efficiency of our proposed strategy. The accuracy of the graph is considered before and after Graph Summarization using MultiNominal NB and then compared with other machine learning algorithms. Various algorithms are considered, and it is found that MultiNominal NB gives the lowest training time and the highest accuracy. The training time of MultiNominal NB is found to be 0.55 sec before graph summarization. After graph summarization, the training time is optimized to be 0.02 seconds, and the accuracy value is 96.64%.   ",
        "link": "http://dx.doi.org/10.17762/de.vol2022iss1.9078"
    },
    {
        "id": 22544,
        "title": "Performance evaluation of Spam and Non-Spam E-mail detection using Machine Learning algorithms",
        "authors": "V. Sasikala, K. Mounika, Y. Sravya Tulasi, D. Gayathri, M. Anjani",
        "published": "2022-3-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icears53579.2022.9752202"
    },
    {
        "id": 22545,
        "title": "Demystifying Bayesian models using Bayesian linear regression",
        "authors": "soumya banerjee",
        "published": "No Date",
        "citations": 0,
        "abstract": "Bayesian models are very important in modern data science. These models can be used to derive estimatesfor noisy and sparse data. This manuscript outlines the basics and derivations of a Bayesian linearregression model. Source code for performing Bayesian linear regression is also provided. I hope this willenable broader understanding of the basics of Bayesian models and help demystify it for scientists.",
        "link": "http://dx.doi.org/10.31219/osf.io/gx78k"
    },
    {
        "id": 22546,
        "title": "Spam Detection and Spammer Community Detection in Social Media Platform Using Machine Learning Techniques",
        "authors": "Lisa Gopal",
        "published": "2019-8-31",
        "citations": 0,
        "abstract": "In recent years, social media platforms have experienced a surge in popularity, leading to an increase in spam and spammer communities. This paper presents a comprehensive study on spam detection and spammer community detection in social media platforms using machine learning techniques. The proposed approach focuses on three main features: Review-Behavioral (RB) Based features, Review-Linguistic (RL) Based Features, and User-Behavioral (UB) Based Features. By combining these features, we aim to create a robust and accurate spam detection model that effectively identifies spam content and spammer communities in social media networks. The Review-Behavioral (RB) Based features focus on the patterns and tendencies observed in user-generated content, such as the frequency of posting, the time between posts, and the distribution of ratings. Review-Linguistic (RL) Based Features, on the other hand, analyze the linguistic characteristics of the content, including the use of specific keywords, the complexity of the text, and sentiment analysis. Lastly, User-Behavioral (UB) Based Features examine the behavior of users in the social media platform, including their social connections, interactions, and activity patterns. By incorporating these features into a machine learning model, we aim to develop an effective spam detection and spammer community detection system that can be used to protect social media platforms from malicious activities. The results of this study will provide valuable insights into the effectiveness of these features in identifying spam and spammer communities, as well as contribute to the ongoing efforts to improve the security and integrity of social media networks.",
        "link": "http://dx.doi.org/10.17762/itii.v7i2.802"
    },
    {
        "id": 22547,
        "title": "Twitter spam and false accounts prevalence, detection, and characterization: A survey",
        "authors": "Emilio Ferrara",
        "published": "2022-12-13",
        "citations": 5,
        "abstract": "The issue of quantifying and characterizing various forms of social media manipulation and abuse has been at the forefront of the computational social science research community for over a decade. In this paper, I provide a (non-comprehensive) survey of research efforts aimed at estimating the prevalence of spam and false accounts on Twitter, as well as characterizing their use, activity, and behavior. I propose a taxonomy of spam and false accounts, enumerating known techniques used to create and detect them. Then, I summarize studies estimating the prevalence of spam and false accounts on Twitter. Finally, I report on research that illustrates how spam and false accounts are used for scams and frauds, stock market manipulation, political disinformation and deception, conspiracy amplification, coordinated influence, public health misinformation campaigns, radical propaganda and recruitment, and more. I will conclude with a set of recommendations aimed at charting the path forward to combat these problems.",
        "link": "http://dx.doi.org/10.5210/fm.v27i12.12872"
    },
    {
        "id": 22548,
        "title": "Experimental study of spam classifier based on naive Bayesian model",
        "authors": "Teng Lv, Ping Yan",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2675137"
    },
    {
        "id": 22549,
        "title": "Towards dynamic quantile function models for anomaly detection.",
        "authors": "Lekha Patel, Peter Jacobs",
        "published": "2022-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/2005615"
    },
    {
        "id": 22550,
        "title": "Email spam detection using python",
        "authors": "",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets45884"
    },
    {
        "id": 22551,
        "title": "Using Paraphrasing Augmentation to Boost Spam Detection",
        "authors": "Rendong Zhang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00066"
    },
    {
        "id": 22552,
        "title": "Approximate Bayesian Inference in Semiparametric Copula Models",
        "authors": "Clara Grazian, Brunero Liseo",
        "published": "2017-12-1",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/17-ba1080"
    },
    {
        "id": 22553,
        "title": "Bayesian Causal Inference in Probit Graphical Models",
        "authors": "Federico Castelletti, Guido Consonni",
        "published": "2021-12-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/21-ba1260"
    },
    {
        "id": 22554,
        "title": "Bayesian Inference in Nonparanormal Graphical Models",
        "authors": "Jami J. Mulgrave, Subhashis Ghosal",
        "published": "2020-6-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/19-ba1159"
    },
    {
        "id": 22555,
        "title": "Experiment Research on Spam Filter Classifier Based on Naive Bayesian Algorithm",
        "authors": "Teng Lv, Ping Yan, Hongwu Yuan, Weimin He",
        "published": "2021-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaa53760.2021.00146"
    },
    {
        "id": 22556,
        "title": "Bayesian decision-theoretic analysis of thresholds in Gompertz-mixture models, for robust detection of corona-like viruses in wildlife",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36334/modsim.2023.lowchoy656"
    },
    {
        "id": 22557,
        "title": "Unsupervised User-Based Insider Threat Detection Using Bayesian Gaussian Mixture Models",
        "authors": "Simon Bertrand, Josée Desharnais, Nadia Tawbi",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/pst58708.2023.10320169"
    },
    {
        "id": 22558,
        "title": "Sage Advice? The Impacts of Explanations for Machine Learning Models on Human Decision-Making in Spam Detection.",
        "authors": "Mallory Stites, Megan Nyre-Yu, Blake Moss, Charles Smutz, Michael Smith",
        "published": "2021-7-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1878725"
    },
    {
        "id": 22559,
        "title": "Bayesian Spam Detection Framework on Mobile Device",
        "authors": "Yitao Yang, Guozi Sun, Chengyan Qiu",
        "published": "2021-8-30",
        "citations": 1,
        "abstract": "\nBackground:\n The spam message aimed at mobile devices has become a prevalent activity\nin recent years. About 76% of mobile users received spam messages of Ads, fraud messages and\nphishing links. It has led to a significant financial loss of 91.5 billion Yuan per year and this problem\nwill be more severe in the coming future. Although the operators are making much effort against\nspam message, the number of spams are increasing day by day.\n\n\nAim:\nMany schemes designed to detect and filter spam have been proposed in the research area. The\nBayesian classification algorithm is one of the most popular schemes. Most of the spam detection\nschemes based on Bayesian are designed for communication providers. The scalability of filter policy\nis hard to control because the strict policy might filter the normal messages while some spam\nmessages would not be detected due to the flexibility in the policy.\n\n\nMethods:\nThe current mobile device has a robust computational capability so it can execute complex\njobs. A spam detection framework is designed in the present study.\n\n\nResults:\nIt can sniffer the coming messages in mobile device by hooking the Android SMS API, and\nsend them to the filter module, -which is responsible to filter messages into normal or spam based\non Bayesian classification. This is a light-weight framework of consuming low power, which is suitable\nfor mobile devices. Extra experiments are conducted to prove their accuracy and efficiency.\n\n\nConclusion:\nThe results showed that it could filter the spam among receiving the messages in realtime\nand become more accurate by learning the users' feedback.\n",
        "link": "http://dx.doi.org/10.2174/2213275912666190819121251"
    },
    {
        "id": 22560,
        "title": "Detection of Email Spam using Natural Language Processing Based Random Forest Approach",
        "authors": "Alanazi Rayan, Ahmed I. Taloba",
        "published": "No Date",
        "citations": 2,
        "abstract": "Abstract\nAn unsolicited means of digital communications in the internet world is the spam email, which could be sent to an individual or a group of individuals or a company. These spam emails may cause serious threat to the user i.e., the email addresses used for any online registrations may be collected by the malignant third parties (spammers) and they expose the genuine user to various kinds of attacks. Another method of spamming is by creating a temporary email register and receive emails that can be terminated after some certain amount of time. This method is well suited for misusing those temporary email addresses for sending free spam emails without revealing the spammers real account details. These attacks create major problems like theft of user credentials, lack of storage, etc. Hence it is essential to introduce an efficient detection mechanismthrough feature extraction and classification for detecting spam emails and temporary email addresses. This can be accomplished through a novel Natural Language Processing based Random Forest (NLP-RF) approach. With the help of our proposed approach, the spam emails are reduced and this method improves the accuracy of spam email filtering, since the use of NLP makes the system to detect the natural languages spoken by people and the Random Forest approach uses multiple decision trees and uses a random node for filtering the spams.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-921426/v1"
    },
    {
        "id": 22561,
        "title": "Information Quality in Online Social Networks: A Fast Unsupervised Social Spam Detection Method for Trending Topics",
        "authors": "Mahdi Washha, Dania Shilleh, Yara Ghawadrah, Reem Jazi, Florence Sedes",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006372006630675"
    },
    {
        "id": 22562,
        "title": "Spam Detection on Social Networks",
        "authors": "Ninghao Liu, Xia Hu",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_110199"
    },
    {
        "id": 22563,
        "title": "A Review of SMS Spam Detection",
        "authors": "",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets45266"
    },
    {
        "id": 22564,
        "title": "Analysis of Twitter Spam Detection Techniques-A Review",
        "authors": "Monika Singh",
        "published": "2021-11-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictai53825.2021.9673356"
    },
    {
        "id": 22565,
        "title": "Case Study Email Spam Detection of Two Metaheuristic Algorithm for Optimal Feature Selection",
        "authors": "Hekmat Mohmmadzadeh",
        "published": "No Date",
        "citations": 1,
        "abstract": "Selecting a feature in data mining is one of the most challenging and important activities in pattern recognition. The issue of feature selection is to find the most important subset of the main features in a specific domain, the main purpose of which is to remove additional or unrelated features and ultimately improve the accuracy of the categorization algorithms. As a result, the issue of feature selection can be considered as an optimization problem and to solve it, meta-innovative algorithms can be used. In this paper, a new hybrid model with a combination of whale optimization algorithms and flower pollination algorithms is presented to address the problem of feature selection based on the concept of opposition-based learning. In the proposed method, we tried to solve the problem of optimization of feature selection by using natural processes of whale optimization and flower pollination algorithms, and on the other hand, we used opposition-based learning method to ensure the convergence speed and accuracy of the proposed algorithm. In fact, in the proposed method, the whale optimization algorithm uses the bait siege process, bubble attack method and bait search, creates solutions in its search space and tries to improve the solutions to the feature selection problem, and along with this algorithm, Flower pollination algorithm with two national and local search processes improves the solution of the problem selection feature in contrasting solutions with the whale optimization algorithm. In fact, we used both search space solutions and contrasting search space solutions, all possible solutions to the feature selection problem. To evaluate the performance of the proposed algorithm, experiments are performed in two stages. In the first phase, experiments were performed on 10 sets of data selection features from the UCI data repository. In the second step, we tried to test the performance of the proposed algorithm by detecting spam emails. The results obtained from the first step show that the proposed algorithm, by running on 10 UCI data sets, has been able to be more successful in terms of average selection size and classification accuracy than other basic meta-heuristic algorithms. Also, the results obtained from the second step show that the proposed algorithm has been able to perform spam emails more accurately than other similar algorithms in terms of accuracy by detecting spam emails.",
        "link": "http://dx.doi.org/10.20944/preprints202001.0309.v3"
    },
    {
        "id": 22566,
        "title": "Email Spam Detection Using Supervised Algorithms",
        "authors": "",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets36685"
    },
    {
        "id": 22567,
        "title": "Infinite Scaled Dirichlet Mixture Models for Spam Filtering via Bayesian and Variational Bayes Learning",
        "authors": "Fahd Aldosari, Sami Bourouis, Nizar Bouguila, Hassen Sallay, Khalid M Jamil Khayyat",
        "published": "2018-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cybermatics_2018.2018.00306"
    },
    {
        "id": 22568,
        "title": "Semiparametric Functional Factor Models with Bayesian Rank Selection",
        "authors": "Daniel R. Kowal, Antonio Canale",
        "published": "2023-12-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/23-ba1410"
    },
    {
        "id": 22569,
        "title": "Comparative Analysis of Neural Network Models for Spam E-mail Detection",
        "authors": "G Bharathi Mohan, R Prasanna Kumar, Sarrvesh N, Poorani Ayswariya P S, P Yagnitha, Pranav Raj S, Boopalamani J",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaect60202.2024.10469042"
    },
    {
        "id": 22570,
        "title": "Bayesian Meta-Analysis of Randomized Trials UsingGraphical Models and BUGS",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315274300-27"
    }
]