[
    {
        "id": 22871,
        "title": "Application of Classification Model Based on Sentiment Tendency Data Mining in NLP Text Sentiment Analysis",
        "authors": "Ke Yu",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011754400003607"
    },
    {
        "id": 22872,
        "title": "Sentiment Analysis as a Restricted NLP Problem",
        "authors": "Akshi Kumar, Divya Gupta",
        "published": "2022-6-10",
        "citations": 0,
        "abstract": "With the accelerated evolution of social networks, there is a tremendous increase in opinions by the people about products or services. While this user-generated content in natural language is intended to be valuable, its large amounts require use of content mining methods and NLP to uncover the knowledge for various tasks. In this study, sentiment analysis is used to analyze and understand the opinions of users using statistical approaches, knowledge-based approaches, hybrid approaches, and concept-based ontologies. Unfortunately, sentiment analysis also experiences a range of difficulties like colloquial words, negation handling, ambiguity in word sense, coreference resolution, which highlight another perspective emphasizing that sentiment analysis is certainly a restricted NLP problem. The purpose of this chapter is to discover how sentiment analysis is a restricted NLP problem. Thus, this chapter discussed the concept of sentiment analysis in the field of NLP and explored that sentiment analysis is a restricted NLP problem due to the sophisticated nature of natural language. ",
        "link": "http://dx.doi.org/10.4018/978-1-6684-6303-1.ch054"
    },
    {
        "id": 22873,
        "title": "SENTIMENT ANALYSIS ON TWITTER DATASET USING NLP",
        "authors": "",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets45970"
    },
    {
        "id": 22874,
        "title": "Sentiment Analysis Is Not Solved! Assessing and Probing Sentiment Classification",
        "authors": "Jeremy Barnes, Lilja Øvrelid, Erik Velldal",
        "published": "2019",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w19-4802"
    },
    {
        "id": 22875,
        "title": "Breaking Sentiment Analysis of Movie Reviews",
        "authors": "Ieva Staliūnaite, Ben Bonfil",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-5410"
    },
    {
        "id": 22876,
        "title": "Chunker Based Sentiment Analysis for Nepali Text",
        "authors": "Archit Yajnik, Sabu Lama Tamang",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "The article represents the Sentiment Analysis (SA) of a Nepali sentence. Skip-gram model is used for the word to vector encoding. In the first experiment the vector representation of each sentence is generated by using Skip-gram model followed by the Multi-Layer Perceptron (MLP) classification and it is observed that the F1 score of 0.6486 is achieved for positive-negative classification with overall accuracy of 68%. Whereas in the second experiment the verb chunks are extracted using Nepali parser and carried out the similar experiment on the verb chunks. F1 score of 0.6779 is observedfor positive -negative classification with overall accuracy of 85%. Hence, Chunker based sentiment analysis is proven to be better than sentiment analysis using sentences.",
        "link": "http://dx.doi.org/10.5121/csit.2023.131406"
    },
    {
        "id": 22877,
        "title": "A Deep Learning System for Sentiment Analysis of Service Calls",
        "authors": "Yanan Jia",
        "published": "2020",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.ecnlp-1.4"
    },
    {
        "id": 22878,
        "title": "Sentiment Analysis of Product Reviews on E-Commerce Platforms Based on NLP: Take HUAWEI P40 as an Example",
        "authors": "Rui Yang, Yuzhu Xie, Jie Sun, Ling Ding, Zhemiao Zhang, Jianjun Wang",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011768000003607"
    },
    {
        "id": 22879,
        "title": "A Code-Diverse Kannada-English Dataset For NLP Based Sentiment Analysis Applications",
        "authors": "Prashanth Kannadaguli",
        "published": "2021-11-26",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciip53038.2021.9702548"
    },
    {
        "id": 22880,
        "title": "ACTSA: Annotated Corpus for Telugu Sentiment Analysis",
        "authors": "Sandeep Sricharan Mukku, Radhika Mamidi",
        "published": "2017",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-5408"
    },
    {
        "id": 22881,
        "title": "Analysis of Various Sentiment Analysis Techniques of NLP",
        "authors": "Satyen M. Parikh, Mitali K. Shah",
        "published": "2021-2-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicv50876.2021.9388525"
    },
    {
        "id": 22882,
        "title": "Product Review Assistance Based on Feature Sentiment Analysis Using NLP",
        "authors": "Vaishali Jabade, Prasad Sanap, Ajinkya Sathe",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425395"
    },
    {
        "id": 22883,
        "title": "Strawman: An Ensemble of Deep Bag-of-Ngrams for Sentiment Analysis",
        "authors": "Kyunghyun Cho",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-5409"
    },
    {
        "id": 22884,
        "title": "Twitter Sentiment Analysis and Prediction using NLP",
        "authors": "M. Sindhu, T.C. Sabareeswari, A. Tamilselvi",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452611"
    },
    {
        "id": 22885,
        "title": "Comparative Exploration Of Prediction Algorithms For Sentiment Analysis Using NLP",
        "authors": "Umid Kumar Dey, Alaa Noor",
        "published": "2019-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccci.2019.8821801"
    },
    {
        "id": 22886,
        "title": "Low-Dimensional Text Representations for Sentiment Analysis NLP Tasks",
        "authors": "Leonidas Akritidis, Panayiotis Bozanis",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s42979-023-01913-y"
    },
    {
        "id": 22887,
        "title": "TextAttack: Lessons learned in designing Python frameworks for NLP",
        "authors": "John Morris, Jin Yong Yoo, Yanjun Qi",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.nlposs-1.18"
    },
    {
        "id": 22888,
        "title": "Sentiment Analysis of Multilingual Tweets based on Natural Language Processing (NLP)",
        "authors": "",
        "published": "2021-10",
        "citations": 0,
        "abstract": "Multilingual Sentiment analysis plays an important role in a country like India with many languages as the style of expression varies in different languages. The Indian people speak in total 22 different languages and with the help of Google Indic keyboard people can express their sentiments i.e reviews about anything in the social media in their native language from individual smart phones. It has been found that machine learning approach has overcome the limitations of other approaches. In this paper, a detailed study has been carried out based on Natural Language Processing (NLP) using Simple Neural Network (SNN) ,Convolutional Neural Network(CNN), and Long Short Term Memory (LSTM)Neural Network followed by another amalgamated model adding a CNN layer on top of the LSTM without worrying about versatility of multilingualism. Around 4000 samples of reviews in English, Hindi and in Bengali languages are considered to generate outputs for the above models and analyzed. The experimental results on these realistic reviews are found to be effective for further research work.",
        "link": "http://dx.doi.org/10.4018/ijsda.20211001oa16"
    },
    {
        "id": 22889,
        "title": "e-Commerce and Sentiment Analysis: Predicting Outcomes of Class Action Lawsuits",
        "authors": "Stacey Taylor, Vlado Keselj",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.ecnlp-1.12"
    },
    {
        "id": 22890,
        "title": "BLIP-NLP Model for Sentiment Analysis",
        "authors": "PVVS Srinivas, Kota Gayathri, Kola Bhavitha,  Jahnavi, K.Dunti Sarath",
        "published": "2023-7-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212253"
    },
    {
        "id": 22891,
        "title": "A Code-Diverse Tulu-English Dataset For NLP Based Sentiment Analysis Applications",
        "authors": "Prashanth Kannadaguli",
        "published": "2021-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/acts53447.2021.9708241"
    },
    {
        "id": 22892,
        "title": "Gradual Learning of Matrix-Space Models of Language for Sentiment Analysis",
        "authors": "Shima Asaadi, Sebastian Rudolph",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-2621"
    },
    {
        "id": 22893,
        "title": "Improving Cross-Lingual Sentiment Analysis via Conditional Language Adversarial Nets",
        "authors": "Hemanth Kandula, Bonan Min",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.sigtyp-1.4"
    },
    {
        "id": 22894,
        "title": "ROLE OF NATURAL LANGUAGE PROCESSING (NLP) IN THE FIELD OF SENTIMENT ANALYSIS",
        "authors": "",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets46095"
    },
    {
        "id": 22895,
        "title": "Sentiment analysis—algorithms and frameworks",
        "authors": "Shajulin Benedict",
        "published": "2022-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/978-0-7503-4024-3ch6"
    },
    {
        "id": 22896,
        "title": "Sentiment analysis on covid-19 vaccine using Twitter data: A NLP approach",
        "authors": "Kainat Khan, Sachin Yadav",
        "published": "2021-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/r10-htc53172.2021.9641515"
    },
    {
        "id": 22897,
        "title": "Comparative Analysis of Sentiment in Original and Summarized Tweets: Leveraging Transformer Models for Enhanced NLP Insights",
        "authors": "Kun Bu, Kandethody Ramachandran",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "This paper investigates the sentiments of Twitter users towards the emergent topic of ChatGPT, leveraging advanced techniques in natural language processing (NLP) and sentiment analysis (SA). Our approach uniquely incorporates a dual setting for sentiment analysis: one analyzes the sentiments of original, full-length tweets, while the other first condenses these tweets into succinct summaries before performing sentiment analysis. By employing this dual approach, we are able to offer a comparative analysis of sentiment assessment pre- and post-text summarization, exploring the accuracy and reliability of the summarized sentiments. Central to our methodology is the application of Transformer models, specifically ProphetNet, which facilitates a deeper and more nuanced understanding of the original text. Unlike traditional methods that rely on keyword extraction and aggregation, our approach generates coherent and contextually rich summaries, providing a novel lens for sentiment analysis. This research contributes to the field by presenting a comprehensive study comparing sentiment analysis outcomes between original texts and their summarized counterparts, and examining the effectiveness of different NLP techniques, namely NLTK and the Transformer-based ProphetNet model. The findings offer valuable insights into the dynamics of sentiment analysis in the context of social media and the efficacy of state-of-the-art NLP technologies in processing complex, real-world data.",
        "link": "http://dx.doi.org/10.5121/csit.2024.140404"
    },
    {
        "id": 22898,
        "title": "Deep Learning-Based Frameworks for Aspect-Based Sentiment Analysis",
        "authors": "Ashish Kumar, Aditi Sharan",
        "published": "2020",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-15-1216-2_6"
    },
    {
        "id": 22899,
        "title": "Investigating Sentiment analysis using Clustering and NLP tools",
        "authors": "Ashwini Yerlekar, Devika Deshmukh",
        "published": "2019-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v7i1.344347"
    },
    {
        "id": 22900,
        "title": "Mental Health Assessment using AI with Sentiment Analysis and NLP",
        "authors": "Shaswat Srivastava, S. Suchitra, Vardhit Saraogi, K. Arthi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.107"
    },
    {
        "id": 22901,
        "title": "Call Center Customer Sentiment Analysis Using ML and NLP",
        "authors": "Imad Aattouri, Hicham Mouncif, Mohamed Rida",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sita60746.2023.10373715"
    },
    {
        "id": 22902,
        "title": "Enhancement of Sentiment Analysis Classification Performance of Spotify Reviews through NLP-based Approaches",
        "authors": "",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.59287/ijanser.1423"
    },
    {
        "id": 22903,
        "title": "Sentiment Analysis with NLP on Twitter Data",
        "authors": "Md. Rakibul Hasan, Maisha Maliha, M. Arifuzzaman",
        "published": "2019-7",
        "citations": 47,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic4me247184.2019.9036670"
    },
    {
        "id": 22904,
        "title": "News text Analysis using Text Summarization and Sentiment Analysis based on NLP",
        "authors": "Abir Mishra, Akshat Sahay, M anjusha Pandey, Siddharth Swarup Routaray",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsmdi57622.2023.00014"
    },
    {
        "id": 22905,
        "title": "SURREY-CTS-NLP at WASSA2022: An Experiment of Discourse and Sentiment Analysis for the Prediction of Empathy, Distress and Emotion",
        "authors": "Shenbin Qian, Constantin Orasan, Diptesh Kanojia, Hadeel Saadany, Félix Do Carmo",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.wassa-1.29"
    },
    {
        "id": 22906,
        "title": "NLP Sentiment Analysis and Accounting Transparency: A New Era of Financial Record Keeping",
        "authors": "Alessio Faccia, Julie McDonald, Babu George",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "Transparency in financial reporting is crucial for maintaining trust in financial markets, yet fraudulent financial statements remain challenging to detect and prevent. This study introduces a novel approach to detecting financial statement fraud by applying sentiment analysis to analyse the textual data within financial reports. This research aims to identify patterns and anomalies that might indicate fraudulent activities by examining the language and sentiment expressed across multiple fiscal years. The study focuses on three companies known for financial statement fraud: Wirecard, Tesco, and Under Armour. Utilising Natural Language Processing (NLP) techniques, the research analyses polarity (positive or negative sentiment) and subjectivity (degree of personal opinion) within the financial statements, revealing intriguing patterns. Wirecard showed a consistent tone with a slight decrease in 2018, Tesco exhibited marked changes in the fraud year, and Under Armour presented subtler shifts during the fraud years. While the findings present promising trends, the study emphasises that sentiment analysis alone cannot definitively detect financial statement fraud. It provides insights into the tone and mood of the text but cannot reveal intentional deception or financial discrepancies. The results serve as supplementary information, enriching traditional financial analysis methods. This research contributes to the field by exploring the potential of sentiment analysis in financial fraud detection, offering a unique perspective that complements quantitative methods. It opens new avenues for investigation and underscores the need for an integrated, multidimensional approach to fraud detection.",
        "link": "http://dx.doi.org/10.3390/computers13010005"
    },
    {
        "id": 22907,
        "title": "A Novel Approach to Optimize the Performance of Hadoop Frameworks for Sentiment Analysis",
        "authors": "Guru Prasad, Amith K. Jain, Prithviraj Jain,  Nagesh H. R.",
        "published": "2022-6-10",
        "citations": 0,
        "abstract": "Twitter is one among most popular micro blogging services with millions of active users. It is a hub of massive collection of data arriving from various sources. In Twitter, users most often express their views, opinions, thoughts, emotions or feelings about a particular topic, product or service, of their interest, choice or concern. This makes twitter a hub of gargantuan amount of data, and at the same time a useful platform in getting to know and understand the underlying sentiment behind a particular product or for that matter anything expressed in twitter as tweets. It is important to note here that aforesaid massive collection of data is not just any redundant data, but one which contains useful information as noted earlier. In view of aforesaid context, Sentiment analysis in relation to twitter data gains enormous importance. Sentiment analysis offers itself as a good approach in classifying the opinions formulated by individuals (tweeters) into different sentiments such as, positive, negative, or neutral. Implementing Sentiment analysis algorithms using conventional tools leads to high computation time, and thus are less effective. Hence, there is a need for state-of-the-art tools and techniques to be developed for sentiment analysis making it the need of the hour to facilitate faster computation. An Apache Hadoop framework is one such option that supports distributed data computing and has been commonly adopted for a variety of use-cases. In this article, the author identifies factors affecting the performance of sentiment analysis algorithms based on Hadoop framework and proposes an approach for optimizing the performance of sentiment analysis. The experimental results depict the potential of the proposed approach. ",
        "link": "http://dx.doi.org/10.4018/978-1-6684-6303-1.ch051"
    },
    {
        "id": 22908,
        "title": "Transformers-Based Approach for a Sustainability Term-Based Sentiment Analysis (STBSA)",
        "authors": "Blaise Sandwidi, Suneer Pallitharammal Mukkolakal",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.nlp4pi-1.19"
    },
    {
        "id": 22909,
        "title": "A Survey on NLP-Based Print and Social Media Sentiment Analysis",
        "authors": "Govinda Patil, Vivek Chaplot",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10456002"
    },
    {
        "id": 22910,
        "title": "Text Analysis for Product Reviews for Sentiment Analysis using NLP Methods",
        "authors": "S.Muthuku maran,  , P.Sur esh",
        "published": "2017-5-25",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22315381/ijett-v47p278"
    },
    {
        "id": 22911,
        "title": "Sentiment Analysis on Interview Transcripts: An application of NLP for Quantitative Analysis",
        "authors": "Manojkumar Parmar, Bhanurekha Maturi, Jhuma Mallik Dutt, Hrushikesh Phate",
        "published": "2018-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacci.2018.8554498"
    },
    {
        "id": 22912,
        "title": "Breaking NLP: Using Morphosyntax, Semantics, Pragmatics and World\n            Knowledge to Fool Sentiment Analysis Systems",
        "authors": "Taylor Mahler, Willy Cheung, Micha Elsner, David King, Marie-Catherine de Marneffe, Cory Shain, Symon Stevens-Guille, Michael White",
        "published": "2017",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-5405"
    },
    {
        "id": 22913,
        "title": "Sentiment analysis of Amazon product reviews based on NLP",
        "authors": "Yuanhang Xiao, Chengbin Qi, Hongyong Leng",
        "published": "2021-3",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aemcse51986.2021.00249"
    },
    {
        "id": 22914,
        "title": "Sentiment Analysis on Bangla Food Reviews Using Machine Learning and Explainable NLP",
        "authors": "Md. Shymon Islam, Kazi Masudul Alam",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441309"
    },
    {
        "id": 22915,
        "title": "NCUEE-NLP at WASSA 2023 Shared Task 1: Empathy and Emotion Prediction Using Sentiment-Enhanced RoBERTa Transformers",
        "authors": "Tzu-Mi Lin, Jung-Ying Chang, Lung-Hao Lee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.49"
    },
    {
        "id": 22916,
        "title": "SENTIMENT ANALYSIS AND NLP MODELS AS THE LANGUAGE OF DATA",
        "authors": "Mohd Hyder Gouri, Mr. Mohit Kumar",
        "published": "2023-11",
        "citations": 0,
        "abstract": "NLP models and sentiment analysis are two core facets of natural language processing (NLP) that are examined in this chapter. It starts by exploring the several approaches used to create NLP models, such as semi-supervised learning, supervised learning, unsupervised learning, and the crucial function of deep learning. It then delves into the field of sentiment analysis, illuminating its importance, variety of approaches, and practical uses. These subjects taken together offer a thorough overview of the rapidly changing field of NLP and its wide variety of applications.",
        "link": "http://dx.doi.org/10.52458/9789388996747.nsp2023.eb.ch-07"
    },
    {
        "id": 22917,
        "title": "Machine Learning and NLP based Sentiment Analysis",
        "authors": "Ch. B. V. Durga, Ramakrishna Kolikipogu, Om Prakash Singh, Niranjan Rajpurohit, Dharmendra Sharma",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134425"
    },
    {
        "id": 22918,
        "title": "Importance of Self-Attention for Sentiment Analysis",
        "authors": "Gaël Letarte, Frédérik Paradis, Philippe Giguère, François Laviolette",
        "published": "2018",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w18-5429"
    },
    {
        "id": 22919,
        "title": "Structured Self-AttentionWeights Encode Semantics in Sentiment Analysis",
        "authors": "Zhengxuan Wu, Thanh-Son Nguyen, Desmond Ong",
        "published": "2020",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.blackboxnlp-1.24"
    },
    {
        "id": 22920,
        "title": "An omicron variant tweeter sentiment analysis using NLP technique",
        "authors": "Sangamesh Hosgurmath, Vishwanath Petli, V.K. Jalihal",
        "published": "2022-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.gltp.2022.03.025"
    },
    {
        "id": 22921,
        "title": "Sentiment Analysis of COVID-19 Vaccine Perception Using NLP",
        "authors": "Mohammad Anas Mudassir, Yash Mor, Rhythm Munot, Radha Shankarmani",
        "published": "2021-9-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icirca51532.2021.9544512"
    },
    {
        "id": 22922,
        "title": "Sentiment Analysis with NLP on Twitter Data",
        "authors": "K. Brindha, Sudha Senthilkumar, Anany Kumar Singh, Priyanshu M Sharma",
        "published": "2022-12-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartgencon56628.2022.10084036"
    },
    {
        "id": 22923,
        "title": "Sentiment Analysis of OYO Hotel Reviews Using NLP",
        "authors": "Komal Chhutlani, Vansh Takrani, Aryan Motwani, Tanishq Harchandani, Sunita Sahu",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307941"
    },
    {
        "id": 22924,
        "title": "Product Market Demand Analysis Using NLP in Banglish Text with Sentiment Analysis and Named Entity Recognition",
        "authors": "Md Sabbir Hossain, Nishat Nayla, Annajiat Alim Rassel",
        "published": "2022-3-9",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ciss53076.2022.9751188"
    },
    {
        "id": 22925,
        "title": "Detection of fake reviews using NLP &amp;Sentiment Analysis",
        "authors": "P. Devika, A. Veena, E. Srilakshmi, A. Ranavardhan Reddy, E. Praveen",
        "published": "2021-7-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icces51350.2021.9489210"
    },
    {
        "id": 22926,
        "title": "Sentiment Analysis on Online E-commerce Product Reviews using NLP",
        "authors": "B Mohana Vamsi",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Abstract: Online shopping is routine in day-to-day life, and the preponderance of products at home is mostly from online shopping. But we can’t test or check the quality of products in online shopping. In those circumstances, product reviews play a vital role in purchasers purchasing a product. Sentiment analysis of the product makes the customer identify the best quality product effortlessly and gives perfect decision-making for the product choice. However, people across countries who speak different languages might find it arduous to analyze the situation. We proposed a solution in which we can do both language identification, translation, and analysis of the text review data. Using a Google Language translator, we can identify and translate the language to any destination language that we want to analyze the text. VADER makes that analysis and gives us the best result for the product reviews. The experimental results of the proposed solutions were well-defined and established in sentiment analysis tasks.",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.58910"
    },
    {
        "id": 22927,
        "title": "Sentiment Analysis Using NLP &amp; Deep Learning on Social Media Tweets",
        "authors": "Mansi Akhade, Bandana Mahapatra, Abhishekh Bhatt",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/idicaiei58380.2023.10406572"
    },
    {
        "id": 22928,
        "title": "Sentiment Analysis on Amazon Alexa Reviews Using NLP &amp; Classification",
        "authors": "Sanjay Kumar, Sahil Kanshal, Vishnu Sharma, Rajneesh Talwar",
        "published": "2022-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icac3n56670.2022.10074086"
    },
    {
        "id": 22929,
        "title": "A Combined Model of NLP with Business Process Modelling for Sentiment Analysis",
        "authors": "Dhivyashree M, Sarumathi K R, Sabarmathi K R",
        "published": "2021-12-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca52323.2021.9675910"
    },
    {
        "id": 22930,
        "title": "Sentiment Analysis Predictions in Digital Media Content using NLP Techniques",
        "authors": "Abdulrahman Radaideh, Fikri Dweiri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141128"
    },
    {
        "id": 22931,
        "title": "Sentiment Analysis as a Restricted NLP Problem",
        "authors": "Akshi Kumar, Divya Gupta",
        "published": "2021",
        "citations": 2,
        "abstract": "With the accelerated evolution of social networks, there is a tremendous increase in opinions by the people about products or services. While this user-generated content in natural language is intended to be valuable, its large amounts require use of content mining methods and NLP to uncover the knowledge for various tasks. In this study, sentiment analysis is used to analyze and understand the opinions of users using statistical approaches, knowledge-based approaches, hybrid approaches, and concept-based ontologies. Unfortunately, sentiment analysis also experiences a range of difficulties like colloquial words, negation handling, ambiguity in word sense, coreference resolution, which highlight another perspective emphasizing that sentiment analysis is certainly a restricted NLP problem. The purpose of this chapter is to discover how sentiment analysis is a restricted NLP problem. Thus, this chapter discussed the concept of sentiment analysis in the field of NLP and explored that sentiment analysis is a restricted NLP problem due to the sophisticated nature of natural language. ",
        "link": "http://dx.doi.org/10.4018/978-1-7998-4240-8.ch004"
    },
    {
        "id": 22932,
        "title": "ItVENSES - A Symbolic System for Aspect-Based Sentiment Analysis",
        "authors": "Rodolfo Delmonte",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4000/books.aaccademia.4539"
    },
    {
        "id": 22933,
        "title": "Textual Sentiment Analysis using Machine Learning and NLP: A Review",
        "authors": "Neha Sharma,  , S Veenadhari, Rachna Kulhare",
        "published": "2021",
        "citations": 0,
        "abstract": "One of the most prominent parts of opinion mining is sentiment analysis that is used to extract emotion from textual features. Through this process, it can be determined whether a piece of writing is positive, negative, or neutral. This paper presents a review on the sentiment analysis task using textual data. A sentiment analysis system for text com-bines Natural Language Processing (NLP) and Machine Learning Techniques to assign weighted sentiment scores to the entities, topics, themes, and categories within a sentence or phrase. One of the prominent parts of opinion mining is depression detection. Nowadays, a significant section of society is affected by depression due to mental stress. So, it is also a considerable concern. There may be several reasons for depression, especially in adults. Different people have different symptoms, and its identification is a significant challenge. Most people feel shy to accept that they suffer from depression, while some people are unaware of their depressed mental health. The objective of this paper is to analyze recently developed frameworks for the diagnosis of sentiment and depression level of an individual. This paper directs towards creating a single framework in the future for depression and sentiment analysis.",
        "link": "http://dx.doi.org/10.52458/978-81-95502-00-4-51"
    },
    {
        "id": 22934,
        "title": "Sentiment Analysis of GEMS application process for Sesotho sa Leboa language using NLP",
        "authors": "Hlaudi Daniel Masethe, Mosima Anna Masethe, Sunday Olusegun Ojo, Pius A Owolawi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4650165"
    },
    {
        "id": 22935,
        "title": "Language of the Market: NLP-Driven Sentiment Analysis of Hungarian Economy",
        "authors": "Frigyes Viktor Arthur, Bálint Gyires-Tóth, Máté Imre Debreczeni, Lívia Réka Ónozó",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/coginfocom59411.2023.10397544"
    },
    {
        "id": 22936,
        "title": "Sentiment Analysis using Machine Learning and NLP for Digital Education",
        "authors": "Md. Shahed Hossen, Md. Nwoshad Alam Chowdhury, Arpita Mony Sristy, Nusrat Jahan",
        "published": "2022-3-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccmc53470.2022.9754065"
    },
    {
        "id": 22937,
        "title": "Characterizing Social Relations Via NLP-Based Sentiment Analysis",
        "authors": "Georg Groh, Jan Hauffa",
        "published": "2021-8-3",
        "citations": 22,
        "abstract": "\n      \n        We investigate and evaluate methods for the characterization of social relations from textual communication context, using e-mail as an example. Social relations are intrinsically characterized by the Cartesian product of weights on various axes (we employ valuation and intensity as examples). The prediction of these characteristics is performed by application of unsupervised learning algorithms on meta-data, communication statistics, and the results of deep linguistic analysis of the message body. Classification of sentiment polarity is chosen as the means of linguistic analysis. We find that prediction accuracy can be improved by introducing limited amounts of additional information.\n      \n    ",
        "link": "http://dx.doi.org/10.1609/icwsm.v5i1.14157"
    },
    {
        "id": 22938,
        "title": "Thai Sentiment Analysis via Bidirectional LSTM-CNN Model with Embedding Vectors and Sentic Features",
        "authors": "Thititorn Seneewong Na Ayutthaya, Kitsuchart Pasupa",
        "published": "2018-11",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isai-nlp.2018.8692836"
    },
    {
        "id": 22939,
        "title": "NLPOP: a Dataset for Popularity Prediction of Promoted NLP Research on Twitter",
        "authors": "Leo Obadić, Martin Tutek, Jan Šnajder",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.wassa-1.32"
    },
    {
        "id": 22940,
        "title": "NLP at IEST 2018: BiLSTM-Attention and LSTM-Attention via Soft Voting in Emotion Classification",
        "authors": "Qimin Zhou, Hao Wu",
        "published": "2018",
        "citations": 26,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w18-6226"
    },
    {
        "id": 22941,
        "title": "Aspect-based Sentiment Analysis: X2Check at ABSITA 2018",
        "authors": "Emanuele Di Rosa, Alberto Durante",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4000/books.aaccademia.4545"
    },
    {
        "id": 22942,
        "title": "Sentiment Analysis of Multilingual Tweets Based on Natural Language Processing (NLP)",
        "authors": "Abhijit Bera, Mrinal Kanti Ghose, Dibyendu Kumar Pal",
        "published": "2021-11-26",
        "citations": 8,
        "abstract": "Multilingual Sentiment analysis plays an important role in a country like India with many languages as the style of expression varies in different languages. The Indian people speak in total 22 different languages and with the help of Google Indic keyboard people can express their sentiments i.e reviews about anything in the social media in their native language from individual smart phones. It has been found that machine learning approach has overcome the limitations of other approaches. In this paper, a detailed study has been carried out based on Natural Language Processing (NLP) using Simple Neural Network (SNN) ,Convolutional Neural Network(CNN), and Long Short Term Memory (LSTM)Neural Network followed by another amalgamated model adding a CNN layer on top of the LSTM without worrying about versatility of multilingualism. Around 4000 samples of reviews in English, Hindi and in Bengali languages are considered to generate outputs for the above models and analyzed. The experimental results on these realistic reviews are found to be effective for further research work.",
        "link": "http://dx.doi.org/10.4018/ijsda.20211001.oa16"
    },
    {
        "id": 22943,
        "title": "How Emotionally Stable is ALBERT? Testing Robustness with Stochastic Weight Averaging on a Sentiment Analysis Task",
        "authors": "Urja Khurana, Eric Nalisnick, Antske Fokkens",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.eval4nlp-1.3"
    },
    {
        "id": 22944,
        "title": "A Novel, Gradient Boosting Framework for Sentiment Analysis in Languages where NLP Resources Are Not Plentiful: A Case Study for Modern Greek",
        "authors": "Vasileios Athanasiou, Manolis Maragoudakis",
        "published": "2017-3-6",
        "citations": 26,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/a10010034"
    },
    {
        "id": 22945,
        "title": "Multilingual Sentiment Analysis of YouTube Live Stream using Machine Translation and Transformer in NLP",
        "authors": "Asutosh Rath, B. Hridaya, Duggaraju Vimala, Jossy George",
        "published": "2022-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tqcebt54229.2022.10041483"
    },
    {
        "id": 22946,
        "title": "A Comparative Study of NLP and Machine Learning Techniques for Sentiment Analysis and Topic Modeling on Amazon",
        "authors": "Gina V. Acosta Gutiérrez",
        "published": "2020-4-30",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21817/ijcsenet/2020/v9i2/200902007"
    },
    {
        "id": 22947,
        "title": "NLP-LISAC at SemEval-2023 Task 12: Sentiment Analysis for Tweets expressed in African languages via Transformer-based Models",
        "authors": "Abdessamad Benlahbib, Achraf Boumhidi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.28"
    },
    {
        "id": 22948,
        "title": "Exploring the Efficacy of BERT in Bengali NLP: A Study on Sentiment Analysis and Aspect Detection",
        "authors": "Junayed Hossain, Sheikh Md. Abdullah, Mohammad Barkatullah, Md Fahad Monir",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eurocon56442.2023.10199048"
    },
    {
        "id": 22949,
        "title": "NLP based sentiment analysis for Twitter's opinion mining and visualization",
        "authors": "Maha Al-Ghalibi, Adil Al-Azzawi, Kai Lawonn",
        "published": "2019-3-15",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2522679"
    },
    {
        "id": 22950,
        "title": "Content and Sentiment Analysis of The New York Times Coronavirus (2019-nCOV) Articles with Natural Language Processing (NLP) and Leximancer",
        "authors": "Sezai Tunca, Bulent Sezen, Yavuz Selim Balcioglu",
        "published": "2023-4-23",
        "citations": 2,
        "abstract": "The purpose of this study was to prove the use of content and sentiment analysis to understand public discourse on Nytimes.com around the coronavirus (2019-nCOV) pandemic. We examined the pandemic discourses in the article contents, news, expert opinions, and statements of official institutions with natural language processing methods. We analyzed how the mainstream media (Nytimes.com) sets the community agenda. As a method, the textual data for the research were collected with the Orange3 software text-mining tool via the Nytimes.com API, and content analysis was conducted with Leximancer software. The research data were divided into three categories (first, mid, and last) based on the date ranges determined during the pandemic. Using Leximancer concept maps tools, we explained concepts and their relationships by visualizing them to show pandemic discourse. We used VADER sentiment analysis to analyze the pandemic discourse. The results gave us the distance and proximity positions of themes related to Nytimes.com pandemic discourse, revealed according to their conceptual definitions. Additionally, we compared the performance of six machine learning algorithms on the task of text classification. Considering the findings, it is possible to conclude that in Nytimes.com (2019-nCOV) discourse, some concepts have changed on a regular basis while others have remained constant. The pandemic discourse focused on specific concepts that were seen to guide human behavior and presented content that may cause anxiety to readers of Nytimes.com. The results of the sentiment analysis supported these findings. Another result was that the findings showed us that the contents of the coronavirus (2019-nCOV) articles supported official policies. It can be concluded that regarding the coronavirus (2019-nCOV), which has caused profound societal changes and has results such as death, restrictions, and mask use, the discourse did not go beyond a total of 15 main themes and about 100 concepts. The content analysis of Nytimes.com reveals that it has behavioral effects, such as causing fear and anxiety in people. Considering the media dependency of society, this result is important. It can be said that the agenda-setting of society does not go beyond the traditional discourse due to the tendency of individuals to use newspapers and news websites to obtain information.",
        "link": "http://dx.doi.org/10.3390/electronics12091964"
    },
    {
        "id": 22951,
        "title": "Bidirectional Attentional LSTM for Aspect Based Sentiment Analysis on Italian",
        "authors": "Giancarlo Nicola",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4000/books.aaccademia.4550"
    },
    {
        "id": 22952,
        "title": "Twitter Sentiment Analyser Using NLP Techniques",
        "authors": "Swarup Kumar Shaw, Vinayak Jaiswal, Sun Ghosh, Anal Acharya, Debabrata Datta",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "Twitter is a popular platform where users express their opinions on various topics, including social, political, and economic issues. By monitoring the sentiment of tweets related to a particular topic, companies or governments can identify potential problems before they escalate into full-blown crises, allowing them to take appropriate action in a timely manner. The chapter typically involves collecting a large dataset of tweets, cleaning and pre-processing the data, and then using natural language processing (NLP) and machine learning techniques to classify the sentiment of each tweet.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-0728-1.ch010"
    },
    {
        "id": 22953,
        "title": "Sentiment Analysis using NLP and Machine Learning Techniques on Social Media Data",
        "authors": "M. Kavitha, Bharat Bhushan Naib, Basetty Mallikarjuna, R. Kavitha, R. Srinivasan",
        "published": "2022-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacite53722.2022.9823708"
    },
    {
        "id": 22954,
        "title": "redBERT: A Topic Discovery and Deep Sentiment Classification Model on COVID-19 Online Discussions Using BERT NLP Model",
        "authors": "Chaitanya Pandey",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractA Natural Language Processing (NLP) method was used to uncover various issues and sentiments surrounding COVID-19 from social media and get a deeper understanding of fluctuating public opinion in situations of wide-scale panic to guide improved decision making with the help of a sentiment analyser created for the automated extraction of COVID-19 related discussions based on topic modelling. Moreover, the BERT model was used for the sentiment classification of COVID-19 Reddit comments. These findings shed light on the importance of studying trends and using computational techniques to assess human psyche in times of distress.",
        "link": "http://dx.doi.org/10.1101/2021.03.02.21252747"
    },
    {
        "id": 22955,
        "title": "Using Label Noise Filtering and Ensemble Method for Sentiment Analysis on Thai Social Data",
        "authors": "Chayanont Eamwiwat, Pongpisit Thanasutives, Chanatip Saetia, Tawunrat Chalothorn",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isai-nlp48611.2019.9045419"
    },
    {
        "id": 22956,
        "title": "SENTIMENT ANALYSIS OF STUDENTS’ FEEDBACK ON INSTITUTIONAL FACILITIES USING TEXT-BASED CLASSIFICATION AND NATURAL LANGUAGE PROCESSING (NLP)",
        "authors": "Fareed Kaleem Khaiser, Amna Saad, Cordelia Mason",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "In this study, sentiment analysis, commonly referred to as opinion mining or emotional artificial intelligence (AI), is used to obtain student comments about institutional facilities. To ascertain whether an online text has a good, negative, or neutral emotional tone, it must first be analyzed. Natural Language Processing (NLP) includes the subfield of sentiment analysis, and NLP can be used to categorize and extract information with the aid of machine learning methods. Finding out if students are content with the amenities or services provided is important since, in an educational setting, they are consumers. This study of the resources and services that the libraries offer evaluated college students' perceptions of the books, audio CDs, and video CDs, the services provided by the library staff, and the personal computers that are made available to them as part of their facilities. In the current study, surveys were carried out to gather information and assess how well the needs of the students are addressed. On Kaggle.com, secondary data from a North Indian institution was used in the experiments. The research approach was sentiment analysis using a machine learning framework. The F1-score, a harmonic mean of precision and recall based on the attitudes evaluated by the algorithms, was calculated using a text-based classification method using Naive Bayes Multinomial and Support Vector machine learning algorithms. The findings offer views on how successfully library facilities are managed in the form of student sentiments.",
        "link": "http://dx.doi.org/10.47836/jlc.10.01.06"
    },
    {
        "id": 22957,
        "title": "UCSC-NLP at SemEval-2017 Task 4: Sense n-grams for Sentiment\n            Analysis in Twitter",
        "authors": "José Abreu, Iván Castro, Claudia Martínez, Sebastián Oliva, Yoan Gutiérrez",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2136"
    },
    {
        "id": 22958,
        "title": "UBC-NLP at IEST 2018: Learning Implicit Emotion With an Ensemble of Language Models",
        "authors": "Hassan Alhuzali, Mohamed Elaraby, Muhammad Abdul-Mageed",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w18-6250"
    },
    {
        "id": 22959,
        "title": "NLP - Powered Sentiment Analysis on the Twitter",
        "authors": "Darshan, K, Jerusha Samuel, Manjunatha Swamy, Prashant Koparde, Shivashankara, N",
        "published": "2024-1-4",
        "citations": 0,
        "abstract": "The study explores Twitter Sentiment Analysis (TSA) using Natural Language Processing (NLP) to understand societal views, trends, and feelings. The research involves data collection, pre-processing, feature extraction, sentiment analysis, model construction, and visualization. The data is then processed to address issues like extraneous characters, capitalization, and data errors. Sentiment analysis categorizes tweets into positive and negative. The NLP algorithm is central to sentiment classification, and the paper builds, trains, and assesses various machine learning models. Word clouds depict sentiment distribution, identify frequently occurring phrases, and emphasize sentiment trends over time. Potential roadblocks include data quality issues, careful algorithm selection, and model dependability. The sentiment analysis model demonstrated good accuracy and a balanced F1-score, demonstrating its competency in sentiment categorization. The study contributes to the emerging discipline of sentiment analysis by demonstrating how valuable insights can be extracted from massive amounts of social media data.",
        "link": "http://dx.doi.org/10.36348/sjet.2024.v09i01.001"
    },
    {
        "id": 22960,
        "title": "A Comparative Study of Sentiment Analysis Using NLP and Different Machine Learning Techniques on US Airline Twitter Data",
        "authors": "Md Taufiqul Haque Khan Tusar, Md. Touhidul Islam",
        "published": "2021-9-14",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecit54077.2021.9641336"
    },
    {
        "id": 22961,
        "title": "Key factors in MOOC pedagogy based on NLP sentiment analysis of learner reviews: What makes a hit",
        "authors": "Lingyao Li, John Johnson, William Aarhus, Dhawal Shah",
        "published": "2022-1",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compedu.2021.104354"
    },
    {
        "id": 22962,
        "title": "Open-Source Libraries, Application Frameworks, and Workflow Systems for NLP",
        "authors": "Venkat N. Gudivada, Kamyar Arbabifard",
        "published": "2018",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/bs.host.2018.07.007"
    },
    {
        "id": 22963,
        "title": "Sentiment Analysis for Products Review based on NLP using Lexicon-Based Approach and Roberta",
        "authors": "Bobby Kumar,  Sheetal, Veena S Badiger, Anitha DSouza Jacintha",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iitcee59897.2024.10468039"
    },
    {
        "id": 22964,
        "title": "RSM-NLP at BLP-2023 Task 2: Bangla Sentiment Analysis using Weighted and Majority Voted Fine-Tuned Transformers",
        "authors": "Pratinav Seth, Rashi Goel, Komal Mathur, Swetha Vemulapalli",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.banglalp-1.40"
    },
    {
        "id": 22965,
        "title": "Sentiment Analysis of Students’ Feedback with NLP and Deep Learning: A Systematic Mapping Study",
        "authors": "Zenun Kastrati, Fisnik Dalipi, Ali Shariq Imran, Krenare Pireva Nuci, Mudasir Ahmad Wani",
        "published": "2021-4-28",
        "citations": 82,
        "abstract": "In the last decade, sentiment analysis has been widely applied in many domains, including business, social networks and education. Particularly in the education domain, where dealing with and processing students’ opinions is a complicated task due to the nature of the language used by students and the large volume of information, the application of sentiment analysis is growing yet remains challenging. Several literature reviews reveal the state of the application of sentiment analysis in this domain from different perspectives and contexts. However, the body of literature is lacking a review that systematically classifies the research and results of the application of natural language processing (NLP), deep learning (DL), and machine learning (ML) solutions for sentiment analysis in the education domain. In this article, we present the results of a systematic mapping study to structure the published information available. We used a stepwise PRISMA framework to guide the search process and searched for studies conducted between 2015 and 2020 in the electronic research databases of the scientific literature. We identified 92 relevant studies out of 612 that were initially found on the sentiment analysis of students’ feedback in learning platform environments. The mapping results showed that, despite the identified challenges, the field is rapidly growing, especially regarding the application of DL, which is the most recent trend. We identified various aspects that need to be considered in order to contribute to the maturity of research and development in the field. Among these aspects, we highlighted the need of having structured datasets, standardized solutions and increased focus on emotional expression and detection.",
        "link": "http://dx.doi.org/10.3390/app11093986"
    },
    {
        "id": 22966,
        "title": "Twitter sentiment classification using stanford NLP",
        "authors": "Shital Anil Phand, Jeevan Anil Phand",
        "published": "2017-10",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icisim.2017.8122138"
    },
    {
        "id": 22967,
        "title": "Sentiment analysis on E-commerce reviews and ratings using ML &amp; NLP models to understand consumer behavior",
        "authors": "Priyanshi Kathuria, Parth Sethi, Rithwick Negi",
        "published": "2022-12-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmacc54824.2022.10093674"
    },
    {
        "id": 22968,
        "title": "Aspect-based sentiment analysis for social media text using NLP and Deep Learning",
        "authors": "Anuradha N. Nawathe, Avinash S. Kapse, V.M. Thakare, Arvind S. Kapse",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaeeci58247.2023.10370825"
    },
    {
        "id": 22969,
        "title": "Rewinding the Sentiment",
        "authors": "Fayçal Falaky",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003170624-2"
    },
    {
        "id": 22970,
        "title": "Sentiment Analysis Through Fourier Transform Techniques in NLP",
        "authors": "Anuraj Singh, Kaustubh Pathak",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-9225-4_37"
    }
]