[
    {
        "id": 15905,
        "title": "An Optimal Solution to the Overfitting and Underfitting Problem of Healthcare Machine Learning Models",
        "authors": "Anil Kumar Prajapati Anil, Umesh Kumar Singh",
        "published": "2023-10-3",
        "citations": 2,
        "abstract": "In the current technological era, artificial intelligence is becoming increasingly popular.  Machine learning, as the branch of AI is taking charge in every field such as healthcare, the Stock market, Automation, Robotics, Image Processing, and so on. In the current scenario, machine learning and/or deep learning are becoming very popular in medical science for disease prediction. Much research is underway in the form of disease prediction models by machine learning. To ensure the performance and accuracy of the machine learning model, it is important to keep some basic things in mind during training. The machine learning model has several issues which must be rectified duration of the training of the model so that the learning model works efficiently such as model selection, parameter tuning, dataset splitting, cross-validation, bias-variance tradeoff, overfitting, underfitting, and so on. Under- and over-fitting are the two main issues that affect machine learning models. This research paper mainly focuses on minimizing and/or preventing the problem of overfitting and underfitting machine learning models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29207/joseit.v2i2.5460"
    },
    {
        "id": 15906,
        "title": "Development of Overfitting and Underfitting Education Program for the Expanded Exploration of Machine Learning",
        "authors": "Yuri Hwang,  , Namje Park",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14352/jkaie.2023.27.2.107"
    },
    {
        "id": 15907,
        "title": "A Dropout Optimization Algorithm to Prevent Overfitting in Machine Learning",
        "authors": "",
        "published": "2023-3-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040103"
    },
    {
        "id": 15908,
        "title": "ANALISA TERJADINYA OVERFITTING DAN UNDERFITTING PADA ALGORITMA NAIVE BAYES DAN DECISION TREE DENGAN TEKNIK CROSS VALIDATION",
        "authors": "Wildan Attariq Firmansyach, Umi Hayati, Yudhistira Arie Wijaya",
        "published": "2023-2-26",
        "citations": 0,
        "abstract": "Perkembangan digital dapat meringankan aktivitas manusia dalam menggunakan, serta mengelola informasi. Suatu informasi berdasarkan kumpulan data dengan dilakukannya proses data mining. Banyak masalah yang terjadi pada data mining dikarenakan hasil yang diperoleh dipengaruhi oleh adanya ketidak seimbangan data sehingga terjadinya overfitting dan underfitting biasanya disebabkan oleh data yang berlebihan atau data yang kurang sehingga model yang dihasilkan tidak dapat menangkap pola dari data yang digunakan. Tujuan dari penelitian ini mendapatkan hasil akurasi terbaik melalui perbandingan yang diperoleh supaya tidak terjadinya overfitting dan underfitting dalam hasil akurasi, untuk mengimplementasikan hasil akurasi darimachine learning meningkatkan kepastian dan menunjukan hasil keputusan, menggunakan data sampel Status Kelulusan Siswa SMA Jurusan IPA Jalur SNMPTN Di Indonesia yang dihimpun dari periode tahun 2022, data berjumlah 4.030 data dan 10 atribut. Metode yang digunakan untuk mendapatkan hasil evaluasi terbaik menggunakan algoritma Naïve Bayes dan Decision Tree dengan teknik Cross Validation. Hasil dari penelitian ini yaitu algoritma Naive Bayes mendapatkan skor akurasi sebesar 63%, serta algoritma Decision Tree mendapatkan skor akurasi sebesar 96%, dengan hasil skor akurasi yang diperoleh algoritma terbaik yaitu Decision Tree dengan menggunakan teknikValidasi silang.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i1.6329"
    },
    {
        "id": 15909,
        "title": "Dealing with Overfitting in the Context of Liveness Detection Using FeatherNets with RGB Images",
        "authors": "Miguel Leão, Nuno Gonçalves",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011639600003411"
    },
    {
        "id": 15910,
        "title": "Generalization despite overfitting in quantum machine learning models",
        "authors": "Evan Peters, Maria Schuld",
        "published": "2023-12-20",
        "citations": 3,
        "abstract": "The widespread success of deep neural networks has revealed a surprise in classical machine learning: very complex models often generalize well while simultaneously overfitting training data. This phenomenon of benign overfitting has been studied for a variety of classical models with the goal of better understanding the mechanisms behind deep learning. Characterizing the phenomenon in the context of quantum machine learning might similarly improve our understanding of the relationship between overfitting, overparameterization, and generalization. In this work, we provide a characterization of benign overfitting in quantum models. To do this, we derive the behavior of a classical interpolating Fourier features models for regression on noisy signals, and show how a class of quantum models exhibits analogous features, thereby linking the structure of quantum circuits (such as data-encoding and state preparation operations) to overparameterization and overfitting in quantum models. We intuitively explain these features according to the ability of the quantum model to interpolate noisy data with locally \"spiky\" behavior and provide a concrete demonstration example of benign overfitting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-12-20-1210"
    },
    {
        "id": 15911,
        "title": "Analysis of Underfitting and Overfitting in U-Net Semantic Segmentation for Lung Nodule Identification from X-ray Radiographs",
        "authors": "Tehreem Awan, Khan Bahadar Khan",
        "published": "2023-1-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icest56843.2023.10138850"
    },
    {
        "id": 15912,
        "title": "Less is More? Reducing Biases and Overfitting in Machine Learning Return Predictions",
        "authors": "Clint Howard",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4497739"
    },
    {
        "id": 15913,
        "title": "Overfitting Identification in Machine Learning Models with the Person-Fit Indicator",
        "authors": "Ruihang He, Yongze Xu",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icceic60201.2023.10426639"
    },
    {
        "id": 15914,
        "title": "DEEP LEARNING ENCODED ECG - AVOIDING OVERFITTING IN ECG MACHINE LEARNING",
        "authors": "Christopher Harvey, Amit Noheria",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0735-1097(24)02162-4"
    },
    {
        "id": 15915,
        "title": "Study of Overfitting by Machine Learning Methods Using Generalization Equations",
        "authors": "Nageswara S. V. Rao",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/fusion52260.2023.10224198"
    },
    {
        "id": 15916,
        "title": "Dealing with Negative Samples with Multi-Task Learning on Span-Based Joint Entity-Relation Extraction",
        "authors": "Jiamin Lu, Chenguang Xue",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Recent span-based joint extraction models have demonstrated significant advantages in both entity recognition and relation extraction. These models treat text spans as candidate entities, and span pairs as candidate relationship tuples, achieving state-of-the-art results on datasets like ADE. However, these models encounter a significant number of non-entity spans or irrelevant span pairs during the tasks, impairing model performance significantly. To address this issue, this paper introduces a span-based multitask entity-relation joint extraction model. This approach employs the multitask learning to alleviate the impact of negative samples on entity and relation classifiers. Additionally, we leverage the Intersection over Union(IoU) concept to introduce the positional information into the entity classifier, achieving a span boundary detection. Furthermore, by incorporating the entity Logits predicted by the entity classifier into the embedded representation of entity pairs, the semantic input for the relation classifier is enriched. Experimental results demonstrate that our proposed SpERT.MT model can effectively mitigate the adverse effects of excessive negative samples on the model performance. Furthermore, the model demonstrated commendable F1 scores of 73.61%, 53.72%, and 83.72% on three widely employed public datasets, namely CoNLL04, SciERC, and ADE, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131604"
    },
    {
        "id": 15917,
        "title": "Detecting Overfitting of Machine Learning Techniques for Automatic Vulnerability Detection",
        "authors": "Niklas Risse",
        "published": "2023-11-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3611643.3617845"
    },
    {
        "id": 15918,
        "title": "A comparison of machine learning and statistical species distribution models: Quantifying overfitting supports model interpretation",
        "authors": "Emma Chollet Ramampiandra, Andreas Scheidegger, Jonas Wydler, Nele Schuwirth",
        "published": "2023-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecolmodel.2023.110353"
    },
    {
        "id": 15919,
        "title": "Hybrid Machine Learning-Based Approaches for Feature and Overfitting Reduction to Model Intrusion Patterns",
        "authors": "Fatemeh Ahmadi Abkenari, Amin Milani Fard, Sara Khanchi",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "An intrusion detection system (IDS), whether as a device or software-based agent, plays a significant role in networks and systems security by continuously monitoring traffic behaviour to detect malicious activities. The literature includes IDSs that leverage models trained to detect known attack behaviours. However, such models suffer from low accuracy or high overfitting. This work aims to enhance the performance of the IDS by making a model based on the observed traffic via applying different single and ensemble classifiers and lowering the classifier’s overfitting on a reduced set of features. We implement various feature reduction techniques, including Linear Regression, LASSO, Random Forest, Boruta, and autoencoders on the CSE-CIC-IDS2018 dataset to provide a training set for classifiers, including Decision Tree, Naïve Bayes, neural networks, Random Forest, and XGBoost. Our experiments show that the Decision Tree classifier on autoencoders-based reduced sets of features yields the lowest overfitting among other combinations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jcp3030026"
    },
    {
        "id": 15920,
        "title": "Backtest Overfitting in the Machine Learning Era: A Comparison of Out-of-Sample Testing Methods in a Synthetic Controlled Environment",
        "authors": "Hamid R. Arian, Daniel Norouzi Mobarekeh, Luis A. Seco",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4686376"
    },
    {
        "id": 15921,
        "title": "Comparative analysis of machine learning techniques for credit card fraud detection: Dealing with imbalanced datasets",
        "authors": "Vahid Sinap",
        "published": "2023-12-3",
        "citations": 0,
        "abstract": "The main objective of this research is to evaluate the performance of machine learning algorithms in the field of credit card fraud detection and then compare them according to various performance metrics. Seven different supervised classification algorithms including Logistic Regression, Decision Trees, Random Forest, XGBoost, Naive Bayes, K-Nearest Neighbors and Support Vector Machine were used. The performance of these algorithms was measured through a comprehensive evaluation of metrics including Accuracy, Precision, Recall, F-Score, AUC and AUPRC values. Furthermore, ROC curves and confusion matrices were used to evaluate these algorithms. The data preparation phase is critical in this study. The data imbalance problem arises as an unequal distribution between fraudulent and non-fraudulent transactions. Addressing this imbalance is imperative for successful model training and subsequent reliable results. Various techniques, such as Scaling and Distribution, Random Under-Sampling, Dimensionality Reduction, and Clustering, are employed to ensure an accurate evaluation of model performance and its ability to generalize effectively. As a result, the \"Random Forest\" and \"K-Nearest Neighbors\" algorithms exhibit the highest performance levels in this research with 97% accuracy rates. This study contributes significantly to the ongoing fight against financial fraud and provides valuable guidance for future research efforts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31127/tuje.1386127"
    },
    {
        "id": 15922,
        "title": "Using Ultrasound Image Augmentation and Ensemble Predictions to Prevent Machine-Learning Model Overfitting",
        "authors": "Eric J. Snider, Sofia I. Hernandez-Torres, Ryan Hennessey",
        "published": "2023-1-23",
        "citations": 5,
        "abstract": "Deep learning predictive models have the potential to simplify and automate medical imaging diagnostics by lowering the skill threshold for image interpretation. However, this requires predictive models that are generalized to handle subject variability as seen clinically. Here, we highlight methods to improve test accuracy of an image classifier model for shrapnel identification using tissue phantom image sets. Using a previously developed image classifier neural network—termed ShrapML—blind test accuracy was less than 70% and was variable depending on the training/test data setup, as determined by a leave one subject out (LOSO) holdout methodology. Introduction of affine transformations for image augmentation or MixUp methodologies to generate additional training sets improved model performance and overall accuracy improved to 75%. Further improvements were made by aggregating predictions across five LOSO holdouts. This was done by bagging confidences or predictions from all LOSOs or the top-3 LOSO confidence models for each image prediction. Top-3 LOSO confidence bagging performed best, with test accuracy improved to greater than 85% accuracy for two different blind tissue phantoms. This was confirmed by gradient-weighted class activation mapping to highlight that the image classifier was tracking shrapnel in the image sets. Overall, data augmentation and ensemble prediction approaches were suitable for creating more generalized predictive models for ultrasound image analysis, a critical step for real-time diagnostic deployment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13030417"
    },
    {
        "id": 15923,
        "title": "Mitigating Overfitting in Extreme Learning Machine Classifier Through Dropout Regularization",
        "authors": " Fateh Alrahman Kamal Qasem Alnagashi,  Norasmadi Abdul Rahim,  Shazmin Aniza Abdul Shukor,  Mohamad Hanif Ab. Hamid",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Achieving optimal machine learning model performance is often hindered by the limited availability of diverse datasets, a challenge exacerbated by small sample sizes in real-world scenarios. In this study, we address this critical issue in classification tasks by integrating the Dropout technique into the Extreme Learning Machine (ELM) classifier. Our research underscores the effectiveness of Dropout-ELM in mitigating overfitting, especially when data is scarce, leading to enhanced generalization capabilities. Through extensive experiments on synthetic and real-world datasets, our findings consistently demonstrate that Dropout-ELM outperforms traditional ELM, yielding significant accuracy improvements ranging from 0.19% to 16.20%. By strategically implementing dropout during training, we promote the development of robust models that reduce reliance on specific features or neurons, resulting in increased adaptability and resilience across diverse datasets. Ultimately, Dropout-ELM emerges as a potent tool to counter overfitting and bolster the performance of ELM-based classifiers, particularly in scenarios with limited data. Its established efficacy positions it as a valuable asset for enhancing the reliability and generalization of machine learning models, providing a robust solution to the challenges posed by constrained training data. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.58915/amci.v13ino.1.561"
    },
    {
        "id": 15924,
        "title": "Biquality learning: a framework to design algorithms dealing with closed-set distribution shifts",
        "authors": "Pierre Nodet, Vincent Lemaire, Alexis Bondu, Antoine Cornuéjols",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06372-3"
    },
    {
        "id": 15925,
        "title": "Green Attack or Overfitting? Comparing Machine-Learning- and Vegetation-Index-Based Methods to Early Detect European Spruce Bark Beetle Attacks Using Multispectral Drone Images",
        "authors": "Langning Huo, Henrik Jan Persson, Jonas Bohlin, Eva Lindberg",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282624"
    },
    {
        "id": 15926,
        "title": "Dealing with Explainability Requirements for Machine Learning Systems",
        "authors": "Tong Li, Lu Han",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00182"
    },
    {
        "id": 15927,
        "title": "Dealing with disruptions in railway track inspection using risk-based machine learning",
        "authors": "Sakdirat Kaewunruen, Mohd Haniff Osman",
        "published": "2023-2-7",
        "citations": 4,
        "abstract": "AbstractUnplanned track inspections can be a direct consequence of any disruption to the operation of on-board track geometry monitoring activities. A novel response strategy to enhance the value of the information for supplementary track measurements is thus established to construct a data generation model. In this model, artificial (synthetic) data is assigned on each measurement point along the affected track segment over a short period of time. To effectively generate artificial track measurement data, this study proposes a NARX (nonlinear autoregressive with exogenous variables) model, which incorporates short-range memory dependencies in the dependent variable and integrates interdependent effects from external factors. Nonlinearities in the proposed model have been determined using an artificial neural network that allowed fast computation of a mapping function in line with the needs of effective disruption management. The risk of over fitting the data generation model, which reflected its generalisation ability, has been effectively managed through risk aversion concept. For the model evaluation, the deviation of track longitudinal level has been taken as a case study, predicted using its degradation rate and track alignment and gauge as exogenous variables. Simulation results on two datasets that are statistically different showed that the data generation model for disrupted track measurements is reliable, accurate, and easy-to-use. This novel model is an essential breakthrough in railway track integrity prediction and resilient operation management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-28866-9"
    },
    {
        "id": 15928,
        "title": "Toward Generalizable Machine Learning Models in Speech, Language, and Hearing Sciences: Estimating Sample Size and Reducing Overfitting",
        "authors": "Hamzeh Ghasemzadeh, Robert E. Hillman, Daryush D. Mehta",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "\nPurpose:\n\n              Many studies using machine learning (ML) in speech, language, and hearing sciences rely upon cross-validations with single data splitting. This study's first purpose is to provide quantitative evidence that would incentivize researchers to instead use the more robust data splitting method of nested\n              k\n              -fold cross-validation. The second purpose is to present methods and MATLAB code to perform power analysis for ML-based analysis during the design of a study.\n            \n\n\nMethod:\nFirst, the significant impact of different cross-validations on ML outcomes was demonstrated using real-world clinical data. Then, Monte Carlo simulations were used to quantify the interactions among the employed cross-validation method, the discriminative power of features, the dimensionality of the feature space, the dimensionality of the model, and the sample size. Four different cross-validation methods (single holdout, 10-fold, train–validation–test, and nested 10-fold) were compared based on the statistical power and confidence of the resulting ML models. Distributions of the null and alternative hypotheses were used to determine the minimum required sample size for obtaining a statistically significant outcome (5% significance) with 80% power. Statistical confidence of the model was defined as the probability of correct features being selected for inclusion in the final model.\n\n\nResults:\n\n              ML models generated based on the single holdout method had very low statistical power and confidence, leading to overestimation of classification accuracy. Conversely, the nested 10-fold cross-validation method resulted in the highest statistical confidence and power while also providing an unbiased estimate of accuracy. The required sample size using the single holdout method could be 50% higher than what would be needed if nested\n              k\n              -fold cross-validation were used. Statistical confidence in the model based on nested\n              k\n              -fold cross-validation was as much as four times higher than the confidence obtained with the single holdout–based model. A computational model, MATLAB code, and lookup tables are provided to assist researchers with estimating the minimum sample size needed during study design.\n            \n\n\nConclusion:\n\n              The adoption of nested\n              k\n              -fold cross-validation is critical for unbiased and robust ML studies in the speech, language, and hearing sciences.\n            \n\n\nSupplemental Material:\n\nhttps://doi.org/10.23641/asha.25237045\n\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1044/2023_jslhr-23-00273"
    },
    {
        "id": 15929,
        "title": "Effect of Drop and Rebuilt Operator for Solving the Biobjective Obnoxious p-algorithm for dealing with a special case related to p-Median Problem",
        "authors": "",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2023.13.1.1123"
    },
    {
        "id": 15930,
        "title": "Fight Fire with Fire: Detecting Forest Fires with Embedded Machine Learning Models Dealing with Audio and Images on Low Power IoT Devices",
        "authors": "Giacomo Peruzzi, Alessandro Pozzebon, Mattia Van Der Meer",
        "published": "2023-1-10",
        "citations": 19,
        "abstract": "Forest fires are the main cause of desertification, and they have a disastrous impact on agricultural and forest ecosystems. Modern fire detection and warning systems rely on several techniques: satellite monitoring, sensor networks, image processing, data fusion, etc. Recently, Artificial Intelligence (AI) algorithms have been applied to fire recognition systems, enhancing their efficiency and reliability. However, these devices usually need constant data transmission along with a proper amount of computing power, entailing high costs and energy consumption. This paper presents the prototype of a Video Surveillance Unit (VSU) for recognising and signalling the presence of forest fires by exploiting two embedded Machine Learning (ML) algorithms running on a low power device. The ML models take audio samples and images as their respective inputs, allowing for timely fire detection. The main result is that while the performances of the two models are comparable when they work independently, their joint usage according to the proposed methodology provides a higher accuracy, precision, recall and F1 score (96.15%, 92.30%, 100.00%, and 96.00%, respectively). Eventually, each event is remotely signalled by making use of the Long Range Wide Area Network (LoRaWAN) protocol to ensure that the personnel in charge are able to operate promptly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23020783"
    },
    {
        "id": 15931,
        "title": "Exploring Methods for Dealing with Class Imbalances in Supervised Machine Learning Structured Datasets",
        "authors": "Vikas Khullar, Mohit Angurala, Kiran Deep Singh, P Prasant, Varinder Pabbi, Veeramanickam M.R. M",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access57397.2023.10199296"
    },
    {
        "id": 15932,
        "title": "Empirical Study of Overfitting in Deep Learning for Predicting Breast Cancer Metastasis",
        "authors": "Chuhan Xu, Pablo Coen-Pirani, Xia Jiang",
        "published": "2023-3-25",
        "citations": 4,
        "abstract": "Overfitting may affect the accuracy of predicting future data because of weakened generalization. In this research, we used an electronic health records (EHR) dataset concerning breast cancer metastasis to study the overfitting of deep feedforward neural networks (FNNs) prediction models. We studied how each hyperparameter and some of the interesting pairs of hyperparameters were interacting to influence the model performance and overfitting. The 11 hyperparameters we studied were activate function, weight initializer, number of hidden layers, learning rate, momentum, decay, dropout rate, batch size, epochs, L1, and L2. Our results show that most of the single hyperparameters are either negatively or positively corrected with model prediction performance and overfitting. In particular, we found that overfitting overall tends to negatively correlate with learning rate, decay, batch size, and L2, but tends to positively correlate with momentum, epochs, and L1. According to our results, learning rate, decay, and batch size may have a more significant impact on both overfitting and prediction performance than most of the other hyperparameters, including L1, L2, and dropout rate, which were designed for minimizing overfitting. We also find some interesting interacting pairs of hyperparameters such as learning rate and momentum, learning rate and decay, and batch size and epochs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/cancers15071969"
    },
    {
        "id": 15933,
        "title": "Rethinking Overfitting of Multiple Instance Learning for Whole Slide Image Classification",
        "authors": "Hongjian Song, Jie Tang, Hongzhao Xiao, Juncheng Hu",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00100"
    },
    {
        "id": 15934,
        "title": "Dealing With Missing, Imbalanced, and Sparse Features During the Development of a Prediction Model for Sudden Death Using Emergency Medicine Data: Machine Learning Approach",
        "authors": "Xiaojie Chen, Han Chen, Shan Nan, Xiangtian Kong, Huilong Duan, Haiyan Zhu",
        "published": "2023-1-20",
        "citations": 3,
        "abstract": "\nBackground\nIn emergency departments (EDs), early diagnosis and timely rescue, which are supported by prediction modes using ED data, can increase patients’ chances of survival. Unfortunately, ED data usually contain missing, imbalanced, and sparse features, which makes it challenging to build early identification models for diseases.\n\n\nObjective\nThis study aims to propose a systematic approach to deal with the problems of missing, imbalanced, and sparse features for developing sudden-death prediction models using emergency medicine (or ED) data.\n\n\nMethods\nWe proposed a 3-step approach to deal with data quality issues: a random forest (RF) for missing values, k-means for imbalanced data, and principal component analysis (PCA) for sparse features. For continuous and discrete variables, the decision coefficient R2 and the κ coefficient were used to evaluate performance, respectively. The area under the receiver operating characteristic curve (AUROC) and the area under the precision-recall curve (AUPRC) were used to estimate the model’s performance. To further evaluate the proposed approach, we carried out a case study using an ED data set obtained from the Hainan Hospital of Chinese PLA General Hospital. A logistic regression (LR) prediction model for patient condition worsening was built.\n\n\nResults\nA total of 1085 patients with rescue records and 17,959 patients without rescue records were selected and significantly imbalanced. We extracted 275, 402, and 891 variables from laboratory tests, medications, and diagnosis, respectively. After data preprocessing, the median R2 of the RF continuous variable interpolation was 0.623 (IQR 0.647), and the median of the κ coefficient for discrete variable interpolation was 0.444 (IQR 0.285). The LR model constructed using the initial diagnostic data showed poor performance and variable separation, which was reflected in the abnormally high odds ratio (OR) values of the 2 variables of cardiac arrest and respiratory arrest (201568034532 and 1211118945, respectively) and an abnormal 95% CI. Using processed data, the recall of the model reached 0.746, the F1-score was 0.73, and the AUROC was 0.708.\n\n\nConclusions\nThe proposed systematic approach is valid for building a prediction model for emergency patients.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/38590"
    },
    {
        "id": 15935,
        "title": "Training flexibility in dealing with additive situations",
        "authors": "Laura Gabler, Stefan Ufer",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.learninstruc.2024.101902"
    },
    {
        "id": 15936,
        "title": "Federated Machine Learning for Systems Medicine",
        "authors": "Richard Röttger",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14293/gof.23.06"
    },
    {
        "id": 15937,
        "title": "Review on Machine Learning Strategies for Real-World Engineering Applications",
        "authors": "Abdulazeez Alsajri",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "As we enter the Industry 5.0 era, enormous volumes of data are being created across digital systems. Machine learning techniques have recently achieved immense success in areas such as intelligent control, decision-making, speech recognition, natural language processing, computer graphics, and computer vision. This despite the significant challenge of analyzing and interpreting massive datasets. Owing to their strong performance, deep learning and machine learning algorithms have become widely deployed across various real-time engineering applications. Developing working knowledge of machine learning is now critical for building automated, smart systems that can process data in domains like healthcare, cybersecurity, and intelligent transportation. There exist multiple strategies in machine learning, including reinforcement learning, semi-supervised learning, unsupervised learning, and supervised learning algorithms. This research provides a comprehensive examination of leveraging machine learning for managing real-time engineering systems, with the goal of augmenting their capabilities and intelligence. It contributes to the understanding of how different machine learning approaches can be applied in real-world use cases like cybersecurity, healthcare, and intelligent transportation. Additionally, it highlights ongoing research objectives and difficulties that machine learning techniques encounter while tackling real-world systems. This research serves both industry professionals and academics as a reference, while technically benchmarking decision-making across different application areas and real-world scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2023/001"
    },
    {
        "id": 15938,
        "title": "A study of dealing class imbalance problem with machine learning methods for code smell severity detection using PCA-based feature selection technique",
        "authors": "Rajwant Singh Rao, Seema Dewangan, Alok Mishra, Manjari Gupta",
        "published": "2023-9-27",
        "citations": 3,
        "abstract": "AbstractDetecting code smells may be highly helpful for reducing maintenance costs and raising source code quality. Code smells facilitate developers or researchers to understand several types of design flaws. Code smells with high severity can cause significant problems for the software and may cause challenges for the system's maintainability. It is quite essential to assess the severity of the code smells detected in software, as it prioritizes refactoring efforts. The class imbalance problem also further enhances the difficulties in code smell severity detection. In this study, four code smell severity datasets (Data class, God class, Feature envy, and Long method) are selected to detect code smell severity. In this work, an effort is made to address the issue of class imbalance, for which, the Synthetic Minority Oversampling Technique (SMOTE) class balancing technique is applied. Each dataset's relevant features are chosen using a feature selection technique based on principal component analysis. The severity of code smells is determined using five machine learning techniques: K-nearest neighbor, Random forest, Decision tree, Multi-layer Perceptron, and Logistic Regression. This study obtained the 0.99 severity accuracy score with the Random forest and Decision tree approach with the Long method code smell. The model's performance is compared based on its accuracy and three other performance measurements (Precision, Recall, and F-measure) to estimate severity classification models. The impact of performance is also compared and presented with and without applying SMOTE. The results obtained in the study are promising and can be beneficial for paving the way for further studies in this area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-43380-8"
    },
    {
        "id": 15939,
        "title": "Reduction of overfitting on the highly imbalanced ISIC-2019 skin dataset using deep learning frameworks",
        "authors": "Erapaneni Gayatri, S.L. Aarthy",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "BACKGROUND: With the rapid growth of Deep Neural Networks (DNN) and Computer-Aided Diagnosis (CAD), more significant works have been analysed for cancer related diseases. Skin cancer is the most hazardous type of cancer that cannot be diagnosed in the early stages. OBJECTIVE: The diagnosis of skin cancer is becoming a challenge to dermatologists as an abnormal lesion looks like an ordinary nevus at the initial stages. Therefore, early identification of lesions (origin of skin cancer) is essential and helpful for treating skin cancer patients effectively. The enormous development of automated skin cancer diagnosis systems significantly supports dermatologists. METHODS: This paper performs a classification of skin cancer by utilising various deep-learning frameworks after resolving the class Imbalance problem in the ISIC-2019 dataset. A fine-tuned ResNet-50 model is used to evaluate the performance of original data, augmented data, and after by adding the focal loss. Focal loss is the best technique to solve overfitting problems by assigning weights to hard misclassified images. RESULTS: Finally, augmented data with focal loss is given a good classification performance with 98.85% accuracy, 95.52% precision, and 95.93% recall. Matthews Correlation coefficient (MCC) is the best metric to evaluate the quality of multi-class images. It has given outstanding performance by using augmented data and focal loss.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/xst-230204"
    },
    {
        "id": 15940,
        "title": "Learning sparse features can lead to overfitting in neural networks\n                  <sup>*</sup>",
        "authors": "Leonardo Petrini, Francesco Cagnetta, Eric Vanden-Eijnden, Matthieu Wyart",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nIt is widely believed that the success of deep networks lies in their ability to learn a meaningful representation of the features of the data. Yet, understanding when and how this feature learning improves performance remains a challenge. For example, it is beneficial for modern architectures to be trained to classify images, whereas it is detrimental for fully-connected networks to be trained on the same data. Here, we propose an explanation for this puzzle, by showing that feature learning can perform worse than lazy training (via the random feature kernel or the neural tangent kernel) as the former can lead to a sparser neural representation. Although sparsity is known to be essential for learning anisotropic data, it is detrimental when the target function is constant or smooth along certain directions of the input space. We illustrate this phenomenon in two settings: (i) regression of Gaussian random functions on the d-dimensional unit sphere and (ii) classification of benchmark data sets of images. For (i), we compute the scaling of the generalization error with the number of training points and show that methods that do not learn features generalize better, even when the dimension of the input space is large. For (ii), we show empirically that learning features can indeed lead to sparse and thereby less smooth representations of the image predictors. This fact is plausibly responsible for deteriorating the performance, which is known to be correlated with smoothness along diffeomorphisms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-5468/ad01b9"
    },
    {
        "id": 15941,
        "title": "Efficient machine learning-assisted failure analysis method for circuit-level defect prediction",
        "authors": "Joydeep Ghosh",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100537"
    },
    {
        "id": 15942,
        "title": "A machine learning approach for hierarchical classification of software requirements",
        "authors": "Manal Binkhonain, Liping Zhao",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100457"
    },
    {
        "id": 15943,
        "title": "Machine learning for an explainable cost prediction of medical insurance",
        "authors": "Ugochukwu Orji, Elochukwu Ukwandu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100516"
    },
    {
        "id": 15944,
        "title": "Using machine learning for detecting liquidity risk in banks",
        "authors": "Rweyemamu Ignatius Barongo, Jimmy Tibangayuka Mbelwa",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100511"
    },
    {
        "id": 15945,
        "title": "Machine Learning Operations for Accelerator Control",
        "authors": "Tia Miceli",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1973632"
    },
    {
        "id": 15946,
        "title": "Reducing MEG interference using machine learning",
        "authors": "Sammi Hamdan, Kyle DuBray, Jordan Treutel, Rajendra Paudyal, Khem Poudel",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100462"
    },
    {
        "id": 15947,
        "title": "Editorial: Welcome to APL Machine Learning",
        "authors": "Adnan Mehonic",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0143646"
    },
    {
        "id": 15948,
        "title": "Interpretable trading pattern designed for machine learning applications",
        "authors": "Artur Sokolovsky, Luca Arnaboldi, Jaume Bacardit, Thomas Gross",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100448"
    },
    {
        "id": 15949,
        "title": "Erratum to “New interpretation of GNRVⓇ knee arthrometer results for ACL injury diagnosis support using machine learning” [Machine Learning with Applications 13 (2023) 100480]",
        "authors": "Jean Mouchotte, Matthieu LeBerre, Théo Cojean, Henri Robert",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100540"
    },
    {
        "id": 15950,
        "title": "Spam detection for Youtube video comments using machine learning approaches",
        "authors": "Andrew S. Xiao, Qilian Liang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100550"
    },
    {
        "id": 15951,
        "title": "Intrusion Detection System Based on Machine Learning Algorithms:( SVM and Genetic Algorithm)",
        "authors": "Abdulazeez Alsajri, Amani Steiti",
        "published": "2023-1-18",
        "citations": 0,
        "abstract": "The widespread utilization of the internet and computer systems has resulted in notable security concerns, characterized by a surge in intrusions and vulnerabilities. Malicious users manipulate internal systems, resulting in the exploitation of software flaws and default setups.   With the integration of the internet into society, there is an emergence of new risks such as viruses and worms, which highlights the importance of implementing robust security measures.   Intrusion detection systems (IDS) are security technologies utilized to monitor and analyze network traffic or system activity with the purpose of identifying hostile behavior.   This article presents a proposed method for detecting intrusion in network traffic using a hybrid approach, which combines a genetic algorithm and an SVM algorithm.   The model underwent training and testing on the KDDCup99 dataset, with a reduction in features from 42 to 29 using the hybrid approach.   The results demonstrated that throughout the system testing, it exhibited a remarkable accuracy of 0.999. Additionally, it achieved a true positive value of 0.9987 and a false negative rate of 0.012.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2024/002"
    },
    {
        "id": 15952,
        "title": "Predictive Analysis of NBA Game Outcomes through Machine Learning",
        "authors": "Junwen Wang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3635638.3635646"
    },
    {
        "id": 15953,
        "title": "Overfitting in Portfolio Optimization",
        "authors": "Matteo Maggiolo, Oleg Szehr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4483959"
    },
    {
        "id": 15954,
        "title": "Acknowledgment to the Reviewers of Machine Learning and Knowledge Extraction in 2022",
        "authors": " ",
        "published": "2023-1-18",
        "citations": 0,
        "abstract": "High-quality academic publishing is built on rigorous peer review [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5010011"
    },
    {
        "id": 15955,
        "title": "Machine learning for sports betting: Should model selection be based on accuracy or calibration?",
        "authors": "Conor Walsh, Alok Joshi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100539"
    },
    {
        "id": 15956,
        "title": "Higgs event classification using Machine Learning",
        "authors": "Mysha Khan, Pushpa Bhat",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1997111"
    },
    {
        "id": 15957,
        "title": "Less Is More: Reducing Overfitting in Deep Learning for EEG Classification",
        "authors": "Songchi Zhou, Shijia Geng, Jun Li, Deyun Zhang, Ziqian Xie, Chuandong Cheng, Shenda Hong",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22489/cinc.2023.183"
    },
    {
        "id": 15958,
        "title": "Mitigating Data Variability and Overfitting in Deep Learning\nModels for Atrial Fibrillation Detection Using Single-Lead\nECGs",
        "authors": "Khadidja Benchaira, Salim Bitam, Zineb Djihane Agli",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12785/ijcds/1501120"
    },
    {
        "id": 15959,
        "title": "Predicting firm performance and size using machine learning with a Bayesian perspective",
        "authors": "Debdatta Saha, Timothy M. Young, Jessica Thacker",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100453"
    },
    {
        "id": 15960,
        "title": "Detecting Relevant Information in High- Volume Chat Logs: Keyphrase Extraction for Grooming and Drug Dealing Forensic Analysis",
        "authors": "Jeovane Honório Alves, Horácio A. C. G. Pedroso, Rafael Honorio Venetikides, Joel E. M. Köster, Luiz Rodrigo Grochocki, Cinthia O. A. Freitas, Jean Paul Barddal",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00299"
    },
    {
        "id": 15961,
        "title": "Research on Diabetes Prediction Based on Machine Learning",
        "authors": "Kaina Zhao, Zhiping Wang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3635638.3635643"
    },
    {
        "id": 15962,
        "title": "Causal Fairness Analysis: A Causal Toolkit for Fair Machine Learning",
        "authors": "Drago Plečko, Elias Bareinboim",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/2200000106"
    },
    {
        "id": 15963,
        "title": "Overfitting-avoiding goal-guided exploration for hard-exploration multi-goal reinforcement learning",
        "authors": "Changlin Han, Zhiyong Peng, Yadong Liu, Jingsheng Tang, Yang Yu, Zongtan Zhou",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.01.016"
    },
    {
        "id": 15964,
        "title": "AutonoML: Towards an Integrated Framework for Autonomous Machine Learning",
        "authors": "David Jacob Kedziora, Katarzyna Musial, Bogdan Gabrys",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/2200000093"
    },
    {
        "id": 15965,
        "title": "Proceedings of 2023 International Conference on Machine Learning and Cybernetics",
        "authors": "",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlc58545.2023.10328008"
    },
    {
        "id": 15966,
        "title": "Extremely randomised trees machine learning model for electricity theft detection",
        "authors": "Stanley Yaw Appiah, Emmanuel Kofi Akowuah, Valentine Chibueze Ikpo, Albert Dede",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100458"
    },
    {
        "id": 15967,
        "title": "Automatic Text Classification Model Based on Machine Learning",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040106"
    },
    {
        "id": 15968,
        "title": "Reviews research on applying machine learning techniques to reduce false positives for network intrusion detection systems",
        "authors": "Kavita Rajora, Nazar salih Abdulhussein",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "High false positive rates impede the adoption of anomaly detection methods, which have promise for detecting novel cyber threats. Techniques reviewed include Extreme Learning Machine (ELM), Hidden Markov Models (HMM), situation awareness frameworks, ensemble methods, and feature selection algorithms when applied to contemporary benchmark datasets. Findings show combinations of ELM, HMMs, and ensemble classifiers can achieve reduced false positive rates. However, gaps still exist in research using current representative data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2023/005"
    },
    {
        "id": 15969,
        "title": "Machine learning – A new kind of cultural tool? A “recontextualisation” perspective on machine learning + interprofessional learning",
        "authors": "David Guile",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.lcsi.2023.100738"
    },
    {
        "id": 15970,
        "title": "Augmenting roadway safety with machine learning and deep learning: Pothole detection and dimension estimation using in-vehicle technologies",
        "authors": "Cuthbert Ruseruka, Judith Mwakalonge, Gurcan Comert, Saidi Siuhi, Frank Ngeni, Quincy Anderson",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100547"
    },
    {
        "id": 15971,
        "title": "Business Application of Machine Learning Technology in Data Mining",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040104"
    },
    {
        "id": 15972,
        "title": "Explainable Machine Learning",
        "authors": "Jochen Garcke, Ribana Roscher",
        "published": "2023-1-17",
        "citations": 1,
        "abstract": "Machine learning methods are widely used in commercial applications and in many scientific areas [...]",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5010010"
    },
    {
        "id": 15973,
        "title": "Performance Analysis of Machine Learning Models in Solar Energy Forecasting",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2023.13.3.1140"
    },
    {
        "id": 15974,
        "title": "Machine Learning in EDA: When and How",
        "authors": "Bei Yu",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcad58807.2023.10299822"
    },
    {
        "id": 15975,
        "title": "Credit Card Fraud Detection Using Machine Learning",
        "authors": "Vishal Vishal Kumar",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "To make life better, many mechanisms in modern environment are carried out via the Internet. The economy is expanding yet on the other side, there is a lot of illegal and unauthorised activity carried throughout the country that is seriously hampering that progress. Scam instances, which mislead individuals while also causing economic losses, are just one of them. In realistic conditions, fraud involving credit cards surveillance is the main emphasis of this research. Contrary to earlier eras, the number of credit card scammers is drastically increasing right now. Criminals use various forms of innovation, fake documents, and deception to con others and take their cash. Therefore, it is extremely crucial to discover a solution to these frauds. As technology advances, it becomes harder to keep up with the behaviour and trends of illegal activities. Ai technology, machine learning, as well as other relevant data technology fields have advanced to the point that it is currently feasible to expedite this process and reduce the volume of labour-intensive effort needed in recognizing credit card scams. The user-submitted utilization of credit cards database might be collected initially, then using machine learning approach; it would be split into databases for testing and training purposes. This methodical technique could be utilized by researchers once they have evaluated both the larger information collection and the user-provided available data collection. Enhance the accuracy of the outcome statistics after that. Depending on its exactness and precision, a technology's efficiency is assessed. The results show that XG-Boost and Random Forest techniques have the greatest performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36647/ciml/04.01.a009"
    },
    {
        "id": 15976,
        "title": "Traditional Machine Learning Models for Building Energy Performance Prediction: A Comparative Research",
        "authors": "Zeyu Wu, Hongyang He",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.mlr.20230801.11"
    },
    {
        "id": 15977,
        "title": "Wind Power Prediction Based on Machine Learning",
        "authors": "Song Liu, Jing Lv",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00021"
    },
    {
        "id": 15978,
        "title": "Practice and Application of Fusion Machine Learning in Data Analysis",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040101"
    },
    {
        "id": 15979,
        "title": "New interpretation of GNRB® knee arthrometer results for ACL injury diagnosis support using machine learning",
        "authors": "Jean Mouchotte, Matthieu LeBerre, Théo Cojean, Henri Robert",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100480"
    },
    {
        "id": 15980,
        "title": "Development of Property Prediction Model for Hot Strip Mill Using Machine Learning Algorithms",
        "authors": "Rushikesh Muley, Shanti Priya",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.mlr.20240901.11"
    },
    {
        "id": 15981,
        "title": "Calibration in machine learning uncertainty quantification: Beyond consistency to target adaptivity",
        "authors": "Pascal Pernot",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Reliable uncertainty quantification (UQ) in machine learning (ML) regression tasks is becoming the focus of many studies in materials and chemical science. It is now well understood that average calibration is insufficient, and most studies implement additional methods for testing the conditional calibration with respect to uncertainty, i.e., consistency. Consistency is assessed mostly by so-called reliability diagrams. There exists, however, another way beyond average calibration, which is conditional calibration with respect to input features, i.e., adaptivity. In practice, adaptivity is the main concern of the final users of the ML-UQ method, seeking the reliability of predictions and uncertainties for any point in the feature space. This article aims to show that consistency and adaptivity are complementary validation targets and that good consistency does not imply good adaptivity. An integrated validation framework is proposed and illustrated with a representative example.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0174943"
    },
    {
        "id": 15982,
        "title": "Vector Representation of Amharic Idioms for Natural Language Processing Applications Using Machine Learning Approach",
        "authors": "Anduamlak Abebe Fenta",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.mlr.20230802.11"
    },
    {
        "id": 15983,
        "title": "Self-paced resistance learning against overfitting on noisy labels",
        "authors": "Xiaoshuang Shi, Zhenhua Guo, Kang Li, Yun Liang, Xiaofeng Zhu",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109080"
    },
    {
        "id": 15984,
        "title": "Detecting face masks through embedded machine learning algorithms: A transfer learning approach for affordable microcontrollers",
        "authors": "Mariana B. Azevedo, Thaís de A. de Medeiros, Morsinaldo de A. Medeiros, Ivanovitch Silva, Daniel G. Costa",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100498"
    },
    {
        "id": 15985,
        "title": "Machine Learning-based Analysis and Prediction of Telecoms Customer Churn",
        "authors": "Liwei Chen",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00032"
    },
    {
        "id": 15986,
        "title": "Recession Prediction Using Multiple Machine Learning Methods and Historical Economic Data",
        "authors": "",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "This study explores the application of machine learning methods to enhance economic recession prediction in the UK and USA, considering the limitations of traditional methods. Various models, including Logistic Regression, Linear Discriminant Analysis, K Nearest Neighbors, Decision Tree Classifier, Gaussian Naive Bayes, Support Vector Classifier, Neural Network, RTC, Long Short-Term Memory, Convolutional Neural Network, and XGBoost, were assessed using economic data since 1900. The UK data encompassed GDP, unemployment rate, inflation, FTSE 100 index, yield curve, and debt levels, while the USA utilized the 50-day simple moving average of 10-year treasury rates minus the 50-day simple moving average of 3-month treasury rates. Performance evaluation involved averaged F1, recall, and accuracy over 100 iterations, with confusion matrices illustrating model predictions against actual events. Long Short-Term Memory excelled with recall and F1 values of 0.96 and 0.97, accurately identifying 11 in 12 Positive USA events. K Nearest Neighbours, Decision Tree Classifier, Random Forest Classifier, and XGBoost demonstrated good results, with recall ranging from 0.99 to 0.75, F1 from 1.0 to 0.69, and correctly identifying 2 in 3 Positive events. Conversely, Logistic Regression, Gaussian Naive Bayes, and Neural Network exhibited less reliable predictions. Linear Discriminant Analysis, Support Vector Classifier, and Convolutional Neural Network were completely inadequate. Using recent data, most models predicted the USA avoiding recession in 2023-24, but the probability increased to 0.5 by mid-2023, then decreased. Logistical Regression, Linear Discriminant Analysis, and Long Short-Term Memory initially predicted no recession, but the probability rapidly increased to between 0.83 and 0.97 by April 2024. While recession avoidance is plausible, modelling indicates an escalating risk. The results underscore the utility of machine learning in recession prediction, emphasizing the importance of diverse training datasets. Algorithmic performance varied, with neural network models, particularly Long Short-Term Memory and XGBoost, proving most accurate. Further enhancements in performance necessitate refining training datasets and leveraging advanced models like Long Short-Term Memory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.08"
    },
    {
        "id": 15987,
        "title": "Deep Patient Motion Estimation: Pretraining, Overfitting, or Pretraining and Overfitting?",
        "authors": "T. J. Herbst, J. Maier, M. Arheit, P. Paysan, M. Kachelrieß",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nssmicrtsd49126.2023.10338388"
    },
    {
        "id": 15988,
        "title": "Applying Machine Learning to Vertex Recognition for Neutrino Interactions",
        "authors": "Moreno Eduardo",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1998906"
    },
    {
        "id": 15989,
        "title": "Machine Learning for Detecting Malware in PE Files",
        "authors": "Collin Connors, Dilip Sarkar",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00331"
    },
    {
        "id": 15990,
        "title": "A survey of malware detection using deep learning",
        "authors": "Ahmed Bensaoud, Jugal Kalita, Mahmoud Bensaoud",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100546"
    },
    {
        "id": 15991,
        "title": "A Short Review on Supervised Machine Learning and Deep Learning Techniques in Computer Vision",
        "authors": "Ahmed Adil Nafea, Saeed Amer Alameri, Russel R Majeed, Meaad Ali Khalaf, Mohammed M AL-Ani",
        "published": "2024-2-11",
        "citations": 0,
        "abstract": "In last years, computer vision has shown important advances, mainly using the application of supervised machine learning (ML) and deep learning (DL) techniques. The objective of this review is to show a brief review of the current state of the field of supervised ML and DL techniques, especially on computer vision tasks. This study focuses on the main ideas, advantages, and applications of DL in computer vision and highlights their main concepts and advantages. This study showed the strengths, limitations, and effects of computer vision supervised ML and DL techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2024/004"
    },
    {
        "id": 15992,
        "title": "Using Machine Learning to Classify Information Related to Child Rearing of Infants from Twitter",
        "authors": "",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "It is difficult to obtain necessary information accurately from Social Networking Service (SNS) while raising children, and it is thought that there is a certain demand for the development of a system that presents appropriate information to users according to the child's developmental stage. There are still few examples of research on knowledge extraction that focuses on childcare. This research aims to develop a system that extracts and presents useful knowledge for people who are actually raising children, using texts about childcare posted on Twitter. In many systems, numbers in text data are just strings like words and are normalized to zero or simply ignored. In this paper, we created a set of tweet texts and a set of profiles created according to the developmental stages of infants from \"0-year-old child\" to \"6-year-old child\". For each set, we used ML algorithms such as NB (Naive Bayes), LR (Logistic Regression), ANN (Approximate Nearest Neighbor algorithms search), XGboost, RF (random forest), decision trees, and SVM (Support Vector Machine) to compare with BERT (Bidirectional Encoder Representations from Transformers), a neural language model, to construct a classification model that predicts numbers from \"0\" to \"6\" from sentences. The accuracy rate predicted by the BERT classifier was slightly higher than that of the NB, LR, and ANN, XGboost, and RF, decision trees and SVM classifiers, indicating that the BERT classification method was better.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.01"
    },
    {
        "id": 15993,
        "title": "Machine Learning in Modern World",
        "authors": "Archana V",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "Today the world is totally dependent on technology. Machine learning is one of the game changing technologies which is used in our day to day life. Everyday in machine learning technology there are  developed a variety of new products and applications using various machine learning algorithms. Mainly of three types of algorithm. A few applications of machine learning are Product recommendations, Speech recognition etc… The machine learning outcome of the product is perfectly excellent and more accurate. Machine learning is otherwise a subset of Artificial inteligence,it implements several tasks left out any changes. There are many more trending  technologies depending on machine learning, in machine learning the process is more effective and quick and faster than human work efficiency. These trends are done by using huge amounts of  biological data, medical data,algorithms and numerical models available today. It is also becoming very useful in the upcoming future generation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.31.39.46"
    },
    {
        "id": 15994,
        "title": "Erratum to “A BCI system for imagined Bengali speech recognition” [Machine Learning with Applications 13 (2023) 100486]",
        "authors": "Arman Hossain, Kathak Das, Protima Khan, Md. Fazlul Kader",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100532"
    },
    {
        "id": 15995,
        "title": "Our Vision for JGR: Machine Learning and Computation",
        "authors": "E. Camporeale, R. Marino,  ",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractThis editorial introduces the inaugural issue of the Journal of Geophysical Research: Machine Learning and Computation to the scientific community, elucidating the motivations and vision behind its establishment. The landscape of computational tools for geoscientists has undergone a rapid transformation in the last decade, akin to a new scientific revolution challenging the traditional scientific method. The paradigm shift emphasizes the integration of data‐driven methods and the possibility of predicting and/or reproducing the evolution of natural phenomena with computers as the fourth pillar of scientific discovery, sparking debates on trustworthiness, and ethical implications. The data science revolution is fueled by the convergence of advancements, including the big‐data revolution, GPU market expansion, and significant investments in Artificial Intelligence and high performance computing by both institutional and private players. This transformation has given rise to a trans‐disciplinary community that has investigated a wide range of questions under the lens of machine learning (ML) approaches and has generally advanced the field of computational methods within the broader geosciences community, the core of the American Geophysical Union (AGU) membership. Responding to an unmet demand in the existing worldwide editorial offer, the Journal of Geophysical Research: Machine Learning and Computation aims to serve as an intellectual crucible, fostering collaborations across multiple geophysical disciplines and data scientists. The journal welcomes papers with strong methodological developments that allow for geoscience advancements grounded in specific computational and data‐driven methods, leveraging ML as well as innovative computational strategies, and leading to breakthrough discoveries and original scientific outcomes. Authors are encouraged to balance succinctness in introducing methods with a thorough exploration of the novelty of the work proposed and its future applications placing special emphasis on the connection between the data science approach and the scientific outcome, considering a broad readership. Emphasis on result reproducibility aligns with AGU guidance, inviting active participation from the community in shaping geophysical research in the era of machine learning and computation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2024jh000184"
    },
    {
        "id": 15996,
        "title": "Machine Learning in Drug Discovery",
        "authors": "Deepak B",
        "published": "2023-3-21",
        "citations": 0,
        "abstract": "A drug is a substance that when put into the body can change the way the body works and a person's mental state. Discovering the accurate drug plays a vital role in saving precious lives. In traditional drug creation, scientists identify a target in the body and test a large range of chemical compounds on it until they obtain the results. The process gets quicker and more effective with the role of machine learning techniques. This is done by using the huge amount of biological data, medical data, algorithms and statistical models available today. This automation of the drug development process is a key to the current issue of low productivity rate that pharmaceutical companies currently face and helps eliminate the side effects. Machine learning might be a useful tool to further enhance the drug development process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.32.53.60"
    },
    {
        "id": 15997,
        "title": "Dealing with dimensionality: the application of machine learning to multi-omics data",
        "authors": "Dylan Feldner-Busztin, Panos Firbas Nisantzis, Shelley Jane Edmunds, Gergely Boza, Fernando Racimo, Shyam Gopalakrishnan, Morten Tønsberg Limborg, Leo Lahti, Gonzalo G de Polavieja",
        "published": "2023-2-3",
        "citations": 17,
        "abstract": "Abstract\n\nMotivation\nMachine learning (ML) methods are motivated by the need to automate information extraction from large datasets in order to support human users in data-driven tasks. This is an attractive approach for integrative joint analysis of vast amounts of omics data produced in next generation sequencing and other -omics assays. A systematic assessment of the current literature can help to identify key trends and potential gaps in methodology and applications. We surveyed the literature on ML multi-omic data integration and quantitatively explored the goals, techniques and data involved in this field. We were particularly interested in examining how researchers use ML to deal with the volume and complexity of these datasets.\n\n\nResults\nOur main finding is that the methods used are those that address the challenges of datasets with few samples and many features. Dimensionality reduction methods are used to reduce the feature count alongside models that can also appropriately handle relatively few samples. Popular techniques include autoencoders, random forests and support vector machines. We also found that the field is heavily influenced by the use of The Cancer Genome Atlas dataset, which is accessible and contains many diverse experiments.\n\n\nAvailability and implementation\nAll data and processing scripts are available at this GitLab repository: https://gitlab.com/polavieja_lab/ml_multi-omics_review/ or in Zenodo: https://doi.org/10.5281/zenodo.7361807.\n\n\nSupplementary information\nSupplementary data are available at Bioinformatics online.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioinformatics/btad021"
    },
    {
        "id": 15998,
        "title": "Optimization Algorithm of Big Data Mining Based on Machine Learning Model",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040108"
    },
    {
        "id": 15999,
        "title": "Fall Detection using Machine Learning Techniques and Frequency-Driven Riemannian Manifolds",
        "authors": "Shan Suthaharan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00035"
    },
    {
        "id": 16000,
        "title": "Code2Drive: A Code-based Interactive and Educational Driving Environment for Improving the Youth Driving Learning and Training using Machine Learning",
        "authors": "Zihao Lin, Jonathan Sahagun",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "Serious games are video games designed for more than just pure entertainment purposes [1]. Serious games developers combine traditional game mechanics and the ideas to educate, inform and facilitate social change [2]. These games can be used in many occasions, such as education, healthcare and more. Serious games use simulations and scenarios to provide an immersive and interactive learning experience. They offer an environment to experiment with a variety of solutions to real-world problems, promoting critical thinking and decision making skills. These games can also improve knowledge retention, motivation, and engagement, as they provide instant feedback, rewards, and challenges. This application is like one of the many serious games, it provides a simulation of a highway, its primary purpose is to help to train juvenile’s knowledge on driving and logical thinking, and relax during the playthrough [3].",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131014"
    },
    {
        "id": 16001,
        "title": "A comparison of machine learning surrogate models of street-scale flooding in Norfolk, Virginia",
        "authors": "Diana McSpadden, Steven Goldenberg, Binata Roy, Malachi Schram, Jonathan L. Goodall, Heather Richter",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100518"
    },
    {
        "id": 16002,
        "title": "Erratum to “Automated recognition of individual performers from de-identified video sequences” [Machine Learning with Applications 11 (2023) 100450]",
        "authors": "Zizui Chen, Stephen Czarnuch, Erica Dove, Arlene Astell",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100533"
    },
    {
        "id": 16003,
        "title": "Design of Computer Complex Spam Filtering System Based on Machine Learning Algorithm",
        "authors": "Yong Yang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00033"
    },
    {
        "id": 16004,
        "title": "Unsupervised machine learning to analyze corneal tissue surfaces",
        "authors": "Carolin A. Rickert, Fabio Henkel, Oliver Lieleg",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Identifying/classifying damage features on soft materials, such as tissues, is much more challenging than on classical, hard materials—but nevertheless important, especially in the field of bio-tribology. For instance, cartilage samples from osteoarthritic patients exhibit surface damage even at early stages of tissue degeneration, and corneal tissues can be damaged by contact lenses when the ocular lubrication system fails. Here, we employ unsupervised machine learning (ML) methods to assess the surface condition of a soft tissue by detecting and classifying different wear morphologies as well as the severity of surface damage they represent. We show that different clustering methods, especially a k-means clustering algorithm, can indeed achieve a—from a material science point of view—meaningful classification of those tissue samples. Our study pinpoints the ability of unsupervised ML models to guide or even replace human decision processes for the analysis of complex surfaces and topographical datasets that—either owing to their complexity or the sample size—exceed the capability of the human brain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0159502"
    },
    {
        "id": 16005,
        "title": "An inpatient fall risk assessment tool: Application of machine learning models on intrinsic and extrinsic risk factors",
        "authors": "Sonia Jahangiri, Masoud Abdollahi, Rasika Patil, Ehsan Rashedi, Nasibeh Azadeh-Fard",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100519"
    },
    {
        "id": 16006,
        "title": "Identifying Michel Electrons in Liquid Argon TPCs Using Machine Learning",
        "authors": "Riya Shah",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1996940"
    },
    {
        "id": 16007,
        "title": "Research on Edge Network Topology Optimization Based on Machine Learning",
        "authors": "Boyi Wang, Wei Zhang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00018"
    },
    {
        "id": 16008,
        "title": "Scanning probe microscopy in the age of machine learning",
        "authors": "Md Ashiqur Rahman Laskar, Umberto Celano",
        "published": "2023-12-1",
        "citations": 2,
        "abstract": "Scanning probe microscopy (SPM) has revolutionized our ability to explore the nanoscale world, enabling the imaging, manipulation, and characterization of materials at the atomic and molecular level. However, conventional SPM techniques suffer from limitations, such as slow data acquisition, low signal-to-noise ratio, and complex data analysis. In recent years, the field of machine learning (ML) has emerged as a powerful tool for analyzing complex datasets and extracting meaningful patterns and features in multiple fields. The combination of ML with SPM techniques has the potential to overcome many of the limitations of conventional SPM methods and unlock new opportunities for nanoscale research. In this review article, we will provide an overview of the recent developments in ML-based SPM, including its applications in topography imaging, surface characterization, and secondary imaging modes, such as electrical, spectroscopic, and mechanical datasets. We will also discuss the challenges and opportunities of integrating ML with SPM techniques and highlight the potential impact of this interdisciplinary field on various fields of science and engineering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0160568"
    },
    {
        "id": 16009,
        "title": "A novel approach to tele-rehabilitation: Implementing a biofeedback system using machine learning algorithms",
        "authors": "Ali Barzegar Khanghah, Geoff Fernie, Atena Roshan Fekr",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100499"
    },
    {
        "id": 16010,
        "title": "Big Data Analytics Using Machine Learning Techniques for Prediction on Datasets",
        "authors": "Ankit Verma",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "Data analytics is the process of performing scientific and statistical analysis on raw data in order to transform it into information that can be used for gaining knowledge. A recently emerging trend in feature abstraction is the combination of computational techniques and big data analysis. This requires gaining knowledge from trustworthy data sources, being able to digest information quickly, and making accurate predictions about the future. The primary objective of this study is to locate the machine learning strategies that produce the most accurate prediction by utilising the model that has been proposed. The supervised and unsupervised strategies have been implemented in a variety of different ways using the MapReduce methodology; however, the suggested model makes use of the Apache Spark framework in order to compare the many existing methods. In this study, the emphasis is placed on elucidating the characteristics of datasets in order to conduct the most accurate analysis possible using machine learning techniques. For the purpose of conducting an analysis of the data sets, machine learning methods such as linear regression, decision trees, random forests, and gradient boosting tree algorithms are utilised. In light of the findings of this research, it is possible to draw the conclusion that when the Spark framework is applied on top of Machine Learning methods, the efficiency of the model is improved by a factor of seventy percent in comparison to the MapReduce paradigm.  Keyword : Apache Spark Framework, Big Data Analytics, Machine Learning Algorithms, MapReduce Paradigm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36647/ciml/04.01.a002"
    },
    {
        "id": 16011,
        "title": "A reinforcement learning algorithm for scheduling parallel processors with identical speedup functions",
        "authors": "Farid Ziaei, Mohammad Ranjbar",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100485"
    },
    {
        "id": 16012,
        "title": "Hybrid deep learning and GARCH-family models for forecasting volatility of cryptocurrencies",
        "authors": "Bahareh Amirshahi, Salim Lahmiri",
        "published": "2023-6",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100465"
    },
    {
        "id": 16013,
        "title": "A comprehensive survey on machine learning applications for drilling and blasting in surface mining",
        "authors": "Venkat Munagala, Srikanth Thudumu, Irini Logothetis, Sushil Bhandari, Rajesh Vasa, Kon Mouzakis",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100517"
    },
    {
        "id": 16014,
        "title": "Deep echo state networks in data marketplaces",
        "authors": "Will Serrano",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100456"
    },
    {
        "id": 16015,
        "title": "Fake Review Detection using Machine Learning",
        "authors": "Gayathri M, Y.S.N Siva Teja, K.Ajay Sharma",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "Online reviews have become increasingly important in the world of e-commerce, serving as a powerful tool to establish a business's reputation and attract new customers. However, the rise of fake reviews has become a growing concern as they can skew the reputation of a business and deceive potential customers. As a result, detecting fake reviews has become a key area of research in recent years.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36647/ciml/04.02.a002"
    },
    {
        "id": 16016,
        "title": "Voice spoofing detection for multiclass attack classification using deep learning",
        "authors": "Jason Boyd, Muhammad Fahim, Oluwafemi Olukoya",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100503"
    },
    {
        "id": 16017,
        "title": "Semi-supervised visual anomaly detection based on convolutional autoencoder and transfer learning",
        "authors": "Jamal Saeedi, Alessandro Giusti",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100451"
    },
    {
        "id": 16018,
        "title": "Multilinear multitask learning by transformed tensor singular value decomposition",
        "authors": "Xiongjun Zhang, Jin Wu, Michael K. Ng",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100479"
    },
    {
        "id": 16019,
        "title": "2023 IEEE 33rd International Workshop on Machine Learning for Signal Processing (MLSP)",
        "authors": "",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285990"
    },
    {
        "id": 16020,
        "title": "Simulation of Spectrum Big Data Analysis and Processing Model Based on Machine Learning",
        "authors": "Yanfei Zou",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00098"
    },
    {
        "id": 16021,
        "title": "Analyze Organizational Internal Threats Using Machine Learning",
        "authors": "Yinluo Jing, Chunyuan Jiang, Wenhua Chen, Yong Xu",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00013"
    },
    {
        "id": 16022,
        "title": "Optimization Scheme of Accurate Calculation Algorithm of Electric Charge Based on Machine Learning",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040102"
    },
    {
        "id": 16023,
        "title": "A Novel Machine Learning-Based Heart Murmur Detection and Classification using Sound Feature Analysis",
        "authors": "Ram Sivaraman, Joe Xiao",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "An electrocardiogram (ECG) is a common method used for diagnosis of heart diseases. ECG is not sufficient to detect heart abnormalities early. Heart sound monitoring or phonocardiogram (PCG) is a non-invasive assessment that can be performed during routine exams. PCG can provide valuable details for both heart disorder diagnosis as well as any perioperative cardiac monitoring. Further, heart murmurs are abnormal signals generated by turbulent blood flow in the heart and are closely associated with specific heart diseases.  This paper presents a new machine learning-based heart sounds evaluation for murmurs with high accuracy. A random forest classifier is built using the statistical moments of the coefficients extracted from the heart sounds. The classifier can predict the location of the heart sounds with over 90% accuracy. The random forest classifier has a murmur detection accuracy of over 70% for test dataset and detects with over 98% accuracy for the full dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140206"
    },
    {
        "id": 16024,
        "title": "Advancing magnetic material discovery through machine learning: Unveiling new manganese-based materials",
        "authors": "Yogesh Khatri, Arti Kashyap",
        "published": "2023-12-1",
        "citations": 1,
        "abstract": "Magnetic materials are used in a variety of applications, such as electric generators, speakers, hard drives, MRI machines, etc. Discovery of new magnetic materials with desirable properties is essential for advancement in these applications. In this research article, we describe the development and validation of a machine-learning model to discover new manganese-based stable magnetic materials. The machine learning model is trained on the input data from the Materials Project database to predict the magnetization and formation energy of the materials. New hypothetical structures are made using the substitution method, and the properties are predicted using the machine learning model to select the materials with desired properties. Harnessing the power of machine learning allows us to intelligently narrow down the vast pool of potential candidates. By doing so, we deftly reduce the number of materials that warrant in-depth examination using density functional theory, rendering the task more manageable and efficient. The selected materials, seemingly promising with their magnetic potential, undergo a meticulous validation process using the Vienna Ab initio Simulation Package, grounded in density functional theory. Our results underscore the paramount significance of input data in the efficacy of the machine learning model. Particularly in the realm of magnetic materials, the proper initialization of atomic magnetic spins holds the key to converging upon the true magnetic state of each material.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0171320"
    },
    {
        "id": 16025,
        "title": "Research on advanced manufacturing process monitoring and fault prediction method based on machine learning",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/autml.2023.040311"
    },
    {
        "id": 16026,
        "title": "Relationship between Risk Factors of Water Conservancy Project Based on Machine Learning Algorithm",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040105"
    },
    {
        "id": 16027,
        "title": "Semmeldetector: Application of Machine Learning in Commercial Bakeries",
        "authors": "Thomas H. Schmitt, Maximilian Bundscherer, Tobias Bocklet",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00129"
    },
    {
        "id": 16028,
        "title": "CLASSIFICAÇÃO DE TEXTOS: UMA ABORDAGEM COM USO DE MACHINE LEARNING",
        "authors": "Fábio Eder Cardoso, Edberto Ferneda, Leonardo Botega",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "La clasificación de textos ha sido utilizada como base para la organización del conocimiento en las más diversas áreas, ya que permite organizar grupos de categorías para guiar el corte de estos dominios. En la era de la información digital, donde existe una gran cantidad de datos diseminados en entornos de computación en la nube, es necesario el uso de tecnologías informacionales para ayudar en el proceso de clasificación de estos datos. En este contexto, la Ciencia de la Información contribuye en el proceso de producción, organización, transmisión y uso de la información en las más variadas áreas, entre ellas, la ciencia de la computación, matemáticas, inteligencia artificial, entre otras. A través de la tecnología, cuando la información está adecuadamente clasificada, puede ser puesta a disposición de la sociedad de manera más eficaz. El objetivo principal de este artículo es abordar contextos sobre la clasificación de textos con el uso de Machine Learning. Esta investigación es de tipo exploratoria, con un método experimental, y utiliza un enfoque cuantitativo como técnica de análisis de datos. Como resultado, después de utilizar el algoritmo de distancia euclidiana, se estableció una matriz de distancias y un agrupamiento jerárquico, además de una nube de palabras, resaltando expresiones con términos relevantes de los documentos.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62758/re.v3i3.212"
    },
    {
        "id": 16029,
        "title": "FedWS: Dealing with Heterogeneous Data on Federated Learning",
        "authors": "Flávio Vieira, Carlos Alberto V. Campos",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422646"
    },
    {
        "id": 16030,
        "title": "Comparing deep reinforcement learning architectures for autonomous racing",
        "authors": "Benjamin David Evans, Hendrik Willem Jordaan, Herman Arnold Engelbrecht",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100496"
    },
    {
        "id": 16031,
        "title": "Machine Learning and Deep Learning Approaches for Cybersecurity: A Review",
        "authors": "Migul Jain",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231023115126"
    },
    {
        "id": 16032,
        "title": "A deep learning knowledge graph neural network for recommender systems",
        "authors": "Gurinder Kaur, Fei Liu, Yi-Ping Phoebe Chen",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100507"
    },
    {
        "id": 16033,
        "title": "Truth Seeker of the Largest Social Media Content using Machine Learning Algorithms",
        "authors": "Maysa Khalil, Mohammad Azzeh",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00243"
    },
    {
        "id": 16034,
        "title": "Tutorial on Amortized Optimization",
        "authors": "Brandon Amos",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/2200000102"
    },
    {
        "id": 16035,
        "title": "Machine Learning based Cryptocurrency Price Prediction using Historical Data and Social Media Sentiment",
        "authors": "Saachin Bhatt, Mustansar Ghazanfar, Mohammad Hossein Amirhosseini",
        "published": "2023-6-17",
        "citations": 2,
        "abstract": "The purpose of this research is to investigate the impact of social media sentiments on predicting the Bitcoin price using machine learning models, with a focus on integrating onchain data and employing a Multi Modal Fusion Model. For conducting the experiments, the crypto market data, on-chain data, and corresponding social media data (Twitter) has been collected from 2014 to 2022 containing over 2000 samples. We trained various models over historical data including K-Nearest Neighbors, Logistic Regression, Gaussian Naive Bayes, Support Vector Machine, Extreme Gradient Boosting and a Multi Modal Fusion. Next, we added Twitter sentiment data to the models, using the Twitter-roBERTa and VADAR models to analyse the sentiments expressed in social media about Bitcoin. We then compared the performance of these models with and without the Twitter sentiment data and found that the inclusion of sentiment feature resulted in consistently better performance, with TwitterRoBERTa-based sentiment giving an average F1 scores of 0.79. The best performing model was an optimised Multi Modal Fusion classifier using Twitter-RoBERTa based sentiment, producing an F1 score of 0.85. This study represents a significant contribution to the field of financial forecasting by demonstrating the potential of social media sentiment analysis, onchain data integration, and the application of a Multi Modal Fusion model to improve the accuracy and robustness of machine learning models for predicting market trends, providing a valuable tool for investors, brokers, and traders seeking to make informed decisions",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131001"
    },
    {
        "id": 16036,
        "title": "Fourier Series Weight in Quantum Machine Learning",
        "authors": "Parfait Atchade-Adelomou",
        "published": "2024",
        "citations": 0,
        "abstract": "In this work, we aim to confirm the impact of the Fourier series on the quantum machine learning model. We will propose models, tests, and demonstrations to achieve this objective. We designed a quantum machine learning leveraged on the Hamiltonian encoding. With a subtle change, we performed the trigonometric interpolation, binary and multiclass classifier, and a quantum signal processing application. We also proposed a block diagram of determining approximately the Fourier coefficient based on quantum machine learning. We performed and tested all the proposed models using the Pennylane framework.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2024.41108"
    },
    {
        "id": 16037,
        "title": "Design of intelligent dustbin based on machine learning",
        "authors": "xin feng",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675548"
    },
    {
        "id": 16038,
        "title": "Applied machine learning to the determination of biochar hydrogen sulfide adsorption capacity",
        "authors": "Abolhassan Banisheikholeslami, Farhad Qaderi",
        "published": "2023-12-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06446-2"
    },
    {
        "id": 16039,
        "title": "Hyperintensionality and overfitting",
        "authors": "Francesco Berto",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "AbstractA hyperintensional epistemic logic would take the contents which can be known or believed as more fine-grained than sets of possible worlds. I consider one objection to the idea: Williamson’s Objection from Overfitting. I propose a hyperintensional account of propositions as sets of worlds enriched with topics: what those propositions, and so the attitudes having them as contents, are about. I show that the account captures the conditions under which sentences express the same content; that it can be pervasively applied in formal and mainstream epistemology; and that it is left unscathed by the objection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11229-024-04556-5"
    },
    {
        "id": 16040,
        "title": "Effect of Dimensionality Reduction on Uncertainty Quantification in Trustworthy Machine Learning",
        "authors": "Yen-Chen Li, Justin Zhan",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlc58545.2023.10327953"
    },
    {
        "id": 16041,
        "title": "Detecting Arabic Cyberbullying Tweets Using Machine Learning",
        "authors": "Alanoud Mohammed Alduailaj, Aymen Belghith",
        "published": "2023-1-5",
        "citations": 17,
        "abstract": "The advancement of technology has paved the way for a new type of bullying, which often leads to negative stigma in the social setting. Cyberbullying is a cybercrime wherein one individual becomes the target of harassment and hatred. It has recently become more prevalent due to a rise in the usage of social media platforms, and, in some severe situations, it has even led to victims’ suicides. In the literature, several cyberbullying detection methods are proposed, but they are mainly focused on word-based data and user account attributes. Furthermore, most of them are related to the English language. Meanwhile, only a few papers have studied cyberbullying detection in Arabic social media platforms. This paper, therefore, aims to use machine learning in the Arabic language for automatic cyberbullying detection. The proposed mechanism identifies cyberbullying using the Support Vector Machine (SVM) classifier algorithm by using a real dataset obtained from YouTube and Twitter to train and test the classifier. Moreover, we include the Farasa tool to overcome text limitations and improve the detection of bullying attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make5010003"
    },
    {
        "id": 16042,
        "title": "Deep learning for anomaly detection in log data: A survey",
        "authors": "Max Landauer, Sebastian Onder, Florian Skopik, Markus Wurzenberger",
        "published": "2023-6",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100470"
    },
    {
        "id": 16043,
        "title": "Seven Epileptic Seizure Type Classification in Pre-Ictal, Ictal and Inter-Ictal Stages using Machine Learning Techniques",
        "authors": "",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "Background: Epileptic Seizure type diagnosis is done by clinician based on the symptoms during the episode and the Electroencephalograph (EEG) recording taken during inter-ictal period. But main challenge is, most of the time with the absence of any attendee, the patients are unable to explain the symptoms and not possible to find signature in inter-ictal EEG signal. Aims: This paper aims to analyze epileptic seizure Electro-encephalograph (EEG) signals to diagnose seizure in pre-ictal, ictal and inter-ictal stages and to classify into seven different classes. Methods: Temple University Hospital licensed dataset is used for study. From the seizure corpus, seven seizure types are pre- processed and segregated into pre-ictal, ictal and inter-ictal stages. The multi class classification performed using different machine and deep learning techniques such as K- Nearest Neighbor (KNN) and Random Forest, etc. Results: Multiclass classification of seven type of epileptic seizure with 20 channels, with 80-20 train-test ratio, is achieved 94.7%, 94.7%, 69.0% training accuracy and 94.46%, 94.46% 71.11% test accuracy by weighted KNN for pre-ictal, ictal and inter-ictal stages respectively. Conclusion: Seven epileptic seizure type classification using machine learning techniques carried out with MATLAB software and weighted KNN shows better accuracy comparatively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.01.01"
    },
    {
        "id": 16044,
        "title": "Analisis Perbandingan Algoritma Machine Learning untuk Prediksi Stunting pada Anak",
        "authors": "Indah Pratiwi Putri, Terttiaavini Terttiaavini, Nur Arminarahmah",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "Penelitian ini menyoroti permasalahan serius stunting pada anak-anak, terutama dalam pendataan yang tidak konsisten dan kurangnya informasi akurat dalam evaluasi kondisi tersebut. Tujuannya adalah mengembangkan model Machine Learning (ML)  untuk memprediksi kasus stunting dengan lebih baik. Metode penelitian melibatkan tiga algoritma ML: Naive Bayes, K-Nearest Neighbors, dan Random Forest, dievaluasi berdasarkan Accuracy, Precision, dan recall. Penelitian ini memanfaatkan platform KNIME untuk membantu pengelolaan data yang lebih efisien dan akurat. Hasil evaluasi menunjukkan bahwa Random Forest memiliki akurasi tertinggi (87.75%) dan F1-score (0.922), menunjukkan keseimbangan yang baik antara Precision dan recall. Meskipun demikian, K-Nearest Neighbors menonjol dalam menemukan sebagian besar kasus stunting yang sebenarnya. Kesimpulannya, model Random Forest mungkin menjadi pilihan terbaik untuk mendiagnosis stunting pada anak-anak, karena kombinasi akurasi tinggi dan kemampuan menemukan kasus stunting yang lebih baik dari model lainnya. Penelitian ini memberikan wawasan tentang penerapan ML dalam mendukung deteksi dini stunting, memungkinkan intervensi yang lebih tepat dan cepat bagi anak-anak yang membutuhkan perhatian kesehatan yang lebih intensif.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i1.1078"
    },
    {
        "id": 16045,
        "title": "Impact of High-Dimensional Feature Selection Strategies Based on Machine Learning on Malicious Document Detection",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/autml.2024.050105"
    },
    {
        "id": 16046,
        "title": "Utilizing Machine Learning Techniques in Predicting Job Viability of Information Technology Program Graduates",
        "authors": "Caesar Jude Clemente",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00253"
    },
    {
        "id": 16047,
        "title": "Analysis and Type Identification of Ancient Glass Relics Based on Machine Learning",
        "authors": "Hongjin Mi, Zijun Guo",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00062"
    },
    {
        "id": 16048,
        "title": "Time-Drift Aware RF Optimization with Machine Learning Techniques",
        "authors": "Ralitsa Sharankova, Kiyomi Seiya, Matilda Mwaniki",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1983803"
    },
    {
        "id": 16049,
        "title": "Injury Risk Prediction in Soccer Using Machine Learning",
        "authors": "Brendan Shen, Mikhail Y. Shalaginov, Tingying Helen Zeng",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00317"
    },
    {
        "id": 16050,
        "title": "Identification of defects in a software using machine learning",
        "authors": " Nishthaa, Ruchika Malhotra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0179183"
    },
    {
        "id": 16051,
        "title": "Machine learning from casual conversation",
        "authors": "Awrad E. Mohammed Ali, Avelino J. Gonzalez",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06383-0"
    },
    {
        "id": 16052,
        "title": "Comment on ‘Physics-based representations for machine learning properties of chemical reactions’",
        "authors": "Kevin A Spiekermann, Thijs Stuyver, Lagnajit Pattanaik, William H Green",
        "published": "2023-12-1",
        "citations": 2,
        "abstract": "Abstract\nIn a recent article in this journal, van Gerwen et al (2022 Mach. Learn.: Sci. Technol.\n3 045005) presented a kernel ridge regression model to predict reaction barrier heights. Here, we comment on the utility of that model and present references and results that contradict several statements made in that article. Our primary interest is to offer a broader perspective by presenting three aspects that are essential for researchers to consider when creating models for chemical kinetics: (1) are the model’s prediction targets and associated errors sufficient for practical applications? (2) Does the model prioritize user-friendly inputs so it is practical for others to integrate into prediction workflows? (3) Does the analysis report performance on both interpolative and more challenging extrapolative data splits so users have a realistic idea of the likely errors in the model’s predictions?",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acee42"
    },
    {
        "id": 16053,
        "title": "<scp>EResNet‐SVM</scp>: An Overfitting‐relieved Deep Learning Model for Recognition of Plant Diseases and Pests",
        "authors": "Haitao Xiong, Juan Li, Tiewei Wang, Fan Zhang, Ziyang Wang",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "AbstractBACKGROUNDThe accurate recognition and early warning for plant diseases and pests are a prerequisite of intelligent prevention and control for plant diseases and pests. Due to the phenotype similarity of the hazarded plant after plant diseases and pests occur as well as the interference of the external environment, traditional deep learning models often face the overfitting problem in phenotype recognition of plant diseases and pests, which leads to not only slow convergence speed of the network but also low recognition accuracy.RESULTSMotivated by the above problems, this paper proposes a deep learning model EResNet‐SVM to alleviate the overfitting for the recognition and classification of plant diseases and pests. First, the feature extraction capability of the model is improved by increasing feature extraction layers in the convolutional neural network (CNN). Second, the order‐reduced modules are embedded and a sparsely activated function is introduced to reduce model complexity and alleviate overfitting. Finally, a classifier fused by support vector machine (SVM) and fully connected layers (FC) are introduced to transforms the original nonlinear classification problem into a linear classification problem in high‐dimensional space to further alleviate the overfitting and improve the recognition accuracy of plant diseases and pests. The ablation experiments further demonstrate that the fused structure can effectively alleviate the overfitting and improve the recognition accuracy. The experimental recognition results for typical plant diseases and pests show that the proposed EResNet‐SVM model has 99.30% test accuracy for eight conditions (seven plant diseases and one normal), which is 5.90% higher than the original ResNet18. Compared with the classic AlexNet, GoogLeNet, Xception, SqueezeNet and DenseNet201 models, the accuracy of the EResNet‐SVM model has improved by 5.10%, 7%, 8.10%, 6.20% and 1.90%, respectively. The testing accuracy of the EResNet‐SVM model for 6 insect pests is 100%, which is 3.90% higher than that of the original ResNet18 model.CONCLUSIONThis research can provide useful references for alleviating the overfitting problem in deep learning, and it can also provide a theoretical and technical support for the intelligent detection and control of plant diseases and pests.This article is protected by copyright. All rights reserved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jsfa.13462"
    },
    {
        "id": 16054,
        "title": "On a machine learning based analysis of online transaction",
        "authors": "Kailai Chen",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675229"
    },
    {
        "id": 16055,
        "title": "Machine-Learning Prediction of the Computed Band Gaps of Double Perovskite Materials",
        "authors": "Junfei Zhang, Yueqi Li, Xinbo Zhou",
        "published": "2023-1-2",
        "citations": 0,
        "abstract": "Prediction of the electronic structure of functional materials is essential for the engineering of new devices. Conventional electronic structure prediction methods based on density functional theory (DFT) suffer from not only high computational cost, but also limited accuracy arising from the approximations of the exchange-correlation functional. Surrogate methods based on machine learning have garnered much attention as a viable alternative to bypass these limitations, especially in the prediction of solid-state band gaps, which motivated this research study. Herein, we construct a random forest regression model for band gaps of double perovskite materials, using a dataset of 1306 band gaps computed with the GLLBSC (Gritsenko, van Leeuwen, van Lenthe, and Baerends solid correlation) functional. Among the 20 physical features employed, we find that the bulk modulus, superconductivity temperature, and cation electronegativity exhibit the highest importance scores, consistent with the physics of the underlying electronic structure. Using the top 10 features, a model accuracy of 85.6% with a root mean square error of 0.64 eV is obtained, comparable to previous studies. Our results are significant in the sense that they attest to the potential of machine learning regressions for the rapid screening of promising candidate functional materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130102"
    },
    {
        "id": 16056,
        "title": "Preface: 3rd International Conference on Machine Learning and Information Processing (ICMLIP-2023)",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/12.0021946"
    },
    {
        "id": 16057,
        "title": "Image Enhancement using Convolution Neural Networks",
        "authors": "Hasan Ahmed Salman, Ali Kalakech",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "The research presents a comprehensive exploration of the topic of image enhancement using convolutional neural networks (CNN).The research goes deeper into the advanced field of image processing based on the use of neural networks to automatically and efficiently improve the quality and detail of images. The thesis shows that convolutional neural networks are one of the types of deep neural networks, which are specially designed to gain knowledge from big data and extract complex features and patterns found in images. The different layers of the grid are discussed in detail, dealing with images incrementally and extracting different attributes in each layer. The research also highlights CNN's ability to detect, learn and improve important details found in images through convolutions, filtering and data aggregation processes. The proposed CNN image enhancement model was developed and tested on both medical and normal images. The images were optimized using the proposed model and compared with other models. Various quality measures were used to evaluate the results. The results showed that the proposed model can significantly improve the quality of images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2024/003"
    },
    {
        "id": 16058,
        "title": "Leveraging Business Data Analytics Using Machine Learning Techniques",
        "authors": "",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "This research explores the utilization of machine learning and deep learning methods for analyzing business data in the context of internal s. With the exponential growth of data in businesses, the extraction of insights and informed decisionmaking based on data has become crucial. Machine learning algorithms offer effective tools for identifying patterns and trends within large datasets. This article delves into various machine learning techniques, including supervised and unsupervised learning, reinforcement learning, and deep learning, and investigates their applications in business data analytics. Notably, machine and deep learning models such as Support Vector Machine (SVM) and Decision Tree (DT) prove highly valuable in analyzing complex datasets such as text and images. Moreover, the paper evaluates the challenges associated with implementing machine learning models, such as data preprocessing, model selection, and performance evaluation. Lastly, the paper concludes by discussing potential future research directions in the field of business data analytics, emphasizing the utilization of machine learning and deep learning techniques within the realm of internal.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/ann.07.01.05"
    },
    {
        "id": 16059,
        "title": "Tutorials at <i>APL Machine Learning</i>: To share, to envision, and to help others learn",
        "authors": "Shijing Sun",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0175787"
    },
    {
        "id": 16060,
        "title": "Security for Distributed Machine Learning",
        "authors": "Laurent Gomez, Tianchi Yu, Patrick Duverger",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012137700003555"
    },
    {
        "id": 16061,
        "title": "Overview of Neural Networks",
        "authors": "Maad M. Mijwel, Adam Esen, Aysar Shamil",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "Since it was confirmed and verified that the human nervous system consists of individual cells, which were later called neurons, and it was discovered that these cells connect with each other to form an extensive communication network, a large number of possibilities have been opened for application in multiple disciplines in areas of knowledge. Neural Networks are created to perform tasks such as pattern recognition, classification, regression, and many other functions that serve humans and are an essential component in the field of machine learning and artificial intelligence. In computer science, progress has been made, and computers are supposed to learn how to solve problems like that of the human brain. Through pre-established examples, the computer must be able to provide solutions to issues that are like those presented during training. This article overviews neural networks and their application in developing computer systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58496/bjml/2023/008"
    },
    {
        "id": 16062,
        "title": "An application of machine learning in real estate economics: What extra benefits could machine learning techniques provide?",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.chan39"
    },
    {
        "id": 16063,
        "title": "Emotion Classification using Generative Pre-trained Embedding and Machine Learning",
        "authors": "Geeta Pattun, Pradeep Kumar",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlant59547.2023.10372980"
    },
    {
        "id": 16064,
        "title": "Physics-informed machine learning for programmable photonic circuits",
        "authors": "Isidora Teofilovic, Darko Zibar, Francesco Da Ros",
        "published": "2024-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3017656"
    },
    {
        "id": 16065,
        "title": "A Comparative Study of Machine Learning and Automatic Machine Learning Models for Facial Mask Recognition",
        "authors": "Yuxin Pei",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccs57501.2023.10151333"
    },
    {
        "id": 16066,
        "title": "2023 2nd International Conference on Machine Learning, Cloud Computing, and Intelligent Mining MLCCIM 2023",
        "authors": "",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlccim60412.2023.00001"
    },
    {
        "id": 16067,
        "title": "Highly Parallel Implementation of Machine Learning Algorithms based on Reconfigurable Structures",
        "authors": "Yeqiong Shi, Lu Wang",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424894"
    },
    {
        "id": 16068,
        "title": "Analysis of Machine Learning Based Big Data Mining System for Enterprise Businesses",
        "authors": "Luo Dan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlbdbi60823.2023.10481971"
    },
    {
        "id": 16069,
        "title": "A Predictive Study of Machine Learning and Deep Learning Procedures Over Chronic Disease Datasets",
        "authors": "Nimay Seth",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "People's health and well-being are not given priority in the technological and Internet-savvy world we live in. People are becoming worse because they don't regularly attend the hospital for checkups due to job and unanticipated events. Most people nowadays suffer from one or more chronic illnesses, such as diabetes, hypothyroidism, heart disease, breast cancer, and dermatology. According to the World Health Organization (WHO), these chronic illnesses account for half of all fatalities in most nations and are the main cause of premature mortality. Patients who are identified early on potentially have their condition stop progressing. Many dispersed studies clearly demonstrated that conventional approaches to diagnosing chronic illnesses are prone to prejudice and heterogeneity among physicians, making it difficult to promptly and precisely diagnose problems. Still, Despite the availability of up-to-date information and a variety of machine learning-based methods, there have been enormous published efforts demonstrating that machine learning (ML)/deep learning (DL) based approach can considerably enhance the timely estimation of various health conditions. However, precise diagnosis of such diseases remains a difficulty. There are many machine learning-based techniques and current knowledge available, however despite this, a great deal of published research has shown that machine learning/deep learning based approach can considerably enhance the timely estimation of various health conditions. However, precise diagnosis of such diseases remains a difficulty. In order to tackle this problem, this work uses the UCI/KAGGLE ML/DL disease dataset to evaluate various ML/DL procedures and explores how different machine learning algorithms forecast chronic diseases. Accuracy and confusion matrix are used to verify the results. In order to help inexperienced researchers comprehend the disease prediction function of ML/DL-based techniques and determine the direction of Upcoming research, this study also discusses the advantages and disadvantages of accessible disease prediction schemes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.42.34.47"
    },
    {
        "id": 16070,
        "title": "Overfitting in portfolio optimization",
        "authors": "Matteo Maggiolo, Oleg Szehr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21314/jrmv.2023.005"
    },
    {
        "id": 16071,
        "title": "Empowering Healthcare with Machine Learning: A Comprehensive Review of Machine Learning-based  COVID-19  Detection,  Diagnosis  and  Treatment",
        "authors": "Rupinder Kaur Walia,  ",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24321/2394.6539.202303"
    },
    {
        "id": 16072,
        "title": "Stress-based Classification of Electrocardiogram Signals Before and After Music Therapy using Heart Rate Variability and Machine Learning",
        "authors": "",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "The harmful impacts of excessive stress on people’s health have been widely acknowledged, necessitating effective methods for its identification. Recognizing the importance of early stress detection and intervention, this research aims to contribute to the field of healthcare. To achieve this objective, this study classifies electrocardiogram (ECG) signals by assessing physio-psychological states, specifically stress and examines the role of music therapy in alleviating stress. ECG signals, recorded both before and after a music therapy session, were collected. Using signal processing techniques, essential features were extracted from these ECG signals, resulting in a more accurate identification of stress. Additionally, through experimentation and model evaluation, k-nearest Neighbors (KNN) and Classification and Regression Trees (CART) were determined to be the most effective models for this classification. Both models consistently yielded 90% accuracy. These identified extracted features and models are vital to effectively recognizing stress in ECG signals, offering valuable insights for future studies and clinical applications. This research contributes not only to the development of tools for stress detection but also to the understanding of the therapeutic impact of music.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.05"
    },
    {
        "id": 16073,
        "title": "Efficient surrogate models for materials science simulations: Machine learning-based prediction of microstructure properties",
        "authors": "Binh Duong Nguyen, Pavlo Potapenko, Aytekin Demirci, Kishan Govind, Sébastien Bompas, Stefan Sandfeld",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100544"
    },
    {
        "id": 16074,
        "title": "Development and Practical Application of Cognitive Model of Female Managers' Social Responsibility Based on Machine Learning",
        "authors": "Liting Zhang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00108"
    },
    {
        "id": 16075,
        "title": "Prediction of Mental Health: Heuristic Subjective Well-Being Model on Perceived Stress Scale Using Machine Learning Algorithms",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2023.13.3.1138"
    },
    {
        "id": 16076,
        "title": "Issue Information",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No abstract is available for this article.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jgr1.1"
    },
    {
        "id": 16077,
        "title": "Informal learning from dealing with software-related problems in the digital workplace",
        "authors": "Tamara Vanessa Leiß, Andreas Rausch",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "\nPurpose\nThis paper aims to examine the impact of problem-solving activities, emotional experiences and contextual and personal factors on learning from dealing with software-related problems in everyday office work.\n\n\nDesign/methodology/approach\nTo measure the use of problem-solving activities, emotional experiences and the contextual factors of problem characteristics and learning in situ, a research diary was used. To measure team psychological safety (contextual factor) and personal factors, including the Big Five personality traits, occupational self-efficacy and technology self-efficacy, the authors administered a self-report questionnaire. In sum, 48 students from a software company in Germany recorded 240 diary entries during five working days. The data was analysed using multilevel analysis.\n\n\nFindings\nResults revealed that asking others and using information from the internet are positive predictors of self-perceived learning from a software-related problem, while experimenting, which was the most common activity, had a negative effect on learning. Guilt about the problem was positively related to learning while working in the office (as opposed to remote work), and feeling irritated/annoyed/angry showed a negative effect. Surprisingly, psychological safety had a negative effect on perceived learning.\n\n\nResearch limitations/implications\nMajor limitations of the study concern the convenience sample and the disregard for the sequence of the activities.\n\n\nOriginality/value\nThis study contributes to the limited empirical evidence on employees’ problem-solving activities and informal workplace learning in the software context. To overcome the shortcomings of previous studies using retrospective assessments and in-lab observations, this study uses the diary method to investigate in situ.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/jwl-03-2023-0042"
    },
    {
        "id": 16078,
        "title": "On Possibilities of Learning the Meta Data for Machine Learning Algorithms",
        "authors": "Venkatesh Naganathan,  , Muralidharan N,  ",
        "published": "2023-3-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59567/ktaml.v1.01.02"
    },
    {
        "id": 16079,
        "title": "Kernel Normalized Convolutional Networks for Privacy-Preserving Machine Learning",
        "authors": "Reza Nasirigerdeh, Javad Torkzadehmahani, Daniel Rueckert, Georgios Kaissis",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/satml54575.2023.00016"
    },
    {
        "id": 16080,
        "title": "Analysis of Garbage Image Classification Model Based on Machine Learning",
        "authors": "Xiucui Wang, Xidong Liu",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlccim60412.2023.00055"
    },
    {
        "id": 16081,
        "title": "Machine Learning in Gamification and Gamification in Machine Learning: A Systematic Literature Mapping",
        "authors": "Jakub Swacha, Michał Gracel",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "Albeit in different ways, both machine learning and gamification have transfigured the user experience of information systems. Although both are hot research topics, so far, little attention has been paid to how these two technologies converge with each other. This relation is not obvious as while it is feasible to enhance gamification with machine learning, it is also feasible to support machine learning with gamification; moreover, there are applications in which machine learning and gamification are combined yet not directly connected. In this study, we aim to shed light on the use of both machine learning in gamification and gamification in machine learning, as well as the related topics of using gamification in machine learning education and machine learning in gamification research. By performing a systematic literature mapping, we not only identify prior works addressing these respective themes, but also analyze how their popularity evolved in time, investigate the areas of application reported by prior works, used machine learning techniques and software tools, as well as the character of research contribution and the character of evaluation results for works that presented them.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132011427"
    },
    {
        "id": 16082,
        "title": "Parsimonious Bayesian model-based clustering with dissimilarities",
        "authors": "Samuel Morrissette, Saman Muthukumarana, Maxime Turgeon",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100528"
    },
    {
        "id": 16083,
        "title": "An Autonomous System to Enhance Urban Cleanliness by Identifying and Collecting Trash using AI and Machine Learning",
        "authors": "Zhuowen Wang, Jonathan Sahagun",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "The HawkEyes system, featuring a sophisticated robotic car, is a key innovation in modern waste management. This autonomous vehicle is adeptly equipped with advanced AI and computer vision technology, enabling precise identification and categorization of different waste types. Optimized for city environments, the car navigates autonomously, relying on an AI detection system. Built to withstand a variety of urban conditions, the robotic car is robust and adaptable. Its suite of sensors and cameras are strategically placed, enhancing its ability to detect waste and maneuver effectively in urban areas. As it patrols city streets, the vehicle efficiently identifies locations with accumulated waste, supporting targeted and effective cleanup efforts. In its current iteration, HawkEyes stands as an intelligent and practical solution to urban waste challenges. It fuses technological innovation with real-world application, not only improving the efficiency of waste collection but also contributing to environmental conservation efforts. This robotic car demonstrates the transformative role of AI and robotics in sustainable waste management, showcasing a new frontier in city maintenance and ecological care.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140306"
    },
    {
        "id": 16084,
        "title": "Comparative Analysis of Java and Python in Machine Learning: Investigate and Compare the Suitability and Performance of Java and Python for Machine Learning Tasks",
        "authors": "Atishay Jain",
        "published": "2023-12-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.1223.123305"
    },
    {
        "id": 16085,
        "title": "Exploring the Integration of Machine Learning Models in Programming Languages on GitHub: Impact on Compatibility to Address Them",
        "authors": "",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "GitHub repositories are often used for collaborative development, allowing multiple developers to work on the same codebase and contribute their changes. Each repository is typically associated with a specific project, and it can contain everything from code files to documentation, bug reports, and feature requests. Depending on the context, it can contain files, directories, other resources related to a project, and it is often associated with a particular programming language. By default, GitHub automatically detects the primary programming language used in a repository based on the file extensions and content within the repository. However, this detection is not true all the time; there are some potential issues to consider. One of these problems is that the detected language may not accurately reflect the actual programming languages used in the project, especially if the project utilizes multiple programming languages or has undergone language migrations. In this study, we apply an alternative technology to resolve problems with classifying the programming language of a GitHub repository by analysing file extensions and identifying all programming languages used in the project. We also determine the appropriate primary programming language for the repository. This paper investigates how this technology can address the issues surrounding GitHub’s automatic detection of a repository’s primary programming language and how it can provide information on all the programming languages used in a project.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.06"
    },
    {
        "id": 16086,
        "title": "Developing novel machine-learning-based fire weather indices",
        "authors": "Assaf Shmuel, Eyal Heifetz",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": "Abstract\nAccurate wildfire risk estimation is an essential yet challenging task. As the frequency of extreme fire weather and wildfires is on the rise, forest managers and firefighters require accurate wildfire risk estimations to successfully implement forest management and firefighting strategies. Wildfire risk depends on non-linear interactions between multiple factors; therefore, the performance of linear models in its estimation is limited. To date, several traditional fire weather indices (FWIs) have been commonly used by weather services, such as the Canadian FWI.@Traditional FWIs are primarily based on empirical and statistical analyses. In this paper, we propose a novel FWI that was developed using machine learning—the machine learning based fire weather index (MLFWI). We present the performance of the MLFWI and compare it with various traditional FWIs. We find that the MLFWI significantly outperforms traditional indices in predicting wildfire occurrence, achieving an area under the curve score of 0.99 compared to 0.62–0.80. We recommend applying the MLFWI in wildfire warning systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc008"
    },
    {
        "id": 16087,
        "title": "Machine Learning Algorithms for Survival Analysis: Advantages, Disadvantages, and Examples",
        "authors": "Diego Vallarino",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.51483/ijaiml.4.1.2024.10-21"
    },
    {
        "id": 16088,
        "title": "A survey on sign language literature",
        "authors": "Marie Alaghband, Hamid Reza Maghroor, Ivan Garibay",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100504"
    },
    {
        "id": 16089,
        "title": "Students with learning disabilities/attention-deficit/hyperactivity disorder in higher education dealing with remote learning: lessons learned from COVID-19 era",
        "authors": "Miriam Sarid, Orly Lipka",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "IntroductionThe current study aimed to examine how students with learning disabilities (LD) and/or attention-deficit/hyperactivity disorder (ADHD) adjusted to higher education during the transition to remote learning (RL) in Israel during the COVID-19 pandemic.MethodsThe study involved 621 undergraduate students, 330 of whom participated during the COVID-19 pandemic and 291 before the pandemic. Among these students, 198 had been diagnosed with LD and/or ADHD, while 423 had no reported disabilities (control group).ResultsStudents with LD/ADHD generally had lower adjustment scores during face-to-face learning and RL than the control group. In-depth analyses of four subgroups revealed that students with LD + ADHD reported lower academic, emotional, and institutional adjustments as well as reported lower satisfaction with life during RL than the control group members. ADHD was found to directly predict low satisfaction with life through the mediation of adjustment scores.DiscussionIn conclusion, it is recommended that support be provided to high-risk LD/ADHD populations during a crisis. Furthermore, the implication of this study can inform intervention during emergency times.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpsyg.2023.1172771"
    },
    {
        "id": 16090,
        "title": "Gradient-Free Kernel Conditional Stein Discrepancy goodness of fit testing",
        "authors": "Elham Afzali, Saman Muthukumarana",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100463"
    },
    {
        "id": 16091,
        "title": "Mathematical Modeling of Cancers Using Machine Learning Algorithms",
        "authors": "",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "This paper shows a mathematical modeling method using different machine learning algorithms for prediction of probability of procuring Pancreatic Cancer (PC). Each algorithm reports its own accuracy, precision, recall and F1-score. Also, a Bayesian network model is used to determine the probability each subject has in contracting PC on the basis of certain preconditions, like his dietary habits and other biological attributes. This paper makes use of the PC dataset as provided by the National Cancer Institute in collaboration with National Institute of Health (NIH). The features obtained from this dataset can have either a binary value or a scalar value. The dataset consists of three questionnaires distributed to 155000 subjects. In each of these questionnaires, the subject is asked about his dietary habits and illness history.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/ijcrt.08.03.07"
    },
    {
        "id": 16092,
        "title": "Detecting Stealthy Cobalt Strike C&amp;C Activities via Multi-Flow based Machine Learning",
        "authors": "Fabian Martin Ramos, Xinyuan Wang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00332"
    },
    {
        "id": 16093,
        "title": "Benefits of Using Multiple Post-Hoc Explanations for Machine Learning",
        "authors": "Corentin Boidot, Olivier Augereau, Pierre De Loor, Riwal Lefort",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00116"
    },
    {
        "id": 16094,
        "title": "User-friendly Introduction to PAC-Bayes Bounds",
        "authors": "Pierre Alquier",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/2200000100"
    },
    {
        "id": 16095,
        "title": "Automatic Protein Sequences Classification Using Machine Learning Methods based on N-Gram Model",
        "authors": "Chengen Zou",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3650215.3650382"
    },
    {
        "id": 16096,
        "title": "Analogical inference from distributional structure: What recurrent neural networks can tell us about word learning",
        "authors": "Philip A. Huebner, Jon A. Willits",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100478"
    },
    {
        "id": 16097,
        "title": "Model-based Reinforcement Learning: A Survey",
        "authors": "Thomas M. Moerland, Joost Broekens, Aske Plaat, Catholijn M. Jonker",
        "published": "2023",
        "citations": 97,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/2200000086"
    },
    {
        "id": 16098,
        "title": "Multi-Modal Machine Learning for Navigating Noisy Objectives of Automotive Manufacturing Quality Inspection",
        "authors": "Majid Shirazi, Georgii Safronov, Amr Rizk",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00284"
    },
    {
        "id": 16099,
        "title": "Artificial (military) intelligence: enabling decision dominance through machine learning",
        "authors": "Kyle P. Hanratty",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2663413"
    },
    {
        "id": 16100,
        "title": "Machine learning and genomics – way forward for early identification and outcomes in autism?",
        "authors": "Kristiina Tammimies",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14293/gof.23.04"
    },
    {
        "id": 16101,
        "title": "Forecasting Time Series AQI Using Machine learning of Haryana Cities Using Machine Learning",
        "authors": "Reema Gupta, Priti Singla",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "In India and throughout the world, air pollution is becoming a severe worry day by day. Governments and the general public have grown more concerned about how air pollution affects human health. Consequently, it is crucial to forecast the air quality with accuracy. In this paper, Machine learning methods SVR and RFR were used to build the hybrid forecast model to predict the concentrations of Air Quality Index in Haryana Cities. The forecast models were built using air pollutants and meteorological parameters from 2019 to 2021 and testing and validation was conducted on the air quality data for the year 2022 of Jind and Panipat city in the State of Haryana. Further, performance of hybrid forecast model was enhanced using scalar technique and performance was evaluated using various coefficient metrics and other parameters. First, the important factors affecting air quality are extracted and irregularities from the dataset are removed. Second, for forecasting AQI various approaches have been used and evaluation is carried out using performance metrics. The experimental results showed that the proposed hybrid model had a better forecast result than the standard Random forest Regression, Support Vector Regression and Multiple Linear Regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47164/ijngc.v14i4.1267"
    },
    {
        "id": 16102,
        "title": "Fine-tuning is not (always) overfitting artifacts",
        "authors": "Jérémie Bogaert, Emmanuel Jean, Cyril de Bodt, François-Xavier Standaert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-152"
    },
    {
        "id": 16103,
        "title": "Prediction Method of Sand Body Lithology Based on Machine Learning Algorithm and Dual Optimization of Attribute Characteristics",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040107"
    },
    {
        "id": 16104,
        "title": "The Machine learning for predictive maintenance in supply chain management",
        "authors": "Krishnamoorthy Selvaraj, Lakshmanan Lakshmanan",
        "published": "2023-9-19",
        "citations": 0,
        "abstract": "It has recently come to light that one of the most important applications of machine learning in a variety of sectors, including supply chain management, is predictive maintenance. The purpose of this research is to investigate the use of machine learning strategies for predictive maintenance within the framework of supply chain management. Traditional procedures of maintenance often cause inefficiencies and interruptions in the supply chain as a result of unanticipated breakdowns of various pieces of equipment. It is possible to greatly improve both the reliability and performance of supply chain operations via the use of predictive maintenance approaches. This article starts out by giving an overview of predictive maintenance and the role that it plays in supply chain management. The issues that are presented by unanticipated equipment failures and the cascade consequences that these failures have on the supply chain are discussed. In the context of predictive maintenance, a number of different techniques to machine learning, including supervised learning, unsupervised learning, and deep learning, are analyzed and discussed. In addition to this, the study digs into data-gathering strategies, discussing topics such as sensor data, past maintenance records, and external influences that might influence the health of equipment. In addition, the article discusses the implementation issues that are associated with installing predictive maintenance systems in supply chain environments. Some of these challenges include data quality and integration, real-time decision-making, cost concerns, and others. This paper investigates the role that edge computing and industrial Internet of Things (IoT) devices play in making data gathering, analysis, and preventative maintenance more efficient.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55124/jaim.v1i1.233"
    }
]