[
    {
        "id": 6501,
        "title": "Area Under the Curve (AUC)",
        "authors": "J. Rick Turner",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-39903-0_986"
    },
    {
        "id": 6502,
        "title": "Area Under the Curve (AUC)",
        "authors": "Stephen Walters",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-17299-1_107"
    },
    {
        "id": 6503,
        "title": "1570. Association Between Vancomycin Area Under the Curve (AUC) and Nephrotoxicity",
        "authors": "Anna Poston-Blahnik, Ryan P Moenster",
        "published": "2019-10-23",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nIt is unclear whether increased vancomycin area under the curve (AUC) contributes to acute kidney injury (AKI) risk.\n\n\nMethods\nThis retrospective cohort study was undertaken to determine whether vancomycin AUC > 550 is associated with a higher rate of AKI than an AUC < 550. Patients treated with vancomycin for at least 4 days at the St. Louis VA from 1/1/2016–9/31/2018 were included. The primary outcome was AKI (defined as an increase in serum creatinine by 0.3 mg/dL or 50% from baseline). Secondary outcomes included length of stay, readmission, or mortality in 30 days, AKI rate with concurrent antibiotics, and AKI rate with comorbidities. The AUC was calculated as daily dose (in mg) divided by vancomycin clearance. The variables of age ≥ 70, vancomycin AUC ≥ 550, creatinine clearance (CrCl) < 50 mL/minute, concomitant antibiotic administration, vancomycin treatment ≤ 7 days, and the presence of comorbidities were included in a bivariate analysis. Variables with a P-value of <0.2 were included in a multivariate logistic regression model.\n\n\nResults\nTwo hundred patients were included in the analysis; 100 patients with an AUC ≥ 550, and 100 with an AUC < 500. Only mean vancomycin dose (1722.50 mg vs. 2361.25 mg; P < 0.05), mean AUC (465.88 vs. 696.45; P < 0.05), and peak SCr (1.22 mg/dL vs. 1.48 mg/dL; P = 0.015) were significantly different between groups; AUC < 550 vs. AUC ≥ 550, respectively. Acute kidney injury occurred in 22% (44/200) of all patients; 42% (42/100) with a calculated AUC ≥ 550 developed AKI compared with 2% (2/100) of patients with an AUC < 550 (P < 0.05). The secondary outcomes of concomitant nephrotoxic agents, length of stay, readmission at 30 days, and 30-day mortality were not significantly different between groups. Only age ≥ 70, vancomycin AUC ≥ 550, CrCl < 50 mL/minute, concomitant piperacillin–tazobactam administration, and the presence of comorbidities were included in the multivariate regression. Age ≥ 70, CrCl < 50 mL/minute, and AUC ≥ 550 [OR 49.5 (95% CI 10.1 – 242.3; P < 0.05)] were found to be independently associated with risk for developing AKI.\n\n\nConclusion\nPatients with a calculated vancomycin AUC ≥ 550 were found to have a significantly higher rate of AKI compared with those with an AUC < 550.\n\n\nDisclosures\nAll authors: No reported disclosures.\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofz360.1434"
    },
    {
        "id": 6504,
        "title": "Relationship between Vancomycin Area Under the Concentration-Time Curve (AUC) and Nephrotoxicity in Adults",
        "authors": "David Allen, Mary Townsend, Richard Drew",
        "published": "2017-10-1",
        "citations": 1,
        "abstract": "Abstract\n\nBackground\nWhile recent data correlate vancomycin’s ratio of the area under the 24 hour time-concentration curve (AUC0−24h) to the pathogen’s minimal inhibitory concentration (MIC) of &gt; 400 mg*hours/L with a favorable clinical outcome, data are sparse to correlate vancomycin AUC0−24h to nephrotoxicity. Our primary objective was to evaluate the relationship between vancomycin AUC0−24h and nephrotoxicity.\n\n\nMethods\nThis single-center, retrospective cohort study was conducted at a large US tertiary-care hospital. Adults hospitalized between 08/01/13 and 08/31/14 with normal baseline renal function receiving intravenous vancomycin ≥ 72 hours were included. Vancomycin AUC0−24h was calculated for each subject utilizing computer-based Bayesian pharmacokinetic methods (BestDose™). Subjects were divided into AUC0−24h of &lt; 700 and &gt; 700 mg*hours/L groups. The primary endpoint of nephrotoxicity (defined as a 50% relative increase or &gt; 0.5 mg/dl absolute increase in SCr over at least 2 consecutive days) was compared between exposure groups. Secondary objectives were to compare the incidence of nephrotoxicity with and without the following risk factors: sepsis, concomitant nephrotoxins, vancomycin troughs &gt; 20 mg/L or doses ≥ 4 g/day, and Charlson Comorbidity Index scores.\n\n\nResults\nTable 1. Multivariate Model of Nephrotoxicity and Clinical Characteristics\n\n\nConclusion\nA significant increase in nephrotoxicity was observed in patients with a vancomycin AUC0−24h ≥ 700 mg*hours/L. Given that this exposure threshold is within the target for efficacy for organisms with elevated MICs, further studies should be conducted to better delineate the AUC0−24h values associated with nephrotoxicity.\n\n\nDisclosures\nAll authors: No reported disclosures.\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofx163.676"
    },
    {
        "id": 6505,
        "title": "Evaluating Performance of Software Defect Prediction Models Using Area Under Precision-Recall Curve (AUC-PR)",
        "authors": "Shahzad Ali Khan, Zeeshan Ali Rana",
        "published": "2019-2",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/icacs.2019.8689135"
    },
    {
        "id": 6506,
        "title": "Preoperative cognitive performance, age and the choice of the main anaesthetics influence the Area Under the Curve (AUC) of intra-operative cerebral burst suppression (BS) as measured by the depth-of-anaesthesia monitor NeuroSENSE®",
        "authors": "Guillaume Lemaire",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26226/morressier.58f5b032ab9a5f002a4cb564"
    },
    {
        "id": 6507,
        "title": "ImbTreeAUC: An R package for building classification trees using the area under the ROC curve (AUC) on imbalanced datasets",
        "authors": "Krzysztof Gajowniczek, Tomasz Ząbkowski",
        "published": "2021-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.softx.2021.100755"
    },
    {
        "id": 6508,
        "title": "PCN92 An Investigation of Estimation Efficiency of Area UNDER the Curve (AUC) Using Parametric Models",
        "authors": "S. I. Manjula, D.B.C. Wu",
        "published": "2020-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.vhri.2020.07.142"
    },
    {
        "id": 6509,
        "title": "Characteristics and calculations of paired vancomycin measurements for determination of 24-h area-under-curve (AUC)",
        "authors": "Yutao Deng, Zachary W. Rebollido, Matthew A. Pettengill, Douglas F. Stickle",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.plabm.2023.e00310"
    },
    {
        "id": 6510,
        "title": "1391. Vancomycin Area Under the Curve (AUC) to Predict Nephrotoxicity: A Systematic Review and Meta-Analysis of Observational Studies",
        "authors": "Doaa Aljefri, Sean Avedissian, Nathaniel J Rhodes, Michael Postelnick, Marc H Scheetz",
        "published": "2018-11-26",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nRecent studies have proposed monitoring vancomycin area under the curve (AUC) as a more precise method of attaining goal exposures compared with trough monitoring. Different dosing methods and different exposure-toxicity thresholds have been proposed. Therefore, we aimed to analyze the relationship between vancomycin AUC and nephrotoxicity reported across recent studies.\n\n\nMethods\nA systematic review of Pubmed, Medline, Scopus and compiled references was conducted. We included randomized, cohorts and case–control studies that reported vancomycin AUCs and risk of nephrotoxicity from (January 1, 1990 to January 31, 2018). The primary outcome was nephrotoxicity, defined as an increase in serum creatinine of ≥0.5 mg/L or a 50% increase from baseline on two or more consecutive measurements. Odds ratios (ORs) with 95% confidence intervals (95% CIs) were calculated. Subset analyses were conducted when possible on the impact of AUC0-24 hours and AUC24-48 hoursr exposures and AUC vs. trough guided dosing on the outcome of nephrotoxicity. AUC nephrotoxicity thresholds ranged between 550 and 700 mg hour/L. We grouped values according to lower (i.e., &lt;650) or higher average AUC, with a threshold value of ≥650 mg hour/L defining higher AUC based on a recent prospective trial.\n\n\nResults\nWe identified eight eligible observational studies with a total of 2,491 patients. Of those, five studies reported AUC0-24 associated with nephrotoxicity, two studies reported AUC24-48, and two studies reported nephrotoxicity associated with AUC vs. trough-guided dosing. No RCTs were identified. Lower AUC0-24 values were associated with significantly reduced risk of nephrotoxicity (OR 0.36, 95% CI 0.23–0.56). In a sub-analysis of two studies, AUC24-48&lt;650 mg hour/L was associated with significantly lower risk of nephrotoxicity (OR 0.45, 95% CI 0.27–0.75). Nephrotoxicity associated with AUC-guided dosing was significantly lower than trough-guided dosing (OR 0.68, 95% CI 0.46–0.99).\n\n\nConclusion\nThis meta-analysis suggests that AUC0-24 lower than 650 mg hour/L may result in a decreased risk of nephrotoxicity. AUC-guided vancomycin dosing may result in less vancomycin-associated nephrotoxicity. Additional investigations into the benefit of AUC-guided dosing are warranted.\n\n\n\n\n\nDisclosures\nAll authors: No reported disclosures.\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofy210.1222"
    },
    {
        "id": 6511,
        "title": "Agreement Between Two-Concentration and One-Concentration Area Under the Curve (AUC) Estimates When Using Bayesian Modeling to Dose Vancomycin in Patients With Obesity",
        "authors": "Elizabeth W. Covington, Addison M. Watkins",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "Background: Vancomycin Bayesian modeling provides 24-hour area under the curve (AUC24) estimations. However, the agreement between two-concentration and one-concentration Bayesian estimates in patients with obesity is unknown. Objective: The purpose of this study was to determine the agreement between two-concentration and one-concentration Bayesian AUC24 estimates in patients with obesity receiving vancomycin. Methods: This retrospective within-subjects cohort study included patients with obesity and two vancomycin concentrations. The first concentration was hidden from dosing software to record the one-concentration AUC24. AUC24 estimates were categorized into 1 of 3 groups: <400, 400 to 600, or >600 mg*h/L. Patients were excluded for vancomycin duration less than 48 hours or renal dysfunction. The primary outcome was AUC24 agreement with two versus one concentration. Secondary outcomes included the AUC24 category, matching of AUC24 categorization, and correlation between two-concentration versus one-concentration AUC24. AUC24 estimate agreement was assessed by Bland Altman plot and bias via linear regression. Statistical analyses were performed using SPSS (version 20.0). Results: A total of 31 patients were included. The mean difference in AUC24 between two versus one concentration was 11.4 mg*h/L (95% limits of agreement = −72 to 95 mg*h/L). Linear regression indicated the presence of proportional bias at higher AUC24 values (β = 0.16; P = 0.015). Matching of AUC24 categorization with two versus one concentration was 87% (27/31 patients). Conclusion and Relevance: This study demonstrated overall agreement between AUC24 estimates when using two versus one vancomycin concentration in patients with obesity, though proportional bias was detected at higher AUC24. Future studies with larger sample sizes are needed to confirm these results. ",
        "link": "http://dx.doi.org/10.1177/10600280231190910"
    },
    {
        "id": 6512,
        "title": "Area Under Curve",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/jhg452"
    },
    {
        "id": 6513,
        "title": "Rethinking Efficiency: Area Under the Curve (Auc) as a Low-Input Proxy for Improving the Accuracy of Finishing within Beef Systems",
        "authors": "Andrew S. Cooke, Phil Le Grice, Graham A. McAuliffe, Michael R. F. Lee, Jordana M. Rivero",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4116002"
    },
    {
        "id": 6514,
        "title": "Predicting the Area under the Plasma Concentration-Time Curve (AUC) for First Dose Vancomycin Using First-Order Pharmacokinetic Equations",
        "authors": "Kritsaporn Sujjavorakul, Wasan Katip, Stephen J. Kerr, Noppadol Wacharachaisurapol, Thanyawee Puthanakit",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "To treat critically ill patients, early achievement of the target area under the plasma concentration-time curve/minimum inhibitory concentration (AUC/MIC) in the first 24 h is recommended. However, accurately calculating the AUC before steady state is an obstacle to this goal. A first-order pharmacokinetic equation to calculate vancomycin AUC after a first dose of vancomycin has never been studied. We sought to estimate AUC using two first-order pharmacokinetic equations, with different paired concentration time points, and to compare these to the actual first dose vancomycin AUC calculated by the linear-log trapezoid rule as a reference. The equations were validated using two independent intensive first dose vancomycin concentration time data sets, one from 10 adults and another from 14 children with severe infection. The equation with compensation for the alpha distribution phase using a first vancomycin serum concentration from 60 to 90 min and the second concentration from 240 to 300 min after the completed infusion showed good agreement and low bias of calculated AUC, with mean differences <5% and Lin’s correlation coefficient >0.96. Moreover, it gave an excellent correlation with Pearson’s r > 0.96. Estimating the first dose vancomycin AUC calculated using this first-order pharmacokinetic equation is both reliable and reproducible in clinical practice settings.",
        "link": "http://dx.doi.org/10.3390/antibiotics12040630"
    },
    {
        "id": 6515,
        "title": "Doing More With Less: Pragmatic Implementation of Vancomycin Area-Under-the-Curve (AUC) Monitoring",
        "authors": "Joanne Huang, Jeannie D. Chan, Thu Nguyen, Rupali Jain, Zahra Kassamali Escobar",
        "published": "2023-2",
        "citations": 2,
        "abstract": " Universal area-under-the-curve (AUC) guided vancomycin therapeutic drug monitoring (TDM) is resource-intensive, cost-prohibitive, and presents a paradigm shift that leaves institutions with the quandary of defining the preferred and most practical method for TDM. We report a step-by-step quality improvement process using 4 plan-do-study-act (PDSA) cycles to provide a framework for development of a hybrid model of trough and AUC-based vancomycin monitoring. We found trough-based monitoring a pragmatic strategy as a first-tier approach when anticipated use is short-term. AUC-guided monitoring was most impactful and cost-effective when reserved for patients with high-risk for nephrotoxicity. We encourage others to consider quality improvement tools to locally adopt AUC-based monitoring. ",
        "link": "http://dx.doi.org/10.1177/08971900211027271"
    },
    {
        "id": 6516,
        "title": "FRI0118 Clinical utility of area-under-curve (AUC) of patient-derived disease activity score (PDAS2) between clinic visits on remission, flare up and rheumatologist's decision to escalate anti-rheumatic drugs",
        "authors": "M-HA Leung, E Choy, CS Lau",
        "published": "2017-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1136/annrheumdis-2017-eular.2788"
    },
    {
        "id": 6517,
        "title": "Area Under First Moment Curve",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/hsrohx"
    },
    {
        "id": 6518,
        "title": "Area Under the Curve Ratio",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/9yr4if"
    },
    {
        "id": 6519,
        "title": "Area Under the Curve All",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/r1lno0"
    },
    {
        "id": 6520,
        "title": "The Area under the Curve (AUC) of Oral Glucose Tolerance Test (OGTT) Could Be a Measure Method of Hyperglycemia in All Pregnant Women",
        "authors": "Congyue Zhang, Yumei Wei, Weijie Sun, Huixia Yang",
        "published": "2019",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4236/ojog.2019.92019"
    },
    {
        "id": 6521,
        "title": "Predicted Area Under the Curve Infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/tivriq"
    },
    {
        "id": 6522,
        "title": "Observed Area Under the Curve Infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/k34jsl"
    },
    {
        "id": 6523,
        "title": "Area Under Urinary Excretion Rate Curve",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/pzszve"
    },
    {
        "id": 6524,
        "title": "Accumulation Ratio Area Under the Curve",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/dylxdd"
    },
    {
        "id": 6525,
        "title": "Stationarity Ratio Area Under the Curve",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/4elxnw"
    },
    {
        "id": 6526,
        "title": "Transforming the Area under the Normal Curve (AUC) into Cohen’s d, Pearson’s r pb , Odds-Ratio, and Natural Log Odds-Ratio: Two Conversion Tables",
        "authors": "Jesús F. Salgado",
        "published": "2018",
        "citations": 82,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5093/ejpalc2018a5"
    },
    {
        "id": 6527,
        "title": "Predicted Area Under the Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/nbye60"
    },
    {
        "id": 6528,
        "title": "Area Under the Curve Ratio Infinity Observed",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/e693u8"
    },
    {
        "id": 6529,
        "title": "Observed Area Under the Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/daj1zv"
    },
    {
        "id": 6530,
        "title": "Area Under the First Moment Curve All",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/1epym1"
    },
    {
        "id": 6531,
        "title": "Endogenous Thrombin Potential Area Under Curve Measurement",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/4zvw3o"
    },
    {
        "id": 6532,
        "title": "Area Under the Curve Over Dosing Interval",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/xi325u"
    },
    {
        "id": 6533,
        "title": "Area Under the Curve Ratio Infinity Predicted",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/uw1zv8"
    },
    {
        "id": 6534,
        "title": "1326. Vancomycin Area Under the Concentration-Time Curve (AUC) Estimation Using a Bayesian Approach Versus First-Order Pharmacokinetic Equations: A Pilot Study",
        "authors": "Jeffrey Pearson, Yazed S Alsowaida, B S Pharm, David W Kubiak, Mary P Kovacevic, Brandon Dionne",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nCurrent guidelines endorse area under the concentration-time curve (AUC)-based monitoring over trough-only monitoring for systemic vancomycin. Vancomycin AUC can be estimated using either Bayesian modeling software or first-order pharmacokinetic (PK) calculations. The objective of this pilot study was to evaluate and compare the efficiency and feasibility of these two approaches for calculating the estimated vancomycin AUC.\n\n\nMethods\nA single-center crossover study was conducted in four medical/surgical units at Brigham and Women’s Hospital over a 3-month time period. All adult patients who received vancomycin were included. Patients were excluded if they were receiving vancomycin for surgical prophylaxis, were on hemodialysis, if vancomycin was being dosed by level, or if vancomycin levels were never drawn. The primary endpoint was the amount of time study team members spent calculating the estimated AUC and determining regimen adjustments with Bayesian modeling compared to first-order PK calculations. Secondary endpoints included the number of vancomycin levels drawn and the percent of those drawn that were usable for AUC calculations.\n\n\nResults\nOne hundred twenty-four patients received vancomycin during the study, of whom 47 met inclusion criteria. The most likely reasons for exclusion were receiving vancomycin for surgical prophylaxis (n=40) or never having vancomycin levels drawn (n=32). The median time taken to assess levels in the Bayesian arm was 9.3 minutes [interquartile range (IQR) 7.8-12.4] versus 6.8 minutes (IQR 4.8-8.0) in the 2-level PK arm (p=0.004). However, if Bayesian software is integrated into the electronic health record (EHR), the median time to assess levels was 3.8 minutes (IQR 2.3-6.8, p=0.019). In the Bayesian arm, 30 of 34 vancomycin levels (88.2%) were usable for AUC calculations, compared to 28 of 58 (48.3%) in the 2-level PK arm.\n\n\nConclusion\nWith EHR integration, the use of Bayesian software to calculate the AUC was more efficient than first-order PK calculations. Additionally, vancomycin levels were more likely to be usable in the Bayesian arm, thereby avoiding delays in estimating the vancomycin AUC.\n\n\nDisclosures\nAll Authors: No reported disclosures\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofaa439.1508"
    },
    {
        "id": 6535,
        "title": "The dynamic detection of drug area under curve (AUC) guides clinical usage of docetaxel in solid tumors.",
        "authors": "Yan Zhang, Yuan Wu, Xiaomei Zhang, Deliang Yang, Bo Shen, Geyu Liang, Martin Qi",
        "published": "2019-5-20",
        "citations": 0,
        "abstract": " 3024  Background: The dosage of most chemotherapy drugs were performed based on the patients’ body surface area (BSA), including docetaxel (DTX). Previous studies showed that this conventional administration of DTX might cause adverse event, such as neutropenia, and neutropenia was proved to associate with DTX area under curve (AUC). This study was designed to evaluate the effect of dose-administration of DTX based on dynamic detection of DTX AUC on clinical outcomes. Methods: A total of 209 patients with DTX chemotherapy (one cycle every 3 weeks) were enrolled, and all patients received 2-6 cycles of treatment. In the first cycle, dosage of DTX based on BSA was administrated in all study population. From the second cycle, one group patients (control group) received DTX according to traditional BSA and the other group patients (experimental group) on the basis of dynamic detection of DTX AUC. The primary outcome was incidence rate of neutropenia and the second outcome was disease control rate (DCR). Results: Patients with grade 3 or higher neutropenia from the fourth to sixth cycle of DTX chemotherapy were significantly lower in the experimental group compared with the control group (P= 0.039, 0.012, and 0.001, respectively). In the experimental group, compared with the first cycle, and the number of patients falling within the therapeutic window increased by 27.19% in the sixth cycle after dose adjustment according to the AUC value of previous cycle. The DCR in the experimental and control group is 85.32% and 72.00%, respectively (P= 0.018). Conclusions: The administration method based on dynamic detection of AUC of DTX could significantly reduce incidence rate of neutropenia and received a higher DCR, but the result needed to be confirmed in further studies. ",
        "link": "http://dx.doi.org/10.1200/jco.2019.37.15_suppl.3024"
    },
    {
        "id": 6536,
        "title": "Empirical Comparison of Area under ROC curve (AUC) and Mathew Correlation Coefficient (MCC) for Evaluating Machine Learning Algorithms on Imbalanced Datasets for Binary Classification",
        "authors": "Chongomweru Halimu, Asem Kasem, S. H. Shah Newaz",
        "published": "2019-1-25",
        "citations": 51,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3310986.3311023"
    },
    {
        "id": 6537,
        "title": "Predicted Area Under the First Moment Curve Infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/x4ckrx"
    },
    {
        "id": 6538,
        "title": "Predicted Area Under the Curve Infinity by Dose",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ii0uu1"
    },
    {
        "id": 6539,
        "title": "Area Under the Curve from T1 to T2",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/t6ubqc"
    },
    {
        "id": 6540,
        "title": "Observed Area Under the Curve Percent Back Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/rls2hj"
    },
    {
        "id": 6541,
        "title": "Predicted Area Under the Curve Percent Back Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/dwb1ax"
    },
    {
        "id": 6542,
        "title": "Observed Area Under the Curve Infinity by Dose",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/am54th"
    },
    {
        "id": 6543,
        "title": "Observed Area Under the First Moment Curve Infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/4x1wa6"
    },
    {
        "id": 6544,
        "title": "P01.07 Real World Outcomes of Advanced Non-Small Cell Lung Cancer (NSCLC) With Attention to Carboplatin Area Under the Curve (AUC) = 5 Versus 6",
        "authors": "L. Fitzgerald, J. Sinnott, A. Trunk, A. Chalmers, W. Akerley, S. Patel",
        "published": "2021-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jtho.2021.01.331"
    },
    {
        "id": 6545,
        "title": "Successful Treatment of Invasive MRSA Infections in Children Using Area Under the Vancomycin Concentration-Time Curve Divided by the Minimum Inhibitory Concentration (AUC/MIC) to Measure Vancomycin Exposure",
        "authors": "Leslie Chiang, Alice Pong, John Bradley, Paige Anderson, William Murray",
        "published": "2021-7",
        "citations": 0,
        "abstract": "Background: Vancomycin is the treatment of choice for invasive methicillin-resistant Staphylococcus aureus (MRSA) infections. Previous guidelines issued by the Infectious Diseases Society of America (IDSA) recommended targeting vancomycin serum trough concentrations of 15–20 mg/L; however, troughs <15 mg/L are also associated with increased odds of renal toxicity. To minimize toxicity, recently updated ASHP/IDSA/PIDS vancomycin dosing guidelines recommend the use of an area under the vancomycin concentration-time curve divided by the minimum inhibitory concentration (AUC/MIC) pharmacodynamic index to measure vancomycin exposure, with an AUC/MIC ratio >400 correlating with clinical efficacy. However, data on vancomycin therapeutic drug monitoring (TDM) in children are limited. Our institutional practice since January 2009 has been to use AUC/MIC, rather than serum trough concentrations, to guide vancomycin dosing. In this study, we describe clinical outcomes in vancomycin-treated children with invasive MRSA infections using this dosing method. Methods: We performed a retrospective chart review of children hospitalized with invasive MRSA infections between 2006 and 2019 at Rady Children’s Hospital in San Diego, California. Clinical, microbiologic, and pharmacologic data including the site of MRSA infection, clinical failure or cure, occurrence of acute kidney injury (AKI), vancomycin MIC, vancomycin AUC, and serum trough concentrations were collected. Results: In total, 61 invasive MRSA cases were reviewed: 20 were admitted January 2016 through December 2008, and 41 were admitted January 2009 through June 2019 (Figure 1). Most patients did not have medical comorbidities. The most common types of infections were primary bacteremia (34%) and osteomyelitis (32%). Of 61 children, 50 (82%) had positive clinical outcomes regardless of vancomycin dosing method. Of 20 patients, 8 (40%) admitted prior to January 2009 developed AKI, compared with 5 (12%) of 41 patients admitted after January 2009. Conclusions: In our retrospective review, most patients had clinically successful outcomes regardless of which dosing strategy was used. We found higher rates of renal toxicity in patients who were admitted prior to 2009, with TDM based on measuring peak and trough concentrations, compared with those using AUC/MIC for TDM. Our findings suggest that AUC/MIC TDM for invasive MRSA infections may be associated with lower rates of renal toxicity.Funding: NoDisclosures: None",
        "link": "http://dx.doi.org/10.1017/ash.2021.57"
    },
    {
        "id": 6546,
        "title": "Evaluating the Safety of Trough Versus Area Under the Curve (AUC)-Based Dosing Method of Vancomycin With Concomitant Piperacillin-Tazobactam",
        "authors": "Cassandra Karas, Kyle Manning, Darrell T. Childress, Elizabeth W. Covington, Melanie M. Manis",
        "published": "2022-8",
        "citations": 3,
        "abstract": " Background: Vancomycin and piperacillin-tazobactam (VPT) is a common antibiotic combination used in hospitals, and there has been increasing data indicating that the combination is associated with increased rates of acute kidney injury (AKI). It is unclear if the dosing method of vancomycin would mitigate the risk of AKI seen with VPT. Objective: To observe and compare incidence of AKI in patients on VPT when using the trough-based dosing method versus the area-under-the-curve (AUC)-based dosing method. Methods: This was a multi-center, retrospective, observational study at 3 community hospitals. Adults receiving at least 48 hours of VPT were included. Patients with severe renal dysfunction, pregnant patients, prisoners, and patients with central nervous system infections, or malignancy were excluded. The primary outcome was incidence of AKI as defined by the Infectious Disease Society of America (IDSA) criteria. Results: A total of 300 patients were included in the study; 150 patients in both the trough and AUC groups. A total of 23 patients (15%) in the trough group and 17 patients (11%) in the AUC group met the primary outcome (odds ratio [OR]: 0.7058, 95% confidence interval [CI]: [0.3603, 1.3826], P = .3098). Conclusion and Relevance: The incidence of AKI was lower in the AUC group compared with the trough group; however, this was not significant. The results of our study suggest that there is no difference between incidence of AKI when using trough- or AUC-based dosing in those receiving VPT. Because of the small sample size and retrospective nature of the study, more data are needed. ",
        "link": "http://dx.doi.org/10.1177/87551225221101736"
    },
    {
        "id": 6547,
        "title": "Why Risk Factors Minimally Change the ROC Curve AUC",
        "authors": "Ralph H. Stern",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractNovel risk factors that improve statistical measures of fit on addition to established clinical prediction models often minimally change measures of discrimination (ROC curve AUC or c-index). As a result, measures of discrimination have been suggested to be insensitive in the evaluation of such models.To understand this phenomenon, it is necessary to focus on the population risk distributions produced by models with and without the risk factor. This is because these risk distribution fully determines the risk distributions of cases/patients and controls/nonpatients, which in turn fully determine the ROC curve and its AUC. Broader population risk distributions result in larger ROC curve AUCs.A fully independent risk factor with a relative risk of 2 added to the standard cardiovascular risk model produces risk distributions of those with or without the risk that are clearly different (which is evaluated by statistical measures of fit), while minimally broadening the population risk distributions (which is evaluated by measures of discrimination). The reason for this is that although addition of the risk factor replaces every risk stratum with higher and lower risk strata, this depopulated risk stratum is largely repopulated by similar splitting in neighboring risk strata. The interweaving of the the up and down migration paths to and from every point on the risk distribution results in a largely compensatory shuffling of risk assignments with minimal changes in the ROC curve AUC.",
        "link": "http://dx.doi.org/10.1101/2022.02.24.22271481"
    },
    {
        "id": 6548,
        "title": "Predicted Area Under the Urinary Excretion Rate Curve Infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/r6kwws"
    },
    {
        "id": 6549,
        "title": "Area Under Curve",
        "authors": "",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_918"
    },
    {
        "id": 6550,
        "title": "Predicted Area Under the Curve Infinity of Unbound Drug",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/20i6pb"
    },
    {
        "id": 6551,
        "title": "Observed Area Under the Curve Infinity of Unbound Drug",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/uiovzb"
    },
    {
        "id": 6552,
        "title": "Area Under the First Moment Curve Over Dosing Interval",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/tb7rab"
    },
    {
        "id": 6553,
        "title": "Observed Area Under the First Moment Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/fsghup"
    },
    {
        "id": 6554,
        "title": "Predicted Area Under the First Moment Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/io5zrr"
    },
    {
        "id": 6555,
        "title": "Natural Log Transformed Observed Area Under the Curve Infinity",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/hilhl2"
    },
    {
        "id": 6556,
        "title": "Area Under the Curve From Dosing to Last Concentration",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/zjwyw4"
    },
    {
        "id": 6557,
        "title": "Observed Area Under the Urinary Excretion Rate Curve infinity",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/mp4xwk"
    },
    {
        "id": 6558,
        "title": "1097. A Comparison of Area-Under Curve (AUC)-Guided vs Trough-Guided Monitoring of Vancomycin and Its Impact on Nephrotoxicity: A Systematic Review and Meta-analysis",
        "authors": "Ashley Shiyuan Lim, Jun Jie Benjamin Seng, Tao Tao Magdeline Ng, Hui Ting Chng, Zhe Han",
        "published": "2021-12-4",
        "citations": 1,
        "abstract": "Abstract\n\nBackground\nTrough levels have been used for Vancomycin (VAN) therapeutic drug monitoring (TDM) historically due to its practicality. A paradigm shift towards the use of area under curve (AUC)-guided dosing TDM has been made due to availability of advanced pharmacokinetics software, variability between trough levels and AUC values and the potential for reducing toxicity. This review aims to evaluate the impact of AUC-guided vs trough-guided vancomycin TDM on nephrotoxicity-related outcomes.\n\n\nMethods\nA systematic review was conducted using PubMed®, Embase®, Web of Science®, CINAHL®, Google scholar and Cochrane library® up till 1st January 2021 and was reported according to the PRISMA checklist. Studies which evaluated AUC-guided or trough-guided VAN TDM and vancomycin-associated nephrotoxicity were included. Random effects models were used to compare differences in nephrotoxicity between trough level or AUC based vancomycin TDM due to expected heterogeneity in study designs.\nPRISMA Flowchart\n\nPRISMA flow chart depicting the selection process of studies included in the meta-analysis\n\n\nResults\nOf 1191 records retrieved, 57 studies were included. Majority of studies included adult and elderly patients (n=47, 82.5%). The pooled prevalence of nephrotoxicity was lower using the AUC-guided TDM [6.2%, 95% confidence interval (CI): 2.9 – 9.5%] compared to trough-guided TDM [17.0%; 95% CI: 14.7 – 19.2%]. The risk of nephrotoxicity was lower with the AUC-guided approach as compared with the trough-guided approach [OR: 0.53, 95% CI: 0.32–0.89]. AUC thresholds correlated with risk of nephrotoxicity only for the first 96 hours of therapy. A frequency analysis of significant multivariable factors showed that concomitant use of nephrotoxins, VAN trough levels and duration of VAN therapy were most commonly associated with nephrotoxicity.\nForest plot comparing the risk of nephrotoxicity of AUC-guided vs trough-guided\n\nForest plot comparing the risk of nephrotoxicity of AUC-guided vs trough-guided\nPooled nephrotoxicity rates from AUC-guided monitoring\n\nPooled nephrotoxicity rates from AUC-guided monitoring\nPooled nephrotoxicity rates from trough-guided monitoring\n\nPooled nephrotoxicity rates from trough-guided monitoring\n\n\nConclusion\nThe AUC-guided approach appeared to have lower risk of nephrotoxicity which supports the updated American Society of Health-System Pharmacists recommendations. More studies should be performed to evaluate the optimal derivation of AUC and clinical utility of repeated measurements of vancomycin AUC and trough levels.\n\n\nDisclosures\nAll Authors: No reported disclosures\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofab466.1291"
    },
    {
        "id": 6559,
        "title": "Comparison of Vancomycin Trough–Based and 24-Hour Area Under the Curve Over Minimum Inhibitory Concentration (AUC/MIC)–Based Therapeutic Drug Monitoring in Pediatric Patients",
        "authors": "Wan Xuan Selina Lim, Xue Fen Valerie Seah, Koh Cheng Thoon, Zhe Han",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "\nOBJECTIVES\nVancomycin 24-hour area under the curve over minimum inhibitory concentration (AUC/MIC) monitoring has been recommended over trough-based monitoring in pediatric patients. This study compared the proportion of target attainment between vancomycin AUC/MIC and trough-based methods, and identified risk factors for subtherapeutic initial extrapolated targets.\n\n\nMETHODS\nThis was a retrospective, observational study conducted at KK Women’s and Children’s Hospital (KKH), Singapore. Patients aged 1 month to 18 years with stable renal function who received intravenous vancomycin between January 2014 and October 2017, with at least 2 vancomycin serum concentrations obtained after the first dose of vancomycin, were included. Using a pharmacokinetic software, namely Adult and Pediatric Kinetics (APK), initial extrapolated steady-state troughs and 24-hour AUC were determined by using a one-compartmental model. Statistical tests included Wilcoxon rank sum test, McNemar test, logistic regression, and classification and regression tree (CART) analysis.\n\n\nRESULTS\nOf the 82 pediatric patients included, a significantly larger proportion of patients achieved therapeutic targets when the AUC/MIC-based method (24, 29.3%) was used than with the trough-based method (9, 11.0%; p &lt; 0.01). Patients with estimated glomerular filtration rate (eGFR) ≥60 mL/min/1.73 m2 or with age &lt;13 years had an increased risk of obtaining subtherapeutic targets. However, empiric vancomycin doses of 60 mg/kg/day would be sufficient to achieve serum therapeutic targets, using the AUC/MIC-based method.\n\n\nCONCLUSION\nThe AUC/MIC-based vancomycin monitoring may be preferred because a larger proportion of patients could achieve initial therapeutic targets. Future prospective studies with larger sample size will be required to determine the optimal vancomycin strategy for pediatric patients.\n",
        "link": "http://dx.doi.org/10.5863/1551-6776-28.5.430"
    },
    {
        "id": 6560,
        "title": "Prequential AUC: properties of the area under the ROC curve for data streams with concept drift",
        "authors": "Dariusz Brzezinski, Jerzy Stefanowski",
        "published": "2017-8",
        "citations": 84,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10115-017-1022-8"
    },
    {
        "id": 6561,
        "title": "Validated green spectroscopic manipulation of area under the curve (AUC) for estimation of Simvastatin: Application to nano-structured lipid carriers and niosomal systems",
        "authors": "Islam M. MANNAA, Omaima N. EL GAZAYERLY, Aly A. ABDELBARY, Sarah S. SALEH, Dalia A. MOSTAFA",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29228/jrp.285"
    },
    {
        "id": 6562,
        "title": "Observed Area Under the Urinary Excretion Rate Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/qhu7kh"
    },
    {
        "id": 6563,
        "title": "Accumulation Ratio Area Under the Curve from T1 to T2",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/aid63l"
    },
    {
        "id": 6564,
        "title": "Predicted Area Under the Urinary Excretion Rate Curve Percent Extrapolation",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/r72sps"
    },
    {
        "id": 6565,
        "title": "Area Under the Curve Across All Time",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-39903-0_300112"
    },
    {
        "id": 6566,
        "title": "Area Under the Urinary Excretion Rate Curve from T1 to T2",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/bg0ol9"
    },
    {
        "id": 6567,
        "title": "Area Under the First Moment Curve From Dosing to Last Concentration",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/g35fkp"
    },
    {
        "id": 6568,
        "title": "Comparison of Open-Access, Trough-Only Online Calculators Versus Trapezoidal Method for Calculation of Vancomycin Area Under the Curve (AUC)",
        "authors": "Elizabeth Keil, Rebekah H. Wrenn, Connor R. Deri, Cara N. Slaton, Jenny Shroba, Alice Parish, Alaattin Erkanli, Justin Spivey",
        "published": "2023-8",
        "citations": 2,
        "abstract": "Background: Vancomycin area-under-the-curve (AUC) monitoring is associated with reduced nephrotoxicity but may increase cost and workload for personnel compared to trough monitoring. Objective: The purpose of this study was to compare the accuracy of vancomycin AUC calculated by open-access, online, trough-only calculators to AUCs calculated by the trapezoidal method (TM) using peak and trough concentrations. Methods: This retrospective, multi-center study included adults ≥18 years old with stable renal function who received vancomycin with steady-state peak and trough concentrations. Areas under the curve calculated by TM were compared to AUCs calculated by 3 online calculators using trough-only options for calculation: ClinCalc, VancoVanco, and VancoPK. The primary outcome was actual difference in AUC between TM and the online calculators. Secondary outcomes were percent difference in AUC and clinical alignment in dose adjustments between methods. Results: Seventy patients were included for analysis. There was a statistically significant difference in AUC between TM and ClinCalc (median actual difference: −52, P < 0.001) and VancoVanco (median actual difference: 95, P < 0.001), whereas there was no significant difference between TM and VancoPK (median actual difference: −0.8, P = 0.827). Discordant dose adjustments were indicated when comparing ClinCalc, VancoVanco, and VancoPK to TM in 28%, 36%, and 12% of cases, respectively. Conclusion: The AUC calculator most closely aligned with TM was VancoPK, whereas other included calculators were statistically different. Owing to the cost and complexity of obtaining multiple levels, our findings support using a single steady-state trough using VancoPK as an alternative to TM for calculation of vancomycin AUC. ",
        "link": "http://dx.doi.org/10.1177/10600280221138867"
    },
    {
        "id": 6569,
        "title": "Exact Probability Distribution for the ROC Area Under Curve",
        "authors": "Joakim Ekström, Jim Ögren, Tobias Sjöblom",
        "published": "No Date",
        "citations": 0,
        "abstract": "SummaryThe Receiver Operating Characteristic (ROC) is ade factostandard for determining the accuracy ofin vitrodiagnostic (IVD) medical devices, and thus exactness in its probability distribution is crucial toward accurate statistical inference. We show the exact probability distribution of the ROC AUC-value, hence exact critical values and p-values are readily obtained. Because the exact calculations are computationally intense, we demonstrate a method of geometric interpolation which is exact in a special case but generally an approximation, vastly increasing computational speeds. The method is illustrated through open access data, demonstrating superiority of 26 composite biomarkers relative to a predicate device. Especially under correction for testing of multiple hypotheses, traditional asymptotic approximations are encumbered by considerable imprecision, adversely affecting IVD device development. The ability to obtain exact p-values will allow more efficient IVD device development.",
        "link": "http://dx.doi.org/10.1101/2022.12.13.520256"
    },
    {
        "id": 6570,
        "title": "Natural Log Transformed Area Under the Curve From Dosing to Last Concentration",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/ak2dl7"
    },
    {
        "id": 6571,
        "title": "Area Under the Inspiratory Flow-Volume Curve (AIX): Proposed Normative Values",
        "authors": "Octavian Ioachimescu, James Stoller",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4556571"
    },
    {
        "id": 6572,
        "title": "Area Under the Curve From Dosing to Last Concentration of Unbound Drug",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/wy8qbb"
    },
    {
        "id": 6573,
        "title": "Area Under the Urinary Excretion Rate Curve From Dosing to Last Concentration",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/bfq91x"
    },
    {
        "id": 6574,
        "title": "AUC All Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/7io5em"
    },
    {
        "id": 6575,
        "title": "A more intuitive interpretation of the area under the ROC curve",
        "authors": "A. Cecile J.W. Janssens",
        "published": "No Date",
        "citations": 1,
        "abstract": "The area under the receiver operating characteristic (ROC) curve (AUC) is commonly used for assessing the discriminative ability of prediction models even though the measure is criticized for being clinically irrelevant and lacking an intuitive interpretation. Most of the criticism is traced back to the fact that the ROC curve was introduced as the discriminative ability of a binary classifier across all its possible thresholds. Yet, this is not the curve’s only interpretation. Every tutorial explains how the coordinates of the ROC curve are obtained from the risk distributions of diseased and non-diseased individuals, but it has not become common sense that the ROC plot is another way of presenting these risk distributions. This alternative perspective on the ROC plot invalidates most limitations of the AUC and attributes others to the underlying risk distributions. The separation of these distributions, represented by the area between the curves (AUC), is a more straightforward and intuitive measure of the inference of the discriminative ability of prediction models.",
        "link": "http://dx.doi.org/10.7287/peerj.preprints.3468v1"
    },
    {
        "id": 6576,
        "title": "A more intuitive interpretation of the area under the ROC curve",
        "authors": "A. Cecile J.W. Janssens",
        "published": "No Date",
        "citations": 0,
        "abstract": "The area under the receiver operating characteristic (ROC) curve (AUC) is commonly used for assessing the discriminative ability of prediction models even though the measure is criticized for being clinically irrelevant and lacking an intuitive interpretation. Most of the criticism is traced back to the fact that the ROC curve was introduced as the discriminative ability of a binary classifier across all its possible thresholds. Yet, this is not the curve’s only interpretation. Every tutorial explains how the coordinates of the ROC curve are obtained from the risk distributions of diseased and non-diseased individuals, but it has not become common sense that the ROC plot is another way of presenting these risk distributions. This alternative perspective on the ROC plot invalidates most limitations of the AUC and attributes others to the underlying risk distributions. The separation of these distributions, represented by the area between the curves (AUC), is a more straightforward and intuitive measure of the inference of the discriminative ability of prediction models.",
        "link": "http://dx.doi.org/10.7287/peerj.preprints.3468"
    },
    {
        "id": 6577,
        "title": "Comparison of vancomycin area under the concentration‐time curve (\n            <scp>AUC</scp>\n            ) using two‐point pharmacokinetics versus two open‐access online single‐concentration vancomycin calculators",
        "authors": "Nicole M. Ondrush, Rejs Ademovic, Robert W. Seabury, William Darko, Christopher D. Miller, Bryan T. Mogle",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/jcpt.13795"
    },
    {
        "id": 6578,
        "title": "Figure 1 from: Medrano-Vizcaíno P, Gutiérrez-Salazar P (2020) Current and future suitable habitat areas for Nasuella olivacea (Gray, 1865) in Colombia and Ecuador and analysis of its distribution across different land uses. Biodiversity Data Journal 8: e49164. https://doi.org/10.3897/BDJ.8.e49164",
        "authors": "Pablo Medrano-Vizcaíno, Patricia Gutiérrez-Salazar",
        "published": "2020-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3897/bdj.8.e49164.figure1"
    },
    {
        "id": 6579,
        "title": "Area under the blood concentration-time curve (AUC) of ethylbenzene concentration in rats: relationship to inhalation and oral administration route-dose",
        "authors": "Makoto Take, Tomoki Takeda, Hiroaki Ishikawa, Michiharu Matsumoto, Kasuke Nagano, Shoji Fukushima",
        "published": "2020-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/10934529.2020.1827653"
    },
    {
        "id": 6580,
        "title": "AUC Infinity Predicted Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/xrg5gw"
    },
    {
        "id": 6581,
        "title": "Vancomycin Area Under the Curve Simplified",
        "authors": "Paul Lewis",
        "published": "2018-6",
        "citations": 7,
        "abstract": "\nBackground:\nSerum trough concentrations as the sole means of monitoring safety and efficacy of vancomycin are insufficient. The daily area under the curve (AUC24) of serum concentration versus time to minimum inhibitory concentration (MIC) ratio of greater than 400 mg × h/L has emerged as a more robust dosing target. A simple and practical method to extrapolate AUC24 from troughs is needed.\n\n\nMethods:\nThis mathematical model computes the median and range AUC24 using the dose in mg/kg and the observed serum trough concentration. AUC24 is calculated using dose in mg/kg divided by the volume of distribution (Vd) and elimination constant (Ke). Vd is provided using the population median (range) of 0.7 (0.4–1) L/kg. Ke is calculated using the trough and population Vd.\n\n\nResults:\nFor doses of 15–20 mg/kg, troughs of at least 11 mg/L will achieve AUC24 of greater than 400 mg × h/L, even with a Vd of 1 L/kg. Using the median Vd and lower, AUC24 greater than 400 mg × h/L can be achieved with troughs as little as 9 mg/L using doses of 15 mg/kg and greater. The AUC24:MIC goal of greater than 400 can still be attained with an MIC of 1.5 mg/L by using doses of at least 15 mg/kg and targeting troughs of at least 16 mg/L for a patient with a Vd of 0.7 L/kg or less.\n\n\nConclusions:\nTroughs of 15–20 mg/L are rarely needed for organisms with an MIC of 1 mg/L or less. AUC24:MIC goals of greater than 400 can best be achieved with higher doses in mg/kg while targeting lower troughs.\n",
        "link": "http://dx.doi.org/10.1097/ftd.0000000000000500"
    },
    {
        "id": 6582,
        "title": "Area Under the Inspiratory Flow-Volume Curve (AIX): Proposed Normative Values",
        "authors": "Octavian Ioachimescu, James K. Stoller",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nArea under the inspiratory flow-volume loop (AIX) is a spirometric tool that is potentially useful in characterizing upper and/or lower airflow obstruction. We analyzed AIX in 4,980 single-test, pre- or post-bronchodilator normal spirometry tests recorded in non-smoking, healthy individuals in the Pulmonary Function Testing Laboratory. The mean (95% confidence interval, CI), standard deviation and median (25th -75th interquartile range) AIX were 16.05 (15.79–16.31), 9.08 and 14.72 (9.12–21.42) L2⋅sec− 1, respectively. The mean (95% CI) and standard deviation of the best-trial measurements for square root of AIX (SqrtAIX, which follow a distribution closer to a gaussian distribution, were 3.84 (3.81–3.87) and 1.14; 4.15 (4.12–4.18) and 1.03 in men, and 2.68 (2.63–2.72) and 0.72 L⋅sec− 1/2 in women. The mean (standard deviation) of pre- and post-bronchodilator SqrtAIX were 3.71 (1.17) and 3.81 (1.19) L⋅sec− 1/2, respectively. The mean (95% CI), standard deviation and lowest 5th percentile (lower limit of normal, LLN) of SqrtAIX/SqrtAEX (%) were 101.3 (100.82-101.87), 18.7%, and 71.8%; stratified by gender, it was 102.2 (101.6-102.8), 18.6, and 72.8% in men, and 98 (96.9–99.2), 18.8, and 68.6% in women, respectively. The availability of area under the inspiratory flow-volume curve (AIX) and the derived indices offers a promising opportunity to assess upper airway disease (e.g., involvement of larynx, trachea or major bronchi), especially because some of these measurements appear to be independent of age, race, height, and weight.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3311554/v1"
    },
    {
        "id": 6583,
        "title": "AUC Infinity Observed Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/3isa9u"
    },
    {
        "id": 6584,
        "title": "ROC curve generalization and AUC",
        "authors": "Chong Sun Hong, So Yeon Choi",
        "published": "2020-7-31",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7465/jkdi.2020.31.4.477"
    },
    {
        "id": 6585,
        "title": "Estimation of Area Under the ROC Curve under nonignorable verication bias",
        "authors": "Wenbao Yu, Jae Kwang Kim, Taesung Park",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5705/ss.202016.0315"
    },
    {
        "id": 6586,
        "title": "A Simulation Study of the Comparative Performance of Partial Area under the Curve (pAUC) and Partial Area under the Effect Curve (pAUEC) Metrics in Crossover Versus Replicated Crossover Bioequivalence Studies for Concerta and Ritalin LA",
        "authors": "Andre J. Jackson, Henry C. Foehl",
        "published": "2022-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1208/s12248-022-00726-w"
    },
    {
        "id": 6587,
        "title": "Improper calculation of the area under the curve using non-linear values (log values)",
        "authors": "Rand Wheatland",
        "published": "No Date",
        "citations": 0,
        "abstract": "Statistical analyses should be reliable and reasonable.  When log values are used to calculate areas in area-under-the-curve analyses, the results are neither reliable or reasonable.     In two 2022 New England Journal of Medicine  articles, a major result is a comparison of the Area Under the Curve (AUC) between groups.  The authors use log values, non-linear values, as one of the dimensions to compute the AUC.  Such results are meaningless.  It is wrong to use non-linear values in the calculation of areas and unnecessary.",
        "link": "http://dx.doi.org/10.31219/osf.io/xcp6m"
    },
    {
        "id": 6588,
        "title": "AUC Over Dosing Interval Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/177d2s"
    },
    {
        "id": 6589,
        "title": "AUC from T1 to T2 Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/j9fpt9"
    },
    {
        "id": 6590,
        "title": "Area Under the Normal Curve",
        "authors": "Amanda Ross",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-94-6351-137-7_31"
    },
    {
        "id": 6591,
        "title": "WS19.4 Glucose and insulin area under the curve (AUC) can differentiate between cystic fibrosis patients that may benefit from early insulin treatment",
        "authors": "L. Soesman, S. Miari, O. Breuer, L. Bentur, R. Tsabari, H. Elyashar-Earon, S. Armoni, M. Gur, A. Teleshov, A. Sprikkelman, D. Zangen, E. Kerem, M. Cohen-Cymberknoh",
        "published": "2018-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s1569-1993(18)30229-7"
    },
    {
        "id": 6592,
        "title": "Receiver Operating Characteristic (ROC) Area Under the Curve (AUC): A Diagnostic Measure for Evaluating the Accuracy of Predictors of Education Outcomes",
        "authors": "Alex J. Bowers, Xiaoliang Zhou",
        "published": "2019-1-2",
        "citations": 88,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/10824669.2018.1523734"
    },
    {
        "id": 6593,
        "title": "349. The impact of Vancomycin dosing by area under the curve over minimal inhibitory concentration (AUC/MIC) versus Trough levels on cumulative Vancomycin dosage and incidence of Acute Kidney Injury (AKI) in patients admitted to intensive care units (ICU)",
        "authors": "Aniruddha Sahu, Kevin K Wang, Philip Jurasinski, Salil Kulkarni, Sayo Weihs, Masako Mizusawa, David Bamberger",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "Abstract\n\nBackground\nHigher Vancomycin trough levels (15-20 mcg/ml) are associated with increased risk of AKI. IDSA recommends dosing Vancomycin as per AUC/MIC reduces the risk of nephrotoxicity. The aim of this study was to determine if AUC/MIC dosing could reduce the incidence of nephrotoxicity patients in admitted to intensive care unit (ICU). This has not been previously studied.\n\n\nMethods\nThis was a retrospective pre and post chart review study including all admitted patients to ICU at Truman Medical Center Hospital Hill, Kansas City, Missouri from 10/1/2020 to 10/1/2021. The pre intervention period (trough monitoring) was 10/1/2020-3/29/2021.The post intervention period was 4/1/2021-10/1/2021, included patients who received Vancomycin dosing via using a Bayesian derived AUC monitoring software program targeting AUC of 400-600 mg*hour/L (Insight Rx). All patients who were admitted to ICU and received Vancomycin for &gt;48 hours were included. Exclusion criteria includes Vancomycin use for &lt; 48 hours, end stage renal disease and who received continuous renal replacement therapy within 48 hours of starting Vancomycin.\n\n\nResults\n119 patients received Vancomycin dosing by AUC/MIC and 122 patients by Vancomycin trough. Patients received 23.51 ± 2.13 mg/kg/day(mean ± standard error) Vancomycin in AUC/MIC and 25.28 ± 1.71 mg/kg/day in trough group (p = 0.18). The incidence of AKI was 25.21%(n=30) in AUC/MIC group and 17.21%(n=21) in trough group (p = 0.13). Vancomycin was used for 5.61 ± 0.68 days in AUC/MIC group and 4.92 ± 0.48 days in trough group (p = 0.10). The incidence of AKI in patients who received concomitant intravenous contrast was 26.22%(n=16) in AUC/MIC group and 10.90%(n=6) in trough group (p = 0.04*). Average length of stay (LOS) in ICU was 11.56 ± 2.65 days in AUC/MIC group and 8.66 ± 1.61 days in trough group (p = 0.06). All-cause mortality during hospitalization was 29.41%(n=35) in AUC/MIC group and 22.13%(n=27) in trough group (p = 0.20). AKI was noted in 19.82% patients receiving Piperacillin tazobactam and Vancomycin versus 22.4% receiving Vancomycin without Piperacillin tazobactam(p = 0.63).\n\n\n\n\nConclusion\nThere was no difference in cumulative vancomycin dose, incidence of AKI, LOS and All-cause mortality during the hospitalization while using Vancomycin dosing by AUC/MIC vs trough in ICU patients.\n\n\nDisclosures\nAll Authors: No reported disclosures\n",
        "link": "http://dx.doi.org/10.1093/ofid/ofad500.420"
    },
    {
        "id": 6594,
        "title": "AUC Dosing to Last Concentration Normalized by Surface Area",
        "authors": " ",
        "published": "2020-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/g2pcnq"
    },
    {
        "id": 6595,
        "title": "Quantification of thermal dose in moderate clinical hyperthermia with radiotherapy: a relook using temperature–time area under the curve (AUC)",
        "authors": "Niloy R. Datta, Dietmar Marder, Sneha Datta, Andreas Meister, Emsad Puric, Emanuel Stutz, Susanne Rogers, Brigitte Eberle, Olaf Timm, Michal Staruch, Oliver Riesterer, Stephan Bodis",
        "published": "2021-1-1",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/02656736.2021.1875060"
    },
    {
        "id": 6596,
        "title": "A relationship between the incremental values of area under the ROC curve and of area under the precision-recall curve",
        "authors": "Qian M. Zhou, Lu Zhe, Russell J. Brooke, Melissa M. Hudson, Yan Yuan",
        "published": "2021-12",
        "citations": 15,
        "abstract": "AbstractBackgroundIncremental value (IncV) evaluates the performance change between an existing risk model and a new model. Different IncV metrics do not always agree with each other. For example, compared with a prescribed-dose model, an ovarian-dose model for predicting acute ovarian failure has a slightly lower area under the receiver operating characteristic curve (AUC) but increases the area under the precision-recall curve (AP) by 48%. This phenomenon of disagreement is not uncommon, and can create confusion when assessing whether the added information improves the model prediction accuracy.MethodsIn this article, we examine the analytical connections and differences between the AUC IncV (ΔAUC) and AP IncV (ΔAP). We also compare the true values of these two IncV metrics in a numerical study. Additionally, as both are semi-proper scoring rules, we compare them with a strictly proper scoring rule: the IncV of the scaled Brier score (ΔsBrS) in the numerical study.ResultsWe demonstrate thatΔAUC andΔAP are both weighted averages of the changes (from the existing model to the new one) in separating the risk score distributions between events and non-events. However,ΔAP assigns heavier weights to the changes in higher-risk regions, whereasΔAUC weights the changes equally. Due to this difference, the two IncV metrics can disagree, and the numerical study shows that their disagreement becomes more pronounced as the event rate decreases. In the numerical study, we also find thatΔAP has a wide range, from negative to positive, but the range ofΔAUC is much smaller. In addition,ΔAP andΔsBrS are highly consistent, butΔAUC is negatively correlated withΔsBrS andΔAP when the event rate is low.ConclusionsΔAUC treats the wins and losses of a new risk model equally across different risk regions. When neither the existing or new model is the true model, this equality could attenuate a superior performance of the new model for a sub-region. In contrast,ΔAP accentuates the change in the prediction accuracy for higher-risk regions.",
        "link": "http://dx.doi.org/10.1186/s41512-021-00102-w"
    },
    {
        "id": 6597,
        "title": "Area under the curve.",
        "authors": "R. Karl Hanson",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1037/0000275-008"
    },
    {
        "id": 6598,
        "title": "The area under a curve",
        "authors": "James Sneyd, Rachel M. Fewster, Duncan McGillivray",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-05318-4_21"
    },
    {
        "id": 6599,
        "title": "Assessing Area under the Curve as an Alternative to Latent Growth Curve Modeling for Repeated Measures Zero-Inflated Poisson Data: A Simulation Study",
        "authors": "Daniel Rodriguez",
        "published": "2023-2-19",
        "citations": 3,
        "abstract": "Researchers interested in the assessment of substance use trajectories, and predictors of change, have several data analysis options. These include, among others, generalized estimating equations and latent growth curve modeling. One difficulty in the assessment of substance use, however, is the nature of the variables studied. Although counting instances of use (e.g., the number of cigarettes smoked per day) would seem to be the best option, such data present difficulties in that the distribution of these variables is not likely normal. Count variables often follow a Poisson distribution, and when dealing with substance use in the general population, there is a preponderance of zeros (representing not using). As such, substance use counts may approximate a zero-inflated Poisson distribution. Unfortunately, analyses with zero-inflated Poisson random variables are not easily accommodated in many types of software and may be beyond access to most researchers. As such, an easier method would benefit researchers interested in assessing substance use change. The purpose of this study is to assess the area under the curve as an option when dealing with repeated measures data and contrast it to one popular method of longitudinal data analysis, latent growth curve modeling. Using a Monte Carlo simulation study with varying sample sizes, we found that the area under the curve performed well with different sample sizes and compared favorably to the performance of latent growth curve modeling, particularly when dealing with smaller sample sizes. The area under the curve may be a simpler alternative for researchers, especially when dealing with smaller sample sizes.",
        "link": "http://dx.doi.org/10.3390/stats6010022"
    },
    {
        "id": 6600,
        "title": "Impact of mutations in hVISA isolates on decreased susceptibility to vancomycin, through population analyses profile – area under curve (PAP-AUC)",
        "authors": "A.C.O. Silveira, J. Caierão, C.I. Silva, E.K. Anzai, J.A. McCulloch, P.A. d'Azevedo, T. C.M. Sincero",
        "published": "2019-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.diagmicrobio.2019.06.006"
    }
]