[
    {
        "id": 24271,
        "title": "Q-SpiNN: A Framework for Quantizing Spiking Neural Networks",
        "authors": "Rachmad Vidya Wicaksana Putra, Muhammad Shafique",
        "published": "2021-7-18",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534087"
    },
    {
        "id": 24272,
        "title": "Chaotic Neural Networks in Quantum Finance",
        "authors": "Raymond S. T. Lee",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-32-9796-8_9"
    },
    {
        "id": 24273,
        "title": "NEURAL NETWORKS IN FINANCE: A DESCRIPTIVE SYSTEMATIC REVIEW",
        "authors": "K. Riyazahmed",
        "published": "2021-2-24",
        "citations": 2,
        "abstract": "Traditional statistical methods pose challenges in data analysis due to irregularity in the financial data. To improve accuracy, financial researchers use machine learning architectures for the past two decades. Neural Networks (NN) are a widely used architecture in financial research. Despite the wider usage, NN application in finance is yet to be well defined. Hence, this descriptive study classifies and examines the NN application in finance into four broad categories i.e., investment prediction, credit evaluation, financial distress, and other financial applications. Likewise, the review classifies the NN methods used under each category into standard, optimized and hybrid NN. Further, accuracy measures used by the research work widely differ, in turn, pose challenges for comparison of a NN under each category and reduces the scope of formalizing a theory to choose optimum network model under each category. \r\nJEL Classification Codes: G1, G17, M150.",
        "link": "http://dx.doi.org/10.46281/ijfb.v5i2.997"
    },
    {
        "id": 24274,
        "title": "Convolutional Neural Networks",
        "authors": "Samit Ahlawat",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8835-1_3"
    },
    {
        "id": 24275,
        "title": "Recurrent Neural Networks",
        "authors": "Samit Ahlawat",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8835-1_4"
    },
    {
        "id": 24276,
        "title": "Risk sharing with deep neural networks",
        "authors": "M. Burzoni, A. Doldi, E. Monzio Compagnoni",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2024.2307493"
    },
    {
        "id": 24277,
        "title": "PROBLEMS OF RETRO-FORECASTS OF ECONOMIC INDICATORS BASED ON NEURAL NETWORKS",
        "authors": "Sergiy RIPPA",
        "published": "2022",
        "citations": 0,
        "abstract": "Introduction. TThe difficult economic situation in Ukraine, the state of emergency, the war and the consequences of the destruction of critical infrastructure have significantly increased the value of economic and mathematical forecasting tools based on neural networks and their tuning capabilities, is improved.\n\nThe purpose of the article is to analyze and study the potential and formal aspects of the application of neurocomputer methods of economic forecasting and tools to support retro-forecasts of economic indicators.\n\nResults. The success of economic decisions (strategic and tactical) in one way or another depends on the quality of analytics and the efficiency of the operational apparatus of decision-making. Even if a rigorous algorithmic approach is difficult or impossible and it is fundamentally impossible to get the right solution, there are effective methods and tools for solving economic problems, an important place among which is forecasting. Just in recent years there has been a breakthrough in the theory and practice of economics and mathematics, many organizations have begun to actively use neural networks in forecasting. Such neural networks can identify patterns by which they generate recommendations for action, they can study and summarize past experiences to improve their own level of performance and calculate forecasts. Neural network methodologies in general and neuro-forecasting in particular belong to the family of machine learning technologies. The specifics of solving the problem of machine learning in forecasting differs from other methods designed for the formation and use of predictions. Possibilities of accumulation and improvement of experience, formation and adaptation of neural network architecture to specifics of forecasting tasks, wide possibilities of application of retro-forecasting methods for improvement of characteristics of adjustment of neural models for forecasts, availability of flexible mechanisms of parameterization and optimization of algorithmic providing forecasting in economic research. Machine learning today is a field of scientific knowledge that is developing rapidly and deals with algorithms capable of learning and developing, which distinguishes this field of research from many others and makes it, at the same time focused on implementation practice, including forecasting. The need to use machine learning methods is due to the fact that for many complex – “intelligent” – tasks (eg, construction and improvement of predictive models) is very difficult (or even impossible) to develop an “explicit” algorithm for solving them, but often you can teach a computer to learn solving these problems with the help of neural networks and retro-forecasting technologies.\n\nConclusions. The formalization of the integrated representation of the neural network for forecasting in the form of activation functions with the definition of conditions for their use in machine learning algorithms, taking into account the specifics of the refined settings of retro-predicted neural models of economic indicators. Demonstrated by the example of retro-forecasting for the simplest neural network (4-2-3-1), when the choice of machine learning algorithm (between PROP and RPROP) is achieved more than twice the effect of improving the quality of the forecast model.",
        "link": "http://dx.doi.org/10.35774/sf2022.01.076"
    },
    {
        "id": 24278,
        "title": "Physics-Informed Neural Networks (PINNs) in Finance",
        "authors": "Miquel Noguer i Alonso, Daniel Maxwell",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4598180"
    },
    {
        "id": 24279,
        "title": "Bankruptcy prediction using fuzzy convolutional neural networks",
        "authors": "Sami Ben Jabeur, Vanessa Serret",
        "published": "2023-1",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ribaf.2022.101844"
    },
    {
        "id": 24280,
        "title": "Alternatives to Deep Neural Networks for Function Approximations in Finance",
        "authors": "Alexandre Antonov, Vladimir Piterbarg",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3958331"
    },
    {
        "id": 24281,
        "title": "The commodity risk premium and neural networks",
        "authors": "Hossein Rad, Rand Kwong Yew Low, Joëlle Miffre, Robert Faff",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jempfin.2023.101433"
    },
    {
        "id": 24282,
        "title": "USING NEURAL NETWORKS IN MODELING THE FINANCIAL RESULTS OF BUSINESS PROCESSES",
        "authors": "Nadiia YASYNSKA, Olena IVCHENKOVA",
        "published": "2019",
        "citations": 2,
        "abstract": "Introduction. The attributes of neural networks are embodied in a study of the effectiveness of business processes, which is based on integrated coefficients of international monitoring with a range of quantitative parameters. Simulated situational precedents will allow to assume multivariate solutions in real time.\n\nThe purpose of the work is to use of neural network technologies in modeling financial results of business processes with integrated international monitoring indices and domestic statistics.\n\nResults. The obtained sections of the response surface of the resulting indicator and pairs of independent variables for a neural network of type RBF 3–7–1 are characterized. An algorithm is proposed for applying the methodology for assessing the functioning of a business using neural network technologies.\n\nConclusions.\n\n1. According to the results of theoretical generalizations, the understanding of the main purpose of the business operation has been improved. A feature of the proposed interpretation is the narrowing of the functional component of business processes to the resulting feature in real time.\n\n2. Low indicators of network readiness, level of ICT development, global competitiveness of the domestic economy and business profitability have been established.\n\n3. For the simulated situations, the results obtained allowed to bring the convergence of the resulting indicator of relatively independent factors, that is, the response of domestic business to the intensification of digitalization, increasing the competitiveness of the economy and the development of information and communication technologies.\n\n4. The paper proposes an algorithm for applying the methodology for assessing the functioning of a business using neural network technologies.",
        "link": "http://dx.doi.org/10.35774/sf2019.03.108"
    },
    {
        "id": 24283,
        "title": "Forecasting Apple Stock Closure Prices Using Artificial neural networks",
        "authors": "M.O. Pankov",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31085/1814-4802-2019-15-3-41-55"
    },
    {
        "id": 24284,
        "title": "Applications of Artificial Neural Networks in Economics and Finance",
        "authors": "Iva Mihaylova",
        "published": "2018",
        "citations": 0,
        "abstract": "Artificial neural Networks (ANNs) are a powerful technique for multivariate dependence analysis. Originally inspired by neuroscience, ANNs are becoming an increasingly attractive analytic tool for applications in the area of economics and finance due to the flexible solutions they offer. The purpose of this article is to present such important applications with an emphasis on recent research trends. The contributions are grouped as follows: ANNs (1) for prediction, (2) for classification and (3) for modelling. The chapter concludes with the future trends in the ANNs research in economics and finance. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-2255-3.ch575"
    },
    {
        "id": 24285,
        "title": "Bayesian regularized artificial neural networks for the estimation of the probability of default",
        "authors": "Eduard Sariev, Guido Germano",
        "published": "2020-2-1",
        "citations": 66,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2019.1633014"
    },
    {
        "id": 24286,
        "title": "Robust risk aggregation with neural networks",
        "authors": "Stephan Eckstein, Michael Kupper, Mathias Pohl",
        "published": "2020-10",
        "citations": 6,
        "abstract": "AbstractWe consider settings in which the distribution of a multivariate random variable is partly ambiguous. We assume the ambiguity lies on the level of the dependence structure, and that the marginal distributions are known. Furthermore, a current best guess for the distribution, called reference measure, is available. We work with the set of distributions that are both close to the given reference measure in a transportation distance (e.g., the Wasserstein distance), and additionally have the correct marginal structure. The goal is to find upper and lower bounds for integrals of interest with respect to distributions in this set. The described problem appears naturally in the context of risk aggregation. When aggregating different risks, the marginal distributions of these risks are known and the task is to quantify their joint effect on a given system. This is typically done by applying a meaningful risk measure to the sum of the individual risks. For this purpose, the stochastic interdependencies between the risks need to be specified. In practice, the models of this dependence structure are however subject to relatively high model ambiguity. The contribution of this paper is twofold: First, we derive a dual representation of the considered problem and prove that strong duality holds. Second, we propose a generally applicable and computationally feasible method, which relies on neural networks, in order to numerically solve the derived dual problem. The latter method is tested on a number of toy examples, before it is finally applied to perform robust risk aggregation in a real‐world instance.",
        "link": "http://dx.doi.org/10.1111/mafi.12280"
    },
    {
        "id": 24287,
        "title": "Trading Strategy Validation Using Forwardtesting with Deep Neural Networks",
        "authors": "Ivan Letteri, Giuseppe Della Penna, Giovanni De Gasperis, Abeer Dyoub",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011715300003494"
    },
    {
        "id": 24288,
        "title": "The application of feed forward neural networks to merger arbitrage: A return-based analysis",
        "authors": "Declan Braun, Yue Han, Heng Emily Wang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.frl.2023.104391"
    },
    {
        "id": 24289,
        "title": "Feedforward Neural Networks",
        "authors": "Matthew F. Dixon, Igor Halperin, Paul Bilokon",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-41068-1_4"
    },
    {
        "id": 24290,
        "title": "Dilated convolutional neural networks for time series forecasting",
        "authors": "Anastasia Borovykh, Sander Bohte, Cornelis W. Oosterlee",
        "published": "2018",
        "citations": 46,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21314/jcf.2019.358"
    },
    {
        "id": 24291,
        "title": "Forecasting realized volatility: HAR against Principal Components Combining, neural networks and GARCH",
        "authors": "Dimitrios I. Vortelinos",
        "published": "2017-1",
        "citations": 35,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ribaf.2015.01.004"
    },
    {
        "id": 24292,
        "title": "Advanced Neural Networks",
        "authors": "Matthew F. Dixon, Igor Halperin, Paul Bilokon",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-41068-1_8"
    },
    {
        "id": 24293,
        "title": "Neural networks for option pricing and hedging: a literature review",
        "authors": "Johannes Ruf, Weiguan Wang",
        "published": "2020",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21314/jcf.2020.390"
    },
    {
        "id": 24294,
        "title": "Accelerated share repurchase and other buyback programs: what neural networks can bring",
        "authors": "Olivier Guéant, Iuliia Manziuk, Jiang Pu",
        "published": "2020-8-2",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2020.1729397"
    },
    {
        "id": 24295,
        "title": "Pricing options on flow forwards by neural networks in a Hilbert space",
        "authors": "Fred Espen Benth, Nils Detering, Luca Galimberti",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00780-023-00520-2"
    },
    {
        "id": 24296,
        "title": "State-dependent asset allocation using neural networks",
        "authors": "Reza Bradrania, Davood Pirayesh Neghab",
        "published": "2022-7-24",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/1351847x.2021.1960404"
    },
    {
        "id": 24297,
        "title": "Opening the black box – Quantile neural networks for loss given default prediction",
        "authors": "Ralf Kellner, Maximilian Nagl, Daniel Rösch",
        "published": "2022-1",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jbankfin.2021.106334"
    },
    {
        "id": 24298,
        "title": "Accelerated American option pricing with deep neural networks",
        "authors": "David Anderson, Urban Ulrych",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>Given the competitiveness of a market-making environment, the ability to speedily quote option prices consistent with an ever-changing market environment is essential. Thus, the smallest acceleration or improvement over traditional pricing methods is crucial to avoid arbitrage. We propose a method for accelerating the pricing of American options to near-instantaneous using a feed-forward neural network. This neural network is trained over the chosen (e.g., Heston) stochastic volatility specification. Such an approach facilitates parameter interpretability, as generally required by the regulators, and establishes our method in the area of eXplainable Artificial Intelligence (XAI) for finance. We show that the proposed deep explainable pricer induces a speed-accuracy trade-off compared to the typical Monte Carlo or Partial Differential Equation-based pricing methods. Moreover, the proposed approach allows for pricing derivatives with path-dependent and more complex payoffs and is, given the sufficient accuracy of computation and its tractable nature, applicable in a market-making environment.</p></abstract>",
        "link": "http://dx.doi.org/10.3934/qfe.2023011"
    },
    {
        "id": 24299,
        "title": "EU-27 bank failure prediction with C5.0 decision trees and deep learning neural networks",
        "authors": "Tamás Kristóf, Miklós Virág",
        "published": "2022-10",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ribaf.2022.101644"
    },
    {
        "id": 24300,
        "title": "Empirical evaluation of price-based technical patterns using probabilistic neural networks",
        "authors": "Samit Ahlawat",
        "published": "2017-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/af-160059"
    },
    {
        "id": 24301,
        "title": "Time Series Chaotic Neural Oscillatory Networks for Financial Prediction",
        "authors": "Raymond S. T. Lee",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-32-9796-8_11"
    },
    {
        "id": 24302,
        "title": "Neural Networks",
        "authors": "",
        "published": "2017-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(16)30177-0"
    },
    {
        "id": 24303,
        "title": "Pricing vanilla options using artificial neural networks: Application to the South African market",
        "authors": "Ryno du Plooy, Pierre J. Venter",
        "published": "2021-1-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/23322039.2021.1914285"
    },
    {
        "id": 24304,
        "title": "Forecasting crude oil price using LSTM neural networks",
        "authors": "Kexian Zhang, Min Hong",
        "published": "2022",
        "citations": 3,
        "abstract": "<abstract>\n\n<p>As a key input factor in industrial production, the price volatility of crude oil often brings about economic volatility, so forecasting crude oil price has always been a pivotal issue in economics. In our study, we constructed an LSTM (short for Long Short-Term Memory neural network) model to conduct this forecasting based on data from February 1986 to May 2021. An ANN (short for Artificial Neural Network) model and a typical ARIMA (short for Autoregressive Integrated Moving Average) model are taken as the comparable models. The results show that, first, the LSTM model has strong generalization ability, with stable applicability in forecasting crude oil prices with different timescales. Second, as compared to other models, the LSTM model generally has higher forecasting accuracy for crude oil prices with different timescales. Third, an LSTM model-derived shorter forecast price timescale corresponds to a lower forecasting accuracy. Therefore, given a longer forecast crude oil price timescale, other factors may need to be included in the model.</p>\n\n</abstract>",
        "link": "http://dx.doi.org/10.3934/dsfe.2022008"
    },
    {
        "id": 24305,
        "title": "Optimal stopping via randomized neural networks",
        "authors": "Calypso Herrera, Florian Krach, Pierre Ruyssen, Josef Teichmann",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3934/fmf.2023022"
    },
    {
        "id": 24306,
        "title": "Forecasting Inflation in Russia Using Neural Networks",
        "authors": "Evgeny Pavlov,  ",
        "published": "2020-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31477/rjmf.202001.57"
    },
    {
        "id": 24307,
        "title": "Neural Networks Referees in 2020",
        "authors": "",
        "published": "2021-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(20)30404-4"
    },
    {
        "id": 24308,
        "title": "Neural Networks Referees in 2019",
        "authors": "",
        "published": "2020-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(19)30380-6"
    },
    {
        "id": 24309,
        "title": "Neural Networks Referees in 2016",
        "authors": "",
        "published": "2017-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(16)30178-2"
    },
    {
        "id": 24310,
        "title": "Neural Networks Referees in 2021",
        "authors": "",
        "published": "2022-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(21)00462-7"
    },
    {
        "id": 24311,
        "title": "Neural Networks Referees in 2017",
        "authors": "",
        "published": "2018-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(18)30022-4"
    },
    {
        "id": 24312,
        "title": "Neural Networks Referees in 2022",
        "authors": "",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00489-0"
    },
    {
        "id": 24313,
        "title": "Study on Exchange Rate Forecasting Using Recurrent Neural Networks",
        "authors": "Yuxi Ye",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11648/j.ijefm.20170506.14"
    },
    {
        "id": 24314,
        "title": "Cognitive Privacy of Personalized Digital Finance Images on Social Media Platforms Using Artificial Neural Networks",
        "authors": "Ishita Sharma, Sachin Sharma",
        "published": "2023-5-26",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170426"
    },
    {
        "id": 24315,
        "title": "Meta-learning for emerging applications: Finance, building materials, graph neural networks, program synthesis, transportation, recommendation systems, and climate science",
        "authors": "Lan Zou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-89931-4.00004-3"
    },
    {
        "id": 24316,
        "title": "Neural Networks in Credit Risk Classification of Companies in the Construction Sector",
        "authors": "Aleksandra Wójcicka",
        "published": "2018-1-5",
        "citations": 3,
        "abstract": "The financial sector (banks, financial institutions, etc.) is the sector most exposed to financial and credit risk, as one of the basic objectives of banks' activity (as a specific enterprise) is granting credit and loans. Because credit risk is one of the problems constantly faced by banks, identification of potential good and bad customers is an extremely important task. This paper investigates the use of different structures of neural networks to support the preliminary credit risk decision-making process. The results are compared among the models and juxtaposed with real-world data. Moreover, different sets and subsets of entry data are analyzed to find the best input variables (financial ratios).",
        "link": "http://dx.doi.org/10.33119/erfin.2017.2.2.1"
    },
    {
        "id": 24317,
        "title": "USAGE OF ARTIFICIAL NEURAL NETWORKS IN MARKETING RESEARCH",
        "authors": "Gayane Ghukasyan, Petros Petoyan, Gayane Bakhshyan",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "Any organization, in order to carry out successful activities in the conditions of strong competition and uncertainty of the environment, must be constantly informed of its customers, familiar with their constantly changing requirements, understand what is its target audience and strive to maximize their satisfaction level. For this purpose, the implementation of marketing research is very important, because it allows to collect multi-faceted information about customers, their requirements, the attitude of customers towards the given organization and the product or service issued by the latter, and other important factors that directly or indirectly affect the competitiveness of the organization and on profitability.\r\nModern economics puts forward new methods, the use of which in the implementation of marketing research allows the process to be carried out more efficiently, quickly and accurately. Artificial neural networks (ANNs) are among those methods. They allow you to identify extremely complex dependencies, perform analyzes for large amounts of data, solve complex formalization problems, etc. The article presents the analysis of the results of the survey conducted for the purpose of assessing the satisfaction of consumers with the level of water supply using artificial neural networks and offers recommendations aimed at solving the above problems.\r\nmarketing research, , machine learning, , , ",
        "link": "http://dx.doi.org/10.59503/29538009-2023.si-1-33"
    },
    {
        "id": 24318,
        "title": "Integration between technical indicators and artificial neural networks for the prediction of the exchange rate: Evidence from emerging economies",
        "authors": "Osama Wagdi, Eman Salman, Hatem Albanna",
        "published": "2023-10-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/23322039.2023.2255049"
    },
    {
        "id": 24319,
        "title": "Forex exchange rate forecasting using deep recurrent neural networks",
        "authors": "Alexander Jakob Dautel, Wolfgang Karl Härdle, Stefan Lessmann, Hsin-Vonn Seow",
        "published": "2020-9",
        "citations": 32,
        "abstract": "AbstractDeep learning has substantially advanced the state of the art in computer vision, natural language processing, and other fields. The paper examines the potential of deep learning for exchange rate forecasting. We systematically compare long short-term memory networks and gated recurrent units to traditional recurrent network architectures as well as feedforward networks in terms of their directional forecasting accuracy and the profitability of trading model predictions. Empirical results indicate the suitability of deep networks for exchange rate forecasting in general but also evidence the difficulty of implementing and tuning corresponding architectures. Especially with regard to trading profit, a simpler neural network may perform as well as if not better than a more complex deep neural network.",
        "link": "http://dx.doi.org/10.1007/s42521-020-00019-x"
    },
    {
        "id": 24320,
        "title": "Neural Networks Referees in 2023",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00713-x"
    },
    {
        "id": 24321,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "",
        "published": "2019-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(19)30351-x"
    },
    {
        "id": 24322,
        "title": "Classification-based financial markets prediction using deep neural networks",
        "authors": "Matthew Dixon, Diego Klabjan, Jin Hoon Bang",
        "published": "2017-12-21",
        "citations": 65,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/af-170176"
    },
    {
        "id": 24323,
        "title": "Path Selection Strategy of Communication Network Based on Graph Convolutional Neural Network",
        "authors": "Xiaojun Zhang",
        "published": "2022-7-18",
        "citations": 1,
        "abstract": "In order to improve the efficiency of communication network path selection, this paper combines the graph convolutional neural network to formulate the communication network path selection strategy and selects the enhanced decoding algorithm as the fixed-point decoding algorithm. For the quantization scheme based on the enhanced decoding algorithm, the selection of the fixed-point integer bit width of each operation variable in the SISO decoder is analyzed and determined by the method of statistical characteristic analysis. Moreover, this paper calculates the normalized threshold value according to the proposed state metric normalization scheme. In addition, this paper constructs an intelligent communication path selection system. Through research, it can be seen that the communication network path selection system based on graph convolutional neural network proposed in this paper can effectively improve the effect of multicommunication path selection.",
        "link": "http://dx.doi.org/10.1155/2022/9548441"
    },
    {
        "id": 24324,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "",
        "published": "2018-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(18)30306-x"
    },
    {
        "id": 24325,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(23)00714-1"
    },
    {
        "id": 24326,
        "title": "Pairs-Trading Strategies with Recurrent Neural Networks Market Predictions",
        "authors": "Andrea Flori, Daniele Regoli",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-78965-7_32"
    },
    {
        "id": 24327,
        "title": "Deep weighted Monte Carlo: a hybrid option pricing framework using neural networks",
        "authors": "Sándor Kunsági-Máté, Gábor Fáth, István Csabai, Gábor Molnár-Sáska",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2023.2181206"
    },
    {
        "id": 24328,
        "title": "Improved parameter estimation of Time Dependent Kernel Density by using Artificial Neural Networks",
        "authors": "Xing Wang, Chris P. Tsokos, Abolfazl Saghafi",
        "published": "2018-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jfds.2018.04.002"
    },
    {
        "id": 24329,
        "title": "Performance comparison of multifractal techniques and artificial neural networks in the construction of investment portfolios",
        "authors": "Alexandre Silva de Oliveira, Paulo Sergio Ceretta, Peter Albrecht",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.frl.2023.103814"
    },
    {
        "id": 24330,
        "title": "A new hybrid expansion function based mutual information for a multilayer neural networks optimization",
        "authors": "Kais NCIBI, Amor DJENINA, Tarek SADRAOUI, Faycel MILI",
        "published": "2017-12-30",
        "citations": 0,
        "abstract": "Function expansion was used to expand initial features based on a non linear transformation. Many known expansion functions are found such the trigonometric, the polynomial, the Legendre polynomial, the power series, the exponential and the logarithmic transformation. This paper present a comparison between different expansion functions based on mutual information and different performance functions. We propose a new expansion process able to improve the correspondent mutual information and the final performance. The process was tested; using different benchmark databases, and shows his ability to improve results of classification problems",
        "link": "http://dx.doi.org/10.54960/jfcg.v1i2.6"
    },
    {
        "id": 24331,
        "title": "DeepVaR: a framework for portfolio risk assessment leveraging probabilistic deep neural networks",
        "authors": "Georgios Fatouros, Georgios Makridis, Dimitrios Kotios, John Soldatos, Michael Filippakis, Dimosthenis Kyriazis",
        "published": "2023-3",
        "citations": 5,
        "abstract": "AbstractDetermining and minimizing risk exposure pose one of the biggest challenges in the financial industry as an environment with multiple factors that affect (non-)identified risks and the corresponding decisions. Various estimation metrics are utilized towards robust and efficient risk management frameworks, with the most prevalent among them being the Value at Risk (VaR). VaR is a valuable risk-assessment approach, which offers traders, investors, and financial institutions information regarding risk estimations and potential investment insights. VaR has been adopted by the financial industry for decades, but the generated predictions lack efficiency in times of economic turmoil such as the 2008 global financial crisis and the COVID-19 pandemic, which in turn affects the respective decisions. To address this challenge, a variety of well-established variations of VaR models are exploited by the financial community, including data-driven and data analytics models. In this context, this paper introduces a probabilistic deep learning approach, leveraging time-series forecasting techniques with high potential of monitoring the risk of a given portfolio in a quite efficient way. The proposed approach has been evaluated and compared to the most prominent methods of VaR calculation, yielding promising results for VaR 99% for forex-based portfolios.",
        "link": "http://dx.doi.org/10.1007/s42521-022-00050-0"
    },
    {
        "id": 24332,
        "title": "Bayesian Approach to Energy Load Forecast with Neural Networks",
        "authors": "Luca Di Persio, Oleksandr Honchar",
        "published": "2020-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789813278387_0004"
    },
    {
        "id": 24333,
        "title": "Promoting Further Developments of Neural Networks",
        "authors": "Kenji Doya, DeLiang Wang",
        "published": "2017-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(16)30179-4"
    },
    {
        "id": 24334,
        "title": "Learning Aligned Vertex Convolutional Networks for Graph Classification",
        "authors": "Lixin Cui, Lu Bai, Xiao Bai, Yue Wang, Edwin R. Hancock",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3129649"
    },
    {
        "id": 24335,
        "title": "Neural Networks",
        "authors": "",
        "published": "2021-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9781786349378_0005"
    },
    {
        "id": 24336,
        "title": "Stock Market Prediction Performance of Neural Networks: A Literature Review",
        "authors": "Özgür Ican, Taha Bugra Çelik",
        "published": "2017-10-15",
        "citations": 24,
        "abstract": "In this paper, previous studies featuring an artificial neural networks based prediction model have been reviewed. The main purpose of this review is to examine studies which use directional prediction accuracy (also known as hit ratio) or profitability of the model as a benchmark since other forecast error measures - namely mean absolute deviation (MAD), root mean squared error (RMSE), mean absolute error (MAE) and mean squared error (MSE) - have been criticized for the argument that they are not able to actually show how useful the prediction model is, in terms of financial gains (i.e. for practical usage). In order to meet the publication selection criteria mentioned above, a large number of publications have been examined and 25 of papers satisfying the criteria are selected for comparison. Classification of the eligible papers are summarized in a table format for future studies.",
        "link": "http://dx.doi.org/10.5539/ijef.v9n11p100"
    },
    {
        "id": 24337,
        "title": "Towards explainable deep neural networks (xDNN)",
        "authors": "Plamen Angelov, Eduardo Soares",
        "published": "2020-10",
        "citations": 150,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2020.07.010"
    },
    {
        "id": 24338,
        "title": "Probabilistic robustness estimates for feed-forward neural networks",
        "authors": "Nicolas Couellan",
        "published": "2021-10",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2021.04.037"
    },
    {
        "id": 24339,
        "title": "Feedforward Neural Networks: Cross-Validation of a Break-Out Range Strategy",
        "authors": "Ulrich R. Deinwallner",
        "published": "2020-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36348/sjef.2020.v04i09.001"
    },
    {
        "id": 24340,
        "title": "Short-term prediction for Ethereum with Deep Neural Networks",
        "authors": "Eduardo José Costa Lopes, Reinaldo Augusto da Costa Bianchi",
        "published": "2022-7-31",
        "citations": 0,
        "abstract": "The main contribution of this research is to investigate whether an Artificial Neural Network is an option to predict Ethereum cryptocurrency close price on a time constrained scenario. The ANN training time and time lagged data availability are considered as constraints on finding the fastest and the most accurate regression model using ARIMA results as a baseline. As part of the study, hourly aggregated data is processed to generate a step-ahead forecast and then processing time is compared for each architecture. Previous work related to cryptocurrency forecasting usually focus the analysis only on accuracy, and use coarser data granularity. Results have shown that convolutional neural networks over performed other architectures for accuracy and time objectives.",
        "link": "http://dx.doi.org/10.5753/bwaif.2022.222629"
    },
    {
        "id": 24341,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "Kenji Doya, DeLiang Wang",
        "published": "2022-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(21)00464-0"
    },
    {
        "id": 24342,
        "title": "Bidirectionally self-normalizing neural networks",
        "authors": "Yao Lu, Stephen Gould, Thalaiyasingam Ajanthan",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.017"
    },
    {
        "id": 24343,
        "title": "Piecewise convexity of artificial neural networks",
        "authors": "Blaine Rister, Daniel L. Rubin",
        "published": "2017-10",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2017.06.009"
    },
    {
        "id": 24344,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "Kenji Doya, DeLiang Wang",
        "published": "2020-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(20)30384-1"
    },
    {
        "id": 24345,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "Taro Toyoizumi, DeLiang Wang",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(22)00490-7"
    },
    {
        "id": 24346,
        "title": "Advanced Stochastic Optimization Algorithm for Deep Learning Artificial Neural Networks in Banking and Finance Industries",
        "authors": "Jamilu Auwalu Adamu",
        "published": "2019-11-26",
        "citations": 3,
        "abstract": "One of the objectives of this paper is to incorporate fat-tail effects into, for instance, Sigmoid in order to introduce Transparency and Stability into the existing stochastic Activation Functions. Secondly, according to the available literature reviewed, the existing set of Activation Functions were introduced into the Deep learning Artificial Neural Network through the “Window” not properly through the “Legitimate Door” since they are “Trial and Error “and “Arbitrary Assumptions”, thus, the Author proposed a “Scientific Facts”, “Definite Rules: Jameel’s Stochastic ANNAF Criterion”, and a “Lemma” to substitute not necessarily replace the existing set of stochastic Activation Functions, for instance, the Sigmoid among others. This research is expected to open the “Black-Box” of Deep Learning Artificial Neural networks. The author proposed a new set of advanced optimized fat-tailed Stochastic Activation Functions EMANATED from the AI-ML-Purified Stocks Data  namely; the Log – Logistic (3P) Probability Distribution (1st), Cauchy Probability Distribution (2nd), Pearson 5 (3P) Probability Distribution (3rd), Burr (4P) Probability Distribution (4th), Fatigue Life (3P) Probability Distribution (5th), Inv. Gaussian (3P) Probability Distribution (6th), Dagum (4P) Probability Distribution (7th), and Lognormal (3P) Probability Distribution (8th) for the successful conduct of both Forward and Backward Propagations of Deep Learning Artificial Neural Network. However, this paper did not check the Monotone Differentiability of the proposed distributions. Appendix A, B, and C presented and tested the performances of the stressed Sigmoid and the Optimized Activation Functions using Stocks Data (2014-1991) of Microsoft Corporation (MSFT), Exxon Mobil (XOM), Chevron Corporation (CVX), Honda Motor Corporation (HMC), General Electric (GE), and U.S. Fundamental Macroeconomic Parameters, the results were found fascinating. Thus, guarantee, the first three distributions are excellent Activation Functions to successfully conduct any Stock Deep Learning Artificial Neural Network. Distributions Number 4 to 8 are also good Advanced Optimized Activation Functions. Generally, this research revealed that the Advanced Optimized Activation Functions satisfied Jameel’s ANNAF Stochastic Criterion depends on the Referenced Purified AI Data Set, Time Change and Area of Application which is against the existing “Trial and Error “and “Arbitrary Assumptions” of Sigmoid, Tanh, Softmax, ReLu, and Leaky ReLu.",
        "link": "http://dx.doi.org/10.30560/rfm.v1n1p8"
    },
    {
        "id": 24347,
        "title": "Neural Networks in Finance: <i>Design and Performance</i>",
        "authors": "Irene Aldridge, Marco Avellaneda",
        "published": "2019-10-31",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3905/jfds.2019.1.4.039"
    },
    {
        "id": 24348,
        "title": "The efficient hedging frontier with deep neural networks",
        "authors": "Zheng Gong, Carmine Ventre, John O'Hara",
        "published": "2021-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3490354.3494392"
    },
    {
        "id": 24349,
        "title": "Modeling Inverse Demand Function with Explainable Dual Neural Networks",
        "authors": "Zhiyu Cao, Zihan Chen, Prerna Mishra, Hamed Amini, Zachary Feinstein",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3604237.3626887"
    },
    {
        "id": 24350,
        "title": "SegQNAS: Quantum-inspired Neural Architecture Search applied to Medical Image Semantic Segmentation",
        "authors": "Guilherme Carlos, Karla Figueiredo, Abir Hussain, Marley Vellasco",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191869"
    },
    {
        "id": 24351,
        "title": "Neural electrical activity and neural network growth",
        "authors": "F.M. Gafarov",
        "published": "2018-5",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2018.02.001"
    },
    {
        "id": 24352,
        "title": "A generative model of a limit order book using recurrent neural networks",
        "authors": "Hanna Hultin, Henrik Hult, Alexandre Proutiere, Samuel Samama, Ala Tarighati",
        "published": "2023-6-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/14697688.2023.2205583"
    },
    {
        "id": 24353,
        "title": "Application of grey relational analysis and artificial neural networks on corporate social responsibility (CSR) indices",
        "authors": "John Francis Diaz, Thanh Tung Nguyen",
        "published": "2023-7-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/20430795.2021.1929805"
    },
    {
        "id": 24354,
        "title": "Forward–Backward Stochastic Neural Networks: Deep Learning of High-Dimensional Partial Differential Equations",
        "authors": "Maziar Raissi",
        "published": "2023-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789811280306_0018"
    },
    {
        "id": 24355,
        "title": "Modular representation of layered neural networks",
        "authors": "Chihiro Watanabe, Kaoru Hiramatsu, Kunio Kashino",
        "published": "2018-1",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2017.09.017"
    },
    {
        "id": 24356,
        "title": "Announcement of the Neural Networks Best Paper Award",
        "authors": "Kenji Doya, DeLiang Wang",
        "published": "2017-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(17)30214-9"
    },
    {
        "id": 24357,
        "title": "Efficacies of artificial neural networks ushering improvement in the prediction of extant credit risk models",
        "authors": "Meera Aranha, Kartikeya Bolar",
        "published": "2023-12-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/23322039.2023.2210916"
    },
    {
        "id": 24358,
        "title": "A forecasting methodology based on second-generation wavelets and neural networks: application to power transformer oil temperature",
        "authors": "Francisco Elânio Bezerra, Silvio Giuseppe Di Santo, Giovanni Manassero Junior, Rodrigo Rozenblit Tiferes, Alvaro da Rocha Albertini, Gabriel Rodrigues Santos",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00202-023-02134-5"
    },
    {
        "id": 24359,
        "title": "Subrecursive neural networks",
        "authors": "Jiří Šíma",
        "published": "2019-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2019.04.019"
    },
    {
        "id": 24360,
        "title": "Artificial neural networks",
        "authors": "",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-817078-6.00016-7"
    },
    {
        "id": 24361,
        "title": "Corrigendum to ‘An exact mapping from ReLU networks to spiking neural networks’ [Neural Networks Volume 168 (2023) Pages 74-88]",
        "authors": "Ana Stanojevic, Stanisław Woźniak, Guillaume Bellec, Giovanni Cherubini, Angeliki Pantazi, Wulfram Gerstner",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.057"
    },
    {
        "id": 24362,
        "title": "Mean-field neural networks: Learning mappings on Wasserstein space",
        "authors": "Huyên Pham, Xavier Warin",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.015"
    },
    {
        "id": 24363,
        "title": "Neural Networks and Deep Learning: A Paradigm Shift in Information Processing, Machine Learning, and Artificial Intelligence",
        "authors": "Stephen Fitz, Peter Romero",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-65117-6_22"
    },
    {
        "id": 24364,
        "title": "Announcement",
        "authors": "",
        "published": "2019-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(19)30012-7"
    },
    {
        "id": 24365,
        "title": "VC dimensions of group convolutional neural networks",
        "authors": "Philipp Christian Petersen, Anna Sepliarskaia",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.012"
    },
    {
        "id": 24366,
        "title": "Announcement",
        "authors": "",
        "published": "2019-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(19)30013-9"
    },
    {
        "id": 24367,
        "title": "Announcement",
        "authors": "",
        "published": "2019-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0893-6080(18)30326-5"
    },
    {
        "id": 24368,
        "title": "Spiking neural networks for deep learning and knowledge representation: Editorial",
        "authors": "Nikola K. Kasabov",
        "published": "2019-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2019.08.019"
    },
    {
        "id": 24369,
        "title": "Evolving neural networks to follow trajectories of arbitrary complexity",
        "authors": "Benjamin Inden, Jürgen Jost",
        "published": "2019-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2019.04.013"
    },
    {
        "id": 24370,
        "title": "Banks Financial State Analysis and Bankruptcy Risk Forecasting with Application of Fuzzy Neural Networks",
        "authors": "Yuriy Zaychenko, Michael Zgurovsky, Galib Hamidov",
        "published": "2019-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.82534"
    }
]