[
    {
        "id": 26905,
        "title": "Real Time Automatic Sign Language Translation Machine Learning &amp; IoT",
        "authors": "C. Suresh, L. Dinesh Kumar",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134503"
    },
    {
        "id": 26906,
        "title": "Real-time Translation of American Sign Language into Text Using Machine Learning",
        "authors": "Rajaa Alqudah, Aya Abugharbieh, Malak Khasawneh, Rasha Harahsheh",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323814"
    },
    {
        "id": 26907,
        "title": "The metamorphosis of machine translation: The rise of neural machine translation and its challenges",
        "authors": "Yuduo Chen",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Machine translation refers to the process of using computers to translate source language into target language, which has undergone significant transformations since its inception, with the current mainstream neural machine translation achieving satisfactory translation performance. This paper overviews the three developmental stages of machine translation: rule-based machine translation, statistical machine translation, and neural machine translation, with a focus on neural machine translation. It introduces the key models that emerged in the development process of neural machine translation, namely the recurrent neural network encoder-decoder model, recurrent neural network search model, and Transformer, and compares their strengths and limitations. Other relevant technologies and models developed alongside neural machine translation are also discussed. Addressing the current challenges of neural machine translation, the paper delves into issues of overfitting, low-resource translation, structural optimization of Transformer models, and enhancement of neural machine translation interpretability. Finally, the paper explores the prospects of applying neural machine translation to multimodal translation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/43/20230815"
    },
    {
        "id": 26908,
        "title": "In Real Time",
        "authors": "Shene Mohammed",
        "published": "2023-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/07374836.2023.2179290"
    },
    {
        "id": 26909,
        "title": "AI-Powered Real-Time Speech-to-Speech Translation for Virtual Meetings Using Machine Learning Models",
        "authors": "Karunya S, Jalakandeshwaran M, Thanuja Babu, Uma R",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccebs58601.2023.10448600"
    },
    {
        "id": 26910,
        "title": "Applying machine translation to Chinese–English subtitling: Constraints and challenges",
        "authors": "Lu Tian",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "Focusing on the topic of applying machine translation (MT) to Chinese–English subtitling, the subject of the present study, this article first analyses the current literature and introduces the general constraints in Chinese–English subtitling from three perspectives: technical, cultural, and textual. Technical constraints are imposed by the limited time and space available for each subtitle; cultural constraints relate to the disparities in the beliefs, values, customs, behaviours, and artefacts of different cultural groups; and textual constraints predominantly manifest in the differences between the source and target languages and the segmented nature of subtitles. In order to respond to these constraints and to achieve conciseness, comprehensibility, and coherence in the translated subtitles, this study highlighted condensation, context, and coordination as the key strategies to adopt. However, these strategies pose considerable challenges for MT in Chinese–English subtitling. First, the common practice of full translation by most MT tools tends to work against making subtitles concise. Second, the lack of relevant contextual knowledge limits the ability of MT to generate appropriate translations. Third, the segmented display of subtitles makes it challenging for MT to capture and reflect the logic in the source text, on the one hand, and to produce coherent output in self-contained segments, on the other. To illustrate these constraints and challenges, this article provides examples of bilingual subtitles from American Factory (Bognar & Reichert, 2019), an Oscar Winner for Best Documentary Feature, and compares the official subtitles with those generated by three popular MT tools in Chinese–English translation. The study investigated the efficacy of MT subtitling and its potential to produce quality subtitles; and this article proposes possible solutions and suggestions for improving the quality of MT in subtitling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52034/lans-tts.v22i.752"
    },
    {
        "id": 26911,
        "title": "Comparative Analysis of Multiple ML Models and Real-Time Translation",
        "authors": "Atharva Balasaheb Chivate, Pratiksha D Chopade, Shreeshail Chitpur, Om N Chavan, Shailaja Uke",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccmla58983.2023.10346894"
    },
    {
        "id": 26912,
        "title": "Real Time Language Translation Collaboration Platform",
        "authors": "Dr.Vijaya Kumar AV, onika BK, Arun Kumar, Nisha HV, Susheel Kumar PM",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0124.0250"
    },
    {
        "id": 26913,
        "title": "Time Metaphors in English and Arabic: Translation Challenges",
        "authors": "Reima Al-Jarf",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "Time metaphorical expressions are common in all languages and in general as well as specialized contexts. This study explores the similarities and differences between English and Arabic time metaphorical expressions containing , and the difficulties that student-translators have in translating them; the translation strategies they use and the causes of translation weaknesses. A sample of English and Arabic general and specialized time metaphors containing second ثانية, minute دقيقة , hourساعة , day يوم , year سنة، عام , age, era, and epochحقبة , عصر;  الدهر eternity; time وقت، زمن was collected, analyzed and compared. It was found that time metaphorical expressions fall into 4 categories: (i) those that are identical in form and meaning in both languages (golden age, around the clock); (ii) those that are similar in meaning but differ in wording (wait for ages); (iii) those that exist in English, but have no equivalents in Arabic (time is money); and (iv) those that exist in Arabic but have no equivalents in English (زلزلة الساعة tremors of the day of judgment). Specialized expressions used in both languages are exact translations (Stone Age). Student-translators could translate fewer than 20% of the test items correctly and left many blank. Time metaphorical expressions similar in both languages were easy to translate, whereas opaque ones with an idiomatic or metonymic meaning and culture-specific ones were difficult (زمن  أكل عليه الدهر وشرب too old, obsolete; الرويبضة insignificant people talking about crucial issues ). Those that require a specialized background knowledge (العصر الطباشيري Cretaceous Period) were difficult as well. Numerous strategies were utilized in translating the time expression as literal translation, partial translation, paraphrase, using synonyms and extraneous translations. Results and recommendations for translation pedagogy are given.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/ijtis.2023.3.4.8"
    },
    {
        "id": 26914,
        "title": "Machine learning approaches for real-time forecasting of solar still distillate output",
        "authors": "Deepak Kumar Murugan, Zafar Said, Hitesh Panchal, Naveen Kumar Gupta, Sekar Subramani, Abhinav Kumar, Kishor Kumar Sadasivuni",
        "published": "2023-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.envc.2023.100779"
    },
    {
        "id": 26915,
        "title": "Some Reflections on the Interface between Professional Machine Translation Literacy and Data Literacy",
        "authors": "Ralph Krüger",
        "published": "2023-1-18",
        "citations": 2,
        "abstract": "Due to the widespread use of data-driven neural machine translation, both by professional translators and layperson users, an adequate machine translation literacy on the part of the users of this technology is becoming more and more important. At the same time, the increasing datafication of both the private and the business sphere requires an adequate data literacy in modern society. The present article takes a closer look at machine translation literacy and data literacy and investigates the interface between the two concepts. This is done to lay the preliminary theoretical foundations for a didactic project aiming to develop didactic resources for teaching data literacy in its machine translation-specific form to students of BA programmes in translation/specialised communication.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46298/jdmdh.9045"
    },
    {
        "id": 26916,
        "title": "Model for Real-Time Subtitling from Spanish to Quechua Based on Cascade Speech Translation",
        "authors": "Abraham Alvarez-Crespo, Diego Miranda-Salazar, Willy Ugarte",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011783300003393"
    },
    {
        "id": 26917,
        "title": "Real-time Age and Gender Classification using VGG19",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Unrestricted real-world facial photographs are arranged into specified age and gender groups using unprocessed face age and gender estimations. This explorer nation has now been prefabbed with earth-shattering enhancements due to its value in speedy real-world applications. However, conventional approaches utilizing unfiltered benchmarks show their incapacity to handle higher levels of variance in such unrestricted photographs. Convolutional Neural Networks (CNNs) enabled approaches have recently been widely used during categorization tasks due to their superior performance in facial psychotherapy. Dimension extraction and categorization are both components of the two-level CNN framework. The article extraction process extracts characteristics such as age and sexual identity, while the classification technique assigns the play photographs to the appropriate age and gender groups. We propose a ground-breaking end-to-end CNN swing in this implementation to achieve better and healthier age units and sexuality categorization of unfiltered real-world faces. We use a bulky person pretreatment approach to prepare and process the unfiltered real-world faces before they are input into the CNN poser in order to handle the significant discrepancies in those faces. When tested for sorting accuracy on the synoptical OIUAudience benchmark, an experimental result reveals that with us assistance achieves state-of-the-art achievement in both age gathering and gender arrangement. Our web is pretrained on an IMDb-WIKI with chanting labels, then fine-tuned on MORPH-II, and eventually on the OIUAudience (first) dataset's training set. In comparison to the best-reported results, the classification of age groups is improved by an excellent percentage (exact accuracy) and a very high percentage (validation accuracy), while the classification of genders is improved by an excellent percentage (exact correctness) and 93.42 percent (validation accuracy).",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.04"
    },
    {
        "id": 26918,
        "title": "Guest editorial: special issue on predictable machine learning",
        "authors": "Daniel Casini, Giorgio Buttazzo",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11241-023-09406-0"
    },
    {
        "id": 26919,
        "title": "Real Time Indonesian Sign Language Hand Gesture Phonology Translation Using Deep Learning Model",
        "authors": "Denny Pribadi, Mochamad Wahyudi, Diah Puspitasari, Agung Wibowo, Rizal Saputra, Rofi Saefurrohman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012446000003848"
    },
    {
        "id": 26920,
        "title": "The Challenges of Teaching and Assessing Technical Translation in an Era of Neural Machine Translation",
        "authors": "Célia Tavares, Laura Tallone, Luciana Oliveira, Sandra Ribeiro",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "Teaching translation in higher education has undeniably been impacted by the innovations brought about by machine translation (MT), more particularly neural machine translation (NMT). This influence has become significantly more noticeable in recent years, as NMT technology progresses hand in hand with artificial intelligence. A case study supported by a questionnaire conducted among translation students (bachelor’s and master’s programmes at ISCAP) probed the degree of student satisfaction with CAT tools and revealed that they favour the use of MT in their translation practices, focusing their work on post-editing tasks rather than exploring other translation strategies and complementary resources. Although MT cannot be disregarded in translation programmes, as machine-generated translations make up an increasingly larger amount of a professional translator’s output, the widespread use of MT by students poses new challenges to translators’ training, since it becomes more difficult to assess students’ level of proficiency. Translation teachers must not only adapt their classroom strategies to accommodate these current translation strategies (NMT) but also, as intended by this study, find new, adequate methods of training and assessing students that go beyond regular translation assignments while still ensuring that students acquire the proper translation competence. Thus, as the use of NMT makes it considerably more challenging to assess a student’s level of translation competence, it is necessary to introduce other activities that not only allow students to acquire and develop their translation competence as defined in the EMT (European Masters in Translation) framework but also enable teachers to assess students more objectively. Hence, this article foregrounds a set of activities usually regarded as “indirect tasks” for technical translation courses that hopefully results in the development of student translation skills and competence, as well as provides more insights for teachers on how to more objectively assess students. It is possible, then, to conclude that these activities, such as different types of paraphrasing and error-detection tasks, may have the potential to encourage creative thinking and problem-solving strategies, giving teachers more resources to assess students’ level of translation competence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/educsci13060541"
    },
    {
        "id": 26921,
        "title": "Breakthroughs and Challenges of Machine Translation in the Era of Artificial Intelligence",
        "authors": "Rong Xu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00116"
    },
    {
        "id": 26922,
        "title": "Real-Time Material Identification Using Light Spectroscopy and Support Vector Machine (SVM)",
        "authors": "Masoud Shaloo, Gábor Princz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012254400003543"
    },
    {
        "id": 26923,
        "title": "IOL Research Machine Translation Systems for WMT23 General Machine Translation Shared Task",
        "authors": "Wenbo Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.19"
    },
    {
        "id": 26924,
        "title": "Requirements and Challenges in the Configuration of a Real-Time Node for OPC UA Publish-Subscribe Communication",
        "authors": "Rebekka Neumann, Christian von Arnim, Michael Neubauer, Armin Lechler, Alexander Verl",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/m2vip58386.2023.10413399"
    },
    {
        "id": 26925,
        "title": "Real time machine learning and decision-making with hardware expert systems and gradient descent trained expert systems",
        "authors": "Jeremy Straub",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2670081"
    },
    {
        "id": 26926,
        "title": "REAL WORLD APPLICATIONS AND RESEARCH DIRECTIONS FOR MACHINE LEARNING: CHALLENGES AND DEFIES",
        "authors": "Ms. Zaiba Khan",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/ecb/2023.12.3.226"
    },
    {
        "id": 26927,
        "title": "CHALLENGES OF TRANSLATING COVID-19 TERMINOLOGY INTO ARABIC: A STUDY OF MACHINE TRANSLATION AND LINGUISTIC MEANS",
        "authors": "Rashad Faleh Alhasan, Khatra Amar, Hussein Abushaaban",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "The COVID-19 pandemic has given rise to a plethora of new words and terminology in various languages, including Arabic. This linguistic phenomenon stems from the need to describe and discuss the unique circumstances and developments surrounding the pandemic. This study aims to find out the challenges faced by Arabic translators when incorporating these newly coined terms into the Arabic language and culture. The localization of COVID-19 terminology is a complex and challenging task, but it is essential to ensure that Arabic speakers have access to accurate and up-to-date information about the pandemic. The results indicate that there are linguistic and cultural challenges in the English-Arabic translation of COVID-19 prevention and control terminology. By using a variety of linguistic techniques, Arabic translators can help ensure that these new terms are accurately and effectively localized into Arabic.<p> </p><p><strong> Article visualizations:</strong></p><p><img src=\"/-counters-/soc/0001/a.php\" alt=\"Hit counter\" /></p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.46827/ejmts.v3i1.448"
    },
    {
        "id": 26928,
        "title": "Arabic and English Relative Clauses and Machine Translation Challenges",
        "authors": "Khalil A. Nagi",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "The study aims at performing an error analysis as well as providing an evaluation of the quality of neural machine translation (NMT) represented by Google Translate when translating relative clauses. The study uses two test suites are composed of sentences that contain relative clauses. The first test suite composes of 108 pair sentences that are translated from English to Arabic whereas the second composes of 72 Arabic sentences that are translated into English. Errors annotation is performed by 6 professional annotators. The study presents a list of the annotated errors divided into accuracy and fluency errors that occur based on MQM. Manual evaluation is also performed by the six professionals along with a BLEU automatic evaluation using the Tilde Me platform. The results show that fluency errors are more frequent than accuracy errors. They also show that the frequency of errors and MT quality when translating from English into Arabic is lower than the frequency of errors and MT quality when translating from Arabic into English is also presented. Based on the performed error analysis and both manual and automatic evaluation, it is pointed out that the gap between MT and professional human translation is still large.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20428/jss.v29i3.2180"
    },
    {
        "id": 26929,
        "title": "Enhancing Arabic Machine Translation for E-commerce Product Information: Data Quality Challenges and Innovative Selection Approaches",
        "authors": "Bryan Zhang, Salah Danial, Stephan Walter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.13"
    },
    {
        "id": 26930,
        "title": "Real-time tracking of transcription-translation coupling",
        "authors": "Nusrat Qureshi, Olivier Duss",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bpj.2022.11.2608"
    },
    {
        "id": 26931,
        "title": "Challenges in Context-Aware Neural Machine Translation",
        "authors": "Linghao Jin, Jacqueline He, Jonathan May, Xuezhe Ma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.943"
    },
    {
        "id": 26932,
        "title": "Real-Time Process Optimization Using In-Mold Dielectric Analysis and Machine Learning",
        "authors": "A. Chaloupka, A. Redmann",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33599/nasampe/c.23.0051"
    },
    {
        "id": 26933,
        "title": "IOL Research Machine Translation Systems for WMT23 Low-Resource Indic Language Translation Shared Task",
        "authors": "Wenbo Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.94"
    },
    {
        "id": 26934,
        "title": "The Challenges of Using Machine Translation While Translating Polysemous Words",
        "authors": "Meenal T S, Govindarajan P",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "The disparities between machine translation and human translation have shown to be quite challenging when translating polysemous words. This study examines the challenges of translating polysemous words between French and English by finding an easy way to translate the polysemous terms which is the key objective. It would also help in dealing with the most effective method of translating polysemous terms, while a few succeed in translating the contexts and others struggle to come up with the right interpretations. As many words or phrases have numerous meanings, a machine translator is still unable to handle the ambiguity issues that arise and determine what the given context means. One issue that machine translators have yet to solve is the phenomena of polysemy, or numerous meanings, though it certainly isn't the only one. In this paper, instances of these machine translations of texts from several text genres—including texts from the journalistic, medical, legal, and dictionary definition genres—are examined. To clear up any misunderstanding, one must consider the situation’s background. One must also acknowledge that the situation makes sense. In the concluding section of this study, we will be shown some examples of significant issues that have arisen as a result of a lack of understanding of the term, including misunderstanding, lack of comprehension, ambiguity, and limitations on the heedless use of technical definitions in favour of common ones.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11114/smc.v11i2.5944"
    },
    {
        "id": 26935,
        "title": "Adaptive Microservices for Dynamic E-commerce: Enabling Personalized Experiences through Machine Learning and Real-time Adaptation",
        "authors": "Gabriela Dobrița Ene,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "In the rapidly evolving landscape of e-commerce, the need for personalized experiences and real-time adaptation has become paramount. This article proposes a framework for adaptive microservices in the ecommerce domain, leveraging machine learning techniq",
        "keywords": "",
        "link": "http://dx.doi.org/10.51865/eitc.2023.01.08"
    },
    {
        "id": 26936,
        "title": "Machine-Learning-Based Real-Time Photoacoustic Surface Crack Detection",
        "authors": "Abdulrhman Alshaya, Ghadah Alabduljabbar, Asem Alalwan",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/asec2023-15328"
    },
    {
        "id": 26937,
        "title": "Deep Belief Networks Aided Real-time Business English Translation System",
        "authors": "Wenli Xu, Yanli Liu",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.s7.131-141"
    },
    {
        "id": 26938,
        "title": "AI аnd Machine Translation Post-editing: Advancements and Challenges (Insights for Students of International Studies)",
        "authors": "Valentyna Bohatyrets",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "Now, with the appearance of the latest wave of a sophisticated generative artificial intelligence (AI), humanity is about to embark on an entirely new functioning order. The challenge today is that due to AI the world will definitely undergo drastic metamorphosis tomorrow, and again the day after. To adapt to this reinvented economy, people will need to reinvent their skills, careers – and, indeed, their lives. Therefore, educating people for reinvention in this fluid context will require the reinvention of higher education itself. According to Joseph E. Aoun, taking into consideration the targets to be met in the nearest future, the next generation of HEI students are supposed to be educated to invent, to create, and to discover – to meet society’s targets that any most sophisticated artificial intelligence agent cannot, consequently, a curriculum should include technological literacy, or understanding how machines work and how to work with them. Furthermore, the emergence of cognitive translation studies has stipulated an interdisciplinary approach to delve into the cognitive and behavioural aspects of a broad array of cross-language activities including all kinds of translation and interpreting. In a world that relentlessly pursues efficiency and productivity, the figure of a post-editor, a professional translator who has the skills to add that necessary human touch to a text which has previously been subjected to software algorithms, has become more prominent.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31861/mediaforum.2023.13.198-209"
    },
    {
        "id": 26939,
        "title": "GTCOM and DLUT’s Neural Machine Translation Systems for WMT23",
        "authors": "Hao Zong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.20"
    },
    {
        "id": 26940,
        "title": "Preliminary evaluation of ChatGPT as a machine translation engine and as an automatic post-editor of raw machine translation output from other machine translation engines",
        "authors": "Michael Farrell,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26615/issn.2683-0078.2023_009"
    },
    {
        "id": 26941,
        "title": "RoCS-MT: Robustness Challenge Set for Machine Translation",
        "authors": "Rachel Bawden, Benoît Sagot",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.21"
    },
    {
        "id": 26942,
        "title": "Low-Resource Machine Translation Systems for Indic Languages",
        "authors": "Ivana Kvapilíková, Ondřej Bojar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.90"
    },
    {
        "id": 26943,
        "title": "A review of existing Machine Translation Approaches, their Challenges and Evaluation Metrics",
        "authors": "Naseer Ahmed",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "Machine translation is the process of translating a natural language into another. The primary goal of machine translation is to bridge the linguistic gap between languages. A significant job that may be utilized is to extract information from texts written in different languages through machine translation (MT). Due to the remarkable developments in Machine Translation over the past several years, we have entered the era of Neural Machine Translation (NMT). A review of MT is essential for better understanding of MT in the domain of Natural Language Processing. This paper focuses on Statistical, Corpus, Example, Rule based, Transfer based, direct based and Nural Machine Translation approach, their challenges, and existing evaluation metrics such as BLEU score and Human evaluation metrics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22555/pjets.v11i1.1002"
    },
    {
        "id": 26944,
        "title": "MUNI-NLP Systems for Low-resource Indic Machine Translation",
        "authors": "Edoardo Signoroni, Pavel Rychly",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.91"
    },
    {
        "id": 26945,
        "title": "Real-Time Fault-Tolerant Computing with Machine Learning Enhancements",
        "authors": "Meng-Lai Yin, Hovig Aroush",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rams51473.2023.10088209"
    },
    {
        "id": 26946,
        "title": "KYB General Machine Translation Systems for WMT23",
        "authors": "Ben Li, Yoko Matsuzaki, Shivam Kalkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.10"
    },
    {
        "id": 26947,
        "title": "Application of dynamic time warping optimization algorithm in speech recognition of machine translation",
        "authors": "Shaohua Jiang, Zheng Chen",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e21625"
    },
    {
        "id": 26948,
        "title": "Real-Time Object Detection Overview: Advancements, Challenges, and Applications",
        "authors": " Naif Alsharabi",
        "published": "2023-11-12",
        "citations": 0,
        "abstract": "Real-time object detection is a crucial aspect of computer vision with applications spanning autonomous vehicles, surveillance, robotics, and augmented reality. This study examines real-time object detection techniques, highlighting their significance in artificial intelligence. The primary goal is swift and accurate object identification in images or video streams. Traditional methods like sliding windows and region-based approaches had limitations in computational efficiency. Deep learning, particularly Convolutional Neural Networks (CNNs), revolutionized object detection. Models like SSD, YOLO, and Faster R-CNN excel in accuracy and speed. They employ anchor boxes, feature pyramid networks, and non-maximum suppression to balance precision and processing speed. Hardware accelerators like GPUs, TPUs, and FPGAs facilitate real-time inference.\r\nChallenges in real-time object detection include occlusion, scale variations, and cluttered environments. Researchers must navigate the trade-offs between accuracy and speed. Real-time object detection is pivotal in computer vision, enabling intelligent systems across diverse applications. The continuous evolution of deep learning algorithms and hardware capabilities pushes the boundaries of this field, making it a dynamic research domain in artificial intelligence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59145/jaust.v3i6.73"
    },
    {
        "id": 26949,
        "title": "Real-time learning for real-time data: online machine learning for predictive maintenance of railway systems",
        "authors": "Minh-Huong Le-Nguyen, Fabien Turgis, Pierre-Emmanuel Fayemi, Albert Bifet",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.trpro.2023.11.391"
    },
    {
        "id": 26950,
        "title": "eBLEU: Unexpectedly Good Machine Translation Evaluation Using Simple Word Embeddings",
        "authors": "Muhammad ElNokrashy, Tom Kocmi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.61"
    },
    {
        "id": 26951,
        "title": "The relationship between machine translation and human translation in the era of artificial intelligence machine translation",
        "authors": "Yutao Lin",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "In recent years, neural network machine translation has vastly enhanced translation efficiency and ushered in the era of artificial intelligence for machine translation. In the era of artificial intelligence, technological progress has forced us to reconsider the link between machine translation and human translation. Through a literature analysis, the paper investigates the history and current situation of the development of AI translation, the technical anxiety that AI brings to human translation, and the equilibrium between machine translation and human translation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/5/20230547"
    },
    {
        "id": 26952,
        "title": "Machine Learning based Reduced Order Models for Real Time application",
        "authors": "Roberto Bossio",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46720/fwc2023-dgt-018"
    },
    {
        "id": 26953,
        "title": "Harnessing Machine Learning for Real-Time Inflation Nowcasting",
        "authors": "Richard Schnorrenberger, Aishameriane Schmidt, Guilherme valle Moura",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4752626"
    },
    {
        "id": 26954,
        "title": "Retraction Notice: Real-Time Water and Electricity Consumption Monitoring Using Machine Learning Techniques",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3327894"
    },
    {
        "id": 26955,
        "title": "Real-Time Yarn Breakage Detection in the Warping Machine",
        "authors": "Marcin Idzik, Tomasz Rybicki",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3275020"
    },
    {
        "id": 26956,
        "title": "Analyzing Challenges in Neural Machine Translation for Software Localization",
        "authors": "Sai Koneru, Matthias Huck, Miriam Exel, Jan Niehues",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.179"
    },
    {
        "id": 26957,
        "title": "Evaluating Metrics for Document-context Evaluation in Machine Translation",
        "authors": "Vikas Raunak, Tom Kocmi, Matt Post",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.68"
    },
    {
        "id": 26958,
        "title": "<i>Onception</i>: Active Learning with Expert Advice for Real World Machine Translation",
        "authors": "Vânia Mendonça, Ricardo Rei, Luísa Coheur, Alberto Sardinha",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nActive learning can play an important role in low-resource settings (i.e., where annotated data is scarce), by selecting which instances may be more worthy to annotate. Most active learning approaches for Machine Translation assume the existence of a pool of sentences in a source language, and rely on human annotators to provide translations or post-edits, which can still be costly. In this article, we apply active learning to a real-world human-in-the-loop scenario in which we assume that: (1) the source sentences may not be readily available, but instead arrive in a stream; (2) the automatic translations receive feedback in the form of a rating, instead of a correct/edited translation, since the human-in-the-loop might be a user looking for a translation, but not be able to provide one. To tackle the challenge of deciding whether each incoming pair source–translations is worthy to query for human feedback, we resort to a number of stream-based active learning query strategies. Moreover, because we do not know in advance which query strategy will be the most adequate for a certain language pair and set of Machine Translation models, we propose to dynamically combine multiple strategies using prediction with expert advice. Our experiments on different language pairs and feedback settings show that using active learning allows us to converge on the best Machine Translation systems with fewer human interactions. Furthermore, combining multiple strategies using prediction with expert advice outperforms several individual active learning strategies with even fewer interactions, particularly in partial feedback settings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00473"
    },
    {
        "id": 26959,
        "title": "On The Real-world Performance of Machine Translation: Exploring Social Media Post-authors’ Perspectives",
        "authors": "Ananya Gupta, Jae Takeuchi, Bart Knijnenburg",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.trustnlp-1.26"
    },
    {
        "id": 26960,
        "title": "A Real-time Machine Learning Framework for Smart Home-based Yoga Teaching System",
        "authors": "Jothika Sunney, Musfira Jilani, Pramod Pathak, Paul Stynes",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cmvit57620.2023.00029"
    },
    {
        "id": 26961,
        "title": "Extending a predictable machine learning framework with efficient gemm-based convolution routines",
        "authors": "Iryna De Albuquerque Silva, Thomas Carle, Adrien Gauffriau, Claire Pagetti",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11241-023-09407-z"
    },
    {
        "id": 26962,
        "title": "Moniz, Helena and Carla Parra Escartín (eds) (2023). Towards Responsible Machine Translation: Ethical and Legal Considerations in Machine Translation.",
        "authors": "Marian Flanagan",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26034/cm.jostrans.2024.4731"
    },
    {
        "id": 26963,
        "title": "Local Error Translation and Translation Technique Analyses from Instagram Account \"Info Kejadian Semarang\" using Instagram Translation Machine and Google Lens Translation Machine",
        "authors": "Melinda Limin, Raden Arief Nugroho",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isemantic59612.2023.10295285"
    },
    {
        "id": 26964,
        "title": "Development of a Machine Learning Based in-Home Physical Activity Monitoring System Using Wrist Actigraphy and Real-Time Location System",
        "authors": "Seyyed Mahdi Torabi, Mohammad Narimani, Edward Park",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012368000003657"
    },
    {
        "id": 26965,
        "title": "Machine Learning-Based Real-Time Metasurface Reconfiguration",
        "authors": "Feng Su, David Luong, Ian Lam, Sreeraman Rajan, Shulabh Gupta",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sas58821.2023.10254166"
    },
    {
        "id": 26966,
        "title": "Pre-Emptive Emotional Protection for Emotional Laborers through Real-Time Voice Analysis and Machine Learning",
        "authors": "CHANG-MOOK OH",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "This paper proposes and develops 'LINCALL,' a real-time voice processing and machine learning system designed to provide preemptive emotional protection for emotional laborers working in environments such as call centers. LINCALL analyzes voice data in real-time conversations with customers to understand their emotional states, converting this data into text for analysis. The system identifies keywords and offers appropriate questions and answers, aiding emotional laborers in handling customer interactions more effectively. It also includes a feature for responding appropriately to the customer's emotional state, such as voice blocking. Additionally, the automatic voice-to-text conversion feature reduces fatigue for emotional laborers, enhances the efficiency of consultations, and aids in preemptive emotional protection for emotional laborers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131908"
    },
    {
        "id": 26967,
        "title": "Towards Effective Disambiguation for Machine Translation with Large Language Models",
        "authors": "Vivek Iyer, Pinzhen Chen, Alexandra Birch",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.44"
    },
    {
        "id": 26968,
        "title": "Automating Behavioral Testing in Machine Translation",
        "authors": "Javier Ferrando, Matthias Sperber, Hendra Setiawan, Dominic Telaar, Saša Hasan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.97"
    },
    {
        "id": 26969,
        "title": "Retracted: The Relationship between Machine Translation and Human Translation under the Influence of Artificial Intelligence Machine Translation",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9898413"
    },
    {
        "id": 26970,
        "title": "IACS-LRILT: Machine Translation for Low-Resource Indic Languages",
        "authors": "Dhairya Suman, Atanu Mandal, Santanu Pal, Sudip Naskar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.93"
    },
    {
        "id": 26971,
        "title": "Document-Level Language Models for Machine Translation",
        "authors": "Frithjof Petrick, Christian Herold, Pavel Petrushkov, Shahram Khadivi, Hermann Ney",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.39"
    },
    {
        "id": 26972,
        "title": "Visual Prediction Improves Zero-Shot Cross-Modal Machine Translation",
        "authors": "Tosho Hirasawa, Emanuele Bugliarello, Desmond Elliott, Mamoru Komachi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.47"
    },
    {
        "id": 26973,
        "title": "PREDICTION OF REAL-TIME FACIAL EMOTION BASED ON MACHINE LEARNING ALGORITHM",
        "authors": "",
        "published": "2023-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets34529"
    },
    {
        "id": 26974,
        "title": "Predictive Analytics and Machine Learning for Real-Time Supply Chain Risk Mitigation and Agility",
        "authors": "Abeer Aljohani",
        "published": "2023-10-20",
        "citations": 3,
        "abstract": "Supply chain agility has become a key success factor for businesses trying to handle upheavals and uncertainty in today’s quickly changing business environment. Proactive risk reduction is essential for achieving this agility. To facilitate real-time risk prevention and improve agility, this research study proposes an innovative strategy that makes use of machine learning as well as predictive analytics approaches. Traditional supply chain risk management frequently uses post-event analysis as well as historical data, which restricts its ability to address real-time interruptions. This research, on the other hand, promotes a futuristic methodology that uses predictive analytics to foresee possible disruptions. Based on contextual and historical data, machine learning models can be trained to find patterns and correlations as well as anomalies that point to imminent dangers. Organizations can identify risks as they arise and take preventative measures by incorporating these models into a real-time monitoring system. This study examines numerous predictive analytics methods, showing how they can be used to spot supply chain risks. These methods include time series analysis and anomaly detection as well as natural language processing. Additionally, risk assessment models are continuously improved and optimized using machine learning algorithms, assuring their accuracy and adaptability in changing contexts. This research clarifies the symbiotic relationship among predictive analytics and machine learning as well as supply chain agility using a synthesis of theoretical discourse and practical evidence. Case studies from various sectors highlight the usefulness and advantages of the suggested strategy. The advantages of this novel technique include improved risk visibility and quicker response times as well as the capacity to quickly modify operations. The development of a holistic framework that incorporates predictive analytics and machine learning into risk management procedures, setting the path for real-time risk identification as well as mitigation, is one of the theoretical contributions. On the practical side, the case studies offered in this paper show the actual benefits as well as the adaptability of the proposed approach across a wide range of businesses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su152015088"
    },
    {
        "id": 26975,
        "title": "REAL TIME OBJECT DETECTION FOR VISUALLY CHALLENGED PEOPLE USING MACHINE LEARNING",
        "authors": "",
        "published": "2023-5-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets37689"
    },
    {
        "id": 26976,
        "title": "Dominance Pruning in Machine Learning for Solving Financial Trading and Real-Time Multimedia Applications",
        "authors": "Benjamin Wan-Sang Wah",
        "published": "2023-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.ajai.20220602.12"
    },
    {
        "id": 26977,
        "title": "Cascading spatio-temporal attention network for real-time action detection",
        "authors": "Jianhua Yang, Ke Wang, Ruifeng Li, Petra Perner",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00138-023-01457-4"
    },
    {
        "id": 26978,
        "title": "REAL TIME OBJECT DETECTION FOR VISUALLY CHALLENGED PEOPLE USING MACHINE LEARNING",
        "authors": "",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58257/ijprems31126"
    },
    {
        "id": 26979,
        "title": "Machine learning based grid optimization algorithm for real-time applications",
        "authors": "A. Winter, M. Igel, P. Schegner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.0280"
    },
    {
        "id": 26980,
        "title": "Real-Time Machine Learning Application for Formation Tops and Lithology Prediction",
        "authors": "Wael Ziadat, Hany Gamal, Salaheldin Elkatatny",
        "published": "2023-4-24",
        "citations": 2,
        "abstract": "Abstract\nDuring the drilling operation, the drill string is subjected to different geological formations which have distinct lithological characteristics that greatly affect the drilling performance and may ultimately result in increased costs of the project. The lithology of a formation can vary significantly, thus it is of paramount importance to accurately detect lithology changes and formation tops while drilling. In order to do so, geologic data and logs are often utilized by experts and operators to identify lithological variations. Machine learning algorithms and random forest have been employed in recent years to improve the process of lithology prediction, enabling more accurate results at faster rates. Machine learning-based systems incorporate a wide range of indicators such as rock types, mineral composition, sedimentary structures and microfossils for efficient lithology prediction. Additionally, random forest classifiers are beneficial due to their robustness with respect to outliers as well as their ability to capture complex relationships between variables from multivariate input datasets. With this approach, an effective operational strategy can be formulated based on the identified formation lithology in order to reduce incident costs associated with unexpected wellbore issues or instability caused by lithological changes. This technique also provides valuable insight into understanding subsurface conditions for more efficient resource exploration and production operations. limitations and drawbacks of this approach as cost and lag time. The current study proposed an intelligent machine learning solution for auto-detecting drilled formation tops and lithology types while drilling in real-time utilizing drilling surface data. Machine learning techniques are technically employed for developing real-time prediction models for the formation tops and lithology type from the surface drilling data as weight on bit, drill string speed, torque, pumping pressure and rate, and drilling penetration rate. This study implemented random forest and decision trees as two machine learning classifiers to develop real-time models using a data set of composite lithology schemes of five drilled formations. The methodology approach presents a comprehensive layout for data collection, preprocessing, data statistics and analytics, feature engineering, model development, parameters optimization, and prediction performance evaluation. The results showed a high prediction performance for the models for training and testing with overall accuracy higher than 95 through detecting complex lithology schemes. Predicting the drilled formation's tops and lithology while drilling in real-time through the developed solution will provide a technical guide for optimizing the drilling parameters for better drilling performance and optimized mechanical-specific energy to have a safe operation and cost savings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4043/32447-ms"
    },
    {
        "id": 26981,
        "title": "Quality Assessment of Machine Translation from Translation Criticism Perspective—A Case Study of Chinese Translation of a Speech by Neural Machine Translator DeepL",
        "authors": "Yue Bao, Yi Zhang",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icet59358.2023.10424111"
    },
    {
        "id": 26982,
        "title": "Neural Machine Translation for English - Manipuri and English - Assamese",
        "authors": "Goutam Agrawal, Rituraj Das, Anupam Biswas, Dalton Meitei Thounaojam",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.86"
    },
    {
        "id": 26983,
        "title": "Introduction",
        "authors": "Rossella Latorraca, Jacqueline Aiello",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/ttmc.00105.lat"
    },
    {
        "id": 26984,
        "title": "Multilingual k-Nearest-Neighbor Machine Translation-Nearest-Neighbor Machine Translation",
        "authors": "David Stap, Christof Monz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.571"
    },
    {
        "id": 26985,
        "title": "Towards Better Evaluation for Formality-Controlled English-Japanese Machine Translation",
        "authors": "Edison Marrese-Taylor, Pin Chen Wang, Yutaka Matsuo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.49"
    },
    {
        "id": 26986,
        "title": "Real time spam detection system using naive bayes machine learning algorithm over random forest machine learning",
        "authors": "B. Sekhar, G. Padmapriya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0175822"
    },
    {
        "id": 26987,
        "title": "Real-Time Translation of Sign Language for Speech Impaired",
        "authors": "Aishwarya D Shetty, Jyothi Shetty, Karthik K,  Rakshitha, Shabari Shedthi B",
        "published": "2023-2-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccmc56507.2023.10084053"
    },
    {
        "id": 26988,
        "title": "Exploring Prompt Engineering with GPT Language Models for Document-Level Machine Translation: Insights and Findings",
        "authors": "Yangjian Wu, Gang Hu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.15"
    },
    {
        "id": 26989,
        "title": "A REVIEW ON REAL TIME EMOTION DETECTION SYSTEM USING MACHINE LEARNING ALGORITHMS",
        "authors": "",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets33027"
    },
    {
        "id": 26990,
        "title": "Examining the Impact of Machine Learning on Streamlining Data Analysis in Real-Time",
        "authors": "Chandrasekar V, Meena Krishna",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425470"
    },
    {
        "id": 26991,
        "title": "Real-Time Blood Pressure Prediction Using Apache Spark and Kafka Machine Learning",
        "authors": "Ali Farki, Elham Akhondzadeh Noughabi",
        "published": "2023-5-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icwr57742.2023.10138962"
    },
    {
        "id": 26992,
        "title": "Utilizing Drilling Data and Machine Learning in Real-Time Prediction of Poisson's Ratio",
        "authors": "Osama Mutrif Siddig, Salaheldin Elkatatny",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "AbstractRock elastic properties influence drilling performance, estimation of in-situ stresses, and hydraulic fracturing design. Therefore, having complete and accurate information on rock properties is essential. While those properties are conventionally measured experimentally or using well logs, this work proposes to estimate the Poisson's ratio (PR) from parameters available while drilling.Various machine learning techniques were employed, such as artificial neural network (ANN), support vector machine (SVM), and random forest (RF). The dataset utilized contains more than 5800 data points, each of them has a value of PR and six drilling parameters such as rate of penetration (ROP), rotary speed (RPM), and weight on bit (WOB). The dataset was divided into three parts, two were fed to the algorithms for training and testing the models, while the last group (around half of the dataset) was hidden to be used to validate the models later.The models had a good fit with the actual PR values with correlation coefficients as high as 0.99 and errors as low as 1%. Among the used algorithms, ANN and RF yielded the best accuracy in all datasets with no significant difference between the training and the validation performance which indicate good generalization without an overfitting problem.Using drilling data to predict rock mechanical parameters allows building a complete geomechanical model at an early time. It also saves the time and cost associated with laboratory tests.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/213694-ms"
    },
    {
        "id": 26993,
        "title": "Advancing Flotation Process Optimization Through Real-Time Machine Vision Monitoring: A Convolutional Neural Network Approach",
        "authors": "Ahmed Bendaouia, El Abdelwahed, Sara Qassimi, Abdelmalek Boussetta, Intissar Benzakour, Oumkeltoum Amar, François Bourzeix, Khalil Jabbahi, Oussama Hasidi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012237300003598"
    },
    {
        "id": 26994,
        "title": "Real-time face emotion recognition for telediagnosis using machine learning",
        "authors": "Mahzad Gharleghi, Eko Supriyanto",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0128510"
    },
    {
        "id": 26995,
        "title": "Tiny Machine Learning for Real-Time Postural Stability Analysis",
        "authors": "Veysi Adın, Yuxuan Zhang, Bruno Andò, Bengt Oelmann, Sebastian Bader",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sas58821.2023.10254126"
    },
    {
        "id": 26996,
        "title": "Real-Time Intrusion Detection based on Network Monitoring and Machine Learning",
        "authors": "Subhadeep Chakraborty",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5120/ijca2023922955"
    },
    {
        "id": 26997,
        "title": "Machine Learning for Real-Time Anomaly Detection in Optical Networks",
        "authors": "Sadananda Behera, Tania Panayiotou, Georgios Ellinas",
        "published": "2023-7-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icton59386.2023.10207370"
    },
    {
        "id": 26998,
        "title": "Real-Time Lithology Prediction While Drilling Using Machine Learning Algorithms: A Web Application Based Solution",
        "authors": "A. O. Mensah",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Abstract\nFormation lithology is a vital information source for initial well economic assessment, reservoir lithology description, geological correlation, formation identification, verification of wireline log response, and identification of hydrocarbon deposits. Real-time lithology determination while drilling can greatly optimise the drilling process and enhance geosteering. Using linear, non-linear, and ensemble machine learning algorithms, this study sought to automate the process of lithology classification while drilling. Also, the project sought to create a web application with a graphical user interface to enable the users easily train and save models which can be applied on different lithology classification projects without the need to code. A public dataset containing mudlog and lithology data from ten wells in the Volve oil field, Norway, was used in this study. The graphical user interface was then created using Streamlit and Python programming language to allow for easier application of the machine learning algorithms without a prior programming knowledge. The results showed that the ensemble methods (Random Forest classifier and Gradient Boosting classifier) outperformed the other linear (logistic regression) and non-linear (Support Vector) machine learning algorithms. Random Forest classifier achieved an overall accuracy of 99% and a precision of 98% while the Gradient Boosting classifier had an accuracy score of about 97% and a precision of 92% in classifying the six lithology types from ten wells. The results obtained showed that implementing ensemble machine learning algorithms with a graphical user interface can assist Engineers to classify lithology efficiently, easily, and timely while drilling. This web application can also be used by geologists and geophysicists to classify lithology using machine learning without the need to write codes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/217479-stu"
    },
    {
        "id": 26999,
        "title": "Real-Time Location Systems for Quality Improvement: Promises, Challenges, and Recommendations",
        "authors": "Michael A. Rosen",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/qmh.0000000000000423"
    },
    {
        "id": 27000,
        "title": "A Benchmark for Evaluating Machine Translation Metrics on Dialects without Standard Orthography",
        "authors": "Noëmi Aepli, Chantal Amrhein, Florian Schottmann, Rico Sennrich",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.99"
    },
    {
        "id": 27001,
        "title": "Bridging the Gap between Position-Based and Content-Based Self-Attention for Neural Machine Translation",
        "authors": "Felix Schmidt, Mattia Di Gangi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.46"
    },
    {
        "id": 27002,
        "title": "Analysis and Implementation of CNN in Real- time Classification and Translation of Kanji Characters",
        "authors": "Putri Annisa, Zuli Agustina Gultom, Yoshida Sary",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "This research explores the training outcomes of the Convolutional Neural Network (CNN) algorithm applied to Kanji character recognition. It employs a CNN architecture with 10 layers for recognizing digital image of Kanji characters from N5 to N1 levels. The training of the CNN model reveals varying accuracies, influenced by factors such as architecture, training data size, and data quality. The lowest accuracy, occurring at the beginning of training, highlights challenges like poor random weight initialization and suboptimal architecture. Conversely, the highest accuracy demonstrates the optimal predictive ability of the model after multiple training iterations. The iterative training process refines the model's accuracy over time, with initial challenges paving the way for a better understanding of the data for future improvements. In the subsequent analysis and system development phase, two algorithms are compared to assess the effectiveness of the CNN algorithm in Kanji character recognition. Testing is conducted at various complexity levels to systematically evaluate accuracy. This testing involves complexity levels at each Kanji character level to assess system accuracy. The developed model shows potential for real-time classification of Kanji characters, with a focus on error rate and accuracy during training and testing. The built model can essentially be used to evaluate the ability to recognize Kanji characters effectively. The model's performance can be assessed based on the error rate and accuracy achieved during the training and testing processes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v9i1.13176"
    },
    {
        "id": 27003,
        "title": "A survey of Korean undergraduate students majoring in translation on the use of machine translation engines, machine translation training, and translation career.",
        "authors": "Sun-Woo Lee,  , Sang-Bin Lee",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20305/it202301049073"
    },
    {
        "id": 27004,
        "title": "Training and Meta-Evaluating Machine Translation Evaluation Metrics at the Paragraph Level",
        "authors": "Daniel Deutsch, Juraj Juraska, Mara Finkelstein, Markus Freitag",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.96"
    },
    {
        "id": 27005,
        "title": "Real time botnet detection system based on machine learning algorithms",
        "authors": "Wenhao Fang",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2673313"
    },
    {
        "id": 27006,
        "title": "Analysis of Real time Seismic Signal Using Machine Learning",
        "authors": "Sujata Kulkarni, Udhav Bhosle, Vijaykumar T.",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iecon51785.2023.10312688"
    },
    {
        "id": 27007,
        "title": "Review Paper Real-Time Phishing Website With Machine Learning",
        "authors": "Khushal Sharma, Pratik Rai, Jyoti Chandel",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ised59382.2023.10444574"
    },
    {
        "id": 27008,
        "title": "Spaceships, an Erotic Amusement Park, and a Time Machine: New Short Fiction in Translation",
        "authors": " The Editors of WLT",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1353/wlt.2023.0055"
    },
    {
        "id": 27009,
        "title": "Serverless Stream-Based Processing for Real Time Credit Card Fraud Detection Using Machine Learning",
        "authors": "Ravali Attivilli, Angel Arul Jothi",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174314"
    },
    {
        "id": 27010,
        "title": "Real Time Quality Assessment in a Production Line: Machine Learning Approach",
        "authors": "Ritvik Mahapatra, Kumar Gaurav",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mosicom59118.2023.10458752"
    },
    {
        "id": 27011,
        "title": "Cometoid: Distilling Strong Reference-based Machine Translation Metrics into Even Stronger Quality Estimation Metrics",
        "authors": "Thamme Gowda, Tom Kocmi, Marcin Junczys-Dowmunt",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.62"
    },
    {
        "id": 27012,
        "title": "Safeguarding against Cyber Threats: Machine Learning-Based Approaches for Real-Time Fraud Detection and Prevention",
        "authors": "Vikas R. Shetty, Pooja R., Rashmi Laxmikant Malghan",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059111"
    },
    {
        "id": 27013,
        "title": "A real-time fire and flame detection method for electric vehicle charging station based on machine vision",
        "authors": "Dexin Gao, Shiyu Zhang, Yifan Ju, Qing Yang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11554-023-01293-9"
    },
    {
        "id": 27014,
        "title": "Multi-Autonomous machine Formation Method for Intelligent Control: Obstacle Avoidance and Real-Time Order Control",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/ijfans/11/9/360"
    },
    {
        "id": 27015,
        "title": "Challenges in Implementing Real-Time Stream Data in Bioinformatics",
        "authors": "Kalyan Acharjya, G Swetha, Narmadha T",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10455974"
    },
    {
        "id": 27016,
        "title": "Challenging the State-of-the-art Machine Translation Metrics from a Linguistic Perspective",
        "authors": "Eleftherios Avramidis, Shushen Manakhimova, Vivien Macketanz, Sebastian Möller",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.58"
    },
    {
        "id": 27017,
        "title": "Real-time impulse response: a methodology based on Machine Learning approaches for a rapid impulse response generation for real-time Acoustic Virtual Reality systems",
        "authors": "D.A. Sanaguano-Moreno, J.F. Lucio-Naranjo, R.A. Tenenbaum, G.B. Sampaio-Regattieri",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2023.200306"
    },
    {
        "id": 27018,
        "title": "Introduction to thematic section: Challenges to the perfect machine-translation situation",
        "authors": "Helle Dam Jensen, Anne Schjoldager, Tina Paulsen Christensen, Kristine Bundgaard",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "The purpose of the thematic section is to gauge the temperature of MT today by tapping into a selection of critical discussions, thereby shedding light on some challenges to a perfect machine-translation (MT) situation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7146/hjlcb.vi63.143077"
    },
    {
        "id": 27019,
        "title": "Real-time image defect detection system of cloth digital printing machine",
        "authors": "Hongliang Liu",
        "published": "2023-5-3",
        "citations": 0,
        "abstract": "Abstract\nIn order to solve the surface defects such as white silk, spots and wrinkles in the process of digital printing, a surface defect detection system for printed fabrics based on accelerated robust feature algorithm was proposed. Image registration is mainly carried out through accelerated robust feature (SURF); bidirectional unique matching method is adopted to reduce mismatch points, achieve accurate image registration, and extract defect information through differential algorithm. The performance of the improved surfing algorithm is verified by using multiple images. The experimental results show that compared with the traditional template matching method, the detection accuracy of the system detection algorithm is 12% higher, and the average time is 42.81 ms shorter than the traditional template matching method. Experiments show that the improved surfing algorithm has short time and high precision. The system can meet the actual production needs. The new system can detect surface defects on printed fabrics with an accuracy of 98%. Conclusion: The algorithm has higher detection rate and faster detection speed, which can meet the needs of practical industrial applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/pjbr-2022-0099"
    },
    {
        "id": 27020,
        "title": "Real-Time Facial Emotion Detection Using Machine Learning",
        "authors": "Tejashwini S Konappanavar, Jagadish S Loni, Shrinivas Adhyapak, Shashidhar B Patil",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425329"
    },
    {
        "id": 27021,
        "title": "Automatic Helmet Detection for Bike Riders Using Machine Learning for Surveillance Videos in Real-Time",
        "authors": "Lavnish Kumar Singh, Mandeep Kaur",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4487966"
    },
    {
        "id": 27022,
        "title": "Face mask detection using machine learning",
        "authors": "Mohamed Eladham, Ali Bou Nassif, Mohammad A. AlShabi",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672551"
    },
    {
        "id": 27023,
        "title": "Using real-time hybrid simulation for active mass damper experimentation and validation",
        "authors": "Jie Liu, Christian E. Silva, Shirley J. Dyke, Yang Wu, Hongbo Liu",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mechmachtheory.2023.105474"
    },
    {
        "id": 27024,
        "title": "Real-time measurement on dynamic temperature variation of asphalt pavement using machine learning",
        "authors": "Xuefei Wang, Peng Pan, Jiale Li",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2022.112413"
    },
    {
        "id": 27025,
        "title": "Real-Time Defense System using eBPF for Machine Learning-Based Ransomware Detection Method",
        "authors": "Kosuke Higuchi, Ryotaro Kobayashi",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/candarw60564.2023.00043"
    },
    {
        "id": 27026,
        "title": "NOVEL MACHINE LEARNING-BASED APPROACH FOR REAL-TIME SUSPICIOUS ACTIVITY DETECTION IN CCTV FOOTAGE",
        "authors": "",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets37570"
    },
    {
        "id": 27027,
        "title": "Enhancing Predictive Accuracy for Real Time Cryptocurrency Market Prices with Machine Learning Techniques",
        "authors": "Jasmine Sabeena, P.Lakshmi Sagar",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370453"
    },
    {
        "id": 27028,
        "title": "Real-time Data Processing with Machine Learning Algorithms",
        "authors": "Shubhodip Sasmal",
        "published": "2023",
        "citations": 0,
        "abstract": "In the era of information abundance, organizations are faced with the challenge of harnessing real-time data streams to extract valuable insights swiftly. This research paper explores the intersection of real-time data processing and machine learning algorithms, aiming to develop a comprehensive understanding of their integration for efficient decision-making in dynamic environments. The paper begins by delineating the landscape of real-time data processing, emphasizing the significance of timely and accurate information in contemporary business scenarios. It delves into the challenges posed by the velocity and volume of data generated continuously, necessitating advanced processing mechanisms capable of handling data streams in real-time. As the focus shifts to machine learning algorithms, the research outlines the diverse range of algorithms suitable for real-time applications. From online learning methods to streaming algorithms, the exploration encompasses techniques tailored to adapt and evolve with incoming data. This section also addresses the trade-offs between accuracy and computational efficiency, crucial considerations in real-time processing environments. The core of the paper lies in the synthesis of real-time data processing and machine learning algorithms. It investigates how machine learning models can be seamlessly integrated into data processing pipelines to analyze and respond to streaming data instantaneously. Case studies and practical implementations exemplify instances where predictive analytics and anomaly detection algorithms contribute to real-time decision support. Ethical considerations and challenges related to the deployment of machine learning in real-time settings are also examined. The paper advocates for responsible and transparent use of algorithms, emphasizing the importance of mitigating biases and ensuring accountability in decision-making processes driven by machine learning insights. this research paper provides a roadmap for organizations seeking to harness the synergy between real-time data processing and machine learning. The insights gained from this exploration pave the way for advancements in adaptive decision-making systems, offering a competitive edge in industries where rapid response to evolving data is paramount.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55083/irjeas.2023.v11i04012"
    },
    {
        "id": 27029,
        "title": "Digital Twin-Based Job Shop Deviation Detection and Real-Time Scheduling",
        "authors": "Hongxia Cai, Xiaoyu Chen",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ihmsc58761.2023.00021"
    },
    {
        "id": 27030,
        "title": "Machine Learning Techniques for Real-Time Emotion Detection from Facial Expressions",
        "authors": "Akshita Sharma, Vriddhi Bajaj, Jatin Arora",
        "published": "2023-2-24",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/delcon57910.2023.10127369"
    },
    {
        "id": 27031,
        "title": "A Corpus-based Analysis of The Time Machine: From the Perspective of Literary Stylistics",
        "authors": "Hongming Fang",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "From a corpus stylistic perspective, this paper analyses H.G. Wells’ book The Time Machine at the level of punctuation and vocabulary, etc. By utilizing the Sketch Engine and AntConc software, this paper finds that the author excels at using a large number of content words to present information and makes extensive use of transitive conjunctions in the course of the narration in order to present information that is difficult for the readers to anticipate. Based on the above methods, the author creates a contextual atmosphere suitable for the construction of the scientific discourse, eventually achieving an efficient degree of language code transmission with readers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/ijllt.2023.6.2.2"
    },
    {
        "id": 27032,
        "title": "REAL-TIME DETECTION OF ANOMALOUS BEHAVIOR IN CCTV VIDEOS USING ADVANCED MACHINE LEARNING TECHNIQUES",
        "authors": "",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets40069"
    },
    {
        "id": 27033,
        "title": "FV 16 Current translational challenges in personalized therapeutic brain-stimulation with real-time EEG-synchronized TMS",
        "authors": "C. Zrenner",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.clinph.2023.02.017"
    },
    {
        "id": 27034,
        "title": "The position of machine translation in translation studies",
        "authors": "Omri Asscher",
        "published": "2023-6-9",
        "citations": 1,
        "abstract": "Abstract\nAttempts to define the concept of translation have historically both reflected and driven developments and\n\t\t\t\t\tdemarcations in the field. In light of the ubiquitous rise of machine translation (MT), the current article considers how\n\t\t\t\t\tdefinitional approaches to translation that preceded the MT era, and were formulated with human translation in mind, correspond\n\t\t\t\t\twith today’s MT. The article engages with two influential definitional strands in the discipline: a-priori prescriptive\n\t\t\t\t\tdefinitions, and descriptive definitions focused on the reception of translations. The general compatibility of both definitional\n\t\t\t\t\tapproaches with MT, notwithstanding some empirical and moral criticisms pertaining to the first approach, encourages us to\n\t\t\t\t\tconceive of MT as a full-fledged translational object of inquiry, fully at home in translation studies. Finally, the article\n\t\t\t\t\tsuggests that shifts in the professional status of human translators may lead to new definitions, aimed at differentiating human\n\t\t\t\t\tfrom machine translation by focusing on the notion of (conscious) agency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/ts.22035.ass"
    },
    {
        "id": 27035,
        "title": "Machine Translation with Large Language Models: Prompting, Few-shot Learning, and Fine-tuning with QLoRA",
        "authors": "Xuan Zhang, Navid Rajabi, Kevin Duh, Philipp Koehn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.43"
    },
    {
        "id": 27036,
        "title": "High-accuracy 3D locators tracking in real time using monocular vision",
        "authors": "C. Elmo Kulanesan, P. Vacher, L. Charleux, E. Roux",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00138-023-01498-9"
    },
    {
        "id": 27037,
        "title": "Dual Context Network for real-time semantic segmentation",
        "authors": "Hong Yin, Wenbin Xie, Jingjing Zhang, Yuanfa Zhang, Weixing Zhu, Jie Gao, Yan Shao, Yajun Li",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00138-023-01373-7"
    },
    {
        "id": 27038,
        "title": "Domain Terminology Integration into Machine Translation: Leveraging Large Language Models",
        "authors": "Yasmin Moslem, Gianfranco Romani, Mahdi Molaei, John D. Kelleher, Rejwanul Haque, Andy Way",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.82"
    },
    {
        "id": 27039,
        "title": "Real Time Map Matching for Low Frequency GPS Data Based on Machine Learning Technology",
        "authors": "Ornicha Sinthopvaragul, Veera Muangsin",
        "published": "2023-5-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbir57571.2023.10147651"
    },
    {
        "id": 27040,
        "title": "An unsupervised machine learning approach for real-time damage detection in bridges",
        "authors": "Imane Bayane, John Leander, Raid Karoumi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engstruct.2024.117971"
    },
    {
        "id": 27041,
        "title": "Machine Learning Techniques for Real-Time Chronic Kidney Disease Tracking",
        "authors": "Dr. P. Senthil Raja, Gokulraj P, Sarulatha D, Sriram K",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.025"
    },
    {
        "id": 27042,
        "title": "IoT-based Real-time Passenger Safety System with Machine  Vision at the Edge (Mez) Technology",
        "authors": "Ali Alawad",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15199/48.2023.12.28"
    },
    {
        "id": 27043,
        "title": "Real-Time Castor Leaf Disease Detection Using Machine Learning on Edge AI Device",
        "authors": "Dhaval Soni, Ruchi Gaiiar, Nagendra Gajjar",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ises58672.2023.00080"
    },
    {
        "id": 27044,
        "title": "Real-Time Phishing Attack Detection through Advanced Machine Learning Techniques",
        "authors": "Hemant Sharma, Praveen Sharma, Rakesh Singh",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10456013"
    },
    {
        "id": 27045,
        "title": "Real-Time Machine Learning-Based Driver Drowsiness Detection Using Visual Features",
        "authors": "Yaman Albadawi, Aneesa AlRedhaei, Maen Takruri",
        "published": "2023-4-29",
        "citations": 11,
        "abstract": "Drowsiness-related car accidents continue to have a significant effect on road safety. Many of these accidents can be eliminated by alerting the drivers once they start feeling drowsy. This work presents a non-invasive system for real-time driver drowsiness detection using visual features. These features are extracted from videos obtained from a camera installed on the dashboard. The proposed system uses facial landmarks and face mesh detectors to locate the regions of interest where mouth aspect ratio, eye aspect ratio, and head pose features are extracted and fed to three different classifiers: random forest, sequential neural network, and linear support vector machine classifiers. Evaluations of the proposed system over the National Tsing Hua University driver drowsiness detection dataset showed that it can successfully detect and alarm drowsy drivers with an accuracy up to 99%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jimaging9050091"
    },
    {
        "id": 27046,
        "title": "Automated Detection of Rig Events from Real-Time Surface Data Using Spectral Analysis and Machine Learning",
        "authors": "Timothy S. Robinson, Olav Revheim",
        "published": "2023-3-7",
        "citations": 4,
        "abstract": "AbstractThe authors present a method for automated, high-fidelity detection of rig events characterized by complex temporal signals, such as downlinking, or wave-induced heave affecting floating rigs. These can adversely impact other systems utilizing relevant data streams, for example downlinking via mud pulse telemetry can interfere with detection of pressure changes that might indicate hole cleaning problems. Identifying these events using classification techniques applied to time-domain data is difficult, hence spectral (frequency domain) techniques, combined with Machine Learning (ML), were applied to solving this problem. Surface measurements from a variety of wells, fields, regions, service companies and operators were used to develop and validate the detection methods. Data was preprocessed using time-frequency analysis, and then input to discriminative classifiers to identify rig events of interest.For downlinking state detection, high recall and precision scores (both &gt;93%) were achieved on independent holdout well data, and thus false positive rates were low. Successful detection was demonstrated on wells separate from the training data, hence the method is expected to generalize to new well operations. The detection method enhances situational awareness, and can actively support other software in improved automated decision-making by providing operational context in real-time, such as suppression of false warnings from monitoring pressure or modelled ECD for detecting signs of poor hole cleaning. These techniques are not limited to downlinking or heave detection, and can be applied more generally to scenarios with complex periodic signals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/212481-ms"
    },
    {
        "id": 27047,
        "title": "On the Concept of Translation Unit in a Machine Translation Framework",
        "authors": "Tatyana Maikova",
        "published": "2023-12",
        "citations": 0,
        "abstract": "\n The article looks at the question whether the concept of translation unit might apply to the sphere of machine translation and whether the size of the unit influences the quality of translation. While modern machine translation systems offer an acceptable level of quality, a number of problems mainly related to the structural organization of the text remain unresolved, hence the question posed in the paper. The article offers a review of modern readings of the concept and pays special attention to the question whether the scope of the term changes depending on whether the object of research is the target text or the translation process. The paper also provides a quick look on the research methods for both text-oriented and process-oriented approaches, such as comparative analysis of language pairs and Think Aloud Protocol. Based on a review of existing machine translation models, each of them is analyzed to answer the question whether a unit of translation can be defined for a given system and what its size is. It is concluded that a unit of translation can be viewed as either a unit of analysis or a unit of processing with respect to text-oriented and process-oriented perspectives on to the study of translation. The unit of translation has a dynamic character and influences the quality of the target text. In machine translation, the unit of translation as a unit of analysis is not applicable for systems based on probabilistic non-linguistic methods. For rule-based machine translation systems, both readings of the unit of translation concept are applicable, but hardly go beyond a single sentence. Accordingly, at least one type of translation problem – intra-textual relations resolutions – remains largely unaddressed in the present state of affairs in machine translation.\n\t",
        "keywords": "",
        "link": "http://dx.doi.org/10.25136/2409-8698.2023.12.69470"
    },
    {
        "id": 27048,
        "title": "Real-Time Human Body Sensors Data Classification using Supervised Machine Learning",
        "authors": "Muhammad Sajid Farooq, Muhammad Farhan Khan",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbats57792.2023.10111334"
    },
    {
        "id": 27049,
        "title": "Imitation Learning from Operator Experiences for a Real time CNC Machine Controller",
        "authors": "Hoa Thi Nguyen, Øystein Haugen, Roland Olsson",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indin51400.2023.10218164"
    },
    {
        "id": 27050,
        "title": "Real-time flood forecasting using satellite precipitation product and machine learning approach in Bagmati river basin, India",
        "authors": "Ajit Kumar, Vivekanand Singh",
        "published": "2024-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11600-024-01332-4"
    },
    {
        "id": 27051,
        "title": "Real time malware detection in encrypted network traffic using machine learning with time based features",
        "authors": "Abhay Pratap Singh, Mahendra Singh",
        "published": "2023",
        "citations": 1,
        "abstract": "With the increasing amount of Internet users, malware attacks are also growing. The purpose of malicious authors creating malware is to attack, damage, or impair electronic devices. In recent times, malware authors are also using HTTPs traffic; therefore, detecting malware in HTTPs traffic is intriguing since network traffic is enciphered. As the network traffic is enciphered, it is an arduous job to identify benign and malicious traffic. It also poses a significant challenge for firewalls and anti-malware software. Hence, it is essential to monitor the network traffic for detecting malware and threats in this way that maintains the encryption integrity. In this paper, a machine learning based model was proposed, which can effectively and efficiently detect malware without deciphering the network traffic. The prime objective of the research work is to apply several of ML techniques to detect malware in real-time utilizing time-based features. The proposed methodology can classify malware attacks in less than one second, achieving an accuracy of 99% on the Central Processing Unit (CPU) and Graphics Processing Unit (GPU) platform, which is sufficient for detecting malware in real-time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jdmsc-1760"
    },
    {
        "id": 27052,
        "title": "Systematic Review on Real-Time Students Behavior Monitoring using Machine Learning",
        "authors": "Akash S, Dinesh V, Muthamil Selvan S, R Srikanth",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134519"
    },
    {
        "id": 27053,
        "title": "Enhancing Power Grid Resilience through Real-Time Fault Detection and Remediation Using Advanced Hybrid Machine Learning Models",
        "authors": "Fahad M. Almasoudi",
        "published": "2023-5-21",
        "citations": 4,
        "abstract": "Ensuring a reliable and uninterrupted supply of electricity is crucial for sustaining modern and advanced societies. Traditionally, power systems analysis was mostly dependent on formal commercial software, mathematical models produced via a mix of data analysis, control theory, and statistical methods. As power grids continue to grow and the need for more efficient and sustainable energy systems arises, attention has shifted towards incorporating artificial intelligence (AI) into traditional power grid systems, making their upgrade imperative. AI-based prediction and forecasting techniques are now being utilized to improve power production, transmission, and distribution to industrial and residential consumers. This paradigm shift is driven by the development of new methods and technologies. These technologies enable faster and more accurate fault prediction and detection, leading to quicker and more effective fault removal. Therefore, incorporating AI in modern power grids is critical for ensuring their resilience, efficiency, and sustainability, ultimately contributing to a cleaner and greener energy future. This paper focuses on integrating artificial intelligence (AI) in modern power generation grids, particularly in the fourth industrial revolution (4IR) context. With the increasing complexity and demand for more efficient and reliable power systems, AI has emerged as a possible approach to solve these difficulties. For this purpose, real-time data are collected from the user side, and internal and external grid faults occurred during a time period of three years. Specifically, this research delves into using state-of-the-art machine learning hybrid models at end-user locations for fault prediction and detection in electricity grids. In this study, hybrid models with convolution neural networks (CNN) have been developed, such as CNN-RNN, CNN-GRU, and CNN-LSTM. These approaches are used to explore how these models can automatically identify and diagnose faults in real-time, leading to faster and more effective fault detection and removal with minimum losses. By leveraging AI technology, modern power grids can become more resilient, efficient, and sustainable, ultimately contributing to a cleaner and greener energy future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15108348"
    },
    {
        "id": 27054,
        "title": "Challenges in Rendering Arabic Text to English Using Machine Translation: A Systematic Literature Review",
        "authors": "Shahab Ahmad Almaaytah, Soleman Awad Alzobidy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3309642"
    },
    {
        "id": 27055,
        "title": "Investigating the Use of Bed-Time Stories and Moodle in EFL Classes: Attitudes, Benefits and Challenges",
        "authors": "BADR GLIOUINE, Said Zaidoune",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "This study scrutinizes the effectiveness and the feasibility of an EFL story-based textbook supported by a Moodle platform in Moroccan high schools. Along with the use of Moodle as the learning management system, this study uses a story-based approach in foreign language teaching/learning. Before designing this story-based textbook, the researcher investigated the Moroccan EFL context to be more practical and the textbook stands on a solid ground by having an added value not just being repetitive. Therefore, a quantitative study was conducted to collect up-to-date data and see (a) whether stories are already used or not in Moroccan EFL classes (b) the benefits and challenges, if any, stories can have according to these teachers (c) some of the most challenging obstacles behind not using stories in Moroccan EFL classrooms. To answer these questions, a questionnaire was administered to 100 EFL teachers from Casablanca. The data collected through the questionnaire revealed that most informants appreciated the use of stories in EFL classes. Additionally, most of them perceive the story-based approach as a useful tool to help students develop language skills. To conclude, these findings suggest that stories help in boosting students’ motivation, retention, and thus developing language proficiency. The findings also provided some solutions to teachers’ common challenges while using stories.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36892/ijlts.v5i2.412"
    },
    {
        "id": 27056,
        "title": "New Real Time Clinical Decision System Using Machine Learning – Disease Prediction",
        "authors": "K.Pushpa Rani, Ch. Sabitha, P. Sreedevi, A. Sangeetha",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128364"
    },
    {
        "id": 27057,
        "title": "Real-time Driver Drowsiness Detection and Assistance System using Machine Learning and IoT",
        "authors": "Pragathi Sudarshan, Vivek Bhardwaj,  Virender",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192831"
    },
    {
        "id": 27058,
        "title": "Real-Time UAV Trajectory Prediction for UTM Surveillance Using Machine Learning",
        "authors": "Neno Ruseno, Chung-Yan Lin",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": " The Unmanned Aerial System (UAS) Traffic Management (UTM) surveillance plays an important role in monitoring the safety compliance of UAV flights within specific operational zones. However, the quality of data reception from UAVs depends on transmission signal quality, leading to variable data latency during flights. As a means of addressing this issue and improving UAV operational safety, trajectory prediction emerges as a promising solution. This study aims to implement real-time trajectory prediction through the integration of machine learning techniques within the UTM surveillance system using Broadcast Remote ID. To facilitate this, a homemade receiver for broadcast Remote ID is developed using the ESP32 microcontroller. Subsequently, two distinctive flight tests are executed using a DJI Phantom 4 UAV. In the first flight, UAV trajectory data are used to serve as training input for the machine learning algorithms. The second flight focuses on the implementation of real-time trajectory prediction. The trajectory prediction model uses inputs such as latitude, longitude, height, speed, direction, latency time, and the Received Signal Strength Indicator (RSSI). Through an analysis of the first flight’s offline data, the Gated Recurrent Unit (GRU) algorithm is preferred to the Long Short-Term Memory (LSTM) algorithm. The outcomes of the second flight test prove the feasibility of the GRU-based trajectory prediction. The GRU model successfully produces real-time predictions during UAV flight, showcasing accuracy levels similar to those derived from offline prediction analyses with short processing time. This real-time trajectory prediction could improve the safety of UAV operation by providing the estimated position when the latency time is higher than the threshold. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s230138502550030x"
    },
    {
        "id": 27059,
        "title": "Real-Time Human Activity Classification Using Gait Cycle Averaging and Biometric Heuristics",
        "authors": "Grant Ellison, Milla Penelope Markovic, Delaram Yazdansepas",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00056"
    },
    {
        "id": 27060,
        "title": "\"Laboratory Use of Information Technology to Monitor Real-Time Challenges in the Pre-Analytical Phase\"",
        "authors": "Romulo Mendoza",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26717/bjstr.2024.55.008759"
    },
    {
        "id": 27061,
        "title": "Artificial Intelligence and smart cities through the looking glass: real-time application challenges",
        "authors": "Ruchi Tyagi, Suresh Vishwakarma, Alexey Stanislavovich Timoshchuk, Anurag Sharma",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2024.1023"
    },
    {
        "id": 27062,
        "title": "Correction to: Machine translation from signed to spoken languages: state of the art and challenges",
        "authors": "Mathieu De Coster, Dimitar Shterionov, Mieke Van Herreweghe, Joni Dambre",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10209-023-01085-9"
    },
    {
        "id": 27063,
        "title": "Theoretical challenges for a genetics of translation",
        "authors": "Anthony Cordingley",
        "published": "2024-1-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/14781700.2023.2173286"
    },
    {
        "id": 27064,
        "title": "Quick Back-Translation for Unsupervised Machine Translation",
        "authors": "Benjamin Brimacombe, Jiawei Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.571"
    },
    {
        "id": 27065,
        "title": "MACHINE TRANSLATION: A SURVEY.",
        "authors": "Ioan-Lucian Popa,  ",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59168/tbbg8666"
    },
    {
        "id": 27066,
        "title": "Punjabi-English Literary Translation: Challenges and Possibilities",
        "authors": "Kulveer Kaur",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Translation activity in modern Punjab predominantly flows ‘downstream’ from other languages into Punjabi, with comparatively little output of translated works from Punjabi into other languages. Despite this, the translation of Punjabi literature into English has created a valuable space for dialogue between languages and cultures. This article presents a synoptic view of the problems, principles, and possibilities involved in Punjabi-English literary translation. It explores different translation theories and approaches commonly used in Punjabi-English literary translation, highlighting critical studies available in both Punjabi and English.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46623/tt/2023.17.1.ar7"
    },
    {
        "id": 27067,
        "title": "Real-Time Detection of Sand Production Event by Application of Machine Learning Techniques",
        "authors": "E. Abilov, G. Rzayeva, S. Alkhasli, A. Pashayev, P. Allahverdiyev",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310994"
    },
    {
        "id": 27068,
        "title": "Real-Time Portfolio Management System Utilizing Machine Learning Techniques",
        "authors": "Prakash K. Aithal, M. Geetha, Dinesh U, Basri Savitha, Parthiv Menon",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3263260"
    },
    {
        "id": 27069,
        "title": "Machine learning framework for the real-time reconstruction of regional 4D ocean temperature fields from historical reanalysis data and real-time satellite and buoy surface measurements",
        "authors": "Bianca Champenois, Themistoklis Sapsis",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physd.2023.134026"
    },
    {
        "id": 27070,
        "title": "Yishu: Yishu at WMT2023 Translation Task",
        "authors": "Luo Min, Yixin Tan, Qiulin Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.11"
    },
    {
        "id": 27071,
        "title": "Machine Translation Advancements for Low-Resource Indian Languages in WMT23: CFILT-IITB’s Effort for Bridging the Gap",
        "authors": "Pranav Gaikwad, Meet Doshi, Sourabh Deoghare, Pushpak Bhattacharyya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.89"
    },
    {
        "id": 27072,
        "title": "Comparative study of machine translation versus human translation",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/langl.2024.070211"
    },
    {
        "id": 27073,
        "title": "Language-Family Adapters for Low-Resource Multilingual Neural Machine Translation",
        "authors": "Alexandra Chronopoulou, Dario Stojanovski, Alexander Fraser",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.loresmt-1.5"
    },
    {
        "id": 27074,
        "title": "Findings of the WMT 2023 Shared Task on Machine Translation with Terminologies",
        "authors": "Kirill Semenov, Vilém Zouhar, Tom Kocmi, Dongdong Zhang, Wangchunshu Zhou, Yuchen Eleanor Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.54"
    },
    {
        "id": 27075,
        "title": "PROMT Systems for WMT23 Shared General Translation Task",
        "authors": "Alexander Molchanov, Vladislav Kovalenko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.12"
    },
    {
        "id": 27076,
        "title": "A Real-Time Crowd Detection and Monitoring System using Machine Learning",
        "authors": "Pooja Shrivastav, Vakula Rani J",
        "published": "2023-1-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idciot56793.2023.10053517"
    },
    {
        "id": 27077,
        "title": "Subset Retrieval Nearest Neighbor Machine Translation",
        "authors": "Hiroyuki Deguchi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5715/jnlp.30.1245"
    },
    {
        "id": 27078,
        "title": "What are tenants demanding the most? A machine learning approach for the prediction of time on market",
        "authors": "Marcelo DEL Cajias, Anna Freudenreich",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15396/eres2023_35"
    },
    {
        "id": 27079,
        "title": "Real-Time Building Management System Visual Anomaly Detection Using Heat Points Motion Analysis Machine Learning Algorithm",
        "authors": "",
        "published": "2023-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17559/tv-20220417151954"
    },
    {
        "id": 27080,
        "title": "Intelligent Real-Time Image Processing Technology of Badminton Robot via Machine Vision and Internet of Things",
        "authors": "Bin Liu, Yingying Zheng",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3331815"
    },
    {
        "id": 27081,
        "title": "Machine Learning Algorithms for DoS and DDoS Cyberattacks Detection in Real-Time Environment",
        "authors": "Ethan Berei, M. Ajmal Khan, Ahmed Oun",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccnc51664.2024.10454755"
    },
    {
        "id": 27082,
        "title": "Embracing the Lag: Real-Time Challenges in Multi-Agent Systems",
        "authors": "Sarah Dumnich, William Birmingham, Britton Wolfe",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "In this paper, we discuss the interplay between distributed multi-agent systems and the concept of \"lag.\" We introduce a new representation of these systems to more clearly include time and the effects of latency. We also present real-world situations where communication delays can mean the difference between success and failure, between order and chaotic disarray.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaaiss.v2i1.27722"
    },
    {
        "id": 27083,
        "title": "Reducing the Cost of Cycle-Time Tuning for Real-World Policy Optimization",
        "authors": "Homayoon Farrahi, A. Rupam Mahmood",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191867"
    },
    {
        "id": 27084,
        "title": "Simulating real-time tweet sentiment analysis by different machine learning methods based on spark",
        "authors": "Ertong Wei",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "Sentiment analysis is essential since it benefits many fields, such as politics and economics. Because much data is generated every moment, a real-time processing system can efficiently analyze sentiment. This paper uses Spark to simulate real-time tweet sentiment analysis, and compares the performances of three machine learning methods, Logistic Regression, Naive Bayes, and Decision Tree. The idea of the real-time tweet sentiment analysis system is using Spark Streaming to send a batch of tweets every fixed period to a machine learning pipeline to predict the emotions of tweets. In the pipeline, tweets will be tokenized first, then the stop words in tweets will be removed. After that, the author uses TF-IDF to extract features, transferring data from unstructured to structured. The last stage is using the machine learning method to predict the sentiments of tweets. By comparing, Logistic Regression has the best performance, and the second one is Naive Bayes, Decision Tree performs not as well as the other two methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/18/20230402"
    },
    {
        "id": 27085,
        "title": "Real-time Welding Machine Status Recognition using Embedded Perceptron Color Classification Model",
        "authors": "Weihan Wang, Jinchao Xiao, Cheng Gao",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "This paper aims to utilize the perceptron model in machine learning to achieve precise classification of the working status of welding machines by analyzing image data. We collected static images of welding and non-welding operations, extracted the R, G, B color values of the images, and labeled them accordingly (+1 for welding status, -1 for idle status). By employing the stochastic gradient descent method for training the perceptron model, we obtained the weights w and bias b of the model under the condition that all data points in the training set are correctly classified. The model's recognition accuracy was validated on the test set. Ultimately, we applied this model to the STM32f103zet6 microcontroller chip and successfully achieved real-time recognition of the welding machine's operational status during the welding process via a camera. Through testing, the classification accuracy reached 83.6%. Further optimization of classification criteria can be combined with relevant expert suggestions, providing a reference solution for monitoring and identifying the working status of welding machines in steel pipe production.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/cxpgww31"
    },
    {
        "id": 27086,
        "title": "Keynote Lecture - Towards Efficient Real-Time Perception in Self-Driving Cars: Methods, Challenges and Open Questions",
        "authors": "Stefan Mathe",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccp60212.2023.10398639"
    },
    {
        "id": 27087,
        "title": "The best of translation: RNN-based machine translation and post-editing",
        "authors": "Xia He, Taiqian Chai, Xin Guan, Mengting Chen, Yuchen Kan",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/9789811269264_0031"
    },
    {
        "id": 27088,
        "title": "Improving Neural Machine Translation of Indigenous Languages with Multilingual Transfer Learning",
        "authors": "Wei-rui Chen, Muhammad Abdul-mageed",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.loresmt-1.6"
    },
    {
        "id": 27089,
        "title": "Optimizing Cloud Infrastructure for Real-time AI Processing: Challenges and Solutions",
        "authors": "Lavanya Shanmugam -, Kumaran Thirunavukkarasu -, Kapil Kumar Sharma -, Manish Tomar -",
        "published": "2024-3-10",
        "citations": 0,
        "abstract": "This research paper explores the optimization of cloud infrastructure for real-time artificial intelligence (AI) processing, addressing challenges, solutions, and implications from various perspectives. It discusses scalability issues, latency concerns, resource allocation, security considerations, and cost optimization challenges faced by organizations deploying AI workloads in the cloud. Case studies from diverse industries showcase the tangible benefits of implementing scalable architectures, edge computing integration, specialized hardware utilization, containerization, and data caching techniques. The paper also examines ethical and societal implications, including data privacy, bias, accountability, job displacement, and access disparities. An international perspective highlights regional variations in infrastructure availability, regulatory differences, cultural attitudes, collaboration efforts, and economic impacts. The discussion emphasizes the importance of addressing these challenges while harnessing the economic development opportunities offered by cloud infrastructure optimization for real-time AI processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i02.16092"
    },
    {
        "id": 27090,
        "title": "Real-Time Drone Detection and Tracking in Distorted Infrared Images",
        "authors": "Abdelouahid Bentamou, Abbass Zein-Eddine, Oussama Messai, Yann Gavet",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipc59416.2023.10328374"
    },
    {
        "id": 27091,
        "title": "Cost-Effective Approach for Data Integration on Tire Stacking Machine Through Real-Time Industrial Machine Monitoring System",
        "authors": "Enny Indasyah, Muhammad Ali Yafi, Rachmad Abdhael Ghofoer, Andi Frisiawan, Fivitria Istiqomah",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icamimia60881.2023.10427596"
    },
    {
        "id": 27092,
        "title": "Smart Education &amp; Healthcare: Deep learning‐based <scp>Cross‐Domain</scp> English data translation for <scp>Real‐Time</scp> Mobile healthcare",
        "authors": "Xinli Zhang",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "Internet technology and smart medical equipment have been rapidly developed and widely popularized. Telemedicine can improve the efficiency of patients' medical treatment and can facilitate patients to receive doctor's diagnosis and treatment, which saves medical resources and facilitate the monitoring of patients suffering from geriatric diseases and chronic diseases. In this work, we adopt the deep learning model to form a medical‐oriented English translation mechanism, based on which we can improve diagnostic efficiency and promote the development of smart telemedicine systems. We combine the recurrent neural network and attention mechanism to design an English translation model, which can solve the language barrier in the cross‐domain medical diagnosis process and improve the diagnosis efficiency. Specifically, first, we design a RNN translation model based on the encoder‐decoder structure. Second, we incorporate an attention mechanism into the designed translation model to improve the translation performance of the model. The experimental results show that the proposed mechanism is efficient.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/itl2.418"
    },
    {
        "id": 27093,
        "title": "Data analysis and machine learning-based modeling for real-time production",
        "authors": "S ChandraPrabha, S. Kantha Lakshmi",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "This article primarily focuses on data analysis and real time data modelling using linear regression and decision tree algorithm that might make revolutionary prediction on production data. Factual time data points include temperature, load, warning, on all the presented axis are the dependent parameters which be contingent on the changes in the autonomous paraments like load. Monitoring and innovative prediction is very much needed in industry as there are recurrent load changes that would create an data drift and in term of maintenance that could impact the production side as need of continues monitoring and control machine learning based approaches would work better on these real time production datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58414/scientifictemper.2023.14.2.22"
    },
    {
        "id": 27094,
        "title": "Research on lightweight real-time semantic segmentation based on attention mechanism",
        "authors": "Haojie Yu, Shijie Guan",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675290"
    },
    {
        "id": 27095,
        "title": "Investigation on the real-time blood pressure monitoring method based on Kalman filtering",
        "authors": "Zhang Lipeng, Xiang Shihai, Zhang Wei",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlcr61158.2023.00033"
    },
    {
        "id": 27096,
        "title": "Real-Time Stick-Slip Mitigation Using Combined Machine Learning and Physics Based Techniques",
        "authors": "Hana Yahia, Thomas Romary, Laurent Gerbaud, Stephane Menand, Mohamed Mahjoub",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract\nDownhole vibrations can lead to significant drilling problems in unconventional wells, such as frequent tool failures that increase drilling costs. Detecting these vibrations during drilling is crucial for enhancing drilling practices. One of the most destructive types of downhole vibrations is torsional stick-slip, characterized by fluctuations in bit rotation speed between zero and several times the surface rotation speed. Typically, surface data is used for real-time diagnosis of this drilling dysfunction. In recent years, Artificial Intelligence (AI)-based detection algorithms have increasingly been proposed in the literature. However, a key drawback of AI methods is their limited applicability to wells in the same field with similar geological formations and bottom-hole assemblies (BHAs). This paper aims to address this limitation and explore solutions for generalizing these approaches. It does so by employing transfer learning techniques and the inclusion of physics-based features. Using historical offset well data, this paper presents trained and tested machine learning models capable of predicting the stick-slip severity index (SSI) using sequences of surface measurements and physical features. This model can be deployed in real-time on drilling rigs to provide diagnostics and recommendations. In addition to that, the paper proposes a real-time auto-updated stability heatmaps, using the trained regression model and surface measurements while drilling, to help the drillers choose the optimal drilling parameters to avoid stick-slip vibrations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-24509-ms"
    },
    {
        "id": 27097,
        "title": "Retracted: Real-Time Image Defect Detection System of Cloth Digital Printing Machine",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9762392"
    },
    {
        "id": 27098,
        "title": "Real-Time Future Stock Price Prediction Using Machine Learning Algorithms",
        "authors": "Anagha Patil, Kedar Malap, Himadri Manna, Suraj Mahto, Yash Raut",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacta58201.2023.10392476"
    },
    {
        "id": 27099,
        "title": "Real-Time Ransomware Detection by Using eBPF and Natural Language Processing and Machine Learning",
        "authors": "Danyil Zhuravchak, Valerii Dudykevych",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aict61584.2023.10452697"
    },
    {
        "id": 27100,
        "title": "Real-Time Driver Drowsiness Detection and Classification on Embedded Systems Using Machine Learning Algorithms",
        "authors": "Muhammet Emin Sahin",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ts.400302"
    },
    {
        "id": 27101,
        "title": "Navigating the Challenges and Opportunities of Literary Translation in the Age of AI: Striking a Balance Between Human Expertise and Machine Power",
        "authors": "Milena Škobo, Vedran Petričević",
        "published": "2023-9-5",
        "citations": 2,
        "abstract": "This paper explores the evolving role of teachers and literary translators in the era of artificial intelligence and machine translation and addresses the challenges encountered in literary translation. It focuses on achieving a balance between human expertise and machine power to ensure faithful translations of literary works while preserving their inherent artistic value. The study analyses four translations of an excerpt from the short story “Lake Como” by Serbian writer Srđan Valjarević. These translations, from Serbian to English, were conducted in groups by third-year Anglistics students at the Faculty of Philology, Sinergija University in Bijeljina, whose native language is Serbian. The quality and accuracy of the translations were assessed, accompanied by detailed justifications of our preference judgments. A comparison was made between our assessments and those generated by Chat GPT-3, aiming to provide insights into the advancements made by AI in the realm of literary translation. This comprehensive evaluation of translations, encompassing both human translators and AI-powered language models (LLMs), offers a deeper understanding of the specific strengths and weaknesses exhibited by LLMs in the context of literary translation. Through this human evaluation process, we strive to shed light on the specific areas where LLM translators excel and identify the challenges they are still facing. The findings contribute to a deeper understanding of AI's impact on literary translation and pave the way for future research and advancements in this area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51558/2490-3647.2023.8.2.317"
    },
    {
        "id": 27102,
        "title": "Re-thinking Machine Translation Post-Editing Guidelines",
        "authors": "Celia Rico Pérez",
        "published": "2024-1-30",
        "citations": 1,
        "abstract": "Machine Translation Post-Editing (MTPE) is a challenging task. It frequently creates tension between what the industry expects in terms of quality and what translators are willing to deliver as an end product. Conventional approaches to MTPE take as a point of departure the distinction between light and full MPTE, but the division gets blurred when implemented in an actual MTPE project where translators find difficulties in differentiating between essential and preferential changes. At the time MTPE guidelines were designed, the role of the human translator in the MT process was perceived as ancillary, a view inherited from the first days of MT research aiming at the so-called Fully Automatic High Quality Machine Translation (FAHQMT). My proposal challenges the traditional division of MTPE levels and presents a new way of looking at MTPE guidelines. In view of the latest developments in neural machine translation and the higher quality level of its output, it is my contention that the traditional division of MTPE levels is no longer valid. In this contribution I advance a proposal for redefining MTPE guidelines in the framework of an ecosystem specifically designed for this purpose.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26034/cm.jostrans.2024.4696"
    },
    {
        "id": 27103,
        "title": "Research on Real-Time Monitoring Method of Physical Training Health Load Data Based on Machine Learning",
        "authors": "Xiaoran Yang, Weike Zhao",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s9.177-185"
    },
    {
        "id": 27104,
        "title": "Drone based Potholes detection using Machine Learning on various Edge AI devices in Real-Time",
        "authors": "Aniruddhsinh Parmar, Ruchi Gaiiar, Nagendra Gajjar",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ises58672.2023.00016"
    }
]