[
    {
        "id": 701,
        "title": "Initializing k-means Clustering",
        "authors": "Christian Borgelt, Olha Yarikova",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009872702600267"
    },
    {
        "id": 702,
        "title": "Multidimensional scaling and k-means clustering",
        "authors": "Daniel H. Baker",
        "published": "2022-3-21",
        "citations": 0,
        "abstract": "This chapter covers two multivariate statistical techniques called k-means clustering and multidimensional scaling (MDS). It shows how both methods can be used together as the algorithms involved are used to try to find the best solution without knowing any ground truth group or category labels. K-means clustering aims to partition multivariate data into several clusters, such that observations within a given cluster are more similar to each other than other cluster observations.The chapter further notes that the purpose of multidimensional scaling is to reduce complex multivariate data sets to a smaller number of dimensions to facilitate graphical representation. The chapter also discusses the multidimensional scaling in R.",
        "link": "http://dx.doi.org/10.1093/hesc/9780192896599.003.0013"
    },
    {
        "id": 703,
        "title": "K-means Clustering Algorithm for Myocardial Infarction Classification",
        "authors": "Husham Farouk Ismail Saied",
        "published": "2019",
        "citations": 0,
        "abstract": "Heart attack is one of the main causes of death around the world. The electrocardiogram (ECG) is considered as an effective method to diagnose heart diseases. In this study, the classification approach will be applied to distinguish between myocardial infarctions (MI) subtypes. The abnormalities approval depends on morphological analysis used to detect the appearance or absence of some specific features in ECG graph. The classification approach consists of many basic steps such as data segmentation and various kinds of noise removal. Stemming filter will be used for detection of some features through a large number of data. Features selection and normalization approaches will be used for data validation and significant clustering. Finally, the K-means clustering will be used to differentiate between MI subtypes. The statistical analyses such as Precision, Recall, and F-Score were used to evaluate the performance of the K-mean algorithm. The F-score achievement is indicated at 0.98% in significant clustering and with 87.61% in right classification of MI subtypes.",
        "link": "http://dx.doi.org/10.23880/aabsc-16000113"
    },
    {
        "id": 704,
        "title": "Perbandingan Algoritma C-Means Clustering dan Fuzzy C-Means Clustering",
        "authors": "Adhi Kusnadi, Abi Kabisah Maulillah",
        "published": "2019-8-30",
        "citations": 0,
        "abstract": "Salah satu operasi di dalam analisis citra adalah segmentasi citra. Pada mulanya proses segmentasi dilakukan untuk memisahkan objek dari latar belakangnya, sehingga segmentasi merupakan bagian penting dalam pengenalan objek. Saat ini segmentasi sudah mengalami perkembangan yang sangat pesat, bukan hanya untuk tujuan pengenalan objek saja tetapi juga untuk persoalan interpretasi citra, yaitu untuk mengetahui objek-objek yang termuat dalam suatu citra. Banyak algoritma sudah dikembangkan untuk proses segmentasi citra. Beberapa di antaranya adalah algoritma C-Means Clustering dan Fuzzy C-Means Clustering. Pada peneltian ini, dilakukan perbandingan antara algoritma C-Means Clustering dan Fuzzy C-Means Clustering dalam segmentasi citra. Dari beberapa hasil percobaan yang didapat dalam penelitian ini berupa sisi waktu atau kecepatan, ketelitian dan pengulangan, maka dapat disimpulkan algoritma Fuzzy C-Means Clustering adalah algoritma yang terbaik yang dapat digunakan dalam segmentasi citra karena dalam algoritma Fuzzy C-Means Clustering terdapat nilai keanggotaan atau fuzzy yang secara iteratif diperbaiki hingga mencapai keadaan konvergen.",
        "link": "http://dx.doi.org/10.31937/sk.v11i1.953"
    },
    {
        "id": 705,
        "title": "Artificial bee colony k-means clustering v1",
        "authors": "Huishuo Ge",
        "published": "No Date",
        "citations": 0,
        "abstract": " ",
        "link": "http://dx.doi.org/10.17504/protocols.io.ym4fu8w"
    },
    {
        "id": 706,
        "title": "Clustering LiDAR Data with K-means and DBSCAN",
        "authors": "Mafalda Oliveira, André Marcal",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011667000003411"
    },
    {
        "id": 707,
        "title": "Detection of Early Blight Tomato Leaf Using k-Means Clustering",
        "authors": "",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "Early blight is one of the major diseases of tomatoes that affects the leaves and fruit quality. Detection and estimation of the disease severity are performed using the visual observation method. Visual detection requires significant time for visual inspection of a large cultivated area. Thus, image processing techniques have proven to be an effective method as compared to visual analysis. In this study, digital image processing methods and techniques were used to detect early blight of tomato (EBT), estimate the disease severity, and classify tomato leaves. Totally, 198 infected plants were randomly taken from the Haramaya University research site \"Rare\" at four different times. Diseased potato leaf images were captured, resized, and stored for experimentation. The stored images were processed using median filtering to remove noise while preserving useful features in an image and image enhancement. The RGB images were transformed to gray scale and CIELAB color space, and the k-means clustering was applied to estimate the disease severity of the potato leaves, and Otsu’s thresholding algorithm was applied to estimate the disease severity of both the detached and live leaves. MATLAB algorithms will be developed to determine the total area and infected lesion area of the leaf samples.",
        "link": "http://dx.doi.org/10.33140/ijdmd.08.03.01"
    },
    {
        "id": 708,
        "title": "Survey Report on K-Means Clustering Algorithm",
        "authors": "",
        "published": "2017-5-4",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21884/ijmter.2017.4143.lgjzd"
    },
    {
        "id": 709,
        "title": "PENERAPAN SISTEM INTELIJENSIA BISNIS DAN K-MEANS CLUSTERING UNTUK MEMANTAU PRODUKSI TANAMAN OBAT",
        "authors": "",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24961/j.tek.ind.pert.2022.32.2.204"
    },
    {
        "id": 710,
        "title": "PENERAPAN TEXT MINING UNTUK MELAKUKAN CLUSTERING DATA TWEET AKUN BLIBLI PADA MEDIA SOSIAL TWITTER MENGGUNAKAN K-MEANS CLUSTERING",
        "authors": "Syiva Multi Fani, Rukun Santoso, Suparti Suparti",
        "published": "2021-12-31",
        "citations": 2,
        "abstract": "Social media is computer-based technology that facilitates the sharing of ideas, thoughts, and information through the building of virtual networks and communities. Twitter is one of the most popular social media in Indonesia which has 78 million users. Businesses rely heavily on Twitter for advertising. Businesses can use these types of tweet content as a means of advertising to Twitter users by Knowing the types of tweet content that are mostly retweeted by their followers . In this study, the application of Text Mining to perform clustering using the K-means clustering method with the best number of clusters obtained from the Silhouette Coefficient method on the @bliblidotcom Twitter tweet data to determine the types of tweet content that are mostly retweeted by @bliblidotcom followers. Tweets with the most retweets and favorites are discount offers and flash sales, so Blibli Indonesia could use this kind of tweet to conduct advertising on social media Twitter because the prize quiz tweets are liked by the @bliblidotcom Twitter account followers.",
        "link": "http://dx.doi.org/10.14710/j.gauss.v10i4.30409"
    },
    {
        "id": 711,
        "title": "Pengelompokkan Daerah Produksi Kelapa Sawit Menggunakan Algoritma K-Means Clustering",
        "authors": "Fina Nasari",
        "published": "2021-12-1",
        "citations": 0,
        "abstract": "Riau merupakan salah satu provinsi di Indonesia dengan luas area dan produksi kelapa tertinggi di Indonesia. Penyebaran perkebunan kelapa sawit di provinsi riau menyebar hamper merata diseluruh kabupatan/kota. Produksi kelapa sawit setiap daerah bervariasi, oleh karena itu perlu adanya pengclusteran daerah berdasarkan produksi kelapa sawit. Algoritma k-means clustering mampu mengelompokkan data yang sama dalam kelompok yang sama. Pengelompokkan data berdasarkan jarak kemasing-masing centroid. Tujuan penelitian ini adalah mengcluster daerah sesuai dengan jumlah produksi kelapa sawit yang ada di provinsi riau kedalam 2, 3, dan 5 cluster. Hasil dari penelitian ini algoritma k-means mampu mengelompokkan daerah berdasarkan produksi kelapa sawit dengan hasil cluster, jika data dikelompokkan menjadi 2 cluster terdapat 6 daerah masuk pada cluster 0 dan 6 daerah masuk pada cluster 1. Hasil pengelompokkan 3 cluster terdapat 5 daerah pada cluster 0, 4 daerah pada cluster 1 dan 3 daerah pada cluster 2. ",
        "link": "http://dx.doi.org/10.59061/jsit.v4i2.108"
    },
    {
        "id": 712,
        "title": "Quantum K-means Clustering and Classical k Means Clustering For Chest Pain Classification Using Qiskit",
        "authors": "Arvind Balakumar",
        "published": "2022-11-30",
        "citations": 0,
        "abstract": "Abstract: Quantum computing is an upcoming field of technology which has a broad scope of increasing the current technology in a robust manner. The application area Quantum computing is very huge which ranges from battery research, protein structure research to advance computing and security areas like cryptography, quantum internet, quantum machine learning and quantum cyber security. The quantum machine learning area seems to be the most interesting because of the computing capability of a real time quantum computer. With the quantum machine learning algorithm, classical algorithm, processing speed of current quantum computers and available data in modern world we could gain insights and find patterns which were previously not possible at all.",
        "link": "http://dx.doi.org/10.22214/ijraset.2022.47484"
    },
    {
        "id": 713,
        "title": "CLUSTERING ANALYSIS OF ADMISSION OF NEW STUDENTS USING K-MEANS CLUSTERING AND K-MEDOIDS ALGORITHMS TO INCREASE CAMPUS MARKETING POTENTIAL",
        "authors": "Hasan Amin",
        "published": "2023-8-29",
        "citations": 1,
        "abstract": "Acceptance of new students is a very important activity for a high school or university. The admissions data has not been utilized by the campus in making strategic decisions, marketing potential, and considering invitations through academic admissions. So, to assist in processing the new student admissions data, in this study the design and analysis of new student admissions data was carried out using stages in data mining. The clustering method approach can be applied in analyzing the potential level of PMB quality produced by utilizing the PMB recording dataset for the 2023 period. 86 data records. The K-Means and K-Medoids algorithm models that are applied have results that show a new insight, namely grouping based on 2 clusters, cluster 1 (C0) is a pass category while cluster 2 (C1) has not been determined. The results of the K-Medoids algorithm which has cluster 1 (C0) 60 results, cluster 2 (C1) has 26 results is a potential pass of 60 and has not yet been determined 26 of the data tested 86 while the results of the K-Means cluster 1 algorithm (C0) 40 , cluster 2 ( C1 ) 46 is a potential pass consisting of 40 and 46 undetermined data from the 86 datasets tested. Testing using the RapidMiner Studio application can also produce similar insights, namely each cluster has Davies Bouldin Index or DBI results from each K-Means and K-Medoids algorithm. K-Means has a Davies Bouldin Index result of -0.533 while K-Medoids has a Davies Bouldin Index result of -0.877",
        "link": "http://dx.doi.org/10.31253/te.v7i1.2264"
    },
    {
        "id": 714,
        "title": "ANALISIS CLUSTERING ZONASI RAWAN BENCANA PADA KANTOR BASARNAS PROV. JAMBI MENGGUNAKAN METODE K-MEANS",
        "authors": "Rike Limia Budiarti, Muh. Subur Rahayu",
        "published": "2022-11-30",
        "citations": 0,
        "abstract": "Indonesia is one of the countries that passes through the Pacific Ring of Fire or commonly called the Pacific Ring of Fire. The area is an area that often occurs natural disasters such as floods, droughts and hurricanes. The National SAR Agency (Basarnas), which is an Indonesian Non-Ministerial Government Institution that carries out tasks in the field of search and rescue (Search And Rescue / SAR). Natural disasters can occur suddenly or through a process that takes place slowly. In some types of disasters such as hurricanes, it is almost impossible to accurately predict when, where, and where they will occur. The shock occurred due to a lack of vigilance and preparedness in dealing with the threat of danger, resulting in many fatalities, injuries and material losses. For this reason, efforts are urgently needed to bring about the impact of disasters. In this study, the method used in grouping the data is K-Means clustering. The result of this research is the grouping of disaster-prone and non-disaster-prone areas which are represented in the Geographical Information System (GIS). Based on the grouping using K-Means Prov. Jambi is divided into 2 disaster groups with the characteristics of disaster-prone areas and non-disaster-prone areas. The 2 groups have validated their accuracy. Cluster 1 includes the city of Jambi, which has high rainfall and causes flooding, while cluster 2 includes Kerinci, Sarolagun, Batanghari, Muaro Jambi, East Tanjung Jabung, West Tanjung Jabung, Tebo, Bungo, Sungai Penuh City.",
        "link": "http://dx.doi.org/10.53564/akademika.v15i1.847"
    },
    {
        "id": 715,
        "title": "Object Detection System Using K-Means Clustering",
        "authors": "Shreenidhi S,  ",
        "published": "2021-7-16",
        "citations": 0,
        "abstract": "Object Detection is one of the most popular applications in the branch of computer vision. While accuracy has always been the focus, focus has  gradually also shifted to lightweight models. In this  paper we propose a light weight system where object classification is not required but only object detection using clustering methods.",
        "link": "http://dx.doi.org/10.47191/etj/v6i7.05"
    },
    {
        "id": 716,
        "title": "Questions clustering using canopy-K-means and hierarchical-K-means clustering",
        "authors": "Marwah Alian, Ghazi Al-Naymat",
        "published": "2022-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s41870-022-01012-w"
    },
    {
        "id": 717,
        "title": "Artificial bee colony k-means clustering v1",
        "authors": "Huishuo Ge, Xiaoyu Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": " ",
        "link": "http://dx.doi.org/10.17504/protocols.io.yqufvww"
    },
    {
        "id": 718,
        "title": "Imbalanced Data K-Means-Type Algorithm Multi-Prototype Clustering Two-Stages Clustering Ball Cluster",
        "authors": "shili zhong, Caifeng Chen, Qunfeng Liu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4761239"
    },
    {
        "id": 719,
        "title": "A Weighted K- Means clustering Algorithm for Clustering Big Data based on MapReduce",
        "authors": "Lakshmi Srinivasulu Dandug, Koneru Suvarna Vani",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nBig data has gained popularity as a means of storing, managing and processing large amounts of data. In the area of big data analysis, clustering datasets has become a difficult problem. MapReduce and its accessible version of Hadoop have gained appeal in both academia and businesses as the requirement for big data analytics in scientific applications and internet services continues to grow. Hadoop is a very practical approach for constructing big data analytics frameworks. Hadoop, on either side, has faults in a variety of areas, such as data resource management, scheduling policies and management to mention a few. When performing MapReduce jobs in Hadoop clusters, these issues frequently lead to excessive energy usage. This approach intends to introduce an innovative weighted k-means clustering algorithm based on intelligent Aquila weighting activity. To broaden the difference between clusters, the degree of connectivity among clusters is first stated in the clustering model. Additionally, Aquila optimization is used to select initial cluster centers, which eliminates the sensitivity of early cluster centers. This novel algorithm has high-speed performance with a perfect Map-Reduce function. For that, we use HDFS with the python platform. The proposed method allows any volume of data to be clustered, and there is no restriction on the number of data that may be clustered. The presented algorithm performs well and has a high degree of precision. This kind of novel method provides better accuracy for the clustering process and reduces the complexities presented in this clustering. The experimental outcomes show that the proposed method yields superior performances.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1710704/v1"
    },
    {
        "id": 720,
        "title": "DETEKSI PENYAKIT DIABETES DENGAN METODE FUZZY C-MEANS CLUSTERING DAN K-MEANS CLUSTERING",
        "authors": "Abdi Praja, Chairisni Lubis, Dyah Erny Herwindiati",
        "published": "2017-4-27",
        "citations": 3,
        "abstract": "Diabetes adalah penyakit yang terjadi ketika kandungan glukosa di dalam darah tinggi. Tes glukosa yang menghasilkan keakuratan tinggi harus dilakukan beberapa kali untuk mendeteksi diabetes di dalam tubuh. Beberapa indikator di dalam tubuh dapat menjadi titik awal untuk mendeteksi diabetes. Bagaimanapun juga, keterbatasan seorang tenaga medis dalam mendeteksi dalam jumlah data yang sangat besar dengan cara manual menjadi kendala. Salah satu solusi untuk gap tersebut adalah menggunakan komputer sebagai perhitungan matematika dalam metode pengelompokan K-Means dan Fuzzy C-Means. Pengelompokan terdiri dari kelompok diabetes dan non-diabetes. Pengujian untuk masing-masing metode dilakukan terhadap 9 data. Hasil pengujian terbaik metode K-Means adalah 73,438% dan untuk metode Fuzzy C-Means adalah 82,812%.",
        "link": "http://dx.doi.org/10.24912/computatio.v1i1.233"
    },
    {
        "id": 721,
        "title": "A CRITIQUE ON IMAGE SEGMENTATION USING K-MEANS CLUSTERING ALGORITHM",
        "authors": "",
        "published": "2017-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23883/ijrter.conf.20170331.002.evhj9"
    },
    {
        "id": 722,
        "title": "Artificial bee colony k-means clustering v1",
        "authors": "Huishuo Ge, Xiao-Yu Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": " ",
        "link": "http://dx.doi.org/10.17504/protocols.io.ypafvie"
    },
    {
        "id": 723,
        "title": "A comparative study of K-Means, K-Means++ and Fuzzy C-Means clustering algorithms",
        "authors": "Akanksha Kapoor, Abhishek Singhal",
        "published": "2017-2",
        "citations": 46,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ciact.2017.7977272"
    },
    {
        "id": 724,
        "title": "Skin Lesion Segmentation Using K-means Clustering with Removal Unwanted Regions",
        "authors": "Nechirvan Asaad ZEBARİ, Emin TENEKECİ",
        "published": "2022-12-31",
        "citations": 1,
        "abstract": "The segmentation of skin lesions is crucial to the early and accurate identification of skin cancer by computerized systems. It is difficult to automatically divide skin lesions in dermoscopic images because of challenges such as hairs, gel bubbles, ruler marks, fuzzy boundaries, and low contrast. We proposed an effective method based on K-means and a trainable machine learning system to segment regions of interest (ROI) in skin cancer images. The proposed method was implemented in several stages, including grayscale image conversion, contrast image enhancement, artifact removal with noise reduction, skin lesion segmentation from image using K-means clustering, and ROI segmentation from unwanted objects using a trainable machine learning system. The proposed model has been evaluated using the ISIC 2017 publicly available dataset. The proposed method obtained a 90.09 accuracy rate, outperforming several methods in the literature.",
        "link": "http://dx.doi.org/10.54365/adyumbd.1112260"
    },
    {
        "id": 725,
        "title": "A comparison between the fuzzy C-means clustering algorithm and the K-mean clustering algorithm",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.28919/eml/8403"
    },
    {
        "id": 726,
        "title": "Performance Analysis on K-Means and Fuzzy C-Means Clustering Algorithms Using CT-DICOM Images of Lung Cancer",
        "authors": "Dharmarajan A, Velmurugan T",
        "published": "2019-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v11/20192597"
    },
    {
        "id": 727,
        "title": "Fuzzy C-means Clustering for Landslide Mapping in Malang Regency",
        "authors": "Dhoriva Urwatul Wutsqa",
        "published": "2020-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12sp7/20202271"
    },
    {
        "id": 728,
        "title": "Brain Tumor Segmentation Using K-Means and Fuzzy C-Means Clustering and Its Area Calculation and Stage Using SVM Algorithm",
        "authors": "Divyata D. Pingale, S. R. Todmal",
        "published": "2018-5-1",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29070/15/56750"
    },
    {
        "id": 729,
        "title": "A Robust K-Means for Document Clustering",
        "authors": "Hengjun Yu, Kohei Inoue, Kenji Hara, Kiichi Urahama",
        "published": "2018-4-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12792/jiiae.6.60"
    },
    {
        "id": 730,
        "title": "Ink Mismatch Detection in Hyperpectral Image using K – means Clustering Algorithm",
        "authors": "Usman Zia",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In forensic analysis of any document, Ink mismatch detection provides a very important clue to see whether the document is corrupted or not. In hyperspectral imaging (HSI) ink mismatch detection is used to check whetherthe specific document is written with same pen/ink or different types of pens/inks have been used. In this paper, we show that aHSI of handwritten notes can differentiate between the ink sused to produce the document which are very similar in appearance. The HSI cube we have used for our research has 149 Bands. By using an unsupervised clustering algorithm, we have analyzed the spectral responses of the ink pixels to differentiate between the number of inks used in document. After the successful ink mismatch detection, we have used color labelling to classify the text written with different inks. This technique when applied to a RGB document, is not capable to differentiate between the number of inks used in the document. We hope that our findings and technique will help to examine HSI documents for forensic analysis. </p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.20104979"
    },
    {
        "id": 731,
        "title": "Active learning intrusion detection using k-means clustering selection",
        "authors": "Steven McElwee",
        "published": "2017-3",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/secon.2017.7925383"
    },
    {
        "id": 732,
        "title": "PERBANDINGAN HASIL PENGGEROMBOLAN K-MEANS, FUZZY K-MEANS, DAN TWO STEP CLUSTERING",
        "authors": "Lathifatur Rahmah",
        "published": "2017-4-19",
        "citations": 1,
        "abstract": "Analisis gerombol merupakan salah satu metode peubah ganda yang tujuan utamanya adalah mengelompokkan objek berdasarkan kemiripan atau ketidakmiripan karakteristik-karakteristiknya, sehingga objek yang terletak dalam satu gerombol memiliki kemiripan sifat yang lebih besar dibandingkan dengan objek pengamatan yang terletak pada gerombol lain. K-means merupakan salah satu metode penggerombolan tak berhirarki yang paling banyak digunakan, namun karena menggunakan rataan sebagai centroidnya, metode ini lebih sensitif terhadap keberadaan pencilan pada data. Sehingga berkembanglah metode baru, k-medoid, dengan berbasis median sebagai pusat gerombolnya. Penelitian ini bertujuan untuk membandingkan hasil analisis gerombol metode k-means dengan k-medoid baik pada saat data mengandung pencilan maupun tidak. Metode k-medoid diharapkan lebih kekar terhadap pencilan dibandingkan dengan k-means, sehingga dapat memberikan hasil gerombol yang lebih akurat dengan nilai tingkat salah klasifikasi yang lebih kecil. Hasil penggerombolan menunjukkan bahwa metode k-medoid mempunyai nilai rataan tingkat salah klasifikasi yang lebih rendah dan signifikan pada kondisi proporsi pencilan 5%, sedangkan pada kondisi proporsi pencilan 10% dan 15% hasil nilai rataan salah klasifikasinya tidak berbeda signifikan dengan metode k-means.",
        "link": "http://dx.doi.org/10.18592/jpm.v2i1.1166"
    },
    {
        "id": 733,
        "title": "Prescreening Bank Failures with K-Means Clustering: Pros and Cons",
        "authors": "Dror Parnes",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4647316"
    },
    {
        "id": 734,
        "title": "K-Means Clustering of Abalone Populations Using an Incomplete Dataset",
        "authors": "Michael Prendergast",
        "published": "No Date",
        "citations": 0,
        "abstract": "This report investigates the distribution of abalone data collected off of the coast of Tasmania, Australia in 1994. Analysis of this data is used to determine whether or not the dataset includes groups which are unusual and possibly indicative of the abalone population collapse that has occurred in Tasmania since the data was collected. As a side effect, some of the abalone population distribution data that was reportedly collected in (Nash, 1994) but neither published in (Nash, 1994) nor in the UCI data repository (Nash, 1995) has been reconstituted and made available in the appendix.",
        "link": "http://dx.doi.org/10.31224/osf.io/3gmbu"
    },
    {
        "id": 735,
        "title": "Ink Mismatch Detection in Hyperpectral Image using K – means Clustering Algorithm",
        "authors": "Usman Zia",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>In forensic analysis of any document, Ink mismatch detection provides a very important clue to see whether the document is corrupted or not. In hyperspectral imaging (HSI) ink mismatch detection is used to check whetherthe specific document is written with same pen/ink or different types of pens/inks have been used. In this paper, we show that aHSI of handwritten notes can differentiate between the ink sused to produce the document which are very similar in appearance. The HSI cube we have used for our research has 149 Bands. By using an unsupervised clustering algorithm, we have analyzed the spectral responses of the ink pixels to differentiate between the number of inks used in document. After the successful ink mismatch detection, we have used color labelling to classify the text written with different inks. This technique when applied to a RGB document, is not capable to differentiate between the number of inks used in the document. We hope that our findings and technique will help to examine HSI documents for forensic analysis. </p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.20104979.v1"
    },
    {
        "id": 736,
        "title": "Statistical Analysis of Clustering Performances of NMF, Spectral Clustering, and K-means",
        "authors": "Andri Mirzal",
        "published": "2020-10-13",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccis49240.2020.9257641"
    },
    {
        "id": 737,
        "title": "Penerapan Algoritma K-Means Clustering untuk Mengelompokkan Kecamatan di Kabupaten Grobogan Menurut Tingkat Kesejahteraan Keluarga Tahun 2020",
        "authors": "Asa Nugrahaini,  Rahmadi Yotenka",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Kesejahteraan keluarga adalah keadaan di mana kebutuhan dasar, sosial, dan perkembangan keluarga terpenuhi secara maksimal. Kabupaten Grobogan memiliki tingkat kesejahteraan keluarga yang berbeda-beda di setiap kecamatannya. Berbagai upaya dilakukan oleh pemerintah di Kabupaten Grobogan untuk mengatasi masalah-masalah yang berkaitan dengan kesejahteraan keluarga, mulai dari penyaluran bantuan dalam bentuk bantuan konsumtif hingga bantuan yang lebih produktif, namun seringkali terkendala masalah distribusi. Dengan menggunakan analisis k-means clustering, 19 kecamatan di Kabupaten Grobogan diklasifikasi dan ditentukan karakteristiknya guna membantu pemerintah dalam melaksanakan kebijakan yang berkaitan dengan masalah kesejahteraan keluarga di setiap kecamatan. Ada dua kelompok berbeda yang diidentifikasi dalam penelitian ini. Kecamatan pada kelompok 1 memiliki tingkat kesejahteraan keluarga yang tinggi untuk keluarga tahap I, II, III, dan III+. Sementara itu kelompok 2 memiliki tingkat kesejahteraan keluarga rendah untuk keluarga tahap I, II, III, dan III+.",
        "link": "http://dx.doi.org/10.20885/esds.vol1.iss.3.art36"
    },
    {
        "id": 738,
        "title": "PENERAPAN DATA MINING UNTUK MENENTUKAN PENJUALAN SPAREPART TOYOTA DENGAN METODE K-MEANS CLUSTERING",
        "authors": "Feryanto ., Felix Toknady Kesuma, Saut Parsaoran Tamba",
        "published": "2020-8-26",
        "citations": 1,
        "abstract": "Semakin berkembangnya persaingan dalam dunia bisnis khususnya dalam industri penjualan sparepart mobil dan jasa serivice menuntut para pengembang untuk menemukan suatu pola yang dapat meningkatkan penjualan dan pemasaran barang di perusahaan, salah satunya adalah dengan pemanfaatan data transaksi. CV Terang Jaya merupakan perusahaan yang begerak dalam bidang Otomotif yang melayani pembelian, penjualan sparepart mobil serta memberikan service untuk berbagai merek mobil. Namun demikian kurang dalam peninjauan produk-produk apa saja yang dibutuhkan konsumen dan penyimpanan data-data yang kurang efektif. Untuk mengatasi permasalahan tersebut analisis yang digunakan yaitu penerapan Clustering dengan menggunakan Algoritma K-Means. Clustering merupakan salah satu teknik dari salah satu fungsionalitas data mining, algoritma clustering merupakan algoritma pengelompokkan sejumlah data menjadi kelompok–kelompok data tertentu (cluster). Sehingga dengan adanya pengelompokan data ini pihak perusahaan dapat mengetahui barang paling laris, laris dan tidak laris. Sehingga barang yang ada digudang tidak menumpuk. Dari penitian ini output yang dihasilakan yaitu, barang paling laris sebanyak 15, barang yang laris sebanyak 45 dan kurang laris sebanyak 13. Dengan adanya pengolahan data yang dilakukan diharapkan dapat memberikan solusi kepada pihak perusahaan agar dapat mengetahui mana barang yang paling laris, laris dan mana barang yang tidak laris.",
        "link": "http://dx.doi.org/10.34012/jusikom.v2i2.376"
    },
    {
        "id": 739,
        "title": "PENENTUAN JURUSAN PADA SMKN 1 MUARO JAMBI  DENGAN METODE K-MEANS CLUSTERING",
        "authors": "Fattachul Huda Aminuddin, Teuku Djauhari, Arnol Arjansyah",
        "published": "2022-11-30",
        "citations": 0,
        "abstract": "This research is motivated by the lack of structure in determining the majors of class X students at SMKN 1 Muaro Jambi, because in the current majors they still use the manual system, namely written exams, this makes it difficult for students to determine majors according to their abilities. The problem in this study is how to apply data mining with the K-Means method in the application of student majors at SMKN 1 Muaro Jambi. How to design an application program for determining student majors at SMKN 1 Muaro Jambi using the K-Means method. This study uses the K-Means Clustering method to obtain majors that will make it easier for teachers or schools to determine student majors. K-means Clustering non-hierarchical method is a simple and effective algorithm to find groupings in the data in the majors process that is used is grade data and student data in the 2022/2023 entry year. The conclusion of this research is to produce a majors determination system using the K-Means Clustering method according to the majors criteria. Generating student majors from calculations using the K-means Clustering method.",
        "link": "http://dx.doi.org/10.53564/akademika.v15i1.846"
    },
    {
        "id": 740,
        "title": "K-means clustering based tone-mapping operator for high dynamic range video",
        "authors": "Negar Taherian",
        "published": "No Date",
        "citations": 0,
        "abstract": "The field of high dynamic range (HDR) imaging deals with capturing the luminance\nof a natural scene, usually varying between 10−3 to 105 cd/m2 and displaying it\non digital devices with much lower dynamic range. Here, we present a novel tone\nmapping algorithm that is based on K-means clustering. Our algorithm takes into\naccount the color information within a frame and using k-means clustering algorithm\nit builds clusters on the intensities within an image and shifts the values within each\ncluster to a displayable dynamic range. We also implement a scene change detection\nto reduce the running time of our algorithm by using the cluster information from\nthe previous frame for frames within the same scene. To reduce the flicker effect,\nwe proposed a new method that multiplies a leaky integer to the centroid values of\nour clustering results. Our algorithm runs in O( N logK + K logK ) for an image\nwith N input luminance levels and K output levels. We also show how to extend the\nmethod to handle video input. We display that our algorithm gives comparable results\nto state-of-the- art tone mapping algorithms. We test our algorithm on a number of\nstandard high dynamic range images and video sequences and provide qualitative and\nquantitative comparisons to a number of state-of-the-art tone mapping algorithms for\nvideos.",
        "link": "http://dx.doi.org/10.32920/ryerson.14647569.v1"
    },
    {
        "id": 741,
        "title": "Initializing K-Means Clustering Algorithm Based on Frequent Patterns",
        "authors": "Zahra Hashemi, Maryam Amiri",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4616032"
    },
    {
        "id": 742,
        "title": "Robust Rolling K-Means (R2K-Means): an Updateable Nonlinear K-Means Clustering Methodology for Financial Time Series",
        "authors": "Ryan Holmes, Ali Hirsa, Federico Klinkert, Satyan Malhotra",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4729393"
    },
    {
        "id": 743,
        "title": "Comparative Study of K-Means Clustering Algorithm  and K-Medoids Clustering in Student Data Clustering",
        "authors": " Qomariyah, Maria Ulfah Siregar",
        "published": "2022-5-25",
        "citations": 0,
        "abstract": "Universities as educational institutions have very large amounts of academic data which may not be used properly. The data needs to be analyzed to produce information that can map the distribution of students. Student academic data processing utilizes data mining processes using clustering techniques, K-Means and K-Medoids. This study aims to implement and analyze the comparison of which algorithm is more optimal based on the cluster validation test with the Davies Bouldin Index. The data used are academic data of UIN Sunan Kalijaga students in the 2013-2015 batch. In the k-Means process, the best number of clusters is 5 with a DBI value of 0.781. In the k-Medoids process, the best number of clusters is 3 with a DBI value of 0.929. Based on the value of the DBI validation test, the k-Means algorithm is more optimal than the k-Medoids. So that the cluster of students with the highest average GPA of 3,325 is 401 students.",
        "link": "http://dx.doi.org/10.14421/jiska.2022.7.2.91-99"
    },
    {
        "id": 744,
        "title": "K-means clustering based tone-mapping operator for high dynamic range video",
        "authors": "Negar Taherian",
        "published": "No Date",
        "citations": 0,
        "abstract": "The field of high dynamic range (HDR) imaging deals with capturing the luminance\nof a natural scene, usually varying between 10−3 to 105 cd/m2 and displaying it\non digital devices with much lower dynamic range. Here, we present a novel tone\nmapping algorithm that is based on K-means clustering. Our algorithm takes into\naccount the color information within a frame and using k-means clustering algorithm\nit builds clusters on the intensities within an image and shifts the values within each\ncluster to a displayable dynamic range. We also implement a scene change detection\nto reduce the running time of our algorithm by using the cluster information from\nthe previous frame for frames within the same scene. To reduce the flicker effect,\nwe proposed a new method that multiplies a leaky integer to the centroid values of\nour clustering results. Our algorithm runs in O( N logK + K logK ) for an image\nwith N input luminance levels and K output levels. We also show how to extend the\nmethod to handle video input. We display that our algorithm gives comparable results\nto state-of-the- art tone mapping algorithms. We test our algorithm on a number of\nstandard high dynamic range images and video sequences and provide qualitative and\nquantitative comparisons to a number of state-of-the-art tone mapping algorithms for\nvideos.",
        "link": "http://dx.doi.org/10.32920/ryerson.14647569"
    },
    {
        "id": 745,
        "title": "K-means Clustering Algorithm: Efficient Implementation on Graphics Processing Units",
        "authors": "Kunjan Aggarwal, Mainak Chaudhuri",
        "published": "No Date",
        "citations": 0,
        "abstract": "Data analysis and classification play a big role in understanding various real life phenomena. Clustering helps analyze data with little or no prior knowledge about it. K-means clustering is a popular clustering algorithm with applications to computer vision, data mining, data visualization, etc.. Due to continuously increasing data volume, parallel computing is necessary to overcome the computational challenges involved in K-means clustering. We present the design and implementation of Kmeans clustering algorithm on widely available graphics processing units (GPUs), which have the required hardware architecture to meet these parallelism needs. We analyze the scalability of our proposed methods with increase in number and dimensionality of data points as well as the number of clusters. We also compare our results with current best available implementations on GPUs and a 24-way threaded parallel CPU implementation. We achieved a consistent speedup of 6.5x over the parallel CPU implementation.",
        "link": "http://dx.doi.org/10.14293/s2199-1006.1.sor-.pplhu62.v1"
    },
    {
        "id": 746,
        "title": "ALGORITMA K-MEANS CLUSTERING UNTUK ANALISA DATA SERVICE BERDASARKAN PENGADUAN PELANGGAN",
        "authors": " zulhendra",
        "published": "No Date",
        "citations": 0,
        "abstract": "Dalam penelitian menggunakan data mining yaitu K-means clustering. Data mining dapat digunakan dalam mencari sebuah analisa data yang cukup besar yang bertujuan agar indo computer mengetahui dan mengelompokkan data service berdasarkan keluahan pelanggan menggunakan software weka",
        "link": "http://dx.doi.org/10.31227/osf.io/5byfp"
    },
    {
        "id": 747,
        "title": "Capturing EEG Spectral Microstates Through K Means Clustering",
        "authors": "Julio Rodriguez Larios",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this report, I propose an analytical approach based on k means clustering to identify functionally relevant  spectral microstates in EEG data. As a proof of principle, the analysis is applied to an EEG data set in which participants performed a continuous arithmetic task.  In order to assess the functional relevance of the identified ‘spectral microstates’, their occurrence are compared to inter-individual differences in arithmetic task performance.",
        "link": "http://dx.doi.org/10.31219/osf.io/uqykr"
    },
    {
        "id": 748,
        "title": "Comparison of clustering in tuberculosis using fuzzy c-means and k-means methods",
        "authors": "",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.28919/cmbn/7335"
    },
    {
        "id": 749,
        "title": "Clustering Data Persediaan Barang Dengan Menggunakan Metode K-Means",
        "authors": "Dadan Ramdhan, Gifthera Dwilestari, Raditya Danar Dana, Abdul Ajiz, Kaslani Kaslani",
        "published": "2022-5-31",
        "citations": 0,
        "abstract": "UD. Anugerah Sukses Mandiri merupakan perusahaan yang bergerak dibidang distribusi food dan non food. Transaksi barang yang berjalan terus meningkat, sehingga perusahaan mengalami permasalahan dalam menentukan jumlah persediaan barang, dikarenakan jumlah permintaan barang yang dibutuhkan selalu berubah setiap waktu. Persediaan barang merupakan suatu aktivitas lancar yang meliputi barang-barang milik perusahaan dengan maksud dijual kembali pada suatu periode usaha normal. Data mining merupakan proses yang menggunakan teknik statistik, matematika, kecerdasan buatan dan machine learning untuk mengekstraksi dan mengidentifikasi informasi yang terkait dari berbagai warehouse. Tujuan penelitian ini dengan memanfaatkan data mining yaitu untuk melakukan pengelompokan barang dan meningkatkan akurasi klasterisasi data persediaan barang dengan menggunakan metode K-Means Clustering. Dengan metode K-Means ini dapat mempartisi data ke dalam kelompok sehingga data berkarakteristik sama akan dimasukan ke dalam satu kelompok yang sama dan data yang berkarakteristik berbeda dikelompokan kedalam kelompok yang lain, karena metode ini menggunakan centroid (rata-rata) sebagai model dari cluster. Hasil penelitian yang didapat berupa pengelompokan data menjadi 2 kluster yaitu data dengan kluster terendah/sedikit dan kluster tertinggi/terbanyak. Sehingga mendapatkan kesimpulan bahwa clustering persediaan barang dengan menggunakan metode K-Means ini cukup baik dari sisi nilai average within distance dan kompleksitas waktu.\r\nKeyword : Data Mining, K-Means Clustering, Persediaan barang",
        "link": "http://dx.doi.org/10.54367/means.v7i1.1826"
    },
    {
        "id": 750,
        "title": "A Spatial-Temporal Clustering for Low Ocean Renewable Energy Resources Using K-Means Clustering",
        "authors": "Mat Nizam Uti, Ami Hassan Md Din, Norhakim Yusof, Omar Yaakob",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4446224"
    },
    {
        "id": 751,
        "title": "Clustering System Group Customers through Fuzzy C-Means Clustering",
        "authors": "Yaser Hasanpour, Shima Nemati, Reza Tavoli",
        "published": "2018-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspis.2018.8700548"
    },
    {
        "id": 752,
        "title": "Initial clustering center optimization and feature auto-weighting for k-Means clustering algorithm",
        "authors": "Furui Zhao",
        "published": "2022-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlise57402.2022.00036"
    },
    {
        "id": 753,
        "title": "Analysis of Centroid Cluster in X-Means Clustering in Data Classification: Power Absorb Oxygen",
        "authors": "Sardo Pardingotan Sipayung, Poltak Sihombing, . Sutarman",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008547601350137"
    },
    {
        "id": 754,
        "title": "Research on Logistics Warehouse Planning  Based on K-Means Algorithm Clustering Analysis",
        "authors": "Hongwei Li, Linbo Su, Faming Da, Lei Qin",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012034400003620"
    },
    {
        "id": 755,
        "title": "PCMeans: Community Detection using LocalPagerank, Clustering, and K-Means",
        "authors": "Wafa Louafi, Faiza Titouna",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nWith the rise of social networks, the task of community detection in networks has become increasingly difficult in recent years. In this study, weintroduce a novel approach, named PCMeans, which combines PageRank, hierarchical clustering, and K-means algorithms to tackle this issue.Our technique employs local PageRank to identify the most influential nodes, followed by a hierarchical clustering strategy that determinesthe optimal number of clusters, and ultimately applies K-means learning to swiftly converge to the final community structure. PCMeansis an unsupervised method that is easy to implement, efficient, andsimple, and it addresses three common problems, including the random selection of the initial central node, specification of the number ofclasses K, and slow convergence. Our experimental findings show thatPCMeans can efficiently identify communities and outperforms otherrecent approaches on both real networks and synthetic benchmarks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2736262/v1"
    },
    {
        "id": 756,
        "title": "An Ameliorate Technique for Brain Lumps Detection Using Fuzzy C-Means Clustering",
        "authors": "",
        "published": "2017-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21884/ijmter.2017.4022.cxozm"
    },
    {
        "id": 757,
        "title": "k-Means Clustering",
        "authors": "Chuck Easttom",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003230588-15"
    },
    {
        "id": 758,
        "title": "The application of K-means clustering and fuzzy C-means clustering analysis for modeling the spread of second wave coronavirus disease in Indonesia",
        "authors": "Ulfasari Rafflesia, Dedi Rosadi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0137755"
    },
    {
        "id": 759,
        "title": "A k-Means Algorithm for Clustering with Soft Must-link and Cannot-link Constraints",
        "authors": "Philipp Baumann, Dorit Hochbaum",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010800000003122"
    },
    {
        "id": 760,
        "title": "Transformed K-means Clustering",
        "authors": "Anurag Goel, Angshul Majumdar",
        "published": "2021-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco54536.2021.9616177"
    },
    {
        "id": 761,
        "title": "Clustering Using the k-Means Algorithm",
        "authors": "Xiuping Jia",
        "published": "2022-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2625662.ch37"
    },
    {
        "id": 762,
        "title": "Development of Innovative K-Means Clustering Application for College Entrepreneurship Education",
        "authors": "Wenqiu Zhai",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe traditional approach to talent development in education and workforce preparation is no longer sufficient to meet the dynamic demands of today's society and economic landscape. Modern policies aimed at promoting innovation-driven development require individuals to exhibit significant ingenuity and initiative. A growing concern shared by all sectors of society revolves around the status of student innovation and entrepreneurship (IAE) education, particularly within the context of the workplace. The unceasing pressures of economic growth have laid bare the inadequacies of the conventional talent cultivation model. It is now evident that relying solely on traditional educational methods cannot adequately equip students with the skills and mindset necessary to excel in an economy driven by innovation. In China, the domain of IAE education within universities is still in its early stages, but it is steadily advancing in both research and implementation. The recognition of the urgent need to adapt education to the demands of the 21st-century economy has sparked a surge in efforts to enhance IAE curricula. A noteworthy step in this direction is the innovative utilization of K-Means clustering (KMC) in college entrepreneurship instruction. This approach provides distinct advantages by clarifying the terminology associated with the evolving field of entrepreneurship and educational theory. It enables a deeper comprehension of concepts like entrepreneurship and the pursuit of change, which are essential in nurturing innovative mindsets and initiatives among students.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3551602/v1"
    },
    {
        "id": 763,
        "title": "Fraud Detection: A Study of AdaBoost Classifier and K-Means Clustering",
        "authors": "Anwesha Mishra",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFraud is a problem which can affect the economy greatly. Billions of dollars are lost because of fraud cases. These problems can occur through credit cards, insurance and bank accounts. Currently there have been many studies for preventing fraud. Machine learning techniques have helped in analysing fraud detection. These include many supervised and unsupervised models. Neural networks can be used for fraud detection. The dataset for the present work was collected from a research collaboration between Worldline and the Machine Learning Group of Université Libre de Bruxelles on the topic of big data mining and fraud detection. It consists of the time and amount of various transactions of European card holders during the month of September in 2013. This paper gives an analysis of the past and the present models used for fraud detection and presents a study of using K-Means Clustering and AdaBoost Classifier by comparing their accuracies.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-247874/v1"
    },
    {
        "id": 764,
        "title": "Perbandingan Algoritma K-Means dan Fuzzy C-Means Untuk Clustering Puskesmas Berdasarkan Gizi Balita Surabaya",
        "authors": "Alvin Kurnia",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "Lingkungan yang berpenyakit dan rendahnya kesadaran masyarakat akan kebersihan lingkungan di beberapa kota di Indonesia membuat banyak orang terutama anak kecil rentan terhadap berbagai penyakit. Pada 63 Puskesmas yang ada di Kota Surabaya telah menimbang 148720 balita. Terdapat 4,2% balita dengan gizi kurang, 0,1% balita gizi buruk dan 4,5% balita gizi stunting. Clustering adalah suatu teknik dalam data mining yang bertujuan untuk mengelompokkan objek (data) ke dalam beberapa cluster atau kelompok sehingga objek yang serupa disatukan ke dalam cluster yang sama.  metode ini adalah untuk melakukan penerapan, pengujian, serta evaluasi terhadap algoritma K-Means dan Fuzzy C-Means dalam melakukan clustering. sehingga hasil dari penelitian ini adalah untuk mengelompokkan Puskesmas berdasarkan gizi balita yang ada di Kota Surabaya. Hasil terbaik silhouette coefficient dari K-Means dengan proses Normalization adalah 0.51833215835383. Sedangkan hasil terbaik pada algoritma Fuzzy C-Means dengan proses Normalization adalah 0.49666983222478. Sehingga dapat disimpulkan bahwa pada clustering Puskesmas berdasarkan gizi balita Kota Surabaya algoritma K-Means lebih baik.",
        "link": "http://dx.doi.org/10.33998/processor.2023.18.1.696"
    },
    {
        "id": 765,
        "title": "Big Data Clustering Using Improvised Fuzzy C-Means Clustering",
        "authors": "Venkat Rayala, Satyanarayan Reddy Kalli",
        "published": "2020-12-31",
        "citations": 8,
        "abstract": "Clustering emerged as powerful mechanism to analyze the massive data generated by modern applications; the main aim of it is to categorize the data into clusters where objects are grouped into the particular category. However, there are various challenges while clustering the big data recently. Deep Learning has been powerful paradigm for big data analysis, this requires huge number of samples for training the model, which is time consuming and expensive. This can be avoided though fuzzy approach. In this research work, we design and develop an Improvised Fuzzy C-Means (IFCM)which comprises the encoder decoder Convolutional Neural Network (CNN) model and Fuzzy C-means (FCM) technique to enhance the clustering mechanism. Encoder decoder based CNN is used for learning feature and faster computation. In general, FCM, we introduce a function which measure the distance between the cluster center and instance which helps in achieving the better clustering and later we introduce Optimized Encoder Decoder (OED) CNN model for improvising the performance and for faster computation. Further in order to evaluate the proposed mechanism, three distinctive data types namely Modified National Institute of Standards and Technology (MNIST), fashion MNIST and United States Postal Service (USPS) are used, also evaluation is carried out by considering the performance metric like Accuracy, Adjusted Rand Index (ARI) and Normalized Mutual Information (NMI). Moreover, comparative analysis is carried out on each dataset and comparative analysis shows that IFCM outperforms the existing model.",
        "link": "http://dx.doi.org/10.18280/ria.340604"
    },
    {
        "id": 766,
        "title": "Statistical Analysis of Clustering Performances of NMF, Spectral Clustering, and K-means: With Gene Selection",
        "authors": "Andri Mirzal",
        "published": "2020-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccis49240.2020.9257702"
    },
    {
        "id": 767,
        "title": "Incorporating Local Data and KL Membership Divergence into Hard C-Means Clustering for Fuzzy and Noise-Robust Data Segmentation",
        "authors": "Reda R. Gharieb",
        "published": "2018-8-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.74514"
    },
    {
        "id": 768,
        "title": "Improvement of k-Means Clustering Performance on Disease  Clustering using Gaussian Mixture Model",
        "authors": "",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33168/jsms.2023.0511"
    },
    {
        "id": 769,
        "title": "Staged text clustering algorithm based on K-means and hierarchical agglomeration clustering",
        "authors": "Youjin Rong, Yi'an Liu",
        "published": "2020-6",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaica50127.2020.9182394"
    },
    {
        "id": 770,
        "title": "Comparison of Hierarchical Clustering, K-Means, K-Medoids, and Fuzzy C-Means Methods in Grouping Provinces in Indonesia according to the Special Index for Handling Stunting",
        "authors": "Ghina Rofifa Suraya, Arie Wahyu Wijayanto",
        "published": "2022-8-31",
        "citations": 2,
        "abstract": "Stunting has been widely known as the highest case of malnutrition suffered by toddlers in the world and has a bad impact on children's future. In 2018, Indonesia was ranked the 31st highest stunting in the world and ranked 4th in Southeast Asia. About 30.8% (roughly 3 out of 10) of children under 5 years suffer from stunting in Indonesia. To support the government policy making in handling stunting, it is undoubtedly necessary to classify the levels of stunting handling in regions in Indonesia. In this work, the hierarchical agglomerative and non-hierarchical clustering is compared and evaluated to perform clustering on stunting data. The agglomerative hierarchical cluster uses Single Linkage, Average Linkage, Complete Linkage, and Ward Method, while the non-hierarchical cluster uses K-Means, K-Medoids (PAM) Clustering, and Fuzzy C-Means. This study uses data from 12 IKPS indicators in 34 provinces in Indonesia in 2018. Based on the results of the evaluation using the Connectivity Coefficient, Dunn Index, Silhouette Coefficient, Davies Bouldin Index, Xie & Beni Index, and Calinski-Harabasz Index, the results show that the Average Linkage is the best cluster method with the optimal number of clusters is four clusters. The first cluster is a cluster with a good level of stunting management which consists of 28 provinces. The second cluster consists of only one province, DI Yogyakarta with a very good level of stunting handling. The third cluster consists of four provinces with poor stunting handling rates. Finally, the last cluster consisting of one province, Papua, has a very poor level of stunting handling.",
        "link": "http://dx.doi.org/10.29244/ijsa.v6i2p180-201"
    },
    {
        "id": 771,
        "title": "k-means and fuzzy c-means fusion for object clustering",
        "authors": "Ashraf Heni, Imen Jdey, Hela Ltifi",
        "published": "2022-5-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/codit55151.2022.9804078"
    },
    {
        "id": 772,
        "title": "K-Means Cloning: Adaptive Spherical K-Means Clustering",
        "authors": "Abdel-Rahman Hedar, Abdel-Monem Ibrahim, Alaa Abdel-Hakim, Adel Sewisy",
        "published": "2018-10-6",
        "citations": 7,
        "abstract": "We propose a novel method for adaptive K-means clustering. The proposed method overcomes the problems of the traditional K-means algorithm. Specifically, the proposed method does not require prior knowledge of the number of clusters. Additionally, the initial identification of the cluster elements has no negative impact on the final generated clusters. Inspired by cell cloning in microorganism cultures, each added data sample causes the existing cluster ‘colonies’ to evaluate, with the other clusters, various merging or splitting actions in order for reaching the optimum cluster set. The proposed algorithm is adequate for clustering data in isolated or overlapped compact spherical clusters. Experimental results support the effectiveness of this clustering algorithm.",
        "link": "http://dx.doi.org/10.3390/a11100151"
    },
    {
        "id": 773,
        "title": "K-means-G*: Accelerating k-means clustering algorithm utilizing primitive geometric concepts",
        "authors": "Hassan Ismkhan, Mohammad Izadi",
        "published": "2022-12",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ins.2022.11.001"
    },
    {
        "id": 774,
        "title": "CLUSTERING OF EARTHQUAKE RISK IN INDONESIA USING K-MEDOIDS AND K-MEANS ALGORITHMS",
        "authors": "Isna Hidayatur Rifa, Hasih Pratiwi, Respatiwulan Respatiwulan",
        "published": "2020-12-28",
        "citations": 7,
        "abstract": "Earthquake is the shaking of the earth's surface due to the shift in the earth's plates. This disaster often happens in Indonesia due to the location of the country on the three largest plates in the world and nine small others which meet at an area to form a complex plate arrangement. An earthquake has several impacts which depend on the magnitude and depth. This research was, therefore, conducted to classify earthquake data in Indonesia based on the magnitudes and depths using one of the data mining techniques which is known as clustering through the application of k-medoids and k-means algorithms. However, k-medoids group data into clusters with medoid as the centroid and it involves using clustering large application (CLARA) algorithm while k-means divide data into k clusters where each object belongs to the cluster with the closest average. The results showed the best clustering for earthquake data in Indonesia based on magnitude and depth is the CLARA algorithm and five clusters were found to have total members of 2231, 1359, 914, 2392, and 199 objects for cluster 1 to cluster 5 respectively.",
        "link": "http://dx.doi.org/10.14710/medstat.13.2.194-205"
    },
    {
        "id": 775,
        "title": "An Optimized K-means Algorithm for Text Clustering",
        "authors": "Jiani Zhao",
        "published": "2021-7-10",
        "citations": 0,
        "abstract": "In the process of data mining, the two major problems confronted by K-means clustering analysis are the determination of the initial cluster center and the valuing of k. The traditional K-means algorithm has obvious subjectivity in the above-mentioned two aspects, which will directly affect the clustering effect. In this paper, an analysis method combining relational matrix and degree centrality is proposed to determine the initial center point and the k value of K-means algorithm. The improved K-means algorithm is applied to the clustering analysis of the Chinese entrepreneurial policy text collection, and the clustered topic effects are visually displayed through the word cloud graphs. This empirical analysis not only verifies its effectiveness and objectivity for the improved algorithm in processing large clusters of long text document clusters with random unknown number of categories and category topics, but also provides an approach for the objective classification of Chinese entrepreneurial policy text collections in the meanwhile.",
        "link": "http://dx.doi.org/10.17762/converter.85"
    },
    {
        "id": 776,
        "title": "K-means Clustering",
        "authors": "Brad Boehmke, Brandon Greenwell",
        "published": "2019-11-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367816377-20"
    },
    {
        "id": 777,
        "title": "Improving Free Text Recommendation Time by Means of Clustering Algorithms",
        "authors": "Israel Mendonca Dos Santos, Antoine Trouve, Kazuaki Murakami, Akira Fukuda",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12792/icisip2018.026"
    },
    {
        "id": 778,
        "title": "Kernel K-Means Clustering untuk Pengelompokan Sungai di Kota Semarang Berdasarkan Faktor Pencemaran Air",
        "authors": "Anestasya Nur Azizah, Tatik Widiharih, Arief Rachman Hakim",
        "published": "2022-8-28",
        "citations": 0,
        "abstract": "K-Means Clustering is one of the types of non-hierarchical cluster analysis which is frequently used, but has a weakness in processing data with non-linearly separable (do not have clear boundaries) characteristic and overlapping cluster, that is when visually the results of a cluster are between other clusters. The Gaussian Kernel Function in Kernel K-Means Clustering can be used to solve data with non-linearly separable characteristic and overlapping cluster. The difference between Kernel K-Means Clustering and K-Means lies on the input data that have to be plotted in a new dimension using kernel function. The real data used are the data of 47 rivers and 18 indicators of river water pollution from Dinas Lingkungan Hidup (DLH) of Semarang City in the first semester of 2019. The cluster results evaluation is used the Calinski-Harabasz, Silhouette, and Xie-Beni indexes. The goals of this study are to know the step concepts and analysis results of Kernel K-Means Clustering for the grouping of rivers in Semarang City based on water pollution factors. Based on the results of the study, the cluster results evaluation show that the best number of clusters K=4",
        "link": "http://dx.doi.org/10.14710/j.gauss.v11i2.35470"
    },
    {
        "id": 779,
        "title": "Food Deserts and k-Means Clustering",
        "authors": "Garrett Kepler",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1137/22s1504445"
    },
    {
        "id": 780,
        "title": "Improving K-means Clustering with Genetic Programming for Feature Construction",
        "authors": "Andrew Lensen, Bing Xue, Mengjie Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No description supplied",
        "link": "http://dx.doi.org/10.26686/wgtn.13058762.v1"
    },
    {
        "id": 781,
        "title": "Clustering Using the k-Means Algorithm Example",
        "authors": "Xiuping Jia",
        "published": "2022-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2625662.ch38"
    },
    {
        "id": 782,
        "title": "K-Means Clustering Based on Distance Measures: Stunting Prevalence Clustering in South Kalimantan",
        "authors": "Akhmad Yusuf",
        "published": "2022-12-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isriti56927.2022.10052925"
    },
    {
        "id": 783,
        "title": "Unsupervised Machine Learning for Ultrasonic Flaw Detection using Gaussian Mixture Modeling, K-Means Clustering and Mean Shift Clustering",
        "authors": "Kushal Virupakshappa, Erdal Oruklu",
        "published": "2019-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ultsym.2019.8926078"
    },
    {
        "id": 784,
        "title": "Distribution Analysis Active Small and Medium Industries Bogor City Using K-means Clustering",
        "authors": "Siska Andriani",
        "published": "2022-12-2",
        "citations": 0,
        "abstract": "Small and Medium Industries (IKM) is one sector that contributes to driving economic growth, one of which is in West Java province, Bogor city. The number of active IKM in the city of Bogor in 2021 based on the survey results was 1,189, while in 2022 the number of small and medium industries (IKM) active in the city of Bogor based on the survey results was 1,766. The purpose of this study was conducted to determine the distribution of active small and medium industries (IKM) in Bogor city. So, this research can provide solutions related to the government or agencies to assist in building and developing IKM. In this research, the method used is the Knowledge Discovery in Database method, Where the stages are data selection, pre-processing, transformation, data mining and evaluation. Determination of the number of clusters is done using the elbow method. After determining with Elbow, the data will be represented using K-means clustering. The results of the K-means clustering algorithm yield 3 clusters, with each cluster 0 criterion being the distribution of low IKM with a total of 45 sub-districts. Cluster 1 is the distribution of medium IKM with the number of sub-districts is 14, and cluster 2 is the distribution of high IKM with the number of sub-districts totaling 9. The evaluation in this study used the silhouette coefficient method, from the data used it produced a cluster value of 0.56 which means that it is included in the clustering criteria with a good structure.",
        "link": "http://dx.doi.org/10.33751/komputasi.v20i1.6559"
    },
    {
        "id": 785,
        "title": "Penerapan Data Mining Dalam Clustering Produksi Daging Sapi Di Indonesia Menggunakan Algoritma K-Means",
        "authors": "Henri Pandiangan",
        "published": "2019-7-20",
        "citations": 1,
        "abstract": "Cows are animals that are found in Indonesia, cattle provide many benefits for humans ranging from milk that is rich in nutrients to meat as a source of high animal protein for humans. Beef production in Indonesia is not sufficient to meet domestic needs, so the government needs to ask for other meat and most still need beef to meet the daily protein needs of the community. The discussion of this study about the Application of Data Mining in the Cluster of Beef Production in Indonesia Using the K-Means Algorithm. The data source of this study was collected based on documents about beef production produced by the National Statistics Agency. The data used in this study are data from 2009-2016 consisting of 34 provinces. This study clustered in 3 groups, namely medium and low. The results of this study were 9 provinces included in the high group, 3 provinces included in the middle group and 22 provinces entered the low group.",
        "link": "http://dx.doi.org/10.47709/cnapc.v1i2.239"
    },
    {
        "id": 786,
        "title": "Poverty Level Grouping in West Java Province with the K-Means Clustering Method",
        "authors": " Amelia, Indah Manfaati Nur, Muhammad Rizky, Septiana Putri Milasari",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Poverty in a region will have an impact on hampering national development. Poverty is an economic disease that is often faced by every country, including Indonesia. According to information obtained from the Central Bureau of Statistics, we can gather data on the poverty rate in all provinces of Indonesia, with a particular focus on the province of West Java. West Java province is one of the provinces with the highest population density on the island of Java, which is ranked 2nd after the province of DKI Jakarta and ranks 4th for the province with a high percentage of poor people after DI. Yogyakarta, Central Java, and East Java. Consequently, it is crucial for the regional government to identify areas with high, moderate, or low poverty rates. This information will enable the local government to formulate appropriate policies and prioritize interventions to address poverty effectively. In this study, the K-Means clustering method was used to classify poverty rates based on two variables, namely the community development index and the open unemployment rate using the help of RStudio software. The findings indicated that the application of the elbow method in West Java province resulted in the identification of three distinct clusters of districts/cities that stood out as the most prominent. Cluster 1 (districts/cities with relatively high poverty rates), cluster 2 (districts/cities with low poverty rates), cluster 3 (districts/cities with high poverty rates). Regencies/cities that fall into the category with a high poverty rate are Sukabumi, Cianjur, Garut, Tasikmalaya, Ciamis, Kuningan, Cirebon, Majalengka, Indramayu, Subang, West Bandung, and Pangandaran.",
        "link": "http://dx.doi.org/10.26714/jodi.v1i2.152"
    },
    {
        "id": 787,
        "title": "Towards Optimized K Means Clustering Using Nature-Inspired Algorithms for Software Bug Prediction",
        "authors": "Kajal Tameswar",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4358066"
    },
    {
        "id": 788,
        "title": "Correction to “Two‐step clustering for data reduction combining DBSCAN and k‐means clustering”",
        "authors": "",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/ctpp.202399177"
    },
    {
        "id": 789,
        "title": "Improved K-means Clustering Algorithm based on Dynamic Clustering",
        "authors": "Jennefer Mononteliza",
        "published": "2020-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21742/apjcri.2020.04.01"
    },
    {
        "id": 790,
        "title": "Improving K-means Clustering with Genetic Programming for Feature Construction",
        "authors": "Andrew Lensen, Bing Xue, Mengjie Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No description supplied",
        "link": "http://dx.doi.org/10.26686/wgtn.13058762"
    },
    {
        "id": 791,
        "title": "Clustering Students' Interest Determination in School Selection Using the K-Means Clustering Algorithm Method",
        "authors": "Suhefi Oktarian, Sarjon Defit,  Sumijan",
        "published": "2020-9-30",
        "citations": 0,
        "abstract": "Pendidikan merupakan satu diantara fokus utama program kerja Pemerintah Kabupaten Indragiri Hilir. Berdasarkan data Badan Pusat Statistik Daerah kabupaten Indragiri tahun 2019 memaparkan, tingginya tingkat minat siswa dalam mengenyam bangku sekolah adalah pada jenjang SD dan SMP. K-means Clustering merupakan salah satu Teknik pengeolompokan data dengan cara membagi data yang ada ke dalam bentuk satu atau lebih cluster. Pengelompokan sekolah berdasarkan minat siswa merupakan hal penting dikarenakan pada tingkat SMA minat siswa dalam mengenyam pendidikan sudah berkurang sehingga di perlukan informasi sekolah mana yang sangat diminati, cukup diminati dan kurang diminati oleh siswa pada tingkat SMP ketika setelah selesai dari pendidikan SD. Penelitian ini bertujuan membantu pihak Dinas Pendidikan dalam proses pengambilan keputusan untuk menentukan sekolah mana yang paling banyak diminati oleh siswa guna sebagai acuan dalam pembangunan baik dari segi kualitas maupun kuantitas. Data yang digunakan dalam penelitian ini adalah data Dapodikdasmen tahun 2019. pengolahan data dalam penelitian ini menggunakan metode K-means Clustering dengan jumlah 3 cluster yaitu cluster 0 (C0) kurang diminati, Cluster 1 (C1) cukup diminati, cluster 2 (c2) sangat diminati siswa dalam memilih sekolah. Hasil dari proses clustering dengan 2 kali iterasi menyatakan bahwa untuk cluster 0 berjumlah 6 data sekolah, untuk cluster 1 berjumlah 3 data sekolah cluster 2 berjumlah 1 data sekolah.",
        "link": "http://dx.doi.org/10.37034/jidt.v2i3.65"
    },
    {
        "id": 792,
        "title": "Clustering Students' Interest Determination in School Selection Using the K-Means Clustering Algorithm Method",
        "authors": "Suhefi Oktarian, Sarjon Defit,  Sumijan",
        "published": "2020-9-30",
        "citations": 0,
        "abstract": "Pendidikan merupakan satu diantara fokus utama program kerja Pemerintah Kabupaten Indragiri Hilir. Berdasarkan data Badan Pusat Statistik Daerah kabupaten Indragiri tahun 2019 memaparkan, tingginya tingkat minat siswa dalam mengenyam bangku sekolah adalah pada jenjang SD dan SMP. K-means Clustering merupakan salah satu Teknik pengeolompokan data dengan cara membagi data yang ada ke dalam bentuk satu atau lebih cluster. Pengelompokan sekolah berdasarkan minat siswa merupakan hal penting dikarenakan pada tingkat SMA minat siswa dalam mengenyam pendidikan sudah berkurang sehingga di perlukan informasi sekolah mana yang sangat diminati, cukup diminati dan kurang diminati oleh siswa pada tingkat SMP ketika setelah selesai dari pendidikan SD. Penelitian ini bertujuan membantu pihak Dinas Pendidikan dalam proses pengambilan keputusan untuk menentukan sekolah mana yang paling banyak diminati oleh siswa guna sebagai acuan dalam pembangunan baik dari segi kualitas maupun kuantitas. Data yang digunakan dalam penelitian ini adalah data Dapodikdasmen tahun 2019. pengolahan data dalam penelitian ini menggunakan metode K-means Clustering dengan jumlah 3 cluster yaitu cluster 0 (C0) kurang diminati, Cluster 1 (C1) cukup diminati, cluster 2 (c2) sangat diminati siswa dalam memilih sekolah. Hasil dari proses clustering dengan 2 kali iterasi menyatakan bahwa untuk cluster 0 berjumlah 6 data sekolah, untuk cluster 1 berjumlah 3 data sekolah cluster 2 berjumlah 1 data sekolah.",
        "link": "http://dx.doi.org/10.37034/jidt.vi0.65"
    },
    {
        "id": 793,
        "title": "A Comparative Study on K-Means Clustering and Agglomerative Hierarchical Clustering",
        "authors": "Karthikeyan B",
        "published": "2020-5-25",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30534/ijeter/2020/20852020"
    },
    {
        "id": 794,
        "title": "Multi-Hot Encoding of Categorical Dataset for K-Means Clustering Cropping Based Clustering of Districts in Bangladesh",
        "authors": "Mozammel H. A. Khan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4066367"
    },
    {
        "id": 795,
        "title": "Penerapan Algoritma K-Means Untuk Clustering Data Tempat Penyebaran Jentik Nyamuk Aedes Aegepty Pada Kelurahan Sumampir, Banyumas",
        "authors": "Eva Argarini Pratama, Corie Mei Hellyana",
        "published": "2021-6-15",
        "citations": 0,
        "abstract": "Demam Berdarah Dengue (DBD) merupakan penyakit yang disebabkan oleh infeksi virus dengue. DiFaktanya, virus ini dapat masuk ke tubuh manusia melalui perantara antara Aedes aegypti dan Aedes albopictus. Kedua jenis nyamuk tersebut ditemukan hampir di seluruh pelosok Indonesia bahkan di dunia. Mengetahui demam berdarah merupakan penyakit yang berkaitan dengan lingkungan yang relatif cepat menyebar. Meningkatnya kasus DBD di suatu daerah, bisa jadi karena gerakan pemberantasan sarang nyamuk yang tidak dilakukan dengan maksimal dan berkualitas. Berdasarkan uraian di atas, penggunaan metode K-mens dalam penelitian ini bertujuan untuk mengelompokkan dan mengetahui tempat-tempat yang mengindikasikan adanya jentik nyamuk penyebab Demam Berdarah Dengue. Hasil dari 9 data jumlah jentik nyamuk berdasarkan wadah yang digunakan sebagai sarang dapat diketahui, 2 cluster countainer tingkat tinggi untuk jumlah keberadaan jentik nyamuk terbanyak yaitu bak mandi dan pot bunga. 4 cluster counteiner sedang dan 3 cluster counteiner lainnya termasuk cluster level rendah. Untuk itu perlu perhatian khusus pada tempat-tempat tersebut jika sebuah rumah memiliki banyak jenis wadah.",
        "link": "http://dx.doi.org/10.54367/means.v6i1.1169"
    },
    {
        "id": 796,
        "title": "HdK-means: Hadoop based parallel K-means clustering for big data",
        "authors": "Soumyendu Sekhar Bandyopadhyay, Anup Kumar Halder, Piyali Chatterjee, Mita Nasipuri, Subhadip Basu",
        "published": "2017-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/calcon.2017.8280774"
    },
    {
        "id": 797,
        "title": "Clustering Clustering Data Ekspor Buah-Buahan Berdasarkan Negara Tujuan Menggunakan Algoritma K-Means",
        "authors": "Haviz Atma Negara",
        "published": "2021-9-3",
        "citations": 0,
        "abstract": "Indonesia merupakan salah satu negara pengekspor ke negara-negara maju dan berkembang. Eksportir bertujuan untuk memperoleh keuntungan demi menunjang perekonomian dan kemakmuran masyarakat. Penelitian ini membahas tentang penerapan data mining pada ekspor buah-buahan menurut negara tujuan menggunakan k-means clustering method. Data yang digunakan dalam penelitian ini adalah data Ekspor Buah-buahan Menurut Negara Tujuan Utama dari tahun 2012-2019 yang diambil dari dokumen-dokumen keterangan ekspor impor yang dihasilkan oleh Direktorat Jenderal Bea dan Cukai. Data akan diolah dengan melakukan clustering dalam 3 cluster yaitu cluster tingkat ekspor tinggi, cluster tingkat ekspor sedang dan cluster tingkat ekspor rendah. Centroid data untuk cluster tingkat ekspor tinggi sebesar 2054519.3, centroid data untuk cluster tingkat ekspor sedang sebesar 489020.3, centroid data untuk cluster tingkat ekspor rendah sebesar 20.2. Sehingga diperoleh penilaian berdasarkan indeks ekspor buah-buahan dengan 2 negara cluster tingkat ekspor tinggi yakni negara Tiongkok & Malaysia, 2 negara cluster tingkat ekspor rendah yakni Vietnam & Thailand, dan 6 negara cluster tingkat ekspor rendah yakni Hongkong, Singapura, Nigeria, India, Jepang, Uni Emirat Arab. Sehingga diperoleh informasi hasil pengelompokan data baru yang dapat menjadi masukan bagi pemerintah maupun perusahaan-perusahaan agar memprioritaskan serta dapat lebih meningkatkan kegiatan ekspor buah-buahan berdasarkan klaster yang telah dilaksanakan.",
        "link": "http://dx.doi.org/10.35329/jiik.v7i2.190"
    },
    {
        "id": 798,
        "title": "Boosting k-means clustering with symbiotic organisms search for automatic clustering problems",
        "authors": "Abiodun M. Ikotun, Absalom E. Ezugwu",
        "published": "2022-8-11",
        "citations": 8,
        "abstract": "Kmeans clustering algorithm is an iterative unsupervised learning algorithm that tries to partition the given dataset into k pre-defined distinct non-overlapping clusters where each data point belongs to only one group. However, its performance is affected by its sensitivity to the initial cluster centroids with the possibility of convergence into local optimum and specification of cluster number as the input parameter. Recently, the hybridization of metaheuristics algorithms with the K-Means algorithm has been explored to address these problems and effectively improve the algorithm’s performance. Nonetheless, most metaheuristics algorithms require rigorous parameter tunning to achieve an optimum result. This paper proposes a hybrid clustering method that combines the well-known symbiotic organisms search algorithm with K-Means using the SOS as a global search metaheuristic for generating the optimum initial cluster centroids for the K-Means. The SOS algorithm is more of a parameter-free metaheuristic with excellent search quality that only requires initialising a single control parameter. The performance of the proposed algorithm is investigated by comparing it with the classical SOS, classical K-means and other existing hybrids clustering algorithms on eleven (11) UCI Machine Learning Repository datasets and one artificial dataset. The results from the extensive computational experimentation show improved performance of the hybrid SOSK-Means for solving automatic clustering compared to the standard K-Means, symbiotic organisms search clustering methods and other hybrid clustering approaches.",
        "link": "http://dx.doi.org/10.1371/journal.pone.0272861"
    },
    {
        "id": 799,
        "title": "Segmentation and Area Calculation of Brain Tumor Images Using K-Means Clustering and Fuzzy C-Means Clustering",
        "authors": "P. Likhitha Saveri, Sandeep Kumar, Manisha Bharti",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-1745-7_47"
    },
    {
        "id": 800,
        "title": "Analisis Klaster Kinerja Usaha Kecil dan Menengah Menggunakan Algoritma K-Means Clustering",
        "authors": "Dona Marcelina, Annisa Kurnia, Terttiaavini Terttiaavini",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "Fokus penelitian ini adalah untuk menyelesaikan masalah yang dihadapi oleh dinas koperasi dan UKM Provinsi Sumatera Selatan, yaitu kesulitan dalam menerapkan program pengembangan usaha bagi UKM. Selama ini dinas koperasi dan UKM Provinsi Sumatera selatan telah melakukan berbagai kegiatan yang berhubungan dengan peningkatan kualitas pengelolaan UKM. Namun karena pendataan UKM kurang lengkap, maka sulit untuk menentukan program terbaik bagi UKM yang dapat mempercepat pengembangan usaha di UKM.  Tujuan dari penelitian ini adalah untuk melengkapi data UKM melalui penyebaran kuesioner dan melakukan mengelompokkan UKM berdasarkan kinerja UKM. Pengelompokan ini nantinya akan digunakan  untuk menyusun strategi pengembangan UKM yang sesuai dan tepat sasaran. Penelitian ini, menggunakan metode K-Means Clustering dengan indikator, yaitu kinerja keuangan, penjualan produk, dan strategi pemasaran sebagai dasar pengelompokkan. Aplikasi KNIME digunakan sebagai alat untuk analisis data, pemrosesan data, pemodelan data, dan visualisasi model yang mudah dan akurat. Hasil analisis data menunjukkan UMKM terbagi menjadi tiga kelompok atau klaster, yaitu UKM mandiri, UKM berkembang, dan UKM binaan. Hasil pengelompokkan ini diharapkan dapat memberikan masukkan yang berguna bagi Dinas Koperasi dan UKM untuk menerapkan program pengembangan strategi yang lebih spesifik yang sesuai dengan karakteristik dari masing-masing klaster.",
        "link": "http://dx.doi.org/10.57152/malcom.v3i2.952"
    }
]