[
    {
        "id": 9284,
        "title": "Roberta Findlay vs. Porn Studies",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "In a new interview with Roberta Findlay, the volume editors query her about her thoughts on being the subject of scholarly analysis. They also clarify long-lingering questions and misunderstandings about her work and career, allowing her personality and humour to come through clearly",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0011"
    },
    {
        "id": 9285,
        "title": "Roberta Findlay’s Bronx Tale: Notes on Game of Survival",
        "authors": "Neil Jackson",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "This chapter examines an outlier from Roberta Findlay’s filmography: Game of Survival (aka Tenement, 1985). If Findlay’s career tracks as exploitation, softcore, hardcore, and, finally, horror, Game of Survival stands out as something different, a brutally violent, urban, action-thriller set in the South Bronx area of New York City. Arguing that it nevertheless conforms to the closer-to-the-mainstream efforts of the latter part of her career, the chapter offers a detailed textual and industrial analysis of the film that situates it within a variety of contexts. Race, place, politics, authorship, and genre are all examined, as are the economic imperatives behind the film’s production, distribution, exhibition, and reception. Ultimately, this outlier, this chapter argues, may very well offer much to understand Roberta Findlay, exploitation film, and the conditions in which it was made and seen.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0008"
    },
    {
        "id": 9286,
        "title": "Lymphadenopathy after BNT162b2 Covid-19 Vaccine: Preliminary Ultrasound Findings",
        "authors": "Vincenza Granata, Roberta Fusco, Sergio Venanzio Setola, Roberta Galdiero, Carmine Picone, Francesco Izzo, Roberta D’Aniello, Vittorio Miele, Roberta Grassi, Roberto Grassi, Antonella Petrillo",
        "published": "2021-3-11",
        "citations": 36,
        "abstract": "During a spontaneous and autonomous study, we assessed the ultrasound finding of lymphadenopathy after BNT162b2 Pfizer vaccine. We enrolled 18 patients with 58 lymphadenopathies: in 10 patients, they were in the laterocervical side, while in 8 patients in the axillar site. The largest diameter was 16 mm with a range from 7 to 16 mm (median value = 10 mm). In the same patient, we found different ultrasound nodal findings. A total of 25 nodes showed eccentric cortical thickening with wide echogenic hilum and oval shape. In total, 19 nodes showed asymmetric eccentric cortical thickening with wide echogenic hilum and oval shape. Overall, 10 nodes showed concentric cortical thickening with reduction in the width of the echogenic hilum and oval shape. A total of four nodes showed huge reduction and displacement of the echogenic hilum and round or oval shape. No anomaly was found at the Doppler echocolor study. In conclusion, eccentric cortical thickening with wide echogenic hilum and oval shape, asymmetric eccentric cortical thickening with wide echogenic hilum and oval shape, concentric cortical thickening with reduction in the width of the echogenic hilum and oval shape, and a huge reduction and displacement of the echogenic hilum and round shape are the features that we found in post BNT162b2 Covid-19 Vaccine lymphadenopathies.",
        "link": "http://dx.doi.org/10.3390/biology10030214"
    },
    {
        "id": 9287,
        "title": "Singularity and Conformity: Feminism and Roberta Findlay’s Strategic Marketing Communications",
        "authors": "Finley Freibert",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "This chapter re-situates Roberta Findlay’s career, and particularly her many public statements, interviews, and marketing strategies, from a strategic communications perspective. In doing so, it argues that rather than simply seeing Findlay as anti-feminist, long one of the defining characteristics of her public persona, we might benefit from understanding her choices as strategic, especially when coupled with her executive role as CEO of Reeltime Distributing. Tracing the purposeful ways in which Findlay’s misogynistic rhetoric served a purposeful industrial function, whether that was to separate herself from other filmmakers as a form of differentiation, or to conform to standard practices as a way of easing consumer anxiety, this chapter offers a new perspective through which to understand Findlay’s long and often contradictory communications history.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0002"
    },
    {
        "id": 9288,
        "title": "Chapter 10 Roberta Findlay vs. Porn Studies",
        "authors": "Whitney Strub, Peter Alilunas, Roberta Findlay",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-015"
    },
    {
        "id": 9289,
        "title": "By the Numbers: Roberta Findlay, Home Video, and the Horror Genre",
        "authors": "Johnny Walker",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "Roberta Findlay’s association with horror cinema rarely extends beyond the Manson-inspired exploitation film Snuff (Michael Findlay, 1976). Consequently, her directorial efforts in the horror genre—four films made between 1985 and 1989, The Oracle (1985), Blood Sisters (1987), Lurkers (1987) and Prime Evil (1988)—are all but ignored in scholarly discourse. Analysis of the films in relation to contemporary trade publications and associated promotional materials enables a broader understanding of the economic context that birthed them and, by extension, leads to a fuller understanding of the industrial history of US horror cinema in the 1980s.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0009"
    },
    {
        "id": 9290,
        "title": "Human Behavior Theory&amp; Social Work Practice",
        "authors": "Roberta R. Greene",
        "published": "2017-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351310369"
    },
    {
        "id": 9291,
        "title": "The Beginning and the End: Transitioning Careers and Roberta Findlay’s Banned ( 1989 )",
        "authors": "Alexandra Heller-Nicholas",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "Marking the end of a rollercoaster and frequently controversial career straddling exploitation cinema, hardcore pornography and horror, Roberta Findlay’s final film BANNED (1989) has long been the subject of dedicated fan speculation. Intended to profit on the-then current trend for wild youth-oriented comedies on cable television and VHS, after failing to gain distribution for the film Findlay effectively quit filmmaking and dedicated herself professionally to the subject she studied at university – music – through her work at the legendary esteemed Sear Sound studio in Hell’s Kitchen. From this perspective, the little-seen BANNED can be viewed as both the end of Findlay’s directorial career, while simultaneously also flagging a transitional to a second career. With much of the film itself set in a recording studio, BANNED follows the antics of a middle class, middle of the road jazz rock guitarist who becomes possessed by the spirit of a dead killer punk rocker via a haunted toilet. While in its own way just as audacious as Findlay’s more notorious works, BANNED is not only a curious finale to a complex and fascinating film career, but it also formally reveals a return to her first passion: music.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0010"
    },
    {
        "id": 9292,
        "title": "Reflections: 50 Years of Medieval Archaeology, 1957–2007",
        "authors": "Roberta Gilchrist",
        "published": "2018-12-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315089034"
    },
    {
        "id": 9293,
        "title": "“Not Even a Lesbian,” or Roberta Findlay’s Ambivalently Queer/Feminist Hardcore Cinema",
        "authors": "Jennifer Moorman",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "This chapter explores the ambivalently feminist and queer potential of Roberta Findlay’s “extreme” hardcore cinema. Prior to the existence of the feminist, queer, or even couples porn subgenres, there was Findlay making violent, disturbing “porn with a woman’s sensibilities.” Perhaps unsurprisingly for a woman working within a distinctly masculinist milieu, there is a notable tension in both her work and her articulated motivations, between what can be described as queer or feminist potential and the lack thereof, sometimes verging on downright misogyny. An exploration of Findlay’s fraught contributions to the adult film canon enables a reconceptualization of “women’s pornography” as a “minor cinema.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0003"
    },
    {
        "id": 9294,
        "title": "Biology of Parrotfishes",
        "authors": "Andrew S. Hoey, Roberta M. Bonaldo",
        "published": "2018-3-5",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315118079"
    },
    {
        "id": 9295,
        "title": "Human Behavior Theory",
        "authors": "Roberta R. Greene, Nancy Kropf",
        "published": "2017-7-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780203789612"
    },
    {
        "id": 9296,
        "title": "Bronchopulmonary Dysplasia",
        "authors": "Roberta L. Keller, Roberta A. Ballard",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-40139-5.00048-6"
    },
    {
        "id": 9297,
        "title": "De Novo 1q21.3q22 Duplication Revaluation in a “Cold” Complex Neuropsychiatric Case with Syndromic Intellectual Disability",
        "authors": "Roberta Milone, Roberta Scalise, Rosa Pasquariello, Stefano Berloffa, Ivana Ricca, Roberta Battini",
        "published": "2021-3-31",
        "citations": 0,
        "abstract": "Syndromic intellectual disability often obtains a genetic diagnosis due to the combination of first and next generation sequencing techniques, although their interpretation may require revaluation over the years. Here we report on a composite neuropsychiatric case whose phenotype includes moderate intellectual disability, spastic paraparesis, movement disorder, and bipolar disorder, harboring a 1.802 Mb de novo 1q21.3q22 duplication. The role of this duplication has been reconsidered in the light of negativity of many other genetic exams, and of the possible pathogenic role of many genes included in this duplication, potentially configuring a contiguous gene-duplication syndrome.",
        "link": "http://dx.doi.org/10.3390/genes12040511"
    },
    {
        "id": 9298,
        "title": "ReFocus: The Films of Roberta Findlay",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "ReFocus: The Films of Roberta Findlay covers a variety of angles, using queer, feminist, historical, and close textual reading methods to grapple with the complicated and contradictory politics and meanings of this pioneering culture-worker. Chapters examine Findlay’s marketing strategies, the gender politics of her exploitation and hardcore films, 1980s horror productions, and several case studies of key individual films, in addition to a new interview with Findlay reflecting on her life and career.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.001.0001"
    },
    {
        "id": 9299,
        "title": "17q12 Recurrent Deletions and Duplications: Description of a Case Series with Neuropsychiatric Phenotype",
        "authors": "Roberta Milone, Raffaella Tancredi, Angela Cosenza, Anna Rita Ferrari, Roberta Scalise, Giovanni Cioni, Roberta Battini",
        "published": "2021-10-21",
        "citations": 6,
        "abstract": "Syndromic neurodevelopmental disorders are usually investigated through genetics technologies, within which array comparative genomic hybridization (Array-CGH) is still considered the first-tier clinical diagnostic test. Among recurrent syndromic imbalances, 17q12 deletions and duplications are characterized by neurodevelopmental disorders associated with visceral developmental disorders, although expressive variability is common. Here we describe a case series of 12 patients with 17q12 chromosomal imbalances, in order to expand the phenotypic characterization of these recurrent syndromes whose diagnosis is often underestimated, especially if only mild traits are present. Gene content and genotype-phenotype correlations have been discussed, with special regard to neuropsychiatric features, whose impact often requires etiologic analysis.",
        "link": "http://dx.doi.org/10.3390/genes12111660"
    },
    {
        "id": 9300,
        "title": "Zero Girls and Lesbian Stylites: From Solar Sexuality to Camp in the Early Films of Roberta Findlay",
        "authors": "Kevin John Bozelka",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "Using Michel Tournier’s 1967 philosophical novel Friday, or, The Other Island, this chapter analyses the early films of Robert Findlay as journeys towards attaining a solar sexuality, an elemental, deindividuated jubilance free of language, categories, and rationalisation. The lesbians in later Roberta Findlay’s films long for transcendence. But they exist in a world that will not leave them alone. Pimps, psychiatrists, lecherous fathers, and all manner of derelicts subjugate them to sexual violence and/or attempt to correct their lesbian tendencies. Given how these later titles still lack a strong diegetic interiority, a viewer can take their horrors with a grain of camp. They seem to hail a self-actualised lesbian subject prepared to reject any oppressive realism. But Take Me Naked and Mnasidika seem to hail no one despite intimations in the latter of a lesbian Eden, making for a more avant-garde cinematic experience.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0004"
    },
    {
        "id": 9301,
        "title": "The Routledge Companion to American Literary Journalism",
        "authors": "William E. Dow, Roberta S. Maguire, Yoko Nakamura",
        "published": "2019-11-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315526010"
    },
    {
        "id": 9302,
        "title": "EDUCAR PARA SALVAR - SUPORTE BÁSICO DE VIDA PARA LEIGOS",
        "authors": "Bianca de Almeida Paes Barretto Coutinho, Gabriel de Oliveira Garcia Araújo Braga, Milla Giancristofaro Dutra, Roberta Teixeira Prado, Carolina Sabino Vidigal, Leticia Tavares de Vasconcellos, Mariana de Oliveira Peternelli, Roberta Teixeira Prado, Micaella Ramos Teixeira, Gabriela dos Santos Lopes, Arthur Neves Egidio, Roberta Teixeira Prado, Joanna Freire Alves Carvalho, Gabriel Bedim Ximenes, Eduarda Purgato Mesquita Monteiro, Roberta Teixeira Prado, Evandro Costa Reis Iennaco, Mariane Vargas Freitas, Roberta Teixeira Prado, Clara Delgado Carvalho, Lavínia Barcellos Araújo, Roberta Teixeira Prado, Bárbara Morando Kalil Patrício, Roberta Teixeira Prado",
        "published": "2021-7-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29327/538594"
    },
    {
        "id": 9303,
        "title": "ESTRATÉGIAS DE TREINAMENTOS NO ENFRENTAMENTO A PANDEMIA",
        "authors": "Roberta da Silva Costa, Marinalda Costa, Roberta Barta",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29327/q2caldvcec2021_192316.498546"
    },
    {
        "id": 9304,
        "title": "Moving into Adolescence",
        "authors": "Roberta G. Simmons, Dale A. Blyth",
        "published": "2017-7-5",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315124841"
    },
    {
        "id": 9305,
        "title": "“This is a Farce”: Satire, Pseudonyms, and the Impact of Collaboration in Early Walter Sear/Roberta Findlay Films",
        "authors": "Derek Gaskill",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "This chapter examines the film collaborations between Roberta Findlay and the recording engineer Walter Sear, her life and business partner and with whom she made 20 adult films. Examining her films before their collaboration, as well as his early solo efforts, this chapter argues that a distinctive style emerges from their partnership that can be distinguished from Findlay’s earlier work. Efficient, economical, and often absurdist, the Findlay/Sear films might not have been up to the same level of quality that can be found in Findlay’s earlier body of work, but they illustrate the ways in which adult films of the 1970s were often made quickly and with very few resources but were nevertheless profitable.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0006"
    },
    {
        "id": 9306,
        "title": "Foreword",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.002.0009"
    },
    {
        "id": 9307,
        "title": "640 Cannabis abuse and syncope",
        "authors": "Marco Licciardi, Elena Utzeri, Maria Francesca Marchetti, Roberta Pittau, Nicola Campana, Elena Orani, Vincenzo Nissardi, Roberta Demelas, Silvia Maiani, Luigi Meloni, Roberta Montisci",
        "published": "2021-12-8",
        "citations": 0,
        "abstract": "Abstract\n\nAims\nCannabis (marijuana) is the most consumed drug worldwide, counting roughly 200 million users in 2019 (4% of the global population). Once illegal in most of the world countries, cannabis is now legal for medical and recreational use in several states. During the last 20 years, we have observed a growing decriminalization wave parallel with an increase number of consumers: it is therefore mandatory not only for the cardiologists but for every physician to be aware of marijuana potential cardiovascular adverse health effects. With this paper, we present a case report of cannabis induced 16 s implantable loop recorder (ILR) recorded asystole from hypervagotonia in a 24-year-old heavy marijuana consumer. We focus on the infrequently reported association between syncope and chronic marijuana use and we try to explain the underlying mechanisms against the background of the current literature.\n\n\nMethods and results\nA 24-year-old presented to the emergency department sent by her cardiologist because of a recent finding of a 16 s asystole on the ILR she implanted 7 months before for recurrent syncopes. She openly declared that she is a heavy marijuana user (at least 5 cannabis-cigarette per day, not mixed up with tobacco, for no less than 12 years). She had a history of at least two spontaneous atypical syncopal episodes and a multitude of pre-syncopal episodes. Before being hospitalized, she underwent several diagnostic tests excluding a neurological etiology and, upon outpatient regimen, she begun a cardiology evaluation which lead to the ILR implantation. While watching TV at late night, the second prodrome-less syncopal episode occurred and a 16-s asystole was found on the ILR. During hospitalization, the patient was closely monitored and we evaluated basic autonomic function tests, carotid sinus massage, echocardiography, exercise stress test, and 24 h telemetry. Following the results of the exams, we considered a heart conduction system anomaly unlikely. Finally, the patient underwent a toxicological and a psychiatric evaluation, where she strongly expressed not wanting to abandon cannabis abuse. After a collective discussion with the heart team, syncope unit, electrophysiologists, and toxicologist, we decided to implant a dual chamber pacemaker with a rate response algorithm due to the high risk of trauma of the syncopal episodes.\n\n\nConclusions\nCannabis cardiovascular effects are not well known; among these we find ischaemic episodes, tachyarrhythmias, symptomatic sinus bradycardia, sinus arrest, and ventricular asystole. In the light of the poor literature, we believe that cannabis may produce opposite adverse effects depending on the duration of the habit. Acute administration increases sympathetic tone and reduces parasympathetic tone; conversely, with chronic intake an opposite effect is observed: repetitive dosing decreases sympathetic activity and increases parasympathetic activity. Physicians should be aware of the effects that cannabis produces upon the cardiovascular system: this could avoid expensive, prolonged hospitalizations, and needless diagnostic tests.\n",
        "link": "http://dx.doi.org/10.1093/eurheartj/suab127.015"
    },
    {
        "id": 9308,
        "title": "Reply",
        "authors": "Roberta L. Keller, Roberta A. Ballard",
        "published": "2017-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jpeds.2017.05.064"
    },
    {
        "id": 9309,
        "title": "7T MRI Protocol for response to Respiratory-gated Auricular Vagal Afferent Nerve Stimulation v1",
        "authors": "Vitaly Napadow, Roberta Sclocco, Vitaly Napadow, Roberta Sclocco",
        "published": "No Date",
        "citations": 0,
        "abstract": "This is the 7T MRI protocol for a study of the subject to Respiratory-gated Auricular Vagal Afferent Nerve Stimulation in  the area of the auricular concha. Scan types include: multi-echo MPRAGE and 6 GRE BOLD scans for the stimulation conditions. ",
        "link": "http://dx.doi.org/10.17504/protocols.io.9zqh75w"
    },
    {
        "id": 9310,
        "title": "Ruck, Amy Roberta (Berta) (1878–1978)",
        "authors": "",
        "published": "2017-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/odnb/9780192683120.013.31633"
    },
    {
        "id": 9311,
        "title": "Prison of Food",
        "authors": "Giorgio Nardone, Tiziana Verbitz, Roberta Milanese",
        "published": "2018-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429478543"
    },
    {
        "id": 9312,
        "title": "Conclusion",
        "authors": "Larry Bennett, Roberta Garner, Euan Hague",
        "published": "2017-9-21",
        "citations": 0,
        "abstract": "The conclusion presents a conversation among the editors about how Chicago might become a “just city” rather than a city beset by persistent inequities. The authors agree that collective action and social movements can contribute to more egalitarian outcomes and a better quality of life for all. Garner uses the concept of “institutional structures of capitalism” to discuss the prospects for change; Hague sees a strong potential in local collective action; and Bennett emphasizes the need for national coalitions of working people organized for universal rights.",
        "link": "http://dx.doi.org/10.5406/illinois/9780252040597.003.0013"
    },
    {
        "id": 9313,
        "title": "S-Adenosylmethionine Inhibits Colorectal Cancer Cell Migration through Mirna-Mediated Targeting of Notch Signaling Pathway",
        "authors": "Luigi Borzacchiello, Roberta Veglia Tranchese, Roberta Grillo, Roberta Arpino, Laura Mosca, Giovanna Cacciapuoti, Marina Porcelli",
        "published": "2022-7-12",
        "citations": 3,
        "abstract": "Metastasis is a leading cause of mortality and poor prognosis in colorectal cancer (CRC). Thus, the identification of new compounds targeting cell migration represents a major clinical challenge. Recent findings evidenced a central role for dysregulated Notch in CRC and a correlation between Notch overexpression and tumor metastasis. MicroRNAs (miRNAs) have been reported to cross-talk with Notch for its regulation. Therefore, restoring underexpressed miRNAs targeting Notch could represent an encouraging therapeutic approach against CRC. In this context, S-adenosyl-L-methionine (AdoMet), the universal biological methyl donor, being able to modulate the expression of oncogenic miRNAs could act as a potential antimetastatic agent. Here, we showed that AdoMet upregulated the onco-suppressor miRNAs-34a/-34c/-449a and inhibited HCT-116 and Caco-2 CRC cell migration. This effect was associated with reduced expression of migration-/EMT-related protein markers. We also found that, in colorectal and triple-negative breast cancer cells, AdoMet inhibited the expression of Notch gene, which, by luciferase assay, resulted the direct target of miRNAs-34a/-34c/-449a. Gain- and loss-of-function experiments with miRNAs mimics and inhibitors demonstrated that AdoMet exerted its inhibitory effects by upregulating miRNAs-34a/-34c/-449a. Overall, these data highlighted AdoMet as a novel Notch inhibitor and suggested that the antimetastatic effects of AdoMet involve the miRNA-mediated targeting of Notch signaling pathway.",
        "link": "http://dx.doi.org/10.3390/ijms23147673"
    },
    {
        "id": 9314,
        "title": "MARITIME MEDIATION",
        "authors": "Roberta Donato",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47907/llivromaritimemediation/projetomedimare/2023"
    },
    {
        "id": 9315,
        "title": "Roberta Pergher Italian Fascism in Transnational Historiography",
        "authors": "Roberta Pergher",
        "published": "2022-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9783110768619-003"
    },
    {
        "id": 9316,
        "title": "Polymeric Based Hydrogel Membranes for Biomedical Applications",
        "authors": "Sonia Trombino, Roberta Sole, Federica Curcio, Roberta Cassano",
        "published": "2023-6-1",
        "citations": 5,
        "abstract": "The development of biomedical applications is a transdisciplinary field that in recent years has involved researchers from chemistry, pharmacy, medicine, biology, biophysics, and biomechanical engineering. The fabrication of biomedical devices requires the use of biocompatible materials that do not damage living tissues and have some biomechanical characteristics. The use of polymeric membranes, as materials meeting the above-mentioned requirements, has become increasingly popular in recent years, with outstanding results in tissue engineering, for regeneration and replenishment of tissues constituting internal organs, in wound healing dressings, and in the realization of systems for diagnosis and therapy, through the controlled release of active substances. The biomedical application of hydrogel membranes has had little uptake in the past due to the toxicity of cross-linking agents and to the existing limitations regarding gelation under physiological conditions, but now it is proving to be a very promising field This review presents the important technological innovations that the use of membrane hydrogels has promoted, enabling the resolution of recurrent clinical problems, such as post-transplant rejection crises, haemorrhagic crises due to the adhesion of proteins, bacteria, and platelets on biomedical devices in contact with blood, and poor compliance of patients undergoing long-term drug therapies.",
        "link": "http://dx.doi.org/10.3390/membranes13060576"
    },
    {
        "id": 9317,
        "title": "Figures",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.002.0006"
    },
    {
        "id": 9318,
        "title": "The Sociopolitical Structure of Prehistoric Southwestern Societies",
        "authors": "Steadman Upham, Kent G Lightfoot, Roberta A. Jewett",
        "published": "2019-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780429314612"
    },
    {
        "id": 9319,
        "title": "&lt;b&gt;Variações sobre teatro e audiovisual&lt;/b&gt;&lt;br /&gt;[Roberta Matsumoto]",
        "authors": "Roberta Matsumoto",
        "published": "2017-12-5",
        "citations": 0,
        "abstract": "<p class=\"p1\">Resumo:<span class=\"Apple-converted-space\"> </span></p><p class=\"p3\">Nos últimos 30 anos, o diálogo entre o teatro e as tecnologias de produção de imagem tem se tornando cada vez mais intenso, sobretudo com o advento do sistema digital que vem possibilitado a miniaturização dos dispositivos e sua disseminação. Neste artigo, apontamos alguns caminhos de diálogo entre o teatro e o audiovisual no que diz respeito à presença de tais tecnologias como elemento de encenação do espetáculo teatral e à sua utilização como ferramentas que auxiliam o processo de criação e a pesquisa em teatro.<span class=\"Apple-converted-space\"> </span></p><p class=\"p4\"><span class=\"s1\">P</span>alavras<span class=\"s1\">-</span>chave<span class=\"s1\">:<span class=\"Apple-converted-space\"> </span></span>Teatro. Audiovisual. Cinema. Encenação teatral. Metodologia de pesquisa em artes cênicas.<span class=\"Apple-converted-space\"> </span></p><p class=\"p4\"><span class=\"Apple-converted-space\"><br /></span></p><p><em>VARIATIONS ON THEATER AND AUDIO-VISUAL MATERIAL</em></p><p class=\"p4\"><em>Abstract:<span class=\"Apple-converted-space\"> </span></em></p><p class=\"p3\"><em>During the last thirty years, the interactions between theater and imaging technologies has become increasingly intense. The advent of digital system technology allowed this process to develop even further due to shrinking and dissemination of such devices. In this paper, we highlight some forms of creating interaction between theater and audio-visual material. We focus on describing the use of such technologies as elements of the staging process and also its use as tools that contribute to the process of creating and researching theater.<span class=\"Apple-converted-space\"> </span></em></p><p class=\"p4\"><span class=\"s1\"><em>K</em></span><em>eywords</em><span class=\"s1\"><em>:<span class=\"Apple-converted-space\"> </span></em></span><em>Theater. Audio-visual. Cinema. Theatrical performance. Methodological approaches to performing arts research.<span class=\"Apple-converted-space\"> </span></em></p>",
        "link": "http://dx.doi.org/10.9771/r.v0i28.24998"
    },
    {
        "id": 9320,
        "title": "Transdermal Delivery of Phloretin by Gallic Acid Microparticles",
        "authors": "Roberta Cassano, Federica Curcio, Roberta Sole, Sonia Trombino",
        "published": "2023-3-15",
        "citations": 3,
        "abstract": "Exposure to ultraviolet (UV) radiation causes harmful effects on the skin, such as inflammatory states and photoaging, which depend strictly on the form, amount, and intensity of UV radiation and the type of individual exposed. Fortunately, the skin is endowed with a number of endogenous antioxidants and enzymes crucial in its response to UV radiation damage. However, the aging process and environmental stress can deprive the epidermis of its endogenous antioxidants. Therefore, natural exogenous antioxidants may be able to reduce the severity of UV-induced skin damage and aging. Several plant foods constitute a natural source of various antioxidants. These include gallic acid and phloretin, used in this work. Specifically, polymeric microspheres, useful for the delivery of phloretin, were made from gallic acid, a molecule that has a singular chemical structure with two different functional groups, carboxylic and hydroxyl, capable of providing polymerizable derivatives after esterification. Phloretin is a dihydrochalcone that possesses many biological and pharmacological properties, such as potent antioxidant activity in free radical removal, inhibition of lipid peroxidation, and antiproliferative effects. The obtained particles were characterized by Fourier transform infrared spectroscopy. Antioxidant activity, swelling behavior, phloretin loading efficiency, and transdermal release were also evaluated. The results obtained indicate that the micrometer-sized particles effectively swell, and release the phloretin encapsulated in them within 24 h, and possess antioxidant efficacy comparable to that of free phloretin solution. Therefore, such microspheres could be a viable strategy for the transdermal release of phloretin and subsequent protection from UV-induced skin damage.",
        "link": "http://dx.doi.org/10.3390/gels9030226"
    },
    {
        "id": 9321,
        "title": "Reply on RC1",
        "authors": "Ana Roberta Paulino",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/angeo-2023-23-ac1"
    },
    {
        "id": 9322,
        "title": "Hydrogel based on hyaluronic acid",
        "authors": "Roberta Cassano, Federica Curcio, Roberta Sole, Sonia Trombino",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-95351-1.00007-7"
    },
    {
        "id": 9323,
        "title": "Copyright Page",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.002.0004"
    },
    {
        "id": 9324,
        "title": "Roberta Kaplow, PhD, APRN-CCNS, AOCNS, CCRN, FAAN",
        "authors": "Roberta Kaplow",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jradnu.2023.03.007"
    },
    {
        "id": 9325,
        "title": "Zooplankton Taxa Repository of Ddttot and Sumpcb14: Seasonal and Decadal Variations in Lake Maggiore",
        "authors": "Roberta Piscia, Marina Manca, Rossana Caroni, Piero Guilizzoni, Roberta Bettinetti",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4485232"
    },
    {
        "id": 9326,
        "title": "VILA FLORES: UM PROCESSO ARQUITETÔNICO",
        "authors": "Roberta Krahe Edelweiss, Carlla Portal Volpatto, Roberta Donatti Casagrande",
        "published": "2019-7-4",
        "citations": 0,
        "abstract": "El artículo presenta una discusión sobre el proceso arquitectónico del Vila Flores, en Porto Alegre. A partir del entendimiento de los paradigmas que vienen de la contemporaneidad, el artículo, además de describir las transformaciones de Vila Flores a lo largo de la historia, identifica en el mismo concepto de código abierto, de operación de abajo hacia arriba y de organización sistémica. En conclusión, el artículo entiende el Vila Flores como un ejemplo de proceso arquitectónico pautado por las cuestiones impuestas por la contemporaneidad.",
        "link": "http://dx.doi.org/10.17981/mod.arq.cuc.22.1.2019.02"
    },
    {
        "id": 9327,
        "title": "Reply on RC2",
        "authors": "Ana Roberta Paulino",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/angeo-2023-23-ac2"
    },
    {
        "id": 9328,
        "title": "ENURESIS: ARE PUNISHMENTS USEFUL FOR TREATMENT AND FOR CHILD DEVELOPMENT?",
        "authors": "Pietro Ferrara, Roberta Autuori, Roberta ['Annamaria'], Giulia Franceschini, Giulia ['Rolando13'], Francesca Fiori Nastro, Diletta Saitta",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26226/morressier.5b5f433db56e9b005965b289"
    },
    {
        "id": 9329,
        "title": "Glastonbury Abbey",
        "authors": "Roberta Gilchrist",
        "published": "2022-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780415791182-rmeo55-1"
    },
    {
        "id": 9330,
        "title": "Walking Versus Jogging in Patients with Cardiac Problems Including Congestive Heart Failure by Rosalie Roberta Garcia",
        "authors": "Rosalie Roberta Garcia",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23880/nhij-16000124"
    },
    {
        "id": 9331,
        "title": "Chapter 7 Roberta Findlay’s Bronx Tale: Notes on Game of Survival",
        "authors": "Neil Jackson",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-012"
    },
    {
        "id": 9332,
        "title": "Acceptance of the 2023 Goldschmidt award by Roberta Rudnick",
        "authors": "Roberta L. Rudnick",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.gca.2023.10.002"
    },
    {
        "id": 9333,
        "title": "Introduction: Sleazy Honesty",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "This chapter offers an overview of Roberta Findlay’s career, tracking her from roots in a working-class Hungarian Jewish immigrant family, through 1960s sexploitation, 1970s hardcore, and 1980s horror film. It also examines previous scholarship on Findlay and emphasises the interpretive lens of her labour/work in building modern exploitation film.",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.003.0001"
    },
    {
        "id": 9334,
        "title": "Molecular characterisation of sinunasal carcinomas",
        "authors": "Roberta Castiglione",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26226/morressier.596dfd59d462b80292387c4b"
    },
    {
        "id": 9335,
        "title": "Reply to Reviewer 1",
        "authors": "Ana Roberta Paulino",
        "published": "2020-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/angeo-2020-34-ac1"
    },
    {
        "id": 9336,
        "title": "Mudança no sistema de contraste do português: entre codificação e inferenciação",
        "authors": "Sanderléia Roberta Roberta Longhin, Luísa Ferrari",
        "published": "2020-7-17",
        "citations": 0,
        "abstract": "Neste trabalho, investigamos dois fenômenos de mudança que contribuem para a renovação do sistema de contraste em português: as construções complexas com ‘enquanto (que)’ e com ‘agora’. Filiando-nos a uma abordagem de mudança de fundo cognitivo-pragmático (TRAUGOTT; DASHER, 2002), que opera com esquemas cognitivos e contextos de uso, nosso propósito é oferecer uma explicação para as mudanças que levaram à reinterpretação de tempo em termos de contraste. Assumindo que as mudanças envolvem uma fronteira flexível entre codificação e inferenciação, analisamos as fontes temporais, os contextos e o tipo de contraste, à luz de um protótipo de juntor contrastivo. Em viés diacrônico, os dados mostram construções que experimentam codificação crescente no tempo e, em viés sincrônico, a convivência de construções com graus variáveis de codificação e inferência.",
        "link": "http://dx.doi.org/10.25189/rabralin.v19i1.1399"
    },
    {
        "id": 9337,
        "title": "Notes on Contributors",
        "authors": "",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3366/edinburgh/9781474497466.002.0007"
    },
    {
        "id": 9338,
        "title": "Higher Education and Policy for Creative Economies in Africa",
        "authors": "Roberta Comunian, Brian J. Hracs, Lauren England",
        "published": "2020-11-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003127802"
    },
    {
        "id": 9339,
        "title": "Cylinder Test v1",
        "authors": "Sabina Marciano, Roberta Marongiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "The Cylinder test is used to evaluate locomotor asymmetry in rodent models  ",
        "link": "http://dx.doi.org/10.17504/protocols.io.81wgbxxpnlpk/v1"
    },
    {
        "id": 9340,
        "title": "Spinal cord demyelination in children: A diagnostic challenge in neuropaediatrics for a good outcome",
        "authors": "Roberta Battini, Giorgia Olivieri, Roberta Milone, Federica Mazio, Roberta Scalise, Tommaso Verdolotti, Guido Primiano, Orazio Genovese, Eugenio Mercuri, Serenella Servidei",
        "published": "2020-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.braindev.2020.03.001"
    },
    {
        "id": 9341,
        "title": "Il PMO 2.0 nell'ICT della PA: quale beneficio per gli Stakeholder?",
        "authors": "Roberta Grimaldi, Roberta Lotti, Antonella Serini",
        "published": "2018-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3280/pm2018-034005"
    },
    {
        "id": 9342,
        "title": "Synthetic Hemostatic Sealants: Effectiveness, Safety and In Vivo Applications",
        "authors": "Federica Curcio, Paolo Perri, Paolo Piro, Stefania Galassi, Roberta Sole, Sonia Trombino, Roberta Cassano",
        "published": "No Date",
        "citations": 0,
        "abstract": "Rapid haemostasis during surgery is essential when one wants to reduce the duration of opera-tions, reduce the need for transfusions, and above all when one wants to achieve better patient management. The use of haemostatic agents, sealants and adhesives improves the haemostatic process by offering several advantages, especially in vascular surgery. These agents vary widely in their mechanism of action, composition, ease of application, adhesion to wet or dry tissue, im-munogenicity and cost. The most used are cyanoacrylate-based glues (Glubran 2) or polysaccharide hydrogel-microsphere powder (AristaTMAH). This work is based on a retrospective study carried out on a sample of patients with different vascular diseases (FAV, pseudoaneurysm and PICC application) in which two different haemostatic sealants were used. The aim was to assess the safety, the advantages and the ability of both sealants to activate the haemostatic process at the affected site, also in relation to their chemical-physical characteristics. The obtained results showed that the application of Glubran 2 and AristaTMAH as surgical wound closure systems is effective and safe as the success achieved was ≥94% on anastomoses of FAV; 100% on stabilization of Picc catheters; ≤95% on pseudoaneurysms.",
        "link": "http://dx.doi.org/10.20944/preprints202312.2338.v1"
    },
    {
        "id": 9343,
        "title": "Reply to Reviewer 2",
        "authors": "Ana Roberta Paulino",
        "published": "2020-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/angeo-2020-34-ac2"
    },
    {
        "id": 9344,
        "title": "Bone cells in health and disease",
        "authors": "Roberta Besio, Roberta Gioia, Francesca Tonelli, Ilaria Ceppi, Laura Leoni, Linda Ofori Atta, Antonio Rossi, Antonella Forlino",
        "published": "2017-7-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1530/boneabs.6.is03"
    },
    {
        "id": 9345,
        "title": "OBSERVACIONAL PARA GARANTIA DA IDENTIFICAÇÃO CORRETA DO PACIENTE",
        "authors": "ROBERTA MARI DE OLIVEIRA PEREIRA, ROBERTA MARI DE OLIVEIRA PEREIRA",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17648/qualihosp-2019-111987"
    },
    {
        "id": 9346,
        "title": "Chapter 1 Singularity and Conformity: Feminism and Roberta Findlay’s Strategic Marketing Communications",
        "authors": "Finley Freibert",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-006"
    },
    {
        "id": 9347,
        "title": "Chapter 8 By the Numbers: Roberta Findlay, Home Video, and the Horror Genre",
        "authors": "Johnny Walker",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-013"
    },
    {
        "id": 9348,
        "title": "PESQUISAS MULTIDISCIPLINARES EM GERONTOLOGIA",
        "authors": "Roberta Machado ALVES",
        "published": "2020-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46898/rfb.9786558890614"
    },
    {
        "id": 9349,
        "title": "Challenging Beam Test v1",
        "authors": "Sabina Marciano, Roberta Marongiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "The challenging beam test is used to measure motor performance, coordination, and balance  ",
        "link": "http://dx.doi.org/10.17504/protocols.io.dm6gp33r5vzp/v1"
    },
    {
        "id": 9350,
        "title": "Glucose Tolerance Test v1",
        "authors": "Sabina Marciano, Roberta Marongiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "The glucose tolerance test is performed to determine how quickly the glucose is cleared from the blood. It is used to test for diabetes or insulin resistance.  ",
        "link": "http://dx.doi.org/10.17504/protocols.io.261geddodv47/v1"
    },
    {
        "id": 9351,
        "title": "GI Transit Assay v1",
        "authors": "Sabina Marciano, Roberta Marongiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "This test is used to check for possible signs of constipation and alteration in the gut transit  ",
        "link": "http://dx.doi.org/10.17504/protocols.io.eq2lyjj3mlx9/v1"
    },
    {
        "id": 9352,
        "title": "Additive Manufacturing Overview",
        "authors": "Zoe Crain, Roberta Beal",
        "published": "2018-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1441284"
    },
    {
        "id": 9353,
        "title": "Miniaturized analytical platform for cocaine detection in oral fluids by MicroNIR/Chemometrics",
        "authors": "Roberta Risoluti, Simona Pichini, Roberta Pacifici, Stefano Materazzi",
        "published": "2019-9",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.talanta.2019.04.081"
    },
    {
        "id": 9354,
        "title": "787 A CASE OF LEFT-DOMINANT ARRHYTHMOGENIC CARDIOMYOPATHY",
        "authors": "Paolo Marco Pietro Spissu, Silvia Maiani, Roberta Pittau, Roberta Montisci",
        "published": "2022-12-15",
        "citations": 0,
        "abstract": "Abstract\nThe case we present involves a 45-years-old male patient who presented to the Emergency Department of our Hospital complaining of epigastric increasing pain associated with nausea and vomiting since the previous afternoon. During night patient had a syncopal episode after having had the feeling of pounding heart at the moment he was having a diarrheal bowel movement. Blood test showed no HS-Troponin nor D-dimer increase. Consultant cardiologist decided to test patient with an exercise test that showed polymorphic ventricular ectopic beats thus leading to hospitalization in our Cardiology Unit.\nHere patient was asymptomatic and hemodynamically stable during the whole period. He underwent an echocardiography showing no abnormal findings. For this reason, our team decided to perform a Cardiac Magnetic Resonance that showed LGE at subepicardial level in mid-apical segment of inferior wall and apical segment of interventricular septum. What's more, “India ink artifact” as of intramyocardial adipose infiltration was evident.\nNot having made a final diagnosis we decided to implant a Loop Recorder and asked patient to wear a wearable cardiac defibrillator. Genetic testing was also ordered to search for common mutations involved in Arrhythmogenic cardiomyopathy. At discharge, a therapy with metoprolol 50 mg twice per day was prescribed.\nTwo months later, the result of genetics confirmed the diagnosis of Arrhythmogenic Cardiomyopathy with left ventricular involvement and the patient entered our Unit to undergo Implantable Cardioverter-Defibrillator (ICD) positioning for primary prevention of sudden cardiac death (SCD).\nArrhythmogenic Cardiomyopathy (AC) is a genetic heart muscle disorder whose main pathological feature is normal myocardial tissue replacement by fibrofatty scar tissue and clinical presentation with life-threatening ventricular arrhythmias associated or not with global or regional ventricular systolic dysfunction. Although it was firstly described a predominant right ventricle involvement, nowadays it is known the existence of biventricular and even left-dominant phenotype. Prevalence is estimated between 1:1000 and 1:5000. AC occurs all over the world but has an increased prevalence in Northeastern Italy area. Pathologically fibrofatty tissue replacement begins from the subepicardial layers of myocardium towards subendocardial to become transmural.\nDiagnosis is made following a scoring system firstly created in 1994, then revised in 2010 and again in 2020, when the so-called Padua criteria were proposed. They are divided in 6 different categories: morpho-functional ventricular abnormalities, structural myocardial abnormalities, repolarization and depolarization abnormalities, ventricular arrhythmias, genetics. Demonstration of mutation in left-dominant AC related genes is mandatory for diagnosis because clinical and imaging features are not specific for this condition.\nOur case demonstrates a challenging diagnosis of left-dominant AC with a perfect example of Padua criteria implementation, because our patient had structural myocardial abnormalities as LGE by CMR plus had a positive molecular genetic testing.",
        "link": "http://dx.doi.org/10.1093/eurheartjsupp/suac121.678"
    },
    {
        "id": 9355,
        "title": "Have we made progress with educational services for students with TBI?",
        "authors": "Roberta DePompei, Ann Glang",
        "published": "2018-4-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/nre-180001"
    },
    {
        "id": 9356,
        "title": "Assessing and mapping of land subsidence risk at different scales in major urban areas in Italy&amp;#160;",
        "authors": "Roberta Bonì, Francesca Cigna, Pietro Teatini, Roberta Paranunzio, Claudia Zoccarato",
        "published": "No Date",
        "citations": 0,
        "abstract": "High to very high susceptibility and hazard levels of land subsidence have been identified in several Italian regions: Emilia-Romagna and Veneto regions, where loss of land elevation up to 7 cm/year in the Po River Plain impacts 30% of the Italian population since the 1950s; Puglia, e.g. at Tavoliere Plain, with land subsidence up to 2 cm/year; the Florence-Prato-Pistoia Plain in Tuscany and the Volturno Plain in Campania, with more 2 cm/year; the Gioia Tauro Plain in Calabria with more than 1 cm/year.\nAssessing the contribution of urbanization and the growth in urban population to this process is still a challenging task.\nThe SubRISK+ project is aimed to provide new Earth observation-derived products and tools to improve the comprehension of current and future land subsidence in major urbanized areas of Italy. The project is funded by the European Union &#8211; Next Generation EU, in the framework of the Research Projects of Significant National Interest (PRIN) - National Recovery and Resilience Plan (PNRR) call 2022, and it is led by the National Research Council of Italy in Rome with the collaboration of the University School for Advanced Studies of Pavia and the University of Padua.\nIn particular, the risk associated to land subsidence will be investigated for the 15 metropolitan cities of Italy and the Emilia Romagna region by exploiting Copernicus&#8217; European Ground Motion Service (EGMS) data.\nSatellite-based Interferometric Synthetic Aperture Radar (InSAR) observations will be employed to map the current land subsidence and assess the potential induced damages to urban infrastructures.\nThen, a multidisciplinary approach incorporating geological, hydrogeological, geotechnical, land use data, and ground displacement observations will be implemented to disentangle the contribution of various processes and evaluate the associated triggers.\nThe activities will be performed across national, regional, and local scales. The use of advanced groundwater flow and geomechanics model for a &#8220;hotspot city&#8221; case study will allow to quantify the effects of groundwater exploitation and estimate uncertainties in land subsidence.\nMarket and non-market direct/indirect losses will be assessed at national, regional, and local scales via a newly developed socio-economic impact analysis, based on the exposure, vulnerability, and resilience of the investigated urbanized areas. Finally, future land subsidence risk scenarios will be estimated in the medium (2050) and long term (2100).",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-10558"
    },
    {
        "id": 9357,
        "title": "Prefazione",
        "authors": "Roberta Bartoletti",
        "published": "2021-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12977/ocula2021-4"
    },
    {
        "id": 9358,
        "title": "Science Breakthroughs 2030. Final report",
        "authors": "Roberta Schoen",
        "published": "2021-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1766565"
    },
    {
        "id": 9359,
        "title": "A Retrospective Longitudinal Study in a Cohort of Children With Dyskinetic Cerebral Palsy Treated With Tetrabenazine",
        "authors": "Roberta Scalise, Giuseppina Sgandurra, Valentina Menici, Nicola Capodagli, Roberta Di Pietro, Domenico M. Romeo, Francesca Sini, Emanuela Pagliano, Maria Foscan, Giovanni Cioni, Roberta Battini",
        "published": "2021-2-26",
        "citations": 4,
        "abstract": "Tetrabenazine has been studied with a variety of hyperkinetic movement disorders, but there is limited and empirical literature on the potential efficacy of tetrabenazine in children with dyskinetic cerebral palsy (DCP). The purpose of this study was to evaluate the efficacy of tetrabenazine in a sample of children with DCP using the Movement Disorders—Childhood Rating Scale 4–18 Revised (MD-CRS 4–18 R). The study is a multicenter retrospective longitudinal study in which the participants were selected from the databases of each Center involved, according to detailed inclusion criteria. The study was performed on 23 children and adolescents (19 male and 4 females; mean age 8.28 years, SD 3.59) with DCP having been evaluated before starting the treatment (baseline), after 6 and 12 months of treatment and in a sub-cohort after &gt;2 years follow-up. A linear mixed model was used to evaluate the effects of the different timings on each MD-CRS 4–18 R Index (Index I, Index II, and Global Index) adding age and type of movement disorder as random effect. A significant clinical improvement related to a reduction of MD-CRS 4-18 R Indexes was detected between the baseline and after 6 and 12 months of treatment. Findings support the efficacy of tetrabenazine in children with DCP through a standardized outcome measure (MD-CRS 4–18 R) and confirm the use of this scale as a suitable tool to detect changes in further randomized clinical trials.",
        "link": "http://dx.doi.org/10.3389/fneur.2021.612429"
    },
    {
        "id": 9360,
        "title": "Mediating Mindfulness-Based Interventions with Virtual Reality in Non-Clinical Populations: The State-of-the-Art",
        "authors": "Chiara Failla, Flavia Marino, Luca Bernardelli, Andrea Gaggioli, Germana Doria, Paola Chilà, Roberta Minutoli, Rita Mangano, Roberta Torrisi, Gennaro Tartarisco, Roberta Bruschetta, Francesco Arcuri, Antonio Cerasa, Giovanni Pioggia",
        "published": "2022-6-29",
        "citations": 9,
        "abstract": "Mindfulness is one of the most popular psychotherapeutic techniques that help to promote good mental and physical health. Combining mindfulness with immersive virtual reality (VR) has been proven to be especially effective for a wide range of mood disorders for which traditional mindfulness has proven valuable. However, the vast majority of immersive VR-enhanced mindfulness applications have focused on clinical settings, with little evidence on healthy subjects. This narrative review evaluates the real effectiveness of state-of-the-art mindfulness interventions mediated by VR systems in influencing mood and physiological status in non-clinical populations. Only studies with an RCT study design were considered. We conclude that most studies were characterized by one single meditation experience, which seemed sufficient to induce a significant reduction in negative mood states (anxiety, anger, depression, tension) combined with increased mindfulness skills. However, physiological correlates of mindfulness practices have scarcely been investigated. The application of VR-enhanced mindfulness-based interventions in non-clinical populations is in its infancy since most studies have several limitations, such as the poor employment of the RCT study design, the lack of physiological measurements (i.e., heart rate variability), as well as the high heterogeneity in demographical data, technological devices, and VR procedures. We thus concluded that before applying mindfulness interventions mediated by VR in clinical populations, more robust and reliable methodological procedures need to be defined.",
        "link": "http://dx.doi.org/10.3390/healthcare10071220"
    },
    {
        "id": 9361,
        "title": "HSPs/STAT3 Interplay Sustains DDR and Promotes Cytokine Release by Primary Effusion Lymphoma Cells",
        "authors": "Roberta Gonnella, Andrea Arena, Roberta Zarrella, Maria Saveria Gilardini Montani, Roberta Santarelli, Mara Cirone",
        "published": "2023-2-15",
        "citations": 4,
        "abstract": "Primary effusion lymphoma (PEL) is a rare and aggressive B-cell lymphoma, against which current therapies usually fail. In the present study, we show that targeting HSPs, such as HSP27, HSP70 and HSP90, could be an efficient strategy to reduce PEL cell survival, as it induces strong DNA damage, which correlated with an impairment of DDR. Moreover, as HSP27, HSP70 and HSP90 cross talk with STAT3, their inhibition results in STAT3 de-phosphorylation and. On the other hand, the inhibition of STAT3 may downregulate these HSPs. These findings suggest that targeting HSPs has important implications in cancer therapy, as it can reduce the release of cytokines by PEL cells, which, besides affecting their own survival, could negatively influence anti-cancer immune response.",
        "link": "http://dx.doi.org/10.3390/ijms24043933"
    },
    {
        "id": 9362,
        "title": "Chapter 2 “Not Even a Lesbian,” or Roberta Findlay’s Ambivalently Queer/ Feminist Hardcore Cinema",
        "authors": "Jennifer Moorman",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-007"
    },
    {
        "id": 9363,
        "title": "Factors that influence cooperation for innovation at an initial stage",
        "authors": "Joel Altenhofen, Roberta Saraiva Perdomo, Roberta Almeida Versiani, Dannyela da Cunha Lemos",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5935/2177-4153.20190030"
    },
    {
        "id": 9364,
        "title": "Treatments for Paraphilic Sexual Fantasies: A Systematic Review",
        "authors": "Roberta Galizia, Filippo M. Nimbi, Roberta Rossi, Chiara Simonelli",
        "published": "2022-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jsxm.2022.10.077"
    },
    {
        "id": 9365,
        "title": "Entre mélancolie et connaissance",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "Proust voyait dans la multiplicité des interprétations engendrée par la réception des œuvres littéraires, leur seule possibilité de survie dans le temps. Loin d’être un monument figé dans le temps, la Recherche ne cesse de résonner dans la parole de nouvelles générations, tout en se laissant explorer et renouveler par elles.\nCe livre offre une enquête inédite sur la postérité de Proust en Italie, en retraçant les parcours créatifs que son roman inspire chez de grands écrivains italiens – de Giorgio Bassani à Giuseppe Tomasi di Lampedusa, de Carlo Emilio Gadda à Alberto Moravia et Goffredo Parise – autant que les différentes lectures qu’ils en proposent. Dans ce parcours de comparatisme à la fois fécond et novateur dans sa méthodologie, c’est la Recherche elle-même qui suscite des interprétations inédites, tandis que ses nouveaux visages, encore inexplorés, surgissent à travers d’autres poétiques qu’il s’agira de mettre au jour.",
        "link": "http://dx.doi.org/10.3726/b18102"
    },
    {
        "id": 9366,
        "title": "Protest and Democracy",
        "authors": "",
        "published": "2019-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctvjf9x8c"
    },
    {
        "id": 9367,
        "title": "IVF outcome in Chinese versus Caucasian women",
        "authors": "Roberta Pasin",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26226/morressier.5af300b3738ab10027aa9a48"
    },
    {
        "id": 9368,
        "title": "The Politics of Verdi's Cantica",
        "authors": "Roberta Montemorra Marvin",
        "published": "2017-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315085555"
    },
    {
        "id": 9369,
        "title": "Fecal Water Content Assay v1",
        "authors": "Sabina Marciano, Roberta Marongiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "This test is used to check for signs of constipation  ",
        "link": "http://dx.doi.org/10.17504/protocols.io.kqdg3xx5zg25/v1"
    },
    {
        "id": 9370,
        "title": "Chapter 9 The Beginning and the End: Transitioning Careers and Roberta Findlay’s Banned (1989)",
        "authors": "Alexandra Heller-Nicholas",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474497480-014"
    },
    {
        "id": 9371,
        "title": "Anxiety",
        "authors": "Roberta Lee",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-35868-2.00006-2"
    },
    {
        "id": 9372,
        "title": "Human Behavior Theory",
        "authors": "Roberta R.Greene",
        "published": "2017-9-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351327527"
    },
    {
        "id": 9373,
        "title": "Major Concepts in Spanish Feminist Theory",
        "authors": "Roberta Johnson",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1353/book66245"
    },
    {
        "id": 9374,
        "title": "Treatments for Paraphilic Sexual Fantasies: A Systematic Review",
        "authors": "Roberta Galizia, Filippo M. Nimbi, Roberta Rossi, Chiara Simonelli",
        "published": "2022-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jsxm.2022.08.046"
    },
    {
        "id": 9375,
        "title": "Brain Metastasis from Unknown Primary Tumour: Moving from Old Retrospective Studies to Clinical Trials on Targeted Agents",
        "authors": "Roberta Balestrino, Roberta Rudà, Riccardo Soffietti",
        "published": "2020-11-12",
        "citations": 15,
        "abstract": "Brain metastases (BMs) are the most common intracranial tumours in adults and occur up to 3–10 times more frequently than primary brain tumours. BMs may be the cause of the neurological presenting symptoms in patients with otherwise previously undiagnosed cancer. In up to 15% of patients with BMs, the primary tumour cannot be identified. These cases are known as BM of cancer of unknown primary (CUP) (BM-CUP). CUP has an early and aggressive metastatic spread, poor response to chemotherapy, and poor prognosis. The pathogenesis of CUP seems to be characterized by a specific underlying pro-metastatic signature. The understanding of BM-CUP, despite its relative frequency and unfavourable outcome, is still incomplete and clear indications on management are missing. Advances in diagnostic tools, molecular characterization, and target therapy have shifted the paradigm in the approach to metastasis from CUP: while earlier studies stressed the importance of finding the primary tumour and deciding on treatment based on the primary diagnosis, most recent studies focus on the importance of identifying targetable molecular markers in the metastasis itself. The aim of this review is to summarize current evidence on BM-CUP, from the diagnosis and pathogenesis to the treatment, with a focus on available studies and ongoing clinical trials.",
        "link": "http://dx.doi.org/10.3390/cancers12113350"
    },
    {
        "id": 9376,
        "title": "HSP110 Inhibition in Primary Effusion Lymphoma Cells: One Molecule, Many Pro-Survival Targets",
        "authors": "Roberta Gonnella, Roberta Zarrella, Michele Di Crosta, Rossella Benedetti, Andrea Arena, Roberta Santarelli, Maria Saveria Gilardini Montani, Gabriella D’Orazi, Mara Cirone",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Heat shock proteins (HSPs) are highly expressed in cancer cells and represent a promising target in anti-cancer therapy. In this study, we investigated for the first time the expression of high-molecular-weight HSP110, belonging to the HSP70 family of proteins, in Primary Effusion Lymphoma (PEL) and explored its role in their survival. This is a rare lymphoma associated with KSHV, for which an effective therapy remains to be discovered. The results obtained from this study suggest that targeting HSP110 could be a very promising strategy against PEL, as its silencing induced lysosomal membrane permeabilization, the cleavage of BID, caspase 8 activation, downregulated c-Myc, and strongly impaired the HR and NHEJ DNA repair pathways, leading to apoptotic cell death. Since chemical inhibitors of this HSP are not commercially available yet, this study encourages a more intense search in this direction in order to discover a new potential treatment that is effective against this and likely other B cell lymphomas that are known to overexpress HSP110.",
        "link": "http://dx.doi.org/10.3390/cancers15235651"
    },
    {
        "id": 9377,
        "title": "Mechanisms of Sensitivity and Resistance of Primary Effusion Lymphoma to Dimethyl Fumarate (DMF)",
        "authors": "Roberta Gonnella, Roberta Zarrella, Roberta Santarelli, Concetta Anna Germano, Maria Saveria Gilardini Montani, Mara Cirone",
        "published": "2022-6-17",
        "citations": 8,
        "abstract": "PEL is a rare B cell lymphoma associated with KSHV that mainly arises in immune-deficient individuals. The search for new drugs to treat this cancer is still ongoing given its aggressiveness and the poor response to chemotherapies. In this study, we found that DMF, a drug known for its anti-inflammatory properties which is registered for the treatment of psoriasis and relapsing–remitting MS, could be a promising therapeutic strategy against PEL. Indeed, although some mechanisms of resistance were induced, DMF activated NRF2, reduced ROS and inhibited the phosphorylation of STAT3 and the release of the pro-inflammatory and immune suppressive cytokines IL-6 and IL-10, which are known to sustain PEL survival. Interestingly, we observed that DMF displayed a stronger cytotoxic effect against fresh PEL cells in comparison to PEL cell lines, due to the activation of ERK1/2 and autophagy in the latter cells. This finding further encourages the possibility of using DMF for the treatment of PEL.",
        "link": "http://dx.doi.org/10.3390/ijms23126773"
    },
    {
        "id": 9378,
        "title": "Compassion",
        "authors": "Roberta de Monticelli",
        "published": "2019-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3917/puf.origg.2019.01.0100"
    },
    {
        "id": 9379,
        "title": "Spatial demonstratives in brain and behavior",
        "authors": "Roberta Rocca",
        "published": "No Date",
        "citations": 0,
        "abstract": "The vast majority of everyday social practices involves a form of joint interaction with the environment which relies on establishing a shared attentional focus (Tomasello, Carpenter, Call, Behne, &amp; Moll, 2005).  Languages mediate humans’ ability to coordinate attention via a specific class of words: spatial demonstratives. Words like the pronouns “this” or “that”, or the adverbs “here” and “there” are among the few undisputed language universals (Diessel, 1999, 2014). They are developmental (Capirci, Iverson, Pizzuto, &amp; Volterra, 1996) and evolutionary (Diessel, 2006; 2013) cornerstones of language, and they are among the most frequent words in the lexicon (Leech &amp; Rayson, 2014).  Demonstratives are deictic expressions (from Ancient Greek deixis, “demonstration, indication”). They can in principle be used to indicate any object, and their meaning depends on the context of utterance (H. H. Clark &amp; Bangerter, 2004; Diessel, 1999; S. C. Levinson, 1983a, 2004). Identifying their referent thus hinges on the availability of information on the perceptual context (which objects are perceptually available), multimodal cues (pointing gestures, gaze; Clark &amp; Bangerter, 2004; Cooperrider, 2016; García, Ehlers, &amp; Tylén, 2017; Stevens &amp; Zhang, 2013), expectations (which objects are relevant for the present interaction; what the speaker may intend to refer to; Clark, 1996; Levinson, 1983) and cues provided by the use of specific demonstrative forms (e.g. a proximal “this” vs. a distal “that”). Yet, in spite of their semantically underspecified nature, these expressions function as powerful and effective coordination devices for social interaction.  But what are the neural and cognitive mechanisms that enable the integration of linguistic, perceptual and pragmatic information required for the comprehension of demonstratives? Which cues on the intended referent does the use of proximal versus distal demonstrative forms actually provide? And finally, how can demonstratives function as effective tools for social interaction, in spite of their semantic vagueness? In the present thesis, I report three studies where these questions were addressed using novel experimental paradigms.  The results of the three studies provide novel insights on the neural and cognitive underpinnings of demonstratives, as well as their key function in social interaction. However, their scope goes beyond an understanding of demonstratives per se. First, knowledge on the neural substrates of spatial demonstratives is informative with respect to the bigger question of how the brain extracts meaning from linguistic input. Secondly, our findings provide general insights on the relationship between language processing and extralinguistic cognition, highlighting its tight link to perception and attention (Article 1), to functional, action-oriented representations of the physical world (Article 2), and the role of partner-oriented adaptations of language use in successful social coordination (Article 3). Finally, this dissertation contributes to the development of new experimental methods for further research using demonstratives as a searchlight into core aspects of human cognition, and it outlines concrete suggestions in this direction.",
        "link": "http://dx.doi.org/10.31234/osf.io/fwsg5"
    },
    {
        "id": 9380,
        "title": "A systematic error affecting NER calculations",
        "authors": "Roberta Mulford",
        "published": "2018-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1440421"
    },
    {
        "id": 9381,
        "title": "Factors Predicting the Intention of Eating an Insect-Based Product",
        "authors": "Simone Mancini, Giovanni Sogari, Davide Menozzi, Roberta Nuvoloni, Beatrice Torracca, Roberta Moruzzo, Gisella Paci",
        "published": "2019-7-19",
        "citations": 115,
        "abstract": "This study provides a framework of the factors predicting the intention of eating an insect-based product. As part of the study, a seminar was carried out to explore how the provision of information about ecological, health, and gastronomic aspects of entomophagy would modify consumer beliefs regarding insects as food. Before and after the informative seminar, two questionnaires about sociodemographic attributes and beliefs about the consumption of insects as food were given. Participants were then asked to carry out a sensory evaluation of two identical bread samples, but one was claimed to be supplemented with insect powder. Results showed that perceived behavioral control is the main predictor of the intention, followed by neophobia and personal insect food rejection. The disgust factor significantly decreased after the participants attended the informative seminar. Sensory scores highlighted that participants gave “insect-labelled” samples higher scores for flavor, texture, and overall liking, nevertheless, participants indicated that they were less likely to use the “insect-labelled” bread in the future. Our findings provide a better understanding of insect food rejection behavior and help to predict the willingness to try insect-based products based on some important individual traits and information.",
        "link": "http://dx.doi.org/10.3390/foods8070270"
    },
    {
        "id": 9382,
        "title": "Decolonising Poetics. Paul Carter Talks to Roberta Trapè\n Interview Conducted by Email in June 2021",
        "authors": "Roberta Trapè",
        "published": "2021-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30687/tol/2499-5975/2021/23/032"
    },
    {
        "id": 9383,
        "title": "Underground Built Heritage and Food Production: From the Theoretical Approach to a Case/Study of Traditional Italian “Cave Cheeses”",
        "authors": "Roberta Varriale, Roberta Ciaravino",
        "published": "2022-7-26",
        "citations": 1,
        "abstract": "Throughout history, the natural perishability of food and its inconstant supply over the year have influenced family diets and local food traditions worldwide. These critical issues have been managed in two very different ways: by preserving raw foodstuffs, or by processing them. Underground spaces have often been used for both purposes. Their use for the preservation or processing of foods is a case of successful adaptation of local skills and technologies to the management of local resources and environmental conflicts. This paper, after proposing a methodological approach for elements included in the function “food” of the new-born Underground Built Heritage (UBH) class, lists the main characteristics of three different types of artefacts falling within this category: iceboxes, cellars, and traditional food production. For each group, several examples from all over the world are presented. After this overview, the paper turns to a case study of Italian production of cheese in caves and the general level of protection guaranteed by the current European and Italian legislation to the connection between given food specialities and the UBH used in their production. After introducing the general context, the article analyses the production of traditional Italian “cave cheeses” in detail, with particular reference to Taleggio, Fossa di Sogliano, Canestrato di Moliteno, Pallone di Gravina, and Grotte del Caglieron cheeses, in order to determine how and whether UBH is included in dedicated marketing strategies such as the choice of a product’s logo and the product’s branding and storytelling.",
        "link": "http://dx.doi.org/10.3390/heritage5030097"
    }
]