[
    {
        "id": 3905,
        "title": "VC dimensions of group convolutional neural networks",
        "authors": "Philipp Christian Petersen, Anna Sepliarskaia",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.012"
    },
    {
        "id": 3906,
        "title": "Logarithmic Learning Differential Convolutional Neural Network",
        "authors": "Magombe Yasin, Mehmet Sarıgül, Mutlu Avci",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106114"
    },
    {
        "id": 3907,
        "title": "HybridBranchNet: A novel structure for branch hybrid convolutional neural networks architecture",
        "authors": "Ebrahim Parcham, Mansoor Fateh",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.025"
    },
    {
        "id": 3908,
        "title": "Approximation bounds for convolutional neural networks in operator learning",
        "authors": "Nicola Rares Franco, Stefania Fresca, Andrea Manzoni, Paolo Zunino",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.029"
    },
    {
        "id": 3909,
        "title": "Convolutional and LSTM Neural Networks for Solar Power Forecasting",
        "authors": "Gavin Fungtammasan, Irena Koprinska",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191813"
    },
    {
        "id": 3910,
        "title": "Reduced-complexity Convolutional Neural Network in the compressed domain",
        "authors": "Hamdan Abdellatef, Lina J. Karam",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.020"
    },
    {
        "id": 3911,
        "title": "Creating Deep Convolutional Neural Networks for Image Classification",
        "authors": "Nabeel Siddiqui",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "\n            This lesson provides a beginner-friendly introduction to convolutional neural networks (CNNs) for image classification. The tutorial provides a conceptual understanding of how neural networks work by using Google's Teachable Machine to train a model on paintings from the ArtUK database. This lesson also demonstrates how to use Javascript to embed the model in a live website.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.46430/phen0108"
    },
    {
        "id": 3912,
        "title": "Convolutional Neural Networks Do Work with Pre-Defined Filters",
        "authors": "Christoph Linse, Erhardt Barth, Thomas Martinetz",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191449"
    },
    {
        "id": 3913,
        "title": "Cardiac Arrhythmia Classification in Electrocardiogram Signals with Convolutional Neural Networks",
        "authors": "Igor Souza, Daniel Dantas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011682800003411"
    },
    {
        "id": 3914,
        "title": "PSE-Net: Channel pruning for Convolutional Neural Networks with parallel-subnets estimator",
        "authors": "Shiguang Wang, Tao Xie, Haijun Liu, Xingcheng Zhang, Jian Cheng",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106263"
    },
    {
        "id": 3915,
        "title": "Efficient and accurate compound scaling for convolutional neural networks",
        "authors": "Chengmin Lin, Pengfei Yang, Quan Wang, Zeyu Qiu, Wenkai Lv, Zhenyi Wang",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.053"
    },
    {
        "id": 3916,
        "title": "A novel feature-scrambling approach reveals the capacity of convolutional neural networks to learn spatial relations",
        "authors": "Amr Farahat, Felix Effenberger, Martin Vinck",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.021"
    },
    {
        "id": 3917,
        "title": "Image-based time series forecasting: A deep convolutional neural network approach",
        "authors": "Artemios-Anargyros Semenoglou, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.006"
    },
    {
        "id": 3918,
        "title": "Foreground segmentation network using transposed convolutional neural networks and up sampling for multiscale feature encoding",
        "authors": "Vishruth B. Gowda, M.T. Gopalakrishna, J. Megha, Shilpa Mohankumar",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.015"
    },
    {
        "id": 3919,
        "title": "Multi-relational graph convolutional networks: Generalization guarantees and experiments",
        "authors": "Xutao Li, Michael K. Ng, Guangning Xu, Andy Yip",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.044"
    },
    {
        "id": 3920,
        "title": "Filter pruning for convolutional neural networks in semantic image segmentation",
        "authors": "Clara I. López-González, Esther Gascó, Fredy Barrientos-Espillco, Eva Besada-Portas, Gonzalo Pajares",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.010"
    },
    {
        "id": 3921,
        "title": "Improvement in Alzheimer's Disease MRI Images Analysis by Convolutional Neural Networks Via Topological Optimization",
        "authors": "",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "This research underscores the efficacy of Fourier topological optimization in refining MRI imagery, thereby bolstering the classification precision of Alzheimer's Disease through convolutional neural networks (CNNs). Recognizing that MRI scans are indispensable for neurological assessments, but frequently grapple with issues like blurriness and contrast irregularities, the deployment of Fourier topological optimization offered enhanced delineation of brain structures, ameliorated noise, and superior contrast. The applied techniques prioritized boundary enhancement, contrast and brightness adjustments, and overall image lucidity. Employing CNN architectures—VGG16, ResNet50, InceptionV3, and Xception—the post-optimization analysis revealed a marked elevation in performance. Prior to optimization, accuracy rates for 10 and 20 epochs stood at 38.19% and 74.255% respectively; these surged to 78.16% and 88.66% post-optimization. Moreover, balanced accuracy witnessed a leap from 78.16% to 88.13%, paralleled by an escalation in the Matthews correlation coefficient from 74.98% to 85.43%. A meticulous examination of the 20-epoch CNN training post MRI image enhancement disclosed a salient advancement in the Moderate-Demented category, with 393 accurate classifications. Conclusively, the amalgamation of Fourier topological optimization with CNNs delineates a promising trajectory for the nuanced classification of Alzheimer's Disease, portending a transformative impact on its diagnostic paradigms",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/eoa.01.04.05"
    },
    {
        "id": 3922,
        "title": "Stereoscopic scalable quantum convolutional neural networks",
        "authors": "Hankyul Baek, Won Joon Yun, Soohyun Park, Joongheon Kim",
        "published": "2023-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.027"
    },
    {
        "id": 3923,
        "title": "Connections Between Pairs of Filters Improve the Accuracy of Convolutional Neural Networks",
        "authors": "Kathleen Anderson, Philipp Grüning, Erhardt Barth",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191082"
    },
    {
        "id": 3924,
        "title": "TCGAN: Convolutional Generative Adversarial Network for time series classification and clustering",
        "authors": "Fanling Huang, Yangdong Deng",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.033"
    },
    {
        "id": 3925,
        "title": "Corrigendum to “Lower and upper bounds for numbers of linear regions of graph convolutional networks” [Neural Networks Volume 168, November 2023, Pages 394–404]",
        "authors": "Hao Chen, Yu Guang Wang, Huan Xiong",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.061"
    },
    {
        "id": 3926,
        "title": "A survey on cancer detection via convolutional neural networks: Current challenges and future directions",
        "authors": "Pallabi Sharma, Deepak Ranjan Nayak, Bunil Kumar Balabantaray, M. Tanveer, Rajashree Nayak",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.006"
    },
    {
        "id": 3927,
        "title": "Alzheimer’s Disease Classification via Convolutional Neural Networks",
        "authors": "",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17756/nwj.2023-s4-094"
    },
    {
        "id": 3928,
        "title": "Implementation of an Object Detection System using Convolutional Neural Networks",
        "authors": "P. Divakar, V. Pavani",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0769"
    },
    {
        "id": 3929,
        "title": "Speech to Text Recognition for Videogame Controlling with Convolutional Neural Networks",
        "authors": "Joaquin Aguirre-Peralta, Marek Rivas-Zavala, Willy Ugarte",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011782900003411"
    },
    {
        "id": 3930,
        "title": "Real-Time Face Recognition System with Fine-tune Convolutional Neural Networks",
        "authors": "",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.8.nq221055"
    },
    {
        "id": 3931,
        "title": "A Performance Study: Convolutional Deep Belief Networks and Convolutional Neural Networks for Audio Classification",
        "authors": "Maharshi Patel, Aaditya Darakh",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csitss60515.2023.10334214"
    },
    {
        "id": 3932,
        "title": "Self-supervised Learning for DNA sequences with circular dilated convolutional networks",
        "authors": "Lei Cheng, Tong Yu, Ruslan Khalitov, Zhirong Yang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.12.002"
    },
    {
        "id": 3933,
        "title": "Night Fatigue Driving Detection Technology Using Infrared Images and Convolutional Neural Networks",
        "authors": "Huei-Yung Lin, Kai-Chun Tu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011847400003479"
    },
    {
        "id": 3934,
        "title": "Convolutional Neural Networks: A Survey",
        "authors": "Moez Krichen",
        "published": "2023-7-28",
        "citations": 75,
        "abstract": "Artificial intelligence (AI) has become a cornerstone of modern technology, revolutionizing industries from healthcare to finance. Convolutional neural networks (CNNs) are a subset of AI that have emerged as a powerful tool for various tasks including image recognition, speech recognition, natural language processing (NLP), and even in the field of genomics, where they have been utilized to classify DNA sequences. This paper provides a comprehensive overview of CNNs and their applications in image recognition tasks. It first introduces the fundamentals of CNNs, including the layers of CNNs, convolution operation (Conv_Op), Feat_Maps, activation functions (Activ_Func), and training methods. It then discusses several popular CNN architectures such as LeNet, AlexNet, VGG, ResNet, and InceptionNet, and compares their performance. It also examines when to use CNNs, their advantages and limitations, and provides recommendations for developers and data scientists, including preprocessing the data, choosing appropriate hyperparameters (Hyper_Param), and evaluating model performance. It further explores the existing platforms and libraries for CNNs such as TensorFlow, Keras, PyTorch, Caffe, and MXNet, and compares their features and functionalities. Moreover, it estimates the cost of using CNNs and discusses potential cost-saving strategies. Finally, it reviews recent developments in CNNs, including attention mechanisms, capsule networks, transfer learning, adversarial training, quantization and compression, and enhancing the reliability and efficiency of CNNs through formal methods. The paper is concluded by summarizing the key takeaways and discussing the future directions of CNN research and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12080151"
    },
    {
        "id": 3935,
        "title": "Applying Convolutional Neural Networks to data on unstructured meshes with space-filling curves",
        "authors": "Claire E. Heaney, Yuling Li, Omar K. Matar, Christopher C. Pain",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106198"
    },
    {
        "id": 3936,
        "title": "Noise Removal from the Image Using Convolutional Neural Networks-Based Denoising Auto Encoder",
        "authors": "Younus FAROOQ, Serkan SAVAŞ",
        "published": "2024-3-10",
        "citations": 0,
        "abstract": "With the exponential growth in the volume of digital images captured daily, there is an escalating demand for elevating image quality to achieve both accuracy and visual appeal. Addressing this need, the development of techniques for reducing image noise while preserving crucial features, such as edges, corners, and sharp structures, has become imperative. This paper delves into the significance of image denoising and introduces a novel approach utilizing a denoising autoencoder based on convolutional neural networks (CNNs). The proposed method adopts a meticulous two-step process to effectively eliminate noise. Initially, input images are segregated into training and testing sets. Subsequently, a denoising autoencoder model is trained using the designated training data. This model is then further refined through training on a CNN, enhancing its noise reduction capabilities. The evaluation of the system's performance is conducted using testing data to gauge its effectiveness. The study employs the MATLAB programming language for implementation and evaluation. Results, measured through RMSE (Root Mean Square Error) and PSNR (Peak Signal-to-Noise Ratio) criteria on two distinct datasets—the Covid19-radiography-database and SIIM-medical-images—reveal that our proposed method outperforms existing approaches significantly. This approach is particularly promising for applications demanding enhanced image quality, such as the resolution enhancement of medical images. The study contributes to the ongoing efforts in noise reduction research, offering a robust solution for improving visual perception in diverse image processing applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57020/ject.1390428"
    },
    {
        "id": 3937,
        "title": "Different Types of Neural Networks and Applications: Evidence from Feedforward, Convolutional and Recurrent Neural Networks",
        "authors": "Yumin Pan",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Neural networks have achieved great process in the 90 years since they were officially introduced in 1943. Because of its wide application and huge research and development potential, this technology attracts more and more scientific and technological workers to the research of neural networks. Neural network technology is an essential component of AI development, and it is a significant indicator of a country's overall strength. In this paper, this study will demonstrate Feedforward Neural Network, Convolution Neural Network and Recurrent Neural networks and evaluate them through datasets from kaggle.com. and CSDN (China IT community). Through this paper, readers can have a better outlook and understanding of the operating principles of each type of neural network as well as their specific jobs (what kind of jobs they specialized in) and each application of these neural networks. So that this paper can promote readers' thoughts and help them start learning neural networks or be a supplement or reference for future scholars. In the end, this paper will present the outcome, which is the evaluation of the accuracy, loss curve, and accuracy curve of neural networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/6rn1wd81"
    },
    {
        "id": 3938,
        "title": "Convolutional Neural Networks: An Analysis of Varying Factors",
        "authors": "Brixx-John Garcia Panlaqui, Debzani Deb",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/southeastcon51012.2023.10115075"
    },
    {
        "id": 3939,
        "title": "Graph Convolutional Networks Based Standard Essential Patents Identification",
        "authors": "Weidong Liu, Rui Li, Wei Tang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191321"
    },
    {
        "id": 3940,
        "title": "Quantum Convolutional Neural Network Architecture for Multi-Class Classification",
        "authors": "Samarth Kashyap, Shayan Srinivasa Garani",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191561"
    },
    {
        "id": 3941,
        "title": "An Automatic Ant Counting and Distribution Estimation System Using Convolutional Neural Networks",
        "authors": "Mateus Silva, Breno Felisberto, Mateus Batista, Andrea Bianchi, Servio Ribeiro, Ricardo Oliveira",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011968900003467"
    },
    {
        "id": 3942,
        "title": "Spiral Drawing Test and Explainable Convolutional Neural Networks for Parkinson’s Disease Detection",
        "authors": "Francesco Mercaldo, Luca Brunese, Mario Cesarelli, Fabio Martinelli, Antonella Santone",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012407100003636"
    },
    {
        "id": 3943,
        "title": "Using a Genetic Algorithm to Update Convolutional Neural Networks for Abnormality Classification in Mammography",
        "authors": "Steven Wessels, Dustin van der Haar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011648500003411"
    },
    {
        "id": 3944,
        "title": "Layered Batch Inference Optimization Method for Convolutional Neural Networks Based on CPU",
        "authors": "Hongzhi Zhao, Xun Liu, Jingzhen Zheng, Jingjing He",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012277100003807"
    },
    {
        "id": 3945,
        "title": "Robust Drone Detection and Classification from Radio Frequency Signals Using Convolutional Neural Networks",
        "authors": "Stefan Glüge, Matthias Nyfeler, Nicola Ramagnano, Claus Horn, Christof Schüpbach",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012176800003595"
    },
    {
        "id": 3946,
        "title": "Classification of coma etiology using convolutional neural networks and long-short term memory networks",
        "authors": "Sérgio Baldo Júnior, Murillo G. Carneiro, João-Batista Destro-Filho, Liang Zhao, Renato Tinós",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191203"
    },
    {
        "id": 3947,
        "title": "Siamese Neural Networks for Kinship Prediction: A Deep Convolutional Neural Network Approach",
        "authors": "Tukaram Navghare,  , Aniket Muley, Vinayak Jadhav",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i4.3018"
    },
    {
        "id": 3948,
        "title": "Understanding of Feature Representation in Convolutional Neural Networks and Vision Transformer",
        "authors": "Hiroaki Minoura, Tsubasa Hirakawa, Takayoshi Yamashita, Hironobu Fujiyoshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011621300003417"
    },
    {
        "id": 3949,
        "title": "On-Board Estimation of Vehicle Speed and the Need of Braking Using Convolutional Neural Networks",
        "authors": "Razvan Itu, Radu Danescu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012163800003543"
    },
    {
        "id": 3950,
        "title": "Spectral Graph Convolutional Neural Networks in the Context of Regularization Theory",
        "authors": "Asif Salim, S. Sumitra",
        "published": "2024-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3177742"
    },
    {
        "id": 3951,
        "title": "CONVOLUTIONAL NEURAL NETWORKS FOR SOLVING COMPUTER VISION PROBLEMS",
        "authors": "Anatoly Sayfutdinov",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32743/unitech.2023.115.10.16127"
    },
    {
        "id": 3952,
        "title": "An Efficient Backbone for Early Forest Fire Detection Based on Convolutional Neural Networks",
        "authors": "Deepamoni Mahanta, Deepika Hazarika, Vijay Kumar Nath",
        "published": "2023-9",
        "citations": 0,
        "abstract": "Forest fires cause disastrous damage to both human life and ecosystem. Therefore, it is essential to detect forest fires in the early stage to reduce the damage. Convolutional Neural Networks (CNNs) are widely used for forest fire detection. This paper proposes a new backbone network for a CNN-based forest fire detection model. The proposed backbone network can detect the plumes of smoke well by decomposing the conventional convolution into depth-wise and coordinate ones to better extract information from objects that spread along the vertical dimension. Experimental results show that the proposed backbone network outperforms other popular ones by achieving a detection accuracy of up to 52.6 AP.1",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/joig.11.3.227-232"
    },
    {
        "id": 3953,
        "title": "Exploring the role of texture features in deep convolutional neural networks: Insights from Portilla-Simoncelli statistics",
        "authors": "Yusuke Hamano, Shoko Nagasaka, Hayaru Shouno",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.028"
    },
    {
        "id": 3954,
        "title": "Brain Tumor Segmentation of Lower-Grade Glioma Across MRI Images Using Hybrid Convolutional Neural Networks",
        "authors": "Amal Jlassi, Khaoula ElBedoui, Walid Barhoumi",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011895900003393"
    },
    {
        "id": 3955,
        "title": "Retracted: Improving Convolutional Neural Networks with Competitive Activation Function",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9761609"
    },
    {
        "id": 3956,
        "title": "Convolutional Neural Networks with Neural Memory Ordinary Differential Equations",
        "authors": "Yixuan Liu, Yuanyuan Chen",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csis-iac60628.2023.10364241"
    },
    {
        "id": 3957,
        "title": "Use of artificial neural networks in architecture: determining the architectural style of a building with a convolutional neural networks",
        "authors": "Ece Cantemir, Ozlem Kandemir",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractThe discussion of \"can machines think?\" which started with the invention of the modern computer, brought along the question of \"can machines design?\" by researchers in the design field. These developments in information technologies have also affected the architecture. Artificial intelligence applications are encountered in many areas such as pricing estimation, energy conservation security systems of buildings, ventilation systems, user-oriented interactive design solutions, computer-aided programs used in the plan production phase and design process. When the literature on artificial intelligence applications in the architecture is reviewed, it can be seen that it generally includes shape grammars, graph theory, decision trees, constraint-based models, machine learning methods, RNN (Recursive Neural Networks), CNN (Convolutional Neural Network) and GAN (Generative Adversarial Network) algorithms. In this study, the use of artificial intelligence algorithms in architecture was examined, and an example was designed to determine the architectural structures of different periods by using CNN (Convolutional Neural Network). In the study, the open source TensorFlow library developed by Google and the Python programming language were used. Employing a statistical approach and utilizing convolutional neural networks (CNNs), a study has successfully classified the current flow patterns of buildings based on datasets comprising facades of Gothic, Modern, and Deconstructivist architectural styles. The findings demonstrate the efficacy of CNNs in accurately distinguishing the intricate details of diverse architectural styles. Recognizing elements from different periods using the CNN algorithm can examine not only individual buildings but also the relationship of buildings with their environments. It can also gain an important place in the field of conservation of the architectural discipline. The historical processes, aesthetic features and changes of protected buildings can be learned with the CNN algorithm and can guide restoration decisions. As a result of the study, the employed CNN-based model can correctly classify structures with 84.66% accuracy rate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-09395-y"
    },
    {
        "id": 3958,
        "title": "Revisiting multi-view learning: A perspective of implicitly heterogeneous Graph Convolutional Network",
        "authors": "Ying Zou, Zihan Fang, Zhihao Wu, Chenghui Zheng, Shiping Wang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.052"
    },
    {
        "id": 3959,
        "title": "Node-personalized multi-graph convolutional networks for recommendation",
        "authors": "Tiantian Zhou, Hailiang Ye, Feilong Cao",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106169"
    },
    {
        "id": 3960,
        "title": "Railway Infrastructure Instance Segmentation Based on Convolutional Neural Networks",
        "authors": "V. A. Fedorov",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rusautocon58002.2023.10272908"
    },
    {
        "id": 3961,
        "title": "Evaluating the Use of Interpretable Quantized Convolutional Neural Networks for Resource-Constrained Deployment",
        "authors": "Harry Rogers, Beatriz De La Iglesia, Tahmina Zebin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012231900003598"
    },
    {
        "id": 3962,
        "title": "Pixel-Wise Gradient Uncertainty for Convolutional Neural Networks Applied to Out-of-Distribution Segmentation",
        "authors": "Kira Maag, Tobias Riedlinger",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012353300003660"
    },
    {
        "id": 3963,
        "title": "Lower and upper bounds for numbers of linear regions of graph convolutional networks",
        "authors": "Hao Chen, Yu Guang Wang, Huan Xiong",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.025"
    },
    {
        "id": 3964,
        "title": "Learning Korobov Functions by Correntropy and Convolutional Neural Networks",
        "authors": "Zhiying Fang, Tong Mao, Jun Fan",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "Abstract\nCombining information-theoretic learning with deep learning has gained significant attention in recent years, as it offers a promising approach to tackle the challenges posed by big data. However, the theoretical understanding of convolutional structures, which are vital to many structured deep learning models, remains incomplete. To partially bridge this gap, this letter aims to develop generalization analysis for deep convolutional neural network (CNN) algorithms using learning theory. Specifically, we focus on investigating robust regression using correntropy-induced loss functions derived from information-theoretic learning. Our analysis demonstrates an explicit convergence rate for deep CNN-based robust regression algorithms when the target function resides in the Korobov space. This study sheds light on the theoretical underpinnings of CNNs and provides a framework for understanding their performance and limitations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/neco_a_01650"
    },
    {
        "id": 3965,
        "title": "An Deep Convolutional Neural Networks are used to Detect Cyberbullying on Social Networks.",
        "authors": "B.S. Rawat",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353375"
    },
    {
        "id": 3966,
        "title": "Just a Matter of Scale? Reevaluating Scale Equivariance in Convolutional Neural Networks",
        "authors": "Thomas Altstidl, An Nguyen, Leo Schwinn, Franz Köferl, Christopher Mutschler, Björn Eskofier, Dario Zanca",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191724"
    },
    {
        "id": 3967,
        "title": "Multi-atlas Graph Convolutional Networks and Convolutional Recurrent Neural Networks-Based Ensemble Learning for Classification of Autism Spectrum Disorders",
        "authors": "Manjunath Ramanna Lamani, P. Julian Benadit, Krishnakumar Vaithinathan",
        "published": "2023-2-17",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-022-01617-9"
    },
    {
        "id": 3968,
        "title": "Application of Graph Convolutional Neural Networks Combined with Single-Model Decision-Making Fusion Neural Networks in Structural Damage Recognition",
        "authors": "Xiaofei Li, Langxing Xu, Hainan Guo, Lu Yang",
        "published": "2023-11-22",
        "citations": 1,
        "abstract": "In cases with a large number of sensors and complex spatial distribution, correctly learning the spatial characteristics of the sensors is vital for structural damage identification. Graph convolutional neural networks (GCNs), unlike other methods, have the ability to learn the spatial characteristics of the sensors, which is targeted at the above problems in structural damage identification. However, under the influence of environmental interference, sensor instability, and other factors, part of the vibration signal can easily change its fundamental characteristics, and there is a possibility of misjudging structural damage. Therefore, on the basis of building a high-performance graphical convolutional deep learning model, this paper considers the integration of data fusion technology in the model decision-making layer and proposes a single-model decision-making fusion neural network (S_DFNN) model. Through experiments involving the frame model and the self-designed cable-stayed bridge model, it is concluded that this method has a better performance of damage recognition for different structures, and the accuracy is improved based on a single model and has good damage recognition performance. The method has better damage identification performance in different structures, and the accuracy rate is improved based on the single model, which has a very good damage identification effect. It proves that the structural damage diagnosis method proposed in this paper with data fusion technology combined with deep learning has a strong generalization ability and has great potential in structural damage diagnosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23239327"
    },
    {
        "id": 3969,
        "title": "The role of capacity constraints in Convolutional Neural Networks for learning random versus natural data",
        "authors": "Christian Tsvetkov, Gaurav Malhotra, Benjamin D. Evans, Jeffrey S. Bowers",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.01.011"
    },
    {
        "id": 3970,
        "title": "Detection of Malaria Infection Using Convolutional Neural Networks",
        "authors": "Farah Sherif, Ammar Mohammed",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imsa58542.2023.10217455"
    },
    {
        "id": 3971,
        "title": "Audioset classification with Graph Convolutional Attention model",
        "authors": "Xuliang Li, Junbin Gao",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191960"
    },
    {
        "id": 3972,
        "title": "Implementation Challenges and Strategies for Hebbian Learning in Convolutional Neural Networks",
        "authors": "A. V. Demidovskij, M. S. Kazyulina, I. G. Salnikov, A. M. Tugaryov, A. I. Trutnev, S. V. Pavlov",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23060048"
    },
    {
        "id": 3973,
        "title": "Recognition of Mentally Pronounced Russian Phonemes Using Convolutional Neural Networks and Electroencephalography Data",
        "authors": "L. E. Seleznyev, A. A. Chupakhin, V. A. Kostenko, A. O. Shevchenko, A. V. Vartanov",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020066"
    },
    {
        "id": 3974,
        "title": "Image Classification of Stroke Blood Clot Origin Using Deep Convolutional Neural Networks and Visual Transformers: A Kaggle Competition",
        "authors": "",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "Stroke is one of two main causes of death worldwide. Many individuals suffer from ischemic stroke every year. Only in US, more over 700,000 individuals meet ischemic stroke due to blood clot blocking an artery to the brain every year. «Stroke symptoms typically start suddenly, over seconds to minutes, and in most cases do not progress further. The symptoms depend on the area of the brain affected. The more extensive the area of the brain affected, the more functions that are likely to be lost. »  «Ischemic stroke occurs because of a loss of blood supply to part of the brain, initiating the ischemic cascade. » In the case of subsequent strokes, it is possible to mitigate consequences if physicians can determine stroke etiology. The paper describes particular approach how to apply Artificial Intelligence for purposes of separating two major acute ischemic stroke (AIS) etiology subtypes: cardiac and large artery atherosclerosis. Four deep neural network architectures and simple ensemble method are used in the approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.14"
    },
    {
        "id": 3975,
        "title": "Computing the Traversability of the Environment by Means of Sparse Convolutional 3D Neural Networks",
        "authors": "Antonio Santo, Arturo Gil, David Valiente, Mónica Ballesta, Adrián Peidró",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012160300003543"
    },
    {
        "id": 3976,
        "title": "Deep Learning for Early Diagnosis of Diabetic Retinopathy: a Study Using Convolutional Neural Network",
        "authors": "Ali Sultan Mayya",
        "published": "2023-6-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/neuront58640.2023.10175853"
    },
    {
        "id": 3977,
        "title": "Video Classification-Based Action Recognition with Enhanced Convolutional Neural Networks",
        "authors": "Bo Mei",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "The classification of videos has become increasingly important in the field of data science research, as it has numerous practical applications in modern society. Compared to image classification, video classification poses a significantly greater challenge. One of the most obvious difficulties is that video classification tasks require more powerful computers due to the large number of features that need to be computed. Additionally, conventional 2D Convolutional Neural Networks (2D CNNs) are not effective in handling such tasks. This paper proposes a novel 2-layer Convolutional Neural Network (CNN) architecture for action recognition that addresses these challenges. The proposed architecture achieved a high test accuracy of 79.66% for classifying large video clips. The results indicate the effectiveness of the proposed approach for video classification tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131506"
    },
    {
        "id": 3978,
        "title": "Microwave Imaging Using Cascaded Convolutional Neural Networks",
        "authors": "Fei Xue, Lei Guo, Amin Abbosh",
        "published": "2023-2-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ams57822.2023.10062327"
    },
    {
        "id": 3979,
        "title": "Detection of Handwriting Characteristics using Convolutional Neural Networks",
        "authors": "Daniel Gagiu, Dorin Sendrescu",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57093.2023.10178936"
    },
    {
        "id": 3980,
        "title": "Convolutional Neural Networks for Beginners",
        "authors": "Shaharyar Ahmed Khan Tareen, Filza Khan Tareen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4566310"
    },
    {
        "id": 3981,
        "title": "Vehicle Assistance System Using Convolutional Neural Networks",
        "authors": "Filip Žemla, Ján Cigánek",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsci59259.2023.10315836"
    },
    {
        "id": 3982,
        "title": "Novel predictive analysis for leaf diseases using convolutional neural networks comparing over artificial neural networks",
        "authors": "B. Vamsi Krishna, T. P. Anithaashri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0172887"
    },
    {
        "id": 3983,
        "title": "Implementierung von Convolutional Neural Networks zur echtzeitfähigen Bildklassifizierung auf konventionellen Industriesteuerungen",
        "authors": "Rando Raßmann, Christoph Wree",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33968/2023.22"
    },
    {
        "id": 3984,
        "title": "BIOMETRIC AUTHENTICATION UTILIZING CONVOLUTIONAL NEURAL NETWORKS",
        "authors": "Serhii Datsenko, Heorhii Kuchuk",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "Relevance. Cryptographic algorithms and protocols are important tools in modern cybersecurity. They are used in various applications, from simple software for encrypting computer information to complex information and telecommunications systems that implement various electronic trust services. Developing complete biometric cryptographic systems will allow using personal biometric data as a unique secret parameter instead of needing to remember cryptographic keys or using additional authentication devices. The object of research the process of generating cryptographic keys from biometric images of a person's face with the implementation of fuzzy extractors. The subject of the research is the means and methods of building a neural network using modern technologies. The purpose of this paper to study new methods for generating cryptographic keys from biometric images using convolutional neural networks and histogram of oriented gradients. Research results. The proposed technology allows for the implementation of a new cryptographic mechanism - a technology for generating reliable cryptographic passwords from biometric images for further use as attributes for access to secure systems, as well as a source of keys for existing cryptographic algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20998/2522-9052.2023.2.12"
    },
    {
        "id": 3985,
        "title": "Convolutional neural networks for early melanoma detection using dermoscopic images - a literature review",
        "authors": "",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53453/ms.2024.3.9"
    },
    {
        "id": 3986,
        "title": "Performance Analysis of Convolutional Neural Networks and Multilayer Perceptron in Generative Adversarial Networks",
        "authors": "Siyuan Guan",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10076041"
    },
    {
        "id": 3987,
        "title": "Document AI: A Comparative Study of Transformer-Based, Graph-Based Models, and Convolutional Neural Networks for Document Layout Analysis",
        "authors": "",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Document AI aims to automatically analyze documents by leveraging natural language processing and computer vision techniques. One of the major tasks of Document AI is document layout analysis, which structures document pages by interpreting the content and spatial relationships of layout, image, and text. This task can be image-centric, wherein the aim is to identify and label various regions such as authors and paragraphs, or text-centric, where the focus is on classifying individual words in a document. Although there are increasingly sophisticated methods for improving layout analysis, doubts remain about the extent to which their findings can be generalized to a broader context. Specifically, prior work developed systems based on very different architectures, such as transformer-based, graph-based, and CNNs. However, no work has mentioned the effectiveness of these models in a comparative analysis. Moreover, while language-independent Document AI models capable of knowledge transfer have been developed, it remains to be investigated to what degree they can effectively transfer knowledge. In this study, we aim to fill these gaps by conducting a comparative evaluation of state-of-the-art models in document layout analysis and investigating the potential of cross-lingual layout analysis by utilizing machine translation techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.04.17"
    },
    {
        "id": 3988,
        "title": "Retracted: Beat Wash-Sale Tax with Multigraph Convolutional Neural Networks Based Trading Strategy",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9840831"
    },
    {
        "id": 3989,
        "title": "Detection and Prediction of Breast Cancer Using Improved Faster Regional Convolutional Neural Network Based on Multilayer Perceptron’s Network",
        "authors": " Poonam Rana, Pradeep Kumar Gupta, Vineet Sharma",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23020054"
    },
    {
        "id": 3990,
        "title": "Adversarial Attacks with Defense Mechanisms on Convolutional Neural Networks and Recurrent Neural Networks for Malware Classification",
        "authors": "Sharoug Alzaidy, Hamad Binsalleeh",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "In the field of behavioral detection, deep learning has been extensively utilized. For example, deep learning models have been utilized to detect and classify malware. Deep learning, however, has vulnerabilities that can be exploited with crafted inputs, resulting in malicious files being misclassified. Cyber-Physical Systems (CPS) may be compromised by malicious files, which can have catastrophic consequences. This paper presents a method for classifying Windows portable executables (PEs) using Recurrent Neural Networks (RNNs) and Convolutional Neural Networks (CNNs). To generate malware executable adversarial examples of PE, we conduct two white-box attacks, Jacobian-based Saliency Map Attack (JSMA) and Carlini and Wagner attack (C&W). An adversarial payload was injected into the DOS header, and a section was added to the file to preserve the PE functionality. The attacks successfully evaded the CNN model with a 91% evasion rate, whereas the RNN model evaded attacks at an 84.6% rate. Two defense mechanisms based on distillation and training techniques are examined in this study for overcoming adversarial example challenges. Distillation and training against JSMA resulted in the highest reductions in the evasion rates of 48.1% and 41.49%, respectively. Distillation and training against C&W resulted in the highest decrease in evasion rates, at 48.1% and 49.9%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14041673"
    },
    {
        "id": 3991,
        "title": "Speaker age and gender recognition using 1D and 2D convolutional neural networks",
        "authors": "Ergün Yücesoy",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-09153-0"
    },
    {
        "id": 3992,
        "title": "Handwritten Recognition Based on Convolutional Neural Networks",
        "authors": "Mohan Wang",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceace60673.2023.10442130"
    },
    {
        "id": 3993,
        "title": "in-Memory Processing to Accelerate Convolutional Neural Networks",
        "authors": "Van - Khoa Pham",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsse58758.2023.10227155"
    },
    {
        "id": 3994,
        "title": "CONVOLUTIONAL NEURAL NETWORKS FOR CAMERA SELF-CALIBRATION WITH VARYING INTRINSIC PARAMETERS",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35741/issn.0258-2724.58.5.18"
    },
    {
        "id": 3995,
        "title": "Multiscale convolutional neural networks for in-loop video restoration",
        "authors": "Kiran Misra, Andrew Segall, Byeongdoo Choi",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dcc55655.2023.00027"
    },
    {
        "id": 3996,
        "title": "Enhancing marine debris identification with convolutional neural networks",
        "authors": "Victoria Wahlig, Ricardo A Gonzales",
        "published": "2024",
        "citations": 0,
        "abstract": "Oceanic debris, predominantly plastic, inflicts catastrophic damage on marine ecosystems, threatens aquatic life through entanglement, strangulation, and starvation, and increasingly accumulates as microplastics within the tissues of marine species consumed by humans. Assessing and mitigating this crisis is complicated by the wide-ranging distribution of waste by ocean currents to remote and deep-sea locations. In this study, we developed a deep learning model to discern and identify components of images captured by an underwater remotely operated vehicle (ROV). We hypothesized that the model would achieve an 80% accuracy. We utilized image segmentation, a process that groups or \"masks\" all pixels associated with a specific object in the image, to recognize and delineate image components (trash, animal, plant, ROV). We trained our model using the established TrashCan 1.0 dataset, which comprises images captured by ROVs in the Sea of Japan. Our model, a convolutional neural network employing U-Net architecture, formulated feature maps for each object within the images, enabling prediction of object classes. During the testing phase, we compared the model-generated object masks against reference masks to establish the Dice Similarity Coefficient (DSC) for each object class (trash = 0.81 ± 0.38, animal = 0.85 ± 0.35, plant = 0.88 ± 0.31, ROV = 0.86 ± 0.29, overall average = 0.84 ± 0.36). The consistent categorization of image components by our model demonstrates its potential as an effective ROV-borne tool capable of identifying and targeting hitherto inaccessible ocean trash. Our study lays a robust foundation for future research and additional applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/23-150"
    },
    {
        "id": 3997,
        "title": "Automated Fish Measurement and Classification Using Convolutional Neural Networks (CNNs)",
        "authors": "Soad El Hiak, Xu He",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.cbb.20231102.12"
    },
    {
        "id": 3998,
        "title": "Application of Convolutional Neural Networks for Creation of Photoluminescent Carbon Nanosensor for Heavy Metals Detection",
        "authors": "G. N. Chugreeva, O. E. Sarmanova, K. A. Laptinskiy, S. A. Burikov, T. A. Dolenko",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3103/s1060992x23060036"
    },
    {
        "id": 3999,
        "title": "Global Entropy Pooling layer for Convolutional Neural Networks",
        "authors": "Katarzyna Filus, Joanna Domańska",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126615"
    },
    {
        "id": 4000,
        "title": "Applying Modified Convolutional Neural Networks for Detecting Intrusion",
        "authors": "Kanin Siritharagul, Sunantha Sodsee",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incit60207.2023.10412982"
    },
    {
        "id": 4001,
        "title": "Convolutional Neural Networks for Classifying Electronic Components in Industrial Applications",
        "authors": "Stanisław Hożyń",
        "published": "2023-1-12",
        "citations": 4,
        "abstract": "Electronic component classification often constitutes the uncomplicated task of classifying a single object on a simple background. It is because, in many applications, a technological process employs constant lighting conditions, a fixed camera position, and a designated set of classified components. To date, there has not been an adequate attempt to develop a method for object classification under the above conditions in industrial applications. Therefore, this work focuses on the classification problem of a particular technological process. The process classifies electronic components on an assembly line using a fixed-mounted camera. The research investigated all the essential steps required to build a classification system, such as image acquisition, database creation, and neural network development. The first part of the experiment was devoted to creating an image dataset utilising the proposed image acquisition system. Then, custom and pre-trained networks were developed and tested. The results indicated that the pre-trained network (ResNet50) attained the highest accuracy (99.03%), which was better than the 98.99% achieved in relevant research on classifying elementary components. The proposed solution can be adapted to similar technological processes, where a defined set of components is classified under comparable conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16020887"
    },
    {
        "id": 4002,
        "title": "Characterizing functional brain networks via Spatio-Temporal Attention 4D Convolutional Neural Networks (STA-4DCNNs)",
        "authors": "Xi Jiang, Jiadong Yan, Yu Zhao, Mingxin Jiang, Yuzhong Chen, Jingchao Zhou, Zhenxiang Xiao, Zifan Wang, Rong Zhang, Benjamin Becker, Dajiang Zhu, Keith M. Kendrick, Tianming Liu",
        "published": "2023-1",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.004"
    },
    {
        "id": 4003,
        "title": "Chess Piece Classification Via Convolutional Neural Networks",
        "authors": "Shashank Parmar,  Rahul",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331716"
    },
    {
        "id": 4004,
        "title": "Regional analysis of ESM models using Bias Corrected spatial disaggregated superresolution convolutional neural networks",
        "authors": "Akash Awasthi",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116770"
    },
    {
        "id": 4005,
        "title": "Palmprint Recognition Using Pre-Trained Convolutional Neural Networks",
        "authors": "Nader Ebrahimpour, Faruk Baturalp Günay",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36287/setsci.6.1.018"
    },
    {
        "id": 4006,
        "title": "Convolutional Neural Networks (CNNs) for Pneumonia Classification on Pediatric Chest Radiographs",
        "authors": "Yash S Saboo, Saarthak Kapse, Prateek Prasanna",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.44130"
    },
    {
        "id": 4007,
        "title": "Activation Functions for Convolutional Neural Networks: Proposals and Experimental Study",
        "authors": "Víctor Manuel Vargas, Pedro Antonio Gutiérrez, Javier Barbero-Gómez, César Hervás-Martínez",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3105444"
    },
    {
        "id": 4008,
        "title": "A novel interactive deep cascade spectral graph convolutional network with multi-relational graphs for disease prediction",
        "authors": "Sihui Li, Rui Zhang",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106285"
    },
    {
        "id": 4009,
        "title": "Identification of the spatiotemporal activity patterns of cultured neuronal networks using deep convolutional neural networks (CNNs)",
        "authors": "Kaito Ogomori, Suguru N. Kudoh",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bmeicon60347.2023.10321992"
    },
    {
        "id": 4010,
        "title": "Exploring Convolutional Neural Networks for Facial Expression Recognition: A Comprehensive Survey",
        "authors": "",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "Facial emotion recognition is a very sought-after field in recent times as it has many important applications such as effective calculations, video game testing and motion capture in video games, human-computer interaction through machine vision, computer research etc. Facial expression is considered a nonverbal form of communication, as it reveals an individual's internal sentiments and emotional states through changes in multiple facial landmark points. Facial identification provides a more comprehensive insight into the person's thoughts and these expressions are analyzed using deep learning methods, such as CNN. The accuracy rates achieved are compared to other methods. In this paper, a concise exploration of diverse applications within Facial Expression Recognition (FER) fields and the publicly accessible data sets employed in FER studies is outlined. FER using multiple different CNN algorithms is also presented. Finally, through comparing multiple different studies of various CNN algorithms, a table and a chart are provided for a better understanding of the rate of accuracy achieved throughout the use of different datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62304/jieet.v3i02.87"
    },
    {
        "id": 4011,
        "title": "Intelligent IDS in wireless sensor networks using deep fuzzy convolutional neural network",
        "authors": "Shalini Subramani, M. Selvi",
        "published": "2023-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08511-2"
    },
    {
        "id": 4012,
        "title": "On fine-grained visual explanation in convolutional neural networks",
        "authors": "Xia Lei, Yongkai Fan, Xiong-Lin Luo",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2022.12.012"
    },
    {
        "id": 4013,
        "title": "Neural Machine Translation of Electrical Engineering Based on Integrated Convolutional Neural Networks",
        "authors": "Zikang Liu, Yuan Chen, Juwei Zhang",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Research has shown that neural machine translation performs poorly on low-resource and specific domain parallel corpora. In this paper, we focus on the problem of neural machine translation in the field of electrical engineering. To address the mistranslation caused by the Transformer model’s limited ability to extract feature information from certain sentences, we propose two new models that integrate a convolutional neural network as a feature extraction layer into the Transformer model. The feature information extracted by the CNN is fused separately in the source-side and target-side models, which enhances the Transformer model’s ability to extract feature information, optimizes model performance, and improves translation quality. On the dataset of the field of electrical engineering, the proposed source-side and target-side models improved BLEU scores by 1.63 and 1.12 percentage points, respectively, compared to the baseline model. In addition, the two models proposed in this paper can learn rich semantic knowledge without relying on auxiliary knowledge such as part-of-speech tagging and named entity recognition, which saves a certain amount of human resources and time costs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12173604"
    },
    {
        "id": 4014,
        "title": "Improving explainability results of convolutional neural networks in microscopy images",
        "authors": "Athanasios Kallipolitis, Panayiotis Yfantis, Ilias Maglogiannis",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08452-w"
    },
    {
        "id": 4015,
        "title": "Learnable Gabor kernels in convolutional neural networks for seismic facies classification",
        "authors": "F. Wang, T. Alkhalifah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310758"
    },
    {
        "id": 4016,
        "title": "Tomato disease identification with shallow convolutional neural networks",
        "authors": "Minh Trinh, Edward Jung, Linh Trinh",
        "published": "2023",
        "citations": 0,
        "abstract": "Plant diseases can cause up to 50% crop yield loss for the popular tomato plant. Successful disease management requires precise and timely disease identification methods, but slow and inconsistent diagnoses from human experts or laboratory testing prevents farmers from applying appropriate treatments before the disease takes its toll. As an alternative diagnostic method, a mobile device-based method to identify diseases from photos of symptomatic leaves via computer vision can be more effective due to its convenience and accessibility. Previous research has achieved high accuracy in diagnoses using “deep” convolutional neural networks (CNNs) that have a large number of processing layers and thus a large computational requirement difficult to satisfy on most mobile devices. To enable a practical mobile solution, a “shallow” CNN with few layers, and thus low computational requirement but with high accuracy similar to the deep CNNs is needed. In this work, we explored if such a model was possible. We hypothesized that shallow CNNs would be capable of achieving even higher accuracy than deep CNNs because of shallow CNNs’ relatively low inherent dimensionality reduction, allowing it to preserve more distinguishing features between photos of leaves with different diseases. We compared the performance of a shallow CNN we built against conventional deep CNNs. The shallow CNN outperformed several deep CNNs, confirming our hypothesis. This finding enabled us to develop PlantDoctor, a mobile app that can accurately identify plant diseases via leaf images captured by the phone camera in real-time and suggest appropriate treatments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59720/22-171"
    },
    {
        "id": 4017,
        "title": "Forecasting Wheat Futures with Convolutional Neural Networks",
        "authors": "Leo H. Chan, Avi Thaker, Daniel Sonner",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4733370"
    },
    {
        "id": 4018,
        "title": "TEH-GCN: Topic-Event Based Hierarchical Graph Convolutional Networks for Rumor Detection",
        "authors": "Zhengliang Luo, Peifeng Li, Zhong Qian, Xiaoxu Zhu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191237"
    },
    {
        "id": 4019,
        "title": "Seizure Detection and Prediction by Parallel Memristive Convolutional Neural Networks",
        "authors": "Corey Lammie",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29363/nanoge.neumatdecas.2023.075"
    },
    {
        "id": 4020,
        "title": "Ultrasonic Imaging and Flaw Detection with Optimized Convolutional Transformer Neural Networks",
        "authors": "Xin Zhang, Jafar Saniie",
        "published": "2023-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ius51837.2023.10307997"
    },
    {
        "id": 4021,
        "title": "DEEP CONVOLUTIONAL NEURAL NETWORKS FOR MALARIA CELL CLASSIFICATION",
        "authors": "",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets43669"
    },
    {
        "id": 4022,
        "title": "Onsets and Velocities: Affordable Real-Time Piano Transcription Using Convolutional Neural Networks",
        "authors": "Andres Fernandez",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10290067"
    },
    {
        "id": 4023,
        "title": "Boosted Convolutional Neural Networks Based Hybrid Approach for Power Quality Disturbances Analysis",
        "authors": " Rahul, Kuldeep Dagar, M Gangadharappa",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112117"
    },
    {
        "id": 4024,
        "title": "Pianist Identification Using Convolutional Neural Networks",
        "authors": "Jingjing Tang, Geraint Wiggins, György Fazekas",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf59510.2023.10335427"
    },
    {
        "id": 4025,
        "title": "Detecting Forged Facial Videos Using Convolutional Neural Networks",
        "authors": "Neil Sambhu, Shaun Canavan",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ises58672.2023.00060"
    },
    {
        "id": 4026,
        "title": "Constrained Center Loss for Convolutional Neural Networks",
        "authors": "Zhanglei Shi, Hao Wang, Chi-Sing Leung",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3104392"
    },
    {
        "id": 4027,
        "title": "Research on Robotic High-Precision Target Detection Technology for Transmission Lines Based on Convolutional Neural Networks",
        "authors": "Boyu Xu, Xiyi Gu, Wenbin Liu, Jianfeng Zhang, Dongdian Lin",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105809"
    },
    {
        "id": 4028,
        "title": "FPGA-Based Design for Accelerating 3D Convolutional Neural Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ijfet.2023.050307"
    },
    {
        "id": 4029,
        "title": "Comparative analysis of accuracy in image forensics for authentication using novel convolutional neural networks with artificial neural networks algorithm",
        "authors": "Bandi Sai Kiran Reddy, R. Nithya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178983"
    },
    {
        "id": 4030,
        "title": "Compression of Convolutional Neural Networks With Divergent Representation of Filters",
        "authors": "Peng Lei, Jiawei Liang, Tong Zheng, Jun Wang",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3201846"
    },
    {
        "id": 4031,
        "title": "Research on the Complexity Characteristics of Convolutional Neural Networks",
        "authors": "Juan Juan Zhou",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291768"
    },
    {
        "id": 4032,
        "title": "Towards Improved Input Masking for Convolutional Neural Networks",
        "authors": "Sriram Balasubramanian, Soheil Feizi",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00178"
    },
    {
        "id": 4033,
        "title": "Power line fault diagnosis based on convolutional neural networks",
        "authors": "Liang Ning, Dongfeng Pei",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e29021"
    },
    {
        "id": 4034,
        "title": "Combining graph neural networks and ROI-based convolutional neural networks to infer individualized graphs for Alzheimer's prediction",
        "authors": "Kevin Mueller, Anke Meyer-Baese, Gordon Erlebacher",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654445"
    },
    {
        "id": 4035,
        "title": "Indian Sign Language Interpretation using Convolutional Neural Networks",
        "authors": "R. Sreemathy, Mousami Turuk, Jayashree Jagdale, Agrima Agarwal, Vishal Kumar",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116204"
    },
    {
        "id": 4036,
        "title": "M-DDC: MRI based demyelinative diseases classification with U-Net segmentation and convolutional network",
        "authors": "Deyang Zhou, Lu Xu, Tianlei Wang, Shaonong Wei, Feng Gao, Xiaoping Lai, Jiuwen Cao",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.010"
    },
    {
        "id": 4037,
        "title": "Applications of convolutional neural networks and remote sensing data to predict flood extents",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.nguyen328"
    },
    {
        "id": 4038,
        "title": "Convolutional Neural Networks for Face Detection and Age Estimation",
        "authors": "",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets44408"
    },
    {
        "id": 4039,
        "title": "Automatic flood detection by leveraging deep convolutional neural networks",
        "authors": "Delwende Pierre Wilfried, Nikita Rai, Kanika Singla",
        "published": "2023-2-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iemecon56962.2023.10092315"
    },
    {
        "id": 4040,
        "title": "Prediction of Optical Scattering from Plasmonic Nanostructures using Deep Convolutional Neural Networks",
        "authors": "E.G. Norris, J. Baxter, J. Desaultels, L. Ramunno",
        "published": "2023",
        "citations": 0,
        "abstract": "Deep Learning is used for predicting scattered fields from arbitrarily-shaped individual plasmonic nanoparticles using the multipole expansion",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/cleo_fs.2023.fw3c.3"
    },
    {
        "id": 4041,
        "title": "Behavior Prediction of Vespa Mandarinia Based on Convolutional Neural Networks",
        "authors": "Shihao Wu",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipcv57033.2023.00030"
    },
    {
        "id": 4042,
        "title": "Alzheimer's Disease Classification using Convolutional Neural Networks",
        "authors": "Archana B, K. Kalirajan",
        "published": "2023-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icidca56705.2023.10100046"
    },
    {
        "id": 4043,
        "title": "Refinement of structural theories for composite shells through convolutional neural networks",
        "authors": "M. Petrolo",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract. This study examines the use of Convolutional Neural Networks (CNN) to determine the optimal structural theories to adopt for the modeling of composite shells, to combine accuracy and computational efficiency. The use of the Axiomatic/Asymptotic Method (AAM) on higher-order theories (HOT) based on polynomial expansions can be cumbersome due to the amount of Finite Element Models (FEM) virtually available and the problem-dependency of a theory’s performance. Adopting the Carrera Unified Formulation (CUF) can mitigate this obstacle through its procedural and lean derivation of the required structural results. At the same time, the CNN can act as a surrogate model to guide the selection process. The network can inform on the convenience of a specific set of generalized variables after being trained with just a small percentage of the results typically required by the AAM. The CNN capabilities are compared to the AAM through the Best Theory Diagram (BTD) obtained using different selection criteria: errors over natural frequencies or failure indexes. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21741/9781644902813-31"
    },
    {
        "id": 4044,
        "title": "Emotional Attention for Trained Convolutional Neural Networks",
        "authors": "Stefan Tsokov, Milena Lazarova, Adelina Aleksieva-Petrova",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsci59259.2023.10315883"
    },
    {
        "id": 4045,
        "title": "How Positional Information Affect Convolutional Neural Networks?",
        "authors": "Erdi Sarıtaş, Hazım Kemal Ekenel",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ubmk59864.2023.10286763"
    },
    {
        "id": 4046,
        "title": "Early Diagnosis of Emphysema using Convolutional Neural Networks",
        "authors": "Yash Baghel, Harsh Jindal, Jasneet Chawla",
        "published": "2023-7-14",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235036"
    },
    {
        "id": 4047,
        "title": "An IoT Device Recognition Method based on Convolutional Neural Network",
        "authors": "Minghao Lu, Linghui Li, Yali Gao, Xiaoyong Li",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105697"
    },
    {
        "id": 4048,
        "title": "Convolutional neural networks based dimensionality reduction for hyperspectral images",
        "authors": "Vladimir Zeljković, Branka Stojanović, Malte Jaschik, Aleksandar Nešković",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/telfor59449.2023.10372740"
    },
    {
        "id": 4049,
        "title": "Classification of Fungi Images Using Different Convolutional Neural Networks",
        "authors": "U.M.M.P.K. Nawarathne, H.M.N.S. Kumari",
        "published": "2023-12-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitr61062.2023.10382784"
    },
    {
        "id": 4050,
        "title": "Plant Disease Detection Using Small Convolutional Neural Networks",
        "authors": "Alexandra D. Ermolaeva",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/elcon61730.2024.10468400"
    },
    {
        "id": 4051,
        "title": "Automated Human Emotion Recognition from Speech Using Convolutional Neural Networks",
        "authors": "Sachin Mittal",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331772"
    },
    {
        "id": 4052,
        "title": "Classification of Chickpea Varieties Based on Convolutional Neural Networks",
        "authors": "İbrahim Kılıç, Nesibe Yalçın",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296680"
    },
    {
        "id": 4053,
        "title": "Detection of COVID-19 Using Convolutional Neural Networks",
        "authors": "Arshita Srivastava, Shubham Mishra",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cisct57197.2023.10351356"
    },
    {
        "id": 4054,
        "title": "Convolutional Neural Networks for Object Detection",
        "authors": "Bruno Romão, Eric Fagotto",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "<div class=\"section abstract\"><div class=\"htmlview paragraph\">Autonomous cars (ACs) and advanced driver-assistance systems (ADAS) have relied on convolutional neural networks (CNNs) for object detection. However, image degradation caused by adverse weather conditions like rain, snow, and fog can decrease the performance of a CNN. So, this paper presents the development of an image-processing technique aimed to mitigate such a problem. First, after an extensive evaluation of models for object detection, YOLOv3 was chosen because of its compromise between precision and inference time. Afterwards, the training and test of a YOLOv3 CNN was investigated for cars, traffic signals, traffic lights, pedestrians, and riders. Performance was evaluated by estimating the average and mean average precision (mAP) for every one of the mentioned object classes. An OpenCV based pre-processing technique to mitigate the degradation imposed by adverse weather conditions was implemented. Specifically, the OpenCV filters of erosion, dilation and joint bilateral filter were applied during training and tests of the datasets Berkeley DeepDrive (BDD100K) and Detection in Adverse Weather Nature (DAWN). The developed work discusses the benefits of OpenCV filters for data augmentation in training and testing CNNs. Our results show a mAP improvement around 3% in the tests with DAWN.</div></div>",
        "keywords": "",
        "link": "http://dx.doi.org/10.4271/2023-36-0097"
    },
    {
        "id": 4055,
        "title": "Language recognition by convolutional neural networks",
        "authors": "l. Khosravani Pour, A. Farrokhi",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24200/sci.2022.59110.6064"
    },
    {
        "id": 4056,
        "title": "Image Augmentation with Convolutional Neural Networks",
        "authors": "Michael Curry, Min Chen",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uemcon59035.2023.10316005"
    },
    {
        "id": 4057,
        "title": "Exploring the role of edge distribution in graph convolutional networks",
        "authors": "Liancheng He, Liang Bai, Xian Yang, Zhuomin Liang, Jiye Liang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.048"
    },
    {
        "id": 4058,
        "title": "Detection of Tuberculosis Disease with Convolutional Neural Networks",
        "authors": "Mehmet BABALIK, Çiğdem BAKIR",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Tuberculosis is an infectious disease caused by bacteria called Mycobacterium tuberculosis. Tuberculosis is still an important public health problem worldwide and is common especially in developing countries. This respiratory disease can cause serious symptoms, especially affecting the lungs. Symptoms of tuberculosis include prolonged coughing, shortness of breath, chest pain, weakness, fever, night sweats, and malaise. The diagnosis of the disease is made by clinical signs as well as biomedical imaging methods and laboratory tests. These imaging modalities include techniques such as x-rays, computed tomography (CT), and magnetic resonance imaging (MRI). Early diagnosis of tuberculosis disease is of great importance in terms of treatment and prevention of the spread of the disease. The use of deep learning methods to classify biomedical images of tuberculosis disease can accelerate the diagnosis process, increase accuracy and guide treatment more effectively. In this study, it aims to be an important step in the classification of tuberculosis disease with deep learning. The generated CNN network, parameter values, layers used, complexity matrices obtained for verification data, accuracy and loss graphs are shown in detail. In our study, the success rate was increased by using a different network structure than the neural networks used in the literature. Approximately 98% success was achieved with the proposed CNN model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58190/icat.2023.17"
    },
    {
        "id": 4059,
        "title": "Comparison of models of deep convolutional neural networks",
        "authors": "Zihan Wang",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Recently, deep learning has gained considerable success and acceptance in a variety of fields, attracting an increasing number of researchers who are delving deeper and gaining a broader perspective on the subject. It provides more sustainability and opportunities to advance the development of society and transform the lives of individuals. Consequently, it is crucial for individuals to understand the neural network development path. This paper provides a concise overview of the structure and components of Convolutional Neural Network, as well as some of the most well-known and influential learning models in the history of its development. Through an analysis of various models of convolutional neural network, the workings of convolutional neural networks were investigated. The paper discovered that the structure of neural networks is becoming deeper and more complex in order to achieve greater efficacy and avoid the overfitting issue. For researchers to enhance and advance neural network performance, there are still numerous parameters and perspectives to improve and advance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/16/20230857"
    },
    {
        "id": 4060,
        "title": "Deepfake Detection with Deep Learning: Convolutional Neural Networks versus Transformers",
        "authors": "Vrizlynn L.L. Thing",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csr57506.2023.10225004"
    },
    {
        "id": 4061,
        "title": "Time Series Prediction using Convolutional Neural Networks",
        "authors": "Aishwarya Asesh, Meenal Dugar",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlant59547.2023.10372968"
    },
    {
        "id": 4062,
        "title": "Optimizing convolutional neural networks using elitist firefly algorithm for remote sensing classification",
        "authors": "Yan Wang",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12065-024-00913-y"
    },
    {
        "id": 4063,
        "title": "Convolutional Neural Networks Architecture for Processing Brain MRI Images",
        "authors": "Matvey I. Zabudko",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/elcon61730.2024.10468494"
    },
    {
        "id": 4064,
        "title": "Alzheimer's disease classification for MRI images using Convolutional Neural Networks",
        "authors": "Sara Esam, Ammar Mohammed",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icci61671.2024.10485049"
    },
    {
        "id": 4065,
        "title": "SSFG: Stochastically Scaling Features and Gradients for Regularizing Graph Convolutional Networks",
        "authors": "Haimin Zhang, Min Xu, Guoqiang Zhang, Kenta Niwa",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2022.3188888"
    },
    {
        "id": 4066,
        "title": "HOCD: Overlapping Community Detection based on Hypergraph Convolutional Neural Networks",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/wcse.2023.06.024"
    },
    {
        "id": 4067,
        "title": "Convolutional Neural Networks for The Detection of Skin Diseases",
        "authors": "P. Sasikala, A. Mohanarathinam",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icercs57948.2023.10433995"
    },
    {
        "id": 4068,
        "title": "Comparing the performance of different optimizers in convolutional neural networks for leukocyte classification",
        "authors": "Illia Krushelnytskyi",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "This paper investigates the effectiveness of different optimizers for leukocyte classification in convolutional neural networks. We compare the performance of optimization functions supported by TensorFlow. Our experiment shows that “Adam” optimizer achieves the highest accuracy of 0.9844, followed by “RMS Prop” with 0.9776. The lowest accuracy of 0.4158 was achieved by “Gradient Descent”. Our study demonstrates the importance of selecting optimal optimizer for best performance in leukocyte classification tasks using CNNs on blood images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51582/interconf.19-20.05.2023.038"
    },
    {
        "id": 4069,
        "title": "Springback prediction for sheet metal cold stamping using convolutional neural networks",
        "authors": "Lei Zhu, Nan Li",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2675249"
    },
    {
        "id": 4070,
        "title": "SRAM-based efficiency memory model for quantized convolutional neural networks",
        "authors": "Ji Wu, Kazuteru Namba",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226859"
    },
    {
        "id": 4071,
        "title": "Classification and Segmentation of Brain Tumor MRI Images Using Convolutional Neural Networks",
        "authors": "César Borja Ruiz",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icev59168.2023.10329651"
    },
    {
        "id": 4072,
        "title": "Discovering Rules with Convolutional Neural Networks",
        "authors": "Katarzyna Stankiewicz, Paweł Skiba, Bartosz Chaber",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cpee59623.2023.10285308"
    },
    {
        "id": 4073,
        "title": "Adaptive Fault Diagnosis Model for High-Speed Railway Turnout Using Deep Convolutional Neural Networks",
        "authors": "Xiaoyu Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsn.2023.10058289"
    },
    {
        "id": 4074,
        "title": "Drug-Drug Interaction: An Improved Prediction Approach Based on Convolutional Neural Networks",
        "authors": "K.Soni Sharmila, Thanga Revathi S, Pokkuluri Kiran Sree",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370722"
    },
    {
        "id": 4075,
        "title": "Simple Implementation of Terrain Classification Models via Fully Convolutional Neural Networks",
        "authors": "Assiya Sarinova, Leila Rzayeva, Noyan Tendikov, Ibraheem Shayea",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wincom59760.2023.10323012"
    },
    {
        "id": 4076,
        "title": "Retracted: Image Analysis Method of Substation Equipment Based on Convolutional Neural Network",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9816085"
    },
    {
        "id": 4077,
        "title": "Retracted: Defect Prediction Technology in Software Engineering Based on Convolutional Neural Network",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9762076"
    },
    {
        "id": 4078,
        "title": "Utilizing 1D Convolutional Neural Networks for Enhanced Design and Optimization of Rectangular Patch Antenna Parameters",
        "authors": "Chaima Ferchichi, Dorsaf Omri, Taoufik Aguili",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isncc58260.2023.10323936"
    },
    {
        "id": 4079,
        "title": "Traversability Learning from Aerial Images with Fully Convolutional Neural Networks",
        "authors": "Carlos David Braga Borges, Jarbas Joaci de Mesquita Sá Junior",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11063-023-11406-x"
    },
    {
        "id": 4080,
        "title": "Decoding study-independent mind-wandering from EEG using convolutional neural networks",
        "authors": "Christina Yi Jin, Jelmer P Borst, Marieke K van Vugt",
        "published": "2023-4-1",
        "citations": 1,
        "abstract": "Abstract\n\nObjective. Mind-wandering is a mental phenomenon where the internal thought process disengages from the external environment periodically. In the current study, we trained EEG classifiers using convolutional neural networks (CNNs) to track mind-wandering across studies. Approach. We transformed the input from raw EEG to band-frequency information (power), single-trial ERP (stERP) patterns, and connectivity matrices between channels (based on inter-site phase clustering). We trained CNN models for each input type from each EEG channel as the input model for the meta-learner. To verify the generalizability, we used leave-N-participant-out cross-validations (N = 6) and tested the meta-learner on the data from an independent study for across-study predictions. Main results. The current results show limited generalizability across participants and tasks. Nevertheless, our meta-learner trained with the stERPs performed the best among the state-of-the-art neural networks. The mapping of each input model to the output of the meta-learner indicates the importance of each EEG channel. Significance. Our study makes the first attempt to train study-independent mind-wandering classifiers. The results indicate that this remains challenging. The stacking neural network design we used allows an easy inspection of channel importance and feature maps.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1741-2552/acc613"
    },
    {
        "id": 4081,
        "title": "Retracted: Path Selection Strategy of Communication Network Based on Graph Convolutional Neural Network",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9759083"
    },
    {
        "id": 4082,
        "title": "Identification of Honeybees with Paint Codes Using Convolutional Neural Networks",
        "authors": "Gabriel Santiago-Plaza, Luke Meyers, Andrea Gomez-Jaime, Rafael Meléndez-Ríos, Fanfan Noel, Jose Agosto, Tugrul Giray, Josué Rodríguez-Cordero, Rémi Mégret",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012460600003660"
    },
    {
        "id": 4083,
        "title": "Screening of Baggage X-ray Images Using Convolutional Neural Networks",
        "authors": "Dioline Sara, Ajay Kumar Mandava",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205696"
    },
    {
        "id": 4084,
        "title": "Vehicle Speed Estimation From Audio Signals Using 1D Convolutional Neural Networks",
        "authors": "Ivana Čavor, Slobodan Djukanović",
        "published": "2023-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/it57431.2023.10078724"
    },
    {
        "id": 4085,
        "title": "Improving Translation Invariance in Convolutional Neural Networks with Peripheral Prediction Padding",
        "authors": "Kensuke Mukai, Takao Yamanaka",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223102"
    },
    {
        "id": 4086,
        "title": "The use of convolutional neural networks in radio tomographic imaging",
        "authors": "Grzegorz Kłosowski",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15199/48.2023.03.14"
    },
    {
        "id": 4087,
        "title": "MODI Lipi Handwritten Character Recognition Using Convolutional Neural Networks (CNN)",
        "authors": "",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets40141"
    },
    {
        "id": 4088,
        "title": "NLOS Identification for UWB Positioning Based on IDBO and Convolutional Neural Networks",
        "authors": "Qiankun Kong",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3344640"
    },
    {
        "id": 4089,
        "title": "When Convolutional Neural Networks Meet Laser-Induced Breakdown Spectroscopy: End-to-End Quantitative Analysis Modeling of ChemCam Spectral Data for Major Elements Based on Ensemble Convolutional Neural Networks",
        "authors": "Yan Yu, Meibao Yao",
        "published": "2023-7-6",
        "citations": 7,
        "abstract": "Modeling the quantitative relationship between target components and measured spectral information is an essential part of laser-induced breakdown spectroscopy (LIBS) analysis. However, many traditional multivariate analysis algorithms must reduce the spectral dimension or extract the characteristic spectral lines in advance, which may result in information loss and reduced accuracy. Indeed, improving the precision and interpretability of LIBS quantitative analysis is a critical challenge in Mars exploration. To solve this problem, this paper proposes an end-to-end lightweight quantitative modeling framework based on ensemble convolutional neural networks (ECNNs). This method eliminates the need for dimensionality reduction of the raw spectrum along with other pre-processing operations. We used the ChemCam calibration dataset as an example to verify the effectiveness of the proposed approach. Compared with partial least squares regression (a linear method) and extreme learning machine (a nonlinear method), our proposed method resulted in a lower root-mean-square error for major element prediction (54% and 73% lower, respectively) and was more stable. We also delved into the internal learning mechanism of the deep CNN model to understand how it hierarchically extracts spectral information features. The experimental results demonstrate that the easy-to-use ECNN-based regression model achieves excellent prediction performance while maintaining interpretability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15133422"
    },
    {
        "id": 4090,
        "title": "E pluribus unum interpretable convolutional neural networks",
        "authors": "George Dimas, Eirini Cholopoulou, Dimitris K. Iakovidis",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "AbstractThe adoption of convolutional neural network (CNN) models in high-stake domains is hindered by their inability to meet society’s demand for transparency in decision-making. So far, a growing number of methodologies have emerged for developing CNN models that are interpretable by design. However, such models are not capable of providing interpretations in accordance with human perception, while maintaining competent performance. In this paper, we tackle these challenges with a novel, general framework for instantiating inherently interpretable CNN models, named E pluribus unum interpretable CNN (EPU-CNN). An EPU-CNN model consists of CNN sub-networks, each of which receives a different representation of an input image expressing a perceptual feature, such as color or texture. The output of an EPU-CNN model consists of the classification prediction and its interpretation, in terms of relative contributions of perceptual features in different regions of the input image. EPU-CNN models have been extensively evaluated on various publicly available datasets, as well as a contributed benchmark dataset. Medical datasets are used to demonstrate the applicability of EPU-CNN for risk-sensitive decisions in medicine. The experimental results indicate that EPU-CNN models can achieve a comparable or better classification performance than other CNN architectures while providing humanly perceivable interpretations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-38459-1"
    },
    {
        "id": 4091,
        "title": "‘Seeing’ the Future: Improving Macroeconomic Forecasts with Spatial Data Using Recurrent Convolutional Neural Networks",
        "authors": "Jonathan Leslie",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4350048"
    },
    {
        "id": 4092,
        "title": "ECG Authentication Reinforced by Pretrained Convolutional Neural Networks",
        "authors": "Sateesh Kumar TR, Purushottama TL",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10275834"
    },
    {
        "id": 4093,
        "title": "AB0015 ANTINUCLEAR ANTIBODIES PATTERN CLASSIFIER WITH CONVOLUTIONAL NEURAL NETWORKS",
        "authors": "V. Alfaro, A. Carpio, Y. Stekman",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/annrheumdis-2023-eular.1781"
    },
    {
        "id": 4094,
        "title": "Linear Computation Coding for Convolutional Neural Networks",
        "authors": "Ralf R. Müller, Hans Rosenberger, Marc Reichenbach",
        "published": "2023-7-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssp53291.2023.10207943"
    },
    {
        "id": 4095,
        "title": "Rule extraction from convolutional neural networks for heart disease prediction",
        "authors": "Manomita Chakraborty",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13534-024-00358-3"
    },
    {
        "id": 4096,
        "title": "ENHANCED DDOS ATTACK DETECTION USING IMPROVED DEEP CONVOLUTIONAL NEURAL NETWORKS",
        "authors": "",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58257/ijprems32996"
    },
    {
        "id": 4097,
        "title": "Convolutional neural networks",
        "authors": "Alexander Derry, Martin Krzywinski, Naomi Altman",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41592-023-01973-1"
    },
    {
        "id": 4098,
        "title": "Hardware Implementation for Convolutional Neural Networks in Artificial Intelligence",
        "authors": "Hongxi Chen",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "Artificial Intelligence (AI) has brought great convenience and help to human society by improving efficiency, increasing productivity and reducing cost. As a part of deep learning, convolutional neural networks (CNNs) have been widely concerned by researchers in recent years. In this paper, five parts of the CNN structure, including input layer, convolutional layer, pooling layer, fully connected layer, activation function and output layer are going to be elaborated. Besides, four different kinds of hardware, which can be used in AI implementation, including graphics processing unit (GPU), field programmable gate array (FPGA), application-specific integrated circuit (ASIC) and brain-like chips will be discussed in this paper. Based on the different characteristics of these four groups of hardware, this paper will analyze their feasibility to implement artificial intelligence algorithm. After contrasting their cost, flexibility and power consumption, it is concluded that different hardware has different advantages to implement AI under different circumstances. GPU performs better to handle with parallel operations or construct complex network models of AI. FPGA is able to achieve flexible AI model programming. On the other hand, ASIC is preferred considering its low power consumption and cost to implement AI. Although brain-like chip is not as well developed as the other three chips, it is promising to implement AI in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v62i.10426"
    },
    {
        "id": 4099,
        "title": "Detecting Carcass Defects of Native Chickens Using Convolutional Neural Networks",
        "authors": "Pin-Cheng Lai, Yan-Fu Kuo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13031/aim.202301014"
    },
    {
        "id": 4100,
        "title": "Ocular Disease Detection Using Convolutional Neural Networks",
        "authors": "A. Anbarasi, M. Revathi, S. Vijayalakshmi",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscan58655.2023.10395287"
    },
    {
        "id": 4101,
        "title": "Classification of Road Objects Using Convolutional Neural Networks",
        "authors": "Mann Patel, Heba Elgazzar",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc57344.2023.10099093"
    },
    {
        "id": 4102,
        "title": "Prediction of airfoil dynamic stall response using convolutional neural networks",
        "authors": "Renato F. Miotto, William Wolf",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-4362"
    },
    {
        "id": 4103,
        "title": "Sensor-based gesture recognition with convolutional neural networks",
        "authors": "Ran Bi",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Sensor-based gesture recognition is an active research field of great significance with a wide range of applications in control systems for virtual reality, medical monitoring, and abnormal behavior determination. This problem has drawn the attention from both the academia and industry and many methods are proposed in the literature. Recently, deep learning has been widely applied in sensor-based gesture recognition and achieved good effects. In this paper, we proposed a classifier model based on Convolutional Neural Network (CNN) and applied it to EMG-based and smartphone-based datasets, respectively. For these two datasets, our model both achieved better classification accuracies than traditional machine learning models, with the results of approximately 97% and 72% accuracies, respectively. We also analyzed the effects of different parameters on the results of the proposed CNN model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/2023305"
    },
    {
        "id": 4104,
        "title": "Wood defect classification based on lightweight convolutional neural networks",
        "authors": "Yonghua Xie, Jiaxin Ling",
        "published": "2023-9-27",
        "citations": 1,
        "abstract": "Different types of wood defects correspond to different processing methods. Good classification means can transform defective boards into practical boards after appropriate processing. The detection accuracy of the wood surface defects is particularly important for improving the utilization rate and speed of processing the boards. The RegNet stands out in the field of computer vision. It automatically designs the network model based on the design space and applies it to wood defect detection, which can improve the classification accuracy. When the convolutional structure of the RegNet network is applied to industrial detection and classification, the problems of long real-time detection time and large algorithm parameters persist. This study focuses on collecting wood material images of common coniferous and broad-leaved trees in Northeast China with three types of defects: wormholes, slip knots, and dead knots. To improve the allocation of computing resources, based on the RegNet network model, an attention mechanism module was added, and the Ghostconv structure was introduced. The structure quickly and accurately highlighted the types of wood defects, improved the classification accuracy, reduced the parameters of the network, and exhibited generalization ability. To verify the performance of the improved network, MobileNet-v2, EfficientNet, and Vision-Transformer networks were introduced for comparative analysis. The improved RegNet network had smaller weight and higher accuracy, with a classification accuracy of 96.58%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15376/biores.18.4.7663-7680"
    }
]