[
    {
        "id": 15705,
        "title": "Machine-Learning Models for Loss and Deviation Angle of Compressor Cascades",
        "authors": "Andrew T. Nichols, Feng Liu",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-1765"
    },
    {
        "id": 15706,
        "title": "Addressing misclassification costs in machine learning through asymmetric loss functions",
        "authors": "Bryan M. Barnes, Mark-Alexander Henn",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2662027"
    },
    {
        "id": 15707,
        "title": "Loss functions in machine learning for seismic random noise attenuation",
        "authors": "Hyunggu Jun, Han‐Joon Kim",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractSeismic random noise is one of the main factors that degrade the quality of seismic data. Therefore, seismic random noise attenuation should be performed appropriately through several stages during seismic data processing, and this requires sufficient experience and knowledge because the proper hyperparameters need to be determined based on the features of the noise in the target seismic data. Recently, machine learning–based seismic noise attenuation has been widely studied because it provides suitable results by learning noise features from noisy data, unlike conventional physics‐based approaches. There are many important factors in machine learning, and, here, we focus on the loss functions of machine learning in terms of seismic random noise attenuation. The most widely used loss function is l2, but we train a model with various kinds of single and multiple loss functions and attenuate seismic random noise. We analyse the efficiency of loss functions by comparing the noise‐attenuated results of synthetic and field seismic data qualitatively and quantitatively. Our analysis indicates that the multiple loss function with the l1 norm can be a proper choice for random noise suppression of seismic data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/1365-2478.13449"
    },
    {
        "id": 15708,
        "title": "Machine learning based quantitative consequence prediction models for toxic dispersion casualty",
        "authors": "Zeren Jiao, Zhuoran Zhang, Seungho Jung, Qingsheng Wang",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jlp.2022.104952"
    },
    {
        "id": 15709,
        "title": "Estimation of burst pressure of pipelines with interacting corrosion clusters based on machine learning models",
        "authors": "Abraham Mensah, Srinivas Sriramula",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jlp.2023.105176"
    },
    {
        "id": 15710,
        "title": "Performance Analysis of Machine Learning Models in Solar Energy Forecasting",
        "authors": "",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2023.13.3.1140"
    },
    {
        "id": 15711,
        "title": "Traditional Machine Learning Models for Building Energy Performance Prediction: A Comparative Research",
        "authors": "Zeyu Wu, Hongyang He",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.mlr.20230801.11"
    },
    {
        "id": 15712,
        "title": "A reinforcement learning algorithm for scheduling parallel processors with identical speedup functions",
        "authors": "Farid Ziaei, Mohammad Ranjbar",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100485"
    },
    {
        "id": 15713,
        "title": "Employing Machine Learning Models to Predict Return Loss Precisely in 5G Antenna",
        "authors": "Rachit Jain, Vandana Vikas Thakare, Pramod Kumar Singhal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2528/pierm23062505"
    },
    {
        "id": 15714,
        "title": "Bayesian estimation for the reliability function of two parameter exponential distribution under different loss functions",
        "authors": "Maryam N. Abd, Huda A. Rasheed",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0203008"
    },
    {
        "id": 15715,
        "title": "Exploring the Integration of Machine Learning Models in Programming Languages on GitHub: Impact on Compatibility to Address Them",
        "authors": "",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "GitHub repositories are often used for collaborative development, allowing multiple developers to work on the same codebase and contribute their changes. Each repository is typically associated with a specific project, and it can contain everything from code files to documentation, bug reports, and feature requests. Depending on the context, it can contain files, directories, other resources related to a project, and it is often associated with a particular programming language. By default, GitHub automatically detects the primary programming language used in a repository based on the file extensions and content within the repository. However, this detection is not true all the time; there are some potential issues to consider. One of these problems is that the detected language may not accurately reflect the actual programming languages used in the project, especially if the project utilizes multiple programming languages or has undergone language migrations. In this study, we apply an alternative technology to resolve problems with classifying the programming language of a GitHub repository by analysing file extensions and identifying all programming languages used in the project. We also determine the appropriate primary programming language for the repository. This paper investigates how this technology can address the issues surrounding GitHub’s automatic detection of a repository’s primary programming language and how it can provide information on all the programming languages used in a project.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/amlai.04.02.06"
    },
    {
        "id": 15716,
        "title": "Remaining cycle time prediction: Temporal loss functions and prediction consistency",
        "authors": "Mike Riess",
        "published": "2023-8-6",
        "citations": 1,
        "abstract": "The usefulness of remaining cycle time models for predictive and prescriptive process monitoring depends not only on the overall accuracy of the predictions but also on their earliness: predictions should be as accurate as possible, as early as possible. To give this criterion more weight in model fitting, the paper evaluates three L1 loss functions with temporal decay. All have the property of increasing the weight of residuals from the early stages of a process relative to residuals from later stages but do so to different degrees. The loss functions are used in LSTM networks for training remaining throughout time models of four different business processes based on publicly available event log data sets. Compared to models trained with unweighted L1 loss, the suggested modifications yield small but significant improvements in earliness on out-of-sample data. Neither the unweighted L1 loss nor the modifications led to models with strictly monotonically decreasing predictions of the remaining time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5617/nmi.10141"
    },
    {
        "id": 15717,
        "title": "Machine Learning Models for Prostate Cancer Identification",
        "authors": "Elias Dritsas, Maria Trigka, Phivos Mylonas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012236800003598"
    },
    {
        "id": 15718,
        "title": "Botnet Detection by Integrating Multiple Machine Learning Models",
        "authors": "Thanawat Tejapijaya, Prarinya Siritanawan, Karin Sumongkayothin, Kazunori Kotani",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012317700003648"
    },
    {
        "id": 15719,
        "title": "T-norms driven loss functions for machine learning",
        "authors": "Francesco Giannini, Michelangelo Diligenti, Marco Maggini, Marco Gori, Giuseppe Marra",
        "published": "2023-8",
        "citations": 1,
        "abstract": "AbstractInjecting prior knowledge into the learning process of a neural architecture is one of the main challenges currently faced by the artificial intelligence community, which also motivated the emergence of neural-symbolic models. One of the main advantages of these approaches is their capacity to learn competitive solutions with a significant reduction of the amount of supervised data. In this regard, a commonly adopted solution consists of representing the prior knowledge via first-order logic formulas, then relaxing the formulas into a set of differentiable constraints by using a t-norm fuzzy logic. This paper shows that this relaxation, together with the choice of the penalty terms enforcing the constraint satisfaction, can be unambiguously determined by the selection of a t-norm generator, providing numerical simplification properties and a tighter integration between the logic knowledge and the learning objective. When restricted to supervised learning, the presented theoretical framework provides a straight derivation of the popular cross-entropy loss, which has been shown to provide faster convergence and to reduce the vanishing gradient problem in very deep structures. However, the proposed learning formulation extends the advantages of the cross-entropy loss to the general knowledge that can be represented by neural-symbolic methods. In addition, the presented methodology allows the development of novel classes of loss functions, which are shown in the experimental results to lead to faster convergence rates than the approaches previously proposed in the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-022-04383-6"
    },
    {
        "id": 15720,
        "title": "Hybrid deep learning and GARCH-family models for forecasting volatility of cryptocurrencies",
        "authors": "Bahareh Amirshahi, Salim Lahmiri",
        "published": "2023-6",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100465"
    },
    {
        "id": 15721,
        "title": "Predicting Loss-of-Function Impact of Genetic Mutations: A Machine Learning Approach",
        "authors": "Arshmeet Kaur, Morteza Sarmadi",
        "published": "2024",
        "citations": 0,
        "abstract": "The innovation of next-generation sequencing (NGS) techniques has significantly reduced the price of genome sequencing, lowering barriers to future medical research; it is now feasible to apply genome sequencing to studies where it would have previously been costinefficient. Identifying damaging or pathogenic mutations in vast amounts of complex, highdimensional genome sequencing data may be of particular interest for researchers. Thus, this paper’s aims were to train machine learning models on the attributes of a genetic mutation to predict LoFtool scores (which measure a gene’s intolerance to loss-of-function mutations). These attributes included, but were not limited to, the position of a mutation on a chromosome, changes in amino acids, and changes in codons caused by the mutation. Models were built using the univariate feature selection technique f-regression combined with K-nearest neighbors (KNN), Support Vector Machine (SVM), Random Sample Consensus (RANSAC), Decision Trees, Random Forest, and Extreme Gradient Boosting (XGBoost). These models were evaluated using five-fold cross-validated averages of r-squared, mean squared error, root mean squared error, mean absolute error, and explained variance. The findings of this study include the training of multiple models with testing set r-squared values of 0.97.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2024.41119"
    },
    {
        "id": 15722,
        "title": "Application of Multi-Dimensional Clearing Functions Estimated by Machine Learning to Production Planning Problems",
        "authors": "Yihao Yu, Zailin Guan, Zhengmin Zhang, Lei Yue",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587889.3588213"
    },
    {
        "id": 15723,
        "title": "A Comparative Study of Machine Learning and Automatic Machine Learning Models for Facial Mask Recognition",
        "authors": "Yuxin Pei",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccs57501.2023.10151333"
    },
    {
        "id": 15724,
        "title": "Improving the Prediction of Asset Returns With Machine Learning by Using a Custom Loss Function",
        "authors": "Jean Dessain",
        "published": "2023",
        "citations": 0,
        "abstract": "Not all errors from models predicting asset returns are equal in terms of impact on the efficiency of the algorithm: a small error could trigger poor investment decisions while a significant error has no financial consequences. This economic asymmetry, critical for assessing the performance of algorithms, can usefully be replicated within the machine learning algorithms itself through the loss function to improve its prediction capability. . In this article: (a) we analyze symmetric and asymmetric loss functions for deep learning algorithms. We develop custom loss functions that mimic the asymmetry in economic consequences of prediction errors. (b) We compare the efficiency of these custom loss functions with MSE and the linearexponential loss “LinEx”. (c) We present an efficient custom loss function that significantly improves the prediction of asset returns with improved risk-return metrics (like Sharpe ratio twice better), and which we confirm to be robust.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2023.1193"
    },
    {
        "id": 15725,
        "title": "Loss landscape engineering via Data Regulation on PINNs",
        "authors": "Vignesh Gopakumar, Stanislas Pamela, Debasmita Samaddar",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100464"
    },
    {
        "id": 15726,
        "title": "Multi-cancer classification; An analysis of neural network models",
        "authors": "James W. Webber, Kevin Elias",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100468"
    },
    {
        "id": 15727,
        "title": "A comparison of machine learning surrogate models of street-scale flooding in Norfolk, Virginia",
        "authors": "Diana McSpadden, Steven Goldenberg, Binata Roy, Malachi Schram, Jonathan L. Goodall, Heather Richter",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100518"
    },
    {
        "id": 15728,
        "title": "An inpatient fall risk assessment tool: Application of machine learning models on intrinsic and extrinsic risk factors",
        "authors": "Sonia Jahangiri, Masoud Abdollahi, Rasika Patil, Ehsan Rashedi, Nasibeh Azadeh-Fard",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100519"
    },
    {
        "id": 15729,
        "title": "Solving math word problems concerning systems of equations with GPT models",
        "authors": "Mingyu Zong, Bhaskar Krishnamachari",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100506"
    },
    {
        "id": 15730,
        "title": "AN EMPIRICAL INTERPRETATION RULE BASED MODELS IN MACHINE LEARNING",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.8.nq221085"
    },
    {
        "id": 15731,
        "title": "Performance Evaluation of Activation Functions in Extreme Learning Machine",
        "authors": "Karol Struniawski, Aleksandra Konopka, Ryszard Kozera",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-31"
    },
    {
        "id": 15732,
        "title": "Predicting Survival of Tongue Cancer Patients by Machine Learning Models",
        "authors": "Angelos Vasilopoulos, Nan Miles Xi",
        "published": "2023",
        "citations": 3,
        "abstract": "Tongue cancer is a common oral cavity malignancy that originates in the mouth and throat. Much effort has been invested in improving its diagnosis, treatment, and management. Surgical removal, chemotherapy, and radiation therapy remain the major treatment for tongue cancer. The treatment effect is determined by patients’ survival status. Previous studies have identified certain survival and risk factors based on descriptive statistics, ignoring the complex, nonlinear relationship among clinical and demographic variables. In this study, we utilize five cutting-edge machine learning models and clinical data to predict the survival of tongue cancer patients after treatment. Five-fold cross-validation, bootstrap analysis, and permutation feature importance are applied to estimate and interpret model performance. The prognostic factors identified by our method are consistent with previous clinical studies. Our method is accurate, interpretable, and thus useable as additional evidence in tongue cancer treatment and management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2023.1153"
    },
    {
        "id": 15733,
        "title": "COMPARING MACHINE LEARNING AND DEEP LEARNING MODELS",
        "authors": "",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets45900"
    },
    {
        "id": 15734,
        "title": "Machine Learning Models for Predicting Sudden Sensorineural Hearing Loss Outcome: A Systematic Review",
        "authors": "Amirhossein Aghakhani, Milad Yousefi, Mir Saeed Yekaninejad",
        "published": "2024-3",
        "citations": 0,
        "abstract": "Background: Machine Learning models have been applied in various healthcare fields, including Audiology, to predict disease outcomes. The prognosis of sudden sensorineural hearing loss is difficult to predict due to the variable course of the disease. Hence, researchers have attempted to utilize ML models to predict the outcome of patients with sudden sensorineural hearing loss. The objectives of this study were to review the performance of these machine learning models and assess their applicability in real-world settings. Methods: A systematic search was conducted in PubMed, Web of Science and Scopus. Only studies that built machine learning prediction models were included, and studies that used algorithms such as logistic regression only for the purpose of adjusting for confounding variables were excluded. The risk of bias was assessed using the Prediction model Risk of Bias Assessment Tool (PROBAST). Results: After screening, a total of 7 papers were eligible for synthesis. In total, these studies built 48 ML models. The most common utilized algorithms were Logistic Regression, Support Vector Machine (SVM) and boosting. The area under the curve of the receiver operating characteristic curve ranged between 0.59 and 0.915. All of the included studies had a high risk of bias; hence there are concerns regarding their applicability. Conclusion: Although these models showed great performance and promising results, future studies are still needed before these models can be applied in a real-world setting. Future studies should employ multiple cohorts, different feature selection methods, and external validation to further validate the models’ applicability. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00034894231206902"
    },
    {
        "id": 15735,
        "title": "Analyzing different loss functions for Single Image Super-Resolution",
        "authors": "Shakiba Shojaei, Ahmad Mahmoudi-Aznaveh",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mvip62238.2024.10491161"
    },
    {
        "id": 15736,
        "title": "Prediction of Course Grades in Computer Science Higher Education Program via a Combination of Loss Functions in LSTM Model",
        "authors": "Anahita Ghazvini, Nurfadhlina Mohd Sharef, Fatimah Binti Sidi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3351186"
    },
    {
        "id": 15737,
        "title": "L0 and Lp Loss Functions in Model-Robust Estimation of Structural Equation Models",
        "authors": "Alexander Robitzsch",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "The Lp loss function has been used for model-robust estimation of structural equation models based on robustly fitting moments. This article addresses the choice of the tuning parameter ε that appears in the differentiable approximations of the nondifferentiable Lp loss functions. Moreover, model-robust estimation based on the Lp loss function is compared with a recently proposed differentiable approximation of the L0 loss function and a direct minimization of a smoothed version of the Bayesian information criterion in regularized estimation. It turned out in a simulation study that the L0 loss function slightly outperformed the Lp loss function in terms of bias and root mean square error. Furthermore, standard errors of the model-robust SEM estimators were analytically derived and exhibited satisfactory coverage rates.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/psych5040075"
    },
    {
        "id": 15738,
        "title": "Building Machine Learning Models to Detect Item Response Theory Item Misfit",
        "authors": "John Donoghue",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2012571"
    },
    {
        "id": 15739,
        "title": "Investigation of Racial Bias in Property Crime Prediction by Machine Learning Models",
        "authors": "Alexander Li, Mikhail Y. Shalaginov, Andrew Tao, Tingying Helen Zeng",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00340"
    },
    {
        "id": 15740,
        "title": "Assessing the Effects of Extreme Events on Machine Learning Models for Electricity Price Forecasting",
        "authors": "João Borges, Rui Maia, Sérgio Guerreiro",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012038700003467"
    },
    {
        "id": 15741,
        "title": "Comparing the Effectiveness of Different Machine Learning and Deep Learning Models for Fake News Detection",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jier.v3i2.207"
    },
    {
        "id": 15742,
        "title": "Machine Learning Models for Classification of Sensitive Financial Documents",
        "authors": "Kumar Akuthota, A. Ganesh, Basi Reddy A, SivaKumar Depuru",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccmla58983.2023.10346685"
    },
    {
        "id": 15743,
        "title": "Machine Learning: Models And Algorithms",
        "authors": "Daniel Alexandre Bloch",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4493977"
    },
    {
        "id": 15744,
        "title": "Reduced implication-bias logic loss for neuro-symbolic learning",
        "authors": "Hao-Yuan He, Wang-Zhou Dai, Ming Li",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06436-4"
    },
    {
        "id": 15745,
        "title": "Classification of Inflammatory Gene Expression Patterns with Machine Learning Models",
        "authors": "Yeonglong Ay, Yit Hong Choo, Asim Bhatti, Chee Peng Lim",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/prml59573.2023.10348265"
    },
    {
        "id": 15746,
        "title": "Predicting Disengagement to Better Support Outcomes in a Web-Based Weight Loss Program Using Machine Learning Models: Cross-Sectional Study",
        "authors": "Aida Brankovic, Gilly A Hendrie, Danielle L Baird, Sankalp Khanna",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "\nBackground\nEngagement is key to interventions that achieve successful behavior change and improvements in health. There is limited literature on the application of predictive machine learning (ML) models to data from commercially available weight loss programs to predict disengagement. Such data could help participants achieve their goals.\n\n\nObjective\nThis study aimed to use explainable ML to predict the risk of member disengagement week by week over 12 weeks on a commercially available web-based weight loss program.\n\n\nMethods\nData were available from 59,686 adults who participated in the weight loss program between October 2014 and September 2019. Data included year of birth, sex, height, weight, motivation to join the program, use statistics (eg, weight entries, entries into the food diary, views of the menu, and program content), program type, and weight loss. Random forest, extreme gradient boosting, and logistic regression with L1 regularization models were developed and validated using a 10-fold cross-validation approach. In addition, temporal validation was performed on a test cohort of 16,947 members who participated in the program between April 2018 and September 2019, and the remaining data were used for model development. Shapley values were used to identify globally relevant features and explain individual predictions.\n\n\nResults\nThe average age of the participants was 49.60 (SD 12.54) years, the average starting BMI was 32.43 (SD 6.19), and 81.46% (39,594/48,604) of the participants were female. The class distributions (active and inactive members) changed from 39,369 and 9235 in week 2 to 31,602 and 17,002 in week 12, respectively. With 10-fold-cross-validation, extreme gradient boosting models had the best predictive performance, which ranged from 0.85 (95% CI 0.84-0.85) to 0.93 (95% CI 0.93-0.93) for area under the receiver operating characteristic curve and from 0.57 (95% CI 0.56-0.58) to 0.95 (95% CI 0.95-0.96) for area under the precision-recall curve (across 12 weeks of the program). They also presented a good calibration. Results obtained with temporal validation ranged from 0.51 to 0.95 for area under a precision-recall curve and 0.84 to 0.93 for area under the receiver operating characteristic curve across the 12 weeks. There was a considerable improvement in area under a precision-recall curve of 20% in week 3 of the program. On the basis of the computed Shapley values, the most important features for predicting disengagement in the following week were those related to the total activity on the platform and entering a weight in the previous weeks.\n\n\nConclusions\nThis study showed the potential of applying ML predictive algorithms to help predict and understand participants’ disengagement with a web-based weight loss program. Given the association between engagement and health outcomes, these findings can prove valuable in providing better support to individuals to enhance their engagement and potentially achieve greater weight loss.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/43633"
    },
    {
        "id": 15747,
        "title": "Machine Learning-Based Forecasting Models for Wind Turbine Power Output",
        "authors": "Badeti Purna Vamsi Krishna, Sthita Prajna Mishra",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.1223.123439"
    },
    {
        "id": 15748,
        "title": "Goal Agnostic Learning and Planning without Reward Functions",
        "authors": "Christopher Robinson, Joshua Lancaster",
        "published": "2023",
        "citations": 0,
        "abstract": "In this paper we present an algorithm, the Goal Agnostic Planner (GAP), which combines elements of Reinforcement Learning (RL) and Markov Decision Processes (MDPs) into an elegant, effective system for learning to solve sequential problems. The GAP algorithm does not require the design of either an explicit world model or a reward function to drive policy determination, and is capable of operating on both MDP and RL domain problems. The construction of the GAP lends itself to several analytic guarantees such as policy optimality, exponential goal achievement rates, reciprocal learning rates, measurable robustness to error, and explicit convergence conditions for abstracted states. Empirical results confirm these predictions, demonstrate effectiveness over a wide range of domains, and show that the GAP algorithm performance is an order of magnitude faster than standard reinforcement learning and produces plans of equal quality to MDPs, without requiring design of reward functions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2023.1150"
    },
    {
        "id": 15749,
        "title": "Hybrid Deep Transfer Learning Models With Machine Learning Models for High Impedance Fault Detection",
        "authors": "G. M. Biju, G. N. Pillai",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csde59766.2023.10487712"
    },
    {
        "id": 15750,
        "title": "Mean Absolute Directional Loss as a New Loss Function for Machine Learning Problems in Algorithmic Investment Strategies",
        "authors": "Jakub anon, Paweł Sakowski, Robert Ślepaczuk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4575978"
    },
    {
        "id": 15751,
        "title": "Combination of Transfer Deep Learning and Classical Machine Learning Models for Multi-View Image Analysis",
        "authors": "Zheng Xu, Cong Wu",
        "published": "2023-4-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/iocma2023-14401"
    },
    {
        "id": 15752,
        "title": "Efficient surrogate models for materials science simulations: Machine learning-based prediction of microstructure properties",
        "authors": "Binh Duong Nguyen, Pavlo Potapenko, Aytekin Demirci, Kishan Govind, Sébastien Bompas, Stefan Sandfeld",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100544"
    },
    {
        "id": 15753,
        "title": "Machine learning vs. deep learning: Features and functions",
        "authors": "Ebrahim Panah, Hafizan Mat Som, Suhaila Binti Mukhtar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0133398"
    },
    {
        "id": 15754,
        "title": "Deep learning-based macro-bending loss detection by plastic optical fiber specklegram analysis",
        "authors": "Nikhil Vangety, Sourabh Roy",
        "published": "2024-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3015912"
    },
    {
        "id": 15755,
        "title": "An Edge Internet of Things Framework for Machine Learning-Based Skin Cancer Detection Models",
        "authors": "Karthik Reddy Kanjula, Ashok Raju Datla, Tianjie Chen, Md Faisal Kabir",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00327"
    },
    {
        "id": 15756,
        "title": "Machine Learning Models for Bad Loans Prediction",
        "authors": "Alejandro Rodriguez Dominguez",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4447588"
    },
    {
        "id": 15757,
        "title": "Transforming Discrete Event Models To Machine Learning Models",
        "authors": "Hessam S. Sarjoughian, Forouzan Fallah, Seyyedamirhossein Saeidi, Edward J. Yellig",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wsc60868.2023.10407348"
    },
    {
        "id": 15758,
        "title": "Machine learning and multinomal models: A simulation study",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.chan70"
    },
    {
        "id": 15759,
        "title": "Representing Human Ethical Requirements in Hybrid Machine Learning Models: Technical Opportunities and Fundamental Challenges",
        "authors": "Stephen Fox, Vitor Fortes Rey",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "Hybrid machine learning encompasses predefinition of rules and ongoing learning from data. Human organizations can implement hybrid machine learning (HML) to automate some of their operations. Human organizations need to ensure that their HML implementations are aligned with human ethical requirements as defined in laws, regulations, standards, etc. The purpose of the study reported here was to investigate technical opportunities for representing human ethical requirements in HML. The study sought to represent two types of human ethical requirements in HML: locally simple and locally complex. The locally simple case is road traffic regulations. This can be considered to be a relatively simple case because human ethical requirements for road safety, such as stopping at red traffic lights, are defined clearly and have limited scope for personal interpretation. The locally complex case is diagnosis procedures for functional disorders, which can include medically unexplained symptoms. This case can be considered to be locally complex because human ethical requirements for functional disorder healthcare are less well defined and are more subject to personal interpretation. Representations were made in a type of HML called Algebraic Machine Learning. Our findings indicate that there are technical opportunities to represent human ethical requirements in HML because of its combination of human-defined top down rules and bottom up data-driven learning. However, our findings also indicate that there are limitations to representing human ethical requirements: irrespective of what type of machine learning is used. These limitations arise from fundamental challenges in defining complex ethical requirements, and from potential for opposing interpretations of their implementation. Furthermore, locally simple ethical requirements can contribute to wider ethical complexity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/make6010027"
    },
    {
        "id": 15760,
        "title": "From Models to Microservices: Easily Operationalizing Machine Learning models",
        "authors": "Deven Panchal, Isilay Baran, Dan Musgrove, David Lu",
        "published": "2023-11-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca59364.2023.10401515"
    },
    {
        "id": 15761,
        "title": "Detection of Anomalies in Civil Structures Using Machine Learning Models: Benchmark Study",
        "authors": "Vitor dos Santos Amorim, Wyctor Fogos da Rocha, Flávio Tongo da Silva, AALAH Adam",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00290"
    },
    {
        "id": 15762,
        "title": "Interpreting machine-learning models in transformed feature space with an application to remote-sensing classification",
        "authors": "Alexander Brenning",
        "published": "2023-9",
        "citations": 5,
        "abstract": "AbstractModel-agnostic tools for the post-hoc interpretation of machine-learning models struggle to summarize the joint effects of strongly dependent features in high-dimensional feature spaces, which play an important role in semantic image classification, for example in remote sensing of landcover. This contribution proposes a novel approach that interprets machine-learning models through the lens of feature-space transformations. It can be used to enhance unconditional as well as conditional post-hoc diagnostic tools including partial-dependence plots, accumulated local effects (ALE) plots, permutation feature importance, or Shapley additive explanations (SHAP). While the approach can also be applied to nonlinear transformations, linear ones are particularly appealing, especially principal component analysis (PCA) and a proposed partial orthogonalization technique. Moreover, structured PCA and model diagnostics along user-defined synthetic features offer opportunities for representing domain knowledge. The new approach is implemented in the R package , which can be combined with existing explainable machine-learning packages. A case study on remote-sensing landcover classification with 46 features is used to demonstrate the potential of the proposed approach for model interpretation by domain experts. It is most useful in situations where groups of feature are linearly dependent and PCA can provide meaningful multivariate data summaries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10994-023-06327-8"
    },
    {
        "id": 15763,
        "title": "Deep Learning and Machine Learning Models to Predict Energy Consumption in Steel Industry",
        "authors": "Kittisak Kerdprasop,  , Nittaya Kerdprasop, Paradee Chuaybamroong",
        "published": "2023",
        "citations": 0,
        "abstract": "This paper present the study results of predicting energy consumption in the steel industry using modeling methods based on machine learning and deep learning techniques. Machine learning algorithms used in this work include artificial neural network (ANN), k-nearest neighbors (kNN), random forest (RF), and gradient boosting (GB). Deep learning technique is long short-term memory (LSTM). Linear regression, which is the statistical-based learning algorithm, is also applied to be the baseline of this comparative study. The modeling results reveal that among the statistical-based and machine learning-based techniques, GB and RF are the best two models to predict energy consumption, whereas ANN shows the predictive performance comparable to the linear regression model. Nevertheless, LSTM outperforms both statistical-based and machine learning-based algorithms in predicting industrial energy consumption.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2023.13.4.1142"
    },
    {
        "id": 15764,
        "title": "Prediction of Heart Disease Severity Using Hierarchically-Structured Machine-Learning Models with Feature Space Reduction",
        "authors": "Ayami Kiuchi, Tomoya Fujita, Hayato Yamana",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012436700003657"
    },
    {
        "id": 15765,
        "title": "Machine Learning-based Models for Predicting Defective Packages",
        "authors": "Yushuo Wang, Ran Mo, Yao Zhang",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3647750.3647755"
    },
    {
        "id": 15766,
        "title": "Evaluation of Streamflow Predictions from LSTM Models in Water- and Energy-limited Regions in the United States",
        "authors": "Kul Khand, Gabriel B. Senay",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100551"
    },
    {
        "id": 15767,
        "title": "Predictive Models for Oil in Place for Oil Rim Reservoirs in the Niger Delta Using Machine Learning Approach",
        "authors": "Livinus A",
        "published": "2023-7-20",
        "citations": 1,
        "abstract": "One of the key factors that analysts consider when calculating the economics of oil field development is the amount of oil in place (OIP). Conventional methods used for its estimation have some features affecting their predictive capabilities and applications. In addition, Oil bidders have limited time to evaluate and rank reservoirs from complex and large reservoir data packages - which sometimes fees are paid for their access. In this study, data-driven machine learning models - artificial neural network (ANN), support vector regression (SVR) and multiple linear regression (MLR) were developed for quick estimation of OIP for oil rim reservoirs in the Niger Delta. The models were evaluated using statistical error tools, and the results showed reasonable predictions. The sensitivity analysis performed on the selected input parameters showed that areal extent has the greatest impact on the estimation of the OIP with 29.94 %, oil formation volume factor has 22.74 % impact, oil column thickness was 16.61 %, m-factor has 13.29 %, water saturation was 9.01 %, and lastly porosity has 8.38 %. Comparison with recovery factor surrogate models existing in open literature were also carried out. The newly developed models can be helpful for oil bidders in ranking and evaluation of oil rim reservoirs in the Niger Delta.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/ppej-16000361"
    },
    {
        "id": 15768,
        "title": "Estimation of the Inference Quality of Machine Learning Models for Cutting Tools Inspection",
        "authors": "Kacper Marciniak, Paweł Majewski, Jacek Reiner",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012321900003660"
    },
    {
        "id": 15769,
        "title": "Long Short-Term Memory (LSTM) Based Deep Learning Models for Predicting Univariate Time Series Data",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2024.14.1.1154"
    },
    {
        "id": 15770,
        "title": "Light pollution assessment models based on multimodal machine learning",
        "authors": "Hongyang He",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4511502"
    },
    {
        "id": 15771,
        "title": "Early Warning System of Attrition in the BPO Industry Using Machine Learning Classification Models",
        "authors": "Sandrilito Abogada, Laurence Usona",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Employee attrition is one of the factors affecting gross margin erosion in the BPO industry, the fastest-growing industry in the Philippines, due to hiring and training costs. The cost of employee attrition depends on the employee's role and salary/wage level. This study proposed shifting the retention approach from reactive to proactive with the use of an early warning system for employee attrition. The early warning system was powered by Machine Learning Classification Models. The data used in this study are employees hired in 2021 and 2022 from one of the Telco/Communication programs in the BPO Industry. The data attributes considered in this study are composed of Employee status, Employee Performance, Employee Satisfaction, Payroll, Time Off History, Schedule, and employee Observation data. The data is trained and tested in the classification models (Decision Trees, rule-based classification, naïve Bayes, KNN, Logistic Regression, and Random Forest). Models are evaluated using the classification performance metrics (AUC, Accuracy, Precision, Recall, and F1 Score). The model with the highest predictive accuracy is selected and deployed to produce employee classification (Risk of Termination, Neutral, and Positive). This study mainly helps the company reduce turnover and costs and increase gross margin with the help of the early warning system that can predict the status of the employees using significant indicators.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.43.18.30"
    },
    {
        "id": 15772,
        "title": "Analysis of Stacked Ensemble Classification Models in Cervical Cancer Prediction using Machine learning",
        "authors": "",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.19.nq99296"
    },
    {
        "id": 15773,
        "title": "Macroeconomic Adverse Selection in Machine Learning Models of Credit Risk †",
        "authors": "Joseph L. Breeden, Yevgeniya Leonova",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039095"
    },
    {
        "id": 15774,
        "title": "Our MapAI approach: focusing on data pipeline and loss functions",
        "authors": "Tord Kriznik Sørensen, Martijn Vermeer, Jacob Alexander Hay, Daniele Fantin, David Völgyes",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "Precision building detection is a difficult challenge because resolution, lighting conditions, and image quality greatly influence the performance of machine learning models. Additionally, the building types, settlement structure, road structure, soil color and texture, vegetation, and car types can also affect image segmentation, making the solutions local or regional. In this paper, we describe the solution for the MapAI challenge submitted by the ATELIER team. We focused on two primary parts: data processing and loss functions. Our main insights were that the data can be effectively resampled by exploiting its structure and that the boundary intersection over union metric is very forgiving, not giving the network enough incentive to refine the borders. The segmentation was performed with a standard 5-level deep U-Net with an additional conditional random fields (CRF) denoiser.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5617/nmi.10161"
    },
    {
        "id": 15775,
        "title": "Quantile Loss Function Empowered Machine Learning Models for Predicting Carotid Arterial Blood Flow Characteristics",
        "authors": "T. Raja Rani, Woshan Srimal, Abdullah Al Shibli, Nooh Zayid Suwaid Al Bakri, Mohamed Siraj, T. S. L. Radhika",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "This research presents a novel approach using machine learning models with the quantile loss function to predict blood flow characteristics, specifically the wall shear stress, in the common carotid artery and its bifurcated segments, the internal and external carotid arteries. The dataset for training these models was generated through a numerical model developed for the idealized artery. This model represented blood as an incompressible Newtonian fluid and the artery as an elastic pipe with varying material properties, simulating different flow conditions. The findings of this study revealed that the quantile linear regression model is the most reliable in predicting the target variable, i.e., wall shear stress in the common carotid artery. On the other hand, the quantile gradient boosting algorithm demonstrated exceptional performance in predicting wall shear stress in the bifurcated segments. Through this study, the blood velocity and the wall shear stress in the common carotid artery are identified as the most important features affecting the wall shear stress in the internal carotid artery, while the blood velocity and the blood pressure affected the same in the external carotid artery the most. Furthermore, for a given record of the feature dataset, the study revealed the efficacy of the quantile linear-regression model in capturing a possible prevalence of atherosclerotic conditions in the internal carotid artery. But then, it was not very successful in identifying the same in the external carotid artery. However, due to the use of idealized conditions in the study, these findings need comprehensive clinical verification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/23208.2023.20.16"
    },
    {
        "id": 15776,
        "title": "Applying Machine Learning models to Diagnosing Migraines with EEG Diverse Algorithms",
        "authors": "Hye Kyeong Ko",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "This study investigates how well time collection analysis may be used by system-studying algorithms to diagnose migraines. Through the use of various algorithms and current statistical resources, such as EEG activity and affected person histories, the mission will develop a predictive model to identify the start of migraine signs and symptoms, allowing for prompt and early management for sufferers. The results will help to compare how the algorithms affect migraine accuracy predictions and how well they forecast migraine presence early enough for preventative interventions. Furthermore, studies may be conducted to examine the model's ability to be employed in real-time patient monitoring and to identify actionable inputs from the algorithms. This work presents novel machine learning algorithms software for time series analysis of functions such as temperature, heart rate, and EEG indications, which can be used to identify migraines. The paper delves into the idea of utilizing machine learning algorithms to identify migraine styles, examines the pre-processing procedures to accurately arrange the indications, and provides the results of a study conducted to evaluate the efficacy of the solution. The observation's results show that the suggested diagnostic framework is capable of accurately identifying and categorizing migraines, enabling medical professionals to recognize the warning indications of migraine and predict when an attack would begin. The examination demonstrates the possibility of devices learning algorithms to correctly and accurately diagnose migraines, but more research is necessary to obtain more detailed information about this situation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/7669/jmc202404016"
    },
    {
        "id": 15777,
        "title": "HE-MAN – Homomorphically Encrypted MAchine learning with oNnx models",
        "authors": "Martin Nocker, David Drexel, Michael Rader, Alessio Montuoro, Pascal Schöttle",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589883.3589889"
    },
    {
        "id": 15778,
        "title": "Machine Learning Classifier for Supporting Generator’s Impedance-Based Relay Protection Functions",
        "authors": "Petar Sarajcev, Dino Lovric",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "Transient stability of the electric power system still heavily rests on a timely and correct operation of the relay protection of individual power generators. Power swings and generator pole slips, following network short-circuit events, can initiate false relay activations, with negative repercussions for the overall system stability. This paper will examine the generator’s underimpedance (21G) and out-of-step (78) protection functions and will propose a machine learning based classifier for supporting and reinforcing their decision-making logic. The classifier, based on a support vector machine, will aid in blocking the underimpedance protection during stable generator swings. It will also enable faster tripping of the out-of-step protection for unstable generator swings. Both protection functions will feature polygonal protection characteristics. Their implementation will be based on European practice and IEC standards. Classifier will be trained and tested on the data derived from simulations of the IEEE New England 10-generator benchmark power system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en17081820"
    },
    {
        "id": 15779,
        "title": "Machine Learning Predictive Models for Phosphate Exploration",
        "authors": "Nouha Mezned",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282441"
    },
    {
        "id": 15780,
        "title": "A Fairness Parameter Selection Method for Convex Fairness-aware Classification Models",
        "authors": "Puvarith Veerabulyarith, Seksan Kiatsupaibul",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3635638.3635645"
    },
    {
        "id": 15781,
        "title": "Exploring Wordle- Based on Improved Machine Learning Models",
        "authors": "Boyu Li, Kuangji Zuo, Hongde Xiao",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvidl58838.2023.10166102"
    },
    {
        "id": 15782,
        "title": "Comparing Activation Functions in Machine Learning for Finite Element Simulations in Thermomechanical Forming",
        "authors": "Olivier Pantalé",
        "published": "2023-11-25",
        "citations": 0,
        "abstract": "Finite element (FE) simulations have been effective in simulating thermomechanical forming processes, yet challenges arise when applying them to new materials due to nonlinear behaviors. To address this, machine learning techniques and artificial neural networks play an increasingly vital role in developing complex models. This paper presents an innovative approach to parameter identification in flow laws, utilizing an artificial neural network that learns directly from test data and automatically generates a Fortran subroutine for the Abaqus standard or explicit FE codes. We investigate the impact of activation functions on prediction and computational efficiency by comparing Sigmoid, Tanh, ReLU, Swish, Softplus, and the less common Exponential function. Despite its infrequent use, the Exponential function demonstrates noteworthy performance and reduced computation times. Model validation involves comparing predictive capabilities with experimental data from compression tests, and numerical simulations confirm the numerical implementation in the Abaqus explicit FE code.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16120537"
    },
    {
        "id": 15783,
        "title": "Machine Learning Alternatives to Response Surface Models",
        "authors": "Badih Ghattas, Diane Manzon",
        "published": "2023-8-4",
        "citations": 1,
        "abstract": "In the Design of Experiments, we seek to relate response variables to explanatory factors. Response Surface methodology (RSM) approximates the relation between output variables and a polynomial transform of the explanatory variables using a linear model. Some researchers have tried to adjust other types of models, mainly nonlinear and nonparametric. We present a large panel of Machine Learning approaches that may be good alternatives to the classical RSM approximation. The state of the art of such approaches is given, including classification and regression trees, ensemble methods, support vector machines, neural networks and also direct multi-output approaches. We survey the subject and illustrate the use of ten such approaches using simulations and a real use case. In our simulations, the underlying model is linear in the explanatory factors for one response and nonlinear for the others. We focus on the advantages and disadvantages of the different approaches and show how their hyperparameters may be tuned. Our simulations show that even when the underlying relation between the response and the explanatory variables is linear, the RSM approach is outperformed by the direct neural network multivariate model, for any sample size (<50) and much more for very small samples (15 or 20). When the underlying relation is nonlinear, the RSM approach is outperformed by most of the machine learning approaches for small samples (n ≤ 30).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11153406"
    },
    {
        "id": 15784,
        "title": "HOAX DETECTION USING MACHINE LEARNING MODELS",
        "authors": "",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets51618"
    },
    {
        "id": 15785,
        "title": "Machine Learning Model for High-Frequency Magnetic Loss Predictions Based on Loss Map by a Measurement Kit",
        "authors": "Xiaobing Shen, Wilmar Martinez",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/epe23ecceeurope58414.2023.10264272"
    },
    {
        "id": 15786,
        "title": "An Experimental Study on the Differences between Classical Machine Learning and Quantum Machine Learning Models",
        "authors": " Vineet Kumar,  Subrata Sahana",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "The field of Machine Learning (ML) brought a massive revolution and change in how normal day operations used to happen in various businesses. The idea of ML was quite simple, merging two separate fields, Mathematics and Computer Science. This simple idea is the very reason that so many predictive and classification-based applications exist today. The development of such applications is a time-consuming process and is very computationally heavy because in the corporate world, a very large amount of historical data is used and processed. The training processes such as pre-processing, data engineering and transformations, deep learning, training and testing are themselves time consuming. A very new field of computer science deals with solving this exact problem of time consumption. Quantum Computing (QC) tries to solve these problems by using the concepts of Quantum Mechanics during computations. The QC technology claims to be not only fast in its computational speed but also more efficient and accurate as well. The following article consists of an experiment conducted where a machine learning model is trained in a classical computing environment using K-Nearest Neighbors (KNN) algorithm versus in a quantum computing environment using Quantum K-Nearest Neighbors (QKNN) algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58260/j.nras.2202.0107"
    },
    {
        "id": 15787,
        "title": "Deciphering Genetic Overlaps: A Comprehensive Study On Viral Host Determination Using Machine Learning And Deep Learning Models",
        "authors": "Pankaj Agarwal, Sapna Yadav",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jaz.v45i3.4451"
    },
    {
        "id": 15788,
        "title": "Prediction of crop yield in India using machine learning and hybrid deep learning models",
        "authors": "Krithikha Sanju Saravanan, Velammal Bhagavathiappan",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11600-024-01312-8"
    },
    {
        "id": 15789,
        "title": "Analisis Perbandingan Kinerja Model Machine Learning untuk Memprediksi Risiko Stunting pada Pertumbuhan Anak",
        "authors": "Nur Fitriyani Sahamony, Terttiaavini Terttiaavini, Harsih Rianto",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "Stunting menjadi masalah serius dalam pertumbuhan anak di Indonesia, mendorong penelitian ini untuk mengembangkan model prediksi menggunakan Machine Learning. Tujuan penelitian adalah membandingkan performa dari lima algoritma yaitu Random Forest, Logistic Regression, Naïve Bayes, SVM dan  Neural Networks untuk memprediksi stunting anak. Data stunting anak tahun 2023 dari Kota Lubuk Linggau yang digunakan dengan total 400 sampel. Metodologi penelitian melibatkan langkah inisiasi, pengembangan model linier, pembandingan hasil pengujian model, dan analisis prediksi menggunakan platform KNIME. Hasil uji menunjukkan bahwa Naïve Bayes memiliki performa tertinggi dengan akurasi = 98,57%, F1-Score = 0,99, serta recall dan precision yang sangat tinggi. Random Forest juga memberikan hasil baik dengan akurasi = 98,29%, namun Naïve Bayes diidentifikasi sebagai model terbaik. Penelitian ini memberikan kontribusi signifikan dalam upaya untuk pencegahan stunting dengan menggabungkan teknologi Machine Learning dan analisis dataset kesehatan. Dengan mengembangkan model prediksi menggunakan berbagai algoritma machine learning, diharapkan dapat membantu praktisi kesehatan dalam mengidentifikasi risiko stunting secara dini. Model yang optimal dapat digunakan sebagai alat pendukung keputusan untuk memberikan intervensi yang tepat dan efektif.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1210"
    },
    {
        "id": 15790,
        "title": "Deep Metric Learning: Loss Functions Comparison",
        "authors": "R. L. Vasilev, A. G. D’yakonov",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1064562423701053"
    },
    {
        "id": 15791,
        "title": "Analysis and Improvement of Machine Learning Models for Detecting Street Lighting Lamps",
        "authors": "Igor Caetano Silva, Ricardo Menezes Salgado, Igor Mattos Varejão, Flavio Miguel Varejão",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "The Brazilian public lighting network is maintained by city halls. To bill the energy provided to city halls, energy distribution companies should maintain an updated database of network poles, their lamp types, and wattages. However, it is common to encounter issues with misinformation, where the company is not notified about changes in the public lighting network by city halls and cannot update its database appropriately. To mitigate commercial losses, companies have resorted to sending teams for manual infrastructure checks, which is an expensive, time-consuming, and unreliable process. In this regard, this work aims to optimize the models proposed in the literature capable of accurately classifying the type and wattage of lamps on public lighting poles based on data collected from radiometric sensors and a professional camera. Data is processed using traditional machine learning and deep learning algorithms, along with more sophisticated validation techniques such as data transformation and hyperparameter optimization to achieve improved results. Based on this methodology, the results demonstrate that models employing more robust algorithms (Support Vector Machine, XGBoost, Random Forest, and Multilayer Perceptron) can attain a final average accuracy of 80-86%. This confirms the usefulness of this methodology as an alternative solution to address the issue of public lighting billing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21528/lnlm-vol21-no2-art2"
    },
    {
        "id": 15792,
        "title": "TeraHertz Path-Loss Prediction Indoor using Machine Learning",
        "authors": "Nagma Elburki, Affes Sofiene",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic_aset58101.2023.10151166"
    },
    {
        "id": 15793,
        "title": "Discriminative feature learning through feature distance loss",
        "authors": "Tobias Schlagenhauf, Yiwen Lin, Benjamin Noack",
        "published": "2023-3",
        "citations": 0,
        "abstract": "AbstractEnsembles of convolutional neural networks have shown remarkable results in learning discriminative semantic features for image classification tasks. However, the models in the ensemble often concentrate on similar regions in images. This work proposes a novel method that forces a set of base models to learn different features for a classification task. These models are combined in an ensemble to make a collective classification. The key finding is that by forcing the models to concentrate on different features, the classification accuracy is increased. To learn different feature concepts, a so-called feature distance loss is implemented on the feature maps. The experiments on benchmark convolutional neural networks (VGG16, ResNet, AlexNet), popular datasets (Cifar10, Cifar100, miniImageNet, NEU, BSD, TEX), and different training samples (3, 5, 10, 20, 50, 100 per class) show the effectiveness of the proposed feature loss. The proposed method outperforms classical ensemble versions of the base models. The Class Activation Maps explicitly prove the ability to learn different feature concepts. The code is available at: https://github.com/2Obe/Feature-Distance-Loss.git.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00138-023-01379-1"
    },
    {
        "id": 15794,
        "title": "Developing Machine Learning and Deep Learning Soil Moisture Models for Precision Agricultural Applications",
        "authors": "Xiaomo Zhang, Zhulu Lin, Xin (Rex) Sun",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13031/aim.202300205"
    },
    {
        "id": 15795,
        "title": "Sentiment Analysis of Financial Textual data Using Machine Learning and Deep Learning Models",
        "authors": "Hero O. Ahmad, Shahla U. Umar",
        "published": "2023-5-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31449/inf.v47i5.4673"
    },
    {
        "id": 15796,
        "title": "Evaluating Machine Learning and Statistical Models for Greenland Subglacial Bed Topography",
        "authors": "Katherine Yi, Angelina Dewar, Tartela Tabassum, Jason Lu, Ray Chen, Homayra Alam, Omar Faruque, Sikan Li, Mathieu Morlighem, Jianwu Wang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00097"
    },
    {
        "id": 15797,
        "title": "Efficient Representation of Biochemical Structures for Supervised and Unsupervised Machine Learning Models Using Multi-Sensoric Embeddings",
        "authors": "Katrin Bohnsack, Alexander Engelsberger, Marika Kaden, Thomas Villmann",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011644000003414"
    },
    {
        "id": 15798,
        "title": "Predicting Click Behavior Based on Machine Learning Models",
        "authors": "Xiaoyu Zhou",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "As businesses spend a great amount of advertising dollars each year and hope to achieve marketing objectives, advertising practitioners often advise them to understand customer behavior and customize target audience. This study gains information about click behavior and uses those to help brands make targeting decisions. In the study, a predictive analysis on whether a viewer clicks on the ad was conducted to build a model that forecasts user clicks and forms a list of potentially interested viewers. The predictive model included variables that mainly contained viewer information, such as ‘Daily Time Spent on Site’, ‘Age’, ‘Area Income’, etc., and were chosen based on correlations with each other. After splitting the samples with a 7:3 ratio, machine Learning algorithms, including Logistic Regression, Random Forest, and Support Vector Machine, were used to build the model. Each model was implemented on both datasets, and with no sign of overfitting shown, Support Vector Machine model outperformed other models with a 97% prediction accuracy on training data and a 96% prediction accuracy on testing data. With this model being able to generalize well on new data points, businesses can start implementing it to filter out the audience who will click on an ad and show interests in the brand/product. This deeper understanding of the audience will help improve targeting for campaigns with different objectives and achieve higher advertising efficiency and effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v44i.4822"
    },
    {
        "id": 15799,
        "title": "Improving quality care in sepsis through machine learning models",
        "authors": "Robert van den Heuvel",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55788/368e63ab"
    },
    {
        "id": 15800,
        "title": "Generalization despite overfitting in quantum machine learning models",
        "authors": "Evan Peters, Maria Schuld",
        "published": "2023-12-20",
        "citations": 3,
        "abstract": "The widespread success of deep neural networks has revealed a surprise in classical machine learning: very complex models often generalize well while simultaneously overfitting training data. This phenomenon of benign overfitting has been studied for a variety of classical models with the goal of better understanding the mechanisms behind deep learning. Characterizing the phenomenon in the context of quantum machine learning might similarly improve our understanding of the relationship between overfitting, overparameterization, and generalization. In this work, we provide a characterization of benign overfitting in quantum models. To do this, we derive the behavior of a classical interpolating Fourier features models for regression on noisy signals, and show how a class of quantum models exhibits analogous features, thereby linking the structure of quantum circuits (such as data-encoding and state preparation operations) to overparameterization and overfitting in quantum models. We intuitively explain these features according to the ability of the quantum model to interpolate noisy data with locally \"spiky\" behavior and provide a concrete demonstration example of benign overfitting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-12-20-1210"
    },
    {
        "id": 15801,
        "title": "Incorporating hardware metrics to model cards to evaluate utilization of machine learning models on IoT devices",
        "authors": "Shageenth Sandrakumar, Nicholas Del Rio, Simon Khan",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2682712"
    },
    {
        "id": 15802,
        "title": "IoT Device Classification Using Link-Level Features for Traditional Machine Learning and Large Language Models",
        "authors": "Gabriel Morales, Farhan Romit, Adam Bienek-Parrish, Patrick Jenkins, Rocky Slavin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012365700003648"
    },
    {
        "id": 15803,
        "title": "A Survey on Hyperparameter Optimization of Machine Learning Models",
        "authors": " Monica, Parul Agrawal",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489732"
    },
    {
        "id": 15804,
        "title": "Water Quality Monitoring and Prediction Using Machine Learning Models",
        "authors": "Omkar Bhalerao, Allam Mohan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4487070"
    },
    {
        "id": 15805,
        "title": "Review of Machine Learning Models for Application in Adaptive Learning for Higher Education Student",
        "authors": "Semen M. Levin -",
        "published": "2024-3-23",
        "citations": 0,
        "abstract": "The article reviews machine learning models and their application in the context of adaptive learning. The main focus is on the capabilities of adapting models for personalizing the educational process. The article also highlights issues related to the limitations of integrating machine learning into educational systems, including the problems of requiring large datasets and the need for specialized resources. Furthermore, it discusses the challenges in integrating and standardizing these technologies into existing educational systems and considers probable directions for future research. The problems of developing and implementing the technologies described in the article in higher education systems are noted.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i02.15481"
    },
    {
        "id": 15806,
        "title": "Probability of default for lifetime credit loss for IFRS 9 using machine learning competing risks survival analysis models",
        "authors": "Cayan Atreio Portela Bárcena Saavedra, Juliana Betini Fachini-Gomes, Eduardo Monteiro de Castro Gomes, Herbert Kimura",
        "published": "2024-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123607"
    },
    {
        "id": 15807,
        "title": "Sentimental analysis of COVID-19 twitter data using deep learning and machine learning models",
        "authors": "Simran Darad, Sridhar Krishnan",
        "published": "2023-1-1",
        "citations": 2,
        "abstract": "The novel coronavirus disease (COVID-19) is an ongoing pandemic with large global attention. However, spreading fake news on social media sites like Twitter is creating unnecessary anxiety and panic among people towards this disease. In this paper, we applied machine learning (ML) techniques to predict the sentiment of the people using social media such as Twitter during the COVID-19 peak in April 2021. The data contains tweets collected on the dates between 16 April 2021 and 26 April 2021 where the text of the tweets has been labelled by training the models with an already labelled dataset of corona virus tweets as positive, negative, and neutral. Sentiment analysis was conducted by a deep learning model known as Bidirectional Encoder Representations from Transformers (BERT) and various ML models for text analysis and performance which were then compared among each other. ML models used were Naïve Bayes, Logistic Regression, Random Forest, Support Vector Machines, Stochastic Gradient Descent and Extreme Gradient Boosting. Accuracy for every sentiment was separately calculated. The classification accuracies of all the ML models produced were 66.4%, 77.7%, 74.5%, 74.7%, 78.6%, and 75.5\\%, respectively and BERT model produced 84.2%. Each sentiment-classified model has accuracy around or above 75%, which is a quite significant value in text mining algorithms. We could infer that most people tweeting are taking positive and neutral approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17163/ings.n29.2023.10"
    },
    {
        "id": 15808,
        "title": "A novel application of XAI in squinting models: A position paper",
        "authors": "Kenneth Wenger, Katayoun Hossein Abadi, Damian Fozard, Kayvan Tirdad, Alex Dela Cruz, Alireza Sadeghian",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100491"
    },
    {
        "id": 15809,
        "title": "Integrating machine learning with pharmacokinetic models: Benefits of scientific machine learning in adding neural networks components to existing PK models",
        "authors": "Diego Valderrama, Ana Victoria Ponce‐Bobadilla, Sven Mensing, Holger Fröhlich, Sven Stodtmann",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractRecently, the use of machine‐learning (ML) models for pharmacokinetic (PK) modeling has grown significantly. Although most of the current approaches use ML techniques as black boxes, there are only a few that have proposed interpretable architectures which integrate mechanistic knowledge. In this work, we use as the test case a one‐compartment PK model using a scientific machine learning (SciML) framework and consider learning an unknown absorption using neural networks, while simultaneously estimating other parameters of drug distribution and elimination. We generate simulated data with different sampling strategies to show that our model can accurately predict concentrations in extrapolation tasks, including new dosing regimens with different sparsity levels, and produce reliable forecasts even for new patients. By using a scenario of fitting PK data with complex absorption, we demonstrate that including known physiological structure into an SciML model allows us to obtain highly accurate predictions while preserving the interpretability of classical compartmental models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/psp4.13054"
    },
    {
        "id": 15810,
        "title": "Measuring and Modifying Factual Knowledge in Large Language Models",
        "authors": "Pouya Pezeshkpour",
        "published": "2023-12-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00122"
    },
    {
        "id": 15811,
        "title": "Evaluating Critical Weather Parameters Using Machine Learning Models",
        "authors": "Maede Najian, Navid Goudarzi",
        "published": "2023-8-6",
        "citations": 1,
        "abstract": "Abstract\nWind speed and temperature forecasting accurately for an urban area are two critical elements to mitigate cost and energy in engineering calculations. Recently, researchers have employed a combination of mesoscale Weather Research and Forecasting (WRF) and microscale models of Computational Fluid Dynamics (CFD) to simulate wind flow in urban areas. Employing machine learning algorithms is also introduced as another promising alternative/complementary tool. In this work, a WRF model is developed to calculate wind speed at 10m above the ground in two different residential regions with different upwind roughness in Singapore. The results are validated by the literature. Using the validated model, Recurrent Neural Network (RNN) models are developed to compare with numerical weather models and evaluate their performance in prediction. Prediction results’ accuracy is evaluated using Root Mean Square Error (RMSE) and Mean Absolute Percentage Error (MAPE), and obtained errors below 0.19 and 5%, respectively. The models can provide high-resolution data as boundary conditions for CFD modeling at the local/building scale, which leads to understanding the more realistic behavior of the flow field in a built environment. In addition, they support an extended range of urban microclimate analysis, renewable energy integration practices, and smart city planning efforts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/power2023-108893"
    },
    {
        "id": 15812,
        "title": "Stroke prediction using machine learning models",
        "authors": "Junyi Li",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2692928"
    },
    {
        "id": 15813,
        "title": "Adversarial Auditing of Machine Learning Models under Compound Shift",
        "authors": "Karan Bhanot, Dennis Wei, Ioana Baldini, Kristin Bennett",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-182"
    },
    {
        "id": 15814,
        "title": "Physicians should build their own machine-learning models",
        "authors": "Yosra Magdi Mekki",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patter.2024.100948"
    },
    {
        "id": 15815,
        "title": "Enhancing Machine Learning Capabilities in Injection Molded Part Quality Prediction Using Transfer Learning Models",
        "authors": "Ming-Shyan Huang, Chia-Chin Chen",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmt59920.2023.10373654"
    },
    {
        "id": 15816,
        "title": "Machine Learning and Deep Learning Models for Early Detection of Heart Disease",
        "authors": "Gurpreet Singh, Kalpna Guleria, Shagun Sharma",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425392"
    },
    {
        "id": 15817,
        "title": "Comparative Study of Deep Learning Models Versus Machine Learning Models for Wind Turbine Intelligent Health Diagnosis Systems",
        "authors": "Aaron Rasheed Rababaah",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13369-023-07810-z"
    },
    {
        "id": 15818,
        "title": "Integration of Machine Learning Safety Functions in the Ontology of Functional Safety",
        "authors": "Michael Kieviet, Padma Iyenghar",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indin51400.2023.10217928"
    },
    {
        "id": 15819,
        "title": "Single Well Casing Loss Prediction Method Based on Machine Learning",
        "authors": "Li Yuheng",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442872"
    },
    {
        "id": 15820,
        "title": "Calibration and uncertainty analysis of groundwater models assisted by machine learning surrogates",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.janardhanan"
    },
    {
        "id": 15821,
        "title": "Supervised Machine Learning Models for Liver Disease Risk Prediction",
        "authors": "Elias Dritsas, Maria Trigka",
        "published": "2023-1-13",
        "citations": 22,
        "abstract": "The liver constitutes the largest gland in the human body and performs many different functions. It processes what a person eats and drinks and converts food into nutrients that need to be absorbed by the body. In addition, it filters out harmful substances from the blood and helps tackle infections. Exposure to viruses or dangerous chemicals can damage the liver. When this organ is damaged, liver disease can develop. Liver disease refers to any condition that causes damage to the liver and may affect its function. It is a serious condition that threatens human life and requires urgent medical attention. Early prediction of the disease using machine learning (ML) techniques will be the point of interest in this study. Specifically, in the content of this research work, various ML models and Ensemble methods were evaluated and compared in terms of Accuracy, Precision, Recall, F-measure and area under the curve (AUC) in order to predict liver disease occurrence. The experimental results showed that the Voting classifier outperforms the other models with an accuracy, recall, and F-measure of 80.1%, a precision of 80.4%, and an AUC equal to 88.4% after SMOTE with 10-fold cross-validation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers12010019"
    },
    {
        "id": 15822,
        "title": "Raisin Grain Classification Using Machine Learning Models",
        "authors": "Onur Sahin",
        "published": "2023-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs57921.2023.10063039"
    },
    {
        "id": 15823,
        "title": "Machine Learning vs Deep Learning Models for Detecting Fake News: A Comparative Analysis on Fake-NewsNet Dataset",
        "authors": "Ashok Kumar Reddy Nadikattu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4382241"
    },
    {
        "id": 15824,
        "title": "EnCoDe: Enhancing Compressed Deep Learning Models Through Feature - - - Distillation and Informative Sample Selection",
        "authors": "Rebati Gaire, Sepehr Tabrizchi, Arman Roohi",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00093"
    },
    {
        "id": 15825,
        "title": "A Novel System for Regional Twitter Hate Speech Analysis and Detection using Deep Learning Models and Web Scraping",
        "authors": "Nicole Ma, Yu Sun",
        "published": "2023-1-28",
        "citations": 1,
        "abstract": "Instances of hate speech on popular social media platforms such as Twitter are becoming increasingly common and intense. However, there still exists a lack of comprehensive deeplearning models to combat Twitter hate speech. In this project, a comprehensive detection and reporting platform, entitled “TweetWatch,” was created to solve this issue. A binary classification CNN (Convolutional Neural Network) and a multi-class CNN were created to detect hate speech from real-time Twitter data and classify tweets with hate speech into five categories. The binary classification model has an AUC score of 98.95% and an F1 score of 97.88%. The multi-class classification model has an AUC score of 89.46%. All metrics reached over a targeted 5% increase from previous models in multiple papers, validating the proposed solution. Additionally, the only real-time choropleth map for hate speech in the United States was successfully created.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130207"
    },
    {
        "id": 15826,
        "title": "Do Machine Learning Models Represent Their Targets?",
        "authors": "Emily Sullivan",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Abstract\nI argue that machine learning (ML) models used in science function as highly idealized toy models. If we treat ML models as a type of highly idealized toy model, then we can deploy standard representational and epistemic strategies from the toy model literature to explain why ML models can still provide epistemic success despite their lack of similarity to their targets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/psa.2023.151"
    },
    {
        "id": 15827,
        "title": "A Machine Learning Approach Using Interpretable Models for Predicting Success of NCAA Basketball Players to Reach NBA",
        "authors": "Dante Costa, Joseana Fechine, José Brito, João Ferro, Evandro Costa, Roberta Lopes",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012390000003636"
    },
    {
        "id": 15828,
        "title": "Machine Learning Models for Student Performance Prediction",
        "authors": "Shilpa Mangesh Pande",
        "published": "2023-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icidca56705.2023.10099503"
    },
    {
        "id": 15829,
        "title": "Determining Coke Moisture Content Through Images Analysis Methods and Machine Learning Models",
        "authors": "M. Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/c.particles.2023.010"
    },
    {
        "id": 15830,
        "title": "Time Series and Machine Learning Hybrid Models for Food Condiment Demand Forecasting: A Case Study in Thailand",
        "authors": "Naragain Phumchusri,  ",
        "published": "2024",
        "citations": 0,
        "abstract": "Food industry is one of the most important industries in Thailand. The case-study company is a condiment manufacturer that needs to efficiently manage and plan for their business. One of the most important issues is demand forecasting. The company should precisely forecast their product demands, which will be used for operation planning. This study proposes forecasting models for both short-term and long-term planning for the company’s main condiment products. The proposed models are time series, machine learning and hybrid forecasting models which will be compared with pure time series and machine learning methods. Unlike previous work, this study proposes an innovative hybrid model, i.e., Holt- Winters exponential smoothing and Seasonal Autoregressive Integrated Moving average hybrid with Artificial neural network, which has never been considered previously. The accuracy is measured by mean absolute percentage error (MAPE) where the results are also compared to the method currently used in the company. The results show hybrid forecasting model provides the lowest overall error for both short-term and long-term forecast. The most accurate model from this paper can provide MAPE of 2.07% from short-term forecast and MAPE of 2.20% for long-term forecast (6 months in advance). When comparing with the company’s existing MAPE of 20.05%, the proposed model can increase forecast accuracy effectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijml.2024.14.1.1149"
    },
    {
        "id": 15831,
        "title": "Performance comparison of machine learning models used for predicting subclinical mastitis in dairy cows: bagging, boosting, stacking and super-learner ensembles versus single machine learning models",
        "authors": "A. Satoła, K. Satoła",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3168/jds.2023-24243"
    },
    {
        "id": 15832,
        "title": "Employee turnover prediction using machine learning models",
        "authors": "Chenyu Liao",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672733"
    },
    {
        "id": 15833,
        "title": "Multiple Machine Learning Models on Credit Card Fraud Detection",
        "authors": "Minjun Dai",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Nowadays, there is a huge increase in digital financial fraud as a result of the widespread usage of credit cards for online purchases. Therefore, a credit card fraud detection method with high accuracy, minimizing the risk of losing money when the transaction occurs, becomes imperative. The study first processed a synthetic data set, discarding useless features, using one hot encoding to convey categorical information to numerical ones and separating the training and testing datasets. Based on the new formed datasets, the study built three Machine Learning (ML) models for fraud detection, which are the Support Vector Machine (SVM) model, the logistic regression model and the decision tree model, respectively. Next, the study implemented on training these three models by fitting the model on training datasets and predicting the test data in testing datasets. Lastly, the heatmap named confusion matrix was provided to visualize the outcomes, indicating the accuracy of each model. Also, the study uses another four performance measurement scores which are Area under the Receiver Operating Characteristic Curve (ROC AUC score), accuracy classification score, balanced F1 score and precision score for evaluating models. Comparing these three models based on the confusion matrix and the four accuracy scores, the study explored that the decision tree model can achieve the best performance compared to other models in predicting fraud.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v44i.4839"
    },
    {
        "id": 15834,
        "title": "Correction to: What drives performance in machine learning models for predicting heart failure outcome?",
        "authors": "",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/ehjdh/ztae019"
    },
    {
        "id": 15835,
        "title": "A Geophysics Library of Trained Machine Learning Models",
        "authors": "A. Huck, P. De Groot, H. Refayee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202332013"
    },
    {
        "id": 15836,
        "title": "Revolutionizing Healthcare with AI: Predicting Future Medication Models and Improving Patient Outcomes",
        "authors": "James Wang, Ang Li",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "This paper addresses the problem of predicting future medication models in a database using a powerful AI system [1][2]. The background highlights the importance of accurate predictions in healthcare for effective decision-making and improved patient outcomes. The proposed solution involves the development of an AI model trained on a diverse dataset of historical medication models, incorporating advanced machine learning algorithms and techniques.  The key technologies and components of the program include data preprocessing, feature selection, algorithm comparison, and performance evaluation [3]. Challenges encountered during the project, such as data quality and model generalizability, were mitigated through careful data cleaning and fine-tuning of the AI model [4][5]. The application of the system to various scenarios during experimentation demonstrated its robustness and versatility.  The most important results include high prediction accuracy, precision, and recall in forecasting future medication models. The system showed promising performance across different patient populations, suggesting its potential for personalized treatment planning and decision-making. The idea presented in this paper offers a valuable solution for healthcare professionals and researchers seeking accurate predictions in medication modeling, facilitating better patient care and optimized treatment strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131003"
    },
    {
        "id": 15837,
        "title": "Flow-models 2.0: Elephant flows modeling and detection with machine learning",
        "authors": "Piotr Jurkiewicz",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.softx.2023.101506"
    },
    {
        "id": 15838,
        "title": "Heart disease prediction using machine learning models",
        "authors": "HengYuan Zhang",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2692214"
    },
    {
        "id": 15839,
        "title": "Prediction of Wind Power with Machine Learning Models",
        "authors": "Ömer Ali Karaman",
        "published": "2023-10-19",
        "citations": 5,
        "abstract": "Wind power is a vital power grid component, and wind power forecasting represents a challenging task. In this study, a series of multiobjective predictive models were created utilising a range of cutting-edge machine learning (ML) methodologies, namely, artificial neural networks (ANNs), recurrent neural networks (RNNs), convolutional neural networks, and long short-term memory (LSTM) networks. In this study, two independent data sets were combined and used to predict wind power. The first data set contained internal values such as wind speed (m/s), wind direction (°), theoretical power (kW), and active power (kW). The second data set was external values that contained the meteorological data set, which can affect the wind power forecast. The k-nearest neighbours (kNN) algorithm completed the missing data in the data set. The results showed that the LSTM, RNN, CNN, and ANN algorithms were powerful in forecasting wind power. Furthermore, the performance of these models was evaluated by incorporating statistical indicators of performance deviation to demonstrate the efficacy of the employed methodology effectively. Moreover, the performance of these models was evaluated by incorporating statistical indicators of performance deviation, including the coefficient of determination (R2), root mean square error (RMSE), mean absolute error (MAE), and mean square error (MSE) metrics to effectively demonstrate the efficacy of the employed methodology. When the metrics are examined, it can be said that ANN, RNN, CNN, and LSTM methods effectively forecast wind power. However, it can be said that the LSTM model is more successful in estimating the wind power with an R2 value of 0.9574, MAE of 0.0209, MSE of 0.0038, and RMSE of 0.0614.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132011455"
    },
    {
        "id": 15840,
        "title": "Improving top-<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.svg\" display=\"inline\" id=\"d1e1427\"><mml:mi>N</mml:mi></mml:math> recommendations using batch approximation for weighted pair-wise loss",
        "authors": "Sofia Aftab, Heri Ramampiaro",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100520"
    },
    {
        "id": 15841,
        "title": "IMU-based Human Activity Recognition using Machine Learning and Deep Learning models",
        "authors": "Saad AlKharji, Aysha Alteneiji, Kin Poon",
        "published": "2023-11-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icspis60075.2023.10343567"
    },
    {
        "id": 15842,
        "title": "Implementation of Polynomial Functions to Improve the Accuracy of Machine Learning Models in Predicting the Corrosion Inhibition Efficiency of Pyridine-Quinoline Compounds as Corrosion Inhibitors",
        "authors": "Setyo Budi, Muhamad Akrom, Harun Al Azies, Usman Sudibyo, Totok Sutojo, Gustina Alfa Trisnapradika, Aprilyani Nur Safitri, Ayu Pertiwi, Supriadi Rustad",
        "published": "2024-3-7",
        "citations": 1,
        "abstract": "Historically, the exploration of corrosion inhibitor technology has relied extensively on experimental methodologies, which are inherently associated with substantial costs, prolonged durations, and significant resource utilization. However, the emergence of ML approaches has recently garnered attention as a promising avenue for investigating potential materials with corrosion inhibition properties. This study endeavors to enhance the predictive capacity of ML models by leveraging polynomial functions. Specifically, the investigation focuses on assessing the effectiveness of pyridinequinoline compounds in mitigating corrosion. Diverse ML models were systematically evaluated, integrating polynomial functions to augment their predictive capabilities. The integration of polynomial functions notably amplifies the predictive accuracy across all tested models. Notably, the SVR model emerges as the most adept, exhibiting R² of 0.936 and RMSE of 0.093. The outcomes of this inquiry underscore a significant enhancement in predictive accuracy facilitated by the incorporation of polynomial functions within ML models. The proposed SVR model stands out as a robust tool for prognosticating the corrosion inhibition potential of pyridine-quinoline compounds. This pioneering approach contributes invaluable insights into advancing machine learning methodologies geared toward designing and engineering materials with promising corrosion inhibition properties.\r\nKeywords: machine learning, polynomial, corrosion inhibition, pyridine-quinoline",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/keg.v6i1.15351"
    },
    {
        "id": 15843,
        "title": "Predicting Psychopathology in Jewish Ultra-Orthodox IPV Survivors: A Machine Learning Approach",
        "authors": "Aiala Szyfer Lipinsky, Limor Goldner, Dana Hadar",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15325024.2023.2280613"
    },
    {
        "id": 15844,
        "title": "Considerations for adapting higher education technology courses for AI large language models: A critical review of the impact of ChatGPT",
        "authors": "Omar Tayan, Ali Hassan, Khaled Khankan, Sanaa Askool",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2023.100513"
    },
    {
        "id": 15845,
        "title": "Machine Translation with Large Language Models: Prompting, Few-shot Learning, and Fine-tuning with QLoRA",
        "authors": "Xuan Zhang, Navid Rajabi, Kevin Duh, Philipp Koehn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.43"
    },
    {
        "id": 15846,
        "title": "Machine learning and deep learning models for stock price prediction, case study: Google Company",
        "authors": "Xiaowei Wang",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "Stock prediction is crucial for investors to manage risk, diversify portfolios, and plan for long-term financial goals. Companies use predictions to allocate capital wisely, attract investors, and make strategic decisions. Stock prediction is to analyze competitive stock (e.g. Google, Apple and Microsoft), involving parameters of revenue, profit, PE ratio, growth rate, and to predict the future price of the stock. Based on these assumptions, this project objective is to forecast the trend in Google stock prices with four predictive models: linear regression, XGBoost, Long Short-Term Memory Network (LSTM) and Recurrent neural network (RNN). The dataset is Google stock prediction dataset, which involves 17,598 stock information. Among all four models, LSTM method obtains the best final result with 0.0012 of MSE and 0.95115 of R square. LSTM has the lowest MSE, and its R square is similar to that of other models. For future plan, this project may expand more on feature engineering, model techniques and fine-tuning methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/49/20241299"
    },
    {
        "id": 15847,
        "title": "Predicting Jet Count in Proton-Proton Collisions using Machine Learning and Deep Learning Models",
        "authors": "Canda Deniz Sag, Onur Sahin",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ubmk59864.2023.10286647"
    },
    {
        "id": 15848,
        "title": "Comparative Analysis of Machine Learning, Hybrid, and Deep Learning Forecasting Models: Evidence from European Financial Markets and Bitcoins",
        "authors": "Apostolos Ampountolas",
        "published": "2023-6-20",
        "citations": 3,
        "abstract": "This study analyzes the transmission of market uncertainty on key European financial markets and the cryptocurrency market over an extended period, encompassing the pre-, during, and post-pandemic periods. Daily financial market indices and price observations are used to assess the forecasting models. We compare statistical, machine learning, and deep learning forecasting models to evaluate the financial markets, such as the ARIMA, hybrid ETS-ANN, and kNN predictive models. The study results indicate that predicting financial market fluctuations is challenging, and the accuracy levels are generally low in several instances. ARIMA and hybrid ETS-ANN models perform better over extended periods compared to the kNN model, with ARIMA being the best-performing model in 2018–2021 and the hybrid ETS-ANN model being the best-performing model in most of the other subperiods. Still, the kNN model outperforms the others in several periods, depending on the observed accuracy measure. Researchers have advocated using parametric and non-parametric modeling combinations to generate better results. In this study, the results suggest that the hybrid ETS-ANN model is the best-performing model despite its moderate level of accuracy. Thus, the hybrid ETS-ANN model is a promising financial time series forecasting approach. The findings offer financial analysts an additional source that can provide valuable insights for investment decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/forecast5020026"
    },
    {
        "id": 15849,
        "title": "Effectiveness of Machine Learning &amp; Deep Learning Models for Diabetes Prediction",
        "authors": "Priyabrata Sahu, Jibendu Kumar Mantri",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46335/ijies.2023.8.3.5"
    },
    {
        "id": 15850,
        "title": "Pothole Detection based on Machine Learning and Deep Learning Models",
        "authors": "Mukesh Kumar Tripathi, Sagi Hasini, Madupally Homamalini, M. Neelakantappa",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacta58201.2023.10393510"
    },
    {
        "id": 15851,
        "title": "Last dental visit and severity of tooth loss: a machine learning approach",
        "authors": "Rafael Aiello Bomfim",
        "published": "2023-11-24",
        "citations": 1,
        "abstract": "AbstractThe aims of the present study were to investigate last dental visit as a mediator in the relationship between socioeconomic status and lack of functional dentition/severe tooth loss and use a machine learning approach to predict those adults and elderly at higher risk of tooth loss. We analyzed data from a representative sample of 88,531 Brazilian individuals aged 18 and over. Tooth loss was the outcome by; (1) functional dentition and (2) severe tooth loss. Structural Equation models were used to find the time of last dental visit associated with the outcomes. Moreover, machine learning was used to train and test predictions to target individuals at higher risk for tooth loss. For 65,803 adults, more than two years of last dental visit was associated with lack of functional dentition. Age was the main contributor in the machine learning approach, with an AUC of 90%, accuracy of 90%, specificity of 97% and sensitivity of 38%. For elders, the last dental visit was associated with higher severe loss. Conclusions. More than two years of last dental visit appears to be associated with a severe loss and lack of functional dentition. The machine learning approach had a good performance to predict those individuals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13104-023-06632-4"
    },
    {
        "id": 15852,
        "title": "A multimodal registration network based on triplet loss and transformer",
        "authors": "Yiqin Cao, Dayong Tian",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424742"
    },
    {
        "id": 15853,
        "title": "Learning Symbolic Model-Agnostic Loss Functions via Meta-Learning",
        "authors": "Christian Raymond, Qi Chen, Bing Xue, Mengjie Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpami.2023.3294394"
    },
    {
        "id": 15854,
        "title": "Building Machine Learning Models to Detect Item Response Theory Item Misfit (Poster 15)",
        "authors": "John Donoghue",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2012571"
    },
    {
        "id": 15855,
        "title": "Application of Machine Learning Models on Individual Household Electric Power Consumption",
        "authors": "Eman Abdelfattah, Kevin Bowlyn",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174456"
    },
    {
        "id": 15856,
        "title": "Combining machine learning and equation based models in reactive transport: POET",
        "authors": "Marco De Lucia, Bettina Schnor, Max Lübke, Michael Kühn",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7185/gold2023.20206"
    },
    {
        "id": 15857,
        "title": "Development of Judgment Classification Models using Machine Learning",
        "authors": "Shashank Ganti, Mantha Anirudh",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisc56616.2023.10085124"
    },
    {
        "id": 15858,
        "title": "Predicting the Occurrence of Metabolic Syndrome Using Machine Learning Models",
        "authors": "Maria Trigka, Elias Dritsas",
        "published": "2023-9-3",
        "citations": 2,
        "abstract": "The term metabolic syndrome describes the clinical coexistence of pathological disorders that can lead to the development of cardiovascular disease and diabetes in the long term, which is why it is now considered an initial stage of the above clinical entities. Metabolic syndrome (MetSyn) is closely associated with increased body weight, obesity, and a sedentary lifestyle. The necessity of prevention and early diagnosis is imperative. In this research article, we experiment with various supervised machine learning (ML) models to predict the risk of developing MetSyn. In addition, the predictive ability and accuracy of the models using the synthetic minority oversampling technique (SMOTE) are illustrated. The evaluation of the ML models highlights the superiority of the stacking ensemble algorithm compared to other algorithms, achieving an accuracy of 89.35%; precision, recall, and F1 score values of 0.898; and an area under the curve (AUC) value of 0.965 using the SMOTE with 10-fold cross-validation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computation11090170"
    },
    {
        "id": 15859,
        "title": "Forecasting models for monthly energy consumption using machine learning in Burkina Faso",
        "authors": "Constantin ZONGO, Frederic T OUEDRAOGO, Sadouanouan MALO",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/africon55910.2023.10293286"
    },
    {
        "id": 15860,
        "title": "House Price Prediction Based on Machine Learning Models",
        "authors": "Xiaoyan Ouyang",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "This study aims to provide accurate house price predictions using machine learning algorithms. These predictions can assist decision-makers in making informed property investments and planning. Multiple linear regression and random forest were employed to achieve this goal. First, the acquired data underwent thorough analysis, including preprocessing and visualization. Subsequently, the study employed multiple linear regression and random forest models for house price prediction and evaluated their performance. The multiple linear regression model yielded promising results with an R² score of 0.73, explaining 73% of the target variable's variance. However, it exhibited prediction errors in specific cases, suggesting potential areas for improvement. In contrast, the Random Forest model achieved a slightly lower R² score of 0.69. Nonetheless, it excelled at capturing complex nonlinear relationships. Additionally, it identified the top five key features influencing house prices: house size, number of bathrooms, number of floors, parking spaces, and air conditioning. This study highlights the potential of machine learning models for house price prediction. Future research can further enhance these models and consider other influential factors to explain house price fluctuations comprehensively. The results offer valuable applications for investors, brokers, and government planners in the real estate market.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ftyf9665"
    },
    {
        "id": 15861,
        "title": "Fingerprint-Based Localization Approach for WSN Using Machine Learning Models",
        "authors": "Tareq Alhmiedat",
        "published": "2023-2-27",
        "citations": 8,
        "abstract": "The area of localization in wireless sensor networks (WSNs) has received considerable attention recently, driven by the need to develop an accurate localization system with the minimum cost and energy consumption possible. On the other hand, machine learning (ML) algorithms have been employed widely in several WSN-based applications (data gathering, clustering, energy-harvesting, and node localization) and showed an enhancement in the obtained results. In this paper, an efficient WSN-based fingerprinting localization system for indoor environments based on a low-cost sensor architecture, through establishing an indoor fingerprinting dataset and adopting four tailored ML models, is presented. The proposed system was validated by real experiments conducted in complex indoor environments with several obstacles and walls and achieves an efficient localization accuracy with an average of 1.4 m. In addition, through real experiments, we analyze and discuss the impact of reference point density on localization accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13053037"
    },
    {
        "id": 15862,
        "title": "Sentiment analysis based on machine learning models",
        "authors": "Xinya Liao",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "Sentiment analysis represents a pivotal research domain within the realm of natural language processing (NLP). Its significance lies in its capacity to scrutinize vast volumes of data originating from social networks and to offer invaluable insights. While numerous studies center on the exploration and enhancement of diverse models and techniques for sentiment analysis tasks, there is a scarcity of research dedicated to evaluating and contrasting the performance of these models. This paper undertakes an investigation to assess the efficacy of four distinct machine learning models: k-nearest neighbor (KNN), random forest, multinomial naive Bayes, and logistic regression, with the aim of shedding light on their relative effectiveness.  The data in this research comes from two datasets, SST-2 and IMDB. Data from SST-2 is used for training and testing, and data from IMDB is used for further testing. The term frequency-inverse document frequency (TF-IDF) feature extraction method is integrated with the models and applied to the datasets. Results show that all the four models do well on SST-2 dataset, but KNN and random forest model perform poorly on IMDB dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/54/20241434"
    },
    {
        "id": 15863,
        "title": "Early Stage Alzheimer Disease Prediction Using Machine Learning Models",
        "authors": "",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets52182"
    },
    {
        "id": 15864,
        "title": "A Comparative Analysis of Machine Learning Models for Prediction of Chronic Kidney Disease",
        "authors": "Nariman Khalil, Mohamed Elkholy, Mohamed Eassa",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "Prediction of chronic kidney disease (CKD) has emerged as a useful technique for early detection of at-risk persons and the introduction of appropriate management strategies. Machine learning and data-driven methods have been used in predictive modeling to examine massive databases of patient demographics, medical histories, test findings, and genetic information. These cutting-edge methods allow for the profiling of high-risk patients and the tailoring of healthcare administration approaches. Patient outcomes, complication rates, and healthcare system efficiency may all benefit greatly from CKD screening and prediction. Responsible use of CKD prediction algorithms, however, requires resolving issues with data availability, integration, and ethics. The area of medicine has benefited greatly from the use of Machine Learning (ML) methods, which have played an increasingly central role in illness prediction. In this study, we use a strategy that makes use of ML methods to construct effective tools for predicting the development of CKD. Multiple ML models are trained, and their results are compared using a variety of criteria. We applied five ML methods such as logistic regression (LR), Decision tree (DT), random forest (RF), support vector machine (SVM), and k-nearest neighbor (KNN). The LR and KNN have the highest accuracy with 99%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61185/smij.2023.55103"
    },
    {
        "id": 15865,
        "title": "Pakistan sign language recognition: leveraging deep learning models with limited dataset",
        "authors": "Hafiz Muhammad Hamza, Aamir Wali",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00138-023-01429-8"
    },
    {
        "id": 15866,
        "title": "Allure of Simplicity",
        "authors": "Thomas Grote",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "This paper develops an account of the opacity problem in medical machine learning (ML). Guided by pragmatist assumptions, I argue that opacity in ML models is problematic insofar as it potentially undermines the achievement of two key purposes: ensuring generalizability and optimizing clinician–machine decision-making. Three opacity amelioration strategies are examined, with explainable artificial intelligence (XAI) as the predominant approach, challenged by two revisionary strategies in the form of reliabilism and the interpretability by design. Comparing the three strategies, I argue that interpretability by design is most promising to overcome opacity in medical ML. Looking beyond the individual opacity amelioration strategies, the paper also contributes to a deeper understanding of the problem space and the solution space regarding opacity in medical ML.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5195/pom.2023.139"
    },
    {
        "id": 15867,
        "title": "Using machine learning models to predict win rate of NBA teams",
        "authors": "Jieyu Han",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsai61474.2023.10423336"
    },
    {
        "id": 15868,
        "title": "Towards Machine Learning Models that We Can Trust: Testing, Improving, and Explaining Robustness",
        "authors": "Maura Pintor, Ambra Demontis, Battista Biggio",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-5"
    },
    {
        "id": 15869,
        "title": "Machine learning models for house price prediction",
        "authors": "Lingjie Fang",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Housing prices have changed over the years, and there has been an increasing need to predict prices of future homes. This paper gives an overview of various machine learning models that can predict housing prices. There are numerous possible methods of pre-processing the data, so this paper explores ways to handle missing values and categorical data. In this study, the models of regression tree, random forest, XGBoost, gradient boosting, and LightGBM are described and used to predict housing prices. Machine learning models also have hyperparameters that can be adjusted, which can affect predictive accuracy. The methods are evaluated on several benchmark datasets. Based on the results, our approach is effective for the task of house price prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/20230505"
    },
    {
        "id": 15870,
        "title": "Application of Machine Learning Models in Detecting Financial Fraud in Publicly Traded Companies",
        "authors": "Yourui Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4635606"
    },
    {
        "id": 15871,
        "title": "Detection Of DDOS Attack using Machine Learning Models",
        "authors": "S. Santhosh, M. Sambath, J. Thangakumar",
        "published": "2023-4-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnwc57852.2023.10127537"
    },
    {
        "id": 15872,
        "title": "Predicting House Price with Deep Learning: A Comparative Study of Machine Learning Models",
        "authors": "Sweta. R. Kumar -, Swati Bhatt -, Hasan Phudinawala -",
        "published": "2023-3-21",
        "citations": 0,
        "abstract": "In the real estate market, one of the most important tasks is to accurately predict house prices, as this information can assist buyers and sellers in making more educated decisions about the value of their respective properties. In this investigation, we investigate the application of deep learning (DL) strategies for forecasting housing prices and evaluate how well these strategies perform in comparison to more conventional machine learning approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i02.1849"
    },
    {
        "id": 15873,
        "title": "Machine Learning Models for Epileptic Seizure Prediction",
        "authors": "Purnima P S, Suresh M, Subramanya Kattepura",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134350"
    },
    {
        "id": 15874,
        "title": "A comparison of different machine learning models for landslide susceptibility mapping in Rize (Türkiye)",
        "authors": "Hacer Bilgilioğlu",
        "published": "2023",
        "citations": 0,
        "abstract": "The main purpose of this study was to compare the performance and validation of six machine learning models (extreme gradient boosting, random forest, artificial neural network, support vector machine, C4.5 decision tree, and naive Bayes) in landslide susceptibility modelling. The province of Rize, which has the highest rate of landslide events in Türkiye, was chosen as the study area. The conditioning factors (distance to roads, lithology, drainage density, slope, topographic wetness index (TWI), soil depth, distance to rivers, land use, NDVI, plan curvature, elevation, aspect, profile curvature) affecting the landslide were determined using the ReliefF method. A total of 516 landslides were identified for creating models, comparing performance, and validating results. The performance and validation of the models were determined by the receiver operating characteristics (ROC), sensitivity, specificity, accuracy, and kappa index. The results show that the XGBoost model outperforms the other five machine learning models in terms of accuracy and performance and is the most effective model for generating landslide susceptibility maps in Rize (Türkiye).",
        "keywords": "",
        "link": "http://dx.doi.org/10.5200/baltica.2023.2.3"
    },
    {
        "id": 15875,
        "title": "Models Comparison Based On Intrusion Detection Using Machine Learning",
        "authors": "Maimuna Yusuf Ma’aji",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "Network security is the greatest challenges in our current generation. Network intrusion detection (NID) is one of the fundamental  techniques  used  to  protect  computer  networks  from  threads.  However,  there  is  contemplation  on  the possibility  and  sustainability  of  the  traditional  approaches  employed  especially  with the  current  modern  networks. Recently, majority of the researchers employ the application of machine learning models such as logistic regression (LR), random forest (RF), K-nearest neighbor (KNN) and Support Vector Machines (SVM) among others to address the NID problem. In this research, the Network intrusion classification system has been analyzed based on KDD Cup ’99 data set. In the classifier implementation section, the three most widely used models were employed; K-nearest neighbor, random forest and logistic regression as our classification algorithms. The attack detection accuracy and training time was used to evaluate the models. The random forest provides the best detection accuracy of 99.5% and 74 second training time provide by logistic regression",
        "keywords": "",
        "link": "http://dx.doi.org/10.56471/slujst.v6i.358"
    },
    {
        "id": 15876,
        "title": "Popularity Prediction of Music by Machine Learning Models",
        "authors": "Zehao Xing",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "Each piece of music has a considerable amount of information and attributes, and each listener has their own unique taste in music, with some songs being very popular and others being relatively niche. It becomes worthwhile to examine what kinds of music are more popular. It’s clear that in this subject, the analysis and study of the available data is a \"crucial first step\". In this paper, we use several fitting models in machine learning as the theoretical basis, using pandas, sklearn, xgboost, and other related tools in python, to predict the popularity of music based on a dataset of music information originating from Kaggle The most suitable machine learning model is founded for predicting music popularity and the effectiveness of its fit are evaluated. This study provides a methodological basis for finding the factors influencing music popularity in post-order studies and can be a key study in determining the factors that influence the popularity of music in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v47i.8162"
    },
    {
        "id": 15877,
        "title": "Machine Learning based Reduced Order Models for Real Time application",
        "authors": "Roberto Bossio",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46720/fwc2023-dgt-018"
    },
    {
        "id": 15878,
        "title": "Credit Risk Analysis Using Fuzzy Logic with Machine Learning Models",
        "authors": "G.Arutjothi -, C.Senthamarai -",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Credit Risk is an important issue in the Banking Industry. Credit risk Prediction and assessment of credit is a difficult task for credit managers. Banking Industry has large amount of data related to the behavior of the customer and their credit history, but this raw data is not useful for making correct judgment in credit decisions. The banking industry is need of a correct credit decision making system, to distinguish between good customers and default customers. The data mining domain is suitable for assessing credit risk and making good decisions on credit. Feature selection is one of the main pre-processing step in the data mining. This paper use FuzzyRoughSetTheory (FRST) for finding feature subset. Four other feature selection methods are used to find the optimal feature subset. The four feature selection methods are Information Gain, Relief, Chi-Squared and Wrapper subset model. These different feature selection methods are compared in terms of accuracy and efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i03.3298"
    },
    {
        "id": 15879,
        "title": "Improving Energy Efficiency in Healthcare Machine Learning Models",
        "authors": "Ishanvi Kommula",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csce60160.2023.00071"
    },
    {
        "id": 15880,
        "title": "Copyright law, and the lifecycle of machine learning models",
        "authors": "Martin Kretschmer, Thomas Margoni, Pinar Oruc",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4670563"
    },
    {
        "id": 15881,
        "title": "Efficient Data-Driven Machine Learning Models for Water Quality Prediction",
        "authors": "Elias Dritsas, Maria Trigka",
        "published": "2023-1-18",
        "citations": 10,
        "abstract": "Water is a valuable, necessary and unfortunately rare commodity in both developing and developed countries all over the world. It is undoubtedly the most important natural resource on the planet and constitutes an essential nutrient for human health. Geo-environmental pollution can be caused by many different types of waste, such as municipal solid, industrial, agricultural (e.g., pesticides and fertilisers), medical, etc., making the water unsuitable for use by any living being. Therefore, finding efficient methods to automate checking of water suitability is of great importance. In the context of this research work, we leveraged a supervised learning approach in order to design as accurate as possible predictive models from a labelled training dataset for the identification of water suitability, either for consumption or other uses. We assume a set of physiochemical and microbiological parameters as input features that help represent the water’s status and determine its suitability class (namely safe or nonsafe). From a methodological perspective, the problem is treated as a binary classification task, and the machine learning models’ performance (such as Naive Bayes–NB, Logistic Regression–LR, k Nearest Neighbours–kNN, tree-based classifiers and ensemble techniques) is evaluated with and without the application of class balancing (i.e., use or nonuse of Synthetic Minority Oversampling Technique–SMOTE), comparing them in terms of Accuracy, Recall, Precision and Area Under the Curve (AUC). In our demonstration, results show that the Stacking classification model after SMOTE with 10-fold cross-validation outperforms the others with an Accuracy and Recall of 98.1%, Precision of 100% and an AUC equal to 99.9%. In conclusion, in this article, a framework is presented that can support the researchers’ efforts toward water quality prediction using machine learning (ML).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computation11020016"
    },
    {
        "id": 15882,
        "title": "Adapting physiologically-based pharmacokinetic models for machine learning applications",
        "authors": "Sohaib Habiballah, Brad Reisfeld",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "AbstractBoth machine learning and physiologically-based pharmacokinetic models are becoming essential components of the drug development process. Integrating the predictive capabilities of physiologically-based pharmacokinetic (PBPK) models within machine learning (ML) pipelines could offer significant benefits in improving the accuracy and scope of drug screening and evaluation procedures. Here, we describe the development and testing of a self-contained machine learning module capable of faithfully recapitulating summary pharmacokinetic (PK) parameters produced by a full PBPK model, given a set of input drug-specific and regimen-specific information. Because of its widespread use in characterizing the disposition of orally administered drugs, the PBPK model chosen to demonstrate the methodology was an open-source implementation of a state-of-the-art compartmental and transit model called . The model was tested for drug formulations spanning a large range of solubility and absorption characteristics, and was evaluated for concordance against predictions of  and relevant experimental data. In general, the values predicted by the ML models were within 20% of those of the PBPK model across the range of drug and formulation properties. However, summary PK parameter predictions from both the ML model and full PBPK model were occasionally poor with respect to those derived from experiments, suggesting deficiencies in the underlying PBPK model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-42165-3"
    },
    {
        "id": 15883,
        "title": "Forecasting Indoor Air Quality Using Machine Learning Models",
        "authors": "Ashay Singh, Mohaiminul Islam, Nga Dinh",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444387"
    },
    {
        "id": 15884,
        "title": "Co-Seismic Landslide Mobility Assessment Using Machine Learning Models",
        "authors": "Jhih-Rou Huang, Dimitrios Zekkos, Marin Clark",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485347.048"
    },
    {
        "id": 15885,
        "title": "Decoding the Encoded – Linguistic Secrets of Language Models: A Systematic Literature Review",
        "authors": "H Avetisyan, D Broneske",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Language models’ growing role in natural language processing neces- sitates a deeper understanding of their linguistic knowledge. Linguistic probing tasks have become crucial for model explainability, designed to evaluate models’ understanding of vari-ous linguistic phenomena. Objective: This systematic review critically assesses the linguistic knowledge of language models via linguistic probing, providing a comprehensive overview ofthe understood linguistic phenomena and identifying future research areas. Method: We performed an extensive search of relevant academic databases and analyzed 57 articles pub- lished between October 2018 and October 2022. Results: While language models exhibit extensive linguistic knowledge, limitations persist in their comprehension of specific phe- nomena. The review also points to a need for consensus on evaluating language models’ linguistic knowledge and the linguistic terminology used. Conclusion: Our review offers an extensive look into linguistic knowledge of language models through linguistic probing tasks. This study underscores the importance of understanding these models’ linguistic capabilities for effective use in NLP applications and for fostering more explainable AI systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131606"
    },
    {
        "id": 15886,
        "title": "Machine Learning Models on MOBA Gaming: League of Legends Winner Prediction",
        "authors": "Kaan Arık",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26650/acin.1180583"
    },
    {
        "id": 15887,
        "title": "A New Approach Towards Deployment and Management of Machine Learning Models Using K-serve Platform for Building Robust Machine Learning Systems",
        "authors": "Kanwarpartap Singh Gill, Vatsala Anand, Rupesh Gupta, Charu Khosla, Pao-Ann Hsiung",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353291"
    },
    {
        "id": 15888,
        "title": "Fairness issues, current approaches, and challenges in machine learning models",
        "authors": "Tonni Das Jui, Pablo Rivas",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "AbstractWith the increasing influence of machine learning algorithms in decision-making processes, concerns about fairness have gained significant attention. This area now offers significant literature that is complex and hard to penetrate for newcomers to the domain. Thus, a mapping study of articles exploring fairness issues is a valuable tool to provide a general introduction to this field. Our paper presents a systematic approach for exploring existing literature by aligning their discoveries with predetermined inquiries and a comprehensive overview of diverse bias dimensions, encompassing training data bias, model bias, conflicting fairness concepts, and the absence of prediction transparency, as observed across several influential articles. To establish connections between fairness issues and various issue mitigation approaches, we propose a taxonomy of machine learning fairness issues and map the diverse range of approaches scholars developed to address issues. We briefly explain the responsible critical factors behind these issues in a graphical view with a discussion and also highlight the limitations of each approach analyzed in the reviewed articles. Our study leads to a discussion regarding the potential future direction in ML and AI fairness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13042-023-02083-2"
    },
    {
        "id": 15889,
        "title": "The reusability prior: comparing deep learning models without training",
        "authors": "Aydın Göze Polat, Ferda Nur Alpaslan",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nVarious choices can affect the performance of deep learning models. We conjecture that differences in the number of contexts for model components during training are critical. We generalize this notion by defining the reusability prior as follows: model components are forced to function in diverse contexts not only due to the training data, augmentation, and regularization choices, but also due to the model design itself. We focus on the design aspect and introduce a graph-based methodology to estimate the number of contexts for each learnable parameter. This allows a comparison of models without requiring any training. We provide supporting evidence with experiments using cross-layer parameter sharing on CIFAR-10, CIFAR-100, and Imagenet-1K benchmarks. We give examples of models that share parameters outperforming baselines that have at least 60% more parameters. The graph-analysis-based quantities we introduced for the reusability prior align well with the results, including at least two important edge cases. We conclude that the reusability prior provides a viable research direction for model analysis based on a very simple idea: counting the number of contexts for model parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc713"
    },
    {
        "id": 15890,
        "title": "Evaluating the effectiveness of supervised learning models for antibiotic pollution detection from biochip data",
        "authors": "Ruben Ng, Paul Craig",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3017922"
    },
    {
        "id": 15891,
        "title": "Transfer Learning with Reconstruction Loss",
        "authors": "Wei Cui, Wei Yu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmlcn.2024.3384329"
    },
    {
        "id": 15892,
        "title": "Robust Learning Under Label Noise by Optimizing the Tails of the Loss Distribution",
        "authors": "Valeriu Balaban, Jayson Sia, Paul Bogdan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00078"
    },
    {
        "id": 15893,
        "title": "Analysis and Early Diagnosing Tool for Learning Disability using Machine Learning Models",
        "authors": "Nandha D Anand, Sanitha Lakshmi K Das, Rajalakshmi V R",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205649"
    },
    {
        "id": 15894,
        "title": "Comparison Between Machine Learning Models and Deep Learning Model for Prediction of Car Prices",
        "authors": "Ansh Pratap Singh, Bhavna Sareen",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccubea58933.2023.10392182"
    },
    {
        "id": 15895,
        "title": "Performance Prediction of Contact Separation Mode Triboelectric nanogenerators using Machine Learning Models",
        "authors": "Ravi Sankar Puppala, K. Prakash, R. Rakesh Kumar, Md. Farukh Hashmi, K. Uday Kumar",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pcems58491.2023.10136029"
    },
    {
        "id": 15896,
        "title": "Forecasting the Consumer Price Index in the Regions of the Philippines using Machine Learning for Time Series Models",
        "authors": "John Philip Omol Echevarria, Peter John Berces Aranas",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "The core objective of this study is to showcase the enhanced forecasting capabilities of a hybrid model that combines the strengths of Artificial Neural Networks (ANN) and Autoregressive Integrated Moving Average (ARIMA) in predicting the Consumer Price Index (CPI). By harnessing the intricate non-linear pattern capturing ability of ANN and the capabilities of ARIMA in modeling linear and autoregressive components, the hybrid model aims to outperform the standalone ARIMA model in accurately forecasting the CPI. Real-world CPI data will be utilized for empirical evaluation and comparison, providing valuable insights into the effectiveness and practical applicability of the hybrid ARIMA-ANN approach in improving CPI forecasting accuracy. The performance of Box Jenkins Models which gives the resulted value of R-squared values for both stationary and non-stationary data are high, indicating that the models explain a significant portion of the variability in the CPI data. The RMSE, MAPE, and MAE values are relatively low, suggesting that the Box-Jenkins models' predictions are close to the actual values. The Ljung-Box Q statistic indicates that all Box-Jenkins models best fit their respective CPI data. The study also employs rigorous statistical methods of machine learning model accuracy assessment, including the Akaike Information Criterion (AIC), Mean Absolute Percentage Error (MAPE), and Root Mean Square Error (RMSE), to assess the forecasting performance of both models. The results demonstrate that the hybrid ARIMA-ANN model consistently outperforms the standalone ARIMA model, delivering more accurate and reliable forecasts over an extended forecast horizon. The integration of Artificial Neural Networks (ANN) using Multilayer Perceptron (MLP) in the ARIMA models improved the accuracy of the fitted and forecasted values. RMSE and MSE values for the Hybrid ARIMA-ANN models are lower compared to the original Box-Jenkins/ARIMA models, validating the goal of enhancing accuracy through ANN integration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.36.11.22"
    },
    {
        "id": 15897,
        "title": "The Dark Side of Language Models: Exploring the Potential of LLMs in Multimedia Disinformation Generation and Dissemination",
        "authors": "Dipto Barman, Ziyi Guo, Owen Conlan",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mlwa.2024.100545"
    },
    {
        "id": 15898,
        "title": "The Price of Explainability in Machine Learning Models for 100-Day Readmission Prediction in Heart Failure: Retrospective, Comparative, Machine Learning Study",
        "authors": "Amira Soliman, Björn Agvall, Kobra Etminani, Omar Hamed, Markus Lingman",
        "published": "2023-10-27",
        "citations": 1,
        "abstract": "\nBackground\nSensitive and interpretable machine learning (ML) models can provide valuable assistance to clinicians in managing patients with heart failure (HF) at discharge by identifying individual factors associated with a high risk of readmission. In this cohort study, we delve into the factors driving the potential utility of classification models as decision support tools for predicting readmissions in patients with HF.\n\n\nObjective\nThe primary objective of this study is to assess the trade-off between using deep learning (DL) and traditional ML models to identify the risk of 100-day readmissions in patients with HF. Additionally, the study aims to provide explanations for the model predictions by highlighting important features both on a global scale across the patient cohort and on a local level for individual patients.\n\n\nMethods\nThe retrospective data for this study were obtained from the Regional Health Care Information Platform in Region Halland, Sweden. The study cohort consisted of patients diagnosed with HF who were over 40 years old and had been hospitalized at least once between 2017 and 2019. Data analysis encompassed the period from January 1, 2017, to December 31, 2019. Two ML models were developed and validated to predict 100-day readmissions, with a focus on the explainability of the model’s decisions. These models were built based on decision trees and recurrent neural architecture. Model explainability was obtained using an ML explainer. The predictive performance of these models was compared against 2 risk assessment tools using multiple performance metrics.\n\n\nResults\nThe retrospective data set included a total of 15,612 admissions, and within these admissions, readmission occurred in 5597 cases, representing a readmission rate of 35.85%. It is noteworthy that a traditional and explainable model, informed by clinical knowledge, exhibited performance comparable to the DL model and surpassed conventional scoring methods in predicting readmission among patients with HF. The evaluation of predictive model performance was based on commonly used metrics, with an area under the precision-recall curve of 66% for the deep model and 68% for the traditional model on the holdout data set. Importantly, the explanations provided by the traditional model offer actionable insights that have the potential to enhance care planning.\n\n\nConclusions\nThis study found that a widely used deep prediction model did not outperform an explainable ML model when predicting readmissions among patients with HF. The results suggest that model transparency does not necessarily compromise performance, which could facilitate the clinical adoption of such models.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2196/46934"
    },
    {
        "id": 15899,
        "title": "Machine Learning-Driven Packet Loss Classification via TCP Jersey and Multi-Layer Perceptron",
        "authors": "Kiruthiga R, B. Nithya",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccins58907.2023.10450093"
    },
    {
        "id": 15900,
        "title": "Multi-scale Loss based Electron Microscopic Image Pair Matching Method",
        "authors": "Chunting Duan, Kazuhiko Komatsu, Masayuki Sato, Hiroaki Kobayashi",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00295"
    },
    {
        "id": 15901,
        "title": "A study on pulmonary functions in sports-players using machine learning and computational analysis",
        "authors": "Na Tan, Tuo Ren",
        "published": "2023-6-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08477-2"
    },
    {
        "id": 15902,
        "title": "Keyword Data Analysis Using Generative Models Based on Statistics and Machine Learning Algorithms",
        "authors": "Sunghae Jun",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "For text big data analysis, we preprocessed text data and constructed a document–keyword matrix. The elements of this matrix represent the frequencies of keywords occurring in a document. The matrix has a zero-inflation problem because many elements are zero values. Also, in the process of preprocessing, the data size of the document–keyword matrix is reduced. However, various machine learning algorithms require a large amount of data, so to solve the problems of data shortage and zero inflation, we propose the use of generative models based on statistics and machine learning. In our experimental tests, we compared the performance of the models using simulation and practical data sets. Thus, we verified the validity and contribution of our research for keyword data analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13040798"
    },
    {
        "id": 15903,
        "title": "Machine Learning Prediction Models applied to Weather Forecasting: A survey",
        "authors": "",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58564/ijser.1.2.2023.74"
    },
    {
        "id": 15904,
        "title": "Forecasting stock close price using machine learning models",
        "authors": "",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "Forecasting is about determining which variables contribute to the prediction of other variables. The stock forecasting problem is difficult due to its unpredictable and non-linear nature. Prediction and evaluation are two of the most challenging tasks. A machine learning (ML) classifier was used to address prediction issues in this paper. Linear Regression (LR) was used to develop the new Stock Close Price Prediction (SCPP) algorithm. The model was built using Yahoo Finance's data of different stocks using LR, Bernoulli Naïve Bayes (BNB), and Support Vector Machine (SVM). Among these, the model forecasts the stock close price effectively with LR. In this, the Apple stock’s close price was predicted with the features: Low, Open, High, Volume, and Close. From the results, LR outperforms the SVM and BNB in close price prediction with an accuracy of 99.97 %.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59018/022361"
    }
]