[
    {
        "id": 23905,
        "title": "Evaluating the Effectiveness of Text Tokenization Methods",
        "authors": "Oleg Bartenyev",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24160/1993-6982-2023-6-144-156"
    },
    {
        "id": 23906,
        "title": "Task-Adaptive Tokenization: Enhancing Long-Form Text Generation Efficacy in Mental Health and Beyond",
        "authors": "Siyang Liu, Naihao Deng, Sahand Sabour, Yilin Jia, Minlie Huang, Rada Mihalcea",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.944"
    },
    {
        "id": 23907,
        "title": "Tokenization for Text Analysis",
        "authors": "Sowmik Sekhar",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61137/ijsret.vol.10.issue1.127"
    },
    {
        "id": 23908,
        "title": "Analysis of Subword Tokenization Approaches for Turkish Language",
        "authors": "Erencan Erkaya, Tunga Güngör",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223973"
    },
    {
        "id": 23909,
        "title": "Optimized Tokenization for Transcribed Error Correction",
        "authors": "Tomer Wullach, Shlomo Chazan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.802"
    },
    {
        "id": 23910,
        "title": "Language-Independent Text Tokenization Using Unsupervised Deep Learning",
        "authors": "Hanan A. Hosni Mahmoud, Alaaeldin M. Hafez, Eatedal Alabdulkreem",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.026235"
    },
    {
        "id": 23911,
        "title": "Analyzing Cognitive Plausibility of Subword Tokenization",
        "authors": "Lisa Beinborn, Yuval Pinter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.272"
    },
    {
        "id": 23912,
        "title": "Long Text Classification using Transformers with Paragraph Selection Strategies",
        "authors": "Mohit Tuteja, Daniel González Juclà",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nllp-1.3"
    },
    {
        "id": 23913,
        "title": "Tokenization of Real Estate: A Study on Land Tokenization in Turkey",
        "authors": "Kerem Yavuz Arslanli, Göksu Sabuncuoğlu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15396/eres2023_242"
    },
    {
        "id": 23914,
        "title": "Biomedical Language Models are Robust to Sub-optimal Tokenization",
        "authors": "Bernal Jimenez Gutierrez, Huan Sun, Yu Su",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.32"
    },
    {
        "id": 23915,
        "title": "The effects of text structure on students’ use of comprehension strategies and cognitive outcomes during science text processing",
        "authors": "Nathaniel J. Hunsu, Olusola Adesope, Matthew T. McCrudden",
        "published": "2023-4-12",
        "citations": 1,
        "abstract": "This study investigated the effect of refutation text structure on reading processes and learning. Undergraduate biology students (n = 116) who had high or moderate misconceptions were randomly assigned to read either a non-refutation text, a simple refutation text, or an elaborated refutation text that addressed commonly held misconceptions about genetic biology. Participants’ were prompted to think-aloud and type their thoughts as they read the text. Typed verbal responses were coded for the use of paraphrasing, bridging inferences, and elaborations. The results showed that the simple and elaborated refutation texts promoted the use of bridging inferences, and the elaborated refutation text promoted the use of elaborations compared to the non-refutation text. Neither text type nor misconception status had a significant effect on post learning outcomes. These results suggest that refutations with illustrative examples can increase the use of cognitive processes that support comprehension.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/feduc.2023.1112804"
    },
    {
        "id": 23916,
        "title": "Multi-word Tokenization for Sequence Compression",
        "authors": "Leonidas Gee, Leonardo Rigutini, Marco Ernandes, Andrea Zugarini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-industry.58"
    },
    {
        "id": 23917,
        "title": "Text Rendering Strategies for Pixel Language Models",
        "authors": "Jonas Lotz, Elizabeth Salesky, Phillip Rust, Desmond Elliott",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.628"
    },
    {
        "id": 23918,
        "title": "End-to-End Models for Chemical–Protein Interaction Extraction: Better Tokenization and Span-Based Pipeline Strategies",
        "authors": "Xuguang Ai, Ramakanth Kavuluru",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00108"
    },
    {
        "id": 23919,
        "title": "Advancing NLP models with strategic text augmentation: A comprehensive study of augmentation methods and curriculum strategies",
        "authors": "Himmet Toprak Kesgin, Mehmet Fatih Amasyali",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2024.100071"
    },
    {
        "id": 23920,
        "title": "Effect of typos on text classification accuracy in word and character tokenization",
        "authors": " Peter E. Shawky,  Saleh Mesbah ElKaffas,  Shawkat K Guirguis",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "To train a machine to “sense” a users’ feelings through writings (sentiment analysis) has become a crucial process in several domains: marketing, research, surveys and more. Nevertheless in times of crisis like COVID. Typo is one of the underestimated challenges processing user-generated text (comments, tweets, ..etc), it affects both learning and evaluation processes. Word tokenization outcome changes drastically even with a single character change, hence as expected, experiments have shown significant accuracy decreases due to typo. Adding a spelling correction as preprocessing layer, building one for every language, is a very time and resources expensive solution, a huge challenge against large data and real-time processing. Alternatively, a CNN model consuming the same text, once tokenized on characters level and once on words level while inducing typo, showed that as the typo percentage approaches 10% of the text, the results with characters tokens surpasses words tokens. Finally, on %30 typo of the text, the model consuming characters tokenization outperformed itself with the word level by a significant %22.3 in accuracy and %24.9 in F1-Score, using the same exact model. This approach in solving the inevitable typo challenge in NLP proved to be of significant practicality, saving huge resources versus using a spelling-correction model beforehand. It also removes a blocker challenge in front of real-time processing of user-generated text while preserving acceptable accuracy results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37934/araset.40.2.152162"
    },
    {
        "id": 23921,
        "title": "A Comparative Study of Prompting Strategies for Legal Text Classification",
        "authors": "Ali Hakimi Parizi, Yuyang Liu, Prudhvi Nokku, Sina Gholamian, David Emerson",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nllp-1.25"
    },
    {
        "id": 23922,
        "title": "Unveiling Bahasa Rojak's Linguistic Complexity: Out-of-Vocabulary Detection and Tokenization Strategies for Language",
        "authors": "Fang En Leong, Chi Wee Tan, Yean Ling Chan, Tong Ming Lim",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdxa61007.2024.10470820"
    },
    {
        "id": 23923,
        "title": "Comparative Study of Tokenization Algorithms for End-to-End Open Vocabulary Keyword Detection",
        "authors": "Krishna Gurugubelli, Sahil Mohamed, Rajesh Krishna K S",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10445876"
    },
    {
        "id": 23924,
        "title": "Improving Automatic KCD Coding: Introducing the KoDAK and an Optimized Tokenization Method for Korean Clinical Documents",
        "authors": "Geunyeong Jeong, Juoh Sun, Seokwon Jeong, Hyunjin Shin, Harksoo Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.clinicalnlp-1.12"
    },
    {
        "id": 23925,
        "title": "Investigating Pooling Strategies and Loss Functions for Weakly-Supervised Text-to-Audio Grounding via Contrastive Learning",
        "authors": "Xuenan Xu, Mengyue Wu, Kai Yu",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icasspw59220.2023.10192960"
    },
    {
        "id": 23926,
        "title": "Vision Transformer with Progressive Tokenization for CT Metal Artifact Reduction",
        "authors": "Songwei Zheng, Dong Zhang, Chunyan Yu, Danhong Zhu, Longlong Zhu, Hao Liu, Zhongzheng Huang",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095579"
    },
    {
        "id": 23927,
        "title": "Massively Multilingual ASR on 70 Languages: Tokenization, Architecture, and Generalization Capabilities",
        "authors": "Andros Tjandra, Nayan Singhal, David Zhang, Ozlem Kalinli, Abdelrahman Mohamed, Duc Le, Michael L. Seltzer",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094667"
    },
    {
        "id": 23928,
        "title": "Do All Languages Cost the Same? Tokenization in the Era of Commercial Language Models",
        "authors": "Orevaoghene Ahia, Sachin Kumar, Hila Gonen, Jungo Kasai, David Mortensen, Noah Smith, Yulia Tsvetkov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.614"
    },
    {
        "id": 23929,
        "title": "Stop Uploading Test Data in Plain Text: Practical Strategies for Mitigating Data Contamination by Evaluation Benchmarks",
        "authors": "Alon Jacovi, Avi Caciularu, Omer Goldman, Yoav Goldberg",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.308"
    },
    {
        "id": 23930,
        "title": "Tokenization of Financial Assets",
        "authors": "Xavier Lavayssière",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4649162"
    },
    {
        "id": 23931,
        "title": "MusicLDM: Enhancing Novelty in text-to-music Generation Using Beat-Synchronous mixup Strategies",
        "authors": "Ke Chen, Yusong Wu, Haohe Liu, Marianna Nezhurina, Taylor Berg-Kirkpatrick, Shlomo Dubnov",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447265"
    },
    {
        "id": 23932,
        "title": "Text-Processing Patterns During Misinformation-Processing: A Contrasting Case Studies Approach",
        "authors": "Virginia Troemel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2013862"
    },
    {
        "id": 23933,
        "title": "Insincerity in lawyers’ questioning strategies in Malawian criminal courtroom discourse",
        "authors": "Wellman Kondowe",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "Abstract\nThis paper introduces a new perspective on analysing courtroom insincerity by focusing on questions asked by lawyers in the Malawi criminal justice system. The study aimed at examining the linguistic tools of tracing insincerity in lawyers’ questions; the varying degrees of insincerity in defence and prosecution lawyers and their rationale for making such choices. The study argues that courtroom setting is a war zone where different parties have divergent goals. Such encounters are much likely to yield higher chances of insincerity, which can be manifested in the questions lawyers ask. The analysis is based on data from four criminal cases, which were collected from the High Court of Malawi. My framework of analysing insincerity in questions examines the prescribed degrees of control that questions exert on the witnesses in relation to their productiveness. The findings indicate that, when examining witnesses, prosecutors exercise less insincerity while defence lawyers opt for questions with high insincerity. These imbalances in language use are enshrined in and supported by law in its statutes. The findings of this study have jurisprudential implications, especially in Africa which is internationally less represented in the studies of language and law.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/text-2022-0083"
    },
    {
        "id": 23934,
        "title": "Tokenization: A Potential Pathway for Bitcoin’s Future",
        "authors": "Georgii Zvonka",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4461414"
    },
    {
        "id": 23935,
        "title": "Tokenization in the Theory of Knowledge",
        "authors": "Robert Friedman",
        "published": "2023-3-20",
        "citations": 4,
        "abstract": "Tokenization is a procedure for recovering the elements of interest in a sequence of data. This term is commonly used to describe an initial step in the processing of programming languages, and also for the preparation of input data in the case of artificial neural networks; however, it is a generalizable concept that applies to reducing a complex form to its basic elements, whether in the context of computer science or in natural processes. In this entry, the general concept of a token and its attributes are defined, along with its role in different contexts, such as deep learning methods. Included here are suggestions for further theoretical and empirical analysis of tokenization, particularly regarding its use in deep learning, as it is a rate-limiting step and a possible bottleneck when the results do not meet expectations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/encyclopedia3010024"
    },
    {
        "id": 23936,
        "title": "Tokenization in corporate governance: Transforming ownership and transparency",
        "authors": "Martino Agostini",
        "published": "2024",
        "citations": 0,
        "abstract": "The intersection of corporate governance and tokenization is a rapidly evolving field that presents gaps in our understanding. While previous research has primarily focused on the technical and legal aspects of tokenizing shares, it has often overlooked the practical and managerial implications for corporate governance. This knowledge gap is especially concerning given the increasing global adoption of tokens, which directly affects governance structures. Еhis exploration not only provides an avenue for scholars to delve into this innovative field but also triggers new dynamics among stakeholders.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22495/cgpmpp9"
    },
    {
        "id": 23937,
        "title": "Tokenization with Factorized Subword Encoding",
        "authors": "David Samuel, Lilja Øvrelid",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.890"
    },
    {
        "id": 23938,
        "title": "Distributed Insurance: Tokenization of Risk and Reward Allocation",
        "authors": "Runhuan Feng, Mao Li",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4463804"
    },
    {
        "id": 23939,
        "title": "STUDYING STRATEGIES TO ENHANCE INTEREST IN TEXT FROM A LINGUISTIC PERSPECTIVE",
        "authors": "Ali Abdulhamzah Abdul.Z,  ",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "This work will focus on text-based interest, which may be found in this article using a linguistics method. The principles of linguistics of emotions, which integrate the findings of language and psychology studies, provide the groundwork for this strategy. The paper delves into the linguistic methods of text-based interest analysis and how they relate to interest's function in interactive instructional discourse. One definition of active, emotion-evoking discourse is the communicative scenario in which an informative text piques the reader's curiosity. The speaker's goal in adopting interest-evoking rhetorical tactics—that is, strategies for generating texts to evoke the audience's attention—is to \"evoke the recipient's interest\" in this particular discourse. Applying techniques from communicative-functional linguistics, we may analyze these systems. First, we can pinpoint specific tactics with the use of these methods. The essay uses two such systems—text dialogization and contextualization—in Russian textbooks as an example. Second, to implement these tactics, the communicative-functional approaches show the most important ways of using language and producing finished content. We think these methods are what people mean when discussing the concretization of text content, developing text emotiveness, and forming text dialogicity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55640/ijss-04-04-02"
    },
    {
        "id": 23940,
        "title": "Impact of Tokenization on Language Models: An Analysis for Turkish",
        "authors": "Cagri Toraman, Eyup Halit Yilmaz, Furkan Şahi̇nuç, Oguzhan Ozcelik",
        "published": "2023-4-30",
        "citations": 9,
        "abstract": "Tokenization is an important text preprocessing step to prepare input tokens for deep language models. WordPiece and BPE are de facto methods employed by important models, such as BERT and GPT. However, the impact of tokenization can be different for morphologically rich languages, such as Turkic languages, in which many words can be generated by adding prefixes and suffixes. We compare five tokenizers at different granularity levels, that is, their outputs vary from the smallest pieces of characters to the surface form of words, including a Morphological-level tokenizer. We train these tokenizers and pretrain medium-sized language models using the RoBERTa pretraining procedure on the Turkish split of the OSCAR corpus. We then fine-tune our models on six downstream tasks. Our experiments, supported by statistical tests, reveal that the morphological-level tokenizer delivers a challenging performance with de facto tokenizers. Furthermore, we find that increasing the vocabulary size improves the performance of Morphological- and Word-level tokenizers more than that of de facto tokenizers. The ratio of the number of vocabulary parameters to the total number of model parameters can be empirically chosen as 20% for de facto tokenizers and 40% for other tokenizers to obtain a reasonable trade-off between model size and performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3578707"
    },
    {
        "id": 23941,
        "title": "Alignment of Image-Text and Video-Text Datasets",
        "authors": "Yunus Emre Özköse, Zeynep Gökçe, Pınar Duygulu",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10224043"
    },
    {
        "id": 23942,
        "title": "Driving Context into Text-to-Text Privatization",
        "authors": "Stefan Arnold, Dilara Yesilbas, Sven Weinzierl",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.trustnlp-1.2"
    },
    {
        "id": 23943,
        "title": "Guiding Text-to-Text Privatization by Syntax",
        "authors": "Stefan Arnold, Dilara Yesilbas, Sven Weinzierl",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.trustnlp-1.14"
    },
    {
        "id": 23944,
        "title": "Enhancing fine-detail image synthesis from text descriptions by text aggregation and connection fusion module",
        "authors": "Huaping Zhou, Tao Wu, Senmao Ye, Xinru Qin, Kelei Sun",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.image.2023.117099"
    },
    {
        "id": 23945,
        "title": "Tokenization of Tunisian Arabic: A Comparison between Three Machine Learning Models",
        "authors": "Asma Mekki, Inès Zribi, Mariem Ellouze, Lamia Hadrich Belguith",
        "published": "2023-7-31",
        "citations": 1,
        "abstract": "Tokenization represents the way of segmenting a piece of text into smaller units called tokens. Since Arabic is an agglutinating language by nature, this treatment becomes a crucial preprocessing step for many Natural Language Processing (NLP) applications such as morphological analysis, parsing, machine translation, information extraction, and so on. In this article, we investigate word tokenization task with a rewriting process to rewrite the orthography of the stem. For this task, we are using Tunisian Arabic (TA) text. To the best of the researchers’ knowledge, this is the first study that uses TA for word tokenization. Therefore, we start by collecting and preparing various TA corpora from different sources. Then, we present a comparison of three character-based tokenizers based on Conditional Random Fields (CRF), Support Vector Machines (SVM) and Deep Neural Networks (DNN). The best proposed model using CRF achieved an F-measure result of 88.9%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3599234"
    },
    {
        "id": 23946,
        "title": "Implementation of Text Pre-Processing in Gujarati Text-to-Speech Conversion",
        "authors": "Vishal Narvani, Harshal Arolkar",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmcsi61536.2024.00094"
    },
    {
        "id": 23947,
        "title": "Invoice Tokenization for Deep-Tier Payables Finance",
        "authors": "Jing Hou, Burak Kazaz, Fasheng Xu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4362566"
    },
    {
        "id": 23948,
        "title": "Personalization of CTC-Based End-to-End Speech Recognition Using Pronunciation-Driven Subword Tokenization",
        "authors": "Zhihong Lei, Ernest Pusateri, Shiyi Han, Leo Liu, Mingbin Xu, Tim Ng, Ruchir Travadi, Youyuan Zhang, Mirko Hannemann, Man-Hung Siu, Zhen Huang",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447571"
    },
    {
        "id": 23949,
        "title": "Students’ Strategies in Translating Humorous Text",
        "authors": "Cynthia Felia Chandra",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "This study aims to find out the problems that students experienced and strategies that students used in translating humorous text. The writer conducted this study using the theory of translation problems and strategies by Baker (2018). This writer conducted this study using a qualitative approach in which she collected and analyzed the data herself. The findings of this study support Baker’s (2018) statement that some of the problems that may appear during translation process are culture-specific concept, the source language concept is not lexicalized in the target language, the source and target language make different distinction in meaning, the target language lacks a specific term (hyponym), differences in expressive meaning, and differences in frequency and purpose of using specific forms. In addition, Text in the source language is translated in several different strategies namely translation by more general word, translation by more neutral or less expressive word, translation by paraphrase using related words, translation by paraphrase using unrelated words, translation using a loan word or loan word plus explanation, and translation by omission. More studies involving other types of humor and other translation theories are recommended to create variations in this field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9744/katakita.11.1.77-89"
    },
    {
        "id": 23950,
        "title": "Localization Strategies of English Tourism Text Translation",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/langl.2024.070220"
    },
    {
        "id": 23951,
        "title": "Financial risk tolerance profiling from text",
        "authors": "Frank Xing",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2024.103704"
    },
    {
        "id": 23952,
        "title": "Working on Foreign Text and Reading Strategies in Language Teaching",
        "authors": "Rusudan Gogokhia",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52340/ptaas.2022.22.11"
    },
    {
        "id": 23953,
        "title": "Decoding the Future of Finance: An Examination of Asset Tokenization and Web 3.0",
        "authors": "Jianzheng Shi",
        "published": "2023-8-2",
        "citations": 1,
        "abstract": "This paper explores the rapidly evolving landscape of asset tokenization within the broader context of Web 3.0. Asset tokenization, the process of converting rights to an asset into a digital token on a blockchain, presents a transformative opportunity for various sectors, especially finance. This paper delves into the technicalities of asset tokenization, discusses its potential impacts, and forecasts its role in the future of digital economies. It argues that asset tokenization, fueled by the advancements in Web 3.0, will play a pivotal role in the democratization of finance, reducing entry barriers, and creating more efficient and transparent systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47577/eximia.v11i1.303"
    },
    {
        "id": 23954,
        "title": "Effect of tokenization on transformers for biological sequences",
        "authors": "Edo Dotan, Gal Jaschek, Tal Pupko, Yonatan Belinkov",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "Abstract\n\nMotivation\nDeep-learning models are transforming biological research, including many bioinformatics and comparative genomics algorithms, such as sequence alignments, phylogenetic tree inference, and automatic classification of protein functions. Among these deep-learning algorithms, models for processing natural languages, developed in the natural language processing (NLP) community, were recently applied to biological sequences. However, biological sequences are different from natural languages, such as English, and French, in which segmentation of the text to separate words is relatively straightforward. Moreover, biological sequences are characterized by extremely long sentences, which hamper their processing by current machine-learning models, notably the transformer architecture. In NLP, one of the first processing steps is to transform the raw text to a list of tokens. Deep-learning applications to biological sequence data mostly segment proteins and DNA to single characters. In this work, we study the effect of alternative tokenization algorithms on eight different tasks in biology, from predicting the function of proteins and their stability, through nucleotide sequence alignment, to classifying proteins to specific families.\n\n\nResults\nWe demonstrate that applying alternative tokenization algorithms can increase accuracy and at the same time, substantially reduce the input length compared to the trivial tokenizer in which each character is a token. Furthermore, applying these tokenization algorithms allows interpreting trained models, taking into account dependencies among positions. Finally, we trained these tokenizers on a large dataset of protein sequences containing more than 400 billion amino acids, which resulted in over a three-fold decrease in the number of tokens. We then tested these tokenizers trained on large-scale data on the above specific tasks and showed that for some tasks it is highly beneficial to train database-specific tokenizers. Our study suggests that tokenizers are likely to be a critical component in future deep-network analysis of biological sequence data.\n\n\nAvailability\nCode, data and trained tokenizers are available on https://github.com/technion-cs-nlp/BiologicalTokenizers.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bioinformatics/btae196"
    },
    {
        "id": 23955,
        "title": "Risks and Prospects of Creativity Tokenization",
        "authors": "R. A. Budnik",
        "published": "2023-8-20",
        "citations": 2,
        "abstract": "Objective: tokenization of creativity, alongside with cryptoeconomy and Web3 network infrastructure, is a notable trend in the development of modern society in the third decade of the 21st century. The objective of this article is to explore the risks and prospects emerging in the process of disposition of the creative labor results in the form of non-fungible tokens.Methods: the research methodology is based on analysis of varied viewpoints on the problem, including diametrically opposing concepts. The opposing views of the observers manifest their attitude to tokenization of creative products as a speculative scheme, on the one hand, and a promising tool of creative industries development, on the other.Results: the probable negative consequences of tokenization of intellectual activity results are identified; author’s recommendations on managing these risks are given. Another result of this publication is analysis of economiclegal prospects stemming from tokenization of the objects of copyright and neighboring rights by the example of musical pieces.Scientific novelty: it consists in presenting and substantiating a hypothesis that the relations formed in the musical industry under the modern sociocultural and technological realities will be reproduced in other creative industries. Also, scientific novelty consists in the analysis of prospects of tokenization of such results of intellectual activity as gaming artifacts, works of traditional and digital visual arts, patents and scientific achievements. The use of nonfungible tokens the ecosystem of network computer games will allow gamers to buy and sell rights to game pieces autonomously from game publishers. Tokenization of industrial property objects and individualization means will ensure protection of intellectual rights of their authors while waiting for the issuance of a state protection document. In the modern society, there will be many of those wishing to become an owner of a token for a scientific work, as the popularity of science and innovations is constantly growing in developed countries. Ownership of a token for a scientific work will be regarded a moral investment, increasing the prestige and status of its owner. Tokens for scientific works have a high potential as a means of measuring value in a post-economic society.Practical significance: it consists in the description of innovative means of using creative products and business models based on tokenization of the results of intellectual activity, ready to be implemented in practice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21202/jdtl.2023.25"
    },
    {
        "id": 23956,
        "title": "\"Bird, Jewel, or Flower?\": On the Tokenization of Nineteenth-Century Women's Poetry",
        "authors": "Kylan Rice",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1353/elh.2023.a907208"
    },
    {
        "id": 23957,
        "title": "Text Embeddings Reveal (Almost) As Much As Text",
        "authors": "John Morris, Volodymyr Kuleshov, Vitaly Shmatikov, Alexander Rush",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.765"
    },
    {
        "id": 23958,
        "title": "AWARE-TEXT: An Android Package for Mobile Phone Based Text Collection and On-Device Processing",
        "authors": "Salvatore Giorgi, Garrick Sherman, Douglas Bellew, Sharath Chandra Guntuku, Lyle Ungar, Brenda Curtis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.12"
    },
    {
        "id": 23959,
        "title": "Treepiece: Faster Semantic Parsing via Tree Tokenization",
        "authors": "Sid Wang, Akshat Shrivastava, Aleksandr Livshits",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.740"
    },
    {
        "id": 23960,
        "title": "Use of subword tokenization for domain generation algorithm classification",
        "authors": "Sea Ran Cleon Liew, Ngai Fong Law",
        "published": "2023-9-7",
        "citations": 1,
        "abstract": "AbstractDomain name generation algorithm (DGA) classification is an essential but challenging problem. Both feature-extracting machine learning (ML) methods and deep learning (DL) models such as convolutional neural networks and long short-term memory have been developed. However, the performance of these approaches varies with different types of DGAs. Most features in the ML methods can characterize random-looking DGAs better than word-looking DGAs. To improve the classification performance on word-looking DGAs, subword tokenization is employed for the DL models. Our experimental results proved that the subword tokenization can provide excellent classification performance on the word-looking DGAs. We then propose an integrated scheme that chooses an appropriate method for DGA classification depending on the nature of the DGAs. Results show that the integrated scheme outperformed existing ML and DL methods, and also the subword DL methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s42400-023-00183-8"
    },
    {
        "id": 23961,
        "title": "FARNet: Fragmented affinity reasoning network of text instances for arbitrary shape text detection",
        "authors": "Honghui Chen, Pingping Chen, Yuhang Qiu, Nam Ling",
        "published": "2023-5",
        "citations": 1,
        "abstract": "AbstractArbitrary shape text detection is a challenging task in scene text recognition. Driven by deep learning and large‐scale data sets, the detection method based on connected component (CC) has increasingly gained popularity. However, there are still problems of unclear separation of text instances and incorrect component links. Thus, in this paper, the authors propose a novel component connection method, that is, Fragmented Affinity Reasoning Network of Text Instances (FARNet), for arbitrary shape text detection. The network consists of a Weighted Feature Fusion Pyramid Network (WFFPN), Text Fragments Subgraph (TFS), and Dense Graph Attention Network (DGAT), which can be trained end‐to‐end. The WFFPN is used to generate text fragments, TFS and DGAT jointly construct an affinity reasoning network. Since the neighbouring boundaries between text instances may blend them into a single instance, the core idea is to use the WFFPN to divide the text instance into a series of rectangular fragments, the affinity reasoning network infers the affinity between fragments and then links them to rebuild text instances. Extensive experiments on seven challenging datasets (ICDAR2015, MSRA‐TD500, Totaltext, CTW‐1500, ICDAR 2019MLT, ICDAR2019 ArT, and DAST‐1500) demonstrate that the proposed text detector achieves state‐of‐the‐art performance in both on polygon datasets and quadrilateral datasets. The code is available at https://github.com/giganticpower/FARNet.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ipr2.12769"
    },
    {
        "id": 23962,
        "title": "STRATEGIES IN WRITTEN SCIENTIFIC TEXT",
        "authors": "Larisa Victorovna YAGENICH",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.57145/27129780_2023_12_01_22"
    },
    {
        "id": 23963,
        "title": "TEXT BETRAYAL VERSUS CULTURAL  LOYALTY: EMPLOYED STRATEGIES IN TRANSLATING ARABIC POETIC TEXT INTO ENGLISH",
        "authors": "Ahmad M Abd Al-Salam, Awad Shehata Mabrouk",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "Translating Arabic poetry into English or any European or (anti-Semitic) language constitutes an essential burden on the translator due to their common origins that are similar in terms of rhetorical uses (e.g., synecdoche, metaphor, simile, euphemism, and the most important of all, similarity in grammatical, morphological and derivational linguistic rules). In the case of rendering Arabic poetry into English, the gap is vast and this requires a double effort, wider knowledge, and a high-level culture awareness on part of the translator. More importantly, the translator has to be equipped with an abundant knowledge of the means of influence that fall within the circle of rhetoric methods that may be unique to both Arabic and English languages. That is what we called Text Betrayal Versus Cultural  Loyalty.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/es.v9i2.2194"
    },
    {
        "id": 23964,
        "title": "Using GPT-3 as a Text Data Augmentator for a Complex Text Detector",
        "authors": "Mario Romero-Sandoval, Saúl Calderón-Ramírez, Martín Solís",
        "published": "2023-11-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bip60195.2023.10379347"
    },
    {
        "id": 23965,
        "title": "KurdSum: A new benchmark dataset for the Kurdish text summarization",
        "authors": "Soran Badawi",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2023.100043"
    },
    {
        "id": 23966,
        "title": "Exploring the Impact of Training Data Distribution and Subword Tokenization on Gender Bias in Machine Translation",
        "authors": "Bar Iluz, Tomasz Limisiewicz, Gabriel Stanovsky, David Mareček",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.ijcnlp-main.57"
    },
    {
        "id": 23967,
        "title": "Applications of Tokenization in the Architecture, Engineering, and Construction (AEC) Industry",
        "authors": "Hossein Naderi, Mohammad Hossein Heydari, Alireza Shojaei",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485262.028"
    },
    {
        "id": 23968,
        "title": "Real Estate Registry Platform Through NFT Tokenization Using Blockchain",
        "authors": "Archana Sharma, Anshul Sharma, Anshul Tripathi, Aniket Chaudhary",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10488945"
    },
    {
        "id": 23969,
        "title": "Tokenization of Energy Assets: A Multichain Blockchain Approach",
        "authors": "Akiladevi R, Sardha S, Shruthi R",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmcsi61536.2024.00110"
    },
    {
        "id": 23970,
        "title": "Vision Transformers with Mixed-Resolution Tokenization",
        "authors": "Tomer Ronen, Omer Levy, Avram Golbert",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00486"
    },
    {
        "id": 23971,
        "title": "Strategies for Expository and Literary Texts",
        "authors": "Anke Schmitz, Wiebke Dannecker",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "Based on the assumption that reading strategies facilitate text comprehension and that they should differ regarding types of texts, this study aims at analysing which cognitive and metacognitive reading strategies are applied by university students (N = 54) for reading a narrative text compared to an expository text. To measure text-specific reading strategies, different channels of information were included such as highlighting of text segments qualitatively and quantitatively, qualitative and quantitative note-taking as well as the coherence of notes, and self-reported strategy use after reading. The findings show that students’ highlighting of text segments and note-taking differ regarding the type of text in amount and depth of processing, indicating a greater depth of processing for narrative texts. The self-reported strategies for reading the two types of texts also reveal differences in terms of the frequencies of applying elaborative and metacognitive strategies. Moreover, correlation analyses show that there is more correspondence between the reading strategies in the narrative condition compared to the expository condition. In sum, the students adapt their reading strategies to the types of texts and it appears that narrative text was read in a more strategic and deeply oriented manner than the expository text.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21248/l1esll.2023.23.1.407"
    },
    {
        "id": 23972,
        "title": "Speech-and-Text Transformer: Exploiting Unpaired Text for End-to-End Speech Recognition",
        "authors": "Qinyi Wang, Xinyuan Zhou, Haizhou Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/116.00000001"
    },
    {
        "id": 23973,
        "title": "Prompttts: Controllable Text-To-Speech With Text Descriptions",
        "authors": "Zhifang Guo, Yichong Leng, Yihan Wu, Sheng Zhao, Xu Tan",
        "published": "2023-6-4",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096285"
    },
    {
        "id": 23974,
        "title": "Encryption and Tokenization of Card Security using Cryptographic Algorithms",
        "authors": "IJSREM JOURNAL",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "There are several alternative strategies that can be used when utilising cryptography to encrypt card information. Encryption's main objective in this situation is to prevent sensitive card information from being intercepted and used fraudulently, including the card number, expiration date, and security code. Using SSL (Secure Socket Layer) or TLS (Transport Layer Security), which establishes a safe, encrypted connection between a website or app and the server where the card information is stored, is one popular method of encrypting card information. This is frequently used for online transactions, such as when paying with a mobile app or buying something from an e-commerce website. Using end-to-end encryption is an alternative strategy that guarantees that card information is encrypted from the time it is entered into a device, website, or app until it reaches its destination. This is frequently used with tokenization, which exchanges the sensitive card information for a singular token that can be safely kept and used for upcoming transactions without disclosing the actual card data.  Additionally, a number of cryptographic protocols and algorithms, including AES (Advanced Encryption Standard), RSA (Rivest-Shamir-Adleman), and ECC (Elliptic Curve Cryptography), can be used to encrypt card information. These algorithms and protocols jumble the data using intricate mathematical computations so that it cannot be decoded without the right decryption key.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem25570"
    },
    {
        "id": 23975,
        "title": "Text Region Multiple Information Perception Network for Scene Text Detection",
        "authors": "Jinzhi Zheng, Libo Zhang, Yanjun Wu, Chen Zhao",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447175"
    },
    {
        "id": 23976,
        "title": "Text Prior Guided Scene Text Image Super-Resolution",
        "authors": "Jianqi Ma, Shi Guo, Lei Zhang",
        "published": "2023",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tip.2023.3237002"
    },
    {
        "id": 23977,
        "title": "Research on Text Generation Model of Natural Language Processing Based on Computer Artificial Intelligence",
        "authors": "Zhijian Zhao",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257788"
    },
    {
        "id": 23978,
        "title": "Nearest Neighbor Non-autoregressive Text Generation",
        "authors": "Ayana Niwa, Sho Takase, Naoaki Okazaki",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2197/ipsjjip.31.344"
    },
    {
        "id": 23979,
        "title": "TLWSR: Weakly supervised real‐world scene text image super‐resolution using text label",
        "authors": "Qin Shi, Yu Zhu, Chuantao Fang, Dawei Yang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractScene text image super‐resolution (STISR) has recently received considerable attention. Existing STISR methods are applicable to the situation that all the LR‐HR pairs are available. However, in real‐world scenarios, it is difficult and expensive to collect ground‐truth HR labels and align them with LR images, and thus it is essential to find a way to implement weakly supervised learning. We investigate the STISR problem in the situation that only a subset of HR labels is available and design a weak supervision framework using coarse‐grained text labels named TLWSR, which combines incomplete supervision and inexact supervision. Specifically, a lightweight text recognition network and connectionist temporal classification loss are used to guide the super‐resolution of text images during training. Extensive experiments on the benchmark TextZoom demonstrate that TLWSR generates distinguishable text images and exceeds the fully supervised baseline TSRN in boosting text recognition accuracywith only 50% HR labels available. Meanwhile, TLWSR can be applied to different super‐resolution backbones and significantly improves their performance. Furthermore, TLWSR shows good generalization capability to low‐quality images on scene text recognition benchmarks, which verifies the effectiveness of this framework. To the authors' knowledge, this is the first work exploring the problem of STISR in weakly supervised scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ipr2.12827"
    },
    {
        "id": 23980,
        "title": "DiffusionSTR: Diffusion Model for Scene Text Recognition",
        "authors": "Masato Fujitake",
        "published": "2023-10-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222793"
    },
    {
        "id": 23981,
        "title": "Text Analysis and Summarization: Innovating Information Processing Through Advanced Technology",
        "authors": "",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17756/nwj.2023-s4-090"
    },
    {
        "id": 23982,
        "title": "Data Assets: Tokenization and Valuation",
        "authors": "Hirsh Pithadia, Enzo Fenoglio, Bogdan Batrinca, Philip Treleaven, Radu Echim, Andrei Bubutanu, Charles Kerrigan",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4419590"
    },
    {
        "id": 23983,
        "title": "Unified benchmark for zero-shot Turkish text classification",
        "authors": "Emrecan Çelik, Tuğba Dalyan",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2023.103298"
    },
    {
        "id": 23984,
        "title": "Image clustering using generated text centroids",
        "authors": "Daehyeon Kong, Kyeongbo Kong, Suk-Ju Kang",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.image.2024.117128"
    },
    {
        "id": 23985,
        "title": "Economic and legal instruments of tokenization of enterprise assets: Russian and foreign experience",
        "authors": "A.S. Shavkun",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.51409/v.a.2023.03.01.008"
    },
    {
        "id": 23986,
        "title": "Approaches to asset tokenization for the development of e-commerce",
        "authors": "Volodymyr Lagodiienko",
        "published": "2023",
        "citations": 0,
        "abstract": "In the paper, using the example of analysing the approaches of scientific research of scientists from different countries, a new form of development of trade and economic relations is explored – e-commerce and its innovative electronic financial instrument – asset tokenization. The study was based on an analysis of the approaches of scientists, as well as on practical analytical studies, which presented an understanding of the features of the influence of tokens as a financial instrument on the development of e-commerce. Among the main methods used in the study, the comparative method, the method of historical reconstruction of development and analytical interpretation, as well as other general scientific and specialized methods were used, which formed an interdisciplinary methodological toolkit. Based on the research materials of scientists, the article makes a historical excursion into the formation of e-commerce and its digital and financial instruments in the context of global economic crises and overcoming their consequences for the financial market infrastructure, because of which three periods of development of the transformation of e-commerce are identified. As a result, the paper proves that the scientific problem of tokenization of assets has been little studied; the materials of the authors’ scientific research indicate the formation of three main areas of research: the formation of transaction logistics; digitization of the supply chain; the transformational impact of blockchain technology in the development of e-commerce. The article presents the main characteristics of scientific approaches for each of the three groups of studies, which reflect the impact on the development of e-commerce. The systemic impact of asset tokenization on the development of e-commerce is summarized as a transition to a new level of simplification of interaction between counterparties and the formation of an innovative system for protecting ownership of a digitized asset, which also affects its liquidity, and prospects for further research on this new economic issue are presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35774/econa2023.03.142"
    },
    {
        "id": 23987,
        "title": "Self-tuning Hyper-parameters for Unsupervised Cross-lingual Tokenization",
        "authors": "Anton Kolonin",
        "published": "2023-11-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apeie59731.2023.10347856"
    },
    {
        "id": 23988,
        "title": "Text-to-Text Pre-Training with Paraphrasing for Improving Transformer-Based Image Captioning",
        "authors": "Ryo Masumura, Naoki Makishima, Mana Ihori, Akihiko Takashima, Tomohiro Tanaka, Shota Orihashi",
        "published": "2023-9-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289992"
    },
    {
        "id": 23989,
        "title": "STRATEGIES OF MEDIA TEXT",
        "authors": "I. Piankovska",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32841/2409-1154.2023.59.3.10"
    },
    {
        "id": 23990,
        "title": "Finite-State Text Processing",
        "authors": "Aniello De Santo",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_r_00466"
    },
    {
        "id": 23991,
        "title": "Tokenization Impacts Multilingual Language Modeling: Assessing Vocabulary Allocation and Overlap Across Languages",
        "authors": "Tomasz Limisiewicz, Jiří Balhar, David Mareček",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.350"
    },
    {
        "id": 23992,
        "title": "La Tokenización y la Blockchain REGTURI para el Alojamiento Colaborativo (Tokenization and REGTURI Blockchain for P2P Accommodation)",
        "authors": "Cristina Argelich-Comelles",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4434594"
    },
    {
        "id": 23993,
        "title": "Improve Data Text Quality by Applying Text Pre-Processing Method (Case Study)",
        "authors": "Rizky Dwi Novyantika, Sani Muhamad Isa",
        "published": "2023-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/22315381/ijett-v71i1p209"
    },
    {
        "id": 23994,
        "title": "Text removal method combining text location and image inpainting",
        "authors": "Zheng Yan, Jinxun Lin, Zhifeng Zhao, Guodong Chen",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2680977"
    },
    {
        "id": 23995,
        "title": "Improving Text-Audio Retrieval by Text-Aware Attention Pooling and Prior Matrix Revised Loss",
        "authors": "Yifei Xin, Dongchao Yang, Yuexian Zou",
        "published": "2023-6-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096972"
    },
    {
        "id": 23996,
        "title": "GPT-4 Driven Cinematic Music Generation Through Text Processing",
        "authors": "Muhammad Taimoor Haseeb, Ahmad Hammoudeh, Gus Xia",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447950"
    },
    {
        "id": 23997,
        "title": "CHALLENGES AND STRATEGIES IN ENGLISH CINEMATIC TEXT TRANSLATION",
        "authors": "Maryana Tomenchuk, Viktoriia Papp",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52058/2695-1592-2023-11(30)-348-358"
    },
    {
        "id": 23998,
        "title": "THE EFFECT OF TEACHER’S IMPLEMENTED STRATEGIES ON STUDENTS’ TEXT COMPREHENSION",
        "authors": "",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36315/2023v1end004"
    },
    {
        "id": 23999,
        "title": "Developing Informational Text Writing Skills of Gifted Students by Leveraging Writing Strategies",
        "authors": "Ömer ERBASAN, Hakan DEDEOĞLU",
        "published": "2023-7-28",
        "citations": 1,
        "abstract": "Designed as action research, this qualitative study aims to develop the informational text writing skills of gifted students through the strategies of “all about” books and frames for writing biographies. The study group of the research consists of 21 gifted 4th grade students studying in the field of general mental ability in a Science and Art Center in the spring semester of the 2020-2021 academic year. An eight-week action plan was prepared to support the development of these students' ability to write informational texts. The first 4 weeks are planned with our “all about” books, the last 4 weeks with the strategies of biography writing frameworks. The data were collected with student and teacher diaries, observer reports, student products and Informational Text Writing Rubric. Content analysis was used in the analysis of the collected data. The analysis of the data revealed that while the informational text writing skills of the students were at a moderate level at the beginning, they reached a high level at the end of the process. Based on the findings, some suggestions were presented to teachers and researchers to improve students' ability to write informational texts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30831/akukeg.1257444"
    },
    {
        "id": 24000,
        "title": "Tokenization of real assets: classification, platforms, applications, opportunities and challenges of development",
        "authors": "S. A. Andryushin",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "Objective: literature review and basic characteristics of the asset tokenization; clarification of the types of token classification; identification of the stages of modeling the asset tokenization; analysis of applications of decentralized finance ecosystem protocols; study of the opportunities and systemic advantages of asset tokenization; presentation of the problems arising in the asset tokenization; analysis of the factors of asset tokenization efficiency growth.Methods: the article uses empirical, historical, logical, country-specific, corporate, comparative and statistical methods of economic analysis to study the peculiarities of the asset tokenization development in the digital transformation of modern economy.Results: the basic characteristics of the asset tokenization are disclosed; the types of standardized tokens involved in the asset tokenization are defined; the stages of the asset tokenization development are considered; the options of using decentralized finance applications under asset tokenization are shown; the opportunities of tokenization through the new forms of investment, increased financial accessibility, transparency and componentization of tokenized assets are studied; the problems of tokenization are analyzed; the factors of asset tokenization efficiency growth under the cross-chain compatibility of different types of blockchains are analyzed. Scientific novelty: the article shows that asset tokenization is a process of accounting and asset management transformation, in which each asset is represented in the form of a programmable digital token; tokenization is a new form of creating additional liquidity by expanding the circulation of idle illiquid assets. Tokenization guarantees greater transparency regarding the rights to real assets and the history of ownership of these rights; it contributes to transaction efficiency by reducing transaction costs, including costs associated with management, token issuance and possible forms of intermediation. By accessing the applications of the DeFi ecosystem, it allows the expansion of financial market potential through the fragmentation and compartmentalization of tokenized assets. All the challenges in the asset tokenization are related to the blockchain trilemma, where decentralization, security and scalability cannot be implemented together. The blockchain trilemma is now becoming a set of possible trade-offs that can preserve all three properties of the blockchain, but at different levels of compatibility. To form a set of possible trade-offs, it is necessary to develop a theory of interoperability, which should be built on the compatibility of factors such as anonymity and privacy, security and preservation of rights to tokenized assets.Practical significance: the main provisions and conclusions of the article can be used: to develop scenarios for the asset tokenization development under the digital transformation of modern economy; to analyze the applications of the decentralized finance ecosystem protocols; to increase the efficiency of asset tokenization under the cross-chain compatibility of different types of blockchains; to study additional opportunities and systemic advantages as a result of fragmentation and compatability of tokenized assets; to study the problems arising in the asset tokenization; and to search for additional growth factors for the asset tokenization efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21202/2782-2923.2024.1.88-104"
    },
    {
        "id": 24001,
        "title": "HiTEK Pre-processing for Speech and Text: NLP",
        "authors": "Naveenkumar T Rudrappa,  , Mallamma V Reddy, M Hanumanthappa",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i19.296"
    },
    {
        "id": 24002,
        "title": "Learn Your Tokens: Word-Pooled Tokenization for Language Modeling",
        "authors": "Avijit Thawani, Saurabh Ghanekar, Xiaoyuan Zhu, Jay Pujara",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.662"
    },
    {
        "id": 24003,
        "title": "Formalizing BPE Tokenization",
        "authors": "Martin Berglund, Brink van der  Merwe",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4204/eptcs.388.4"
    },
    {
        "id": 24004,
        "title": "BERT models for Brazilian Portuguese: Pretraining, evaluation and tokenization analysis",
        "authors": "F.C. Souza, R.F. Nogueira, R.A. Lotufo",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110901"
    },
    {
        "id": 24005,
        "title": "A survey of text summarization: Techniques, evaluation and challenges",
        "authors": " Supriyono, Aji Prasetya Wibawa,  Suyono, Fachrul Kurniawan",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2024.100070"
    },
    {
        "id": 24006,
        "title": "Data preprocessing and tokenization techniquesfortechnical Ukrainian texts",
        "authors": "Mashtalir Sergii V., Nikolenko Oleksandr V.",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "The  field  of  Natural  Language  Processing  (NLP)  has  witnessed  significant  advancements  fueled  by  machine  learning,  deep learning, and artificial intelligence, expanding its applicability and enhancing human-computer interactions. However, NLP systems grapple  with  issues  related  to  incomplete  and  error-laden  data,  potentially  leading  to  biased  model  outputs.  Specialized  technical domains  pose  additional  challenges,  demanding  domain-specific  fine-tuning  and  custom  lexicons.  Moreover,  many  languages  lack comprehensive NLP  support,  hindering  accessibility.In  this  context,  we  explore  novel  NLP  data  preprocessing  and  tokenization techniques tailored for technical Ukrainian texts. We address a dataset comprising automotive repair labor entity names, known for errors  and  domain-specific  terms,  often  in  a  blend  of  Ukrainian  and  Russian.  Our  goal  is  to  classify  these  entities  accurately, requiring  comprehensive  data  cleaning,  preprocessing  and  tokenization.Our  approach  modifies  classical  NLP  preprocessing, incorporating language detection, specific Cyrillic character recognition, compounded word disassembly, and abbreviation handling. Text  line  normalization  standardizes  characters,  punctuation,  and  abbreviations,  improving  consistency.  Stopwords  are  curatedto enhance  classification  relevance.  Translation  of  Russian  to  Ukrainian  leverages  detailed  classifiers,  resulting  in  a  correspondence dictionary.Tokenization  addresses  concatenated  tokens, spellingerrors,  common  prefixes  in  compound  words  and  abbreviations.Lemmatization, crucial in languages like Ukrainian and Russian, builds dictionaries mapping word forms to lemmas, with a focus on noun  cases.  The  results  yield  a  robust  token  dictionary  suitable  for  various  NLP  tasks,  enhancing  the  accuracy  and  reliability  of applications,  particularly  in  technical  Ukrainian  contexts.  This  research  contributes  to  the  evolving  landscape  of  NLP  data preprocessing and tokenization, offering valuable insights for handling domain-specific languages.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15276/aait.06.2023.22"
    },
    {
        "id": 24007,
        "title": "SoK: How Blockchain and Tokenization Will Transform the Energy Sector",
        "authors": "Olga Ilina, Ksenia Tagirova, Artem Barger, Vladimir Gorgadze",
        "published": "2023-7-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/coins57856.2023.10189196"
    },
    {
        "id": 24008,
        "title": "Tokenization of creativity: user motivation, consensual value and Chinese copyright law",
        "authors": "R. A. Budnik",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "The subjectof this study is the legal-economic analysis of the non-fungible token phenomenon. Due to the a priori accessibility of many tokenized intellectual products, the ability to monetize them by copyright methods turns out to be hard to implement. The paper puts forward a hypothesis that token owners apply innovative monetization methods, which do not stand on the prohibition and restriction of access to the protected results of intellectual activity. Instead of deactivated copyright restrictions, token buyers receive some new, additional, non-trivial economic utility that researchers have not reflected yet. If this utility exists, we should identify, analyze and include it in the equation of relations regarding NFT. The second hypothesis of the study stems from the first one. It states that the results of creative activity in the post-economic society take the place of a new etalon of value, which replaces the materialistic standard of worth based on rarity. The consensual value contained in tokenized works brings additional motivators for token purchasers and compensates for the lost sources of income.Our goal is to put and verify the scientific hypotheses of tokenized works' additional non-obvious value existence. We suppose that this innovative utility substitutes traditional copyright ban-based monetization abilities. The research's purpose is also to theoretically generalize its results and formulate a legal-economic concept that explains the motivation for the purchasers of non-fungible tokens and sets the regulations for the NFT market.Methodology.The study of the non-fungible token phenomenon and the verification of formulated hypotheses conducts from the standpoint of the law, economics, an interdisci-plinary legal-economic – institutional point of view, as well as with the help of the monistic copyright doctrine of the People's Republic of China. The research methodology also includes an analysis of the relevant body of knowledge and various points of view of the scientists on the subject of research.The study's main resultis the novel elaborated concept of the non-fungible token owner's moral right. This concept fills the rising doctrine of utilitarian digital rights with legal-economic essence. We constructed the non-fungible token owner's moral right consisting of two powers: the right to designate one's name as the owner of a token for a specific creative product and to demand such an indication from others; and also, as a duty of NFT platforms to support the function of informing about the name or pseudonym of the token's owner.Analysis of the appropriate accumulated knowledge, development, and verification of formulated hypotheses on tokenized works' consensual value and additional economic utility, allowed us to achieve the goals of this study. We resolve the issue of token purchasers' motivation and legal-economic grounds for their rational behavior by formulating and substantiating the concept of non-fungible tokens' owner moral right.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52468/2542-1514.2023.7(2).135-143"
    },
    {
        "id": 24009,
        "title": "Politeness Strategies in WhatsApp Text Messaging",
        "authors": "Miftahush Shalihah, Tri Winarsih",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "Lecturers and students frequently interact in both formal and semi-formal settings. Communication between students and professors must, of course, be maintained in such a way that it is always polite, even in informal situations. The availability of social media undoubtedly enhances contact between teachers and students. However, the use of social media has an impact on the language style of lecturers and students. This research aims to explain and examine the ethics of lecturers when responding to students’ text messages using the WhatsApp messaging application. Furthermore, this study examines violations from etiquette norms in short messages from the lecturer to the students. This study was qualitative in nature. The primary data of this research were the screenshots of interactions between instructors and students via the WhatsApp messaging application. This research also employed observation, note-taking, and interviews. According to the preliminary study, there are still numerous short messages between lecturers and students that do not match the courtesy standard. The unfulfilled value of politeness is the use of slang, impolite ways of expressing intentions or the use of inappropriate linguistic aspects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47814/ijssrr.v6i7.1323"
    },
    {
        "id": 24010,
        "title": "SOME MEDIA TEXT STRATEGIES",
        "authors": "Rana Abdul Latif HAMED",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "The dominant elements in the formation of the media text are informatinty, expectation, branch code, and implicure. These elements are appropriate to explicate the text communicative structure and pragmatic use. This paper clarifies that the classification of the media text as a pattern is based on its dominant theme, not on its linguistic structure. This theme is a sort of sending the information to the receivers through a communicative medium (such as the press, radio, or television). The sending represents an illocutionary act because the media is essentially based on the principle of unknownness, i.e. the dominant function of the media text lies in its informatinty, not in its linguistic structure. It is this informatinty that gives the text its shape because it is its main pragmatic element according to E. U. Große. This paper makes use of Robert De Beaugrande’s ideas of informatinty and expectation, and his understanding of the text as a process of a productive nature that requires a producer, production, events, and a receiver. The paper also makes use of Van Dijk’s view of the text as a unit of an interactive nature, and his belief that the event in its relation to the communicative act is parallel to the “meaning” in relation to the linguistic structure. The paper, to a certain degree, also makes use of Wolfgang Heinemann’s, Grice’s, and Klaus Brinker’s speculations of the strategies movement inside the communicative structure, and how it is these strategies that show the entity of what is termed the media text",
        "keywords": "",
        "link": "http://dx.doi.org/10.47832/2717-8293.27.8"
    },
    {
        "id": 24011,
        "title": "Korean Tokenization for Beam Search Rescoring in Speech Recognition",
        "authors": "Kyuhong Shim, Hyewon Bae, Wonyong Sung",
        "published": "2023-2-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic57457.2023.10049934"
    },
    {
        "id": 24012,
        "title": "Natural Language Processing Approach for Classification of Archetypes Using Text on Business Environments",
        "authors": "Richard Mariano, Ana Conceição de Jesus, Alessandro Vieira, Jessica Almeida de Lima, Giulia Zanon de Castro, Wladmir Brandão",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011856200003467"
    },
    {
        "id": 24013,
        "title": "The Evolution of Financial Market Infrastructure: From Digitalization to Tokenization",
        "authors": "Dong Guo, Peng Zhou",
        "published": "2023-3-8",
        "citations": 3,
        "abstract": "This paper examines the historical development and cross-sectional heterogeneities of Financial Market Infrastructure (FMI). From an evolutionary perspective, we review and compare FMIs in the US, Europe, and China. We identify an emerging trend in which the development of FMI is transitioning from digitalization to tokenization with the rise of Distributed Ledger Technology (DLT). Digitalization reinforces centralization, while tokenization promotes decentralization, posing complex challenges to regulatory framework which is also part of FMI. We then specifically analyze DLT-based FMI in the bond market, evaluate different models of tokenization, and propose a heterogeneous consortium blockchain solution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56502/ijie2010002"
    },
    {
        "id": 24014,
        "title": "Training-Free Location-Aware Text-to-Image Synthesis",
        "authors": "Jiafeng Mao, Xueting Wang",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222616"
    },
    {
        "id": 24015,
        "title": "Predicting protein-lipid interactions through machine learning methods employing new tokenization techniques",
        "authors": "Carlos R. Cuellar Rodriguez, Emad Tajkhorshid",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bpj.2022.11.2711"
    },
    {
        "id": 24016,
        "title": "Text Data Pre-Processing for Time-series Modelling",
        "authors": "Jitka Poměnková, Petr Koráb, David Štrba",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/radioelektronika57919.2023.10109034"
    },
    {
        "id": 24017,
        "title": "RESEARCH PROGRESS IN LEGAL TEXT PROCESSING BASED ON DEEP LEARNING",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61784/tsshr231229"
    },
    {
        "id": 24018,
        "title": "MSViT: Dynamic Mixed-scale Tokenization for Vision Transformers",
        "authors": "Jakob Drachmann Havtorn, Amélie Royer, Tijmen Blankevoort, Babak Ehteshami Bejnordi",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00091"
    },
    {
        "id": 24019,
        "title": "Sarcasm Detection in Arabic Text Using Contextualized Models",
        "authors": "Youssef Mansour, Ashraf Elnagar",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ialp61005.2023.10337175"
    },
    {
        "id": 24020,
        "title": "Building for tomorrow: Assessing the temporal persistence of text classifiers",
        "authors": "Rabab Alkhalifa, Elena Kochkina, Arkaitz Zubiaga",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2022.103200"
    },
    {
        "id": 24021,
        "title": "Multiple improvement strategies for high-density text detection based on DBNet",
        "authors": "Jingyang Men",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "High-Density text detection is actually challenging task, which deserves more attention on its performance improvement. Based on a typical existing text detection model called DBNet, this paper introduces a new approach in improving the performance of it in text-rich and readability interfered scenarios, which are mostly characterized by dozens of lines of text using different font sizes and text background harder for detecting and reading, the most significant scenario is text detection on the passport information page. The approach proposed in this study includes several steps, namely a baseline setting, a method of dataset enrichment and new loss function aiming at raising text detection for short texts and single characters, such methods has achieved enhanced improvement on text detection especially on short texts: an overall precision reaching 0.7854 and recall reaching 0.8758. Compared with the base model, the experimental results demonstrated the effectiveness of the proposed methods in this study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/19/20230532"
    },
    {
        "id": 24022,
        "title": "Narrative strategies in action  – text, form, and context",
        "authors": "Anca CIORNEI",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "The major changes in the global security environment that took place at the end of the last millennium continue to deeply mark the first quarter of the 21st century, characterized by substantial changes in the classical instruments used in conducting a conflict. Also, the transformation of the informational environment has led to the emergence, development, adaptation, and contextualization of the use of strategic narratives with the aim of influencing people’s perceptions of the actions of power states and producing effects in the sense desired by them.The purpose of this article is to subject strategic narratives to attention, as part of contemporary hybrid confrontations, aiming to bring a better understanding of this subject, observing how they are used and with what effects, depending on the form in which they appear. Moreover, the article proposes a multilevel conceptual delimitation, approaching strategic narratives from the perspectives of text, context, and form, as highlighted in the most recent research in the specialized field. We will also consider their use in an allied context, with reference to working documents that NATO uses in strategic communication to influence target groups and audiences, both internal and external.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53477/2284-9378-24-11"
    },
    {
        "id": 24023,
        "title": "Investigating the Combination between Pre-processing Technique and Text Vectorization for Machine Learning Model in Investor Comment Classification",
        "authors": "Muhammad Fikri Hasani,  Anderies",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwaiip58158.2023.10462834"
    },
    {
        "id": 24024,
        "title": "The concept of text processing in an ontological approach to spatio-temporal social network analysis",
        "authors": "Maryna Popova, Eduard Siemens, Kirill Karpov",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwssip58668.2023.10180274"
    },
    {
        "id": 24025,
        "title": "Arabic abstractive text summarization using RNN-based and transformer-based architectures",
        "authors": "Mohammad Bani-Almarjeh, Mohamad-Bassam Kurdy",
        "published": "2023-3",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2022.103227"
    },
    {
        "id": 24026,
        "title": "Rare words in text summarization",
        "authors": "Danila Morozovskii, Sheela Ramanna",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2023.100014"
    },
    {
        "id": 24027,
        "title": "Method with Digital Signal Processing for Increasing the Efficiency of Thermal Neutron Detection by a Scintillation Detector Based on a $${{^{6}{\\text{LiF}}} \\mathord{\\left/ {\\vphantom {{^{6}{\\text{LiF}}} {{\\text{ZnS}}({\\text{Ag}})}}} \\right. \\kern-0em} {{\\text{ZnS}}({\\text{Ag}})}}$$ Screen and Wavelength-Shifting Fibers",
        "authors": "M. M. Podlesny, V. V. Kruglov, V. I. Bodnarchuk, V. M. Milkov, A. A. Bogdzel",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1547477124020109"
    },
    {
        "id": 24028,
        "title": "Atomyze - The Scalable Hyperledger Fabric-Powered Blockchain Platform Revolutionizing Asset-Backed Tokenization",
        "authors": "Artem Barger, Vladimir Gorgadze, Alexandr Belenov, Ekaterina Frolovicheva",
        "published": "2023-7-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/coins57856.2023.10189252"
    },
    {
        "id": 24029,
        "title": "Text Fact Transfer",
        "authors": "Nishant Balepur, Jie Huang, Kevin Chang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.288"
    },
    {
        "id": 24030,
        "title": "Effect of tokenization granularity for Turkish large language models",
        "authors": "Yiğit Bekir Kaya, A. Cüneyd Tantuğ",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2024.200335"
    },
    {
        "id": 24031,
        "title": "Scene Text Recognition Models Explainability Using Local Features",
        "authors": "Mark Vincent Ty, Rowel Atienza",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222406"
    },
    {
        "id": 24032,
        "title": "BlockPAT: A Blockchain-Enabled Second-Hand Physical Asset Tokenization Management System",
        "authors": "Jiaxuan Wu, Wei-Yang Chiu, Weizhi Meng, Brooke Lampe",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdcs57875.2023.00135"
    },
    {
        "id": 24033,
        "title": "Tokenization: Overview and Financial Stability Implications",
        "authors": "Francesca Carapella, Grace Chuan, Jacob Gerszten, Chelsea Hunter, Nathan Swem",
        "published": "2023-9",
        "citations": 3,
        "abstract": "In this paper we outline tokenization, which is a new and rapidly growing financial innovation in crypto asset markets, and we discuss potential benefits and financial stability implications. Tokenization refers to the process of constructing digital representations (crypto tokens) for non-crypto assets (reference assets). As we discuss below, tokenizations create interconnections between the digital asset ecosystem and the traditional financial system. At sufficient scale, tokenized assets could transmit volatility from crypto asset markets to the markets for the crypto tokens reference assets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17016/feds.2023.060"
    },
    {
        "id": 24034,
        "title": "Summarization Of Text Using Natural Language Processing",
        "authors": "Madhur Yadav",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29322/ijsrp.13.04.2023.p13611"
    },
    {
        "id": 24035,
        "title": "Heuristic Masking for Text Representation Pretraining",
        "authors": "Yimeng Zhuang",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095445"
    },
    {
        "id": 24036,
        "title": "Computational Analysis of Printed Arabic Text Database for Natural Language Processing",
        "authors": "Hassina Bouressace",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "A frequency dictionary of printed Arabic text is essential for natural language processing. It includes 1,251 XML files of Arabic documents collected from ten newspapers and magazines from different countries and created as the PATD database. A total of 2,344 articles were created with various structures: open vocabulary, multi-font, multi-size, and multi-style text. From these articles, 1,102,078 tokens, 19,926 sentences, and 1,000,000 words were extracted. This dictionary provides detailed information for each word, including English equivalents, usage statistics, usage distribution, and the most widely used terms. A thematic vocabulary list of the top words on various topics is also provided. This frequency dictionary is a useful resource of modern Arabic vocabulary for various specialists, students, and learners. The frequency dictionary is freely available to interested researchers on the webpage.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11649/cs.3027"
    },
    {
        "id": 24037,
        "title": "Text-based Q&amp;A: Automated Question Generation and Answering for Enhanced Data Processing",
        "authors": "",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cats58046.2023.10424347"
    },
    {
        "id": 24038,
        "title": "A new multifractal-based deep learning model for text mining",
        "authors": "Zhenhua Wang, Fuqian Zhang, Ming Ren, Dong Gao",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2023.103561"
    },
    {
        "id": 24039,
        "title": "Bridging The Domain Gap Arising from Text Description Differences for Stable Text-To-Image Generation",
        "authors": "Tian Tan, Weimin Tan, Xuhao Jiang, Yueming Jiang, Bo Yan",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447092"
    },
    {
        "id": 24040,
        "title": "FCToken: A Flexible Framework for Blockchain-Based Compliance Tokenization",
        "authors": "Hao Tan, Shuangzhou Yan, Xin Zou, Guanghuan Xie, Hongxin Zhang, Zhuo Li",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdmw60847.2023.00093"
    },
    {
        "id": 24041,
        "title": "Text Processing Method based on Natural Language Processing",
        "authors": "Shiyi Yu, Jialin Ji",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "Today, natural language processing is booming and is widely used in different fields, especially for text processing. In many Chinese natural language processing tasks such as information retrieval, named entity recognition, syntactic analysis, etc., word segmentation and part-of-speech tagging are often the first steps. This paper mainly selects sequence labeling model and BERT pre-training model, specifically studies how to use natural language processing technology for text processing, and analyzes and summarizes the advantages and disadvantages of the two models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62051/qqbb7096"
    },
    {
        "id": 24042,
        "title": "Multi-Task Learning for Front-End Text Processing in TTS",
        "authors": "Wonjune Kang, Yun Wang, Shun Zhang, Arthur Hinsvark, Qing He",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10446241"
    },
    {
        "id": 24043,
        "title": "Strategies for Improving Low Resource Speech to Text Translation Relying on Pre-trained ASR Models",
        "authors": "Santosh Kesiraju, Marek Sarvaš, Tomáš Pavlíček, Cécile Macaire, Alejandro Ciuba",
        "published": "2023-8-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-2506"
    },
    {
        "id": 24044,
        "title": "Ambiguity attack against text-to-image diffusion model watermarking",
        "authors": "Zihan Yuan, Li Li, Zichi Wang, Xinpeng Zhang",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2024.109509"
    },
    {
        "id": 24045,
        "title": "Metacognitive Strategies Impact in Reading Technopreneurial Text - Narratives of a Technical University",
        "authors": "Salmah Anisah Abu Hassan, Norkhairi Ahmad",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceed59801.2023.10264035"
    },
    {
        "id": 24046,
        "title": "The use of grammar learning strategies by law students in writing opinion text",
        "authors": "Arti Prihatini, Fida Pangesti",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "Writing is a big problem for law students because of the lack of grammar mastery, limited interactions during the pandemic, and lack of motivation. This study aims to fill the need for investigations about social and affective strategies, part of grammar learning strategies, in writing opinion texts by law students during the pandemic. This study used a mix-method. The respondents were 245 first-year law students at the University of Muhammadiyah Malang. Data collection used inventory and open-ended questions. The results showed that the affective strategy average was 3.30 (medium), while the social strategy was 3.50 (high). The correlation between all social and affective strategies tends to be high, 0.73990. However, the correlation of each strategy in it varies, ranging from very weak to very strong. Even though there are limited interactions, they still use social strategies to overcome the problems of implementing grammar in writing. The dominant social strategy is using corrective feedback on writing by lecturers and other students and learning from people who are more proficient in grammar. On the other hand, the significant affective strategy was trying to relax when having problems understanding grammar and motivating to master grammar. These findings have pedagogical implications for grammar learning strategies in writing to law.Keywords: affective strategies, grammar learning strategies, social strategies, law, writing of opinion text",
        "keywords": "",
        "link": "http://dx.doi.org/10.21831/ltr.v22i2.53565"
    },
    {
        "id": 24047,
        "title": "Resource-Efficient Fine-Tuning Strategies for Automatic MOS Prediction in Text-to-Speech for Low-Resource Languages",
        "authors": "Phat Do, Matt Coler, Jelske Dĳkstra, Esther Klabbers",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-2158"
    },
    {
        "id": 24048,
        "title": "ViSoBERT: A Pre-Trained Language Model for Vietnamese Social Media Text Processing",
        "authors": "Nam Nguyen, Thang Phan, Duc-Vu Nguyen, Kiet Nguyen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.315"
    },
    {
        "id": 24049,
        "title": "Text Post-processing on Optical Character Recognition output using Natural Language Processing Methods",
        "authors": " Thangam, U Kumaran, Dipshikha Biswas, B Sneha, Suneel Nadipalli, Saleem Raja",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mysurucon59703.2023.10396964"
    },
    {
        "id": 24050,
        "title": "Comparative analysis of strategies of knowledge distillation on BERT for text matching",
        "authors": "Yifan Yang",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "Large language model is a highly effective and promising language model technology that can improve the performance and robustness of natural language processing tasks. As a representative work, Bidirectional Encoder Representations from Transformers (BERT) has excellent performance in various natural language processing tasks. This model is pre-trained on large-scale language dataset and has gained attention from all walks of life since its introduction. However, its huge number of participants and scale make its performance in mobile very limited. As an effective technique to compress neural network, knowledge distillation can obtain a lightweight model with smaller parameters without losing too much model performance. Therefore, distillation of BERT models has been started, aiming at obtaining lightweight BERT models. In this paper, we will introduce several common BERT distillation models and analyse their model architecture, distillation process, and finally the compression efficiency and model effectiveness. It is concluded that the process of increasing recompression efficiency is often accompanied by decreasing model effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/51/20241188"
    },
    {
        "id": 24051,
        "title": "Fractional Vehicle Ownership and Revenue Generation Through Blockchain Asset Tokenization",
        "authors": "Elena Vitelaru, Luca Persia",
        "published": "2023-4-1",
        "citations": 2,
        "abstract": "Abstract\nThe automotive industry is on a continuous transition towards a more sustainable and integrated ecosystem influenced by the fast-paced adoption of Electrical Vehicles (EVs) and the developments of emerging technologies such as Automated Vehicles (AVs). The road transportation sector is also experimenting with the emergent decentralized blockchain technology in various ways ranging from supply chain transparency to insurance and tokenization. Some of the recent use cases are the use of Non-Fungible Tokens (NFTs), unique digital assets designed to be immutable, to certify ownership of a vehicle, the data history of it or just for fan base development. The current paper reviews the literature findings concerning the potential of Non-Fungible Tokens for the automotive industry and proposes a new car ownership and revenue generation model using the ERC-1155 token standard. Our proof-of-concept based on fractional vehicle ownership demonstrates the feasibility of such a model that allows for revenue distribution amongst the vehicle owners according to the percentile invested in the vehicle acquisition.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/ttj-2023-0011"
    },
    {
        "id": 24052,
        "title": "Correction: Improving the quality of chemical language model outcomes with atom-in-SMILES tokenization",
        "authors": "Umit V. Ucak, Islambek Ashyrmamatov, Juyong Lee",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13321-023-00740-w"
    },
    {
        "id": 24053,
        "title": "Tokenization: Overview and Financial Stability Implications",
        "authors": "Francesca Carapella, Grace Chuan, Jacob Gerszten, Chelsea Hunter, Nathan Swem",
        "published": "2023-12",
        "citations": 0,
        "abstract": "In this paper we outline tokenization, which is a new and rapidly growing financial innovation in crypto asset markets, and we discuss potential benefits and financial stability implications. Tokenization refers to the process of constructing digital representations (crypto tokens) for non-crypto assets (reference assets). As we discuss below, tokenizations create interconnections between the digital asset ecosystem and the traditional financial system. At sufficient scale, tokenized assets could transmit volatility from crypto asset markets to the markets for the crypto token’s reference assets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17016/feds.2023.060r1"
    },
    {
        "id": 24054,
        "title": "A Multi-Model-Based Approach to Corpus Text Pre-Screening",
        "authors": "Zuhao Wu, Yude Bi",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ialp61005.2023.10337320"
    },
    {
        "id": 24055,
        "title": "The théorie du sens: studying the depth of processing of interpreting professionals in relation to source-text type",
        "authors": "",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/kn.2021.139557"
    },
    {
        "id": 24056,
        "title": "Tokenization Consistency Matters for Generative Models on Extractive NLP Tasks",
        "authors": "Kaiser Sun, Peng Qi, Yuhao Zhang, Lan Liu, William Wang, Zhiheng Huang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.887"
    },
    {
        "id": 24057,
        "title": "Text Generator using Natural Language Processing Methods",
        "authors": "Rupinder Kaur, Amandeep Kaur",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cictn57981.2023.10140271"
    },
    {
        "id": 24058,
        "title": "A Turkish Text Classification Based Feature Selection and Density Peaks Clustering",
        "authors": "Ezgi Zorarpaci",
        "published": "2023-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/siu59756.2023.10223750"
    },
    {
        "id": 24059,
        "title": "Text emotional analysis in Natural Language Processing",
        "authors": "Shangyue Lin",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "Natural Language Processing (NLP) is an important research direction in the field of artificial intelligence, aimed at enabling computers to understand and process human natural language. Emotional analysis refers to the use of computer technology to automatically recognize and classify the emotional tendencies expressed in text, such as positive, negative, or neutral. This technology can be applied to fields such as social media analysis, public opinion monitoring, market research, etc. The goal is to enable computers to understand and interpret emotional information in text like humans. Text sentiment analysis, as a key task of NLP, aims to identify and classify emotional tendencies expressed in text. This article will delve into the field of text sentiment analysis in natural language processing, focusing on the role and application of standard sentiment dictionaries and corpora in sentiment analysis. Reviewing relevant research conclusions, providing reference and inspiration for achieving more accurate and comprehensive text sentiment analysis through research and exploration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/36/20230440"
    },
    {
        "id": 24060,
        "title": "Performance evaluation of text processing of social media using text normalization and geolocation prediction",
        "authors": "Kolluri David Raju, P. Nethrasri, S. Bhargavi Latha, Srikanth Bethu, Kotari Sridevi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0181567"
    },
    {
        "id": 24061,
        "title": "Auto-Summarization of text by using Natural Language Processing",
        "authors": "",
        "published": "2023-8-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets43798"
    },
    {
        "id": 24062,
        "title": "Development of a Text Processing Automation Method for Using Modern Korean-Chinese Mixed Text in General Education",
        "authors": "Sun-young Kim",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "This study aims to develop an automated text processing method for the use of modern Korean-Chinese mixed newspaper materials in liberal arts education. This article describes the process, its results, and additional tasks. In particular, the focus was placed on the batch processing of texts downloaded in large quantities. The problem with the existing computerized and serviced Korean-Chinese mixed texts is that most of the old Korean texts were computerized with PUA codes, which are not currently in Unicode standards. To process or analyze texts in computer language, it is necessary to convert these characters into standard code methods. Based on the standardized data brought in, the work of replacing the old form of words with the current Korean notation was carried out. Finally, in the text, phonological and Korean notation of Chinese characters are added in parentheses. Reviewing the results shows a significant improvement in readability. If you want to use modern Korean and Chinese newspaper materials for liberal arts education, it may be difficult unless a separate feed process is premised. When trying to use modern Korean-Chinese newspaper materials for liberal arts education, it can be difficult due to the problem of notations. Furthermore, this automated form of processing allows instructors to extract articles related to specific topics and to read articles with students that increase their readability. But as things stand, there are limits. For example, if a Chinese character has multiple consonants, there may be cases in which a Chinese character has a reading sound that does not fit the Chinese character word and rather interferes with the reading of it. These should be used for education purposes after correction. In addition, even if it is a Korean-Chinese mixed text and pronunciation is provided here, it is difficult for a student without knowledge of classical Chinese grammar to read that text if a lot of classical Chinese expressions are mixed in. This case ultimately becomes a problem that can be solved by the development of a classical Chinese morpheme analyzer. If progress is made on such things as the construction of the classic Chinese Corpus, it will be of great help in the development of history and liberal arts teaching tools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46392/kjge.2023.17.5.41"
    },
    {
        "id": 24063,
        "title": "Book review: “IT Text 自然言語処理の基礎”",
        "authors": "Yusuke Oda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5715/jnlp.30.221"
    },
    {
        "id": 24064,
        "title": "Cross‐modal knowledge learning with scene text for fine‐grained image classification",
        "authors": "Li Xiong, Yingchi Mao, Zicheng Wang, Bingbing Nie, Chang Li",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "AbstractScene text in natural images carries additional semantic information to aid in image classification. Existing methods lack full consideration of the deep understanding of the text and the visual text relationship, which results in the difficult to judge the semantic accuracy and the relevance of the visual text. This paper proposes image classification based on Cross modal Knowledge Learning of Scene Text (CKLST) method. CKLST consists of three stages: cross‐modal scene text recognition, text semantic enhancement, and visual‐text feature alignment. In the first stage, multi‐attention is used to extract features layer by layer, and a self‐mask‐based iterative correction strategy is utilized to improve the scene text recognition accuracy. In the second stage, knowledge features are extracted using external knowledge and are fused with text features to enhance text semantic information. In the third stage, CKLST realizes visual‐text feature alignment across attention mechanisms with a similarity matrix, thus the correlation between images and text can be captured to improve the accuracy of the image classification tasks. On Con‐Text dataset, Crowd Activity dataset, Drink Bottle dataset, and Synth Text dataset, CKLST can perform significantly better than other baselines on fine‐grained image classification, with improvements of 3.54%, 5.37%, 3.28%, and 2.81% over the best baseline in mAP, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ipr2.13039"
    },
    {
        "id": 24065,
        "title": "Textual entailment as an evaluation metric for abstractive text summarization",
        "authors": "Swagat Shubham Bhuyan, Saranga Kingkor Mahanta, Partha Pakray, Benoit Favre",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2023.100028"
    },
    {
        "id": 24066,
        "title": "Extracting representative subset from extensive text data for training pre-trained language models",
        "authors": "Jun Suzuki, Heiga Zen, Hideto Kazawa",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2022.103249"
    },
    {
        "id": 24067,
        "title": "Scale-space Tokenization for Improving the Robustness of Vision Transformers",
        "authors": "Lei Xu, Rei Kawakami, Nakamasa Inoue",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3612060"
    },
    {
        "id": 24068,
        "title": "The Problem of Text Transformation in Digital Communication",
        "authors": "Larisa G. Tyutelova, Ekaterina S. Shevchenko, Valeria N. Lisovitskaya, Viacheslav D. Shevchenko",
        "published": "2023-4-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsds58064.2023.10130355"
    },
    {
        "id": 24069,
        "title": "From Text to Scene: Modern Methods and Staging Strategies",
        "authors": "Amin Saadati",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "This article examines the ideas and practices of directors and writers about the degree of fidelity and non-adherence to the text, reversal, and the use of the text as a preliminary text to present artists’ artistic concerns. The degree of fidelity of the theater play to the text and the author raises this question that whether the director will be accepted as the creator of the work or the person who performs it. This article shows that modern theater experts interpret the relationship between the written text and the staged play in different ways. While some directors see their play work as serving the writers and prioritizing their satisfaction, others see themselves as the creator of the work, sees text as one of the elements that can be removed from the theater. Konstantin Stanislavski, Jerzy Grotowski, Vsevolod Meyerhold, Elia Kazan, and Wooster are some of the famous actors whose comments are briefly reviewed in this article. What will become clear in this work is the diminishing role of the author as the sole creator of the work and the progress of the theater towards innovation, diversity of forms, and group work. At the end of this article, the novelty in presenting the text is considered not the death of the author, but a kind of continuation of the text and a revitalization of its various dimensions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34293/sijash.v10i3.4964"
    },
    {
        "id": 24070,
        "title": "Investigating Students' Strategies and Methods in Translating English Text into Indonesian",
        "authors": "Dhanu Ario Putra, Merry Rullyanti",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "In this era, England plays an important role in all fields, especially in education. Someone demanded to know the meaning and function of an English word. Thus, translation is also one of the four skills of mastering the English language, in addition to listening, speaking, reading and writing, translation also has a main function. The purpose of this work was to find out if students are committed to translating an English text, to describe the method used by students in translating an English text, to observe the ability of the students to translate an English text. Therefore, this study seemed very suitable for a case study because it tried to explore and explore student strategies in one class of 23 students. In this study, the researcher administered the test to students. In the test technique, the researcher gave an English text and asked the students to translate the English text as best as possible. There are four criteria to evaluate a student's translation, they are accuracy of message content, distinctiveness of message, appropriateness of language use and lastly mechanical appropriateness. The researcher also interviewed the translation teacher who was considered a key informant who really knew how far the student's ability to translate an English text was. The result of the interview was given to the teacher; showed that the students of the 4th semester still had many difficulties, they used only one technique for translation. In particular, these words are rarely found in English textbooks. In addition, the lecturer must be creative to find a suitable translation method for the students of the 4th semester to translate the English text into Indonesian, also the lecturer always motivates the students to understand the text by translating the source language into their target language. Right in Indonesian. At the same time, the students also needed a longer time to practice the translation of the text from the English text to the Indonesian language, because they do not have the right method to translate the English text and the lack of vocabulary, although the lecturer. Had already practiced the practice of the English text, but it was not enough to interest the students in practicing the translation of the English text.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33258/joder.v4i02.4518"
    },
    {
        "id": 24071,
        "title": "A Literature Survey on Tokenization of Digital Art with NFT Marketplace",
        "authors": " Bharath Gowda P,  Akarsh Kumar Gowda",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "In this era of boundless potential that the age of technology brought with it, artists are lured by the limitless terrain of digital world. Regardless, the existing backdrop presents issues for artists who work in the old-fashioned mediums and even one’s who work in the digital mediums, as it seems that they possess distinct challenges such as reduced revenue, complicated views on streaming statistics, copyright issues, and an old framework that is failing to suit the new digital era demands. This paper seeks to elevate the model in the form of digital art domain by combining non fungible tokens and blockchain technology. This paper proposes to respond to the looming challenges of copyright infringement as well as guaranteeing income security of digital artists. With the help of blockchain technology, this model provides a revolutionary change in the digital art world by providing a decentralized and artisanal environment that changes the digital creativity landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-15321"
    },
    {
        "id": 24072,
        "title": "Language augmentation approach for code-mixed text classification",
        "authors": "Gauri Takawane, Abhishek Phaltankar, Varad Patwardhan, Aryan Patil, Raviraj Joshi, Mukta S. Takalikar",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2023.100042"
    },
    {
        "id": 24073,
        "title": "Text-dependent speaker verification using discrete wavelet transform based on linear prediction coding",
        "authors": "Sina Ketabi, Saeid Rashidi, Ali Fallah",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2023.105218"
    },
    {
        "id": 24074,
        "title": "Morphology-Assisted Sindhi Text Analysis for Natural Language Processing Applications",
        "authors": "Irum Naz Sodhar,  , Abdul Hafeez Buller, Suriani Sulaiman",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i35.1719"
    },
    {
        "id": 24075,
        "title": "Deformation Robust Text Spotting with Geometric Prior",
        "authors": "Xixuan Hao, Aozhong Zhang, Xianze Meng, Bin Fu",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223185"
    },
    {
        "id": 24076,
        "title": "Personality Analysis of Entrepreneurial Text for Entrepreneurship Education",
        "authors": "Akinori Ito, Kotaro Takeda, Shuichi Ishida",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00047"
    },
    {
        "id": 24077,
        "title": "Image-to-Text Translation for Interactive Image Recognition: A Comparative User Study with Non-expert Users",
        "authors": "Wataru Kawabe, Yusuke Sugano",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2197/ipsjjip.32.358"
    },
    {
        "id": 24078,
        "title": "AUTOMATIC TEXT SUMMARIZATION AND KEYWORD EXTRACTION USING NATURAL LANGUAGE PROCESSING",
        "authors": "",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets35029"
    },
    {
        "id": 24079,
        "title": "Explaining Interactions Between Text Spans",
        "authors": "Sagnik Choudhury, Pepa Atanasova, Isabelle Augenstein",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.783"
    },
    {
        "id": 24080,
        "title": "Grad-CAM-Based Explainable Artificial Intelligence Related to Medical Text Processing",
        "authors": "Hongjian Zhang, Katsuhiko Ogasawara",
        "published": "2023-9-10",
        "citations": 4,
        "abstract": "The opacity of deep learning makes its application challenging in the medical field. Therefore, there is a need to enable explainable artificial intelligence (XAI) in the medical field to ensure that models and their results can be explained in a manner that humans can understand. This study uses a high-accuracy computer vision algorithm model to transfer learning to medical text tasks and uses the explanatory visualization method known as gradient-weighted class activation mapping (Grad-CAM) to generate heat maps to ensure that the basis for decision-making can be provided intuitively or via the model. The system comprises four modules: pre-processing, word embedding, classifier, and visualization. We used Word2Vec and BERT to compare word embeddings and use ResNet and 1Dimension convolutional neural networks (CNN) to compare classifiers. Finally, the Bi-LSTM was used to perform text classification for direct comparison. With 25 epochs, the model that used pre-trained ResNet on the formalized text presented the best performance (recall of 90.9%, precision of 91.1%, and an F1 score of 90.2% weighted). This study uses ResNet to process medical texts through Grad-CAM-based explainable artificial intelligence and obtains a high-accuracy classification effect; at the same time, through Grad-CAM visualization, it intuitively shows the words to which the model pays attention when making predictions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bioengineering10091070"
    },
    {
        "id": 24081,
        "title": "NATURAL LANGUAGE PROCESSING TECHNIQUES FOR TEXT MINING: A REVIEW STUDY",
        "authors": "",
        "published": "2023-5-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets38407"
    },
    {
        "id": 24082,
        "title": "Tamil Speech Synthesizer App for Android: Text Processing Module Enhancement",
        "authors": "A Arulprakash,  , M Synthiya, T Vijila, C Rajabhusanam",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i7.2165"
    },
    {
        "id": 24083,
        "title": "A Text Analysis Method for Student Learning Feedback on Network Teaching Platform Based on Natural Language Processing",
        "authors": "Xue-Meng Du Xue-Meng Du, Ji-Cheng Yang Xue-Meng Du",
        "published": "2024-2",
        "citations": 0,
        "abstract": "\n                        <p>With the emergence and end of the COVID-19, online learning has become an irreplaceable way of learning. In order to promote the improvement and enhancement of online curriculum resources and increase the learning effect of students, the content of curriculum evaluation is an important reference for the direction of curriculum improvement. Therefore, this article focuses on the student learning feedback of course resources. Firstly, through data collection algorithms, effective evaluation information is crawled, and then based on the collected information, the course evaluation text is annotated and classified, forming a reasonable corpus. Finally, through feature collection and sentiment analysis algorithms, sentiment analysis is performed on the evaluation content, effectively distinguishing between positive and negative evaluations, and guiding teachers to improve the course content.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/199115992024023501013"
    },
    {
        "id": 24084,
        "title": "Research on News Text Clustering for International Chinese Education",
        "authors": "Liangjie Yuan, Huizhou Zhao, Zhimin Wang",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ialp61005.2023.10337054"
    },
    {
        "id": 24085,
        "title": "EfficientSpeech: An On-Device Text to Speech Model",
        "authors": "Rowel Atienza",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094639"
    },
    {
        "id": 24086,
        "title": "Exploring graph representation strategies for text classification",
        "authors": "Henrique Varella Ehrenfried, Vinicius Tikara Venturi Date, Eduardo Todt",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09540091.2023.2289832"
    },
    {
        "id": 24087,
        "title": "MathTOUCH Editor: Rich-text Editor for Math E-learning Using an Intelligent Math Input Interface",
        "authors": "Shizuka Shirai, Takahiro Nakahara, Tetsuo Fukui",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2197/ipsjjip.31.775"
    },
    {
        "id": 24088,
        "title": "Focused Prefix Tuning for Controllable Text Generation",
        "authors": "Congda Ma, Tianyu Zhao, Makoto Shing, Kei Sawada, Manabu Okumura",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5715/jnlp.31.250"
    },
    {
        "id": 24089,
        "title": "Investopolis: Decentralized Customer Loyalty Tokenization on the Blockchain",
        "authors": "Venkata Krishna Paanchajanya Kuppa, Rajendra Hegadi, Karthik Sajjan, Karusala Deepak Chowdary, Manoj Sahit Reddy Vanga, Poonam Kumar",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444326"
    },
    {
        "id": 24090,
        "title": "Tokenization of the Common",
        "authors": "Benjamin Kraner, Nicolò Vallarano, Claudio J. Tessone",
        "published": "2023-12-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3631310.3633486"
    },
    {
        "id": 24091,
        "title": "CT-GAN: A conditional Generative Adversarial Network of transformer architecture for text-to-image",
        "authors": "Xin Zhang, Wentao Jiao, Bing Wang, Xuedong Tian",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.image.2023.116959"
    },
    {
        "id": 24092,
        "title": "Deep temporal modelling of clinical depression through social media text",
        "authors": "Nawshad Farruque, Randy Goebel, Sudhakar Sivapalan, Osmar Zaïane",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nlp.2023.100052"
    },
    {
        "id": 24093,
        "title": "STMAP: A novel semantic text matching model augmented with embedding perturbations",
        "authors": "Yanhao Wang, Baohua Zhang, Weikang Liu, Jiahao Cai, Huaping Zhang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2023.103576"
    },
    {
        "id": 24094,
        "title": "Global problem of growing economic inequality and tokenization of assets as a prospect of its solution",
        "authors": "Aleksandr Kud",
        "published": "2023",
        "citations": 2,
        "abstract": "The paper is dedicated to the discussion of tokenization of backed assets as a promising and potentially new solution to the long-standing and unresolved issue of growing economic inequality in modern society. Asset tokenization is considered as a simple and technologically realistic way to facilitate the financial availability of valuable investment assets (real estate, securities, gold, etc.), which is a modern and unexpected manifestation of blockchain technology, provided that tokens of real assets are recorded in decentralized information platforms. \nThe paper successively solves three working tasks: the problem of global wealth inequality has been described, and its solution through increasing digital financial accessibility has been presented; the essence of tokenization of assets as a new phenomenon and trend in the modern digital economy has been presented; the idea of asset tokenization due to its ability to radically increase the level of accessibility of investment assets for any strata of the population owing to a unique property of divisibility of the distributed ledger token has been explained. \nThe author uses considerable aggregated data and a review of modern foreign literature. The author concludes that asset tokenization can indeed be a new means of significantly reducing the barrier to investment for billions of people worldwide by lowering the threshold of minimum investment costs and increasing the liquidity of existing physical assets. To make this possible, regulatory compliance, regulation and storage must be addressed. Many countries and organizations have taken steps to better understand the asset tokenization and proper value. It also causes the reconfiguration of institutions and rules of operation of the market infrastructure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35774/econa2023.02.007"
    },
    {
        "id": 24095,
        "title": "A machine learning based framework to identify unseen classes in open-world text classification",
        "authors": "Jitendra Parmar, Satyendra Singh Chouhan, Vaskar Raychoudhury",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2022.103214"
    },
    {
        "id": 24096,
        "title": "Spoiler Detection as Semantic Text Matching",
        "authors": "Ryan Tran, Canwen Xu, Julian McAuley",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.373"
    },
    {
        "id": 24097,
        "title": "Neural network structure text processing method based on automatic machine learning",
        "authors": "Bowen Jing",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2670485"
    },
    {
        "id": 24098,
        "title": "Mining False Positive Examples for Text-Based Person Re-Identification",
        "authors": "Wenhao Xu, Zhiyin Shao, Changxing Ding",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222570"
    },
    {
        "id": 24099,
        "title": "BATINeT: Background-Aware Text to Image Synthesis and Manipulation Network",
        "authors": "Ryugo Morita, Zhiqiang Zhang, Jinjia Zhou",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10223174"
    },
    {
        "id": 24100,
        "title": "Text enhancement by image processing in MATLAB",
        "authors": "Amber Sahu, Sambhav Bhansali, Kushagra Sachwani, Sumit Dharmamehar, Mrinal Bachute",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2024.1028"
    },
    {
        "id": 24101,
        "title": "Identifying Main Themes in Diabetes Management Interviews Using Natural Language Processing–Based Text Mining",
        "authors": "EunSeok Cha, Seonah Lee",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "This study aimed to identify the main themes from exit interviews of adult patients with type 2 diabetes after completion of a diabetes education program. Eighteen participants with type 2 diabetes completed an exit interview regarding their program experience and satisfaction. Semistructured interview questions were used, and the interviews were auto-recorded. The interview transcripts were preprocessed and analyzed using four natural language processing–based text-mining techniques. The top 30 words from the term frequency and term frequency–inverse document frequency each were derived. In the N-gram analysis, the connection strength of “diabetes” and “education” was the highest, and the simultaneous connectivity of word chains ranged from a maximum of seven words to a minimum of two words. Based on the CONvergence of iteration CORrelation (CONCOR) analysis, three clusters were generated, and each cluster was named as follows: participation in a diabetes education program to control blood glucose, exercise, and use of digital devices. This study using text mining proposes a new and useful approach to visualize data to develop patient-centered diabetes education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/cin.0000000000001114"
    },
    {
        "id": 24102,
        "title": "Priority Queue-based Extractive Text Summarizer",
        "authors": "V. Sherlin Solomi, Ch. Keertana Sarvani, N. Supriya",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icspc57692.2023.10125761"
    },
    {
        "id": 24103,
        "title": "Automatic text simplification of Russian texts using control tokens",
        "authors": "Anna Dmitrieva",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bsnlp-1.9"
    },
    {
        "id": 24104,
        "title": "Emoji, Text, and Sentiment Polarity Detection Using Natural Language Processing",
        "authors": "Shelley Gupta, Archana Singh, Vivek Kumar",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "Virtual users generate a gigantic volume of unbalanced sentiments over various online crowd-sourcing platforms which consist of text, emojis, or a combination of both. Its accurate analysis brings profits to various industries and their services. The state-of-art detects sentiment polarity using common sense with text only. The research work proposes an emoji-based framework for cognitive–conceptual–affective computing of sentiment polarity based on the linguistic patterns of text and emojis. The proposed emoji and text-based parser articulates sentiments with proposed linguistic features along with a combination of different emojis to generate the part of speech into n-gram patterns. In this paper, the sentiments of 650 world-famous personages consisting of 1,68,548 tweets have been downloaded from across the world. The results illustrate that the proposed natural language processing framework shows that the existence of emojis in sentiments many times seems to change the overall polarity of the sentiment. By extension, the CLDR name of the emoji is utilized to evaluate the accurate polarity of emoji patterns, and a dictionary of sentiments is adopted for evaluating the polarity of text. Eventually, the performances of three ML classifiers (SVM, DT, and Naïve Bayes) are evaluated for proposed distinctive linguistic features. The robust experiments indicate that the proposed approach outperforms the SVM classifier as compared to other ML classifiers. The proposed polarity detection generator has achieved an exceptional perspective of sentiments presented in the sentence by employing the flow of concept established, based on linguistic features, polarity inversion, coordination, and discourse patterns, surpassing the performance of extant state-of-the-art approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14040222"
    }
]