[
    {
        "id": 14905,
        "title": "Mitigating Overfitting in Extreme Learning Machine Classifier Through Dropout Regularization",
        "authors": " Fateh Alrahman Kamal Qasem Alnagashi,  Norasmadi Abdul Rahim,  Shazmin Aniza Abdul Shukor,  Mohamad Hanif Ab. Hamid",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Achieving optimal machine learning model performance is often hindered by the limited availability of diverse datasets, a challenge exacerbated by small sample sizes in real-world scenarios. In this study, we address this critical issue in classification tasks by integrating the Dropout technique into the Extreme Learning Machine (ELM) classifier. Our research underscores the effectiveness of Dropout-ELM in mitigating overfitting, especially when data is scarce, leading to enhanced generalization capabilities. Through extensive experiments on synthetic and real-world datasets, our findings consistently demonstrate that Dropout-ELM outperforms traditional ELM, yielding significant accuracy improvements ranging from 0.19% to 16.20%. By strategically implementing dropout during training, we promote the development of robust models that reduce reliance on specific features or neurons, resulting in increased adaptability and resilience across diverse datasets. Ultimately, Dropout-ELM emerges as a potent tool to counter overfitting and bolster the performance of ELM-based classifiers, particularly in scenarios with limited data. Its established efficacy positions it as a valuable asset for enhancing the reliability and generalization of machine learning models, providing a robust solution to the challenges posed by constrained training data. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.58915/amci.v13ino.1.561"
    },
    {
        "id": 14906,
        "title": "A Dropout Optimization Algorithm to Prevent Overfitting in Machine Learning",
        "authors": "",
        "published": "2023-3-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/ml.2023.040103"
    },
    {
        "id": 14907,
        "title": "A Practical Significant Technic in Solving Overfitting: Regularization",
        "authors": "Muyuan Li",
        "published": "2023-5-25",
        "citations": 1,
        "abstract": "The passage mainly discusses the solution to overfitting. Overfitting usually happens when people are training their machine learning models. When a model is overfitted, it only fits one particular dataset and misses most of the data points from another dataset. This problem affects the model's performance and makes it unable to use for its purpose. So how to solve this problem with significance and practical meaning? At the beginning of the passage, I will introduce some theoretical foundations for overfitting. Then I will define the concept of overfitting and show an example of overfitting in the machine learning model. After that, I will tell you how to pick the correct model with the testing set. Then, the passage focuses on the discussion of regularization, which is a helpful technique for solving overfitting. And I will compare the L1 and l2 regularization to help you find the suitable one.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/5/20230433"
    },
    {
        "id": 14908,
        "title": "Complementary-Contradictory Feature Regularization against Multimodal Overfitting",
        "authors": "Antonio Tejero-de-Pablos",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00558"
    },
    {
        "id": 14909,
        "title": "Understanding and combating robust overfitting via input loss landscape analysis and regularization",
        "authors": "Lin Li, Michael Spratling",
        "published": "2023-4",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109229"
    },
    {
        "id": 14910,
        "title": "Mitigating robust overfitting via self-residual-calibration regularization",
        "authors": "Hong Liu, Zhun Zhong, Nicu Sebe, Shin'ichi Satoh",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.artint.2023.103877"
    },
    {
        "id": 14911,
        "title": "Lung Cancer Detection by Employing Adaptive Entropy Variance Dropout Regularization in GAN Variants",
        "authors": "E. Thirumagal, K. Saruladha",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-024-02662-2"
    },
    {
        "id": 14912,
        "title": "Macro-Block Dropout for Improved Regularization in Training End-to-End Speech Recognition Models",
        "authors": "Chanwoo Kim, Sathish Indurti, Jinhwan Park, Wonyong Sung",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/slt54892.2023.10023451"
    },
    {
        "id": 14913,
        "title": "Integrating Dropout and Kullback-Leibler Regularization in Bayesian Neural Networks for improved uncertainty estimation in Regression",
        "authors": "Raghavendra M. Devadas, Vani Hiremani",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mex.2024.102659"
    },
    {
        "id": 14914,
        "title": "Implicit Regularization of Dropout",
        "authors": "Zhongwang Zhang, Zhi-Qin John Xu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpami.2024.3357172"
    },
    {
        "id": 14915,
        "title": "A Review on Dropout Regularization Approaches for Deep Neural Networks within the Scholarly Domain",
        "authors": "Imrus Salehin, Dae-Ki Kang",
        "published": "2023-7-17",
        "citations": 10,
        "abstract": "Dropout is one of the most popular regularization methods in the scholarly domain for preventing a neural network model from overfitting in the training phase. Developing an effective dropout regularization technique that complies with the model architecture is crucial in deep learning-related tasks because various neural network architectures have been proposed, including convolutional neural networks (CNNs) and recurrent neural networks (RNNs), and they have exhibited reasonable performance in their specialized areas. In this paper, we provide a comprehensive and novel review of the state-of-the-art (SOTA) in dropout regularization. We explain various dropout methods, from standard random dropout to AutoDrop dropout (from the original to the advanced), and also discuss their performance and experimental capabilities. This paper provides a summary of the latest research on various dropout regularization techniques for achieving improved performance through “Internal Structure Changes”, “Data Augmentation”, and “Input Information”. We can see that proper regularization with respect to structural constraints of network architecture is a critical factor to facilitate overfitting avoidance. We discuss the strengths and limitations of the methods presented in this work, which can serve as valuable references for future research and the development of new approaches. We also pay attention to the scholarly domain in the discussion in order to meet the overwhelming increase of scientific research outcomes by providing an analysis of several important academic scholarly issues of neural networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12143106"
    },
    {
        "id": 14916,
        "title": "Interactions of scores derived from two groups of variables: Alternating lasso regularization avoids overfitting and finds interpretable scores.",
        "authors": "Philipp Doebler, Anna Doebler, Philip Buczak, Andreas Groll",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/met0000461"
    },
    {
        "id": 14917,
        "title": "Assessment of data augmentation, dropout with L2 Regularization and differential privacy against membership inference attacks",
        "authors": "Sana Ben Hamida, Hichem Mrabet, Faten Chaieb, Abderrazak Jemai",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17394-3"
    },
    {
        "id": 14918,
        "title": "Mothers' Views from Underprivileged Families in Preventing School Dropout Rates in Surabaya during Pandemic",
        "authors": "Arfiyan Ridwan, Asrifia Ridwan",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "During the covid-19 pandemic, mothers have essential roles in the children’s education process. The online learning system makes mothers, as teachers and parents, provide learning assistance so that children do not drop out of school. A long time before the pandemic, the Local Government of Surabaya had a mentoring program to reduce the dropout rate. However, the program was suspended indefinitely during the covid-19 pandemic. This research aimed to identify mothers' views from underprivileged families in providing learning assistance during the covid-19 pandemic, which was usually carried out by mentoring volunteers before. This research design was descriptive qualitative with data collection techniques conducted in the form of interviews and documentation. Then, the collected data were analyzed using Creswell's hierarchical linear model. The results showed that mothers experienced various difficulties assisting children without a mentoring program from the Local Government of Surabaya. Busyness as career women and the lack of education from the mothers have the potential for children to be vulnerable to dropping out of school. Heretofore, mothers' involvement in alleviating the problem of dropping out of school has received little attention from the Government. Therefore, hopefully, this research contribution can provide the required information in family-based education services improvement during an emergency due to the outbreak.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30653/001.202371.226"
    },
    {
        "id": 14919,
        "title": "Integrating Dropout Regularization Technique at Different Layers to Improve the Performance of Neural Networks",
        "authors": "B. H. Pansambal, A. B. Nandgaokar",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140478"
    },
    {
        "id": 14920,
        "title": "Mitigating Overfitting for Deep Learning-based Aging-related Bug Prediction via Brain-inspired Regularization in Spiking Neural Networks",
        "authors": "Yunzhe Tian, Yike Li, Kang Chen, Endong Tong, Wenjia Niu, Jiqiang Liu, Fangyun Qin, Zheng Zheng",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/issrew60843.2023.00076"
    },
    {
        "id": 14921,
        "title": "Towards Educational Sustainability: An AI System for Identifying and Preventing Student Dropout",
        "authors": "Erika J. Brand C, Gabriel M. Ramírez, Jaime Diaz, Fernando Moreira",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rita.2024.3381850"
    },
    {
        "id": 14922,
        "title": "The Development of Preventing and Monitoring Guidelines of Student Dropout in Schools under Samutprakan Primary Educational Service Area Office 1",
        "authors": "Phoom Praraksa",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "ABSTRACT Student dropout has been a serious problem for schools which has been becoming more serious due tothe COVID-19 situation. This study aimed to survey student dropout causes and create preventing andmonitoring guidelines for student dropout in schools under the Samutprakan Primary Educational ServiceArea Office 1, Thailand. Purposive sampling was applied for participants consisting of educationaladministrators, officers, and stakeholders in 5 schools. Descriptive statistics and content analysis wereused for data analysis. The results concluded that there were 11 causes of children dropout 1) familynecessity 2) migration 3) insufficient income 4) health problems or disabilities 5) behavior andadaptation problems, 6) impact of COVID-19, 7) the risk of wrongdoing, 8) inconvenienttransportation, 9) marriage, 10) academic performance, and 11) parents' inattention. The preventing and monitoring guidelines of student dropout involved 5 parties, namely 1) EducationalService Area Office 2) School Directors 3) Teachers and Educational personnel, 4) Family and 5)Cooperation networks. All parties should join in the following actions: 1) Raising awareness 2)Formulating an action plan 3) Implementing the plan 4) Getting to know students, and families 5)Applying digital technology 6) Organizing information systems 7) Connecting information 8) Passingon information 9) Network creation 10) Budget allocation 11) Brainstorming 12) Flexibility ofEducation and Individual Program 13) Improving guidance learning 14) Developing studentadmissions system 15) Promoting the student support system 16 ) Assessing child risks, 17) Mobilizingresources and 18) Developing a supervision system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30587/umgeshic.v2i1.5309"
    },
    {
        "id": 14923,
        "title": "Understanding and preventing nonadherence and treatment dropout in adolescents and young adults with anxiety and depressive disorders",
        "authors": "Ruth C. Waumans, Anna D. T. Muntingh, Neeltje M. Batelaan, Anton J. L. M. van Balkom",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "Dropout from psychological or pharmacological treatment for anxiety and depressive disorders is common. It is especially problematic in adolescents and young adults because of the adverse consequences for their development. Reasons for treatment dropout can be divided into therapy-process related factors, attitudinal aspects, and practical issues. Adjusting treatment to patient preferences and shared decision making, improving the therapeutic alliance, and interventions such as (family) psychoeducation, motivational interviewing, and help with practical issues are promising strategies to optimize engagement and adherence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpsyt.2023.1174285"
    },
    {
        "id": 14924,
        "title": "Overfitting in Portfolio Optimization",
        "authors": "Matteo Maggiolo, Oleg Szehr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4483959"
    },
    {
        "id": 14925,
        "title": "Preventing Loneliness and Reducing Dropout: Results from the COMPLETE Intervention Study in Upper Secondary Schools in Norway",
        "authors": "Helga Bjørnøy Urke, Torill Bogsnes Larsen, Sara Madeleine Eriksen Kristensen",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "This study examines the impact of interventions aimed at improving psychosocial health on students’ perception of a caring school climate, their feelings of loneliness, and school completion in Norwegian upper secondary education. Two intervention conditions were tested: a universal single-tier intervention focused on improving the psychosocial school climate: the Dream School Program, and a multi-tier intervention combining the Dream School Program with a targeted measure, the Mental Health Support Team. The direct and indirect effects of these interventions on school completion were analyzed using structural equation models (SEM), with data from 1508 students (mean age at Time 1: 17.02 (SD = 0.92); 60.7% girls; 72.1% Norwegian-born). The results indicated that loneliness levels did not differ significantly between the intervention conditions. However, students in the multi-tier intervention group reported a significantly higher perception of a caring school climate compared to those in the single-tier intervention group. The multi-tier intervention group had a lower rate of school completion compared to the control group and the single-tier intervention group. The SEM analysis revealed that the multi-tier intervention reduced loneliness in the second year of upper secondary school by promoting a caring school climate in the first school year. In contrast, the single-tier intervention was associated with increased loneliness due to a decrease in the perception of a caring school climate. The implications of these findings are discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ijerph20136299"
    },
    {
        "id": 14926,
        "title": "Dealing with Overfitting in the Context of Liveness Detection Using FeatherNets with RGB Images",
        "authors": "Miguel Leão, Nuno Gonçalves",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011639600003411"
    },
    {
        "id": 14927,
        "title": "Deep Patient Motion Estimation: Pretraining, Overfitting, or Pretraining and Overfitting?",
        "authors": "T. J. Herbst, J. Maier, M. Arheit, P. Paysan, M. Kachelrieß",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nssmicrtsd49126.2023.10338388"
    },
    {
        "id": 14928,
        "title": "Hyperintensionality and overfitting",
        "authors": "Francesco Berto",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "AbstractA hyperintensional epistemic logic would take the contents which can be known or believed as more fine-grained than sets of possible worlds. I consider one objection to the idea: Williamson’s Objection from Overfitting. I propose a hyperintensional account of propositions as sets of worlds enriched with topics: what those propositions, and so the attitudes having them as contents, are about. I show that the account captures the conditions under which sentences express the same content; that it can be pervasively applied in formal and mainstream epistemology; and that it is left unscathed by the objection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11229-024-04556-5"
    },
    {
        "id": 14929,
        "title": "Generalization despite overfitting in quantum machine learning models",
        "authors": "Evan Peters, Maria Schuld",
        "published": "2023-12-20",
        "citations": 3,
        "abstract": "The widespread success of deep neural networks has revealed a surprise in classical machine learning: very complex models often generalize well while simultaneously overfitting training data. This phenomenon of benign overfitting has been studied for a variety of classical models with the goal of better understanding the mechanisms behind deep learning. Characterizing the phenomenon in the context of quantum machine learning might similarly improve our understanding of the relationship between overfitting, overparameterization, and generalization. In this work, we provide a characterization of benign overfitting in quantum models. To do this, we derive the behavior of a classical interpolating Fourier features models for regression on noisy signals, and show how a class of quantum models exhibits analogous features, thereby linking the structure of quantum circuits (such as data-encoding and state preparation operations) to overparameterization and overfitting in quantum models. We intuitively explain these features according to the ability of the quantum model to interpolate noisy data with locally \"spiky\" behavior and provide a concrete demonstration example of benign overfitting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-12-20-1210"
    },
    {
        "id": 14930,
        "title": "Overfitting in portfolio optimization",
        "authors": "Matteo Maggiolo, Oleg Szehr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21314/jrmv.2023.005"
    },
    {
        "id": 14931,
        "title": "Fine-tuning is not (always) overfitting artifacts",
        "authors": "Jérémie Bogaert, Emmanuel Jean, Cyril de Bodt, François-Xavier Standaert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-152"
    },
    {
        "id": 14932,
        "title": "Exploring Robust Overfitting for Pre-trained Language Models",
        "authors": "Bin Zhu, Yanghui Rao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.340"
    },
    {
        "id": 14933,
        "title": "Less is More? Reducing Biases and Overfitting in Machine Learning Return Predictions",
        "authors": "Clint Howard",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4497739"
    },
    {
        "id": 14934,
        "title": "Why Does My Zestimate Fluctuate? Model Overfitting for Platform Ad Revenue",
        "authors": "Nikhil Malik, Runshan Fu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4403371"
    },
    {
        "id": 14935,
        "title": "A Mixed Methods Research Study on School Dropout and Mathematics-Related School Dropout",
        "authors": "Hatice Cetin, Hakan Cite",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "School dropout is a persistent problem in educational sciences, and sample research has been conducted on this issue. Research has associated school dropout with various reasons, including academic failure. The current study aims to investigate the reasons of mathematics-related school dropout, as a sub-area of academic failure. The study adopted a mixed methods research design. In the quantitative phase, 955 adults completed a questionnaire regarding their school dropout and not continuing to a further school level. The quantitative data were analyzed using SPSS 25.0 program. The descriptive statistics revealed the reasons of general school dropout as family-related reasons, academic failure, environmental conditions, personal reasons, social reasons, teacher factor, health problems, and financial reasons. The inferential statistics (the chi-square test of independence) confirmed that adults’ school dropout was not independent of mathematics failure. The qualitative data analysis program, MAXQDA 2020, was used to account for the reasons of mathematics-related middle school and high school dropout in detail. To this end, interviews were held with two participants who dropped out of middle and high school, and their statements revealed that the reasons of mathematicsrelated school dropout or not continuing to a further school level were mathematics attitude, test anxiety, mathematics anxiety, teacher’s attitude, social factors, and main shortcomings. The qualitative data were analyzed through the singlecase model and two-cases model and presented with MAXmaps. The results demonstrated that the qualitative findings explained and confirmed the quantitative findings. The study offers several recommendations for various disciplines based on the findings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59455/jomes.35"
    },
    {
        "id": 14936,
        "title": "Dropout rates and reasons for dropout among patients receiving clozapine",
        "authors": "Sandeep Grover, Eepsita Mishra, Subho Chakrabarti",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/indianjpsychiatry.indianjpsychiatry_819_22"
    },
    {
        "id": 14937,
        "title": "Overfitting to ‘predict’ suicidal ideation",
        "authors": "Timothy Verstynen, Konrad Paul Kording",
        "published": "2023-4-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41562-023-01560-6"
    },
    {
        "id": 14938,
        "title": "Hidden Dropout, Actual Dropout, and Preserving Tradition and Language among Israeli Youth of Ethiopian Origin",
        "authors": "Wovite Worko Mangasto",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "Dropping out from school is a serious problem affecting education systems. This study aims to examine the importance of preserving Ethiopian culture among Israeli high school students of Ethiopian origin and the relationship between preserving this culture and perseverance in formal schooling. Keeping ethnic tradition was examined using two indices: keeping the language and preserving tradition. Although hidden dropout is very common, the related literature is insufficient. Moreover, there are hardly any studies examining dropout among immigrant students in general, and among Israeli immigrants of Ethiopian origin in particular. This study is a pioneering investigation, in both the phenomenon being studied and the target population—the relationship between preserving culture of origin and hidden dropout and actual dropout among adolescent immigrants and children of immigrants of Ethiopian origin in Israel. The current study follows qualitative interviews with members of three research groups: learners, hidden dropouts, and disengaged. The analysis revealed a relationship between the importance assigned to preserving tradition and hidden dropout. In the measures of assigned importance to preserving tradition and language of origin, both hidden dropouts and learners assigned high importance to these variables, as opposed to the disengaged group that assigned less importance to preserving ethnic tradition.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22158/elsr.v4n5p20"
    },
    {
        "id": 14939,
        "title": "Developing a definition of early ECT dropout and exploring correlates of dropout",
        "authors": "Yassir Mahgoub, Dallas Hamlin, Andrew Francis",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.genhosppsych.2023.08.007"
    },
    {
        "id": 14940,
        "title": "Overfitting of CNN model in cifar-10: Problem and solutions",
        "authors": "Zhangjie Xia",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "CNN, proposed by Yann LeCun in the 1980s, has gained high attention and extensive research from both the academia and the industry. It has proved to be useful in a wide variety of fields, including image recognition, which aims to enable the computer to identify different objects in digital images. Despite its usefulness, problems like overfitting occur during the training process of a CNN model, which seriously harm the effectiveness of the model. Firstly, an initial CNN model is built to accomplish image recognition based on data from cifar-10. Secondly, after the presence of overfitting during the training and validation of the initial model, 4 methods, including shallower model, L2 regularization, dropout, data augmentation, are proposed to see how they handle overfitting respectively, and comparisons are made between different methods. Thirdly, the last three methods are combined to see how they handle overfitting together. Finally, conclusion and possible future work are presented. As it turns out, L2 regularization, dropout and data augmentation all reduce overfitting with some slight differences, but shallower model and the combined method cause underfitting rather than overfitting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/37/20230511"
    },
    {
        "id": 14941,
        "title": "Factors Affecting Female Student Dropout Rates in Hargeisa, Somaliland High Schools",
        "authors": "",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "Every society's economic development has been based on education. Female student abandonment, on the other hand, constitute a considerable drain and loss on a country's education budget, especially as high school possibilities are predicted to grow. This study investigated various variables that influence the dropout rate of girls from high school in Hargeisa, Somaliland. The study was directed by the following precise goals such as to examine the effects of domestic labor, to assess the influence of parents’ attitudes and to determine the influence community’s perception on girl child education in Hargeisa. The study was carried out using a descriptive research approach. The demographic being targeted included Principles, female students, educators, and parents. Purposive sampling was used to choose respondents from the designated high schools. The sample size was 68 respondents. Questionnaires were chosen as collecting data instruments. Descriptive methods of statistical analysis such as percent and frequencies were used to analyze quantitative data. The data was presented using tables and charts. According to The study results, domestic labor, parent’s attitudes, and community perceptions are resulting in a higher percentage of female high school dropouts. According to findings, 50% the respondents identified working as house helps as a reason for girls dropping out of school. Additionally, 79% of the respondents believed that parents have a responsibility in their daughter's education and dropout, while 63% of the respondents stated that their communities do not prioritize or encourage girls' education. The study suggested that it is essential for girls to have access to basic education as it is their fundamental right as stated in the Somaliland constitution. Additionally, the study recommended conducting further research in secondary schools to identify other challenges that girls face and find effective strategies to help them stay in school and continue their education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/crvv.02.03.02"
    },
    {
        "id": 14942,
        "title": "Limited Discriminator GAN using explainable AI model for overfitting problem",
        "authors": "Jiha Kim, Hyunhee Park",
        "published": "2023-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.icte.2021.12.014"
    },
    {
        "id": 14943,
        "title": "A Chaotic Neuron and its Ability to Prevent Overfitting",
        "authors": "Xiu Chen, Yi Wang",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "Chaotic neuron is a neural model based on chaos theory, which combines the complex dynamic behavior of biological neurons with the characteristics of chaotic systems. Inspired by the chaotic firing characteristics of biological neurons, a novel chaotic neuron model and its response activation function LMCU are proposed in this paper. Based on one-dimensional chaotic mapping, this chaotic neuron model takes the emissivity of chaotic firing characteristics of biological neurons as its response output, so that it has the nonlinear response and chaotic characteristics of biological neurons. Different from the traditional neuron model, it makes full use of the nonlinear dynamics of the chaotic system to achieve the activation output. In this paper, we apply the proposed chaotic neurons to artificial neural networks by using LeNet-5 models on MNIST and CIFAR-10 datasets, and compare them with common activation functions. The application of chaotic neurons can effectively reduce the overfitting phenomenon of artificial neural network, significantly reduce the generalization error of the model, and greatly improve the overall performance of artificial neural network. The innovative design of this chaotic neuron model provides a new cornerstone for the future development of artificial neural networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v5i1.11673"
    },
    {
        "id": 14944,
        "title": "Overfitting Identification in Machine Learning Models with the Person-Fit Indicator",
        "authors": "Ruihang He, Yongze Xu",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icceic60201.2023.10426639"
    },
    {
        "id": 14945,
        "title": "Do Neural Topic Models Really Need Dropout? Analysis of the Effect of Dropout in Topic Modeling",
        "authors": "Suman Adhya, Avishek Lahiri, Debarshi Kumar Sanyal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.162"
    },
    {
        "id": 14946,
        "title": "Medical volume segmentation by overfitting sparsely annotated data",
        "authors": "Tristan Payer, Faraz Nizamani, Meinrad Beer, Michael Götz, Timo Ropinski",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.4.044007"
    },
    {
        "id": 14947,
        "title": "THE EFFECT OF DROPOUT PREVENTION PROGRAM OF 9th GRADE RETENTIONS STUDENTS  ON DROPOUT RISK, SELF-EFFICACY BELIEF AND LEARNING MOTIVATION STRATEGIES",
        "authors": "Gülşah Ertekin, Ayşe Esra İşmen Gazioğlu",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "High school dropout is a common problem in many countries and governments are trying to solve this problem for years. School counsellors can play an important role in dropout prevention by implementing school-based interventions. The aim of this study is to examine the effect of the Social-Cognitive Learning theory-based dropout prevention program which is applied to 9th grade retention students of the Anatolian and vocational high school students who were at risk for dropout. The dropout prevention program was aimed at reducing dropout risk, enhancing self-efficacy belief, and learning motivation strategies of students. The program was implemented in 11 sessions for the experimental students. For the data analysis, ‘ANOVA’ for the repeated measures and ‘Bonferroni test were used to evaluate the effect of the program on students. The result of the study showed that the dropout prevention program is effective in reducing participants’ dropout risk, enhancing learning motivation strategies, and moderating self-efficacy beliefs. In conclusion, it can be said that Social-Cognitive Learning theory-based psychoeducation program is effective to reduce the dropout risk at high schools.<p> </p><p><strong> Article visualizations:</strong></p><p><img src=\"/-counters-/soc/0747/a.php\" alt=\"Hit counter\" /></p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.46827/ejes.v10i9.4972"
    },
    {
        "id": 14948,
        "title": "Regularization operators versus regularization strategies",
        "authors": "Thi-An Nguyen, Chun-Kong Law",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nIn this note, we shall compare two important concepts of “regularization operators” and “regularization strategies” that appear in different classical monographs. The definition of a regularization operator is related to the Moore–Penrose inverse of the operator. In general, a regularization operator is a regularization strategy. We shall show that the converse is also true under some conditions. It is interesting to note that these two systems share analogous properties.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jiip-2022-0073"
    },
    {
        "id": 14949,
        "title": "Overcoming Overfitting Challenges with HOG Feature Extraction and XGBoost-Based Classification for Concrete Crack Monitoring",
        "authors": "Ida Barkiah, Yuslena Sari",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/ijet.2023.146509"
    },
    {
        "id": 14950,
        "title": "Distanz- und Wechselunterricht als Katalysator für schulischen Dropout? Erfahrungen und Wahrnehmungen von Schulleitungen zur Entwicklung und Bearbeitung von Dropout",
        "authors": "Ricarda Rübben, Raphaela Porsch, Melanie Baumgarten, Robert W. Jahn",
        "published": "2023-12",
        "citations": 0,
        "abstract": "Das Phänomen, dass Schüler*innen die Schule ohne Schulabschluss verlassen, ist von bildungspolitischer Brisanz. Untersuchungen zum Wechsel- und Distanzunterricht rücken (erneut) Schüler*innen in sozio-ökonomisch deprivierter Lage in den Fokus, vernachlässigen aber mögliche Auswirkungen auf deren Dropoutrisiken. Der Beitrag stellt Befunde zu Wahrnehmungen und Erfahrungen von Schulleitungen zur Entwicklung von Dropout sowie zu auf Einzelschulebene getroffenen präventiven und interventiven Maßnahmen vor.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31244/dds.2023.04.06"
    },
    {
        "id": 14951,
        "title": "Empirical Study of Overfitting in Deep Learning for Predicting Breast Cancer Metastasis",
        "authors": "Chuhan Xu, Pablo Coen-Pirani, Xia Jiang",
        "published": "2023-3-25",
        "citations": 4,
        "abstract": "Overfitting may affect the accuracy of predicting future data because of weakened generalization. In this research, we used an electronic health records (EHR) dataset concerning breast cancer metastasis to study the overfitting of deep feedforward neural networks (FNNs) prediction models. We studied how each hyperparameter and some of the interesting pairs of hyperparameters were interacting to influence the model performance and overfitting. The 11 hyperparameters we studied were activate function, weight initializer, number of hidden layers, learning rate, momentum, decay, dropout rate, batch size, epochs, L1, and L2. Our results show that most of the single hyperparameters are either negatively or positively corrected with model prediction performance and overfitting. In particular, we found that overfitting overall tends to negatively correlate with learning rate, decay, batch size, and L2, but tends to positively correlate with momentum, epochs, and L1. According to our results, learning rate, decay, and batch size may have a more significant impact on both overfitting and prediction performance than most of the other hyperparameters, including L1, L2, and dropout rate, which were designed for minimizing overfitting. We also find some interesting interacting pairs of hyperparameters such as learning rate and momentum, learning rate and decay, and batch size and epochs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/cancers15071969"
    },
    {
        "id": 14952,
        "title": "Study of Overfitting by Machine Learning Methods Using Generalization Equations",
        "authors": "Nageswara S. V. Rao",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/fusion52260.2023.10224198"
    },
    {
        "id": 14953,
        "title": "Regularized CNN Based Model for Analyzing, Predicting Depression and Handling Overfitting",
        "authors": "Purude Vaishali Narayanrao, P. Lalitha Surya Kumari",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/isi.280129"
    },
    {
        "id": 14954,
        "title": "Rethinking Overfitting of Multiple Instance Learning for Whole Slide Image Classification",
        "authors": "Hongjian Song, Jie Tang, Hongzhao Xiao, Juncheng Hu",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icme55011.2023.00100"
    },
    {
        "id": 14955,
        "title": "Optimizing Vehicle Classification using YOLOv8: Strategies to Counter Overfitting",
        "authors": "Anjali Jha, Ishita Saxena, Karuna Kadian,  Indu, Vaibhav Sharma, Shivani Singh",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aece59614.2023.10428452"
    },
    {
        "id": 14956,
        "title": "Reducing Overfitting In Deep Neural Networks By Intra-class Decorrelation",
        "authors": "Tian Liu, Chenguang Zhang, Danmeng Li",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scset58950.2023.00052"
    },
    {
        "id": 14957,
        "title": "Distress tolerance, anxiety-related symptoms, stress, and depression among dropout and non-dropout university students: a mediation analysis",
        "authors": " Qasir Abbas, Iqra Latif, Mehwish Muneer, Muhammad Umar Khan, Khawer Bilal Baig",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "This study explores the relationship between distress tolerance and depression with mediating role of anxiety-related symptoms and stress among dropout and non-dropout university students. This cross-sectional study was conducted from October 2019 to December 2020. Participants' age ranged between 20-40 years. Data was collected using the Distress Tolerance Scale and Depression Anxiety and Stress Scale. Descriptive, t-test, and mediation analyses were performed to calculate the results. A sample of 500 respondents was recruited. A significant difference was noted between dropout and non-dropout students on CGPA (p<.001), depression (p<.001), anxiety (p<.001), stress (p<.001), tolerance (p<.001), absorption (p<.001), appraisal (p<.001), and distress tolerance (p<.001). Mediation analysis reveals that stress and anxiety significantly mediates between distress tolerance and depressive symptoms (i.e., F (498) = 31.14, p< .001; F (498) =34.14, p< .001; F (496) = 161.21, p< .001). It is concluded that low distress tolerance increases stress and anxiety, triggering depressive symptoms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47391/jpma.6557"
    },
    {
        "id": 14958,
        "title": "Data Cleansing &amp; Overfitting Check for Interpretable ML in Concrete Design – a punching shear paradigm",
        "authors": "Nikolaos Mellios, Panagiotis Spyrdis",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractEvaluation of shear capacity is crucial for existing concrete buildings and bridges. Shear failure can cause an abrupt and brittle loss of load‐carrying capacity, leading to load redistribution and progressive collapse. An internationally research and scietific discourse is actively ongoing on the best prediction model for shear, torsion, and punching shear capacity, with no clear consensus. A machine learning‐based strength model is suggested for accurate prediction of punching shear capacity, using Gaussian Process Regression and Support Vector Regression models. Data elaboration and thorough evaluation are needed to enhance the model's performance and interpretability. The paper discusses critical methodological steps based on the authors' experience of developing ML‐models for structural concrete design against punching shear failure using 544 full‐scale tests.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cepa.2057"
    },
    {
        "id": 14959,
        "title": "ZeroGrad: Costless conscious remedies for catastrophic overfitting in the FGSM adversarial training",
        "authors": "Zeinab Golgooni, Mehrdad Saberi, Masih Eskandar, Mohammad Hossein Rohban",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2023.200258"
    },
    {
        "id": 14960,
        "title": "Detecting Overfitting of Machine Learning Techniques for Automatic Vulnerability Detection",
        "authors": "Niklas Risse",
        "published": "2023-11-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3611643.3617845"
    },
    {
        "id": 14961,
        "title": "Why matrix-decomposition of overlapped light spectroscopic features leads to overfitting in certain cases ?",
        "authors": "Dušan Kojić, Masato Yasui",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chemolab.2023.104859"
    },
    {
        "id": 14962,
        "title": "Evaluation of IDS model by improving accuracy and reducing overfitting using stacking LSTM",
        "authors": "Muhammad Bisri Musthafa, Samsul Huda, Md. Arshad Ali, Yuta Kodera, Yasuyuki Nogami",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce59016.2024.10444231"
    },
    {
        "id": 14963,
        "title": "Preference-Choice Mismatch and University Dropout",
        "authors": "Didier Fouarge, Pascal Heß",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4471348"
    },
    {
        "id": 14964,
        "title": "Enhanced Robust Univariate Classification Methods for Solving Outliers and Overfitting Problems",
        "authors": "Friday Zinzendoff Okwonu, Nor Aishah Ahad, Hashibah Hamid, Nora Muda, Olimjon Shukurovich Sharipov",
        "published": "2023",
        "citations": 0,
        "abstract": "The robustness of some classical univariate classifiers is hampered if the data are contaminated. Overfitting is another hiccup when the data sets are uncontaminated with a considerable sample size. The performance of the classification models can be easily biased by the outliers’ problems, of which the constructed model tends to be overfitted. Previous studies often used the Bayes Classifier (BC) and the Predictive Classifier (PC) to address two groups of univariate classification problems. Unfortunately for substantial large sample sizes and uncontaminated data, the BC method overfits when the Optimal Probability of Exact Classification (OPEC) is used as an evaluation benchmark. Meanwhile, for small sample sizes, the BC and PC methods are extremely susceptible to outliers. To overcome these two problems, we proposed two methods: the Smart Univariate Classifier (SUC) and the hybrid classifier. The latter is a combination of the SUC and the BC methods, known as the Smart Univariate Bayes Classifier (SUBC). The performance of the new classification methods was evaluated and compared with the conventional BC and PC methods using the OPEC as a benchmark value. To validate the performance of these classification methods, the Probability of Exact Classification (PEC) was compared with the OPEC value. The results showed that the proposed methods outperformed the conventional BC and PC methods based on the real data sets applied. Numerical results also revealed that the SUC method could solve the overfitting problem. The results further indicated that the two proposed methods were robust against outliers. Therefore, these new methods are helpful when practitioners are confronted with overfitting and data contamination problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32890/jict2023.22.1.1"
    },
    {
        "id": 14965,
        "title": "Numerical performance of penalized comparison to overfitting for multivariate kernel density estimation",
        "authors": "Suzanne Varet, Claire Lacour, Pascal Massart, Vincent Rivoirard",
        "published": "2023",
        "citations": 2,
        "abstract": "Kernel density estimation is a well known method involving a smoothing parameter (the bandwidth) that needs to be tuned by the user. Although this method has been widely used, the bandwidth selection remains a challenging issue in terms of balancing algorithmic performance and statistical relevance. The purpose of this paper is to study a recently developed bandwidth selection method, called Penalized Comparison to Overfitting (PCO). We first provide new theoretical guarantees by proving that PCO performed with non-diagonal bandwidth matrices is optimal in the oracle and minimax approaches. PCO is then compared to other usual bandwidth selection methods (at least those which are implemented in the R-package) for univariate and also multivariate kernel density estimation on the basis of intensive simulation studies. In particular, cross-validation and plug-in criteria are numerically investigated and compared to PCO. The take home message is that PCO can outperform the classical methods without algorithmic additional cost.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/ps/2022018"
    },
    {
        "id": 14966,
        "title": "Predictive overfitting in immunological applications: Pitfalls and solutions",
        "authors": "Jeremy P. Gygi, Steven H. Kleinstein, Leying Guan",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/21645515.2023.2251830"
    },
    {
        "id": 14967,
        "title": "Effect of District Caste Fragmentation on School Dropout",
        "authors": "Soumik Ghosh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4347743"
    },
    {
        "id": 14968,
        "title": "Generative adversarial network based on Poincaré distance similarity constraint: Focusing on overfitting problem caused by finite training data",
        "authors": "Jian Wei, Qinzhao Wang, Zixu Zhao",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.111147"
    },
    {
        "id": 14969,
        "title": "A Systematic Analysis of Text Classification Overfitting Recommendation Methods",
        "authors": "Vidya Sagar S. D., Waqas Ali, Lokhande Gaurav, Sakinam Sindhuja, M Bhavsingh",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22362/ijcert/2023/v10/i04/v10i0408"
    },
    {
        "id": 14970,
        "title": "Artificial Intelligence-enhanced Electrocardiogram for Atrial Fibrillation in Embolic Stroke With Undetermined Source: Heroic Detective or Overfitting Alarm?",
        "authors": "Yong-Soo Baek",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4070/kcj.2023.0231"
    },
    {
        "id": 14971,
        "title": "A comparison of machine learning and statistical species distribution models: Quantifying overfitting supports model interpretation",
        "authors": "Emma Chollet Ramampiandra, Andreas Scheidegger, Jonas Wydler, Nele Schuwirth",
        "published": "2023-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecolmodel.2023.110353"
    },
    {
        "id": 14972,
        "title": "Counting the Costs: The Economic and Social Impact of School Dropout in Madagascar",
        "authors": "Lira Malalaniony Razafijaona, Zo Andrianina Fanantenana Raherimandimby, Rafalimanana Victor",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr23929222907"
    },
    {
        "id": 14973,
        "title": "Prediction of Colon Cancer Disease with the Handling of Outliers and Overfitting through Neural Network Clustering and Optimal Tuning",
        "authors": "Christopher Francis Britto",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10466107"
    },
    {
        "id": 14974,
        "title": "Measuring Self–Serving Cognitive Distortions in School Dropout Adolescents (Boys)",
        "authors": "Mohanapriya K,  ",
        "published": "2023-2-6",
        "citations": 0,
        "abstract": "Adolescence is an important period in the life span which includes physical, and psychological changes. These changes can be difficult for an adolescent to adjust which can lead to different adversities. Sometimes overcoming such adversities can be problematic and leads to cognitive distortions known as biased thinking. Aim: the study aims to measure self-serving cognitive distortions in school drop -out boys. Sample: The sample size is n-40, and the samples were collected from various places in Madurai District, Tamil Nadu using the Purposive sampling method. Materials: informed consent form, socio-demographic variables, and the How I think questionnaire ( Barriga, et al, 2001). Results: From the results, it was found that the scoring for the dimensions Self-centered, blaming others, minimizing/mislabeling, assuming the worst, oppositional defiance, physical aggression, lying, and stealing fall under the clinical category which means there exists externalizing psychopathology. The study shows that the samples tend to engage in deviant behavior like aggression, violent behaviors, stealing, substance use, and criminal behavior",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijmra/v6-i2-05"
    },
    {
        "id": 14975,
        "title": "Effects of School Dropout on Surrounding Communities: A Case of Secondary School Students in Mvomero District",
        "authors": "Sharifa Sued",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231005174550"
    },
    {
        "id": 14976,
        "title": "Artificial Intelligence Algorithms to Predict College Students’ Dropout: A Systematic Mapping Study",
        "authors": "Henrique Rodrigues, Eduardo Santiago, Gabriel Wanderley, Laura Moraes, Carlos Mello, Reinaldo Alvares, Rodrigo Santos",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012348000003636"
    },
    {
        "id": 14977,
        "title": "Identifying Risk Factors for Student Dropout in Higher Education Using Large-Scale Administrative Data",
        "authors": "Marina Pumptow",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2012181"
    },
    {
        "id": 14978,
        "title": "Learning sparse features can lead to overfitting in neural networks\n                  <sup>*</sup>",
        "authors": "Leonardo Petrini, Francesco Cagnetta, Eric Vanden-Eijnden, Matthieu Wyart",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nIt is widely believed that the success of deep networks lies in their ability to learn a meaningful representation of the features of the data. Yet, understanding when and how this feature learning improves performance remains a challenge. For example, it is beneficial for modern architectures to be trained to classify images, whereas it is detrimental for fully-connected networks to be trained on the same data. Here, we propose an explanation for this puzzle, by showing that feature learning can perform worse than lazy training (via the random feature kernel or the neural tangent kernel) as the former can lead to a sparser neural representation. Although sparsity is known to be essential for learning anisotropic data, it is detrimental when the target function is constant or smooth along certain directions of the input space. We illustrate this phenomenon in two settings: (i) regression of Gaussian random functions on the d-dimensional unit sphere and (ii) classification of benchmark data sets of images. For (i), we compute the scaling of the generalization error with the number of training points and show that methods that do not learn features generalize better, even when the dimension of the input space is large. For (ii), we show empirically that learning features can indeed lead to sparse and thereby less smooth representations of the image predictors. This fact is plausibly responsible for deteriorating the performance, which is known to be correlated with smoothness along diffeomorphisms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-5468/ad01b9"
    },
    {
        "id": 14979,
        "title": "DEEP LEARNING ENCODED ECG - AVOIDING OVERFITTING IN ECG MACHINE LEARNING",
        "authors": "Christopher Harvey, Amit Noheria",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0735-1097(24)02162-4"
    },
    {
        "id": 14980,
        "title": "Hybrid Machine Learning-Based Approaches for Feature and Overfitting Reduction to Model Intrusion Patterns",
        "authors": "Fatemeh Ahmadi Abkenari, Amin Milani Fard, Sara Khanchi",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "An intrusion detection system (IDS), whether as a device or software-based agent, plays a significant role in networks and systems security by continuously monitoring traffic behaviour to detect malicious activities. The literature includes IDSs that leverage models trained to detect known attack behaviours. However, such models suffer from low accuracy or high overfitting. This work aims to enhance the performance of the IDS by making a model based on the observed traffic via applying different single and ensemble classifiers and lowering the classifier’s overfitting on a reduced set of features. We implement various feature reduction techniques, including Linear Regression, LASSO, Random Forest, Boruta, and autoencoders on the CSE-CIC-IDS2018 dataset to provide a training set for classifiers, including Decision Tree, Naïve Bayes, neural networks, Random Forest, and XGBoost. Our experiments show that the Decision Tree classifier on autoencoders-based reduced sets of features yields the lowest overfitting among other combinations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jcp3030026"
    },
    {
        "id": 14981,
        "title": "Reduction of overfitting on the highly imbalanced ISIC-2019 skin dataset using deep learning frameworks",
        "authors": "Erapaneni Gayatri, S.L. Aarthy",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "BACKGROUND: With the rapid growth of Deep Neural Networks (DNN) and Computer-Aided Diagnosis (CAD), more significant works have been analysed for cancer related diseases. Skin cancer is the most hazardous type of cancer that cannot be diagnosed in the early stages. OBJECTIVE: The diagnosis of skin cancer is becoming a challenge to dermatologists as an abnormal lesion looks like an ordinary nevus at the initial stages. Therefore, early identification of lesions (origin of skin cancer) is essential and helpful for treating skin cancer patients effectively. The enormous development of automated skin cancer diagnosis systems significantly supports dermatologists. METHODS: This paper performs a classification of skin cancer by utilising various deep-learning frameworks after resolving the class Imbalance problem in the ISIC-2019 dataset. A fine-tuned ResNet-50 model is used to evaluate the performance of original data, augmented data, and after by adding the focal loss. Focal loss is the best technique to solve overfitting problems by assigning weights to hard misclassified images. RESULTS: Finally, augmented data with focal loss is given a good classification performance with 98.85% accuracy, 95.52% precision, and 95.93% recall. Matthews Correlation coefficient (MCC) is the best metric to evaluate the quality of multi-class images. It has given outstanding performance by using augmented data and focal loss.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/xst-230204"
    },
    {
        "id": 14982,
        "title": "Girls Dropout in Education: A Study",
        "authors": "Dr G Rajitha -",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "Education is the process of facilitating learning, or the acquisition of knowledge, skills, values, beliefs, and habits. It is the process of imparting powers of reasoning, judgment, and generally of preparing oneself intellectually. Education gives us knowledge of the world around us; it is needed for development and improvement of a nation. It empowers people and strengthens the nation; it also ensures gender equality. Education has he key to creating, applying, and spreading knowledge thereby ensuring the development of dynamic or competitive economies.\nGirl child education helps women to take advantage of opportunities that could benefit them and their families, preparing them for the labour force and helping them understanding their legal rights as well as their reproductive rights. Basic education provides the \nGirl-child with an understanding of basic health, nutrition, and family planning, giving their choices and the power to decide over their own lives and bodies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i02.2467"
    },
    {
        "id": 14983,
        "title": "DROPOUT AT UTAD: EVOLUTION AND MECHANISMS OF SUPPORT",
        "authors": "Tatiana Ferreira, José Paulo Cravino",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/edulearn.2023.1189"
    },
    {
        "id": 14984,
        "title": "Right to Education and School Dropout of Children and Young People During the Pandemic",
        "authors": "Maria Ruiz Munoz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2010086"
    },
    {
        "id": 14985,
        "title": "Untangling the web of waitlist dropout in HCC",
        "authors": "Laura Kulik",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/lvt.0000000000000195"
    },
    {
        "id": 14986,
        "title": "Exploring Ways to Minimize Dropout Voltage for Energy-Efficient Low-Dropout Regulators: Viable approaches that preserve performance",
        "authors": "Hyun-Sik Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mssc.2023.3262767"
    },
    {
        "id": 14987,
        "title": "Mapping the Dropout Phenomenon for the New Digital Context",
        "authors": "Berrin Sari, Olaf Zawacki-Richter",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "Open, distance, and digital education (ODDE) has a long history concerning dropout. With the new reality of the digital age, the terminologies and concepts that have been long adopted are inevitably subject to change. To understand dropout in the digital transformation, it is important to take an evidence-based approach and examine the literature. Therefore, this study applies the steps of a systematic literature review to retrieve relevant articles on dropout since 2010 and conducts a content analysis via text mining. The results indicate that student dropout and retention declined in publication during the pandemic despite remaining one of the critical issues in higher education. The main concepts indicate that most of the dropout studies focus on comparisons between face-to-face and online modalities; the learning environment and engagement; and support and motivation. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5334/uproc.121"
    },
    {
        "id": 14988,
        "title": "Overfitting NN loop-filters in video coding",
        "authors": "Ruiying Yang, Maria Santamaria, Francesco Cricri, Honglei Zhang, Jani Lainema, Ramin G. Youvalari, Miska M. Hannuksela, Tapio Elomaa",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vcip59821.2023.10402710"
    },
    {
        "id": 14989,
        "title": "Revisiting Intermediate Layer Distillation for Compressing Language Models: An Overfitting Perspective",
        "authors": "Jongwoo Ko, Seungjoon Park, Minchan Jeong, Sukjin Hong, Euijai Ahn, Du-Seong Chang, Se-Young Yun",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.12"
    },
    {
        "id": 14990,
        "title": "Backtest Overfitting in the Machine Learning Era: A Comparison of Out-of-Sample Testing Methods in a Synthetic Controlled Environment",
        "authors": "Hamid R. Arian, Daniel Norouzi Mobarekeh, Luis A. Seco",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4686376"
    },
    {
        "id": 14991,
        "title": "ANALISA TERJADINYA OVERFITTING DAN UNDERFITTING PADA ALGORITMA NAIVE BAYES DAN DECISION TREE DENGAN TEKNIK CROSS VALIDATION",
        "authors": "Wildan Attariq Firmansyach, Umi Hayati, Yudhistira Arie Wijaya",
        "published": "2023-2-26",
        "citations": 0,
        "abstract": "Perkembangan digital dapat meringankan aktivitas manusia dalam menggunakan, serta mengelola informasi. Suatu informasi berdasarkan kumpulan data dengan dilakukannya proses data mining. Banyak masalah yang terjadi pada data mining dikarenakan hasil yang diperoleh dipengaruhi oleh adanya ketidak seimbangan data sehingga terjadinya overfitting dan underfitting biasanya disebabkan oleh data yang berlebihan atau data yang kurang sehingga model yang dihasilkan tidak dapat menangkap pola dari data yang digunakan. Tujuan dari penelitian ini mendapatkan hasil akurasi terbaik melalui perbandingan yang diperoleh supaya tidak terjadinya overfitting dan underfitting dalam hasil akurasi, untuk mengimplementasikan hasil akurasi darimachine learning meningkatkan kepastian dan menunjukan hasil keputusan, menggunakan data sampel Status Kelulusan Siswa SMA Jurusan IPA Jalur SNMPTN Di Indonesia yang dihimpun dari periode tahun 2022, data berjumlah 4.030 data dan 10 atribut. Metode yang digunakan untuk mendapatkan hasil evaluasi terbaik menggunakan algoritma Naïve Bayes dan Decision Tree dengan teknik Cross Validation. Hasil dari penelitian ini yaitu algoritma Naive Bayes mendapatkan skor akurasi sebesar 63%, serta algoritma Decision Tree mendapatkan skor akurasi sebesar 96%, dengan hasil skor akurasi yang diperoleh algoritma terbaik yaitu Decision Tree dengan menggunakan teknikValidasi silang.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i1.6329"
    },
    {
        "id": 14992,
        "title": "Hybrid Random Forest and Long Short-Term Memory to Mitigate Overfitting Issue in Time Series Stock Data",
        "authors": "Tran Kim Toai, Vo Thi Xuan Hanh, Vo Minh Huan",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsse58758.2023.10227248"
    },
    {
        "id": 14993,
        "title": "Recovery college dropout: A qualitative study of external, relational and course‐related dropout drivers in co‐produced mental health care",
        "authors": "Ditte Andersen, Anna Kristine Waldemar, Sine Kirkegaard",
        "published": "2023-10",
        "citations": 2,
        "abstract": "AbstractRecovery colleges (RCs) are rapidly spreading across Western countries, and research indicates beneficial outcomes of this co‐produced model of mental health care. Meanwhile, risks of adverse outcomes and RC dropout remain understudied. To address this research gap, we conducted qualitative interviews with 14 participants who dropped out of RC courses in Denmark. This article, adhering to the consolidated criteria for reporting qualitative research (COREQ), presents a typology of the main dropout drivers identified in our sample: external, relational and course‐related. External drivers involve practical obstacles, for example some participants feared taking public transportation and lacked access to alternative means of travelling to the courses. Relational drivers entail distressing interactions with educators or peer students, for example some participants felt stigmatized or intimidated. Course‐related drivers concern the content of the courses, for example some students considered the academic level too basic as their design did not take prior learning into account, while others experienced a sense of alienation because they were unable or unwilling to share the kind of personal experiences course assignments envisaged. In the discussion of our findings, we consider how different types of drivers call for different modes of responses. We discuss dilemmas related to the proposed responses for reducing or accepting RC dropout.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/inm.13173"
    },
    {
        "id": 14994,
        "title": "A Machine Learning Framework to Predict College Readiness Using Early Dropout",
        "authors": "Yiwang Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2019393"
    },
    {
        "id": 14995,
        "title": "Reducing school dropout rates: an analysis from the perspective of educational management",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37956/jbes.v7i1.322"
    },
    {
        "id": 14996,
        "title": "Predicting Dropout in Programming MOOCs through Demographic Insights",
        "authors": "Jakub Swacha, Karolina Muszyńska",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "Massive Open Online Courses (MOOCs) have gained widespread popularity for their potential to offer education to an unlimited global audience. However, they also face a critical challenge in the form of high dropout rates. This paper addresses the need to identify students at risk of dropping out early in MOOCs, enabling course organizers to provide targeted support or adapt the course content to meet students’ expectations. In this context, zero-time dropout predictors, which utilize demographic data before the course commences, hold significant potential. Despite a lack of consensus in the existing literature regarding the efficacy of demographic data in dropout prediction, this study delves into this issue to contribute new insights to the ongoing discourse. Through an extensive review of prior research and a detailed analysis of data acquired from two programming MOOCs, we aim to shed light on the relationship between students’ demographic characteristics and their likelihood of early dropout from MOOCs, using logistic regression. This research extends the current understanding of the impact of demographic features on student retention. The results indicate that age, education level, student status, nationality, and disability can be used as predictors of dropout rate, though not in every course. The findings presented here are expected to affect the development of more effective strategies for reducing MOOC dropout rates, ultimately enhancing the educational experience for online learners.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12224674"
    },
    {
        "id": 14997,
        "title": "A Review of the Overfitting Problem in Convolution Neural Network and Remedy Approaches",
        "authors": "Hiba Kahdum Dishar, Lamia AbedNoor Muhammed",
        "published": "2023-9-24",
        "citations": 1,
        "abstract": "Deep learning methods have attracted much attention over the past few years after their breakthroughs in speech recognition and computer vision. However, Convolution Neural Network (CNN) is one of the most important networks that have been used especially in image classification, these networks are facing an essential problem which is the “overfitting problem”. This problem means that the difficulty implies that the model would just \"memorize\" previously observed patterns, rather than “learn” the important patterns. As a result, it will down the classification performance and become a huge problem. Different remedy approaches have been suggested, each one can exhibit different behavior in the reduction of the overfitting problem according to the nature of the training data. So, this variety of remedy approaches needs to be examined. This paper would be focused on the factors that can cause the overfitting problem, then continue into the approaches to solving this problem.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29304/jqcm.2023.15.2.1240"
    },
    {
        "id": 14998,
        "title": "An algorithm to combat school dropout in Argentina",
        "authors": " ",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18356/22202293-2023-4-8"
    },
    {
        "id": 14999,
        "title": "Dropout of Young Teachers from the Education System: Motivations, Risk Factors and Possible Solutions",
        "authors": "Nitza Hachmon,  , Krasimira Marulevska Marulevska,  ",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "Abstract: This article discusses social, pedagogical, and managerial aspects of young teachers’ integration into the education system with a research focus on the issue of “young teachers dropping out” of the school system in the first years of their careers. This article further analyses the motives and risk factors which influence the process of teachers’ integration into the school environment. Possible solutions are sought to mitigate the risk of teachers permanently leaving the educational system. The need for developing a comprehensive system to support the successful professional adaptation and development of novice teachers - from their academic preparation and teaching practice, to their active period of professional consolidation and career development - is outlined. This article is based on up-to-date data of the implications of the issue within the education system of Israel. A mixed methods approach, combining quantitative and qualitative research approaches, is used for the purpose of this research. The quantitative data aim to provide a macro-level picture of the process of attrition in the teaching profession in terms of teacher and educational institution characteristics. The qualitative part of the research includes an analysis of a number of documents on the policy of the Ministry of Education of Israel on teachers leaving the profession.   Keywords: Teacher preparation and qualification; Teacher's career development; Adaptation of novice teachers, Teacher-mentor, Mentor.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55206/iulw6982"
    },
    {
        "id": 15000,
        "title": "Investigating Catastrophic Overfitting in Fast Adversarial Training: A Self-fitting Perspective",
        "authors": "Zhengbao He, Tao Li, Sizhe Chen, Xiaolin Huang",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00227"
    },
    {
        "id": 15001,
        "title": "DC Neural Networks avoid overfitting in one-dimensional nonlinear regression",
        "authors": "Cesar Beltran-Royo, Laura Llopis-Ibor, Juan J. Pantrigo, Iván Ramírez",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.111154"
    },
    {
        "id": 15002,
        "title": "Preference-choice mismatch and university dropout",
        "authors": "Didier Fouarge, Pascal Heß",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.labeco.2023.102405"
    },
    {
        "id": 15003,
        "title": "A Novel Ensemble Based Reduced Overfitting Model with Convolutional Neural Network for Traffic Sign Recognition System",
        "authors": "Anantha Babu Shanmugavel, Vijayan Ellappan, Anand Mahendran, Murali Subramanian, Ramanathan Lakshmanan, Manuel Mazzara",
        "published": "2023-2-12",
        "citations": 4,
        "abstract": "The ELVD (Ensemble-based Lenet VGGNet and DropoutNet) model is used in this paper to examine hypothetical principles and theoretical identification of a real-time image classification and object, tracking, and recognition device running on board a vehicle. Initially, we obtained the dataset from Kaggle. After loading the images, they were converted into 4D tensors and then into a grid. The model has to set the training to 70% training and 30% testing. The ELVD model uses 39,209 32 × 32-pixel color images for preparation, and 12,630 images specifically for research, in the GTSD (German Traffic Sign Detection) dataset. Each picture is a photograph of a traffic sign that corresponds to one of the 43 classes. The picture is a 32 × 32 × 3 sequence of pixel quality values in the RGB color region, defined as pixel values. The image’s class is hidden as a numerical value from 0 to 42. The image collection is somewhat unbalanced, and a few classes are represented significantly better than in the alternative model. The contrast and brightness of the images also differ significantly. The proposed model was created with CNN with Keras and applied with ensemble-based combined LeNet, VGGNet, and DropoutNet pooling layer for tuning the information. The proposed model compares the predicted class with the correct class for all input images and time calculation for predicting different road sign detection images. Underfitting is shown by a standard of low accuracy on the training and testing sets. For a small dataset, the trained model achieved a 98% accuracy level which implied that overfitting the model with the best results on classification accuracy, tested with 15 epochs, resulted in a loss of information of 0.059% and test accuracy of 98%, respectively. Next, the ELVD proposed models trained and validated with different class presents, dataset 2 achieved 93% training accuracy and testing accuracy predicted with 91%. Finally, the ELVD proposed model predicted the test results of unseen class information measured with the 60/km ph, which predicted 99% accuracy. The proposed model predicted noisy as well as unseen multiclass information with fast-moving vehicles. The usage of convolutional layer filter with ensemble-based VGGNet, DropouNet, and LeNet trained and predicted with a high classification accuracy of more than 99% combined ELVD model with fastest time calculation also the high accuracy prediction of selected image dataset labels that enables these models to be used in real-time applications. The ELVD model was also compared with other traditional models of VGGNet, LeNet, and DropoutNet; its detection time outperformed the other models, and it achieved a 98% detection label set of information. In the ELVD model, closure to various human abilities on a related responsibility differs from 97.3% to 99.5%; consequently, the ELVD model performs better than an average human.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12040926"
    },
    {
        "id": 15004,
        "title": "Overfitting Problem of ANN- and VSTF-Based Nonlinear Equalizers Trained on Repeated Random Bit Sequences",
        "authors": "Kai Ikuta, Jinya Nakamura, Moriya Nakamura",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/transcom.2023ebp3121"
    },
    {
        "id": 15005,
        "title": "The Subspace Regularization Method Improves ErrP Detection by EEGNET in BCI Experiments",
        "authors": "Andrea Farabbi, Luca Mainardi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011682400003414"
    },
    {
        "id": 15006,
        "title": "A method to identify overfitting program repair patches based on expression tree",
        "authors": "Yukun Dong, Xiaotong Cheng, Yufei Yang, Lulu Zhang, Shuqi Wang, Lingjie Kong",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.scico.2024.103105"
    },
    {
        "id": 15007,
        "title": "Mitigating Data Variability and Overfitting in Deep Learning\nModels for Atrial Fibrillation Detection Using Single-Lead\nECGs",
        "authors": "Khadidja Benchaira, Salim Bitam, Zineb Djihane Agli",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12785/ijcds/1501120"
    },
    {
        "id": 15008,
        "title": "PLACE Dropout: A Progressive Layer-wise and Channel-wise Dropout for Domain Generalization",
        "authors": "Jintao Guo, Lei Qi, Yinghuan Shi, Yang Gao",
        "published": "2024-3-31",
        "citations": 1,
        "abstract": "\n            Domain generalization (DG) aims to learn a generic model from multiple observed source domains that generalizes well to arbitrary unseen target domains without further training. The major challenge in DG is that the model inevitably faces a severe overfitting issue due to the domain gap between source and target domains. To mitigate this problem, some dropout-based methods have been proposed to resist overfitting by discarding part of the representation of the intermediate layers. However, we observe that most of these methods only conduct the dropout operation in some specific layers, leading to an insufficient regularization effect on the model. We argue that applying dropout at multiple layers can produce stronger regularization effects, which could alleviate the overfitting problem on source domains more adequately than previous layer-specific dropout methods. In this article, we develop a novel layer-wise and channel-wise dropout for DG, which randomly selects one layer and then randomly selects its channels to conduct dropout. Particularly, the proposed method can generate a variety of data variants to better deal with the overfitting issue. We also provide theoretical analysis for our dropout method and prove that it can effectively reduce the generalization error bound. Besides, we leverage the progressive scheme to increase the dropout ratio with the training progress, which can gradually boost the difficulty of training the model to enhance its robustness. Extensive experiments on three standard benchmark datasets have demonstrated that our method outperforms several state-of-the-art DG methods. Our code is available at\n            https://github.com/lingeringlight/PLACEdropout\n            .\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3624015"
    },
    {
        "id": 15009,
        "title": "Typology of students graduating from college using dropout probabilities",
        "authors": "Naruhiko Shiratori",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52731/lir.v003.159"
    },
    {
        "id": 15010,
        "title": "Less Is More: Reducing Overfitting in Deep Learning for EEG Classification",
        "authors": "Songchi Zhou, Shijia Geng, Jun Li, Deyun Zhang, Ziqian Xie, Chuandong Cheng, Shenda Hong",
        "published": "2023-11-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22489/cinc.2023.183"
    },
    {
        "id": 15011,
        "title": "Analysis of Underfitting and Overfitting in U-Net Semantic Segmentation for Lung Nodule Identification from X-ray Radiographs",
        "authors": "Tehreem Awan, Khan Bahadar Khan",
        "published": "2023-1-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icest56843.2023.10138850"
    },
    {
        "id": 15012,
        "title": "Predicting Student Dropout Risk Using LMS Logs",
        "authors": "Takaaki Ohkawauchi, Eriko Tanaka",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52731/lir.v004.226"
    },
    {
        "id": 15013,
        "title": "Relationships Matter: The Role of Teacher-Student Relationships in Predicting Engagement, Achievement, and High School Dropout",
        "authors": "Eun Ha Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2014508"
    },
    {
        "id": 15014,
        "title": "Preventing Readmissions by Preventing the First Admission",
        "authors": "Hao Tran, Hilary Shapiro",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jchf.2023.03.020"
    },
    {
        "id": 15015,
        "title": "Educational Dropout of Students with NEE in the City of Portoviejo: A Qualitative Analysis Based on 11 Case Studies",
        "authors": "Erick Caballero,  ",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "Educational abandonment has become for many years a social problem that affects Latin American students. Consequently, several nations, including Ecuador, focus their efforts on mitigating this problem. The research about the educational abandonment of students with special needs aims to identify why 11 students did not continue studying. The sample was part of six public and private schools in Portoviejo. The school was selected due to the high number of students with special needs enrolled in the last school year. For achieving this qualitatively oriented study, semi-structured interviews were applied as a data collection technique, and the case study research method was implemented. Among the results found in the study sample, three factors of educational abandonment stand out. One of them was the socioeconomic situation, which takes precedence over the educational quality that the student could receive regardless of the type of educational institution of which he is a part. The other one was the educational environment stands out, which mainly alludes to the teacher's preparation regarding the methodological adaptations that students with disabilities require to consolidate their learning. Finally, the family factor emphasizes the lack of responsibility of parents towards their children, such as limiting their right to education. This type of research is especially relevant due to the little literature about this vulnerable group, which will allow future explorations to be carried out that seek to enforce their rights.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijsshr/v6-i4-30"
    },
    {
        "id": 15016,
        "title": "Using Ultrasound Image Augmentation and Ensemble Predictions to Prevent Machine-Learning Model Overfitting",
        "authors": "Eric J. Snider, Sofia I. Hernandez-Torres, Ryan Hennessey",
        "published": "2023-1-23",
        "citations": 5,
        "abstract": "Deep learning predictive models have the potential to simplify and automate medical imaging diagnostics by lowering the skill threshold for image interpretation. However, this requires predictive models that are generalized to handle subject variability as seen clinically. Here, we highlight methods to improve test accuracy of an image classifier model for shrapnel identification using tissue phantom image sets. Using a previously developed image classifier neural network—termed ShrapML—blind test accuracy was less than 70% and was variable depending on the training/test data setup, as determined by a leave one subject out (LOSO) holdout methodology. Introduction of affine transformations for image augmentation or MixUp methodologies to generate additional training sets improved model performance and overall accuracy improved to 75%. Further improvements were made by aggregating predictions across five LOSO holdouts. This was done by bagging confidences or predictions from all LOSOs or the top-3 LOSO confidence models for each image prediction. Top-3 LOSO confidence bagging performed best, with test accuracy improved to greater than 85% accuracy for two different blind tissue phantoms. This was confirmed by gradient-weighted class activation mapping to highlight that the image classifier was tracking shrapnel in the image sets. Overall, data augmentation and ensemble prediction approaches were suitable for creating more generalized predictive models for ultrasound image analysis, a critical step for real-time diagnostic deployment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13030417"
    },
    {
        "id": 15017,
        "title": "Automatically Avoiding Overfitting in Deep Neural Networks by Using Hyper-Parameters Optimization Methods",
        "authors": "Zahraa Saddi Kadhim, Hasanen S. Abdullah, Khalil I. Ghathwan",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Overfitting is one issue that deep learning faces in particular. It leads to highly accurate classification results, but they are fraudulent. As a result, if the overfitting problem is not fully resolved, systems that rely on prediction or recognition and are sensitive to accuracy will produce untrustworthy results. All prior suggestions helped to lessen this issue but fell short of eliminating it entirely while maintaining crucial data. This paper proposes a novel approach to guarantee the preservation of critical data while eliminating overfitting completely. Numeric and image datasets are employed in two types of networks: convolutional and deep neural networks. Following the usage of three regularization techniques (L1, L2, and dropout), apply two optimization algorithms (Bayesian and random search), allowing them to select the hyperparameters automatically, with regularization techniques being one of the hyperparameters that are automatically selected. The obtained results, in addition to completely eliminating the overfitting issue, showed that the accuracy of the image data was 97.82% and 90.72 % when using Bayesian and random search techniques, respectively, and was 95.3 % and 96.5 % when using the same algorithms with a numeric dataset.\r\n \r\n \r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3991/ijoe.v19i05.38153"
    },
    {
        "id": 15018,
        "title": "Group Regularization Learning with Dynamic Regularization Factor Based on BN Layer Scaling Factor",
        "authors": "Bo Li, Zongzeng Li, Feng Li",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ntci60157.2023.10403747"
    },
    {
        "id": 15019,
        "title": "Overfitting-avoiding goal-guided exploration for hard-exploration multi-goal reinforcement learning",
        "authors": "Changlin Han, Zhiyong Peng, Yadong Liu, Jingsheng Tang, Yang Yu, Zongtan Zhou",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.01.016"
    },
    {
        "id": 15020,
        "title": "An Optimal Solution to the Overfitting and Underfitting Problem of Healthcare Machine Learning Models",
        "authors": "Anil Kumar Prajapati Anil, Umesh Kumar Singh",
        "published": "2023-10-3",
        "citations": 2,
        "abstract": "In the current technological era, artificial intelligence is becoming increasingly popular.  Machine learning, as the branch of AI is taking charge in every field such as healthcare, the Stock market, Automation, Robotics, Image Processing, and so on. In the current scenario, machine learning and/or deep learning are becoming very popular in medical science for disease prediction. Much research is underway in the form of disease prediction models by machine learning. To ensure the performance and accuracy of the machine learning model, it is important to keep some basic things in mind during training. The machine learning model has several issues which must be rectified duration of the training of the model so that the learning model works efficiently such as model selection, parameter tuning, dataset splitting, cross-validation, bias-variance tradeoff, overfitting, underfitting, and so on. Under- and over-fitting are the two main issues that affect machine learning models. This research paper mainly focuses on minimizing and/or preventing the problem of overfitting and underfitting machine learning models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29207/joseit.v2i2.5460"
    },
    {
        "id": 15021,
        "title": "How Outside Organizations Impact Policy Implementation: Comparing Dropout Prevention Systems in Chicago, Philadelphia, and New York City",
        "authors": "Jose Eos Trinidad",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2001225"
    },
    {
        "id": 15022,
        "title": "VOCATIONAL SCHOOL DROPOUTS’ PERSPECTIVE OF DROPOUT RISK AND PROTECTIVE FACTORS",
        "authors": "",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36315/2023inpact128"
    },
    {
        "id": 15023,
        "title": "A Generalised Dropout Mechanism for Distributed Systems",
        "authors": "Larry Bull, Haixia Liu",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "AbstractThis letter uses a modified form of the NK model introduced to explore aspects of distributed control. In particular, a previous result suggesting the use of dynamically formed subgroups within the overall system can be more effective than global control is further explored. The conditions under which the beneficial distributed control emerges are more clearly identified, and the reason for the benefit over traditional global control is suggested as a generally applicable dropout mechanism to improve learning in such systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/artl_a_00393"
    },
    {
        "id": 15024,
        "title": "Analysis of School Dropout Girls: a Study of Sehore District of Madhya Pradesh",
        "authors": "Tanya Gandhi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4778593"
    },
    {
        "id": 15025,
        "title": "What Works? Interventions Aimed at Reducing Student Dropout in Higher Education",
        "authors": "Kristoffer Ibsen, Michael Rosholm",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4759865"
    },
    {
        "id": 15026,
        "title": "The Phenomenon of Voluntary Dropout: An Investigation into Management Information Systems Students",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47750/pegegog.13.04.38"
    },
    {
        "id": 15027,
        "title": "Optic Disc Microvasculature Dropout in Pre-perimetric Glaucoma",
        "authors": "Min Hee Suh, Robert N. Weinreb, Linda M. Zangwill",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "\nPurpose:\nTo investigate factors associated with optic disc microvasculature dropout (MvD-D) in pre-perimetric primary open-angle glaucoma (PPG) patients.\n\n\nMethods:\n139 eyes of PPG patients were categorized according to the presence of MvD-D with optical coherence tomography angiography (OCTA). Factors including visual field (VF) mean deviation (MD), retinal nerve fiber layer (RNFL) thickness, focal lamina cribrosa (LC) defect, optic disc hemorrhage (DH), and parapapillary deep-layer microvasculature dropout (MvD-P) were compared between eyes with and without MvD-D.\n\n\nResults:\nMvD-D was observed in 69 PPG eyes (49.6%). Compared with eyes without MvD-D, the ones with MvD-D had a significantly thinner RNFL in all areas except the nasal sector, worse VF MD, and a focal LC defect and MvD-P (P<0.05): male gender also was more highly prevalent. A considerable number of eyes with MvD-D lacked focal LC defect (62.3% (43/69)) or MvD-P (71.0% (49/69)), while a few eyes without MvD-D had focal LC defect (10.0% (7/70)) or MvD-P (2.9% (2/70)). In a multivariable logistic regression analysis, male gender (odds ratio [OR], 3.96; P<0.001), worse VF MD (OR, 1.44; P=0.019), thinner global RNFL (OR, 1.13; P<0.001), higher prevalence of focal LC defect (OR, 3.71; P=0.014) and MvD-P (OR, 7.85; P<0.001) were significantly associated with MvD-D.\n\n\nConclusions:\nMvD-D was related to worse disease severity in PPG patients, and often was not accompanied by focal LC defect or MvD-P. This suggests that impaired optic disc circulation can be an early sign of glaucoma without noticeable changes in functional or structural features (i.e., VF, focal LC defect, MvD-P).\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/ijg.0000000000002403"
    },
    {
        "id": 15028,
        "title": "Comment on “Forbidden Knowledge and Specialized Training: A Versatile Solution for the Two Main Sources of Overfitting in Linear Regression,” by Rohlfs (2023)",
        "authors": "Ronald Christensen",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/00031305.2023.2277156"
    },
    {
        "id": 15029,
        "title": "The (academic) road less travelled: From dropout to recovery",
        "authors": "",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37074/jalt.2023.6.2.14"
    },
    {
        "id": 15030,
        "title": "Predicting late dropout from nursing education or early dropout from the profession.",
        "authors": "Jos H.A.M. Kox, Joost S. van der Zwan, Johanna H. Groenewoud, Jos Runhaar, Sita M.A. Bierma-Zeinstra, Ellen J.M. Bakker, Harald S. Miedema, Allard J. van der Beek, Cécile R.L. Boot, Pepijn D.D.M. Roelofs",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sctalk.2022.100106"
    },
    {
        "id": 15031,
        "title": "Addressing the Escalating Female Students Dropout Rates: Empowering Girls' Education in Lebanese Schools",
        "authors": "Elie El Hayek",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4719022"
    },
    {
        "id": 15032,
        "title": "Oppressive Pushout: Examining Differences in Supports, Dropout, and Discipline by Race, Gender, and Sexuality",
        "authors": "Danielle Aguilar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2014374"
    },
    {
        "id": 15033,
        "title": "Improving Word Embedding Using Variational Dropout",
        "authors": "Zainab Albujasim, Diana Inkpen, Xuejun Han, Yuhong Guo",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Pre-trained word embeddings are essential in natural language processing (NLP). In recent years, many post-processing algorithms have been proposed to improve the pre-trained word embeddings. We present a novel method - Orthogonal Auto Encoder with Variational Dropout (OAEVD) for improving word embeddings based on orthogonal autoencoders and variational dropout.  Specifically, the orthogonality constraint encourages more diversity in the latent space and increases semantic similarities between similar words, and variational dropout makes it more robust to overfitting.   Empirical evaluation on a range of downstream NLP tasks, including semantic similarity, text classification, and concept categorization shows that our proposed method effectively improves the quality of pre-trained word embeddings. Moreover, the proposed method successfully reduces the dimensionality of pre-trained word embeddings while maintaining high performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32473/flairs.36.133326"
    },
    {
        "id": 15034,
        "title": "EXAMINING STUDENT DROPOUT IN ESTONIAN VOCATIONAL SCHOOLS: RISKS AND PREVENTIVE MEASURES",
        "authors": "Anne Uukkivi, Natalja Maksimova, Oksana Labanova",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2024.1005"
    },
    {
        "id": 15035,
        "title": "Controlled Dropout for Uncertainty Estimation",
        "authors": "Mehedi Hasan, Ibrahim Hossain, Ashikur Rahman, Saeid Nahavandi",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394101"
    },
    {
        "id": 15036,
        "title": "Robust Control for the Mixed Platoon with Polytopic Uncertainties, Delay and Packet Dropout",
        "authors": "Yuan Gong, Wen-Xing Zhu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451220"
    },
    {
        "id": 15037,
        "title": "Two Strategies for Avoiding Overfitting Long-Term Forecasting Models: Downsampling Predictor Fields and Shrinking Coefficients",
        "authors": "Ranran He, Yuanfang Chen, Yong Liu, Zhengwei Pan, Qin Huang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/jhyeff.heeng-5864"
    },
    {
        "id": 15038,
        "title": "A Physical Barrier Model for Preventing the Enamel Demineralization",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "The incidence and prevalence of dental caries in Indonesia has increased from year to year. The main cause is often associated with bad tooth brushing habits. Caries occurs because there is a process of demineralization of the surface of hard tooth tissues such as email due to the presence of acids produced by bacteria that metabolize the substrate. Coating the tooth surface with an acid-resistant material is an emerging idea for caries prevention in the future, Preliminary studies with extracted tooth models demonstrated that enamel surface coating was able to prevent demineralization through physical barrier. This method is possible as novel strategy of caries prevention on clinical level.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/oajds-16000356"
    },
    {
        "id": 15039,
        "title": "82 Preventing overdiagnosis in the clinical consultation – practical training of the three part consultation model",
        "authors": "Oskar Lindfors, Josabeth Hultberg",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/ebm-2023-pod.82"
    },
    {
        "id": 15040,
        "title": "Preventing infection or preventing sustainability?",
        "authors": "Claire M. Rickard, Matthew H. Anstey, Samantha Keogh",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iccn.2023.103488"
    },
    {
        "id": 15041,
        "title": "Self-paced resistance learning against overfitting on noisy labels",
        "authors": "Xiaoshuang Shi, Zhenhua Guo, Kang Li, Yun Liang, Xiaofeng Zhu",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109080"
    },
    {
        "id": 15042,
        "title": "Stream regularization index. A morphometric approach to quantify the longitudinal profile regularization stage",
        "authors": "Francisco Abel Jiménez-Cantizano, Loreto Antón",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geomorph.2022.108580"
    },
    {
        "id": 15043,
        "title": "Regularization of the RLS algorithm for adaptive digital predistortion",
        "authors": "I.E. Kashchenko, A.P. Pavlov",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Problem statement. Modern digital pre-image input systems, as a rule, involve the use of adaptation algorithms to correct their parameters. Adaptation algorithms are solutions based on LMS and RLS methods. At the same time, the efficiency, in terms of the convergence rate and the accuracy of the solution, of RLS methods is significantly higher. This is due to the presence of a covariance matrix as part of the solution based on the RLS method. However, when using RLS algorithms (an adaptation algorithm using the RLS method), problems may arise related to poor conditionality of the covariance matrix resulting from signal noise, high inertia of the nonlinear properties of the power amplifier, limited accuracy of parameter calculation, etc. To solve this problem, it is advisable to use the regularization procedure of the RLS algorithm, taking into account the specifics of the digital predistortion systems.  Objective. Creation and analysis of the regularization procedure of the RLS algorithm for adaptive input systems of digital presets.  Results. The paper presents the implementation of the regularization procedure of the RLS algorithm for adaptive input systems of digital presets. Using the regularization procedure of the RLS algorithm avoids the state of poor conditionality of the covariance matrix, thereby ensuring stable operation of the digital pre-order input system. The state of the covariance matrix is monitored at each iteration of the RLS algorithm by evaluating the trace of the matrix.  Practical importance. The proposed solution can be used to stabilize the parameters of adaptive systems for entering pre-orders based on RLS algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18127/j00338486-202401-13"
    },
    {
        "id": 15044,
        "title": "Predicting Student Dropout with Minimal Information",
        "authors": "Nassim MOUCHANTAF, Maroun Chamoun",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": " \nStudent dropout is a problem for both students and universities. However, in the crises that Lebanon is going through, it is becoming a serious financial problem for Lebanese private universities. To try to minimize it, it must be predicted in order to implement the appropriate actions. In this paper, a method to build the appropriate prediction system is presented. First, it generates a data source of predictor variables from student dataset collected from a faculty of economic sciences in Beirut between 2010 and 2020. Then, it will build a prediction model using data classification techniques based on identified predictor variables and validate it. Using open-source software and free cloud environments, a prediction program was developed. It consolidates, corrects, and normalizes the student's data. Then, it applies simple linear regression to show the correlation between the different variables and the student dropout, which allows us to select the factors that are highly correlated. From this point on, the program tries to predict the student dropout using different classification algorithms by machine learning on student dataset who left their courses either in success or in failure. Lastly, it measures the accuracy of the results and determines the best algorithm. In this study, the Artificial Neural Networks - Multilayer Perceptron showed an accuracy of 98.1% using only five variables. Finally, we evoke new avenues to further research and improve the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24996/ijs.2023.64.10.33"
    },
    {
        "id": 15045,
        "title": "Knowledge Distillation for Human Pose Estimation Using Channel Dropout Strategy",
        "authors": "Guangyao Zhou, Xiluo Teng, Kang-Hyun Jo",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwis58789.2023.10284595"
    },
    {
        "id": 15046,
        "title": "Improving Label Assignments Learning by Dynamic Sample Dropout Combined with Layer-wise Optimization in Speech Separation",
        "authors": "Chenyang Gao, Yue Gu, Ivan Marsic",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1172"
    },
    {
        "id": 15047,
        "title": "Dropout of Scheduled Castes and Scheduled Tribes Females at Higher Education",
        "authors": "Dr. Padma Dutta -",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "Dropout is a major problem in the globalized educational system. Different factors affect the students at their continuing education, finding them out could be an effective step in removing dropout at all the level of education. The present study has a significant role to draw the preventive measures to stop further dropping out. The present study had made a personal interview of six dropout students consisting three Scheduled Castes and three Scheduled Tribe students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i01.14091"
    },
    {
        "id": 15048,
        "title": "Causes of School Dropout in Topporeng Village, Mallusetasi Sub-District",
        "authors": "Nismawati ., Syamsu A. Kamaruddin, M. Ridwan Said Ahmad",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "This study aims to explore information, discuss, and provide an overview of the causes of school dropouts in Topporeng Village, Mallusetasi Sub-District seen from the following perspective: (1) interest in going to school, (2) the economic condition of dropouts, and (3) the environment where children drop out of school. This type of research is descriptive qualitative research, where the informants taken as samples are school dropouts, and the selection of informants using a purposive sampling technique. The data collection techniques used are observation, interview, and documentation techniques. The analysis technique used was data display, data reduction, data presentation, and conclusion drawing. The results showed that the factors that cause children to drop out of school are: (1) low interest in learning, while on the other hand, the teacher’s method is less varied in teaching, so they do not understand. Also, the teacher gives a lot of assignments and children don’t do them because they don’t understand, (2) low parental income ranging from Rp 300,000-Rp 1,000,000 per month with the main job being farming and dependents between 2-5 people, and (3) the influence of peers, invitations from peers for playing which makes them skip school until they finally drop out of school.\r\nKeywords: education, school dropout, economy, social environment 1",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/kss.v9i2.14841"
    },
    {
        "id": 15049,
        "title": "Dropout in a Blended Learning and a Traditional Course: Role of Course Design and Emotions",
        "authors": "Theresa Bauer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2010819"
    },
    {
        "id": 15050,
        "title": "State estimation of networked control systems over limited capacity and dropout channels",
        "authors": "Qingquan Liu, Rui Ding, Chunqiang Chen",
        "published": "2023-7-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/acs.2019.131232"
    },
    {
        "id": 15051,
        "title": "A Survey of Student Dropout Analysis Using Machine Learning Approach",
        "authors": "Zhilu Wang",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Online learning and conventional learning are two important methods that students pursue their educational degrees or expand their knowledge. The enormous rate of dropout of online students and the fact that this rate is still increasing leads to the concern of raise student retention rate. And the large number of conventional student dropout create loss in economics, time and education resources. Therefore, it is important to seek the factor affecting student dropout and investigate effective machine learning-based models on prediction of student dropout. Different factors including the clickstream, academic information, family are discussed, followed by introductory information about current popular machine learning algorithms. According to this comprehensive review, the grade of online learners and the total number of students assessment to courses seem to be the most powerful features and conventional students are affected by social contact and attendance of social activities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v68i.12048"
    },
    {
        "id": 15052,
        "title": "7 Preventing overmedicalisation among people with chronic disease: a qualitative study of people living with HIV",
        "authors": "Daniel Cheung, Natalie Edmiston",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/ebm-2023-pod.7"
    },
    {
        "id": 15053,
        "title": "Preventing Maternal Mortality From Hypertensive Disorders Of Pregnancy And Obstetric Haemorrhage",
        "authors": "Theodore Boafor",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.60014/pmjg.v12i2.332"
    },
    {
        "id": 15054,
        "title": "61 Preventing medical overactivity: sustainable health care powered by core values",
        "authors": "Anna Stavdal, Johann Agust Sigurdsson, Halfdan Petursson, Linn Getz",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/ebm-2023-pod.61"
    },
    {
        "id": 15055,
        "title": "Comparative Analysis of Dropout Rate in Tertiary Education in Online and Offline Mode in Mumbai",
        "authors": "Radhika Talekar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4466082"
    },
    {
        "id": 15056,
        "title": "Correction to: Career Compromises and Dropout from Vocational Education and Training in Germany",
        "authors": "",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/sf/soad083"
    },
    {
        "id": 15057,
        "title": "Ethnic Minorities’ Dropout Decisions in Higher Education",
        "authors": "Souksakhone Sengsouliya, Vanmany Vannasy",
        "published": "2023-4-6",
        "citations": 1,
        "abstract": "The objective of this paper is to examine theoretical views on minority dropout decisions in higher education. This integrative review demonstrates that the dropout issue is highly complex and is comprised of different definitions and characteristics. It is required that educators clearly define the term. The review’s findings also show that minority students’ decisions to drop out from higher education involve factors of three different dimensions: psychological, physical, and environmental factors. Institutional support is necessary to assist minority students in their educational attainment. The review concludes that future research will be key in further exploring the issue of minority dropout.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4312/as/10444"
    },
    {
        "id": 15058,
        "title": "Preventing Insider Attacks in Databases",
        "authors": "",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56831/psen-02-060"
    },
    {
        "id": 15059,
        "title": "Correction",
        "authors": "",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/1045988x.2023.2170617"
    },
    {
        "id": 15060,
        "title": "Correction",
        "authors": "",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/1045988x.2023.2219526"
    },
    {
        "id": 15061,
        "title": "“\n            <i>We mostly focus on preventing pregnancy, we don’t really focus on preventing HIV</i>\n             … ”: Young people’s perceptions and priorities when preventing unplanned pregnancy and HIV",
        "authors": "Jewelle JS Methazia, Tshegofatso P Bessenaar, Sarah E Baum",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2989/16085906.2023.2279646"
    },
    {
        "id": 15062,
        "title": "Foldback Current Limiting in Low-Dropout Voltage Regulators with Aging Analysis Based Operating Envelope",
        "authors": "Hrayr Sahakyan",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ewdts59469.2023.10297089"
    },
    {
        "id": 15063,
        "title": "Neuropsychological Test Feedback of a School Dropout with Depressive Episode",
        "authors": "DEEPSHRI PHUKAN, Rita Rani Talukdar",
        "published": "2023-5-2",
        "citations": 0,
        "abstract": "Neuropsychological Test Feedback of a School Dropout with Depressive Episode\r\n*Mr. Deepshri Phukan,\r\nResearch-Scholar, Department of Psychology, Gauhati University, Guwahati, Assam;\r\n**Dr. Rita Rani Talukdar,\r\nProfessor, Department of Psychology, Gauhati University, Guwahati, Assam;\r\n \r\nAbstract \r\nAim: Psychological test feedback provides objective guidance in decision-making as well as assists in rehabilitation and treatment. The effectiveness of feedback must be judged in terms of patient benefits. This case study aims to study the benefits of neuropsychological test feedback in an individual with a depressive episode.\r\nMethod: This study is designed as a case study of a school dropout diagnosed with a depressive episode. The neuropsychological assessment feedback session has been conducted following the Collaborative Therapeutic Neuropsychological Assessment model (CTNA). In particular, the focus of this case study is on how the Color Trails Test and the Wisconsin Card Sorting Test can be used as therapeutic interventions in a depressive episode.\r\nResults: Results show that the neuropsychological test feedback helps the individual in decision-making, resolving conflicts, making priorities, and improving interpersonal communication. Results also show treatment effects in symptom reduction, level of functioning, and overall improvement in subjective well-being. The findings have implications for managing depressive episodes and the use of test feedback as a therapeutic intervention.\r\nKeywords: feedback, depression, neuropsychological assessment, therapeutic assessment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56011/mind-mri-121-20236"
    },
    {
        "id": 15064,
        "title": "Load Forecast of Rail Transit Power System Based on Dropout Echo State Network",
        "authors": "Xiaohui Mu, Junwei Cao",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icei60179.2023.00063"
    },
    {
        "id": 15065,
        "title": "76 Preventing overuse of infant formula by examining biological background assumptions",
        "authors": "Bartosz Helfer, Katarzyna Henke-Ciążyńska, Iwo Fober, Robert J Boyle",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/ebm-2023-pod.76"
    },
    {
        "id": 15066,
        "title": "On an Extension of a Spare Regularization Model",
        "authors": "Abdellatif Moudafi",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "In this paper, we would first like to promote an interesting idea for identifying the local minimizer of a non-convex optimization problem with the global minimizer of a convex optimization one. Secondly, to give an extension of their sparse regularization model for inverting incomplete Fourier transforms introduced. Thirdly, following the same lines, to develop convergence guaranteed efficient iteration algorithm for solving the resulting nonsmooth and nonconvex optimization problem but here using applied nonlinear analysis tools. These both lead to a simplification of the proofs and to make a connection with classical works in this filed through a startling comment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11204285"
    },
    {
        "id": 15067,
        "title": "Ligon–Schaaf regularization map revisited",
        "authors": "Guowu Meng",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "The phase space of the classical Kepler problem is incomplete, as certain Kepler motions do not continue indefinitely in time. To address this issue, a method called “regularization” was introduced in the 1960s and 1970s. While there are several versions of this scheme, the one developed by Ligon and Schaaf [Rep. Math. Phys. 9, 281–300 (1976)] is often preferred due to its global nature and lack of time reparameterization requirement. In this article, we present a new regularization method that is both global and requires no time reparameterization, while also exhibiting a higher degree of symmetry. Our method emphasizes symmetries over spaces and exhibits a duality similar to the compact-noncompact duality observed in symmetric spaces.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0163676"
    },
    {
        "id": 15068,
        "title": "Image Registration with Learned Regularization",
        "authors": "Xinjie Lai, Wan Yang, Lvda Wang, Shihui Ying",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450865"
    },
    {
        "id": 15069,
        "title": "School dropout of Iranian students: A public health crisis",
        "authors": "Amir Kabir",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chiabu.2023.106589"
    },
    {
        "id": 15070,
        "title": "Synthesis and Model Development of Thai Undergraduate Dropout Risk Factors",
        "authors": "Timothy Scott, Poonpilas Asavisanu",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "This study synthesizes existing research to explore factors affecting student attrition in Thai higher education institutions and develop a causal model for dropout risk. The synthesis uses a mixed-method approach following PRISMA 2020 guidelines, drawing on six years of Thai contextual studies on student attrition, academic intention, commitment, and persistence. Through a systematic review of multiple databases, 21 quantitative or mixed-method studies were identified for inclusion, which yielded 107 items representing 186 occurrences related to student dropout or persistence factors in Thai higher education. These items were grouped into nine clusters: academic integration, attitudinal and behavioral factors, classroom and institutional environment, emotional distress, family support, financial considerations, institutional support, social integration, and student satisfaction. The model synthesizes research findings on student attrition in Thai universities, providing a comprehensive framework for understanding the factors influencing students&#39; persistence and dropout risk. By considering the interplay between these factors, the model aids in developing targeted interventions and informed policy decisions that promote academic success and ensure the long-term efficacy of Thai higher education institutions. The model&#39;s application can potentially guide researchers, educators, and policymakers in addressing the challenges students face within the Thai higher education system, ultimately fostering a more supportive and conducive environment for academic achievement.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5539/hes.v13n4p94"
    },
    {
        "id": 15071,
        "title": "Less Is More: Adaptive Trainable Gradient Dropout for Deep Neural Networks",
        "authors": "Christos Avgerinos, Nicholas Vretos, Petros Daras",
        "published": "2023-1-24",
        "citations": 2,
        "abstract": "The undeniable computational power of artificial neural networks has granted the scientific community the ability to exploit the available data in ways previously inconceivable. However, deep neural networks require an overwhelming quantity of data in order to interpret the underlying connections between them, and therefore, be able to complete the specific task that they have been assigned to. Feeding a deep neural network with vast amounts of data usually ensures efficiency, but may, however, harm the network’s ability to generalize. To tackle this, numerous regularization techniques have been proposed, with dropout being one of the most dominant. This paper proposes a selective gradient dropout method, which, instead of relying on dropping random weights, learns to freeze the training process of specific connections, thereby increasing the overall network’s sparsity in an adaptive manner, by driving it to utilize more salient weights. The experimental results show that the produced sparse network outperforms the baseline on numerous image classification datasets, and additionally, the yielded results occurred after significantly less training epochs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031325"
    },
    {
        "id": 15072,
        "title": "Teachers’ Perspective on Girls’ Dropout from Schools and Actions to Support their Education in India: A Multi-centric Qualitative Study",
        "authors": "Shantanu Sharma,  ",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24321/2349.2880.202307"
    },
    {
        "id": 15073,
        "title": "Identifying Risk Factors for Student Dropout in Higher Education Using Large-Scale Administrative Data (Poster 6)",
        "authors": "Marina Pumptow",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2012181"
    },
    {
        "id": 15074,
        "title": "Exploring Hessian Regularization in Mixup",
        "authors": "Kosuke Sugiyama, Masato Uchida",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00276"
    },
    {
        "id": 15075,
        "title": "Dropout prediction of MOOCs students based on deep learning",
        "authors": "Xiangyu Wang, Fan Zhang, Xinhong Zhang",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cedl60560.2023.00026"
    },
    {
        "id": 15076,
        "title": "Galaxy classification based on convolutional neural networks with dropout technique",
        "authors": "Haoyu Hu",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Galaxy morphology classification is essential for studying the formation and evolution of galaxies. However, previous studies based on Convolutional Neural Network (CNN) mainly focused on the structure of convolutional layers without exploring the designs of fully connected layers. In this regard, this paper trains and compares the performance of CNNs with 4 types of fully connected layers on the Galaxy10 DECaLS dataset. Each type of the fully connected layers contains one dropout layer, and dropout rates including 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, and 90% are tested in the experiment to investigate how dropout rates in fully connected layers can affect the overall performance of CNNs. Meanwhile, these models utilize the EfficientNetB0 and DensnNet121 as their feature extraction networks. During the training process, feature-wise standardization, morphological operations, and data argumentation are used for preprocessing. Technics including class weights, exponential learning rate decay, and early stopping are applied to improve model performance. Saliency maps and Grad-CAM are also used to interpret model behaviours. Results show that the architectures of fully connected layers have a significant effect on models overall performance. With the same dropout rate and convolutional layers, models using global average pooling and an additional dense layer outperform others in most cases. The best model obtained an accuracy of 85.23% on test set. Meanwhile, the experimental results on dropout indicate that dropout layer can reduce the effect of the architectures of fully connected layers on overall performance of some CNNs, leading to better performance with less parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/22/20231166"
    },
    {
        "id": 15077,
        "title": "Token-Consistent Dropout For Calibrated Vision Transformers",
        "authors": "Nikola Popovic, Danda Pani Paudel, Thomas Probst, Luc Van Gool",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222084"
    },
    {
        "id": 15078,
        "title": "Transformer-Based Lip-Reading with Regularized Dropout and Relaxed Attention",
        "authors": "Zhengyang Li, Timo Lohrenz, Matthias Dunkelberg, Tim Fingscheidt",
        "published": "2023-1-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/slt54892.2023.10023442"
    },
    {
        "id": 15079,
        "title": "Factors Affecting the Rate of Child Dropout from Multiple Angles",
        "authors": "Qiqi Wang",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "The research background of this study is based on the phenomenon of children out of school worldwide. In the 21st century when the economy is highly developed, the problem of children out of school still exists. In order to protect children's right to education, it is of great significance to reduce the rate of children out of school. The research theme of this study is \"Factors affecting the rate of child dropout from multiple perspectives\", and the main research methods are literature analysis, comparative analysis and statistical analysis. The results show that the country's economic level, education expenditure and the proportion of public education investment all have a significant impact on the child dropout rate, and the child dropout rate is significantly correlated with it, while gender has no significant impact on the child dropout rate, and the child dropout rate is higher in poor areas, and the lack of education investment seriously affects the improvement of the level of education development and the popularization of compulsory education. The conclusion of this study is that implementing the compulsory education system and increasing the economic investment in the field of education can reduce the dropout rate of children and protect children's right to education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ehss.v12i.7619"
    },
    {
        "id": 15080,
        "title": "Student Dropout Rate Analysis using Education Data of Rakhine State",
        "authors": "Thaung Myint Tun, Lay Lay Myat, Zaw Tun",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca51723.2023.10182126"
    },
    {
        "id": 15081,
        "title": "Green Attack or Overfitting? Comparing Machine-Learning- and Vegetation-Index-Based Methods to Early Detect European Spruce Bark Beetle Attacks Using Multispectral Drone Images",
        "authors": "Langning Huo, Henrik Jan Persson, Jonas Bohlin, Eva Lindberg",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282624"
    },
    {
        "id": 15082,
        "title": "Deregulation and Inflation: Preventing a Petroleum Industry Act's Paradox",
        "authors": "Aliyu O",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "This paper seeks to expatiate on the impact of Petroleum Industry Act 2020, given its provision authorizing the Federal Government to withdraw subsidy payment at the downstream sector and deregulate same. Without necessarily antagonizing this initiative, given that it would rid government’s expenditure from the massive the cost that goes with the maintaining subsidy payment, and enable the government focus on other sectors of the economy that could thrive better with increased funding, I attempt to show that the initiative without more could engineer a grim impact on the economy from a pricing standpoint, and ultimately proffering solutions across various timelines to manage the deregulation plans.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/ppej-16000332"
    },
    {
        "id": 15083,
        "title": "Editorial for preventing school failure special edition - COVID-19 and learning loss: what the literature and practice tell us",
        "authors": "William Crawley, Timothy E. Morse, William Evans, Amany Habib",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/1045988x.2023.2204846"
    },
    {
        "id": 15084,
        "title": "Protocol optimization and reducing dropout in online research",
        "authors": "Halee Staggs, Colleen Mills-Finnerty",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "Online research has advantages over in-person research; it’s cost-efficient, scalable, and may increase diversity. Researchers collecting data online can assess protocol performance with classification models like a decision tree. However, challenges include attrition, lack of testing environment controls, technical limitations, and lack of face-to-face rapport and real time feedback. It is necessary to consider human factors of the teleresearch process from recruitment to data collection. Here we document the impact of protocol optimizations on social media engagement and retention between a pilot sample of Veterans (n = 26) and a post-optimization sample of both Veterans and civilians (n = 220) recruited from Facebook advertisements. Two-sided tests for equality of proportions were statistically significant: advertisement views leading to clicks increased by 23.8% [X2(1) = 130.3, p &lt; 0.001] and completion of behavioral tasks increased by 31.2% [X2(1) = 20.74, p &lt; 0.001]. However, a proportion of participants dropped out of the study before completion for both samples. To explore why, a C5.0 decision tree was used to find features that classify participant dropout. The features chosen by the algorithm were nicotine use (100%) and cannabis use (25.6%). However, for those completing the study, data quality of cognitive performance was similar for users and nonusers. Rather than determining eligibility, participants who endorse using nicotine, or both nicotine and cannabis, may have individual differences that require support in online protocols to reduce drop out, such as extra breaks. An introduction page that humanizes participants’ lifestyle habits as a naturalistic benefit of remote research may also be helpful. Strategies are discussed to increase engagement and improve data quality. The findings have implications for the feasibility of conducting remote research, an increasingly popular approach that has distinct challenges compared to in-person studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnhum.2023.1251174"
    },
    {
        "id": 15085,
        "title": "A fast-transient capacitorless low dropout regulator",
        "authors": "Jialing Qu, Chenjian Wu",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2682561"
    },
    {
        "id": 15086,
        "title": "M-LIO: Multi-lidar, multi-IMU odometry with sensor dropout tolerance",
        "authors": "Sandipan Das, Navid Mahabadi, Maurice Fallon, Saikat Chatterjee",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv55152.2023.10186548"
    },
    {
        "id": 15087,
        "title": "Factors associated with dropout from outpatient tertiary mental health services",
        "authors": "Nasir Mehmood, Uroosa Talib",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "Background and Objective:\r\nThere is a paucity of mental health hospital-based studies from Pakistan that have observed the contributing factors of dropout. This study aims to understand contributing factors to dropouts from mental health services.\r\nMethod:\r\nThis telephonic survey was conducted as a cross-sectional study from dropout outpatients of Karwan-e-Hayat Institute for Mental Health Care, a tertiary mental care hospital in Karachi, Pakistan. Using a simple questionnaire to assess socio-demographic variables, psychosocial assessment, and patient perspectives on treatment termination. A total of 158 participants out of 200 patients provided insight into their dropout experiences.\r\nResult: \r\nResults revealed that younger adults, particularly those aged 18-40, demonstrated a greater tendency to discontinue treatment. Level of education was also associated with dropout rates, with uneducated and less educated individuals showing greater tendencies to drop out of treatment than their educated counterparts. Schizophrenia emerged as a leading psychiatric diagnosis associated with high dropout rates. Lack of insight into psychotherapy, patient dissatisfaction, and geographic distance from treatment centers were identified as key contributors to dropout.\r\nConclusion:\r\nFactors such as age, educational status, diagnosis, insight into the disease, dissatisfaction with the treatment and distance from the treatment center were related to the dropout rate. Insights gained from this investigation advocate for tailored interventions focusing on education, patient satisfaction, and proximity to treatment facilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56310/pjns.v18i03.307"
    },
    {
        "id": 15088,
        "title": "A Systematic Review of Gamification in MOOCs: Effects on Student Motivation, Engagement, and Dropout Rates",
        "authors": "ALJ Zakaria",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.9743/jeo.2024.21.2.15"
    },
    {
        "id": 15089,
        "title": "AC Dropout Algorithm for Digitally Controlled Totem-pole Bridgeless PFC",
        "authors": "John Kim, Brent McDonald, Sheng-Yang Yu",
        "published": "2023-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apec43580.2023.10131657"
    },
    {
        "id": 15090,
        "title": "Data visualization tools applied to the analysis of school dropout at higher-level\ninstitution",
        "authors": "Maricela Morales-Hernández",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "School dropout at a higher level is a problem that afflicts\nall higher education institutions in all countries of the\nworld, in Mexico, and in particular in the state of Oaxaca.\nAt the present work, data visualization tools are applied to\nanalyze a data set of students who dropped out of the\nComputer Systems Engineering career at TecNM/I.T. of\nOaxaca, with the objective of finding the relationship that\nthe variables of such a data set have. To achieve this, the\ndata analysis methodology proposed by Google is applied,\nas well as the Tableau and Orange tools for visualizing\ntrends, relationships between variables, etc. of the data set.\nThis research contributes to the instances that make\ndecisions about the strategies to follow to prevent school\ndropout to some extent. In the same way, it also\ncontributes as a guide for the application of the tools that\nexist under a free and not free license to carry out similar\nanalyses, so that those interested can start their own\nanalyses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35429/joct.2023.20.7.1.10"
    },
    {
        "id": 15091,
        "title": "Mitigating Academic Institution Dropout Rates with Predictive Analytics Algorithms",
        "authors": "Bongs Lainjo",
        "published": "2023-1-2",
        "citations": 2,
        "abstract": "Multiple studies show student dropout rates across rich, low and middle-income countries. With the development of machine learning, various learning institutions have initiated predictive analytics algorithms to solve this issue. However, there is limited knowledge on how this strategy has been employed to optimize retention rates. The research aims to comprehensively review PAAs Strategies and demonstrate how they have been effectively implemented in optimizing retention rates with a case study focusing on North America. The study employed a quantitative research methodology and thematic study design to review the existing literature. The result shows that learning institutions used a combination of data mining classifiers such as k-Nearest Neighbor, Neural Networks, Decision Tree, and Naive Bayes to categorize student dropout rates and optimize retention rates. The PAAs approach has been utilized by various educational institutions across North America, applying multiple predicting algorithms to ensure efficiency.\r\nKeywords: Predictive analytics algorithms, mitigating dropout rates, retention rates, classifiers, Learning institutions, North America\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47747/ijets.v3i1.866"
    },
    {
        "id": 15092,
        "title": "EduBoost: An Interpretable Grey-Box Model Approach to Identify and Prevent Student Failure and Dropout",
        "authors": "Andy Qin, Mihai Boicu",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/fie58773.2023.10343186"
    },
    {
        "id": 15093,
        "title": "School Dropout of Dalit Students at Basic Level in Nepal",
        "authors": "Jiwan Kumar Mishra",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "This paper examines the situation of school dropout students at basic level in Nepal. The term dropout refers to a person who has abandoned a course of study. The focus of the analysis has covered one of the most privileged groups of Nepalese society in a community schools of Nepal, which is known as Dalit. In this paper the dropout refers to Dalit students who dropout of school before completing a course of instruction. . For this purpose, quantitative research design was applied to collect data. Both primary and secondary data were used and questionnaire method was applied to collect primary data. Secondary data were collected from the official records of schools. The finding shows that Dalit students are facing the dropout problem before completing basic level. The finding also indicates that Dalits are considered one of the disadvantaged group of Nepalese society as well as backwards in terms of socio-economic status and education. The caste and gender discrimination has also played a significant role to increase dropout of Dalit students. The government of Nepal has declared various lows, policies and program to increase students' participation and   to ensure equal access in education of Dalit students. However, the rate of dropout Dalit students are higher than other groups of people. As a result, at the basic level continues to grow, yet its high dropout rates remain a pressing and complex problem in Dalit community.  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3126/rupantaran.v7i1.52203"
    },
    {
        "id": 15094,
        "title": "TPS7H1111-SP 1.5-A, Ultra-Low Noise, High PSRR Radiation Hardened Low Dropout Linear Regulator",
        "authors": "Kyle Rakos, Christopher Graves",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/espc59009.2023.10298145"
    },
    {
        "id": 15095,
        "title": "REGULARIZATION OF WAKEFIELD IN A WEAKLY NONLINEAR REGIME",
        "authors": "I.V. Demydenko",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "In blowout regime of wakefield excitation, strong chaotization of wake occurs. However, for electron-positron colliders and X-ray microscopes, a weakly nonlinear regime is proposed with the formation of a regular short chain of bubbles. To increase the efficiency of the wakefield accelerator, it is necessary that not separate bunches participate. In this paper in 2D plane geometry, the dependence of the number of formed bubbles and their regularization on the degree of wake non-linearity and parameters: driver current, ion mobility, transverse plasma size and profile is studied. We will show that in a weakly nonlinear regime the regular chain of bubbles becomes longer.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46813/2023-148-080"
    },
    {
        "id": 15096,
        "title": "Supplemental Material for Bayesian Regularization in Multiple-Indicators Multiple-Causes Models",
        "authors": "",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/met0000594.supp"
    },
    {
        "id": 15097,
        "title": "Regularization Trade-offs with Fake Features",
        "authors": "Martin Hellkvist, Avça Özçelikkale, Anders Ahlén",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289928"
    },
    {
        "id": 15098,
        "title": "Complementary Data Regularization for Nonlinear Matrix-Valued Image Denoising",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55463/issn.1674-2974.50.10.8"
    },
    {
        "id": 15099,
        "title": "Semi-NMF Regularization-Based Autoencoder Training for Hyperspectral Unmixing",
        "authors": "Divyam Goel, Saurabh Khanna",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ncc60321.2024.10485752"
    },
    {
        "id": 15100,
        "title": "Gradient Maximization Regularization for Signed Adversarial Attacks",
        "authors": "Deniz Sen",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eleco60389.2023.10415930"
    },
    {
        "id": 15101,
        "title": "Residual norm behavior for Hybrid LSQR regularization",
        "authors": "Eva Havelková, Iveta Hnětynková",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "Hybrid LSQR represents a powerful method for regularization of large-scale discrete inverse problems, where ill-conditioning of the model matrix and ill-posedness of the problem make the solutions seriously sensitive to the unknown noise in the data. Hybrid LSQR combines the iterative Golub-Kahan bidiagonalization with the Tikhonov regularization of the projected problem. While the behavior of the residual norm for the pure LSQR is well understood and can be used to construct a stopping criterion, this is not the case for the hybrid method. Here we analyze the behavior of norms of approximate solutions and the corresponding residuals in Hybrid LSQR with respect to the Tikhonov regularization parameter. This helps to understand convergence properties of the hybrid approach. Numerical experiments demonstrate the results in finite precision arithmetic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21136/panm.2022.07"
    },
    {
        "id": 15102,
        "title": "Entropy Based Regularization Improves Performance in the Forward-Forward Algorithm",
        "authors": "Matteo Pardi, Domenico Tortorella, Alessio Micheli",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14428/esann/2023.es2023-79"
    },
    {
        "id": 15103,
        "title": "Application of data mining to understand some factors that influence student dropout",
        "authors": "Yajaira Lizeth Carrasco Vega, Benjamín David Carril-Verastegui",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "The research aims to identify applying data mining to identify the main factors that influence the dropout of university students in public universities in Latin America. A documentary analysis was carried out to contextualize the problem of student desertion, and relevant antecedents on the subject were presented. The study's main findings identified that socioeconomic problems, institutional conditions, and social and cultural environment situations are the main factors influencing student dropout in public universities in Latin America. Finally, it is possible to affirm that data mining is helpful for different engineering applications that contribute to the attention of social problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47460/athenea.v4i12.53"
    },
    {
        "id": 15104,
        "title": "Understanding and Preventing Suicide",
        "authors": "Dr.Salum Haji Hamisi, Mr. Abdillah Mussa Kitota",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.2023.31267"
    }
]