[
    {
        "id": 17505,
        "title": "The Bias–Variance Tradeoff in Cognitive Science",
        "authors": "Shayan Doroudi, Seyed Ali Rastegar",
        "published": "2023-1",
        "citations": 2,
        "abstract": "AbstractThe bias–variance tradeoff is a theoretical concept that suggests machine learning algorithms are susceptible to two kinds of error, with some algorithms tending to suffer from one more than the other. In this letter, we claim that the bias–variance tradeoff is a general concept that can be applied to human cognition as well, and we discuss implications for research in cognitive science. In particular, we show how various strands of research in cognitive science can be interpreted in light of the bias–variance tradeoff, giving insight into individual differences in learning, the nature of cognitive processes, and debates in cognitive science research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/cogs.13241"
    },
    {
        "id": 17506,
        "title": "Enhanced Balancing of Bias-Variance Tradeoff in Stochastic Estimation: A Minimax Perspective",
        "authors": "Henry Lam, Xinyu Zhang, Xuhui Zhang",
        "published": "2023-11",
        "citations": 1,
        "abstract": " In “Enhanced Balancing of Bias-Variance Tradeoff in Stochastic Estimation: A Minimax Perspective”, the authors study a framework to construct new classes of stochastic estimators that can consistently beat existing benchmarks regardless of key model parameter values. Oftentimes biased estimators, such as finite-difference estimators in black box stochastic gradient estimation, require selection of tuning parameters to balance bias and variance and ultimately minimize overall errors. Unfortunately, this relies on model knowledge that is unknown a priori and thus leads to ad hoc choices in practice. The authors introduce a new notion called asymptotic minimax risk ratio, which is designed to compare new estimators against existing benchmarks, whose values less than one imply that the new estimators could asymptotically outperform the benchmarks regardless of the model parameter value. Based on this, the authors study an outperforming weighting scheme by explicitly analyzing the asymptotic minimax risk ratio via a tractable reformulation of a nonconvex optimization problem. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/opre.2022.2319"
    },
    {
        "id": 17507,
        "title": "Implicit Bias-Term Effect of Bias-Term Free Feed-Forward Network Model can Improve Training Speed",
        "authors": "Namba Munehiro",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdsa59508.2024.10467423"
    },
    {
        "id": 17508,
        "title": "Reduced bias estimation of variance for repeated measurements model",
        "authors": "Hadeel Ismail Mustafa, Abdulhussein Saber AL-Mouel",
        "published": "2024",
        "citations": 0,
        "abstract": "This paper discusses two important points; the first part describes the one-way repeated measurements model, which had two random effects in addition to the random error and two fixed factors. The model was also written as a set of matrices, which showed how the random effects and fixed factors interacted. The second part shows the maximum likelihood method for determining the variance components for a one-way repeated measures model. In this method, it was seen that the estimates of the variance combinations have some bias. The goal of this study is to use the Mean bias reduction method of the one-way repeated measurements model to reduce the bias in the estimators of the variance components.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jsms-1084"
    },
    {
        "id": 17509,
        "title": "Addressing the selection bias in voice assistance: training voice assistance model in python with equal data selection",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58396/cvs020103"
    },
    {
        "id": 17510,
        "title": "Group Bias and the Complexity/Accuracy Tradeoff in Machine Learning-Based Trauma Triage Models",
        "authors": "Katherine Phillips, Katherine Brown, Steve Talbert, Doug Talbert",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Trauma triage occurs in suboptimal environments for making consequential decisions. Published triage studies demonstrate the extremes of the complexity/accuracy tradeoff, either studying simple models with poor accuracy or very complex models with accuracies nearing published goals. Using a Level I Trauma Center’s registry cases (n=50,644), this study describes, uses, and derives observations from a methodology to more thoroughly examine this tradeoff. This or similar methods can provide the insight needed for practitioners to balance understandability with accuracy. Additionally, this study incorporates an evaluation of group-based fairness into this tradeoff analysis to provide an additional dimension of insight into model selection. The experiments allow us to draw several conclusions regarding the machine learning models in the domain of trauma triage and demonstrate the value of our tradeoff analysis to provide insight into choices regarding model complexity, model accuracy, and model fairness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32473/flairs.36.133358"
    },
    {
        "id": 17511,
        "title": "Asymptotic Bias and Variance of Kernel Ridge Regression",
        "authors": "Victor Solo",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096774"
    },
    {
        "id": 17512,
        "title": "Beyond Mean-Variance Markowitz Portfolio Selection: A Comparison of Mean-Variance-Skewness-Kurtosis Model and Robust Mean-Variance Model",
        "authors": "GUBU La, HILMI Muhamad Rashif",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24818/18423264/58.1.24.19"
    },
    {
        "id": 17513,
        "title": "On lower bounds for the bias-variance trade-off",
        "authors": "Alexis Derumigny, Johannes Schmidt-Hieber",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aos2279"
    },
    {
        "id": 17514,
        "title": "On Training Model Bias of Deep Learning based Super-resolution Frameworks for Magnetic Resonance Imaging",
        "authors": "Mamata Shrestha, Nian Wang, Ukash Nakarmi",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bhi58575.2023.10313380"
    },
    {
        "id": 17515,
        "title": "Evidence of a Bias-Variance Trade Off When Correcting for Bias in Sentinel 2 Forest Lai Retrievals Using Radiative Transfer Models",
        "authors": "Richard Fernandes, Najib Djamai, Kate Harvey, Gang Hong, Camryn MacDougall, Hemit Shah, Lixin Sun",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4723337"
    },
    {
        "id": 17516,
        "title": "Variance Compression Bias in Expected Credit Loss Estimates Derived from Stress-Test Macroeconomic Scenarios",
        "authors": "Lawrence forest, Scott D. Aguais",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4778549"
    },
    {
        "id": 17517,
        "title": "RETURN PORTOFOLIO OPTIMAL DENGAN PENDEKATAN SINGLE INDEX MODEL, TREYNOR BLACK MODEL, DAN BLACK-LITTERMAN MODEL",
        "authors": "Adri Arisena, Lienda Noviyanti, Achmad Zanbar Soleh, Fajar Indrayatna",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Membentuk portofolio optimal adalah metode yang dapat membantu para investor meminimalkan risiko dan mengoptimalkan keuntungan. Beberapa model untuk portofolio optimal termasuk Single Index Model (SIM), Treynor Black Model (TBM), dan Black-Litterman Model (BLM). SIM didasarkan pada pengamatan bahwa harga sekuritas berfluktuasi sejalan dengan indeks pasar. Pada TBM, seorang investor dapat melihat bahwa model ini kurang fokus pada nilai beta tetapi lebih berfokus pada risiko tidak sistematis. BLM menggabungkan elemen data historis dan pandangan investor untuk membentuk prediksi baru tentang portofolio sebagai dasar pemodelan. Prediksi pandangan dalam penelitian ini menggunakan pendekatan time series ARIMA dan GARCH. Tujuan dari penelitian ini adalah untuk membentuk tingkat pengembalian portofolio optimal dengan menggunakan SIM, TBM, dan BLM berdasarkan pandangan tunggal investor serta kombinasi pandangan beberapa investor dengan pendekatan ARIMA dan GARCH.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss2page117-130"
    },
    {
        "id": 17518,
        "title": "The Privacy-Bias Tradeoff: Data Minimization and Racial Disparity Assessments in U.S. Government",
        "authors": "Jennifer King, Daniel Ho, Arushi Gupta, Victor Wu, Helen Webley-Brown",
        "published": "2023-6-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3593013.3594015"
    },
    {
        "id": 17519,
        "title": "Visualizing the Implicit Model Selection Tradeoff",
        "authors": "Zezhen He, Yaron Shaposhnik",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "The recent rise of machine learning (ML) has been leveraged by practitioners and researchers to provide new solutions to an ever growing number of business problems. As with other ML applications, these solutions rely on model selection, which is typically achieved by evaluating certain metrics on models separately and selecting the model whose evaluations (i.e., accuracy-related loss and/or certain interpretability measures) are optimal. However, empirical evidence suggests that, in practice, multiple models often attain competitive results. Therefore, while models’ overall performance could be similar, they could operate quite differently. This results in an implicit tradeoff in models’ performance throughout the feature space which resolving requires new model selection tools.\nThis paper explores methods for comparing predictive models in an interpretable manner to uncover the tradeoff and help resolve it. To this end, we propose various methods that synthesize ideas from supervised learning, unsupervised learning, dimensionality reduction, and visualization to demonstrate how they can be used to inform model developers about the model selection process. Using various datasets and a simple Python interface, we demonstrate how practitioners and researchers could benefit from applying these approaches to better understand the broader impact of their model selection choices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1613/jair.1.13764"
    },
    {
        "id": 17520,
        "title": "Bias correction for inverse variance weighting Mendelian randomization",
        "authors": "Ninon Mounier, Zoltán Kutalik",
        "published": "2023-6",
        "citations": 50,
        "abstract": "AbstractInverse‐variance weighted two‐sample Mendelian randomization (IVW‐MR) is the most widely used approach that utilizes genome‐wide association studies (GWAS) summary statistics to infer the existence and the strength of the causal effect between an exposure and an outcome. Estimates from this approach can be subject to different biases due to the use of weak instruments and winner's curse, which can change as a function of the overlap between the exposure and outcome samples. We developed a method (MRlap) that simultaneously considers weak instrument bias and winner's curse while accounting for potential sample overlap. Assuming spike‐and‐slab genomic architecture and leveraging linkage disequilibrium score regression and other techniques, we could analytically derive, reliably estimate, and hence correct for the bias of IVW‐MR using association summary statistics only. We tested our approach using simulated data for a wide range of realistic settings. In all the explored scenarios, our correction reduced the bias, in some situations by as much as 30‐fold. In addition, our results are consistent with the fact that the strength of the biases will decrease as the sample size increases and we also showed that the overall bias is also dependent on the genetic architecture of the exposure, and traits with low heritability and/or high polygenicity are more strongly affected. Applying MRlap to obesity‐related exposures revealed statistically significant differences between IVW‐based and corrected effects, both for nonoverlapping and fully overlapping samples. Our method not only reduces bias in causal effect estimation but also enables the use of much larger GWAS sample sizes, by allowing for potentially overlapping samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/gepi.22522"
    },
    {
        "id": 17521,
        "title": "Optimizing Complex Ensembles: Automatic Bias-Variance Tuning with SVM-Based Learners",
        "authors": "Amir Hussein Ataei Monfared, Sheedeh Sharif-Bakhtiar",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp61396.2024.10475226"
    },
    {
        "id": 17522,
        "title": "On Informative Bayesian Multilevel Model Priors for Variance Components",
        "authors": "Liu Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2018946"
    },
    {
        "id": 17523,
        "title": "A variance-upscaling quantile mapping method for gridded precipitation bias correction",
        "authors": "Jiapei Ma, Genxu Wang, Hongyi Li",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jhydrol.2024.130959"
    },
    {
        "id": 17524,
        "title": "On Lightner &amp; Hagen’s Bias/Variance Intellectualism in the Theory of Religion",
        "authors": "Martin Stehberger",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1163/15685373-12340184"
    },
    {
        "id": 17525,
        "title": "Bias and Variance in Multiparty Election Polls",
        "authors": "Peter Selb, Sina Chen, John Körtner, Philipp Bosch",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "Abstract\nRecent polling failures highlight that election polls are prone to biases that the margin of error customarily reported with polls does not capture. However, such systematic errors are difficult to assess against the background noise of sampling variance. Shirani-Mehr et al. (2018) developed a hierarchical Bayesian model to disentangle random and systematic errors in poll estimates of two-party vote shares at the election level. The method can inform realistic assessments of poll accuracy. We adapt the model to multiparty elections and improve its temporal flexibility. We then estimate bias and variance in 5,240 German national election polls, 1994–2021. Our analysis suggests that the average absolute election-day bias per party was about 1.5 percentage points, ranging from 0.9 for the Greens to 3.2 for the Christian Democrats. The estimated variance is, on average, about twice as large as that implied by usual margins of error. We find little evidence of house or mode effects. Common biases indicate industry effects due to similar methodological problems. The Supplementary Material provides additional results for 1,751 regional election polls.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/poq/nfad046"
    },
    {
        "id": 17526,
        "title": "Mind Over Prejudice: An Implicit Bias Training in Medical Education Using Cognitive Bias Modification",
        "authors": "Che-Wei Hsu",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4300/jgme-d-23-00146.1"
    },
    {
        "id": 17527,
        "title": "MODEL REGRESI DATA PANEL PADA TINGKAT KRIMINALITAS DI PROVINSI NUSA TENGGARA BARAT DENGAN MENGGUNAKAN FIXED EFFECT MODEL",
        "authors": "Nurwahyuni Indah Nurwahyuni, Zulhan Widya Baskara, Nur Asmita Purnamasari",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nKriminalitas merupakan salah satu permasalahan yang banyak terjadi dilingkungan masyarakat. Pada tahun 2020, Nusa Tenggara Barat menempati posisi kedelapan dengan jumlah kejahatan terbanyak di Indonesia. Agar angka kriminalitas tidak mengalami kenaikan maka perlu diketahui faktor-faktor yang mempengaruhinya. Dalam penelitian ini, faktor yang digunakan yaitu tingkat pengangguran, pendidikan dan jumlah penduduk di sepuluh kabupaten/kota di Nusa Tenggara Barat pada tahun 2016-2020. Penelitian ini bertujuan untuk mengetahui model regresi data panel dan bagaimana pengaruh faktor tingkat pengangguran, tingkat pendidikan dan jumlah penduduk terhadap angka kriminalitas. Metode analisis yang digunakan adalah Fixed Effect Model dengan pendekatan Least Square Dummy Variable (LSDV). Faktor pengangguran dan tingkat pendidikan memiliki pengaruh yang tidak signifikan terhadap angka kriminalitas. Sedangkan faktor jumlah penduduk berpengaruh signifikan terhadap angka kriminalitas.\r\nKata Kunci:  Fixed Effect Model, jumlah penduduk, kriminalitas, Least Square Dummy Variable (LSDV), pengangguran, tingkat pendidikan.\r\n\r\n\r\n\r\n\r\nAbstract: Crime is one of the most common problems in society. In 2020, West Nusa Tenggara occupies the eighth position with the highest number of crimes in Indonesia. So that the crime rate does not increase, it is necessary to know the factors that influence it. In this study, the factors used were unemployment rate, education and population in ten districts cities in West Nusa Tenggara in 2016-2020. This study aims to determine the panel data regression model and how factors influence the unemployment rate, education level and population on crime rates. The analytical method used is the Fixed Effect Model with the Least Square Dummy Variable (LSDV) approach. Unemployment and education level factors have no significant effect on the crime rate. While the population factor has a significant effect on the crime rate.\r\nKeywords: Fixed Effect Model, Least Square Dummy Variable (LSDV), crime, unemployment, education level, population.\r\n\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss2page169-184"
    },
    {
        "id": 17528,
        "title": "Evidence of a bias-variance trade off when correcting for bias in Sentinel 2 forest LAI retrievals using radiative transfer models",
        "authors": "Richard Fernandes, Najib Djamai, Kate Harvey, Gang Hong, Camryn MacDougall, Hemit Shah, Lixin Sun",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rse.2024.114060"
    },
    {
        "id": 17529,
        "title": "MODEL GABUNGAN (ANSAMBEL) SARIMA DAN JARINGAN SARAF TIRUAN UNTUK PERAMALAN BEBAN LISTRIK",
        "authors": "Mega Silfiani",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "This study aims to investigate the efficacy of employing artificial neural networks in conjunction with a seasonal autoregressive integrated moving average (SARIMA) ensemble for forecasting electrical load. The SARIMA ensemble comprises members generated by varying autoregressive orders or moving averages. Subsequently, these SARIMA ensemble members are integrated using artificial neural networks. The datasets encompass monthly electrical load data pertaining to households, businesses, industries, and the public, spanning from January 2016 to December 2020. The findings demonstrate that across various categories, SARIMA ensemble-based artificial neural networks demonstrated superior predictive performance compared to alternative models. Future research endeavors should focus on exploring diverse methodologies for both creating and amalgamating ensemble members.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss2page193-200"
    },
    {
        "id": 17530,
        "title": "Multi-Task Bias-Variance Trade-Off Through Functional Constraints",
        "authors": "Juan Cerviño, Juan Andrés Bazerque, Miguel Calvo-Fullana, Alejandro Ribeiro",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094811"
    },
    {
        "id": 17531,
        "title": "Stochastic zeroth-order gradient and Hessian estimators: variance reduction and refined bias bounds",
        "authors": "Yasong Feng, Tianyu Wang",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Abstract\nWe study stochastic zeroth-order gradient and Hessian estimators for real-valued functions in $\\mathbb{R}^n$. We show that, via taking finite difference along random orthogonal directions, the variance of the stochastic finite difference estimators can be significantly reduced. In particular, we design estimators for smooth functions such that, if one uses $ \\varTheta \\left ( k \\right ) $ random directions sampled from the Stiefel manifold $ \\text{St} (n,k) $ and finite-difference granularity $\\delta $, the variance of the gradient estimator is bounded by $ \\mathscr{O} \\left ( \\left ( \\frac{n}{k} - 1 \\right ) + \\left ( \\frac{n^2}{k} - n \\right ) \\delta ^2 + \\frac{ n^2 \\delta ^4} { k } \\right ) $, and the variance of the Hessian estimator is bounded by $\\mathscr{O} \\left ( \\left ( \\frac{n^2}{k^2} - 1 \\right ) + \\left ( \\frac{n^4}{k^2} - n^2 \\right ) \\delta ^2 + \\frac{n^4 \\delta ^4 }{k^2} \\right ) $. When $k = n$, the variances become negligibly small. In addition, we provide improved bias bounds for the estimators. The bias of both gradient and Hessian estimators for smooth function $f$ is of order $\\mathscr{O} \\big( \\delta ^2 \\varGamma \\big )$, where $\\delta $ is the finite-difference granularity, and $ \\varGamma $ depends on high-order derivatives of $f$. Our results are evidenced by empirical observations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/imaiai/iaad014"
    },
    {
        "id": 17532,
        "title": "Prior-Guided Accuracy-Bias Tradeoff Learning for CTR Prediction in Multimedia Recommendation",
        "authors": "Dugang Liu, Yang Qiao, Xing Tang, Liang Chen, Xiuqiang He, Zhong Ming",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3613801"
    },
    {
        "id": 17533,
        "title": "Mitigating the Tradeoff between Pest Management and Pollination: A Bioeconomic Model",
        "authors": "Linghui Wu, Shady S. Atallah, Christian Krupke, Laura Ingwell",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4601766"
    },
    {
        "id": 17534,
        "title": "SPATIAL ERROR MODEL PADA TINGKAT KEMISKINAN KABUPATEN/KOTA  DI PROVINSI LAMPUNG",
        "authors": "Nurjanah Nurjanah, Achi Rinaldi, Rizka Putri",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "Pembangunan ekonomi ialah salah satu tujuan utama negara-negara berkembang, saat ini Indonesia menghadapi masalah yang sulit dipecahkan yaitu kemiskinan. Menurut laporan Badan Pusat Statistik (BPS), Provinsi Lampung menempati posisi ke-14 termiskin di Indonesia dan menduduki posisi ke-3 se-Sumatera. Maka, diperlukan analisis yang tepat untuk melihat permasalahan tersebut secara kewilayahannya, analisis yang digunakan analisis regresi spasial. Model regresi spasial yang memiliki efek spasial pada eror adalah Spatial Error Model (SEM). Data yang digunakan data tingkat Pengangguran dan kemiskinan di Provinsi Lampung tahun 2022. Tujuan penelitian ini yaitu mengetahui bentuk pemodelan spatial error model dan mengetahui faktor suatu variable Pengangguran yang  mempengaruhi tingkat kemiskinan. Hal tersebut diperkuat oleh hasil uji Indeks Moran menunjukkan adanya efek dependensi spasial. Berdasarkan uji Lagrange Multiplier, depedensi spasial terjadi pada error. Hasil pengujian menunjukan  bahwa tingkat pengangguran berpengaruh pada tingkat kemiskinan setiap Kabupaten/Kota di Provinsi Lampung.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss1page47-54"
    },
    {
        "id": 17535,
        "title": "MODEL AUTOREGRESSIVE INTEGRATED MOVING AVERAGE (ARIMA) UNTUK MERAMALKAN INFLASI INDONESIA",
        "authors": "Yonlib Weldri Arnold Nanlohy, Samsul Bahri Loklomin",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Inflasi merupakan kondisi perekonomian suatu negara dimana terjadi peningkatan harga barang dan jasa secara terus menerus dalam jangka waktu tertentu. Akibat dari inflasi pengeluaran masyarakat dalam memenuhi kebutuhan pokok semakin meningkat. Permasalahan inflasi harus dapat dikendalikan untuk menjaga stabilitas perekonomian negara. Oleh karena itu perlu adanya perkiraan atau peramalan mengenai tingkat Inflasi Indonesia. Salah satu metode yang dapat digunakan untuk peramalan inflasi Indonesia yaitu metode Autoregressive Integrated Moving Average (ARIMA). Metode ARIMA merupakan suatu metode peramalan berdasarkan pola data secara historis. Hasil analisis diperoleh model ARIMA (2,1,2) untuk peramalan inflasi di Indonesia dengan nilai RMSE hasil peramalan data out-sample untuk jangka waktu 7 periode ke depan adalah 1,826864  sehingga model ARIMA (2,1,2) dapat digunakan sebagai model peramalan inflasi di Indonesia..",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss2page201-208"
    },
    {
        "id": 17536,
        "title": "Fighting Bias With Bias: Promoting Model Robustness by Amplifying Dataset Biases",
        "authors": "Yuval Reif, Roy Schwartz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.833"
    },
    {
        "id": 17537,
        "title": "Bayesian classification learning framework based on bias&amp;ndash;variance trade-off",
        "authors": "文钧 张, 良孝 蒋, 欢 张, 成玉 胡",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1360/ssi-2022-0025"
    },
    {
        "id": 17538,
        "title": "Minimum-variance-based outlier detection method using forward-search model error in geodetic networks",
        "authors": "Utkan M. Durdağ",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "Abstract. Geodetic observations are crucial for monitoring landslides, crustal movements, and volcanic activity. They are often integrated with data from interdisciplinary studies, including paleo-seismological, geological, and interferometric synthetic aperture radar observations, to analyze earthquake hazards. However, outliers in geodetic observations can significantly impact the accuracy of estimation results if not reliably identified. Therefore, assessing the outlier detection model's reliability is imperative to ensure accurate interpretations. Conventional and robust methods are based on the additive bias model, which may cause type-I and type-II errors. However, outliers can be regarded as additional unknown parameters in the Gauss–Markov model. It is based on modeling the outliers as unknown parameters, considering as many combinations as possible of outliers selected from the observation set. In addition, this method is expected to be more effective than conventional methods as it is based on the principle of minimal variance and eliminates the interdependence of decisions made in iterations. The primary purpose of this study is to seek an efficient outlier detection model in the geodetic networks. The efficiency of the proposed model was measured and compared with the robust and conventional methods by the mean success rate (MSR) indicator of different types and magnitudes of outliers. Thereby, this model enhances the MSR by almost 40 %–45 % compared to the Baarda and Danish (with the variance unknown case) method for multiple outliers. Besides, the proposed model is 20 %–30 % more successful than the others in the low-controllability observations of the leveling network.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/gmd-17-2187-2024"
    },
    {
        "id": 17539,
        "title": "On the bias in the AUC variance estimate",
        "authors": "Jingyan Xu",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patrec.2023.12.012"
    },
    {
        "id": 17540,
        "title": "The Privacy Paradox and Optimal Bias–Variance Trade-offs in Data Acquisition",
        "authors": "Guocheng Liao, Yu Su, Juba Ziani, Adam Wierman, Jianwei Huang",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": " Whereas users claim to be concerned about privacy, often they do little to protect their privacy in their online actions. One prominent explanation for this privacy paradox is that, when an individual shares data, it is not just the individual’s privacy that is compromised; the privacy of other individuals with correlated data is also compromised. This information leakage encourages oversharing of data and significantly impacts the incentives of individuals in online platforms. In this paper, we study the design of mechanisms for data acquisition in settings with information leakage and verifiable data. We design an incentive-compatible mechanism that optimizes the worst case trade-off between bias and variance of the estimation subject to a budget constraint, with which the worst case is over the unknown correlation between costs and data. Additionally, we characterize the structure of the optimal mechanism in closed form and study monotonicity and nonmonotonicity properties of the marketplace.  Funding: This work is supported by the National Natural Science Foundation of China [Grants 62202512 and 62271434], Shenzhen Science and Technology Program [Grant JCYJ20210324120011032], Guangdong Basic and Applied Basic Research Foundation [Grant 2021B1515120008], Shenzhen Key Laboratory of Crowd Intelligence Empowered Low-Carbon Energy Network [Grant ZDSYS20220606100601002], and the Shenzhen Institute of Artificial Intelligence and Robotics for Society. This work is also supported by the National Science Foundation [Grants CNS-2146814, CPS-2136197, CNS-2106403, and NGSDI-2105648].  Supplemental Material: The online appendix is available at https://doi.org/10.1287/moor.2023.0022 . ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/moor.2023.0022"
    },
    {
        "id": 17541,
        "title": "Bias variance Toeplitz Matrix based Shift Invariance classifier for building detection from satellite images",
        "authors": "S. Kokila, A. Jayachandran",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rsase.2022.100881"
    },
    {
        "id": 17542,
        "title": "Training teachers to eliminate gender bias in education",
        "authors": "I. P. Nikitina, T. V. Ishchenko",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30525/978-9934-26-403-0-23"
    },
    {
        "id": 17543,
        "title": "Reprogrammable-FL: Improving Utility-Privacy Tradeoff in Federated Learning via Model Reprogramming",
        "authors": "Huzaifa Arif, Alex Gittens, Pin-Yu Chen",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/satml54575.2023.00022"
    },
    {
        "id": 17544,
        "title": "Interpretable linear dimensionality reduction based on bias-variance analysis",
        "authors": "Paolo Bonetti, Alberto Maria Metelli, Marcello Restelli",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "AbstractOne of the central issues of several machine learning applications on real data is the choice of the input features. Ideally, the designer should select a small number of the relevant, nonredundant features to preserve the complete information contained in the original dataset, with little collinearity among features. This procedure helps mitigate problems like overfitting and the curse of dimensionality, which arise when dealing with high-dimensional problems. On the other hand, it is not desirable to simply discard some features, since they may still contain information that can be exploited to improve results. Instead, dimensionality reduction techniques are designed to limit the number of features in a dataset by projecting them into a lower dimensional space, possibly considering all the original features. However, the projected features resulting from the application of dimensionality reduction techniques are usually difficult to interpret. In this paper, we seek to design a principled dimensionality reduction approach that maintains the interpretability of the resulting features. Specifically, we propose a bias-variance analysis for linear models and we leverage these theoretical results to design an algorithm, Linear Correlated Features Aggregation (LinCFA), which aggregates groups of continuous features with their average if their correlation is “sufficiently large”. In this way, all features are considered, the dimensionality is reduced and the interpretability is preserved. Finally, we provide numerical validations of the proposed algorithm both on synthetic datasets to confirm the theoretical results and on real datasets to show some promising applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10618-024-01015-0"
    },
    {
        "id": 17545,
        "title": "Supplemental Material for A Unified Explanation of Variability and Bias in Human Probability Judgments: How Computational Noise Explains the Mean–Variance Signature",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/xge0001414.supp"
    },
    {
        "id": 17546,
        "title": "Evolution of Random Forest from Decision Tree and Bagging: A Bias-Variance Perspective",
        "authors": "Muhammad Ibrahim",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "The ensemble methods are one of the most heavily used techniques in machine learning. The random forest arguably spearheads this army of learners. Being sprung from the decision tree in the late 90s, the benefits of a random forest have rightfully attracted practitioners to widely and successfully apply this powerful yet simple-to-understand technique to numerous applications. In this study we explain the evolution of a random forest from a decision tree in the context of bias and variance of learning theory. While doing so, we focus on the interplay between the correlation and generalization error of the random forest. This analysis is expected to enrich the literature of random forests by providing further insight into its working mechanism. These insights will assist the practitioners of the random forest implement this algorithm more wisely and in an informed way.\nDUJASE Vol. 7(1) 67-71, 2022 (January)",
        "keywords": "",
        "link": "http://dx.doi.org/10.3329/dujase.v7i1.62888"
    },
    {
        "id": 17547,
        "title": "Bias, Variance, and Threshold Level of the Least Squares Pitch Estimator with Windowed Data",
        "authors": "Jonas Lindenberger, Stefan Schuster, Oliver Lang, Alexander Haberl, Clemens Staudinger, Theresa Roland, Mario Huemer",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf59524.2023.10476910"
    },
    {
        "id": 17548,
        "title": "PEMODELAN INDEKS PEMBANGUNAN MANUSIA DI PROVINSI MALUKU DAN MALUKU UTARA DENGAN MENGGUNAKAN SPATIAL AUTOREGRESSIVE MODEL (SAR)",
        "authors": "Ronald John Djami, Gabriella Haumahu",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "Indeks Pembangunan Manusia (IPM) di suatu wilayah dipengaruhi oleh IPM di wilayah lain yang berdekatan. Hal ini berdasarkan pada hukum Tobler yang berbunyi “segala sesuatu berhubungan dengan lainnya, tetapi hal-hal yang lebih dekat lebih terkait daripada hal-hal yang jauh. Wilayah yang lokasinya berdekatan mempunyai hubungan yang lebih tinggi daripada lokasi yang lokasinya jauh. Analisis mengenai faktor-faktor yang mempengaruhi IPM dapat dilakukan melalui regresi linier klasik. Tetapi, apabila sudah memperhitungkan lokasi, analisis regresi spasial merupakan metode yang lebih sesuai untuk digunakan. Regresi spasial merupakan pengembangan dari regresi linier klasik yang didasarkan pada adanya pengaruh lokasi pada data yang dianalisis. Spatial autoregressive (SAR) merupakan salah satu pemodelan spasial yang berkaitan dengan pendekatan area. Model SAR merupakan model yang tepat untuk pemodelan Indeks Pembangunan Manusia di Provinsi Maluku dan Maluku Utara dengan menggunakan pembobot Queen Contiguity. Berdasarkan estimasi parameter SAR terdapat empat variabel perdiktor signifikan mempengaruhi indeks pembangunan manusia yaitu variabel Harapan Lama Sekolah , Rata-rata Lama Sekolah  , Umur Harapan Hidup Saat Lahir  dan Pengeluran Perkapita  dengan modelnya adalah .",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/variancevol5iss1page37-46"
    },
    {
        "id": 17549,
        "title": "Review of “The Faithful Scientist: Experiences of Anti-Religious Bias in Scientific Training”",
        "authors": "Nancy T Ammerman",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/sf/soae039"
    },
    {
        "id": 17550,
        "title": "Unpacking the Bias Challenges of Deep Learning in Clinical Applications: A Critical Explorer of the Impact of Training",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56831/psen-03-084"
    },
    {
        "id": 17551,
        "title": "Computing bias and variance for Pacific sardine (Sardinops sagax) biomass estimated from aerial surveys in California nearshore waters",
        "authors": "Emmanis Dorval, Kirk Lynn, Dianna Porzio, Trung Nguyen, Katie Grady",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.fishres.2024.106999"
    },
    {
        "id": 17552,
        "title": "Estimation of the hazard rate function with a reduction of bias and variance at the boundary",
        "authors": "Bożena Janiszewska, Roman Różański",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7151/dmps.1058"
    },
    {
        "id": 17553,
        "title": "Adaptive bias-variance trade-off in advantage estimator for actor–critic algorithms",
        "authors": "Yurou Chen, Fengyi Zhang, Zhiyong Liu",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.023"
    },
    {
        "id": 17554,
        "title": "Solving Time-Cost Tradeoff Problem with Resource Constraint Using Fuzzy Mathematical Model",
        "authors": "Sosan M. Rashed, Ahmed M. R. Mahjoob",
        "published": "2023-7-9",
        "citations": 2,
        "abstract": "Scheduling considered being one of the most fundamental and essential bases of the project management. Several methods are used for project scheduling such as CPM, PERT and GERT. Since too many uncertainties are involved in methods for estimating the duration and cost of activities, these methods lack the capability of modeling practical projects. Although schedules can be developed for construction projects at early stage, there is always a possibility for unexpected material or technical shortages during construction stage. The objective of this research is to build a fuzzy mathematical model including time cost tradeoff and resource constraints analysis to be applied concurrently. The proposed model has been formulated using fuzzy theory combining CPM computations, time-cost trade off analysis and resource constraint. MATLAB software has been adopted to perform ranking process, for each case, that facilitates obtaining the optimum solution. This research infers that it is possible to perform time-cost trade off analysis with resource restriction simultaneously, which ensures achieving scheduling optimum solution reducing the effort and the time when performing these techniques in succession using traditional methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31026/j.eng.2014.09.02"
    },
    {
        "id": 17555,
        "title": "Two-Stage Fine-Tuning for Improved Bias and Variance for Large Pretrained Language Models",
        "authors": "Lijing Wang, Yingya Li, Timothy Miller, Steven Bethard, Guergana Savova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.877"
    },
    {
        "id": 17556,
        "title": "Compromise policy for multi-stage stochastic linear programming: Variance and bias reduction",
        "authors": "Jiajun Xu, Suvrajeet Sen",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cor.2022.106132"
    },
    {
        "id": 17557,
        "title": "Impact of In-Service Implicit Bias Training: A Study of Attitudinal Changes and Intention to Apply Anti-Bias Techniques",
        "authors": "Tammy R. Kochel, Seyvan Nouri",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": " Research points to implicit bias as one factor driving racial disparities in enforcement activities. Addressing implicit bias is essential to promote equity and integrity in policing and to building trust and legitimacy in communities, according to the President’s Task Force on 21st Century Policing. However, investigations into the efficacy of implicit bias training for police are sparse. This study evaluates in-service implicit bias training, examining the impact on trainees’ knowledge, attitudes, and self-professed likelihood of applying antibias strategies to mitigate the effects of implicit bias. We found significant improvements to officers’ knowledge of how implicit bias works and its consequences, an increased attribution to procedural justice, and officers reported being more likely, following the training, to apply strategies to reduce the effects of implicit bias during encounters with public. Results benefit police departments that seek to reduce unconscious prejudice, ensure impartiality and equity, and develop better relations with minority communities. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/10986111241237512"
    },
    {
        "id": 17558,
        "title": "Setting Gendered Expectations? Recruiter Outreach Bias in Online Tech Training Programs",
        "authors": "Jacqueline N. Lane, Karim R. Lakhani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4444303"
    },
    {
        "id": 17559,
        "title": "Does it work? Implicit bias training for postgraduate program directors",
        "authors": "Jackie Gruber, Amanda Condon",
        "published": "2023-7-31",
        "citations": 1,
        "abstract": "Implication Statement\nOne element to address health disparities and historical injustices of systemically excluded groups is to examine selection processes. Implicit association testing for selection committees is suggested as one intervention to address bias in selection and is used for Undergraduate Medical Education at the University of Manitoba.  Our study demonstrated that implicit bias training for PDs in isolation has minimal impact on addressing bias within resident selection. This training must occur as part of a systemic institutional approach to address bias in resident selection. Programs should consider a multipronged and sustained approach when committing to diversifying postgraduate medical education programs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36834/cmej.75861"
    },
    {
        "id": 17560,
        "title": "Pre-Training on High-Quality Natural Image Data Reduces DCNN Texture Bias",
        "authors": "Niklas Müller, Iris Groen, Steven Scholte",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1294-0"
    },
    {
        "id": 17561,
        "title": "Deep Learning, Feature Selection and Model Bias with Home Mortgage Loan Classification",
        "authors": "Hope Hodges, J. Connell, Carolyn Garrity, James Pope",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012326800003654"
    },
    {
        "id": 17562,
        "title": "Inter-Rater Agreement in Assessing Risk of Bias in Melanoma Prediction Studies Using the Prediction Model Risk of Bias Assessment Tool (PROBAST): Results from a Controlled Experiment on the Effect of Specific Rater Training",
        "authors": "Isabelle Kaiser, Annette B. Pfahlberg, Sonja Mathes, Wolfgang Uter, Katharina Diehl, Theresa Steeb, Markus V. Heppt, Olaf Gefeller",
        "published": "2023-3-2",
        "citations": 3,
        "abstract": "Assessing the risk of bias (ROB) of studies is an important part of the conduct of systematic reviews and meta-analyses in clinical medicine. Among the many existing ROB tools, the Prediction Model Risk of Bias Assessment Tool (PROBAST) is a rather new instrument specifically designed to assess the ROB of prediction studies. In our study we analyzed the inter-rater reliability (IRR) of PROBAST and the effect of specialized training on the IRR. Six raters independently assessed the risk of bias (ROB) of all melanoma risk prediction studies published until 2021 (n = 42) using the PROBAST instrument. The raters evaluated the ROB of the first 20 studies without any guidance other than the published PROBAST literature. The remaining 22 studies were assessed after receiving customized training and guidance. Gwet’s AC1 was used as the primary measure to quantify the pairwise and multi-rater IRR. Depending on the PROBAST domain, results before training showed a slight to moderate IRR (multi-rater AC1 ranging from 0.071 to 0.535). After training, the multi-rater AC1 ranged from 0.294 to 0.780 with a significant improvement for the overall ROB rating and two of the four domains. The largest net gain was achieved in the overall ROB rating (difference in multi-rater AC1: 0.405, 95%-CI 0.149–0.630). In conclusion, without targeted guidance, the IRR of PROBAST is low, questioning its use as an appropriate ROB instrument for prediction studies. Intensive training and guidance manuals with context-specific decision rules are needed to correctly apply and interpret the PROBAST instrument and to ensure consistency of ROB ratings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jcm12051976"
    },
    {
        "id": 17563,
        "title": "Simulation of annealing for portfolio selection in mean-pseudo-variance fuzzy model",
        "authors": "Farbod Dehghani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4660934"
    },
    {
        "id": 17564,
        "title": "I have a dream: Altering medical students’ ethnic bias towards Indigenous population (NZ Māori) using a digital training called cognitive bias modification.",
        "authors": "Che-Wei Hsu, Zaine Akuhata-Huntington",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/sah0000505"
    },
    {
        "id": 17565,
        "title": "Missing in Action: Where’s the Unconscious in Anti-Racist “Unconscious Bias Training”?",
        "authors": "Ilan Kapoor, Sheila L. Cavanagh",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "This article carries out a psychoanalytic and political critique of recent attempts at fighting racism, focusing on antiracist “unconscious bias training” at universities and in international development. It claims that these regimes of institutional training depend on knowledge- and awareness-based education of university staff and international cooperants, thereby not only negating the significant psychoanalytic dimensions of racism, but also disavowing any meaningful or collective engagement precisely with the unconscious. The political consequence is the treatment of racism as both symptom and individualized responsibility, thereby depoliticizing the struggle against global/structural racism. The article concludes by considering what a psychoanalytic antiracist politics might look like.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/h13010018"
    },
    {
        "id": 17566,
        "title": "The Impact of an Interactive Unconscious Bias Training on Perioperative Learners",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46374/volxxvi_issue1_ehie"
    },
    {
        "id": 17567,
        "title": "Application of Mean-Variance Model in the U.S. Capital Market",
        "authors": "Qinyuan Luo",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "Portfolio in stock market is an asset that people buy in the hopes of a return or appreciation, or both. Portfolio investment is not active, unlike direct investment, which means managing it by alone. A portfolio can help people spread risk and decrease risk, because it can minimize the negative impact of the economy. This paper analyzes asset allocation for four different companies. In this paper, three methods of mean-variance analysis, CAPM and FF3F model are used to optimize the portfolio. In addition, this paper will calculate different weights to analyze the maximum return of the portfolio. The results show that in the FF3F model. In the Sharpe ratio portfolio, \"POAHY\" is the security with the most weight. The portfolio with the highest Sharpe ratio weight in CAPM model is \"POAHY\". The outcome in this paper benefits the related investors in financial markets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.3851"
    },
    {
        "id": 17568,
        "title": "No Tradeoff between Coherence and Sub-Poissonianity for Heisenberg-Limited Lasers",
        "authors": "L. A. Ostrowski, T. J. Baker, S. N. Saadatmand, H. M. Wiseman",
        "published": "2023-5-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevlett.130.183602"
    },
    {
        "id": 17569,
        "title": "Reinforced Sequence Training based Subjective Bias Correction",
        "authors": "Karthic Madanagopal, James Caverlee",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.189"
    },
    {
        "id": 17570,
        "title": "Strides in Racial Bias Training—A Step Closer to Health Equity",
        "authors": "Monique Jindal, Nao Hagiwara",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1001/jamanetworkopen.2024.2164"
    },
    {
        "id": 17571,
        "title": "A Recursive Distributed Linear Bias Model",
        "authors": "Mark Levedahl, John D. Glass, Patrick Powers",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115869"
    },
    {
        "id": 17572,
        "title": "When bias contributes to variance: True limit theory in functional coefficient cointegrating regression",
        "authors": "Peter C.B. Phillips, Ying Wang",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jeconom.2021.09.007"
    },
    {
        "id": 17573,
        "title": "Bias and variance reduction of high return levels for extreme hazard modelling",
        "authors": "Chi-Hsiang Wang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractMany existing extremal data span only a few decades that result in large uncertainty in the estimated shape parameter of the extreme hazard model. This in turn leads to potentially large bias and variance of extrapolated extreme values at high return levels. This paper illustrates a statistical method that helps obtain hazard models that produce estimates at high return levels with reduced bias and variance. This method makes use of the maximum recorded values of extremal data that are independently recorded from a number of observational sites or generated by heterogeneous mechanisms. The logarithmically transformed average recurrence interval of the maximum recorded value at a site is shown to follow the Gumbel (Type I extreme value) distribution; therefore, multiple, say $$m$$\nm\n, observational sites provide a sample of size $$m$$\nm\n log-transformed average recurrence intervals, each from a distinct site. The sample can be treated as a sample from a Gumbel distribution, irrespective of the underlying hazard-generating mechanisms or the statistical hazard models. Application of the method is illustrated by analysis of the extreme wind gust data from automatic weather stations in South Australia and shown to lead to significant reduction of 2.9 m/s in potential bias of the mean and a reduction of 98.1% in variance of the 500-year gust speed at Adelaide Airport. The results are compared to the specifications in the Australian standard AS/NZS 1170.2:2021 and indicate that the standard may have overestimated the wind gust hazard; hence, the specified design wind speeds may fall on the conservative side for South Australia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11069-023-06286-2"
    },
    {
        "id": 17574,
        "title": "To have value, comparisons of high-throughput phenotyping methods need statistical tests of bias and variance",
        "authors": "Justin M. McGrath, Matthew H. Siebers, Peng Fu, Stephen P. Long, Carl J. Bernacchi",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "The gap between genomics and phenomics is narrowing. The rate at which it is narrowing, however, is being slowed by improper statistical comparison of methods. Quantification using Pearson’s correlation coefficient (r) is commonly used to assess method quality, but it is an often misleading statistic for this purpose as it is unable to provide information about the relative quality of two methods. Using r can both erroneously discount methods that are inherently more precise and validate methods that are less accurate. These errors occur because of logical flaws inherent in the use of r when comparing methods, not as a problem of limited sample size or the unavoidable possibility of a type I error. A popular alternative to using r is to measure the limits of agreement (LOA). However both r and LOA fail to identify which instrument is more or less variable than the other and can lead to incorrect conclusions about method quality. An alternative approach, comparing variances of methods, requires repeated measurements of the same subject, but avoids incorrect conclusions. Variance comparison is arguably the most important component of method validation and, thus, when repeated measurements are possible, variance comparison provides considerable value to these studies. Statistical tests to compare variances presented here are well established, easy to interpret and ubiquitously available. The widespread use of r has potentially led to numerous incorrect conclusions about method quality, hampering development, and the approach described here would be useful to advance high throughput phenotyping methods but can also extend into any branch of science. The adoption of the statistical techniques outlined in this paper will help speed the adoption of new high throughput phenotyping techniques by indicating when one should reject a new method, outright replace an old method or conditionally use a new method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpls.2023.1325221"
    },
    {
        "id": 17575,
        "title": "Fluctuations, bias, variance and ensemble of learners: exact asymptotics for convex losses in high-dimension\n                  <sup>*</sup>",
        "authors": "Bruno Loureiro, Cédric Gerbelot, Maria Refinetti, Gabriele Sicuro, Florent Krzakala",
        "published": "2023-11-1",
        "citations": 1,
        "abstract": "Abstract\nFrom the sampling of data to the initialisation of parameters, randomness is ubiquitous in modern Machine Learning practice. Understanding the statistical fluctuations engendered by the different sources of randomness in prediction is therefore key to understanding robust generalisation. In this manuscript we develop a quantitative and rigorous theory for the study of fluctuations in an ensemble of generalised linear models trained on different, but correlated, features in high-dimensions. In particular, we provide a complete description of the asymptotic joint distribution of the empirical risk minimiser for generic convex loss and regularisation in the high-dimensional limit. Our result encompasses a rich set of classification and regression tasks, such as the lazy regime of overparametrised neural networks, or equivalently the random features approximation of kernels. While allowing to study directly the mitigating effect of ensembling (or bagging) on the bias-variance decomposition of the test error, our analysis also helps disentangle the contribution of statistical fluctuations, and the singular role played by the interpolation threshold that are at the roots of the ‘double-descent’ phenomenon.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-5468/ad0221"
    },
    {
        "id": 17576,
        "title": "Does the Fairness of Your Pre-Training Hold Up? Examining the Influence of Pre-Training Techniques on Skin Tone Bias in Skin Lesion Classification",
        "authors": "Pratinav Seth, Abhilash K. Pai",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw60836.2024.00067"
    },
    {
        "id": 17577,
        "title": "The EntreComp Bias: A Qualitative Study on Entrepreneurial Competence in Entrepreneurship Training",
        "authors": "Berit Sandberg",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "As entrepreneurship is seen as a catalyst for innovation, economic growth and social progress, European public authorities are promoting entrepreneurial activity through education and training. Despite extensive research on academic entrepreneurship education, entrepreneurship training has received less attention. Entrepreneurship education refers to structured educational interventions designed to equip potential and existing entrepreneurs with the knowledge, skills and attitudes needed to start and run successful businesses. Entrepreneurship training is designed to promote the entrepreneurial competences identified in the European Commission’s Entrepreneurship Competence Framework (EntreComp). In a qualitative study of training activities, a content analysis was conducted to assess the compliance of the learning content with this policy standard. An internet search identified 194 courses in the Berlin-Brandenburg metropolitan region, Germany. The course descriptions were systematically analyzed and coded using the EntreComp framework. The results indicate that the courses primarily convey management knowledge rather than an entrepreneurial mindset. More than 50% of the content is related to start-up preparation, legal issues, finance and marketing, with less emphasis on creativity and interpersonal skills. Most courses prioritize knowledge acquisition, often neglecting the development of skills and attitudes. The entrepreneurship training programs studied adhere to a traditional approach to education in terms of educational paradigms. The study highlights a discrepancy between recommended policies and educational practices and suggests implications for the design of entrepreneurship training programs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33422/ieconf.v1i1.125"
    },
    {
        "id": 17578,
        "title": "Mitigating the Learning Bias towards Repetition by Self-Contrastive Training for Open-Ended Generation",
        "authors": "Jian Guan, Minlie Huang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.431"
    },
    {
        "id": 17579,
        "title": "Estimating Time-Varying Factors’ Variance in the String Term Structure Model With Stochastic Volatility",
        "authors": "Thiago Ramos Almeida",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4354605"
    },
    {
        "id": 17580,
        "title": "The Finite-Horizon Reversible Investment Problem with the Constant Elasticity of Variance Model",
        "authors": "Junkee Jeon, Takwon Kim",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4680329"
    },
    {
        "id": 17581,
        "title": "Minimum Variance Hedge Ratios using Short-Lived Arbitrage Model and Artificial Neural Network",
        "authors": "Yinan Ni, Yanfei Sun",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4411230"
    },
    {
        "id": 17582,
        "title": "Should All Nurses Be Required to Complete Implicit Bias Training?",
        "authors": "Tanya Bartley, Rebecca O'Connor, Kenya Beard",
        "published": "2023-11",
        "citations": 0,
        "abstract": "Bias mitigation requires a systematic approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.naj.0000995336.31551.4e"
    },
    {
        "id": 17583,
        "title": "Impact of Gender Bias in Training Data for Machine Learning Models predicting Myocardial Infarction",
        "authors": "Victoria Harding Bradley",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "The use of biomarkers reference ranges derived from clinical trials to detect and diagnose the presence of cardiovascular disease (CVD) and the occurrence of myocardial infarction (MI) is well established.  However, the predominance of older male participants in these trials has been shown to contribute to increased rate of misdiagnoses among women.  The application of Machine Learning (ML) to medical diagnosis promises the potential to improve accuracy.  However, ML also has the potential to perpetuate this problem of gender bias in trial data leading to worse outcomes for female patients.  This research found that models trained using data containing only male patient data were less accurate at predicting MI among female patients than those trained using data sets with greater representation of females.  For the model trained only with male patient data, this increased false negative rate corresponds to 2% of female patients with MI not being correctly diagnosed.   Addressing this issue will require (a) the collection of more female patient data to support the construction of training data sets which accurately reflect the patient population (b) consistent reporting of gender mix and other demographic information such as age when ML model performance is reported. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsrhs.v12i3.4532"
    },
    {
        "id": 17584,
        "title": "Training and Training Based on Field Training Model (Internship)",
        "authors": "Rivendri Rivendri",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Internship is training or practice to master certain skills under the guidance and supervision of experienced instructors. Apprenticeship training is organised and directed to equip, improve, and develop work competencies in order to improve capability, productivity, and welfare. The learning concept of apprenticeship is student-centred, prioritising the activities of learners as apprentices through active student learning and providing opportunities for learners to self-direct their learning activities. The benefits obtained in the implementation of apprenticeship are not only felt by the company that can produce labour in accordance with industry standards and company needs, but also the apprentices themselves get the opportunity to receive training, not only to hone skills in accordance with industry / company standards, but also to get direct technical training and core work skills that can improve their performance. The conceptual model underlying the apprenticeship programme falls into the category of the implementative learning model. Where this model requires initiatives that are able to strive and realise the curriculum from potential or written to actual or realisation by conducting a series of implementation activities in the form of learning processes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/kolokium.v11i3.760"
    },
    {
        "id": 17585,
        "title": "Is this rating worth it? The benefits of credit ratings in the dynamic tradeoff model",
        "authors": "Karolina Krystyniak, Viktoriya Staneva",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "PurposeThis study seeks to identify the main determinants of the optimal capital structure by reexamining the interpretation of the conventional set of explanatory variables used as proxies for the costs and benefits of debt in the context of the dynamic tradeoff theory.Design/methodology/approachThe authors isolate the variation in leverage due to different targets from that caused by deviations by aggregating the data across a dimension identifying firms with similar targets – credit rating category.FindingsContrary to theoretical priors, large and profitable rated firms have lower targets. The authors show that size and profitability proxy for non-financial risk and that, for rated firms, non-financial risk is positively correlated to the optimal leverage. The benefits of a better rating outweigh the costs of foregone tax shields for firms with relatively low non-financial risk. The authors find support for that theory in institutional trading – institutional investors do not punish highly rated firms when credit downgrades occur.Originality/valueThis paper contributes to the capital structure literature by developing a new approach based on data aggregation. This study is the first, to the authors’ knowledge, to find a positive effect of the firm's non-financial risk on target leverage among rated firms. The authors argue that the benefit of a better credit rating is an increasing function of the rating itself. The authors also contribute to the literature on the impact of credit ratings on the capital structure choices of the firm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ijmf-08-2022-0346"
    },
    {
        "id": 17586,
        "title": "The Variance-Covariance model as a decision support for chartered financial analysts in portfolio optimization",
        "authors": "Carlos Rodríguez, Katya Rodríguez",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "This study proposes the Variance-Covariance model to improve decision-making regarding the creation and optimization of an investment portfolio made by Chartered Financial Analysts. To optimize an investment portfolio, these specialists must find, given some profitability, how much they should invest in each of the selected stocks to minimize risk. This is typically achieved using the Mean-Variance model proposed by Harry Markowitz. However, it is observed that the use of the Mean-Variance model does not always lead to an expedited selection of shares that make up an investment portfolio. This is because the behaviour of the portfolio components cannot often be assessed with sufficient confidence in their trends. Financial analysts regularly prefer to compose their portfolios so that not all stocks follow the same direction to achieve greater peace of mind in bearish markets. Thus, in this work, the Variance-Covariance mathematical model is proposed as a complement to charting to support the decision criteria regarding portfolio diversification due to adverse conditions in the stock markets. We elaborate on the hypothesis that financial analysts using the Variance-Covariance matrix will achieve better financial decisions in less time-consuming.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34140/bjbv5n1-027"
    },
    {
        "id": 17587,
        "title": "An improved Molodensky-type modification of the Stokes formula and reduced bias in the spectral combination and variance-minimizing ULSM",
        "authors": "Linshan Zhong, Qiong Wu",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00190-023-01786-2"
    },
    {
        "id": 17588,
        "title": "Wavelet estimations of the derivatives of variance function in heteroscedastic model",
        "authors": "Junke Kou, Hao Zhang",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>This paper studies nonparametric estimations of the derivatives $ r^{(m)}(x) $ of the variance function in a heteroscedastic model. Using a wavelet method, a linear estimator and an adaptive nonlinear estimator are constructed. The convergence rates under $ L^{\\tilde{p}} (1\\leq \\tilde{p} &lt; \\infty)  $ risk of those two wavelet estimators are considered with some mild assumptions. A simulation study is presented to validate the performances of the wavelet estimators.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2023734"
    },
    {
        "id": 17589,
        "title": "Pricing Variance Swaps Under Heston Stochastic Volatility Model with Stochastic Interest Rate and Stochastic Dividend Yield",
        "authors": "Habakuk Djiké",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4451757"
    },
    {
        "id": 17590,
        "title": "Wavelet estimations of the derivatives of variance function in heteroscedastic model",
        "authors": "Junke Kou, Hao Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>This paper studies nonparametric estimations of the derivatives $ r^{(m)}(x) $ of the variance function in a heteroscedastic model. Using a wavelet method, a linear estimator and an adaptive nonlinear estimator are constructed. The convergence rates under $ L^{\\tilde{p}} (1\\leq \\tilde{p} &lt; \\infty)  $ risk of those two wavelet estimators are considered with some mild assumptions. A simulation study is presented to validate the performances of the wavelet estimators.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.202734"
    },
    {
        "id": 17591,
        "title": "Application of Mean-Variance Model for Firefighter",
        "authors": "Yunfei Hao, Jiajing Cai, Yilin Chen, Shengyi Xu",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "A good investment portfolio can make the investment get more returns, which requires investors to adopt appropriate methods to optimize the investment portfolio. A portfolio is not just a simple sum of assets, it requires the use of suitable models to analyze optimal asset allocation. This paper analyzes the asset allocation of firefighters, and uses three methods of mean variance analysis, CAPM model and FF3F model to optimize the pension investment ratio of firefighters. At the same time, this paper analyzes multiple stocks from four industries including retail, technology, manufacturing, and food, and strives to find the investment portfolio with the most potential pension. The results show that in CAPM, the largest weights of both maximum sharp ratio portfolio and the minimum portfolio belong to the possession of ‘NSRGY’, while in the FF3F model, the greatest weight of the maximum sharp ratio portfolio belongs to ‘TM’ possession and the greatest weight of the minimum variance portfolio belongs to ‘NSRGY’. This research could help retirees on the same pension type better allocate their pension assets and optimize their investment portfolios. At the same time, this paper also analyzes the investment performance of stocks in different industries under the same fixed proportion of pension.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.3923"
    },
    {
        "id": 17592,
        "title": "Special greeks of a variance-gamma driven vasicek model",
        "authors": "Adaobi M. Udoye, Lukman S. Akinola",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sciaf.2022.e01466"
    },
    {
        "id": 17593,
        "title": "Does Markowitz’s Mean–Variance Model Matter During Turmoil Periods? Lessons from the COVID Crisis",
        "authors": "Amine Mounir",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17010/ijf/2024/v18i1/171339"
    },
    {
        "id": 17594,
        "title": "Defining And Measuring Variance in Clinical Productivity Metrics By Training Level",
        "authors": "Eric Shappell, Sangeeta Sakaria, Derek Monette, David Peak, Daniel Egan",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5811/westjem.20467"
    },
    {
        "id": 17595,
        "title": "Retracted: Markov Model-Based Sports Training Risk Prediction Model Design and Its Training Control",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9874817"
    },
    {
        "id": 17596,
        "title": "Effects of weight bias training on student nurse empathy: A quasiexperimental study",
        "authors": "Ellen M. Gajewski",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nepr.2022.103538"
    },
    {
        "id": 17597,
        "title": "Overcoming Language Bias in Remote Sensing Visual Question Answering Via Adversarial Training",
        "authors": "Zhenghang Yuan, Lichao Mou, Xiao Xiang Zhu",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282946"
    },
    {
        "id": 17598,
        "title": "Equivariant variance estimation for multiple change-point model",
        "authors": "Ning Hao, Yue Selena Niu, Han Xiao",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-ejs2190"
    },
    {
        "id": 17599,
        "title": "Understanding Models and Model Bias with Gaussian Processes",
        "authors": "Thomas R. Cook, Nathan Palmer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4486433"
    },
    {
        "id": 17600,
        "title": "Strategic Complementarities in a Model of Commercial Media Bias",
        "authors": "Anna Kerkhof, Johannes Munster",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4626498"
    },
    {
        "id": 17601,
        "title": "IrMn Thickness Dependence of Exchange Bias Training Effect in CoFe/IrMn Thin Films",
        "authors": "Seok-Soo Yoon, Dong-Young Kim",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4283/jkms.2023.33.1.049"
    },
    {
        "id": 17602,
        "title": "Examining the role of deliberation in de-bias training",
        "authors": "Esther Boissin, Serge Caparos, Wim De Neys",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/13546783.2023.2259542"
    },
    {
        "id": 17603,
        "title": "Robust Training of Neural Networks against Bias Field Perturbations",
        "authors": "Patrick Henriksen, Alessio Lomuscio",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "We introduce the problem of training neural networks such that they are robust against a class of smooth intensity perturbations modelled by bias fields. We first develop an approach towards this goal based on a state-of-the-art robust training method utilising Interval Bound Propagation (IBP). We analyse the resulting algorithm and observe that IBP often produces very loose bounds for bias field perturbations, which may be detrimental to training. We then propose an alternative approach based on Symbolic Interval Propagation (SIP), which usually results in significantly tighter bounds than IBP. We present ROBNET, a tool implementing these approaches for bias field robust training. In experiments networks trained with the SIP-based approach achieved up to 31% higher certified robustness while also maintaining a better accuracy than networks trained with the IBP approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i12.26736"
    },
    {
        "id": 17604,
        "title": "Application of Mean-variance Model in Optimizing Stock Portfolio",
        "authors": "Xingyu Qian",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Constructing an optimized stock portfolio is pivotal in achieving enhanced returns with managed risks. Utilizing data from 2022, the study employed the mean-variance model to determine the optimal allocations for five prominent stocks: Intel (INTC), Johnson & Johnson (JNJ), Coca-Cola (KO), Netflix (NFLX), and Procter & Gamble (PG). In the formulations of both maximum Sharpe ratio and minimum variance portfolios, the stocks with the predominant allocations are NFLX and PG, with respective weights of 47.04% and 45.89% for the former, and 58.05% and 29.61% for the latter. Upon establishing these weightings, the cumulative returns for 2023 were calculated, revealing that the constructed portfolios notably outperformed the broader stock market. This research underscores two key observations: firstly, the NFLX and PG stocks emerge as cornerstones in the optimal portfolio composition; and secondly, these allocations, when evaluated with 2023 data, underscore their efficacy. Robustness checks, which expanded the asset pool, further validated these findings. Ultimately, this study serves as a valuable guide for investors in the financial market, presenting a structured blueprint for effective portfolio assembly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/56/20231128"
    },
    {
        "id": 17605,
        "title": "Estimating Output Variance of a Regressing Tree Model: A Case Study of Concrete Strength Prediction",
        "authors": "Monjurul Hasan, Ming Lu",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485248.109"
    },
    {
        "id": 17606,
        "title": "Research on the Application of Mean-Variance Model in Securities Investment Portfolio Planning: Evidence from China Stock Market",
        "authors": "Yijia Lu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4393576"
    },
    {
        "id": 17607,
        "title": "Effectiveness and Limitation of Markowitz Mean-variance Model: Evidence from Hang Seng Index",
        "authors": "Hanrong Zhang",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "As China's economy has expanded rapidly, its financial system has gradually improved, new financial businesses have evolved, and new theories and technologies have also been developed. The Markowitz mean-variance model, the cornerstone of asset pricing theory, is utilized as an example in this paper to demonstrate how the Markowitz portfolio theory may be applied to assess a portfolio of five stocks in the Hang Seng data, a significant indicator of the Hong Kong stock market. Empirically, the optimal portfolios with the highest Sharpe ratios and lowest variances are identified. Their expected returns, standard deviations, and Sharpe ratios are then evaluated by comparing them to equal-weight portfolios and giving the effective frontier. The author further demonstrates the guiding significance of Markowitz's portfolio theory in the Chinese investment market through the assessment of the findings. Finally, in the context of the Chinese securities market, identify and analyze the model's constraints and offer suggestions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hbem.v8i.7208"
    },
    {
        "id": 17608,
        "title": "Sustainability Bias in Utility and Infrastructure Related Large Language Model Queries",
        "authors": "William Kuehne, Lauren Basler",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2175/193864718825159252"
    },
    {
        "id": 17609,
        "title": "Mitigating Unintended Identity Bias in Toxicity Detection Language Model",
        "authors": "Amirhossein Hajigholam Saryazdi, Kiana Sharifpour",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4561446"
    },
    {
        "id": 17610,
        "title": "Setting Gendered Expectations? Recruiter Outreach Bias in Online Tech Training Programs",
        "authors": "Jacqueline N. Lane, Karim R. Lakhani, Roberto M. Fernandez",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": " Competence development in digital technologies, analytics, and artificial intelligence is increasingly important to all types of organizations and their workforce. Universities and corporations are investing heavily in developing training programs, at all tenure levels, to meet the new skills needs. However, there is a risk that the new set of lucrative opportunities for employees in these tech-heavy fields will be biased against diverse demographic groups like women. Although much research has examined the experiences of women in science, technology, engineering, and mathematics (STEM) fields and occupations, less understood is the extent to which gender stereotypes influence recruiters’ perceptions and evaluations of individuals who are deciding whether to apply to STEM training programs. These behaviors are typically unobserved because they occur prior to the application interface. We address this question by investigating recruiters’ initial outreach decisions to more than 166,000 prospective students who have expressed interest in applying to a midcareer level online tech training program in business analytics. Using data on the recruiters’ communications, our results indicate that recruiters are less likely to initiate contact with female than male prospects and search for additional signals of quality from female prospects before contacting them. We also find evidence that recruiters are more likely to base initial outreach activities on prospect gender when they have higher workloads and limited attention. We conclude with a discussion of the implications of this research for our understanding of how screening and selection decisions prior to the application interface may undermine organizational efforts to achieve gender equality and diversity as well as the potential for demand-side interventions to mitigate these gender disparities.  Funding: We gratefully acknowledge Harvard Business School and MIT Sloan School of Management for generously funding this work.  Supplemental Material: The online appendix is available at https://doi.org/10.1287/orsc.22.16499 . ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/orsc.22.16499"
    },
    {
        "id": 17611,
        "title": "Setting Gendered Expectations? Recruiter Outreach Bias in Online Tech Training Programs",
        "authors": "Jacqueline N. Lane, Karim R. Lakhani, Roberto M. Fernandez",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": " Competence development in digital technologies, analytics, and artificial intelligence is increasingly important to all types of organizations and their workforce. Universities and corporations are investing heavily in developing training programs, at all tenure levels, to meet the new skills needs. However, there is a risk that the new set of lucrative opportunities for employees in these tech-heavy fields will be biased against diverse demographic groups like women. Although much research has examined the experiences of women in science, technology, engineering, and mathematics (STEM) fields and occupations, less understood is the extent to which gender stereotypes influence recruiters’ perceptions and evaluations of individuals who are deciding whether to apply to STEM training programs. These behaviors are typically unobserved because they occur prior to the application interface. We address this question by investigating recruiters’ initial outreach decisions to more than 166,000 prospective students who have expressed interest in applying to a midcareer level online tech training program in business analytics. Using data on the recruiters’ communications, our results indicate that recruiters are less likely to initiate contact with female than male prospects and search for additional signals of quality from female prospects before contacting them. We also find evidence that recruiters are more likely to base initial outreach activities on prospect gender when they have higher workloads and limited attention. We conclude with a discussion of the implications of this research for our understanding of how screening and selection decisions prior to the application interface may undermine organizational efforts to achieve gender equality and diversity as well as the potential for demand-side interventions to mitigate these gender disparities.  Funding: We gratefully acknowledge Harvard Business School and MIT Sloan School of Management for generously funding this work.  Supplemental Material: The online appendix is available at https://doi.org/10.1287/orsc.2022.16499 . ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/orsc.2022.16499"
    },
    {
        "id": 17612,
        "title": "The Impact of Racial Distribution in Training Data on Face Recognition Bias: A Closer Look",
        "authors": "Manideep Kolla, Aravinth Savadamuthu",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw58289.2023.00035"
    },
    {
        "id": 17613,
        "title": "Portfolio Analysis with Mean-Variance Model in Chinese Stock Market",
        "authors": "Zinuo Cheng, Xin Feng, Zhenghao Qin",
        "published": "2023-2-16",
        "citations": 0,
        "abstract": "Portfolio optimization is crucial in the financial sector. The goal of this article is to analyze portfolio allocation in the Chinese stock market. This article's information was taken from Straight Flush. To obtain a greater hedging impact, we choose firms from other sectors in order to lessen the connection between their stocks. The data was analyzed using the Efficient Frontier, Modern Portfolio Theory, and Mean-Variance Model. The annualized returns of Bank of China and Maanshan Iron and Steel are negative, according to the results. Maanshan Iron and Steel is -0.029148 vs -0.068115 for the Bank of China. Great Wall Electricity is 0.173349, whereas BYD is 0.250717 and MIDEA is 0.117577. The volatility of these five equities is substantial. The Bank of China's annualized volatility is 0.34952. The portfolio with the least volatility has a cumulative return of 18.10%, and the portfolio with the largest Sharpe ratio has a cumulative return of 30.80%. This research has certain reference value for investors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hbem.v5i.5082"
    },
    {
        "id": 17614,
        "title": "A portfolio stock selection model based on expected utility, entropy and variance",
        "authors": "Irene Brito",
        "published": "2023-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118896"
    },
    {
        "id": 17615,
        "title": "Error variance estimation for the partially linear model",
        "authors": "Belly N'kôyossè Martial Ahoutou, Armel Fabrice Evrard Yode, Kouamé Florent Kouakou",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "To address the <i>curse of dimensionality</i> problem associated with multivariate nonparametric regression models, we consider  partially linear regression models. A contribution to statistical inference in the partially linear regression model is to  propose estimators of the error variance with good asymptotic properties. We propose two estimators of the error variance  in a partially linear regression model and their respective asymptotic normality. Using a simulation–based study, we will  compare the performance of our estimator with the performance of other concurrent estimators existing in the statistical  literature",
        "keywords": "",
        "link": "http://dx.doi.org/10.16929/as/2023.3399.311"
    },
    {
        "id": 17616,
        "title": "On Variance Components Estimators in Repeated\nMeasurements Model",
        "authors": "Hayder Abbood Kori",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "In this article, we focus our study on estimation the variance components in the two methods: the maximum likelihood function and the maximum penalized likelihood function of the repeated measurements model, which contain three random effects as well as random error, comparing between these estimators based on the mean square error , we also studied the bias and variance for each estimator and supported the theoretical side with an applied example to illustrate the results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jecnam.33.28.39"
    },
    {
        "id": 17617,
        "title": "Urban AQI Prediction Using an Inverse Variance Weighted GCN and BiLSTM Combined Model",
        "authors": "Yiling Hu, Bo Su",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscsic60498.2023.00036"
    },
    {
        "id": 17618,
        "title": "Glass composition analysis and identification model based on variance test",
        "authors": "Miao Wang, Yifan Zhang, Maotai Cheng",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "In this study, a qualitative and quantitative study was conducted on three factors: weathering condition and glass type, decoration, and color; bar graphs and line graphs were drawn and described for each factor at different levels of weathering condition; the relationship between the three factors and weathering condition was analyzed using chi-square test, and the correlation between glass type and weathering condition was obtained to be high; the correlation analysis (2) based on APRIORI algorithm (1) was used to The correlation analysis (2) based on APRIORI algorithm (1) was used to quantitatively calculate the relationship between different levels under each factor and the weathering condition, and it was obtained that the levels of ornamentation B, light blue and blue-green, high potassium and lead-barium had more significant effects on the weathering condition, and the results were consistent with the qualitative analysis. For the second sub-question of question 1, the chemical components with high variability between weathered and unweathered samples were selected using the MannWhitney test, and ridge regression was used to establish a model of weathering condition and these chemical components.For question 2, this paper conducted independent sample MannWhitney tests on glass type and each chemical composition to obtain twelve chemical composition indicators with significant differences between high potassium and lead-barium glasses. Specific functions between glass type and each component were fitted by ridge regression on these chemical components for high potassium and lead-barium glasses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v34i.5506"
    },
    {
        "id": 17619,
        "title": "EXPLORING EXPERIENCES OF GENDER BIAS IN ORTHOPAEDIC TRAINING IN NEW ZEALAND",
        "authors": "E. Scherf",
        "published": "2023-2",
        "citations": 0,
        "abstract": "This qualitative study aims to explore and highlight the experiences of trainees in the Orthopaedic Surgical Education Training (SET) program in New Zealand, with a focus on identifying gender-specific biases which may impact professional development.Orthopaedic SET trainees in New Zealand were invited to complete a qualitative, semi-structured questionnaire exploring their experiences in the Orthopaedic SET program. A broad range of topics were covered, addressing culture, belonging, learning styles and role modelling. Recurrent themes were identified using inductive methods.Analysis of questionnaire responses identified several key themes for women in the Orthopaedic SET program, compared to their male counterparts, including (1) role incredulity, (2) confidence vs. competence, (3) adaptation, (4) interdisciplinary relationships and (5) role modelling. Female participants described experiencing gender bias or discrimination by both patients and interdisciplinary colleagues at a higher rate than their male counterparts. The majority of female participants described feeling as competent as their male counterparts at the same SET level, however, identified that they do not typically exhibit the same confidence in their surgical abilities. Whilst similar numbers of female and male participants described experiencing barriers to career progression, female participants described having to adapt both physically and socially to overcome additional gender-specific barriers. Positive influences on training experience included role modelling and supportive relationships amongst trainee groups.This study highlighted gender-specific biases experienced by trainees in the Orthopaedic SET program in New Zealand. Further investigation is warranted to determine how these experiences affect professional development, and how they may be addressed to foster increased gender equity in the surgical profession. This will likely require system-level interventions to create meaningful and sustainable culture change.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1302/1358-992x.2023.2.066"
    },
    {
        "id": 17620,
        "title": "Portfolio Investment Analysis Based on Markowitz Mean-variance Model with a Realistic Fund Dataset",
        "authors": "Xi Chen, Shiqi Fang, Zixin Shen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.18-11-2022.2326894"
    },
    {
        "id": 17621,
        "title": "Asymptotic bias of the hazard probability model under model mis-specification",
        "authors": "Hans J. Skaug, Tore Selland Kleppe, Hiroshi Okamura",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "We compare the sensitivity of the estimated effective strip half-width with respect to choice of hazard probability function (Q). This is done by fitting the model under an erroneous assumption about the parametric form of Q, and comparing the estimated and true effective strip half-width. An ‘infinite sample size’ setting is employed, where fitting the model by maximum likelihood amounts to minimising the Kullback Leibler distance between the assumed and true models. The experiment is carried out in a situation that is relevant to minke whale sighting surveys both in the Antarctic and in the northeastern Atlantic. It is found that the hazard probability model is fairly robust with respect to the choice of parametric class for Q. The largest observed bias in the resulting effective strip half-width is less than 10%, while for most situations there is almost no bias.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47536/jcrm.v11i3.604"
    },
    {
        "id": 17622,
        "title": "A Weberized Total Variance Regularization-based Image Multiplicative Noise Model",
        "authors": "Xinyao Yu, Donghong Zhao",
        "published": "2023-7-10",
        "citations": 1,
        "abstract": "This paper considers Weber's law and proposes a new non-convex model for images contaminated by Gaussian noise and Rayleigh noise. The alternating direction method of multipliers (abbreviated as ADMM) is a recent popular method that can handle convex and non-convex problems well. This paper compares denoising effect between ADMM and the Euler-Lagrange equation method applied to the non-convex model. The numerical experimental results show that ADMM performs better and has a higher Peak Signal to Noise Ratio.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5566/ias.2837"
    },
    {
        "id": 17623,
        "title": "Mean-Variance Model Theory and Its Application in Chinese Stock Market",
        "authors": "Zhanfeng Lin",
        "published": "2023-3-21",
        "citations": 0,
        "abstract": "This paper examines the effect of the mean and modeled mean volatility on the mean curve of a Markowitz portfolio analysis of major values and simultaneous changes. The average investment value in the future and the predicted trend curve change, the actual effective model mean and the actual volatility are the volatility shown in todays Mavitz. The Kowitz portfolio model of volatility yields the horse trend curve under changing conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/3/2022894"
    },
    {
        "id": 17624,
        "title": "PENENTUAN KONTRAK OPSI TIPE EROPA MENGGUNAKAN MODEL SIMULASI VARIANCE GAMMA (VG)",
        "authors": "NI KADEK LANI PITRAYANI, KOMANG DHARMAWAN, I NYOMAN WIDANA",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "Options are used as a hedge against stock price uncertainty brought on by unstable stock prices fluctuation. The price of an option contract can be determined using a variety of approaches, one of which is the Variance Gamma. The purpose of this study is to compare the Black Scholes method with the Variance Gamma simulation model to determine the European call option contract price. The first thing that needs to be done is to figure out the moment variance gamma method. These parameters were used as initial values to get an idea of what the parameters that will be used in the simulation will be like. The European call option contract's price is calculated using the simulation results, which are then compared to the Variance Gamma simulation model and the Black Scholes model for the European call option contract. This study shows that the European call option contract's price, which was calculated using the Variance Gamma simulation, is less expensive than the Black Scholes contract's price.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24843/mtk.2023.v12.i03.p417"
    },
    {
        "id": 17625,
        "title": "The Cauchy problem for the infinitesimal model in the regime of small variance",
        "authors": "Florian Patout",
        "published": "2023-8-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2140/apde.2023.16.1289"
    },
    {
        "id": 17626,
        "title": "Model averaging of machine learning algorithms for digital soil mapping: A minimum variance framework",
        "authors": "Patrick Bogaert, Ruhollah Taghizadeh-Mehrjardi, Nikou Hamzehpour",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geoderma.2023.116604"
    },
    {
        "id": 17627,
        "title": "Orthogonal Possibilistic Mean - Variance Model",
        "authors": "Furkan GÖKTAŞ",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "Olabilirlik teorisi, portföy seçimi probleminde en çok kullanılan araçlardan biridir. Çünkü kesin olmayan olasılığın modellenmesine ve uzman bilgisinin portföy seçimi problemine entegre edilmesine imkan verir. Ama olabilirlik ortalama - varyans (OV) modelinin ve bunun uzantılarının bazı sorunları vardır. Bu nedenle bu çalışmada kesin konveks kuadratik minimizasyona dayanan ortogonal olabilirlik OV modeli önerilmiştir. Ayrıca olabilirlik dağılımları üçgensel bulanık sayılar ile verildiğinde olabilirlik çarpıklığı tanımlanmıştır. Olabilirlik çarpıklığı önerilen modele kısıt olarak eklenebilir. Bu modelin analitik çözümü belirli şartlar altında elde edilmiştir. Ayrıca bu model açıklayıcı bir örnek ile tanıtılmıştır ve bu modelin sonuçları Olabilirlik OV modelinin sonuçları ile karşılaştırılmıştır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47495/okufbed.1217550"
    },
    {
        "id": 17628,
        "title": "A DC Plan with Return Clause and Administrative Charges under Heston Volatility and Weibull Model under Mean Variance Utility",
        "authors": "Bright Okore Osu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4778847"
    },
    {
        "id": 17629,
        "title": "Reducing Bias in Sentiment Analysis Models Through Causal Mediation Analysis and Targeted Counterfactual Training",
        "authors": "Yifei Da, Matías Nicolás Bossa, Abel Díaz Berenguer, Hichem Sahli",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3353056"
    },
    {
        "id": 17630,
        "title": "Trial arm outcome variance difference after dropout as an indicator of missing‐not‐at‐random bias in randomized controlled trials",
        "authors": "Audinga‐Dea Hazewinkel, Kate Tilling, Kaitlin H. Wade, Tom Palmer",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractRandomized controlled trials (RCTs) are vulnerable to bias from missing data. When outcomes are missing not at random (MNAR), estimates from complete case analysis (CCA) and multiple imputation (MI) may be biased. There is no statistical test for distinguishing between outcomes missing at random (MAR) and MNAR. Current strategies rely on comparing dropout proportions and covariate distributions, and using auxiliary information to assess the likelihood of dropout being associated with the outcome. We propose using the observed variance difference across trial arms as a tool for assessing the risk of dropout being MNAR in RCTs with continuous outcomes. In an RCT, at randomization, the distributions of all covariates should be equal in the populations randomized to the intervention and control arms. Under the assumption of homogeneous treatment effects and homoskedastic outcome errors, the variance of the outcome will also be equal in the two populations over the course of follow‐up. We show that under MAR dropout, the observed outcome variances, conditional on the variables included in the model, are equal across trial arms, whereas MNAR dropout may result in unequal variances. Consequently, unequal observed conditional trial arm variances are an indicator of MNAR dropout and possible bias of the estimated treatment effect. Heterogeneous treatment effects or heteroskedastic outcome errors are another potential cause of observing different outcome variances. We show that for longitudinal data, we can isolate the effect of MNAR outcome‐dependent dropout by considering the variance difference at baseline in the same set of patients who are observed at final follow‐up. We illustrate our method in simulation for CCA and MI, and in applications using individual‐level data and summary data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/bimj.202200116"
    },
    {
        "id": 17631,
        "title": "A DEA-CCR Model Application in Clustered Stocks Portfolio with Technical Investment Strategies and Mean-Variance Model",
        "authors": "M.M. Navarro, M. N. Young, Y.T. Prasetyo, J.L. Camino, B.B. Navarro, V.T. Ramos",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieem58616.2023.10406970"
    },
    {
        "id": 17632,
        "title": "Online model tuning in surrogate-assisted optimization — An effective approach considering the cost–benefit tradeoff",
        "authors": "Ali Ahrari, Dries Verstraete",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.swevo.2023.101357"
    },
    {
        "id": 17633,
        "title": "Towards variance-conserving reconstructions of climate indices with Gaussian process regression in an embedding space",
        "authors": "Marlene Klockmann, Udo von Toussaint, Eduardo Zorita",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "Abstract. We present a new framework for the reconstruction of climate indices based on proxy data such as tree rings. The framework is based on the supervised learning method Gaussian Process Regression (GPR) and aims at preserving the amplitude of past climate variability. It can adequately handle noise-contaminated proxies and variable proxy availability over time. To this end, the GPR is formulated in a modified input space, termed here embedding space. We test the new framework for the reconstruction of the Atlantic multi-decadal variability (AMV) in a controlled environment with pseudo-proxies derived from coupled climate-model simulations. In this test environment, the GPR outperforms benchmark reconstructions based on multi-linear principal component regression. On AMV-relevant timescales, i.e. multi-decadal, the GPR is able to reconstruct the true amplitude of variability even if the proxies contain a realistic non-climatic noise signal and become sparser back in time. Thus, we conclude that the embedded GPR framework is a highly promising tool for climate-index reconstructions.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/gmd-17-1765-2024"
    },
    {
        "id": 17634,
        "title": "Valuations of Variance and Volatility Swaps Under Double Heston Jump-Diffusion Model With Approximative Fractional Stochastic Volatility",
        "authors": "Ke Wang, Xunxiang Guo",
        "published": "2023-3-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10614-023-10374-7"
    },
    {
        "id": 17635,
        "title": "Volatility swaps valuation under a modified risk-neutralized Heston model with a stochastic long-run variance level",
        "authors": "Xin-Jiang He, Sha Lin",
        "published": "2023-3-19",
        "citations": 0,
        "abstract": "We consider the pricing of discretely sampled volatility swaps under a modified Heston model, whose risk-neutralized volatility process contains a stochastic long-run variance level. We derive an analytical forward characteristic function under this model, which has never been presented in the literature before. Based on this, we further obtain an analytical pricing formula for volatility swaps which can guarantee the computational accuracy and efficiency. We also demonstrate the significant impact of the introduced stochastic long-run variance level on volatility swap prices with synthetic as well as calibrated parameters.\n \ndoi: 10.1017/S144618112200013X",
        "keywords": "",
        "link": "http://dx.doi.org/10.21914/anziamj.v64.17204"
    },
    {
        "id": 17636,
        "title": "A Data Mining model using ANN for predicting seasonal variance in residential Electricity consumption",
        "authors": "Sheik Shah, Meganathan S.",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "The role of electricity consumption is crucial in daily life, and by analyzing readily available data on electricity usage, we can uncover hidden patterns that aid in forecasting seasonal energy usage. This research paper introduces a Data mining algorithm that utilizes an Artificial Neural Network (ANN) to predict the residential Electric Energy usage. Additionally, it forecasts the fluctuations in energy consumption during various monsoons, as electricity usage varies greatly across seasons. These predictions can guide energy conservation efforts to address the demand for energy more effectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31893/multiscience.2024ss0102"
    },
    {
        "id": 17637,
        "title": "Yule-Walker-Based Approaches for Estimation of Noise-Corrupted Periodic Autoregressive Model - Finite- and Infinite-Variance Cases",
        "authors": "Wojciech Żuławiński, Agnieszka Wyłomańska, Radosław Zimroz",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289735"
    },
    {
        "id": 17638,
        "title": "On Frontier Portfolio in Shanghai Stock Exchange Based on Mean Variance Model",
        "authors": "Jiaao Yu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "In security markets, how to achieve optimal allocation of asset has become the focus of investors. The mean-variance model is a method to achieve revenue maximization and risk minimization on investing stock portfolio. This paper will research on investment problem in Shanghai Stock Exchange. It involves research result about mean variance model since 1952. To take the experiment, 10 stocks are chosen from Shanghai Stock Exchange. Organizing rates of return for 360 days and using the average daily rate of return as the expected rate of return. Applying mean variance model, selecting data, the curve of frontier portfolio is obtained by experiment. Based on the result, the investment advice is given. It shows that higher expected rate of return accompanies by higher risk. To achieve higher returns, investor could analyse the variation of each asset along with the rise of the expected rate of change. When negative weight appears, there exists short selling. If short selling is not allowed, investor could shrink the interval of the expected rate of return.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/45/20230252"
    },
    {
        "id": 17639,
        "title": "Assessing The Impact of Bias in Training Data on the Fairness and Equity of Predictive Policing Models",
        "authors": "Bharath Rajiv, Kamal Roshan, Veeramalai Sankaradass",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452490"
    },
    {
        "id": 17640,
        "title": "Implementation of Cultural Awareness and Cognitive Bias Training Within Graduate Nursing Programs",
        "authors": "Benjamin Smallheer, Angela Richard-Eaglin",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "\nBackground:\nCognitive bias negatively affects patient outcomes, resulting in medical errors, sentinel events, and legal claims. The brunt of bias-induced inequities and disparities has fallen on Black and Brown people, women, and the LGBTQ+ communities. Faculty training programs have rapidly increased in number, whereas student training has lagged.\n\n\nMethod:\nA three-part curricular series was developed for students seeking nurse practitioner (NP) training. The series addressed racial bias, microaggression, and gender bias using vignettes and guided pre- and debriefing.\n\n\nResults:\nThe series was initially implemented to 70 students from four different specialty areas of study. Students resoundingly reported the content as valuable and challenging and the environment as a safe space to learn, be vulnerable, and be empathetic to the experiences of others.\n\n\nConclusion:\n\n              This three-part series has been implemented across eight NP majors and has become a required component of the NP on-campus intensive experience.\n              \n                [\n                J Nurs Educ\n                . 2024;63(X):XXX–XXX.]\n              \n\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.3928/01484834-20240318-03"
    },
    {
        "id": 17641,
        "title": "Accelerating Deep Learning Model Training on Cloud Tensor Processing Unit",
        "authors": "Cristiano Künas, Edson Padoin, Philippe Navaux",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012017300003488"
    },
    {
        "id": 17642,
        "title": "Temporal Reinforcement of Naloxone Training Results in Significant Retention of Anti-bias and Overdose-Response Knowledge",
        "authors": "Pandurang Bharne, Erin Kelly, Sujay Rajkumar, Austin Iglesias, Sravya Ponnapalli, Benjamin Haslund-Gourley, Annette Gadegbeku",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.45415"
    },
    {
        "id": 17643,
        "title": "Impact of Pulse Width Parameter on the Bias of the CRLB Model in MIMO Radar",
        "authors": "Neda Rojhani, Marco Passafiume",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/spsympo57300.2023.10302696"
    },
    {
        "id": 17644,
        "title": "A Multidimensional Opinion Evolution Model with Confirmation Bias",
        "authors": "M. Hossein Abedinzadeh, Emrah Akyol",
        "published": "2023-9-26",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/allerton58177.2023.10313365"
    },
    {
        "id": 17645,
        "title": "Evaluation of our training system for endoscopic submucosal dissection using a new training model",
        "authors": "J. Hamanaka, T. Mitsui",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1055/s-0043-1765822"
    },
    {
        "id": 17646,
        "title": "Rate-Overhead Tradeoff for IOS-Aided Beam Training: How Large Codebook Is Enough for the IOS?",
        "authors": "Shupei Zhang, Yutong Zhang, Hongliang Zhang, Neng Ye, Boya Di",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lwc.2023.3261968"
    },
    {
        "id": 17647,
        "title": "Developing a new model for cross-sector foundation training",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1211/pj.2024.1.230410"
    },
    {
        "id": 17648,
        "title": "Sustainable Power Consumption for Variance-Based Integration Model in Cellular 6G-IoT System",
        "authors": "Prabhu Ramamoorthy, Sumaya Sanober, Luca Di Nunzio, Gian Carlo Cardarilli",
        "published": "2023-8-22",
        "citations": 1,
        "abstract": "With the emergence of the 5G network, the count of analysis papers associated with the 6G Internet of Things (IoT) has rapidly increased due to the rising attention of researchers in next-generation technology, 6G networks and IoT techniques. Owing to this, grasping the overall research topics and directions is a complex task. To mutually address the significant issues of 6G cellular IoT, i.e., information transmission, data aggregation and power supply, we proposed a variance-based integrating model for the 6G-IoT approach that considers energy, communication and computation (ECC). Initially, the base station (BS) charges huge IoT devices concurrently utilizing WPT in the downlink. After that, IoT devices gather the energy to perform the communication task and the computation task in the uplink in a similar spectrum. Also, the model integrates the optimization of transmit beams via the Improved Ant Colony Optimization (IACO) model to balance the system performance, power consumption and computational complexity. Further, this study exploited activated Remote Radio Units (RRUs) to improve the network performance and energy efficiency in the downlink model. The simulation outcomes evaluate the performance of the proposed work over the conventional models concerning error analysis. From the results, the MSE value in the IACO work is much lower, around 0.011, while the compared schemes achieved comparatively higher MSE values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su151712696"
    },
    {
        "id": 17649,
        "title": "Two new estimators of finite population variance under random non-response: An application",
        "authors": "Alisha Mittal, Manoj Kumar",
        "published": "2023-3-24",
        "citations": 1,
        "abstract": "In this paper, an attempt has been made to study the estimation of finite population variance in simple random sampling without replacement (SRSWOR) in presence of non-response by proposing two estimators. The two estimators (dual to ratio and ratio cum dual to ratio type) have been proposed on the basis of availability and non-availability of auxiliary information. The properties such as bias and mean square error of the proposed estimators have also been studied up to first order of approximation. The proposed estimators are compared with some existing estimators and are also mutually compared. An empirical study, based on both vegetable crop data and simulated data, has been performed to find out the best estimator. It has been seen that out of the two proposed estimators, the ratio cum dual to ratio type estimator performed better than dual to ratio estimator.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/mas-221361"
    },
    {
        "id": 17650,
        "title": "A Weighted-Variance Variational Autoencoder Model for Speech Enhancement",
        "authors": "Ali Golmakani, Mostafa Sadeghi, Xavier Alameda-Pineda, Romain Serizel",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10446294"
    },
    {
        "id": 17651,
        "title": "Robust m-estimator of parameters in variance components model",
        "authors": "Roman Zmyślony, Stefan Zontek",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7151/dmps.1032"
    },
    {
        "id": 17652,
        "title": "Deep Predictive Model Learning With Parametric Bias: Handling Modeling Difficulties and Temporal Model Changes",
        "authors": "Kento Kawaharazuka, Kei Okada, Masayuki Inaba",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mra.2022.3217744"
    },
    {
        "id": 17653,
        "title": "Forecasting Earnings Variance: Quantile-Based Vs. Residuals-Based Variance Proxies",
        "authors": "Luca Brunke",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4404839"
    },
    {
        "id": 17654,
        "title": "The impact of attention bias modification training on behavioral and physiological responses",
        "authors": "Stéphane Ranfaing, Lucas De Zorzi, Rémi Ruyffelaere, Jacques Honoré, Hugo Critchley, Henrique Sequeira",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.biopsycho.2024.108753"
    },
    {
        "id": 17655,
        "title": "Asymptotic bias of the $$\\ell _2$$-regularized error variance estimator",
        "authors": "Semin Choi, Gunwoong Park",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42952-023-00239-y"
    },
    {
        "id": 17656,
        "title": "Improving Racial and Ethnic Disparities in Maternal Care Through Implicit Bias Training",
        "authors": "Marilyn Mapp",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jogn.2023.05.102"
    },
    {
        "id": 17657,
        "title": "Quantification of Physical and Numerical Mixing in a Coastal Ocean Model Using Salinity Variance Budgets",
        "authors": "Dylan Schlichting, Lixin Qu, Daijiro Kobashi, Robert Hetland",
        "published": "2023-4",
        "citations": 0,
        "abstract": "AbstractNumerical mixing, the spurious mixing primarily generated by the discretization of advection, is often significant in estuarine and coastal models due to sharp, energetic fronts. We compare on‐ and offline estimates of numerical mixing in a submesoscale‐resolving realistic simulation of the ocean state over the Texas‐Louisiana continental shelf. While offline estimates of numerical mixing differ from online estimates, offline methods may be the only analysis available. We use two methods to estimate numerical mixing offline based on the residuals of the salinity squared s2 and volume‐mean salinity variance  budgets. The  budget overestimates the time‐averaged online numerical mixing by 60% at hourly output. The s2 budget compares poorly due to large truncation errors associated with the tendency and advection terms. The residual of the s2 budget starts to converge to the  budget as output frequency increases to 10 min—an unrealistic frequency for long‐term coastal ocean simulations—but neither method unconditionally converges to the online method and therefore cannot be recommended for generic analysis of numerical mixing. We also investigate the effects of horizontal resolution on numerical mixing using a two‐way nested grid with the online method. The volume‐integrated numerical mixing constitutes 57% of the bulk physical mixing—the mixing prescribed by the turbulence closure scheme—in the coarse model and may exceed the physical mixing by half an order of magnitude. We find numerical mixing is reduced by 35% on average in the nested model, likely due to new dynamical processes that emerge in the nested simulation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2022ms003380"
    },
    {
        "id": 17658,
        "title": "Cognitive Bias Modification of Interpretation training for youth with OCD: Who benefits? Examining the role of OCD severity, interpretation bias, and autism symptoms",
        "authors": "Elske Salemink, Annelieke Hagen, Else de Haan, Lidewij Wolters",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jocrd.2023.100809"
    },
    {
        "id": 17659,
        "title": "Implicit bias training can remove bias from subliminal stimuli, restoring choice divergence: A proof-of-concept study",
        "authors": "Roger Koenig-Robert, Hashim El Omar, Joel Pearson",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "Subliminal information can influence our conscious life. Subliminal stimuli can influence cognitive tasks, while endogenous subliminal neural information can sway decisions before volition. Are decisions inextricably biased towards subliminal information? Or can they diverge away from subliminal biases via training? We report that implicit bias training can remove biases from subliminal sensory primes. We first show that subliminal stimuli biased an imagery-content decision task. Participants (n = 17) had to choose one of two different patterns to subsequently imagine. Subliminal primes significantly biased decisions towards imagining the primed option. Then, we trained participants (n = 7) to choose the non-primed option, via post choice feedback. This training was successful despite participants being unaware of the purpose or structure of the reward schedule. This implicit bias training persisted up to one week later. Our proof-of-concept study indicates that decisions might not always have to be biased towards non-conscious information, but instead can diverge from subliminal primes through training.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0289313"
    },
    {
        "id": 17660,
        "title": "Performance of Bias-Corrected Bootstrap Confidence Interval for Parameter k Method in Actor-Partner Interdependence Model",
        "authors": "Junyeong Yang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2010595"
    },
    {
        "id": 17661,
        "title": "Bias correction based on AR model in spurious regression",
        "authors": "Zhongzhe Ouyang, Ke Liu, Min Lu",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract><p>The regression of mutually independent time series, whether stationary or non-stationary, will result in autocorrelation in the random error term. This leads to the over-rejection of the null hypothesis in the conventional t-test, causing spurious regression. We propose a new method to reduce spurious regression by applying the Cochrane-Orutt feasible generalized least squares method based on a bias-corrected method for a first-order autoregressive model in finite samples. This method eliminates the requirements for a kernel function and bandwidth selection, making it simpler to implement than the traditional heteroskedasticity and autocorrelation consistent method. A series of Monte Carlo simulations indicate that our method can decrease the probability of spurious regression among stationary, non-stationary, or trend-stationary series within a sample size of 10–50. We applied this proposed method to the actual data studied by Yule in 1926, and found that it can significantly minimize spurious regression. Thus, we deduce that there is no significant regressive relationship between the proportion of marriages in the Church of England and the mortality rate in England and Wales.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024410"
    },
    {
        "id": 17662,
        "title": "Rational information search in welfare-tradeoff cognition",
        "authors": "Tadeg Quillien",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cognition.2022.105317"
    },
    {
        "id": 17663,
        "title": "Understanding Models and Model Bias with Gaussian Processes",
        "authors": "Thomas Cook, Nathan Palmer",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18651/rwp2023-07"
    },
    {
        "id": 17664,
        "title": "Model-Agnostic Bias Measurement in Link Prediction",
        "authors": "Lena Schwertmann, Manoj Prabhakar Kannan Ravi, Gerard de Melo",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.121"
    },
    {
        "id": 17665,
        "title": "A Simple Solution to the Potential Bias Induced by Information Criteria in Asymmetric GARCH Model Selection",
        "authors": "Lorenzo Franchi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4519857"
    },
    {
        "id": 17666,
        "title": "CNN Pretrained Model with Shape Bias using Image Decomposition",
        "authors": "Akinori Iwata, Masahiro Okuda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1561/116.00000113"
    },
    {
        "id": 17667,
        "title": "Impact of epistemic uncertainty on tradeoff in model-based decision support for methane hydrate development system design",
        "authors": "Kenya Suzuki, Ryota Wada, Yoshihiro Konno, Kazuo Hiekata, Takashi Nanjo, Sadao Nagakubo",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apenergy.2023.122408"
    },
    {
        "id": 17668,
        "title": "Unspanned Risk and Risk-Return Tradeoff",
        "authors": "Huacheng Zhang, Guofu Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4344929"
    },
    {
        "id": 17669,
        "title": "Statüko Yanlılığına İlişkin Bir Literatür İncelemesi ve Teorik Bir Model Önerisi",
        "authors": "Mehmet YİĞİT",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Statüko yanlılığı, hayat boyu verdiğimiz binlerce kararı etkileyen bilişsel bir yanlılıktır. Bu çalışmanın amacı, bizi çoğu zaman eylemsizliğe iten bu yanlılığı açıklayacak teorik bir model önermektir. Literatür taraması sonucu statüko etkisinin açıklayanları kişisel özellikler ve başka bazı bilişsel yanlılıklar olarak ele alınmıştır. Bu yanlılıklar batık maliyet yanlılığı, kayıptan kaçınma ve ihmal yanlılığıdır. Öte yandan pişmanlıktan kaçınma davranışı da statüko etkisini doğrudan açıklama potansiyeli olan değişkenlerden biri olarak ele alınmıştır. Bilişsel yansıma değişkeni ise, insanların ikinci sistemlerini kullanabilme yeteneklerinin bir ölçüsü olarak, bütün bilişsel yanlılıkların temelinde olabileceği fikrinden hareketle modele dahil edilmiştir. Ortaya konulan teorik model statüko yanlılığını besleyen kanalları aydınlatma potansiyeline sahiptir. Bu sayede statüko yanlılığına hangi durumlarda nasıl müdahale edilebileceğiyle ilgili öngörü ve politika önerileri geliştirilebilecektir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25204/iktisad.1354476"
    },
    {
        "id": 17670,
        "title": "Retracted: Performance Evaluation Model of Short-Term Mutual Funds Based on Return-Variance-Liquidity",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9784062"
    },
    {
        "id": 17671,
        "title": "A theoretical model of dietary lipid variance as the origin of primary ciliary dysfunction in preeclampsia",
        "authors": "Nancy R. Hart",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Serving as the cell’s key interface in communicating with the outside world, primary cilia have emerged as an area of multidisciplinary research interest over the last 2 decades. Although the term “ciliopathy” was first used to describe abnormal cilia caused by gene mutations, recent studies focus on abnormalities of cilia that are found in diseases without clear genetic antecedents, such as obesity, diabetes, cancer, and cardiovascular disease. Preeclampsia, a hypertensive disease of pregnancy, is intensely studied as a model for cardiovascular disease partially due to many shared pathophysiologic elements, but also because changes that develop over decades in cardiovascular disease arise in days with preeclampsia yet resolve rapidly after delivery, thus providing a time-lapse view of the development of cardiovascular pathology. As with genetic primary ciliopathies, preeclampsia affects multiple organ systems. While aspirin delays the onset of preeclampsia, there is no cure other than delivery. The primary etiology of preeclampsia is unknown; however, recent reviews emphasize the fundamental role of abnormal placentation. During normal embryonic development, trophoblastic cells, which arise from the outer layer of the 4-day-old blastocyst, invade the maternal endometrium and establish extensive placental vascular connections between mother and fetus. In primary cilia of trophoblasts, Hedgehog and Wnt/catenin signaling operate upstream of vascular endothelial growth factor to advance placental angiogenesis in a process that is promoted by accessible membrane cholesterol. In preeclampsia, impaired proangiogenic signaling combined with an increase in apoptotic signaling results in shallow invasion and inadequate placental function. Recent studies show primary cilia in preeclampsia to be fewer in number and shortened with functional signaling abnormalities. Presented here is a model that integrates preeclampsia lipidomics and physiology with the molecular mechanisms of liquid–liquid phase separation in model membrane studies and the known changes in human dietary lipids over the last century to explain how changes in dietary lipids might reduce accessible membrane cholesterol and give rise to shortened cilia and defects in angiogenic signaling, which underlie placental dysfunction of preeclampsia. This model offers a possible mechanism for non-genetic dysfunction in cilia and proposes a proof-of-concept study to treat preeclampsia with dietary lipids.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fmolb.2023.1173030"
    },
    {
        "id": 17672,
        "title": "Can we enhance working memory? Bias and effectiveness in cognitive training studies",
        "authors": "Jose A. Rodas, Afroditi A. Asimakopoulou, Ciara M. Greene",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "AbstractMeta-analyses have found that working memory (WM) can be improved with cognitive training; however, some authors have suggested that these improvements are mostly driven by biases in the measurement of WM, especially the use of similar tasks for assessment and training. In the present meta-analysis, we investigated whether WM, fluid intelligence, executive functions, and short-term memory can be improved by cognitive training and evaluated the impact of possible sources of bias. We performed a risk of bias assessment of the included studies and took special care in controlling for practice effects. Data from 52 independent comparisons were analyzed, including cognitive training aimed at different cognitive functions. Our results show small improvements in WM after training (SMD = 0.18). Much larger effects were observed when the analysis was restricted to assessment tasks similar to those used for training (SMD = 1.15). Fluid intelligence was not found to improve as a result of training, and improvements in WM were not related to changes in fluid intelligence. Our analyses did however indicate that cognitive training can improve specific executive functions. Contrary to expectations, a set of meta-regressions indicated that characteristics of the training programme, such as dosage and type of training, do not have an impact on the effectiveness of training. The risk of bias assessment revealed some concerns in the randomization process and possible selective reporting among studies. Overall, our results identified various potential sources of bias, with the most significant being the choice of assessment tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3758/s13423-024-02466-8"
    },
    {
        "id": 17673,
        "title": "The Unbearable Unaccountability of Academia: A Critical Review of Implicit Bias Training for the Racialization of Discipline",
        "authors": "Dosun Ko, Aydin Bal",
        "published": "2024-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/00131946.2023.2280640"
    },
    {
        "id": 17674,
        "title": "Research on Sports Training Model Based on Training 3D Modeling Technology",
        "authors": "Lingguang Zhu, Jian Xu",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "The Visual C++ development environment is used, combined with computer simulation software programming and programs to realize the virtual reality of sports training, and realize the comprehensive attack drill of sports training in various sports training environments. Finally, a simulation study is carried out on the 3D model of basketball movement. Research has shown that simulation techniques are able to achieve better training scenarios than reality. It can be used for full attack practice in sports. This system provides a rich set of teaching methods for athletes' comprehensive attack, which helps athletes to have a correct understanding of various tactical systems in the game. It can promote the scientific development of sports teaching.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/syk9wv96"
    },
    {
        "id": 17675,
        "title": "Data Driven Model to Investigate Political Bias in Mainstream Media",
        "authors": "Eric Ness, Arooj Fatima, Mahdi Maktabdar Oghaz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3270630"
    },
    {
        "id": 17676,
        "title": "Prediction of etch bias using random forest model",
        "authors": "Wenrui Wang, Hua Shao, Rui Chen, Yayi Wei",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3010574"
    },
    {
        "id": 17677,
        "title": "Developing a Natural Language Understanding Model to Characterize Cable News Bias",
        "authors": "Seth P. Benson, Iain J. Cruickshank",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3369490"
    },
    {
        "id": 17678,
        "title": "DCCRN-KWS: An Audio Bias Based Model for Noise Robust Small-Footprint Keyword Spotting",
        "authors": "Shubo Lv, Xiong Wang, Sining Sun, Long Ma, Lei Xie",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1184"
    },
    {
        "id": 17679,
        "title": "A Probabilistic Position Bias Model for Short-Video Recommendation Feeds",
        "authors": "Olivier Jeunen",
        "published": "2023-9-14",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3604915.3608777"
    },
    {
        "id": 17680,
        "title": "Learning-Based Model Predictive Control for Vehicles with Modeling Bias",
        "authors": "Xudong Qi, Libin Zhang, Ping Wang, Yu Han, Wanquan Lin",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10241232"
    },
    {
        "id": 17681,
        "title": "Constrained monotone mean–variance investment-reinsurance under the Cramér–Lundberg model with random coefficients",
        "authors": "Xiaomin Shi, Zuo Quan Xu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sysconle.2024.105796"
    },
    {
        "id": 17682,
        "title": "Faculty/Staff Training to Examine Racial Implicit Bias: Findings and Implications for Creating Inclusive Educational Spaces",
        "authors": "Corinne Corte, Audrey Amrein-Beardsley",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10755-023-09673-6"
    },
    {
        "id": 17683,
        "title": "Denoising after Entropy-Based Debiasing a Robust Training Method for Dataset Bias with Noisy Labels",
        "authors": "Sumyeong Ahn, Se-Young Yun",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Improperly constructed datasets can result in inaccurate inferences. For instance, models trained on biased datasets perform poorly in terms of generalization (i.e., dataset bias). Recent debiasing techniques have successfully achieved generalization performance by underestimating easy-to-learn samples (i.e., bias-aligned samples) and highlighting difficult-to-learn samples (i.e., bias-conflicting samples). However, these techniques may fail owing to noisy labels, because the trained model recognizes noisy labels as difficult-to-learn and thus highlights them. In this study, we find that earlier approaches that used the provided labels to quantify difficulty could be affected by the small proportion of noisy labels. Furthermore, we find that running denoising algorithms before debiasing is ineffective because denoising algorithms reduce the impact of difficult-to-learn samples, including valuable bias-conflicting samples. Therefore, we propose an approach called denoising after entropy-based debiasing, i.e., DENEB, which has three main stages. (1) The prejudice model is trained by emphasizing (bias-aligned, clean) samples, which are selected using a Gaussian Mixture Model. (2) Using the per-sample entropy from the output of the prejudice model, the sampling probability of each sample that is proportional to the entropy is computed. (3) The final model is trained using existing denoising algorithms with the mini-batches constructed by following the computed sampling probability. Compared to existing debiasing and denoising algorithms, our method achieves better debiasing performance on multiple benchmarks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i1.25088"
    },
    {
        "id": 17684,
        "title": "Joint point and variance estimation under a hierarchical Bayesian model for survey count data",
        "authors": "Terrance D. Savitsky, Julie Gershunskaya, Mark Crankshaw",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/22-aoas1704"
    },
    {
        "id": 17685,
        "title": "Determination of the change in variance components due to heat stress in dairy cattle using a random regression model",
        "authors": "Ayşe PINARBAŞI, Kemal YAZGAN",
        "published": "2023-9-19",
        "citations": 0,
        "abstract": "The aim of this study is to evaluate changes in variance components for dairy cows under heat stress conditions using a random regression model. The daily milk yield and pedigree records used in the research were obtained from a dairy farm in Sanliurfa, affiliated with The General Directorate of Agricultural Enterprises (TIGEM), a public institution. Records were from Holstein dairy cows registered between 2017 and 2019 in the farm. A total of 690 lactations from healthy dairy cows were used in the study. Among these lactations, 278, 130, 135, and 147 were the first, second, third, and fourth or higher lactations, respectively. In addition to this, the total number of cow-days was 207 003. In order to evaluate heat stress on animals meteorological data were used and collected from a public weather station in Sanliurfa, which is operated by the Turkish State Meteorological Service authorized by the Ministry of Environment, Urbanization, and Climate Change of the Republic of Türkiye. In the study, variance components were separately estimated for the comfort period (CP) and the heat stress period (HSP) using a random regression test-day model and six-knot linear spline function was used. In the study, it was observed that heat stress resulted in an increase in additive genetic, permanent environmental, and consequently, phenotypic variance. During the lactation period, the average heritability was determined to be 0.13±0.007 for CP, while it was found to be 18±0.010 for HSP. According to the findings obtained from the study, it was concluded that the time periods for selection should coincide with the peak milk yield under heat stress conditions, while for the period without heat stress, it should be around the 120th day of lactation. These results indicate that climatic factors such as temperature and humidity should be included in the models used for genetic parameter and breeding value estimation. Thus, it may be possible to identify dairy cattle that are genetically more tolerant to hot conditions. In this way, more successful outcomes can be achieved in selection studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15832/ankutbd.1298051"
    },
    {
        "id": 17686,
        "title": "Quality of Life Ratings and Proxy Bias in Primary Progressive Aphasia: Two Sides to the Story?",
        "authors": "Leanne Ruggero, Karen Croot, Lyndsey Nickels",
        "published": "2023-1",
        "citations": 1,
        "abstract": " A valid measure of quality of life is important for clinical goal setting and for evaluating interventions. In the amnestic dementias, proxy-raters (e.g. friends, families, clinicians) typically rate quality of life lower than the self-ratings given by the person with dementia – a proxy bias. This study investigated whether the same proxy bias occurs in Primary Progressive Aphasia (PPA), a language-led dementia.  Quality of life was measured in 18 individuals with PPA using self-ratings, and proxy-ratings by their main communication partner, using the Quality of Life in Alzheimer’s Disease Scale.  There was no strong evidence for proxy bias at a group level, with no consistent pattern across dyads, where proxy- and self-ratings did not show good levels of agreement. We suggest that self-ratings and proxy-ratings of quality of life in PPA are not interchangeable. Higher-powered investigation of the patterns observed here is warranted in future studies. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/15333175231177668"
    },
    {
        "id": 17687,
        "title": "The Effects of Horizontal Bias Training on Face Identification",
        "authors": "Jamie G.E. Cochrane, Ali Hashemi, Anastasia Gaykalova, Kayla Mateus, Eugenie Roudaia, Allison B. Sekuler, Patrick J. Bennett",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1167/jov.23.9.5844"
    },
    {
        "id": 17688,
        "title": "Abstract B091: Introduction of Implicit Bias Training to oncology faculty as a means to improve minority participation in cancer clinical trials",
        "authors": "Renee Taylor, Andrea Silber",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "Abstract\nBackground: Following George Floyd’s murder in May 2020, conversations about equity and bias became part of our daily national conversation. Simultaneously the COVID-19 outbreak disproportionately affected people of color which further illuminated existing disparities in outcomes. Bias training was introduced in many sectors as a strategy to address inequity. Inclusivity in healthcare is essential to develop evidence-based therapies and treatment plans. Previous studies have demonstrated the consequences when racial and ethnic minorities are excluded from research. (Hamel et al, 2016). Racial and ethnic minorities disproportionately bear adverse outcomes from cancer. Cancer clinical trials would benefit from solutions to promote inclusivity. (Khan et al. 2021) Research Purpose: The purpose of our study was to assess whether Implicit Bias Training can increase minority participation in cancer clinical trials. Methodology: The Office of Diversity, Equity, and Inclusion offered Implicit Bias Training to all clinical oncologists at the Yale Cancer Center (YCC) between May and July 2021. While 109 physicians were eligible to participate, 57 physicians were required by the department to complete this training, and 84% of these physicians completed this opportunity. We analyzed YCC clinical trial enrollment data between two time periods defined as pre-intervention and post-intervention. We selected these periods to investigate not only the efficacy of bias training but specifically bias training as an adjunct to the national conversation during the time of our study. We selected the preintervention period as January 1, 2021, to June 30, 2021. The intervention was designed to be completed by July 1, 2021 therefore the post-intervention period is defined as July 1, 2021 to December 31, 2021. Results/Summary: Our analysis showed an increase of 2.5% in the participation of Black/African American patients. There was a slight (1.5%) decrease in Hispanic patient enrollment during this time. Conclusion: Our analysis suggested that implicit bias training delivered once had only a very modest, if any, improvement in racial minority participation in cancer clinical trials. Our project focused on participation by Black/African American patients. The impediment to Hispanic participation is quite nuanced. Hispanic patients, many of whom are non-English speaking with immigration/insurance issues face additional structural barriers. We think that a different strategy is needed to better serve this patient population. While we had hoped for metrics to demonstrate greater impact from bias training, our next investigation will look at if the intervention is best delivered repeatedly. Future Work: We have not abandoned the strategy of bias training to build trust and increase Black/AA participation. After the intervention, we are interested in whether greater impact is seen over time. We have designed a survey to look at the effects of the intervention after a year. Our next step is to examine whether repeated delivery of this intervention will amplify our results.\nCitation Format: Renee Taylor, Andrea Silber. Introduction of Implicit Bias Training to oncology faculty as a means to improve minority participation in cancer clinical trials [abstract]. In: Proceedings of the 15th AACR Conference on the Science of Cancer Health Disparities in Racial/Ethnic Minorities and the Medically Underserved; 2022 Sep 16-19; Philadelphia, PA. Philadelphia (PA): AACR; Cancer Epidemiol Biomarkers Prev 2022;31(1 Suppl):Abstract nr B091.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1158/1538-7755.disp22-b091"
    },
    {
        "id": 17689,
        "title": "Regulating AI: The Corporate Innovation vs. Consumer Protection Tradeoff",
        "authors": "Kislaya Prasad",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4726374"
    },
    {
        "id": 17690,
        "title": "CO<sub>2</sub> emissions and growth: A bivariate bidimensional mean‐variance random effects model",
        "authors": "Antonello Maruotti, Pierfrancesco Alaimo Di Loro",
        "published": "2023-8",
        "citations": 1,
        "abstract": "AbstractWe introduce a bivariate bidimensional mixed‐effects regression model, motivated by the analysis of  emission levels and growth on OECD countries from 1990 to 2018. The model is able to capture heterogeneity across countries and allows for a full association structure among outcomes, assuming a discrete distribution for the random terms with a possibly different number of support points in each univariate profile. We test the behavior of the proposed approach via a simulation study, considering several factors such as the number of observed units, times, and levels of heterogeneity in the data. Empirically, we define an extended version of the STIRPAT model where all model parameters, and not only the mean, vary according to a regression model. Our empirical findings provide evidence of heterogeneous behaviors across countries and suggest the need of a flexible approach to properly reflect the heterogeneity in both the emission levels and the growth processes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/env.2793"
    },
    {
        "id": 17691,
        "title": "Transport terminology translation variance model",
        "authors": "E. Dmitrieva, I. Grubin, I. Pluzhnikova, I. Stekolschikova, I. Yudina",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0132772"
    },
    {
        "id": 17692,
        "title": "Room-Temperature Exchange Bias and Training Effect in Co/IrMn₃ Thin Films with Varying Co Layer Thicknesses",
        "authors": "Sunghyuk Song, Yongsub Kim, Sang-Koog Kim",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4283/jmag.2023.28.4.339"
    },
    {
        "id": 17693,
        "title": "Model for the cyclonic bias of convective vortices in a rotating system",
        "authors": "Jenny Dingwall, John R. Taylor",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevfluids.9.033503"
    },
    {
        "id": 17694,
        "title": "A Lightweight Speech Emotion Recognition Model with Bias-Focal Loss",
        "authors": "Shijing Hou, Huamin Yang, Ying Hu",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicsp59554.2023.10390813"
    },
    {
        "id": 17695,
        "title": "The relational-expressive dual-continuum model of clinical supervisor training.",
        "authors": "Donald W. Stewart, Edward A. Johnson",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/tep0000393"
    },
    {
        "id": 17696,
        "title": "Analysis of Forecast Bias Characteristics of Weather Model Forecast for Multiple Types of Energy Stations",
        "authors": "Siqiu Zhang, Qiushi Wen",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ispec58282.2023.10402898"
    },
    {
        "id": 17697,
        "title": "Developing an interpretation bias modification training task for alleviating loneliness in young people",
        "authors": "Laura Riddleston, Elizabeth Bangura, Olivia Gibson, Pamela Qualter, Jennifer Y.F. Lau",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.brat.2023.104380"
    },
    {
        "id": 17698,
        "title": "A novel variance estimation approach for modified Rayleigh radial model based on the Kullback-Leibler divergence",
        "authors": "maoke miao, Xiao-yu Chen, Rui Yin, JianTao Yuan, Xinyu Zhang",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3021332"
    },
    {
        "id": 17699,
        "title": "Identifying Bias in Social and Health Research: Measurement Invariance and Latent Mean Differences Using the Alignment Approach",
        "authors": "Ioannis Tsaousis, Fathima M. Jaffari",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "When comparison among groups is of major importance, it is necessary to ensure that the measuring tool exhibits measurement invariance. This means that it measures the same construct in the same way for all groups. In the opposite case, the test results in measurement error and bias toward a particular group of respondents. In this study, a new approach to examine measurement invariance was applied, which was appropriately designed when a large number of group comparisons are involved: the alignment approach. We used this approach to examine whether the factor structure of a cognitive ability test exhibited measurement invariance across the 26 universities of the Kingdom of Saudi Arabia. The results indicated that the P-GAT subscales were invariant across the 26 universities. Moreover, the aligned factor mean values were estimated, and factor mean comparisons of every group’s mean with all the other group means were conducted. The findings from this study showed that the alignment procedure is a valuable method to assess measurement invariance and latent mean differences when a large number of groups are involved. This technique provides an unbiased statistical estimation of group means, with significance tests between group pairs that adjust for sampling errors and missing data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11184007"
    },
    {
        "id": 17700,
        "title": "Cognitive control alternations in socially anxious adults: A utility for a novel attention bias modification training",
        "authors": "A. Umemoto, A. Lazarov, F. Schneier, R.P. Auerbach",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijpsycho.2023.05.028"
    },
    {
        "id": 17701,
        "title": "Functional data regression model based on functional mean variance estimation and mutual information weighted ensemble learning",
        "authors": "Jianxun Liu, Zijun Liu, Jiajian Chen",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "Functional data regression model holds significant application value in various fields such as medicine, economics, finance, and industrial manufacturing.    This paper introduces a novel functional regression method that incorporates functional mean variance estimation and mutual information weighted ensemble learning. The proposed method employs functional mean variance estimation to reduce dimension while maintaining the effective information of the predictor related to the response variable. Specifically, this method projects the random function into the function space spanned by finite dimensional basis functions to extract the underlying functional information of the original data. Additionally, considering that the number of sufficient dimension reduction sub-directions is unknown, this paper proposes a model averaging approach based on mutual information weighting to determine the importance of each sub-model. The proposed method can adaptively address the over-fitting and under-fitting problems of the prediction model. The empirical data analysis indicates that the proposed method outperforms other comparison methods in terms of smaller mean square error and absolute error, and it exhibits a certain level of robustness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v60i.10334"
    },
    {
        "id": 17702,
        "title": "Reducing cohort bias in natural language understanding systems with targeted self-training scheme",
        "authors": "Dieu-thu Le, Gabriela Hernandez, Bei Chen, Melanie Bradford",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-industry.53"
    },
    {
        "id": 17703,
        "title": "Modeling collision–coalescence in particle microphysics: numerical convergence of mean and variance of precipitation in cloud simulations using the University of Warsaw Lagrangian  Cloud Model (UWLCM) 2.1",
        "authors": "Piotr Zmijewski, Piotr Dziekan, Hanna Pawlowska",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Abstract. Numerical convergence of the collision–coalescence algorithm used in Lagrangian particle-based microphysics is studied in 2D simulations of an isolated cumulus congestus (CC) and in box and multi-box simulations of collision–coalescence. Parameters studied are the time step for coalescence and the number of super-droplets (SDs) per cell. A time step of 0.1 s gives converged droplet size distribution (DSD) in box simulations and converged mean precipitation in CC. Variances of the DSD and of precipitation are not sensitive to the time step. In box simulations, mean DSD converges for 103 SDs per cell, but variance of the DSD does not converge as it decreases with an increasing number of SDs. Fewer SDs per cell are required for convergence of the mean DSD in multi-box simulations, probably thanks to mixing of SDs between cells. In CC simulations, more SDs are needed for convergence than in box or multi-box simulations. Mean precipitation converges for 5×103 SDs, but only in a strongly precipitating cloud. In cases with little precipitation, mean precipitation does not converge even for 105 SDs per cell. Variance in precipitation between independent CC runs is more sensitive to the resolved flow field than to the stochasticity in collision–coalescence of SDs, even when using as few as 50 SDs per cell.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/gmd-17-759-2024"
    },
    {
        "id": 17704,
        "title": "Utilizing the Mean-Variance Model to Optimize Pension Investment Portfolios: A Detailed Analysis of Key Industries",
        "authors": "Yilin Yang",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "Pension investment portfolios play a pivotal role in ensuring financial security for retirees. With an aging global population, the importance of optimizing these portfolios to withstand market fluctuations and ensure steady returns becomes paramount. This study delves into the complexities of pension investment portfolios using the time-tested mean-variance model, aiming to strike a balance between risk and expected returns. Focusing on key industries like technology, entertainment, automotive, resources, and air travel, the research critically analyzes a diverse set of stocks. Methods employed include a deep analysis of expected returns, variances, covariances, and the overarching risk-return trade-off. Preliminary results underscore the nuanced nature of portfolio management and the indispensability of incorporating modern portfolio theory in pension fund management. The outcomes of this study not only aid in making informed investment decisions but also shed light on the broader social implications of robust pension fund management, emphasizing its significance in securing retirees' financial futures. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/70/20231589"
    }
]