[
    {
        "id": 8105,
        "title": "Patient Diagnostic System Using Binary Logistic Regression",
        "authors": "Ditipriya Ganguly, Mriganka Jana, R Jayaraj",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.003"
    },
    {
        "id": 8106,
        "title": "Binary Logistic Regression Analysis Using Stepwise Method on Tuberculosis Events",
        "authors": "",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30596/jmea.v2i1.12164"
    },
    {
        "id": 8107,
        "title": "Loan classification using logistic regression",
        "authors": "U. I. Behunkou, M. Y. Kovalyov",
        "published": "2023-3-29",
        "citations": 1,
        "abstract": "Objectives. The studied problem of loan classification is particularly important for financial institutions, which must efficiently allocate monetary assets between entities as part of the provision of financial services. Therefore, it is more important than ever for financial institutions to be able to identify reliable borrowers as accurately as possible. At the same time, machine learning is one of the tools for making such decisions. The aim of this work is to analyze the possibility of efficient use of logistic regression for solving the task of loan  classification.Methods. Based on the logistic regression algorithm using historical data on loans issued, the following  metrics are calculated: cost function, Accuracy, Precision, Recall и  score. Polynomial regression and  principal component analysis are used to determine the optimal set of input data for the being studied logistic regression algorithm.Results. The impact of data normalization on the final result is estimated, the optimal regularization parameter for solving this problem is determined, the impact of the balance of target values is assessed, the optimal  boundary value for the logistic regression algorithm is calculated, the influence of increasing input indicators by means of filling in missing values and using polynomials of different degrees is considered and the existing set of input indicators is analyzed for redundancy.Conclusion. The research results confirm that the application of the logistic regression algorithm for solving loan classification problems is appropriate. The use of this algorithm allows to get quickly a working loan  classification tool. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.37661/1816-0301-2023-20-1-55-74"
    },
    {
        "id": 8108,
        "title": "Enhancing Logistic Regression Using Neural Networks for Classification in Actuarial Learning",
        "authors": "George Tzougas, Konstantin Kutzkov",
        "published": "2023-2-9",
        "citations": 4,
        "abstract": "We developed a methodology for the neural network boosting of logistic regression aimed at learning an additional model structure from the data. In particular, we constructed two classes of neural network-based models: shallow–dense neural networks with one hidden layer and deep neural networks with multiple hidden layers. Furthermore, several advanced approaches were explored, including the combined actuarial neural network approach, embeddings and transfer learning. The model training was achieved by minimizing either the deviance or the cross-entropy loss functions, leading to fourteen neural network-based models in total. For illustrative purposes, logistic regression and the alternative neural network-based models we propose are employed for a binary classification exercise concerning the occurrence of at least one claim in a French motor third-party insurance portfolio. Finally, the model interpretability issue was addressed via the local interpretable model-agnostic explanations approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16020099"
    },
    {
        "id": 8109,
        "title": "Predicting Stock Markets Using Binary Logistic Regression Based on Bry-Boschan Algorithm",
        "authors": "Mujiati Dwi Kartikasari, Renanta Dzakiya Nafalana",
        "published": "2023-5-16",
        "citations": 0,
        "abstract": "In the stock market, there are bullish and bearish terms that are reflected in the movement of the stock price index. One of the stock price indexes listed on the Indonesia Stock Exchange (IDX) is the IDX Composite. Stock market conditions fluctuate along with changes in stock prices that move randomly, while investors expect market conditions to be active (bullish market). Several factors influence the movement of the IDX Composite, one of which is macroeconomic factors. The purpose of this research is to find out the condition of stock market as well as predict its condition using macroeconomics indicators. The method used to determine stock market conditions (bullish or bearish) is the Bry-Boschan algorithm, while the method used to predict the stock market using macroeconomic indicators is the binary logistic regression method. The Bry-Boschan algorithm is widely used to detect peaks and troughs in business cycle analysis. Binary logistic regression is used to model data with responses that have two categories or are in the form of binary numbers. Results show that the IDX Composite experienced 42 times (month) bearish periods and 191 times (month) experienced bullish periods. The obtained model has an accuracy value of 81.55%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30812/varian.v6i2.2385"
    },
    {
        "id": 8110,
        "title": "Clasificación binaria de artículos científicos basada en Regresión logística.",
        "authors": "Esteban Pangol",
        "published": "2023",
        "citations": 0,
        "abstract": "The objective of this project is to apply a binary classification model based on the Logistic Regression algorithm for the analysis of scientific articles. To begin with, information was collected from various scientific repositories, such as the Institute of Electrical and Electronics Engineers Inc, American Society of Civil Engineers (ASCE), among others. A spreadsheet was used to carry out this compilation. For the execution of the project, a data filtering process was carried out manually in the first instance, in order to eliminate files that did not allow access to the repositories and other problems that could affect the development of the project. Based on the information collected, a process of labeling the data in different columns using values of 0 and 1 was carried out. This procedure allowed the creation of variables to carry out a binary classification that suited the requirements of the project. After this stage, Python was selected as the programming language and the Google Collab tool was used to work more efficiently as a team. Various preprocessing techniques were applied to refine the information and prepare it for later use. Once these changes were made, the variables to be used in the analysis were selected and all the necessary requirements were established to obtain a favorable analysis. Finally, when the results were obtained, it was found that the model used was adequate for working with this information, obtaining very satisfactory data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36500/atenas.2.007"
    },
    {
        "id": 8111,
        "title": "Loan Eligibility Classification Using Logistic Regression",
        "authors": "Paul Law Lik Pao, Mohd Arfian Ismail",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsecs58457.2023.10256402"
    },
    {
        "id": 8112,
        "title": "Wart Classification Using Logistic Regression: Analysis Based on Data Partitioning, Error Rate Comparison and Feature Selection",
        "authors": "Siddharth Kumar -",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "Accurate classification of cancerous warts is pivotal for effective medical intervention, and logistic regression serves as a promising tool for this purpose. This study delves into the realm of wart classification using logistic regression, with a specific focus on three key aspects: data partitioning, error rate comparison, and feature selection. Logistic regression demonstrates commendable accuracy during training, but an observed disparity between training and testing accuracy prompts a critical examination of potential overfitting. Data partitioning unveils mixed results, enhancing overall testing accuracy while diminishing performance on partitioned datasets, emphasizing the importance of meticulous dataset splitting. Furthermore, the impact of feature selection on the model's performance is explored, underscoring the need for a detailed analysis of influential features. The study concludes by proposing future work, including addressing overfitting through regularization, investigating feature importance, exploring alternative classification algorithms, optimizing accuracy through ensemble methods, and expanding the dataset for enhanced generalization. This research contributes to the advancement of wart classification methodologies, providing insights into logistic regression's application and paving the way for refined diagnostic tools in dermatological practice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i06.11374"
    },
    {
        "id": 8113,
        "title": "DETERMINE FACTORS AFFECTING CUSTOMER LOYALTY IN BIMBINGAN BELAJAR PT. FADHIL KREATIF KOMUNIKA/SNS USING BINARY LOGISTIC REGRESSION BINER",
        "authors": "Kiki Alpiah",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "One of the problems that are often faced by tutoring institutions is student stop studying. This isi a serious proplem for a tutoring institution, including the Tutoring Institute PT. Fadhil Kreatif Komunika/SNS. This problem is greatly reduces the number of profits. There are factors that influence the studens of these tutoring institutions to stop studying. One of them is to Customer Loyalty. The purpose of thid research is to find the factors that influence customer loyslty in tutoring institute PT. Fadhil Kreatif Komunika/SNS. The research method is the binary logistic regression. The factors examined in this research are Service Quality, Costumer Satisfaction, Price and Tutor Competence. And the result of the analysis with α = 0,05 obtained a chi-square value of 122,802. Based on the the result of the Wald Test, the significant values was obtained greater than 0,05 on the variables of Service Quality and Tutor Competence, and the signigicant values was obtained less than 0,0t on the variables of Customer Satisfaction and Price. This means that there are variables that have a positive anf significant effecr on Customer Loyalty at PT. Fadhil Kreatif Komunika/SNS that is Customer Satisfaction and Price.\r\n \r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.55719/mv.v5i2.371"
    },
    {
        "id": 8114,
        "title": "Higher classification accuracy of income class using logistic regression algorithm over naive bayes algorithm",
        "authors": "Mohamed Zaid, T. Rajendran",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178999"
    },
    {
        "id": 8115,
        "title": "A Logistic Regression Model using Pearson Correlation for Breast Cancer Classification",
        "authors": "Maria Susan Anggreainy, Devi Fitrianah",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isriti60336.2023.10467792"
    },
    {
        "id": 8116,
        "title": "Classification and Prediction of Heart Disease using Novel Random Forest Algorithm by Comparing Logistic Regression for Obtaining Better Accuracy",
        "authors": "T. Poojitha, R. Mahaveerakannan",
        "published": "2023-2-14",
        "citations": 1,
        "abstract": "Aim: Heart attacks are usually caused due to blockages, partially or completely, of the heart’s veins or arteries that constrict the flow of blood from or to the heart. The primary objective of this review aims to be seen as the most appropriate algorithm to give us the ideal prediction. We will be comparing the novel Random forest with Logistic regression to find out which of these can give us the best accuracy. Material and Methods: The study used 143 samples with novel Random Forest and Logistic Regression is executed with varying training and testing splits for foreseeing the accuracy of coronary disease prediction with the 80% of G-power value and heart disease data were gathered from multiple web sources, including latest The study’s findings and criterion were 0.05%, with a 95% probability value, average, and confidence interval. The performance accuracy rate of the classifiers is used to evaluate the coronary disease dataset. There was a statistically significant value test between the novel Random Forest and Logistic Regression is 0.046 (p<0.05). Results and Discussion: The accuracy of predicting coronary disease in the novel Random Forest 90.16 % and Logistic Regression 85.25 % is obtained. Conclusion: This study concludes that the Prediction of Coronary disease using the novel Random Forest (RF) algorithm looks to be fundamentally superior to the Logistic Regression (LR) with increased precision.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15381545"
    },
    {
        "id": 8117,
        "title": "Modelling of risk factors that influence malaria infection using Binary Logistic Regression",
        "authors": "Open Darnius, Dessy Siahaan",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "Abstract\nMalaria is a parasitic disease that is currently endemic in many countries, including in Indonesia. Batubara District in North Sumatera is one of the malaria-endemic areas. This study was conducted to make a mathematical model based on risk factors that influence malaria infection. The data used is secondary data from other researchers. The method used to model risk factors that influence malaria infection is the binary logistic regression with a categorical response variable, namely diagnosis by microscopic examination. There are 10 variable predictors; mosquito nets (X\n1), quality use of mosquito nets (X\n2), condition of the livingenvironment (X\n3), knowledge (X\n4), attitudes (X\n5), actions (X\n6), quality of health workers (X\n7), use of mosquito coils (X8), use of topical insect repellent (X\n9), and access of health workers (X\n10). Maximum likelihood estimation is used to findout the parameter estimates. From the 10 predictor variables studied, it was found that only 8 variables had a significant effect on the model. Based on the odds ratio, the most significant variable is the quality of health workers with 16,5. The ability of predictor variables in explaining the response variable in the model is 87, 8%. The classification function in this study is 96, 3%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2421/1/012001"
    },
    {
        "id": 8118,
        "title": "Comparing Classification and Regression Tree and Logistic Regression Algorithms Using 5×2cv Combined F-Test on Diabetes Mellitus Dataset",
        "authors": " Fashihullisan,  Dodi Vionanda,  Yenni Kurniawati,  Fadhilah Fitri",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Classification is the process of finding a model that describes and distinguishes data classes that aim to be used to predict the class of objects whose class labels are unknown. There are several algorithms in classification, such as classification trees and regression trees (CART) and logistic regression. The k-fold cross validation method has a weakness for algorithm comparison problems it is possible at different folds to produce different error predictions, so that the results of comparing algorithm performance will also be different. There for in the problem of comparison of algorithms, the researcher will apply the 52cv t test method and the 52cv combined F test. Out of 100 iterations the 10-fold cross validation method was only consistent three times which shows that the k-fold cross validation method has poor consistency in comparing the CART algorithm and logistic regression for diabetes mellitus data. In addition, 52cv combined F test and 52cv t test methods that have been carried out show that 52cv combined F test is better used to get conclusions from the results of a comparison of the two algorithms because it only produces one decision, in contrast to 52cv t test which has the possibility to get different decisions from 10 test statistics which results makes it difficult for researchers to draw conclusions in comparing the cart algorithm and logistic regression",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss4/84"
    },
    {
        "id": 8119,
        "title": "Modelling the Misuse of Alcohol and Drugs in South Africa Using Bayesian Binary Logistic Regression",
        "authors": "",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18576/jsap/120233"
    },
    {
        "id": 8120,
        "title": "Factors Affecting Mathematics Students at Jambi University Being Infected with Covid-19 Using Binary Logistic Regression",
        "authors": "Ellys Ivone Damanik, Gusmi Kholijah, Cut Multahadah",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Pandemi global COVID-19 menimbulkan tantangan serius bagi kesehatan masyarakat, termasuk di kalangan mahasiswa. Temuan ini bertujuan untuk memahami faktor-faktor yang mempengaruhi tingkat infeksi COVID-19 di kalangan mahasiswa Matematika Universitas Jambi, dengan fokus pada persepsi keefektifan tindakan isolasi diri ataupun karantina mandiri. Temuan ini bertujuan untuk membentuk model regresi logistik biner yang dapatlah menganalisis faktor-faktor yang mempengaruhi mahasiswa Matematika Universitas Jambi terinfeksi COVID-19. Faktor yang dipertimbangkan meliputi kepatuhan terhadap protokol kesehatan, reaksi terhadap keadaan wabah, persepsi terhadap isolasi diri, kekhawatiran saat berpergian, jenis kelamin, serta jumlah orang yang tinggal serumah. Data primer diperoleh melalui distribusi kuesioner online kepada mahasiswa Program Studi Matematika Angkatan 2020-2022 di Universitas Jambi. Metode Cluster Random Sampling dipergunakan untuk pengambilan sampel. Proses analisis data melibatkan regresi logistik biner dengan estimasi maksimum likelihood (MLE), uji serentak, serta uji parsial mempergunakan uji Wald. Model terbaik diidentifikasi dengan metode Backward. Hasil analisis menunjukkan bahwasanya variable yang signifikan ialah persepsi keefektifan tindakan isolasi diri ataupun karantina mandiri (X3). Model regresi logistik tereduksi menjadi π(x) = exp(-7,731 + 1,480X3) / (1 + exp(-7,731 + 1,480X3)). Odds ratio untuk X3 ialah 3,571, menunjukkan peningkatan peluang tidaklah terinfeksi COVID-19 sebanyak 3,571 kali dengan persepsi positif terhadap tindakan isolasi diri.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62375/jsintak.v2i2.261"
    },
    {
        "id": 8121,
        "title": "Retracted: Classification of Diabetes Using Photoplethysmogram (PPG) Waveform Analysis: Logistic Regression Modeling",
        "authors": "BioMed Research International",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9808737"
    },
    {
        "id": 8122,
        "title": "Emprical Study for Algorithms Comparison of Classification and Regression Tree and Logistic Regression Using Combined 5×2cv F Test",
        "authors": " Fayza Annisa Febrianti,  Dodi Vionanda,  Yenni Kurniawati,  Fadhilah Fitri",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Classification is a method to estimate the class of an object based on its characteristics. Several learning algorithms can be applied in classification, such as Classification and Regression Tree (CART) and logistic regression. The main goal of classification is to find the best learning algorithm that can be applied to get the best classifier. In comparing two learning algorithms, a direct comparison by seeing the smaller prediction error rate may be possible when the difference is very clear. In this case, direct comparison is misleading and resulting inadequate conclusions. Therefore, a statistical test is needed to determine whether the difference is real or random. The results of the 5×2cv paired t-test sometimes reject and sometimes fail to reject the hypothesis. It is distracting because the changing of the error rate difference should not affect the test result. Meanwhile, the overall results of the combined 5×2cv F test show that the tests fail to reject the hypothesis. This indicates that CART and logistic regression perform identically in this case.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss4/85"
    },
    {
        "id": 8123,
        "title": "Transfer Learning for Feral Cat Classification Using  Logistic Regression",
        "authors": "Fazli Nugraha Tambunan, Rika Rosnelly, Zakarias Situmorang",
        "published": "2023-3-5",
        "citations": 0,
        "abstract": "Machine learning is an alternative tool for classifying animal species, especially feral cats. In this research, we use a machine learning algorithm to classify three species of feral cats: American Wildcat, Black-footed Cat, and European Wildcat. We also use a transfer learning model using the VGG-19 network for extracting the features in the feral cat images. By combining the VGG-19 and logistic regression algorithm, we build six models and compare which one is the best to solve the problem. We evaluate and analyze all models using a 5-fold, 10-fold, and 20- fold cross-validation, with accuracy, precision, and recall as the base performance value. The best result obtained is a model with a lasso regularization and cost parameter value of 1, with an accuracy value of 0.846667, a precision value of 0.845389, and a recall value of 0.846667. We also tune the C parameter in each LR model with values such as 0.1, 0.5, and 1. The most optimum C value for the lasso and ridge regularization is one, resulting in an average value of accuracy = 0.813, precision = 0.812, and recall = 0.813.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35842/icostec.v2i1.30"
    },
    {
        "id": 8124,
        "title": "Considerations for running and interpreting a binary logistic regression analysis – a research note",
        "authors": "Emma Beacom",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "This research note discusses key considerations for analysis of categorical data using a Pearson’s chi-square and binary logistic regression. It draws on experience from analysis of a country-level household survey (Northern Ireland Health Survey 2014/15), using SPSSv25, that examined the relationship between household food insecurity status and identified demographic predictors, using Pearson’s Chi-Square test to check associations and binary logistic regressions to derive the predictive models. This note presents an overview of the assumptions for both tests which must be satisfied to ensure the tests are appropriate, discusses the usefulness of using Pearson’s Chi-Square test as a preliminary test before using binary logistic regression, and presents an overview of how to interpret the output from a binary logistic regression model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22375/dbr.v5i.85"
    },
    {
        "id": 8125,
        "title": "Classification of Hypertension in Pregnant Women Using Multinomial Logistic Regression",
        "authors": "Yuniar Farida, Roro Niken Enggar Tiasti, Silvia Kartika Sari",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Maternal Mortality Rate (MMR) is still a crucial problem in Indonesia and other developing countries; one of the causes is Hypertension in Pregnancy (HDK). This study aims to classify hypertension in pregnant women based on the factors that influence it, with a case study of patients from the Obstetrics and Gynecology Specialist Clinic at the Regional General Hospital (RSUD) Dr. R. Sosodoro Djatikoesoemo Bojonegoro. The variables used were age, gravidity, gestational age, obesity, history of abortion, hypertension, and diabetes mellitus. The research method used in this study is multinomial logistic regression because it uses four categories of dependent variables, namely pregnant women without hypertension, pregnant women with chronic hypertension, pregnant women with gestational hypertension, and pregnant women with preeclampsia. The results obtained in this study were from 3 categories of hypertension in pregnant women; the influencing factors were obesity, gestational age > 36 weeks, having a history of hypertension, and diabetes mellitus, with the resulting model classification accuracy value of 79.6%, which means the classification is classified as good. This research contributes to applying statistical methods in the health sector and as a mitigation effort to help minimize the number (prevalence) of maternal deaths, especially those caused by hypertension. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/jtam.v7i4.16481"
    },
    {
        "id": 8126,
        "title": "A Comparative Study on Document Images Classification using Logistic Regression and Multiple Linear Regressions",
        "authors": "Bipin Nair B J, S. Yadhukrishnan, Manish. A",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250671"
    },
    {
        "id": 8127,
        "title": "An Interactive Spreadsheet Model for Teaching Classification Using Logistic Regression",
        "authors": "Vahid Roshanaei, Bahman Naderi, Opher Baron, Dmitry Krass",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": " We present an interactive spreadsheet that supports teaching essential concepts in classification using the logistic regression (LoR) model for binary classification. The interactive spreadsheet demonstrates the capabilities of LoR by integrating computation with visualization. Students will reinforce concepts like probabilities, maximum likelihood estimation (MLE), and the use of likelihoods to optimize parameters for the LoR. We then discuss using LoR for classifications while adjusting its decision boundary (DB), demonstrating how to convert assigned likelihoods into classification using the DB; impact classification outcome by varying DBs; designate predictions as true positive, true negative, false positive, or false negative; and determine the classification accuracy. We use a variety of performance measures, including sensitivity, specificity, precision, negative predictive value, F1 and F2 scores, the receiver operating characteristics curve, and lift/decile charts. These measures are dynamically adjusted when the DB changes. We also reiterate the usage of these measures in the context of crossvalidation and imbalanced data sets. We provide a case study that implements LoR and an option for teaching the details behind MLE. We discuss the pedagogical aspects of this spreadsheet based on a survey of the 2022 student cohort in the Master of Management Analytics Program at the Rotman School of Management. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/ited.2022.0022"
    },
    {
        "id": 8128,
        "title": "A STATISTICAL ANALYTICS OF MIGRATION USING BINARY BAYESIAN LOGISTIC REGRESSION",
        "authors": "Devi Azarina Manzilir Rohmah, Ani Budi Astuti, Achmad Efendi",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Binary logistic regression is utilized in research to understand the relationship between multiple independent variables and a binary response variable. In logistic regression modelling, parameter estimation is regarded as a vital stage. The performance of this estimation is often affected by the sample size and data characteristics, and to deal with this problem, the Bayesian method can be employed as an estimation. This research aims to use Regression Logistic with Bayesian estimation to figure out the determinant of recent in-migrants status in Special Region of Yogyakarta 2021, where Yogyakarta’s recent in-migrants in 2021 took the first position in Indonesia, whereas this city has the lowest regional minimum wage in Indonesia. The Bayesian method was used in this study to obtain a better estimate than previous studies using maximum likelihood estimation, because Bayesian is unbiased for unbalanced cases which are often found in logistic regression. This research results show that particular variables such as resident age, resident marital status, resident main activities, resident latest education, and resident homeownership have significant effect on resident migrating to Special Region of Yogyakarta, Indonesia",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol17iss3pp1725-1738"
    },
    {
        "id": 8129,
        "title": "Detection of Phishing Domain Using Logistic Regression Technique and Feature Extraction Using BERT Classification Model",
        "authors": "Khushi Mittal, Kanwarpartap Singh Gill, Rahul Chauhan, Mukesh Singh, Deepak Banerjee",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442975"
    },
    {
        "id": 8130,
        "title": "Analysis of the Poverty Level Model for West Sumatra Province Using Geographically Weighted Binary Logistic Regression",
        "authors": " April leniati,  Dony Permana,  Nonong Amalita,  Zamahsary Martha",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Poverty is a widespread social problem that affects many developing countries, including Indonesia. The province of West Sumatra has a relatively low poverty rate of around 5.92 percent, making it the third lowest on the island of Sumatra. However, there are several districts and cities in this province that still have many people living in poverty. Various factors such as income levels, social conditions, and access to education, can contribute to the poverty gap in various regions. Geographically Weighted Binary Logistic Regression (GWBLR) is used to examine the relationship between poverty and geographic factors. GWBLR is a statistical analysis technique that takes geographic variables into account when the response variable is categorical or dichotomous. This approach incorporates a bandwidth-dependent weighting function. By conducting a fit test using R software, it is known that the Fcount value is greater than the Ftable value, indicating a significant difference between the logistic regression model and GWBLR. The results show that the GWBLR model with Fixed Gaussian Kernel weights is the most effective in analyzing poverty in the province. This model shows the lowest Akaike Information Criterion (AIC) value. Furthermore, this study identifies the Life Expectancy Variable as a significant factor affecting poverty in certain districts and cities in West Sumatra Province in 2022.\r\n \r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss4/80"
    },
    {
        "id": 8131,
        "title": "Fundus Image Classification for Glaucoma using U-Net Architecture and Logistic Regression",
        "authors": "Vanshika Bajaj, Deepali M. Kotambkar Shelke",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pcems58491.2023.10136097"
    },
    {
        "id": 8132,
        "title": "Combining Simulated Annealing with Logistic Regression for Binary Combinatorial Optimization Problems",
        "authors": "Selma Kali Ali, Dalila Boughaci",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnsc58704.2023.10318995"
    },
    {
        "id": 8133,
        "title": "Epidemiological Study of Cardiopathies and Valvulopathies using Binary Logistic Regression",
        "authors": "Houneida Sakly, Mourad Said, Rachid Jennane, Moncef Tagina",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42488-023-00094-w"
    },
    {
        "id": 8134,
        "title": "Classification of Predicting Customer Ad Clicks Using Logistic Regression and k-Nearest Neighbors",
        "authors": "Yasi Dani, Maria Artanta Ginting",
        "published": "2023-1-21",
        "citations": 2,
        "abstract": "Nowadays, conventional marketing techniques have changed to online (digital) marketing techniques requiring internet access. Online marketing techniques have many advantages, especially in terms of cost efficiency and fast information delivery to the public. Therefore, many companies are interested in online marketing and advertising on social media platforms and websites. However, one of the challenges for companies in online marketing is determining the right target consumers since if they target consumers who are not interested in buying the product, the advertising costs will be high. One use of online advertising is clicks on ads which is a marketing measurement of how many users click on the online ad. Thus, companies need a click prediction system to know the right target consumers. And different types of advertisers and search engines rely on modeling to predict ad clicks accurately. This paper constructs the customer ad clicks prediction model using the machine learning approach that becomes more sophisticated in effectively predicting the probability of a click. We propose two classification algorithms: the logistic regression (LR) classifier, which produces probabilistic outputs, and the k-nearest neighbors (k-NN) classifier, which produces non-probabilistic outputs. Furthermore, this study compares the two classification algorithms and determines the best algorithm based on their performance. We calculate the confusion matrix and several metrics: precision, recall, accuracy, F1-score, and AUC-ROC. The experiments show that the logistic regression algorithm performs best on a given dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30630/joiv.7.1.1017"
    },
    {
        "id": 8135,
        "title": "Classification of Daily Body Weight Gains in Beef Calves Using Decision Trees, Artificial Neural Networks, and Logistic Regression",
        "authors": "Wilhelm Grzesiak, Daniel Zaborski, Renata Pilarczyk, Jerzy Wójcik, Krzysztof Adamczyk",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "The aim of the present study was to compare the predictive performance of decision trees, artificial neural networks, and logistic regression used for the classification of daily body weight gains in beef calves. A total of 680 pure-breed Simmental and 373 Limousin cows from the largest farm in the West Pomeranian Province, whose calves were fattened between 2014 and 2016, were included in the study. Pre-weaning daily body weight gains were divided into two categories: A—equal to or lower than the weighted mean for each breed and sex and B—higher than the mean. Models were developed separately for each breed. Sensitivity, specificity, accuracy, and area under the curve on a test set for the best model (random forest) were 0.83, 0.67, 0.76, and 0.82 and 0.68, 0.86, 0.78, and 0.81 for the Limousin and Simmental breeds, respectively. The most important predictors were daily weight gains of the dam when she was a calf, daily weight gains of the first calf, sex of the third calf, milk yield at first lactation, birth weight of the third calf, dam birth weight, dam hip height, and second calving season. The selected machine learning models can be used quite effectively for the classification of calves based on their daily weight gains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ani13121956"
    },
    {
        "id": 8136,
        "title": "Land Use Change Modelling Using Logistic Regression, Random Forest and Additive Logistic Regression in Kubu Raya Regency, West Kalimantan",
        "authors": "Alfa Nugraha Pradana, Anik Djuraidah, Agus Mohamad Soleh",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "Kubu Raya Regency is a regency in the province of West Kalimantan which has a wetland ecosystem including a high-density swamp or peatland ecosystem along with an extensive area of mangroves. The function of wetland ecosystems is essential for fauna, as a source of livelihood for the surrounding community and as storage reservoir for carbon stocks. Most of the land in Kubu Raya Regency is peatland. As a consequence, peat has long been used for agriculture and as a source of livelihood for the community. Along with the vast area of peat, the regency also has a potential high risk of peat fires. This study aims to predict land use changes in Kubu Raya Regency using three statistical machine learning models, specifically Logistic Regression (LR), Random Forest (RF) and Additive Logistic Regression (ALR). Land cover map data were acquired from the Ministry of Environment and Forestry and subsequently reclassified into six types of land cover at a resolution of 100 m. The land cover data were employed to classify land use or land cover class for the Kubu Raya regency, for the years 2009, 2015 and 2020. Based on model performance, RF provides greater accuracy and F1 score as opposed to LR and ALR. The outcome of this study is expected to provide knowledge and recommendations that may aid in developing future sustainable development planning and management for Kubu Raya Regency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23917/forgeo.v37i2.23270"
    },
    {
        "id": 8137,
        "title": "Phishing URL Classification Using K-Nearest Neighbour and Logistic Regression Machine Learning Approaches",
        "authors": "Muskan Singla, Kanwarpartap Singh Gill, Rahul Chauhan, Vijay Singh, Deepak Banerjee",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442844"
    },
    {
        "id": 8138,
        "title": "The use of the binary spline logistic regression model on the nutritional status data of children",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/7935"
    },
    {
        "id": 8139,
        "title": "Lung Cancer Disease Prediction and Classification based on Feature Selection method using Bayesian Network, Logistic Regression, J48, Random Forest, and Naïve Bayes Algorithms",
        "authors": "J. Viji Cripsy, T. Divya",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsmdi57622.2023.00066"
    },
    {
        "id": 8140,
        "title": "Optimizing a Binary Logistic Regression model by Hyperparameter tuning",
        "authors": "Arnav Oberoi, Om Sehgal, Chirag Malik",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29322/ijsrp.13.07.2023.p13913"
    },
    {
        "id": 8141,
        "title": "The Impact of Practicing Exercise and Risk Factors Categorize in Osteoporotic Concerning Postmenopausal Women (Analytical study using binary logistic regression)",
        "authors": "Raed Farooq Khaleel ,, Abdulkaliq Abduljabbar Ali ,, Suhair Mohammed Hassoon",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "Background: Osteoporosis is an illness that may be categorized as a \"silent pandemic\" because of its worldwide incidence. The essential characteristics of osteoporosis are bone mass reduction and degeneration in bone tissue's micro-architecture. Postmenopausal osteoporosis (PMO) seems to be the most prevalent skeletal disorder.\r\nObjective: To study investigates the influence of practicing exercise and physical activity as the most critical contributing factors of osteoporosis in postmenopausal women.\r\nPatients and Methods: A cross-sectional survey was conducted at Baghdad Teaching Hospital from July 1, 2021, to December 31, 2021. Data were collected directly through interviews using a special questionnaire. One hundred and fifty postmenopausal women with osteoporosis participated in this study. A rheumatologist clinically diagnosed all participants using a bone density screening (DEXA).\r\nResults: the current study's results indicate the prevalence of osteoporosis among postmenopausal women, with a higher percentage of 69.3% in the age group (≥50 years). 60.7% of all participants were overweight and obese according to body mass index (BMI). Calcium deficiency was found in 87.3% of the subjects, more than two third (76%) of them were not practicing exercises, and 86.7% suffered from vitamin D deficiency. Reclassifying the actual and wrong percentile demonstrates the accurate percentile (overall percentage = 78.7), 32 individuals were wrongly classified, and the probability of total error was reported at around 21.3%. The most important finding was that postmenopausal women with osteoporosis who exercised and participated in physical activity regularly were 13.7 times in better health than those who did not exercise.\r\nConclusion: Exercising and physical activity lower risk factors for postmenopausal women. It is becoming more necessary to reconsider the importance of performing exercises in maintaining and enhancing postmenopausal women's health.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26505/djm.v25i2.1060"
    },
    {
        "id": 8142,
        "title": "IDENTIFY FACTORS AFFECTING STUDENT ACHIEVEMENT USING THE BINARY LOGISTIC REGRESSION ANALYSIS",
        "authors": " Nursalam, Qardawi Hamzah,  Baharuddin, Andi Kusumayanti,  A. Sriyanti",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "The success of students in completing their study program is indicated by the achievements reflected in their Grade Point Average (GPA). Grade Point Average (GPA) is expressed in numerical form and is an academic achievement calculated based on all courses taken in all semesters that have been passed by students. This study aims to obtain a model of external factors that affect Grade Point Average (GPA) and variables that affect Grade Point Average (GPA). The response variable in this study is Grade Point Average (GPA) which is categorical and divided into two categories. The method used is binary logistic regression analysis. This study used primary data with the research subjects being second, third, and fourth-semester students in the Mathematics Education Department of Alauddin Makassar State Islamic University. The indicators on the instrument can be categorized as valid and reliable to measure service variables, learning, facilities and infrastructure, and student interest in entering college. The results of binary logistic regression analysis show that service has a significant effect on Grade Point Average (GPA), besides that learning, facilities, infrastructure, and the number of students enrolling in college have an effect but are not significant on Grade Point Average (GPA).",
        "keywords": "",
        "link": "http://dx.doi.org/10.24252/mapan.2023v11n2a11"
    },
    {
        "id": 8143,
        "title": "Gender Classification from Skeletons Lengths and Body Measurements Using a Logistic Regression Model",
        "authors": "Jularat Chumnaul, Kritiyaporn Bilarli, Panthipa Wannangu",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14416/j.kmutnb.2024.02.001"
    },
    {
        "id": 8144,
        "title": "Crime Prediction Model using Three Classification Techniques: Random Forest, Logistic Regression, and LightGBM",
        "authors": "Abdulrahman Alsubayhin, Muhammad Sher Ramzan, Bander Alzahrani",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150123"
    },
    {
        "id": 8145,
        "title": "Comparison analysis of Bangla news articles classification using support vector machine and logistic regression",
        "authors": "Md Gulzar Hussain, Babe Sultana, Mahmuda Rahman, Md Rashidul Hasan",
        "published": "2023-6-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12928/telkomnika.v21i3.23416"
    },
    {
        "id": 8146,
        "title": "Gene expression data classification with robust sparse logistic regression using fused regularisation",
        "authors": "Rahul Bhandari, Pemula Rambabu, G. Vijay Suresh, Kampa Lavanya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijahuc.2023.10055696"
    },
    {
        "id": 8147,
        "title": "Validate students performance based on enrolled module using classification technique of novel naive bayes comparing with logistic regression",
        "authors": "C. Vamsi Krishna, S. Ashokkumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0179810"
    },
    {
        "id": 8148,
        "title": "CHRONIC FATIGUE PREDICTION IN GRANULOMATOSIS WITH POLYANGIITIS PATIENTS: A BINARY LOGISTIC REGRESSION APPROACH",
        "authors": "Alexandre Moura dos Santos, Sarah Luiza Gomes da Silva, Samuel Katsuyuki Shinjo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47660/cbr.2023.1807"
    },
    {
        "id": 8149,
        "title": "Wet and Dry Cough Classification System Using Support Vector Machine and Logistic Regression",
        "authors": "P.Co Sean Andrei, Claudine Anne J. Madamba, Maria Leonora C. Guico, Jan Kevin A. Galicia",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccce58854.2023.10246105"
    },
    {
        "id": 8150,
        "title": "Gene expression data classification with robust sparse logistic regression using fused regularisation",
        "authors": "Kampa Lavanya, Pemula Rambabu, G. Vijay Suresh, Rahul Bhandari",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijahuc.2023.130470"
    },
    {
        "id": 8151,
        "title": "A Machine Learning Approach to Rock and Mine Classification in Sonar Systems Using Logistic Regression",
        "authors": "Suhail Javed Quraishi, Malikhan Singh, Sujit Kumar Prasad, Kavita Arora, Sonal Pathak, Anupam Singh",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390008"
    },
    {
        "id": 8152,
        "title": "Financial inclusion dataset classification in Eswatini using support vector machine and logistic regression",
        "authors": "Stephen Gbenga Fashoto, Boluwaji A. Akinnuwesi, Elliot Mbunge, Andile S. Metfula",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbis.2023.132811"
    },
    {
        "id": 8153,
        "title": "Human Error Analysis and Modeling of Medication-Related Adverse Events in Taiwan Using the Human Factors Analysis and Classification System and Logistic Regression",
        "authors": "Shu-Huan Ko, Min-Chih Hsieh, Run-Feng Huang",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "Medical institutions worldwide strive to avoid adverse medical events, including adverse medication-related events. However, studies on the comprehensive analysis of medication-related adverse events are limited. Therefore, we aimed to identify the error factors contributing to medication-related adverse events using the Human Factors Analysis and Classification System (HFACS) and to develop error models through logistic regression. These models calculate the probability of a medication-related adverse event when a healthcare system defect occurs. Seven experts with at least 12 years of work experience (four nurses and three pharmacists) were recruited to analyze thirty-seven medication-related adverse events. The findings indicate that decision errors, physical/mental limitations, failure to correct problems, and organizational processes were the four factors that most frequently contributed to errors at the four levels of the HFACS. Seven error models of two types (error occurrence and error analysis pathways) were established using logistic regression models, and the relative probabilities of failure factor occurrences were calculated. Based on our results, medical staff can use the error models as a new analytical approach to improve and prevent adverse medication events, thereby improving patient safety.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11142063"
    },
    {
        "id": 8154,
        "title": "Ability of ordinal spline logistic regression model in the classification of nutritional status data",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/8072"
    },
    {
        "id": 8155,
        "title": "Comparison of Logistic Regression and Discriminant Analysis for Classification of Multicollinearity Data",
        "authors": "Autcha Araveeporn",
        "published": "2023-2-16",
        "citations": 1,
        "abstract": "The objective of this study is to concentrate on the classification method of the logistic regression and the discriminant analysis by using the simulation dataset and the liver patients as the actual data. These datasets are used the binary dependent variable depending on the correlated independent variables or called multicollinearity data. The standard classification method is logistic regression, which uses the logit function’s probability to conduct the dichotomous dependent variable. The iteration process can be solved to estimate logit function parameters and explain the relationship between a dependent binary variable and independent variables. Discriminant analysis is a powerful classification based on linear discriminant analysis (LDA), quadratic discriminant analysis (QDA), and regularized discriminant analysis (RDA). These methods consider the decision boundaries by building a classifier model on the multivariate normal distribution. LDA defines the standard covariance matrix, but QDA has an individual covariance matrix. RDA extends from QDA by setting the regularized parameter to estimate the covariance matrix. In the case of the simulation study, the independent variables are generated by defining the constant correlation on the multivariate normal distribution that made the multicollinearity problem. Then the binary response variable can be approximated from the logit function. For application to actual data, we expressed the classification of type liver and non-liver patients as the dependent variables and obtained patient personal information on the nine independent variables. The highest average percentage of accuracy determines the performance of these methods. The results have shown that the logistic regression was successful when using small independent variables, but the RDA performed when using large independent variables.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/23206.2023.22.15"
    },
    {
        "id": 8156,
        "title": "SIGNIFICANT FACTORS INFLUENCING HYPERBILIRUBINEMIA AT SANTO YUSUF MOTHER AND CHILD HOSPITAL, NORTH JAKARTA USING BINARY LOGISTIC REGRESSION",
        "authors": "Elsa Anna Pratiwi, Nunung Nurhayati, Idha Sihwaningrum",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Hyperbilirubinemia is a problem that often occurs in newborns. The cause of hyperbilirubinemia is multifactorial including maternal, perinatal or environmental factors that can be risk factors in newborns. Hyperbilirubinemia that occurs in infants is usually due to high bilirubin levels. High bilirubin can be a poison that causes brain damage so hyperbilirubinemia must be treated appropriately so as not to cause chronic complications. This study aims to identify significant factors affecting hyperbilirubinemia in infants at Santo Joseph Mother and Child Hospital, North Jakarta using binary logistic regression. This research was conducted at Santo Joseph Mother and Child Hospital for the first time. Factors that are thought to influence are gestational age, birth weight, childbirth, breastfeeding, and infection status. The results showed that the significant factors affecting hyperbilirubinemia in infants were the process of childbirth, milk feeding and infection status. Based on  the odds ratio  value for each variable, it can be concluded that babies with abnormal birth processes have a risk of hyperbilirubinemia of 2.9628 times greater than babies with normal births. Meanwhile, formula-fed infants have a risk  of hyperbilirubinemia of 4.2854 times less than breastfed babies. Furthermore, infants affected by infection have a risk  of developing hyperbilirubinemia of 5.5752 times greater than infants who do not get infection.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol18iss1pp0075-0084"
    },
    {
        "id": 8157,
        "title": "Two Statistical Approaches to Justify the Use of the Logistic Function in Binary Logistic Regression",
        "authors": "Abdelhamid Zaidi, Asamh Saleh M. Al Luhayb",
        "published": "2023-4-20",
        "citations": 9,
        "abstract": "Logistic regression is a commonly used classification algorithm in machine learning. It allows categorizing data into discrete classes by learning the relationship from a given set of labeled data. It learns a linear relationship from the given dataset and then introduces nonlinearity through an activation function to determine a hyperplane that separates the learning points into two subclasses. In the case of logistic regression, the logistic function is the most used activation function to perform binary classification. The choice of logistic function for binary classifications is justified by its ability to transform any real number into a probability between 0 and 1. This study provides, through two different approaches, a rigorous statistical answer to the crucial question that torments us, namely where does this logistic function on which most neural network algorithms are based come from? Moreover, it determines the computational cost of logistic regression, using theoretical and experimental approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/5525675"
    },
    {
        "id": 8158,
        "title": "Analyzing Suicide and Contributing Factors in Thailand Using Classification by Logistic Regression, Decision Tree and Support Vector Machine",
        "authors": "Kanticha Wongnongtaey, Krissana Srisomboon, Daricha Sutivong",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceib57887.2023.10170197"
    },
    {
        "id": 8159,
        "title": "Simulation of English part-of-speech classification based on artificial intelligence and additive logistic regression",
        "authors": "Hongchun Jia",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08490-5"
    },
    {
        "id": 8160,
        "title": "Based on Binary Logistic Regression Model Analysis of Factors of Farmers’ Willingness to Transfer Farmland",
        "authors": "Ming-Liang Duan",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bdicn58493.2023.00021"
    },
    {
        "id": 8161,
        "title": "Classification of ancient glass artifacts based on logistic regression and k-means clustering",
        "authors": "Jiahe Gao",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Chinese glass products have a long history. In this paper, for the weathering process and heritage components of ancient glass, we firstly established a logistic regression model to analyze the role of each class of chemical components on glass classification; then, in this paper, we identified the key elements with the greatest influence on glass classification: potassium oxide and lead oxide by gradually adding regression elements; subsequently, for each class of high potassium and lead barium glass, we Then, for each type of glass of high potassium and lead-barium, we selected some chemical components to establish a K-means clustering model, and after calculation, the high potassium glass was divided into four subclasses of GJ-1, GJ-2, GJ-3, and GJ-4, and the lead-barium glass was divided into four subclasses of QB-1, QB-2, QB-3, and QB-4, and the characteristics of each subclass were described. Finally, reasonableness and sensitivity tests were conducted to prove the reasonableness and robustness of the classification results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v68i.12082"
    },
    {
        "id": 8162,
        "title": "Comparison of Some Methods for Estimating Nonparametric Binary Logistic Regression",
        "authors": "Narjes Bassem Khalaf, Lekaa Ali Mohammed",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "In this research, the methods of Kernel estimator (nonparametric density estimator) were relied upon in estimating the two-response logistic regression, where the comparison was used between the method of Nadaraya-Watson and the method of Local Scoring algorithm, and optimal Smoothing parameter λ was estimated by the methods of Cross-validation and generalized Cross-validation, bandwidth optimal λ has a clear effect in the estimation process. It also has a key role in smoothing the curve as it approaches the real curve, and the goal of using the Kernel estimator is to modify the observations so that we can obtain estimators with characteristics close to the properties of real parameters, and based on medical data for patients with chronic lymphocytic leukemia and through the use of the Gaussian function and based on the comparison criterion (MSE) it was found that the Nadaraya -Watson method is the best because it obtained the lowest value for this criterion.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33095/jeas.v29i135.2505"
    },
    {
        "id": 8163,
        "title": "Feed-forward networks using logistic regression and support vector machine for whole-slide breast cancer histopathology image classification",
        "authors": "ArunaDevi Karuppasamy, Abdelhamid Abdesselam, Rachid Hedjam, Hamza zidoum, Maiya Al-Bahri",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ibmed.2023.100126"
    },
    {
        "id": 8164,
        "title": "CLASSIFICATION OF VOCATIONAL HIGH SCHOOL GRADUATES' ABILITY IN INDUSTRY USING EXTREME GRADIENT BOOSTING (XGBOOST), RANDOM FOREST, AND LOGISTIC REGRESSION",
        "authors": "Afikah Agustiningsih, Yulian Findawati, Irwan Alnarus Kautsar",
        "published": "2023-9-2",
        "citations": 0,
        "abstract": "The education world is one of the main sources in producing Human Resources. Vocational High School (SMK) is one level of school that presents various majors that are ready to compete in the industrial world. Therefore, a school institution needs to have a system to determine the quality of education provided to students so that they can compete in the industrial world. This study designs a system that is capable of classifying SMK student graduates as an evaluation for the school institution. The goal is to enable the school to devise strategies for producing better student quality in the following year. There are four classes in this study, namely those who work, those who are not working yet, those who are in college, and those who are entrepreneurs. There are several stages in building the classification system, including pre-processing, processing, and evaluation. This research uses three machine learning algorithms, namely XGBoost, Random Forest, and Logistic Regression. The results of the three methods obtained a training score of 91.70%, a test score of 66.88%, and an accuracy score of 67% generated by the XGBoost algorithm. The Random Forest algorithm produced a training score of 97.36%, a test score of 68.71%, and an accuracy score of 67%. Meanwhile, Logistic Regression produced a training score of 51.14%, a test score of 50.43%, and an accuracy score of 50%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.4.945"
    },
    {
        "id": 8165,
        "title": "Online Signature Verification Using Logistic Regression",
        "authors": "Mohammad Saleem",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codit58514.2023.10284050"
    },
    {
        "id": 8166,
        "title": "Glass classification and identification based on logistic regression model and K-means clustering analysis",
        "authors": "Zijie Ji",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "In order to investigate the effect of chemical composition on weathering, all post-weathering data were transformed into pre-weathering, for which the basis for the classification of high potassium and lead-barium glasses was inferred using a support vector machine algorithm. Afterwards, a detailed subclass differentiation method was determined for the two main classes of glass based on the K-means cluster analysis method. Further classification is then carried out on the basis of what is known about the classification. To identify unknown glasses, logistic regression was also carried out on the composition of weathered samples to predict the pre-weathering content.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v40i.6526"
    },
    {
        "id": 8167,
        "title": "Raisin classification based on XGBoost, SVM, MLP and logistic regression",
        "authors": "XINYI ZHOU",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672686"
    },
    {
        "id": 8168,
        "title": "Research on Glass Classification Based on Systematic Clustering and Logistic Regression",
        "authors": "Shangwang Liu, Shanqi Jiang, Yihang Ding, Yafei Guo",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00044"
    },
    {
        "id": 8169,
        "title": "Binary Logistic Regression applied to erosion susceptibility mapping in the Southern Amazon",
        "authors": "Elaine Lima da Fonseca, Eliomar Pereira da Silva Filho",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Problems with soil erosion by water wind in the Brazilian Amazon are intensifying as the forest is replaced by agricultural production. Deforestation, burning, logging, and advancing the agricultural frontier have altered the soil-vegetation balance. In this context, the analysis of soil erosion susceptibility is one of the most significant challenges to developing long-term sustainability strategies and policies. Based on the above, the present study used the principles of Statistical Modeling - Logistic Regression - to develop and validate a model for analysis of susceptibility to soil erosion using 14 environmental factors. The study was carried out in a hydrographic sub-basin with 330 km2, located in the south of the State of Rondônia in the western Amazon, which combines characteristics of intense anthropic activity, loss of fertile soil, gullies, and silting of rivers. The study area has rainfall above 2000 mm year-1, they are transcurrent shear zones, predominant relief forms are flat to slightly convex tops, drainage networks are dendritic in an exorheic system, vegetation cover is composed of areas of forests and natural or regenerated forest fragments, agriculture is destined to annual crops. Livestock is extensive, with a predominance of small rural properties. The logistic regression model showed satisfactory results with an AUC of 0.888 and global accuracy was 0.77. The variables with the most significant effect on the equation were NDVI, erosivity, and TST. The mapping found that 57.71% of the study area is in places susceptible to soil loss due to water events.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20502/rbgeomorfologia.v24i4.2314"
    },
    {
        "id": 8170,
        "title": "Research on classification of weathered glass based on logistic regression",
        "authors": "Chi Zhang, Yuewen Li, Hao Zheng",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2685513"
    },
    {
        "id": 8171,
        "title": "IPO Underpricing: Implementation of the Predictive Model Using a Logistic Regression",
        "authors": "Youssef Louraoui",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4667670"
    },
    {
        "id": 8172,
        "title": "Logistic Regression Matching Pursuit algorithm for text classification",
        "authors": "Qing Li, Shuai Zhao, Shancheng Zhao, Jinming Wen",
        "published": "2023-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2023.110761"
    },
    {
        "id": 8173,
        "title": "Evasion and Poison attacks on Logistic Regression-based Machine Learning Classification Model",
        "authors": "Lourdu Mahimai Doss P, M Gunasekaran",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142395"
    },
    {
        "id": 8174,
        "title": "Examining Factors That Contribute to College Success in American Samoa Using Cross-Classified Multilevel Logistic Regression",
        "authors": "Spencer Scanlan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2017624"
    },
    {
        "id": 8175,
        "title": "Classification of Heart Disease: Comparative Analysis using KNN, Random Forest, Gaussian Naive Bayes, XGBoost, SVM, Decision Tree, and Logistic Regression",
        "authors": "Yoshiven Boer, Lianca Valencia, Melisa Rachel Setiadi, Karli Eka Setiawan, Muhammad Fikri Hasani",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoris60118.2023.10352195"
    },
    {
        "id": 8176,
        "title": "Stable variable ranking and selection in regularized logistic regression for severely imbalanced big binary data",
        "authors": "Khurram Nadeem, Mehdi-Abderrahman Jabri",
        "published": "2023-1-17",
        "citations": 3,
        "abstract": "We develop a novel covariate ranking and selection algorithm for regularized ordinary logistic regression (OLR) models in the presence of severe class-imbalance in high dimensional datasets with correlated signal and noise covariates. Class-imbalance is resolved using response-based subsampling which we also employ to achieve stability in variable selection by creating an ensemble of regularized OLR models fitted to subsampled (and balanced) datasets. The regularization methods considered in our study include Lasso, adaptive Lasso (adaLasso) and ridge regression. Our methodology is versatile in the sense that it works effectively for regularization techniques involving both hard- (e.g. Lasso) and soft-shrinkage (e.g. ridge) of the regression coefficients. We assess selection performance by conducting a detailed simulation experiment involving varying moderate-to-severe class-imbalance ratios and highly correlated continuous and discrete signal and noise covariates. Simulation results show that our algorithm is robust against severe class-imbalance under the presence of highly correlated covariates, and consistently achieves stable and accurate variable selection with very low false discovery rate. We illustrate our methodology using a case study involving a severely imbalanced high-dimensional wildland fire occurrence dataset comprising 13 million instances. The case study and simulation results demonstrate that our framework provides a robust approach to variable selection in severely imbalanced big binary data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0280258"
    },
    {
        "id": 8177,
        "title": "Application of Binary Logistic Regression Analysis  on Household Welfare in Banjarmasin City",
        "authors": "Annisa Norhidayati, Fuad Muhajirin Farid, Selvi Annisa, Anwaril Hamidy",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23971/jaq.v8i2.7637"
    },
    {
        "id": 8178,
        "title": "Prediction of Diabetes using Binomial Logistic Regression",
        "authors": "D. Ravalika, R. Pitchai",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276068"
    },
    {
        "id": 8179,
        "title": "Prediction of Heart Disease using Decision Tree over Logistic Regression using Machine Learning with Improved Accuracy",
        "authors": "R.K.N.S. Shanmukha, K. Thinakaran",
        "published": "2023-2-14",
        "citations": 1,
        "abstract": "Aim: Predicting heart disease using the Decision Tree and comparing its feature extraction precision with the Logistic Regression algorithm for improving the accuracy of the prediction. Methods and Materials: In the proposed work, predicting heart disease was carried out using machine learning algorithms such as Logistic Regression (n=10) and Decision tree (n=10). Here the pretest power analysis was carried out with 80% and the sample size for the two groups are 20. Results: From the implemented experiment, the Decision Tree accuracy significantly better than the Logistic Regression 80.10%. There is a measurable 2-tailed huge distinction in accuracy for two algorithms is 0.001 (p<0.05) Conclusion: The Decision Tree algorithm got better accuracy than Logistic Regression for Predicting heart disease.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15141519"
    },
    {
        "id": 8180,
        "title": "Determinants of the Effect of COVID-19 in Bangladesh: Binary Logistic Regression Analysis Based on an Online Survey",
        "authors": "Nupur Paul, Md Asabur Rahman, Md. Moynul Islam",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59321/bauetj.v4i1.4"
    },
    {
        "id": 8181,
        "title": "Comparison of support vector machine with logistic regression method for novel text classification to improve accuracy",
        "authors": "A. Lathish, T. Devi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0158431"
    },
    {
        "id": 8182,
        "title": "Application of geospatial techniques and binary logistic regression model for analyzing driving factors of urban growth in Bahir Dar city, Ethiopia",
        "authors": "Kenu Getu, H. Gangadhara Bhat",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e25137"
    },
    {
        "id": 8183,
        "title": "Exploratory Data Analysis and Classification of Employee Retention based on Logistic Regression Model",
        "authors": "Anupkumar M Bongale, Deepak Dharrao, Siddhaling Urolagin",
        "published": "2023-3-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10112681"
    },
    {
        "id": 8184,
        "title": "A Predictive Model on a Consumer’s Impulsive Buying Intention Towards Facebook Live Online Selling Using Binary Logistic Regression",
        "authors": "Carolos Ignacio Jr. P. Lugay, Kian Justin O. Angeles, Karl G. Espina, Bianca DP. Lipata, Jan Cedrick V. Sta. Cruz",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/an13.20230465"
    },
    {
        "id": 8185,
        "title": "Developing Pedestrian Fatality Prediction Models Using Historical Crash Data: Application of Binary Logistic Regression and Boosted Tree Mechanism",
        "authors": "Malaya Mohanty, Bitati Sarkar, Piotr Gorzelańczyk, Rachita Panda, Srinivasa Rao Gandupalli, Ampereza Ankunda",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26552/com.c.2023.036"
    },
    {
        "id": 8186,
        "title": "Smart Irrigation with Water Level Indicators Using Logistic Regression",
        "authors": "Padmadev Mishra, Rachna K. Somkunwar",
        "published": "2023-5-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170388"
    },
    {
        "id": 8187,
        "title": "Classification of Ancient Glass Based on Logistic Regression and K-means Clustering Algorithm",
        "authors": "Ruimeng Shi, Shoupeng Chen, Duanduan Han",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "Ancient glass is easy to weather, after a large number of internal and external elements exchange, its composition ratio will change, thus affecting the correct judgment of the type of glass. In order to classify the types of glass, this paper first preprocessed the data, analyzed the classification rules of high-potassium glass and lead-barium glass by using logistic regression, and got a classification model that could identify the types of glass according to the content of chemical components. Next, K-means clustering algorithm is adopted to divide lead, barium and high potassium into A and B respectively according to the content of silica. After that, the rationality test was carried out on the clustering results. The test index was the belongingness of the sample to its category, and the clustering results passed the rationality test. Finally, the sensitivity analysis of the clustering results was carried out.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v62i.10410"
    },
    {
        "id": 8188,
        "title": "Anomaly Based Intrusion Detection on IOT Devices using Logistic Regression",
        "authors": "K Sasikala, S Vasuhi",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnwc57852.2023.10127375"
    },
    {
        "id": 8189,
        "title": "Classification of Hate Comments on Twitter Using a Combination of Logistic Regression and Support Vector Machine Algorithm",
        "authors": "Nabila Putri Damayanti, Della Egyta Prameswari, Wiyanda Puspita, Putri Susi Sundari",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "This research was conducted to increase accuracy in classifying sentences containing hate speech and non-hate speech on Twitter. This is important to do because, as technology develops, it also comes with negative impacts, one of which is hate speech. This classification is carried out using a combination of Logistic Regression (LR) and Support Vector Machine (SVM) methods. This combination is based on the ease of implementation and speed of LR as well as SVM's ability to handle more complex and non-linear data. In this context, LR is used to model the probability that a comment on Twitter contains hate elements or not. The model can then provide probability predictions for each class, and a threshold can be set to determine the final class. This research shows that combining these methods can build a good classification model with an accuracy of 96%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52465/joiser.v2i1.229"
    },
    {
        "id": 8190,
        "title": "A modification of logistic regression with imbalanced data: F-measure-oriented Lasso-logistic regression",
        "authors": "Bui T. T. My, Bao Q. Ta",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2306/scienceasia1513-1874.2023.s003"
    },
    {
        "id": 8191,
        "title": "Robust and sparse logistic regression",
        "authors": "Dries Cornilly, Lise Tubex, Stefan Van Aelst, Tim Verdonck",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11634-023-00572-4"
    },
    {
        "id": 8192,
        "title": "SKEDS — An external knowledge supported logistic regression approach for document-level sentiment classification",
        "authors": "Nesar Ahmad Wasi, Muhammad Abulaish",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121987"
    },
    {
        "id": 8193,
        "title": "Effect of Various Factors on Classification Performance of Ordinal Logistic Regression",
        "authors": "Ali Vasfi Ağlarcı, Cengiz Bal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2024.10058094"
    },
    {
        "id": 8194,
        "title": "Efficient Human Action Recognition using Novel Logistic Regression Compared over Linear Regression with Improved Accuracy",
        "authors": "S Bhanu Prakash, V. Amudha, Meenakshisundaram. N",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142567"
    },
    {
        "id": 8195,
        "title": "Ensemble Bagging Discriminant and Logistic Regression in Classification Analysis",
        "authors": " Solimun, Adji Achmad Rinaldo Fernandes",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": " The main problem that often becomes a challenge in classification analysis is a class imbalance, for example, in bank credit collectability where performing loans (PL) are 5% and non-performing loans (NPL) are 95%. The purpose of this research is to develop a classification model for the imbalance of collectibility data on Bank X mortgage credit. The analysis developed is Ensemble on Discriminant Analysis and Logistic Regression. The ensemble used in this study is Bagging (Bootstrap Aggregating). The data used are secondary data on bank X mortgage credit collectibility with a sample of [Formula: see text] = 100 and simulation data. Generated data with [Formula: see text] = 1000 and consists of two scenarios, namely, data with unbalanced classes (50:950) and data with balanced classes (500:500). Evaluation of the classification model is seen from the accuracy, sensitivity, and specificity. The results of classification analysis with Ensemble using Bagging Discriminant and Logistic Regression Bagging on secondary data and simulations are better than ordinary Discriminant Analysis and Logistic Regression. The sensitivity and specificity of the credit collectibility classification using Bagging Discriminant and Logistic Regression Bagging are also higher. The originality in this study is in the form of an Ensemble model using Bagging Discriminant and Logistic Regression which can improve the performance of classification analysis and has implications for reducing risk both for banks and for Bank X KPR customers. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1793005725500061"
    },
    {
        "id": 8196,
        "title": "Binary logistic regression analysis on determinants of capacity utilization in medium and large manufacturing industries in Ethiopia",
        "authors": "Zemene Yohannes, Amare Matebu, Fekade Asrat",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "Most manufacturing industries in Ethiopia are not operating at full capacity. The manufacturing industry is one of the main determinants of the economic growth of a country; therefore, the reasons why they are not operating at full capacity have to be assessed. The aim of this study is to assess determinant factors associated with Ethiopia’s large and medium manufacturing industries (henceforth referred to as LMMIs in this study) not working at full capacity based on 2020 LMMI survey data. In this study, 3,067 large and medium manufacturing industries were examined. Among these industries, 78.71% were not working at their full capacity, while the remaining 21.29% were. Binary logistic methods were used to analyze the data. Study results found that the region, the number of months the establishment operated during the study period, the workplace of the manufacturing company, the effect of Covid-19, and the current most serious problem facing the establishment were statistically significant predictors for working at full capacity. LMMI intervention programs, including regional work, increasing the number of working months in the year, workplace, the effect of unexpected external influences (e.g., COVID-19) and major problems among LMMIs, should be put in place to increase the production to full capacity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55493/5008.v11i1.4713"
    },
    {
        "id": 8197,
        "title": "A logistic regression-based model for classification and evaluation of chemical composition of silicate glass products",
        "authors": "Yaozheng Zhang, Yang Zhi",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "Glass is one of the earliest human-made materials, and it has played an irreplaceable role in the development of human civilization. In ancient China, glass was an important commodity on the Silk Road, and it became a valuable witness to early trade and cultural exchanges between China and the West. Due to manufacturing processes, ancient glass is easily affected by burial environments and undergoes weathering. During the weathering process, there is a significant exchange of elements between the glass and the environment, causing changes in the proportions of the glass's chemical composition, which can affect the correct determination of the glass type. In this paper, we studied multiple sets of weathered and unweathered silicate glasses, extracted data on the chemical composition, color, and patterns of the sampling points, and first found a significant difference between the six chemical composition elements in the unweathered parts for the two silicate glass categories. Then, we introduced logistic coefficients and established a chemical composition evaluation model based on logistic regression to obtain the classification patterns of the two glass types. To further subdivide the glass into subcategories, we selected the top five chemical composition contents with the highest standard deviation for clustering under each of the two glass types and divided them into three subcategories. We obtained specific partitioning methods and results and analyzed the rationality of the results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v58i.10055"
    },
    {
        "id": 8198,
        "title": "Stroke Prediction Using XGB Classifier, Logistic Regression, GaussianNB and BernaulliNB Classifier",
        "authors": "Sachin Sharma",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccpct58313.2023.10245269"
    },
    {
        "id": 8199,
        "title": "Loan Status Prediction using SVM and Logistic Regression",
        "authors": "Khushboo Yadav, Sarvpal Singh",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307473"
    },
    {
        "id": 8200,
        "title": "Heart Disease Prediction Based on Age Detection Using Logistic Regression over Random Forest",
        "authors": "C.B.M. Karthi, A. Kalaivani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To improve the accuracy in Heart Disease Prediction using Logistic Regression and Random Forest. Materials and Methods: This study contains 2 groups i.e Logistic Regression and Random Forest. Each group consists of a sample size of 10 and the study parameters include alpha value 0.01, beta value 0.2, and the Gpower value of 0.8. Results: The Logistic Regression achieved improved accuracy of 91.60 then the Random Forest in Heart Disease Prediction. The statistical significance difference is 0.01 (p<0.05). Conclusion: The Logistic Regression model is significantly better than the Random Forest in Heart Disease Prediction. It can be also considered a better option for Heart Disease Prediction. deviation (0.08600,0.09333)",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.17311737"
    },
    {
        "id": 8201,
        "title": "Popularity analysis of films in social media using logistic regression compared with linear regression algorithm",
        "authors": "Bharat Kumar Reddy Mekala, Nelson Kennedy Babu Christopher",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0139841"
    },
    {
        "id": 8202,
        "title": "Modeling and Analysis of Daily Temperature using Logistic Regression and Markov Chain",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23918/icabep2023p40"
    },
    {
        "id": 8203,
        "title": "Determination of disease risk factors using binary data envelopment analysis and logistic regression analysis (case study: a stroke risk factors)",
        "authors": "Maedeh Gholamazad, Jafar Pourmahmoud, Alireza Atashi, Mehdi Farhoudi, Reza Deljavan Anvari",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "\nPurpose\nA stroke is a serious, life-threatening condition that occurs when the blood supply to a part of the brain is cut off. The earlier a stroke is treated, the less damage is likely to occur. One of the methods that can lead to faster treatment is timely and accurate prediction and diagnosis. This paper aims to compare the binary integer programming-data envelopment analysis (BIP-DEA) model and the logistic regression (LR) model for diagnosing and predicting the occurrence of stroke in Iran.\n\n\nDesign/methodology/approach\nIn this study, two algorithms of the BIP-DEA and LR methods were introduced and key risk factors leading to stroke were extracted.\n\n\nFindings\nThe study population consisted of 2,100 samples (patients) divided into six subsamples of different sizes. The classification table of each algorithm showed that the BIP-DEA model had more reliable results than the LR for the small data size. After running each algorithm, the BIP-DEA and LR algorithms identified eight and five factors as more effective risk factors and causes of stroke, respectively. Finally, predictive models using the important risk factors were proposed.\n\n\nOriginality/value\nThe main objective of this study is to provide the integrated BIP-DEA algorithm as a fast, easy and suitable tool for evaluation and prediction. In fact, the BIP-DEA algorithm can be used as an alternative tool to the LR model when the sample size is small. These algorithms can be used in various fields, including the health-care industry, to predict and prevent various diseases before the patient’s condition becomes more dangerous.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/jm2-09-2022-0224"
    },
    {
        "id": 8204,
        "title": "A statistical model to predict the results of Novak Djokovic's matches in the Australian open tennis event using the binary logistic regression",
        "authors": "Prashant Kumar Choudhary, Suchishrava Dubey, Dinesh Brijwal, Rajan Paswan",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22271/maths.2023.v8.i1a.921"
    },
    {
        "id": 8205,
        "title": "A Modified KL Estimator for the Binary Logistic Regression Model",
        "authors": "Benedicta B. Aladeitan, Olukayode Adebimpe, Kayode Ayinde, Adewale Lukman, Olajumoke Oludoun, Elizabeth Abiodun",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/seb-sdg57117.2023.10124573"
    },
    {
        "id": 8206,
        "title": "An empirical study on the prediction of accountability and transparency score of charities: based on binary logistic regression model",
        "authors": "Xinyu Song",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672685"
    },
    {
        "id": 8207,
        "title": "Robust Classification and Detection of Big Medical Data Using Advanced Parallel K-Means Clustering, YOLOv4, and Logistic Regression",
        "authors": "Fouad H. Awad, Murtadha M. Hamad, Laith Alzubaidi",
        "published": "2023-3-3",
        "citations": 13,
        "abstract": "Big-medical-data classification and image detection are crucial tasks in the field of healthcare, as they can assist with diagnosis, treatment planning, and disease monitoring. Logistic regression and YOLOv4 are popular algorithms that can be used for these tasks. However, these techniques have limitations and performance issue with big medical data. In this study, we presented a robust approach for big-medical-data classification and image detection using logistic regression and YOLOv4, respectively. To improve the performance of these algorithms, we proposed the use of advanced parallel k-means pre-processing, a clustering technique that identified patterns and structures in the data. Additionally, we leveraged the acceleration capabilities of a neural engine processor to further enhance the speed and efficiency of our approach. We evaluated our approach on several large medical datasets and showed that it could accurately classify large amounts of medical data and detect medical images. Our results demonstrated that the combination of advanced parallel k-means pre-processing, and the neural engine processor resulted in a significant improvement in the performance of logistic regression and YOLOv4, making them more reliable for use in medical applications. This new approach offers a promising solution for medical data classification and image detection and may have significant implications for the field of healthcare.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/life13030691"
    },
    {
        "id": 8208,
        "title": "Comparison of Error Rate Prediction Methods in Binary Logistic Regression Modeling for Imbalanced Data",
        "authors": " Bahri Annur Sinaga,  Dodi Vionanda,  Dony Permana,  Admi Salma",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Binary logistic regression is a regression analysis used in classification modeling. The performance of binary logistic regression can be seen from the accuracy of the model formed. Accuracy can be measured by predicting the error rate. One method of predicting the error rate that is often used is cross validation. There are three algorithms in cross validation, namely leave one out, hold out, and k-fold. Leave one out is a method that divides data based on the number of observations so that each observation has the opportunity to become testing data but requires a long time in the analysis process when the number of observations is large. Hold out is the simplest algorithm that only divides the data into two parts randomly so there is a possibility that important data does not become training data. K-fold is an algorithm that divides data into several groups, but k-fold is not suitable for data that has a small number of observations. In reality, real data found is often imbalanced. In logistic regression when the data is increasingly imbalanced the prediction results will approach the number of minority classes. This research focuses on the comparison of error rate prediction methods in binary logistic regression modeling with imbalanced data. This study uses three types of data, namely univariate, bivariate and multivariate, which are generated by differences in population mean and correlation between independent variables. The results obtained are k-fold algorithm is the most suitable error rate prediction algorithm applied to binary logistic regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss4/86"
    },
    {
        "id": 8209,
        "title": "A logistic binary Jaya optimization-based channel selection scheme for motor-imagery classification in brain-computer interface",
        "authors": "Anurag Tiwari",
        "published": "2023-8",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119921"
    },
    {
        "id": 8210,
        "title": "Prediction of supply chain management to find defective products using logistic regression algorithm against linear regression algorithm for better accuracy",
        "authors": "Aishwarya Theerthala, Ramakrishnan Varadharajan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0136495"
    },
    {
        "id": 8211,
        "title": "Severity Classification for COVID-19 Infections based on Lasso-Logistic Regression Model",
        "authors": "Zainab Hussein Arif, Korhan Cengiz",
        "published": "2023-4-20",
        "citations": 11,
        "abstract": "The tremendous growth of the Covid19 epidemic in recent months is devastatingly affecting human civilization. Many different biomarkers are being studied to monitor the patient's health. This might mask the symptoms of various diseases, making it more challenging for a doctor to make a correct diagnosis or prognosis. Therefore, this study aimed to create several classes of prediction methods that can handle situations of varying severity (severe, moderate, and mild). Using machine learning, a Lasso-logistic regression model is developed. To create the Covid-19 clinical dataset, researchers enlisted the help of 78 patients from the Azizia main hospital sector, the Wasit Health Directorate, and the Ministry of Health. The results show that the proposed method is generally accurate to 85.9%. Deaths have been reduced thanks to the established prediction method that enables early detection of patients across three severity levels.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59543/ijmscs.v1i.7715"
    },
    {
        "id": 8212,
        "title": "Comparison of Error Rate Prediction Methods in Binary Logistic Regression Model for Balanced Data",
        "authors": " Shavira Asysyifa S,  Dodi Vionanda,  Nonong Amalita,  Dina Fitria",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Binary Logistic Regression is one of the statistical methods that can be  used to see the relations between dependent variable with some independent variables, where the dependent variable split into two categories, namely the category declaring a successful event and the category declaring a failed event. The performance of binary logistic regression can be seen from the accurary of the model. Accuracy can be measured by predicting the error rate. One method that can be used to predict error rate is cross validation. The cross validation method works by dividing the data into two parts, namely testing data and training data. Cross validation has several learning methods that are commonly used, namely Leave One Out (LOO), Hold out, and K-fold cross validation. LOO has unbiased estimation of accuracy but take a long time, hold out can avoid overfitting and works faster because no iterations, and k-fold cross validation has smaller error rate prediction. Meanwhile, data cases with different correlation are useful to find out the different correlations effect performance of error rate prediction method. In this study uses artificially generated data with a normal distribution, including univariate, bivariate, and multivariate datasets with various combination of mean differences and correlation. Considering these factors, this study focuses on comparing the three cross validation methods for predicting error rate prediction in binary logistic regression. This study finds out that k-fold cross validation method is the most suitable method to predict errors in logistic regression modeling for balanced data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss4/90"
    },
    {
        "id": 8213,
        "title": "Probabilistic HIV recency classification—a logistic regression without labeled individual level training data",
        "authors": "Ben Sheng, Changcheng Li, Le Bao, Runze Li",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/22-aoas1618"
    },
    {
        "id": 8214,
        "title": "Research on the precise pointing of college students’ career based on logistic regression classification algorithm",
        "authors": "Lin Xu, Yu Wei",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "Abstract\nThis study analyzes the career development direction of college students through logistic regression and gray theory to provide more accurate career planning guidance for college students. Logistic regression classification algorithm and gray theory are used to study career influencing factors and predict future career development trends. The significant influence of academic performance, English proficiency, and civic and political cultivation on career direction is identified by analyzing the sample data of S college students. The model’s accuracy is significantly higher than random guessing, up to 79.8%. The results show that the combination of logistic regression and gray theory can effectively predict the career direction of college students, provide data-supported career guidance services for colleges and universities, and help students make more reasonable career planning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/amns-2024-0514"
    },
    {
        "id": 8215,
        "title": "Heart Disease Prediction Based on Age Detection using Novel Logistic Regression over Decision Tree",
        "authors": "C.B.M. Karthi, A. Kalaivani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To improve the accuracy in Heart Disease Prediction using Novel Logistic Regression and Decision tree Materials and Methods: This study contains 2 groups i.e Novel Logistic Regression and Decision tree Each group consists of a sample size of 10 and the study parameters include alpha value 0.01, beta value 0.2, and the Gpower value 0.8. Results: The Novel Logistic Regression (91.60) achieved improved accuracy than the Decision Tree (89.42) in Heart Disease Prediction. The statistical significance difference is 0.01 (p<0.05). Conclusion: The Novel Logistic Regression model is significantly better than the Decision Tree in Heart Disease Prediction. It can be also considered as a better option for Heart Disease Prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.17181724"
    },
    {
        "id": 8216,
        "title": "Logistic Regression Trust–A Trust Model for Internet-of-Things Using Regression Analysis",
        "authors": "Feslin Anish Mon Solomon, Godfrey Winster Sathianesan, R. Ramesh",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.024292"
    },
    {
        "id": 8217,
        "title": "Investigating Challenges in Opinion Mining Using Logistic Regression, Knn and Decision Tree",
        "authors": "Devansh Shah, Sudha Shanker Prasad",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4492465"
    },
    {
        "id": 8218,
        "title": "Block-Boosted Regularization of Linear, Logistic, Poisson, and Cox PH Regression Using Correlation-Based Penalization",
        "authors": "Leif Peterson",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4419320"
    },
    {
        "id": 8219,
        "title": "Wisconsin Breast Cancer Detection Using L1 Logistic Regression",
        "authors": "R. Rekha, K.L. Vinoci",
        "published": "2023-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciscois56541.2023.10100387"
    },
    {
        "id": 8220,
        "title": "Churn Prediction in Business Using Logistic Regression and Logit Boost",
        "authors": "Shijian Ma",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsca59871.2023.10392658"
    },
    {
        "id": 8221,
        "title": "Effects of multicollinearity on type I error rate and test power of binary logistic regression model: A simulation study",
        "authors": "Yeliz Arici, Mustafa Ozkan, Zahide Kocabas",
        "published": "2023",
        "citations": 0,
        "abstract": "In this study, the effect of multicollinearity, which is defined as high correlation, on the type I error rate and test power of the binary logistic regression models were studied. To do this, one dependent variable that consists of 1 and 2 and four continuous independent variables that were randomly drawn from the standardized normal distribution were taken into consideration in the constructed binary logistic regression model. To calculate the type I error rates and test power, the simulation study was performed 100.000 times. The simulation study repeated for the sample sizes of 10, 20, 30 and 40 the various degrees of correlations, namely 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80% and 90%. In order to calculate test power, differences (δ) were created between population means by adding to the mean of the second population in standard deviation units as 0.5, 1.0, 1.5 and 2.0, respectively. The simulation runs exhibited that the increasing degree of multicollinearity among independent variables had no influence on type I error rates, provided that the sample size should not be smaller than 30. The power of the binary logistic regression was least affected by the increasing degrees of multicollinearity when the sample size is 10 and there is a 0.5δ difference between population means. The fact that there was a marked decline in test power with rising multicollinearity for all sample sizes clarified that the binary logistic regression was most powerful if there is no strong multicollinearity among independent variables when there is a 1.0δ difference between population means. The negative impact of the rising degrees of multicollinearity on the test power can be avoided if the number of observations is sufficiently large and if the populations were satisfactorily separated from each other.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5455/medscience.2023.08.146"
    },
    {
        "id": 8222,
        "title": "Workforce Diversity: Gender, Education, and Ethnicity Affecting Organizational Perceived Performance in Nepalese Banking Sector- A Binary Logistic Regression Modeling",
        "authors": "Roshan Thapa",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "The organization performs well when its diverse workforce works properly. Inclusiveness of workforce diversity namely gender, education, and ethnicity are highly important for better organizational performance. The objective of this study is to measure the impact of workforce diversity on the organizational performance of the Nepalese Banking Sector of Newroad Branches. The strata of managerial level, officer level, and assistant level are developed and 128 samples are taken for the purpose of the study with the stratified random sampling method. Binary Logistic Regression is used as a major statistical tool to analyze the organization's performance against not performing. Through analysis, gender diversity, education diversity, and ethnicity have a positive impact and help to increase organization performance, who believe diversity helps to perform better in the organization. For an organization diversity among employees must be there for the well-being of the organization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3126/njmr.v6i2.57196"
    },
    {
        "id": 8223,
        "title": "Fuzzy Semi-Parametric Logistic Quantile Regression Model",
        "authors": "Ahmed Razzaq, Ayad H. shemaila",
        "published": "2023-3-26",
        "citations": 0,
        "abstract": "In this paper, the fuzzy semi-parametric logistic quantile regression model was studied in the absence of special conditions in the classical regression models. This model becomes more flexible to deal with data for outlier's values and in the absence of a linear regression condition when the data of the dependent variable are restricted and fuzzy data and some of the variables are nonparametric, and the dependent variable in this model represents the fuzzy triangular number.\r\nThe estimation of the semi-parametric logistic quantile regression model has been applied to simulated data when the sample size is (25, 50, 75, 100) and with a repetition of 1000. Where the model is estimated in two steps, the first step is to estimate the parametric part, and the second step is to estimate the non-parametric part by the Nadaraya-Watson estimator through different kernel functions. Depending on the mean squares error and the measure of goodness of fit, the results indicated the best estimate of a model with the Kernel-Cassian function when the quantile of the fuzzy conditional distribution equals 0.2 for all sample sizes  .",
        "keywords": "",
        "link": "http://dx.doi.org/10.31185/wjps.80"
    },
    {
        "id": 8224,
        "title": "The Comparison of Accuracy on Classification Climate Change Data with Logistic Regression",
        "authors": "Arisman Adnan, Anne Mudya Yolanda, Gustriza Erda, Noor Ell Goldameir, Zul Indra",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "Machine learning methods can be used to generate climate change models. The goal of this study is to use logistic regression machine learning algorithms to classify data on greenhouse gas emissions. The data used is climate change data of several countries obtained from The World Bank, with total greenhouse gas emissions as the response variable and 61 other attributes as explanatory variables. This data is preprocessed using min-max normalization to handle unbalanced ranges, and then the data is split into 70% training data and 30% testing data. Based on the logistic regression modeling, it was discovered that the data from the min-max transformation resulted in better modeling than the data modeling without the transformation process. The accuracy, precision, sensitivity, and specificity of the transformation are 87.60%, 87.76%, 87.04%, and 88.14%, respectively",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i1.11914"
    },
    {
        "id": 8225,
        "title": "Determining Significant Factors for Selection of Private Higher Education Institutions in Malaysia using Binary Logistic Regression",
        "authors": " Wan Roslina Wan Othman,  Syahrul Fahmy Abdul Wahab,  Nurul Haslinda Ngah,  Izzah Inani Abdul Halim,  Sharifah Sakinah Syed Abd. Mutalib",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "This study aims to statistically identify significant factors that influence IPTS selection in Malaysia using binary logistic regression. There are three phases in this study namely Identification of Variables, Distribution of Questionnaire and Analysis of Results. The variables used in the questionnaire were adapted from the past study of the authors. Nine factors in the selection of HEIs were identified and adapted in this study. Questionnaire was selected as the research tool and electronically distributed to the students of seven IPTS throughout Terengganu with a total response of 305. Results were loaded into SPSS for statistical analysis using descriptive, exploratory, normality, correlation, reliability, and binary logistic regression. The results reveal three significant factors in the selection of IPTS namely Cost, Social Factors and Job Prospects. Although accuracy is high, the model is not suitable for prediction since the variation is less than 70%. Findings for this study could support IPTS marketing strategies and better understanding of IPTS selection criteria in Malaysia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37934/araset.37.2.5867"
    },
    {
        "id": 8226,
        "title": "Malicious URL Detection Using Logistic Regression",
        "authors": "Harshitha S",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Abstract: Over the past few years, there has been a considerable expansion in both the amount and variety of web services. Online services like social networking, online gaming, and banking have quickly advanced along with people’s reliance on them for routine chores. As a result, a lot of information is added to the Web every day. These web services open up new ways for people to engage, but they also give thieves new chances. URLs serve as jumping off points for all types of web attacks, making it possible for any user with bad intent to submit a malicious URL and steal the identity of a legitimate individual. Malicious URL detection is a crucial task in ensuring the security of internet users. This study describes a novel logistic regression technique for identifying malicious URLs.. The proposed method leverages a dataset consisting of various features extracted from URLs and their associated labels indicating whether they are malicious or not. To extract features, we consider both structural and content based characteristics of URLs. Structural features include domain length, path length, and presence of special characters, while content based features involve examining the lexical composition of the URL, such as the presence of suspicious keywords or uncommon words. Using a labelled dataset, the logistic regression model is trained using the retrieved features. The likelihood that a given URL is malicious is then predicted using the trained model. Results from experiments show how effective is the suggested strategy. When identifying fraudulent or benign URLs, the logistic regression model performs with high accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.54563"
    },
    {
        "id": 8227,
        "title": "Comparison of Accuracy Rate in Prediction of Cardiovascular Disease using Random Forest with Logistic Regression",
        "authors": "T. Vishnuvardhan, A. Rama",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: Comparison of accuracy rate in prediction of cardiovascular disease using Novel Random Forest with Logistic Regression. Materials and Methods: The Novel Random forest (N=20) and Novel Logistic Regression Algorithm (N=20) these two algorithms are calculated by using 2 Groups and taken 20 samples for both algorithm and accuracy in this work.The sample size is determined using the G power Calculator and it’s found to be 10. Results: The Random Forest exhibited 89.06% accuracy whilst a Logistic Regression has shown 92.18%. accuracy. Statistical significance difference between Random forest algorithm and Novel Logistic Regression Algorithm was found to be p=0.001 (2 tailed) (p<0.5). Conclusion: Prediction of cardiovascular disease using Logistic Regression is significantly better than the Random Forest.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15261531"
    },
    {
        "id": 8228,
        "title": "Backward Elimination for Feature Selection on Breast Cancer Classification Using Logistic Regression and Support Vector Machine Algorithms",
        "authors": "Salsha Farahdiba, Dwi Kartini, Radityo Adi Nugroho, Rudy Herteno, Triando Hamonangan Saragih",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Breast cancer is a prevalent form of cancer that afflicts women across all nations globally. One of the ways that can be done as a prevention to reduce elevated fatality due to breast cancer is with a detection system that can determine whether a cancer is benign or malignant. Logistic Regression and Support Vector Machine (SVM) classification algorithms are often used to detect this disease, but the use of these two algorithms often doesn’t give optimal results when applied to datasets that have many features, so additional algorithm is needed to improve classification performance by using Backward Elimination feature selection. The comparison of Logistic Regression and SVM algorithms was carried out by applying feature selection to breast cancer data to see the best model. The breast cancer dataset has 30 features and two classes, Benign and Malignant. Backward Elimination has reduced features from 30 features to 13 features, thereby increasing the performance of both classification models. The best classification was obtained by using the Backward Elimination feature selection and linear kernel SVM with an increase in accuracy value from 96.14% to 97.02%, precision from 98.06% to 99.49%, recall from 90.48% to 92.38%, and the AUC from 0.95 to 0.96.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ijccs.88926"
    },
    {
        "id": 8229,
        "title": "Hybrid Approach for Fake News Detection using CNN and Logistic Regression",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.755"
    },
    {
        "id": 8230,
        "title": "Analysis and Comparison of Prediction of Heart Disease Using Novel Support Vector Machine and Logistic Regression Algorithm",
        "authors": "G. Pavithraa",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: prediction of coronary disease using novel support vector machine and comparing its accuracy with logistic regression algorithm. Materials and methods: Two social affairs are proposed for predicting the accuracy (%) of coronary disease. To be explicit, the novel supports vector machine and logistic regression algorithms. Here we take 20 samples each for appraisal and compare. The sample size was calculated using G power with pretest power at 80% and the alpha of 0.05 value. Result: The logistic regression gives better precision (87.82%) than the novel support vector machine (SVM) accuracy (81.30%). Thus the real significance of logistic regression is better than novel support vector machine algorithms. Conclusion: From the result, it might be gathered that logistic regression helps in expecting the coronary sickness with more accuracy to appear differently in relation to novel support vector machine algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.783787"
    },
    {
        "id": 8231,
        "title": "The Impact of Social Media Advertising on Customer Performance Using Logistic Regression Analysis",
        "authors": "",
        "published": "2023-7-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25212/lfu.qzj.8.3.54"
    },
    {
        "id": 8232,
        "title": "The Impact of Practicing Exercise and Risk Factors Categorize in Osteoporotic Concerning Postmenopausal Women (Analytical study using binary logistic regression)",
        "authors": "Raed Farooq Khaleel,  , Abdulkhaleq Abduljabbar Ali, Suhair Mohammed Hassoon",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "Background: Osteoporosis is an illness that may be categorized as a \"silent pandemic\" because of its worldwide incidence. The essential characteristics of osteoporosis are bone mass reduction and degeneration in bone tissue's micro-architecture. Postmenopausal osteoporosis (PMO) seems to be the most prevalent skeletal disorder. Objective: To study investigates the influence of practicing exercise and physical activity as the most critical contributing factors of osteoporosis in postmenopausal women. Patients and Methods: A cross-sectional survey was conducted at Baghdad Teaching Hospital from July 1, 2021, to December 31, 2021. Data were collected directly through interviews using a special questionnaire. One hundred and fifty postmenopausal women with osteoporosis participated in this study. A rheumatologist clinically diagnosed all participants using a bone density screening (DEXA). Results: the current study's results indicate the prevalence of osteoporosis among postmenopausal women, with a higher percentage of 69.3% in the age group (≥50 years). 60.7% of all participants were overweight and obese according to body mass index (BMI). Calcium deficiency was found in 87.3% of the subjects, more than two third (76%) of them were not practicing exercises, and 86.7% suffered from vitamin D deficiency. Reclassifying the actual and wrong percentile demonstrates the accurate percentile (overall percentage = 78.7), 32 individuals were wrongly classified, and the probability of total error was reported at around 21.3%. The most important finding was that postmenopausal women with osteoporosis who exercised and participated in physical activity regularly were 13.7 times in better health than those who did not exercise. Conclusion: Exercising and physical activity lower risk factors for postmenopausal women. It is becoming more necessary to reconsider the importance of performing exercises in maintaining and enhancing postmenopausal women's health. Keywords: Risk Factors, Osteoporosis, Postmenopausal, Practicing Exercises.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26505/djm.25027710709"
    },
    {
        "id": 8233,
        "title": "Heart Disease Prediction Based On Age Detection Using Novel Logistic Regression Over K-Nearest Neighbor",
        "authors": "C.B.M. Karthi, A. Kalaivani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To improve the accuracy in Heart Disease Prediction using Novel Logistic Regression and K-NN Algorithm. Materials and Methods: This study contains 2 groups i.e Novel Logistic Regression and. Each group consists of a sample size of 10 and the study parameters include alpha value 0.01, beta value 0.2, and the Gpower value of 0.8. Results: The Novel Logistic Regression (98.45) achieved improved accuracy than the K-NN Algorithm (79.82) in Heart Disease Prediction. The statistical significance difference is 0.01 (p<0.05). Conclusion: The Novel Logistic Regression model is significantly better than the K-NN Algorithm in Heart Disease Prediction. It can be also considered a better option for Heart Disease Prediction. Keywords Logistic Regression, Novel K-Nearest Neighbor, Heart disease, Artificial Intelligence, Computer Vision.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.17251730"
    },
    {
        "id": 8234,
        "title": "Tweet sentiment analysis using logistic regression",
        "authors": "S. Kumar, N. Kaur,  Kavita, A. Joshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1801"
    },
    {
        "id": 8235,
        "title": "Diabetes Prediction using Logistic Regression and Random Forest Algorithm: A Comparative Study",
        "authors": "Anuja Bokhare, N. Vandan Raj",
        "published": "2023-1-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080370"
    },
    {
        "id": 8236,
        "title": "Insecticide-treated bed net use and associated factors among households having under-five children in East Africa: a multilevel binary logistic regression analysis",
        "authors": "Tigist Fekadu Seyoum, Zewudu Andualem, Hailemariam Feleke Yalew",
        "published": "2023-1-7",
        "citations": 3,
        "abstract": "Abstract\nBackground\nEven though malaria is preventable, it remains the leading cause of under-five morbidity and mortality in low-and middle-income countries. Despite the World Health Organization (WHO) recommendations, its advantage, and its free-of-cost access, the utilization of insecticide-treated nets (ITN) is still low in East Africa. Therefore, this study aimed to assess ITN use and associated factors among households having under-five children in East Africa.\n\nMethods\nThe most recent Demographic and Health Survey (DHS) datasets of East African countries were used. A total of 174,411 weighted samples was used for analysis. Given the hierarchical nature of DHS data, a multilevel binary logistic regression model was fitted to identify factors associated with ITN use. Four models were fitted and a model with the lowest deviance value was chosen as the best-fitted model for the data. Variables with a p-value < 0.2 in the bivariable analysis were considered for the multivariable analysis. In the multivariable multilevel binary logistic regression analysis, the Adjusted Odds Ratio (AOR) with the 95% Confidence Interval (CI) was reported to declare the statistical significance and strength of association.\n\nResults\nIn this study, the proportion of ITN use among households having under-five children in East Africa was 46.32% (95% CI 46.08%, 46.55%), ranging from 11.8% in Zimbabwe to 70.03% in Rwanda. In the multivariable analysis, being in the age group 25–34 years, married, widowed, and divorced, primary and post-primary education, wealthy households, having a lower household size, many under-five children, having media exposure, and male-headed households were associated with higher odds of ITN use. Moreover, respondents from a rural place of residence, communities with a higher level of media exposure, communities with lower poverty levels, and communities with higher education levels had higher odds of ITN use.\n\nConclusion\nIn this study, the proportion of ITN use was relatively low. Both individual and community-level factors were associated with ITN use. Therefore, giving attention, especially to those who had no formal education, the poor, younger age groups, and households with the large family size is advisable to increase awareness about ITN use. Moreover, media campaigns regarding ITN use should be strengthened.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12936-022-04416-y"
    },
    {
        "id": 8237,
        "title": "Heart Disease Prediction Based on Age Detection using Novel Logistic Regression over Support Vector Machine",
        "authors": "C.B.M. Karthi, A. Kalaivani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To improve the accuracy in Heart Disease Prediction using Novel Logistic Regression and Support Vector Machine. Materials and Methods: This study contains 2 groups i.e Novel Logistic Regression and Support Vector Machine. Each group consists of a sample size of 10 and the study parameters include alpha value 0.01, beta value 0.2, and the Gpower value of 0.8. Results: The Novel Logistic Regression (91.60) achieved improved accuracy than the Support Vector Machine (91.83) in Heart Disease Prediction. The statistical significance difference (two-tailed) is 0.01 (p<0.05). Conclusion: The Novel Logistic Regression model is significantly better than the Support Vector Machine in Heart Disease Prediction. It can be also considered a better option for Heart Disease Prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.17111717"
    },
    {
        "id": 8238,
        "title": "Improve Accuracy in Advertisement Viewability Prediction using PLC and Logistic Regression",
        "authors": "R. Gunasundari, C. Balakumar",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icercs57948.2023.10434165"
    },
    {
        "id": 8239,
        "title": "Examining Factors That Contribute to College Success in American Samoa Using Cross-Classified Multilevel Logistic Regression",
        "authors": "Spencer Scanlan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2017624"
    },
    {
        "id": 8240,
        "title": "Proposed Two-Steps Procedure of Classification High Dimensional Data with Regularized Logistic Regression",
        "authors": "Omar Alshebly, Suhail N. Abdullah",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "The field of Bioinformatics has developed in response to the rapid increase in biological data, particularly high-dimensional gene expression data. Bioinformatics utilizes optimization, computational science, and statistical methods to effectively address challenges in the field of molecular biology. Numerous genes (variables) in gene expression are irrelevant to their study. Gene selection has been demonstrated to be an effective means of enhancing the performance of numerous methods of classification. The job of acquiring significant variables via the use of ranking variable selection (RVS) techniques and then picking the most effective classifier is an enormous challenge in the context of high-dimensional data. in this study, we proposed a new ranking filter method using smooth clipped absolute deviation depending on the resampling technique (RSVS)  to obtain a proficient subset of genes with strong classification abilities. This is achieved by merging A screening technique employed as a filtering method in conjunction with Regularized Logistic Regression, such as LASSO,ALASSO,ENET, and MCP. The study involved the utilization of both simulated and real datasets to conduct an empirical evaluation of the proposed approach. The findings indicated that the proposed method outperformed other established methods. it was tested using three publicly data sets about  Cancer. The Results demonstrate that the suggested approach is highly effective and viable, thus showing a strong level of performance with regards to accuracy, geometric mean, and the area under the curve. Furthermore, The findings suggest that the genes most often chosen are physiologically associated with the specific form of cancer. Therefore, the method that has been suggested has potential advantages for the classification of cancer via the use of DNA gene expression data within a clinical setting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.19139/soic-2310-5070-1846"
    },
    {
        "id": 8241,
        "title": "Classification and prediction of the chemical composition of glass based on grey and principal component Logistic regression",
        "authors": "Hanyi Zhang, Yuwen Luo, Yang Chen",
        "published": "2023-3-29",
        "citations": 1,
        "abstract": "As a momentous witness of the ancient Silk Road trade, glass’s variety identification and measurement or even prediction of its chemical constituent content are significantly important for people to have a systematic understanding of it. However, glass weathering tends to occur because of the ambient conditions of the place where it is buried, which may bring some difficulties to the classification and content prediction. Based on the data provided in problem C of the National Undergraduate Mathematical Modeling Contest in 2022, the GM (1,1) grey prediction model has first constructed so that the content ranges of various pivotal components are achieved. Then several glass samples whose category is unknown could be classified based on a principal component logistic regression model of the chemical composition’s content.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v40i.6567"
    },
    {
        "id": 8242,
        "title": "Prediction and Classification of Ancient Glass Types Based on Logistic Regression Models",
        "authors": "Wenqi Li, Yang Zhao, Mengli Dai, Jiazhe Li",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceib57887.2023.10170035"
    },
    {
        "id": 8243,
        "title": "Adaptive hypergraph regularized logistic regression model for bioinformatic selection and classification",
        "authors": "Yong Jin, Huaibin Hou, Mian Qin, Wei Yang, Zhen Zhang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-024-05304-5"
    },
    {
        "id": 8244,
        "title": "Marine Mammals Classification using Acoustic Binary Patterns",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aoa.2020.135278"
    },
    {
        "id": 8245,
        "title": "Predicting Loneliness using SVM, Logistic Regression and Decision Tree in Thailand",
        "authors": "Chai Meenorngwar, Choosak Nithikathkul",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/citsm60085.2023.10455171"
    },
    {
        "id": 8246,
        "title": "Estimation of Accuracy Rate in Predicting Cardiovascular Disease using Gaussian Naive Bayes Algorithm with Logistic Regression",
        "authors": "T. Vishnuvardhan, A. Rama",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: Comparison of accuracy rate in prediction of cardiovascular disease using Naive Bayes with Logistic Regression. Materials and Methods: The Naive Bayes (N=10) and Logistic Regression Algorithm (N=10) these two algorithms are calculated by using 2 Groups and taken 20 samples for both algorithm and accuracy in this work. The sample size is determined using the G power Calculator and it’s found to be 10. Results: Based on the Results Accuracy obtained in terms of accuracy is identified by Naive Bayes (87.02%) over the Logistic Regression algorithm (92.18%). Statistical significance difference between novel Naive Bayes algorithm and Logistic Regression Algorithm was found to be p=0.001 (2 tailed) (p<0.05). Conclusion: Prediction of cardiovascular disease using Logistic Regression is significantly better than the Naive Bayes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15321537"
    },
    {
        "id": 8247,
        "title": "Rainfall Prediction Using Logistic Regression and Random Forest Algorithm",
        "authors": "Ritesh Pandey, Maneesh Upadhya, Manvendra Singh",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486681"
    },
    {
        "id": 8248,
        "title": "Flood Prediction Using Logistic Regression",
        "authors": "Hanshika. V. G, Preethi. S, Sreemathy. S. P, Ezhillin Freeda. S",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccpct58313.2023.10245832"
    },
    {
        "id": 8249,
        "title": "CUSTOMER BEHAVIOUR ANALYSIS FOR EVALUATING BUYING PATTERNS USING SVM, LOGISTIC REGRESSION AND KNN",
        "authors": "",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.58257/ijprems31097"
    },
    {
        "id": 8250,
        "title": "Exploring Individual Preferences on Protecting Environment: A Binominal Logistic Regression",
        "authors": "Esra KARAPINAR KOCAĞ",
        "published": "2023-1-16",
        "citations": 0,
        "abstract": "Validity of Environmental Kuznets Curve (EKC) hypothesis has been tested by several researchers. While macro approaches towards EKC hypothesis are largely discussed in the literature, microeconomic approaches are quite scarce. This paper, in this respect, aims to provide individual insights on the environmental preferences. Using individual priority towards environmental protection rather than economic growth as an environmental indicator, I investigate individual factors affecting this preference. To the best of my knowledge, this study is the first attempt that explains individual environmental preferences by a wide range of individual characteristics exploiting individual observations from more than a hundred countries for the period of 1995-2020. The findings indicate that there is no clear evidence to support EKC hypothesis. However, significant effects of age, gender, education, unemployment, along with further significant explanatory variables are expected to be useful to make appropriate policies for a greener future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37880/cumuiibf.1180228"
    },
    {
        "id": 8251,
        "title": "An innovative disruptive malware detection and prediction of web vulnerability attackers using novel linear regression against logistic regression",
        "authors": "V. Jaswanth, B. Aishwarya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178969"
    },
    {
        "id": 8252,
        "title": "Inclusion of binary proxy variables in logistic regression improves treatment effect estimation in observational studies in the presence of binary unmeasured confounding variables",
        "authors": "Cornelius Rosenbaum, Qingzhao Yu, Sarah Buzhardt, Elizabeth Sutton, Andrew G. Chapple",
        "published": "2023-11",
        "citations": 0,
        "abstract": "AbstractWe present a simulation study and application that shows inclusion of binary proxy variables related to binary unmeasured confounders improves the estimate of a related treatment effect in binary logistic regression. The simulation study included 60,000 randomly generated parameter scenarios of sample size 10,000 across six different simulation structures. We assessed bias by comparing the probability of finding the expected treatment effect relative to the modeled treatment effect with and without the proxy variable. Inclusion of a proxy variable in the logistic regression model significantly reduced the bias of the treatment or exposure effect when compared to logistic regression without the proxy variable. Including proxy variables in the logistic regression model improves the estimation of the treatment effect at weak, moderate, and strong association with unmeasured confounders and the outcome, treatment, or proxy variables. Comparative advantages held for weakly and strongly collapsible situations, as the number of unmeasured confounders increased, and as the number of proxy variables adjusted for increased.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/pst.2323"
    },
    {
        "id": 8253,
        "title": "Predictive Modeling for Analysis of Coronavirus Symptoms Using Logistic Regression",
        "authors": " Anatoli Nachev",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17265/2159-5275/2023.04.001"
    },
    {
        "id": 8254,
        "title": "Prediction of breast cancer using multiple logistic regression",
        "authors": "Nandini Upadhyay, Ashutosh Pandey",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0140789"
    },
    {
        "id": 8255,
        "title": "Identification of medical plants using logistic decision regression algorithm",
        "authors": "Kannan Kattari, Anitha Mannamperumal, Ganesa Murthy Arasakumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0134361"
    },
    {
        "id": 8256,
        "title": "Strategies Selection for a Fair Classification in Logistic Regression: A Comparative Analysis",
        "authors": "Murilo V. Pinheiro, Maria de Lourdes M. Silva, Javam C. Machado",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "The increasing use of technology leads society to a new concern: the use of machine learning models on personal data and the potentially biased classification. A new definition, called fairness, emerged to mitigate and combat discrimination in algorithms. Fairness literature includes several techniques to guarantee fair outputs for different demographic groups. There are three phases where an algorithm can achieve fairness. We explore some methods of each stage to construct a comparative analysis that evaluates fairness and utility metrics. Our analysis aims to understand the many ways to achieve fairness using logistic regression in the three most popular datasets in fairness literature. We include several experiments to compare five fairness techniques and select the best for each application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5753/sbbd_estendido.2023.232722"
    },
    {
        "id": 8257,
        "title": "Analyze the Lack of Accuracy in Stock Price Prediction using Novel K-Nearest Neighbors Regression Compared with Logistic Regression to Improve Accuracy",
        "authors": "Nagubandi Vinay, Mahaveerakannan R",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142304"
    },
    {
        "id": 8258,
        "title": "Analysis and identification of glass products based on fisher linear discriminant analysis and logistic regression for dichotomous classification",
        "authors": "Weifeng Ni, Tianqiu Pu, Shubing Liu",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "This paper focuses on establishing multiple linear regression models, correlation analysis, fisher linear discriminant analysis, logistic regression to deal with dichotomous classification, sensitivity analysis, systematic clustering and gray correlation analysis to solve the problem of compositional analysis and identification of ancient glass products. The subclasses of each category of glass are divided, and the division results are derived, so that the rationality and sensitivity of the classification results can be analyzed, and finally the classification laws of high potassium glass and lead-barium glass are derived. Analysis The chemical composition of unknown glass artifacts, predict their glass types, and perform sensitivity analysis on the predicted results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v42i.7081"
    },
    {
        "id": 8259,
        "title": "Classification and feature selection methods based on fitting logistic regression to PU data",
        "authors": "Konrad Furmańczyk, Kacper Paczutkowski, Marcin Dudziński, Diana Dziewa-Dawidczyk",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jocs.2023.102095"
    },
    {
        "id": 8260,
        "title": "The Factors That Influence the Decision in Choosing Vocational Education of Students in Matthayom 3 in Eastern Economic Corridor Area (EEC)  By Using Binary Logistic Regression Analysis",
        "authors": "Jeerayu Khowchernklang,  , Charoonsri Madilokkovit,  ",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "This research aimed to study the influential factors that influence students’ decision to choose vocational education after graduation among Matthayom 3 students whose schools are located EEC zone. The objectives of the research were to study their education choices (high school vs. vocational school), personal information, economic and social status including an awareness towards the demand for labors in the EEC area. This research was conducted among Matthayom 3 students who were in the last semester in the academic year of 2021 for 1,101 samples. The research tool was a survey questionnaire and the statistics used were the frequency, percentage as well as a Binary Logistic Regression for analyzing key influential factors that influence students’ decision to choose vocational education over high school.  The research revealed that the majority of students chose high school for further education for 70%, vocational institution for 29% and only 1% chose not to study after graduation. For students who chose vocational education, the results showed that the positive factors that influenced the students’ decision were gender, GPA, average household income, the demand for labor in future industries, job opportunity after graduation, and dual degree program. The prediction accuracy for the students was 93.6%. These research findings can be used as a guideline to promote and encourage students to study further in vocational education that has already become an excessive demand in the EEC labor market.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14416/j.ted.2023.06.009"
    },
    {
        "id": 8261,
        "title": "Interpretability and Explainability of Logistic Regression Model for Breast Cancer Detection",
        "authors": "Emina Tahirović, Senka Krivić",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011627600003393"
    },
    {
        "id": 8262,
        "title": "Predictors of hospital admission when presenting with acute-on-chronic breathlessness: Binary logistic regression",
        "authors": "Ann Hutchinson, Alastair Pickering, Paul Williams, Miriam Johnson",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "BackgroundBreathlessness due to medical conditions commonly causes emergency department presentations and unplanned admissions. Acute-on-chronic breathlessness is a reason for 20% of emergency presentations by ambulance with 69% of these being admitted. The emergency department may be inappropriate for many presenting with acute-on-chronic breathlessness.AimTo examine predictors of emergency department departure status in people with acute-on-chronic breathlessness.Design, setting and methodSecondary analysis of patient-report survey and clinical record data from consecutive eligible attendees by ambulance. Variables associated with emergency department departure status (unifactorial analyses; p<0.05) were included in a binary logistic regression model. The study was conducted in a single tertiary hospital. Consecutive survey participants presenting in May 2015 with capacity were eligible. 1,212/1,345 surveys were completed. 245/1,212 presented with acute-on-chronic breathlessness, 171 of whom consented to clinical record review and were included in this analysis.ResultsIn the final model, the odds of admission were increased with every extra year of age [OR 1.041 (95% CI: 1.016 to 1.066)], having talked to a specialist doctor about breathlessness [9.262 (1.066 to 80.491)] and having a known history of a heart condition [4.177 (1.680 to 10.386)]. Odds of admission were decreased with every percentage increase in oxygen saturation [0.826 (0.701 to 0.974)].ConclusionOlder age, lower oxygen saturation, having talked to a specialist, and having history of a cardiac condition predict hospital admission in people presenting to the emergency department with acute-on-chronic breathlessness. These clinical factors could be assessed in the community and may inform the decision regarding conveyance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0289263"
    },
    {
        "id": 8263,
        "title": "Heart Plaque detection with improved accuracy using Logistic Regression and comparing with Least Squares Support Vector Machine",
        "authors": "V.S. Kumar, K. Vidhya",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The major goal of this study is to compare the effectiveness of the Logistic Regression classifier with the Least Squares Support Vector Machine classifier in detecting plaque in the heart with high accuracy. Materials and Methods: In this work, the Logistic Regression and least squares Support Vector Machine methods are compared. There were a total of 20 samples in the Kaggle dataset on Heart Plaque disease. To calculate sample G power of 0.08 with 95% confidence interval, Clincalc is utilized. There are two groups in the training dataset (n = 489 (70 percent)) and the test dataset (n = 277 (30 percent)). Results: The accuracy of both the Logistic Regression and Least Squares Support Vector Machine algorithms is evaluated. The Least Squares Support Vector Machine approach was only 67.3 % accurate, while the Logistic Regression method was 96 % accurate. Since p(2-tailed) < 0.05, in SPSS statistical analysis, a significant difference exists between the two groups. Conclusion: The Logistic Regression algorithm is significantly better than Least Squares Support Vector Machine algorithm in this study in detecting cardiac plaque disease in the dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.16001604"
    },
    {
        "id": 8264,
        "title": "Prediction of insolvency using logistic regression",
        "authors": "Elvis Mujkić, Jelena Poljašević",
        "published": "2023",
        "citations": 0,
        "abstract": "Purpose: In this paper, the authors try to develop a model for predicting the insolvency of trading companies from the Republic of Srpska. The research seeks to determine the statistically most significant financial indicator in predicting the insolvency of trading companies in the Republic of Srpska. Methodology: The research data sample in this paper consists of yearly data from 2017 to 2020 for two hundred trading companies from the Republic of Srpska. Binary logistic regression was used to develop the model. Results: As a result of the research, a model was created that successfully classifies 82.9% of solvent and 80% of insolvent companies, with a general efficiency rate of 81.4%. Conclusion: Based on the empirical research results, we can conclude that the hypothesis has been confirmed that the LR model can be formed on the basis of selected financial indicators as a tool for predicting the insolvency of trading companies in the Republic of Srpska.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51680/ev.36.1.10"
    },
    {
        "id": 8265,
        "title": "MACHINE LEARNING ALGORITHMS FOR DETECTION OF CYBER THREATS USING LOGISTIC REGRESSION",
        "authors": "Hari Gonaygunta",
        "published": "2023-1",
        "citations": 1,
        "abstract": "The threat of cyberattacks is expanding globally; thus, businesses are developing intelligent artificial intelligence systems that can analyze security and other infrastructure logs from their systems department and quickly and automatically identify cyberattacks. Security analytics based on machine learning the next big thing in cybersecurity is machine data, which aims to mine security data to show the high maintenance costs of static relationship rules and methods. But, choosing the appropriate machine learning technique for log analytics using ML continues to be a significant barrier to AI success in cyber security due to the possibility of a substantial number of false-positive detections in large-scale or global Security Operations Centre (SOC) settings, selecting the proper machine learning technique for security log analytics remains a substantial obstacle to AI success in cyber security. A machine learning technique for a cyber threat exposure system that can minimize false positives is required. Today's machine learning methods for identifying threats frequently use logistic regression. Logistic regression is the first of three machine learning subcategories—supervised, unsupervised, and reinforcement learning. Any machine learning enthusiast will encounter this supervised machine learning algorithm at the beginning of their machine learning career. It's an essential and often applied classification algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47893/ijssan.2023.1229"
    },
    {
        "id": 8266,
        "title": "Analysis of Cellular Automata-Binary Logistic Regression for Prediction of Settlement Land In Madiun City, East Java",
        "authors": "Eva Purnamasari, Samsudin Hafid, Fikriyanto Nurdin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.19-11-2022.2332154"
    },
    {
        "id": 8267,
        "title": "Binary Logistic Regression Analysis of the Relationship Between Lunar Month of Diagnosis of Autoimmune Hepatitis and Treatment Options",
        "authors": "Eyad Gadour, N Phyu, Omar Ahmed, Hiba Elamin",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "Immunosuppressive has been the main treatment for patients with moderate or severe autoimmune hepatitis (AIH) as the survival benefits have clearly been demonstrated in clinical trials. Seasonal variations in treatment have not been studied yet, hence, we aim to study the potential relationship between the Lunar month of diagnosis and treatment options in AIH. All cases of AIH who presented to our hospitals between Jan 2016 and Jan 2021 were reviewed. Data was analyzed using the binary logistic regression model and Chi-square test of association to establish any potential relationship between the Lunar month of diagnosis and treatment response in AIH. Total number of patients with clinically and histologically proven AIH was sixty. Forty-seven were females (78.33%) and 28.33% were males (n=17). Liver biopsies were recorded in twenty-six cases (43.3%) among whom, interface hepatitis was found in ten patients (16.7%).\nTotal of twelve patients were not on any treatment and five of them (41.6%) had been diagnosed during the Full Moon (FM) phase. Patients who have been diagnosed with AIH during the Third Quarter (TQ) Phase were only three (5.0%), however 66.6% of them were on combination therapy of Steroids and Azathioprine (AZA). Interestingly, fifth of the patients were diagnosed during the First Quarter phase and only one of them were on combined therapy.\nTen patients in total were on steroids only among whom 40% were diagnosed during the FM phase. The Chi-square test of association showed a non-significant association of the lunar month of diagnosis with the treatment they receive, X2 (9, N= 31) = 7.99, p = .535.\nSteroids and AZA treatment exhibited lower frequency on full moon and third quarter moon than new and first quarter moon. Our data show that patients diagnosed with AIH during the FM phase of the lunar cycle are less likely to require combination therapy of steroids and AZA. We could not establish any significant relation between the lunar month of diagnosis and treatment response in AIH.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23958/ijirms/vol08-i07/1718"
    },
    {
        "id": 8268,
        "title": "An Innovative Penalty based Heart Disease Prediction system using Novel Random Forest over Logistic Regression Classifier Algorithm",
        "authors": "P.P.S. Teja, T. Veeramani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The main goal of the research is see how accurately predicting heart disease by Logistic Regression (LR) and Novel Random Forest(RF) Classifications. Materials and Methods: Novel Random forest appealed on a heart dataset which consists of 200 records A framework for predicting heart disease in the medical field has been proposed and developed to compare the RF with a LR classifier. The sample size was calculated to be 55 for each group with 80% G performance. The sample size was calculated using a Clincalc analysis with Alpha and Beta values of 0.05 and 0.5, pretest performance of 80%, and enrollment rate of 1. The Accuracy of the classifier was Evaluated and Recorded. Results: The LR produces 89.0% in predicting the heart disease on the data set used whereas the Novel Random forest classifier predicts the same at the rate of 95.46% of the time with a statistically significant difference between the two groups (P=0.03; P<0.05) with confidence interval 95%. Conclusion: RF is better compared with LR in terms of both precision and accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.14771482"
    },
    {
        "id": 8269,
        "title": "Determinants of Household Poverty: Identification Using Logistic Regression",
        "authors": "Hadjira Larbi Cherif, Amina Badreddine, Azzeddinne Sabri",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "The fight against poverty is considered one of the most critical tasks in achieving sustainable development goals. This study aims to identify the key determinants of household poverty in Algeria. The information base is data from the Sixth Cluster Survey (MICS 6) conducted by the National Statistics Office during 2018-2019 with a sample of 31,325 households in each province, which are divided into three groups (poorest, poor, non-poor) using a well-being index, which is based on the data about household assets and living conditions. Polynomial logistic regression was used to model the correlation between the poverty status of households and various demographic (household size, gender, age and education level of the head of the household), socio-economic (employment of the head of the household) and spatial (place of residence (urban/rural), region) characteristics. The results showed that a higher level of education of the head of the household significantly increased the probability of households moving from the “poorest” to the “poor” or “non-poor”. As the age of the household head increases, the likelihood that the household will be non-poor increases. The gender of the head of the household was not a statistically significant factor. The increase in the number of dependents as a factor of creating additional financial pressure and falling into poverty is essential only in a situation of a very drastic change in status – when moving from the status of “non-poor” to “the poorest”. In contrast, a slight change in well-being (a shift from “poor” to “poorest”) is not associated with an increase in the number of household members. Modeling showed that extreme poverty is more common in rural areas than in cities. Regional differences are also revealed, as the poverty level is higher in the southern regions than in the northern ones. The slight increase in household welfare (transition from the category of “poorest” to “poor”) in Algeria is not due to the economic activity of the head of the household. Still, it may be related to the nature of the analyzed data (only the fact of employment was considered without specifying the nature and type of activity). Instead, a significant change in welfare (moving from the category of “non-poor” to “poorest” households) directly depends on whether the head of the household is employed or unemployed. The results of the study are essential in the context of the development of a targeted policy to reduce the poverty risks of Algerian households: increasing the level of education and skills should be a priority, especially for young people and in disadvantaged regions, targeted programs for the development of rural areas and mechanisms for the fair distribution of public investments between provinces are needed to overcome regional disproportions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61093/sec.8(1).78-89.2024"
    },
    {
        "id": 8270,
        "title": "A Proficient Framework for Coronary Artery Disease Prediction using Logistic Regression",
        "authors": "Vatsala Anand, Poonam Shourie, Sheifali Gupta",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccpct58313.2023.10244967"
    },
    {
        "id": 8271,
        "title": "Model of Premarried Sexual Behavior in Adolescent City of Medan in 2021 Using Logistic Regression",
        "authors": "",
        "published": "2023-2-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30596/jmea.v2i1.12352"
    },
    {
        "id": 8272,
        "title": "Heart Failure Prediction Using XGB Classifier, Logistic Regression and Support Vector Classifier",
        "authors": "Vinod Jain, Mayank Agrawal",
        "published": "2023-5-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incacct57535.2023.10141752"
    },
    {
        "id": 8273,
        "title": "AUTOMATED PERSONALITY PREDICTIVE MODEL FOR E-RECRUITMENT USING LOGISTIC REGRESSION TECHNIQUE",
        "authors": "Oluyinka I Omotosho",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "Human personality plays a vital role in individual's life as well as in the development of an organization. Common ways to evaluating human personality is by using standard questionnaires or by analyzing the Curriculum Vitae (CV). Traditionally, recruiters manually shortlist/filters a candidate’s CV as per their requirements. In this work, a system that automates the eligibility check and aptitude evaluation of candidates in a recruitment process is developed. To meet this need an automated system module is developed for the analysis of aptitude or personality test based on candidate’s CV. The work presented in this paper determines the personality trait of applicants through CV analysis using Python upon which the Personality prediction Model is built. The result helps in evaluating the qualities in the candidates by analyzing personality trait and character of such candidate. The system provides serves as a better option  for the recruitment process so that candidate’s data can extracted from CV and shortlisted  for the best decision via fair judgment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/cse.v8i5.5620"
    },
    {
        "id": 8274,
        "title": "A GIS-based Binary Logistic Regression Model for the Inundation Analysis; A Case Study on Elapatha DS Division, Ratnapura District, Sri Lanka",
        "authors": " Ekanayaka H.D.M.,  Jayasinghe G.Y.,  Priyankara P.",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "\r\n\r\n\r\nFlood susceptibility analysis (FSA) is a prerequisite for adopting flood mitigation and adaptation techniques. A number of technologies and models have emerged through time, and this study focuses on the Binary Logistic Regression Model (BLRM) to investigate flood vulnerability of Elapatha Divisional secretariat (DS), Ratnapura District, Sri Lanka where has high impact from inundation. Rainfall, land use and land cover (LULC), elevation, slope, slope aspect, distance to the river, topographic wetness index (TWI), and stream power index (SPI) were the factors used in the model construction. These components were investigated in terms of their contribution to flood susceptibility using all location data and field plotting of responsible parameters in the study area using Geographic Information System (GIS) software, and all extracted data points were 96489, of which 50% were used for BLRM development using SPSS statistical software and remaining 50% for model validation. The coefficient of rainfall parameters, log value of elevation in meters, the tan value of slope in degrees, radiant value of aspect in degrees, (distance from the river)0.1, the ratio between SPI and TWI (SPI/TWI) and LULC band values of built-up area, water bodies and vegetations were 0.023, -2.254, -1.018, -0.005, -0.164, -0.003, 2.707, -.067 and -0.004 respectively. The accuracy was validated using Mean standard error (MSE) and area under curve (AUC) analysis, with values of 0.031 and 0.724 respectively. The Built-up area, elevation, and slope had the most impact on the inundation Elapatha DS division, and model performance represents 72.4% accuracy. Therefore, mitigation of inundation problems can be achieved through proper landscaping in the area.\r\nKeywords: Binary logistic Regression, Flood susceptibility Analysis, GIS software, Spatial analysis\r\n\r\n\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.31357/fesympo.v27.7090"
    },
    {
        "id": 8275,
        "title": "Age group determination using Logistic regression through a biometric approach",
        "authors": "D. Nagajyothi, Srinithya Gunti, Shivani Ganti, Radam Kushaal",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128422"
    },
    {
        "id": 8276,
        "title": "Diabetes Prediction using Logistic Regression and Rule Extraction from Decision Tree and Random Forest Classifiers",
        "authors": "Madhubrata Bhattacharya, Debabrata Datta",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170270"
    },
    {
        "id": 8277,
        "title": "Robust functional logistic regression",
        "authors": "Berkay Akturk, Ufuk Beyaztas, Han Lin Shang, Abhijit Mandal",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "AbstractFunctional logistic regression is a popular model to capture a linear relationship between binary response and functional predictor variables. However, many methods used for parameter estimation in functional logistic regression are sensitive to outliers, which may lead to inaccurate parameter estimates and inferior classification accuracy. We propose a robust estimation procedure for functional logistic regression, in which the observations of the functional predictor are projected onto a set of finite-dimensional subspaces via robust functional principal component analysis. This dimension-reduction step reduces the outlying effects in the functional predictor. The logistic regression coefficient is estimated using an M-type estimator based on binary response and robust principal component scores. In doing so, we provide robust estimates by minimizing the effects of outliers in the binary response and functional predictor variables. Via a series of Monte-Carlo simulations and using hand radiograph data, we examine the parameter estimation and classification accuracy for the response variable. We find that the robust procedure outperforms some existing robust and non-robust methods when outliers are present, while producing competitive results when outliers are absent. In addition, the proposed method is computationally more efficient than some existing robust alternatives.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11634-023-00577-z"
    },
    {
        "id": 8278,
        "title": "Identification of key determinants of personal safety perception at bus stops using proportional odds logistic regression",
        "authors": "G. Sethulakshmi",
        "published": "2023-3",
        "citations": 0,
        "abstract": "Complex vehicle-pedestrian interaction near the bus stop affects the safety perception of users, but the subjective nature of perceived safety and the lack of specific measurement techniques makes its estimation further laborious. This paper identifies factors influencing safety perceptions of bus users by employing Ordered Logistic Regression analysis. The study focussed on five dimensions; bus stops' design and surrounding facilities, traffic characteristics, and travellers' individual, travel and accident characteristics. The results demonstrated that increased vehicular flow, absence of footpath, crossing facility and safety barrier would scale down the perceived safety. Furthermore, the respondent's age, education, frequency of travelling by bus, familiarity with the bus stop, and previous accident experience are significant predictors of perceived safety. Results concluded that females perceived less safe, and no effects can be attributed to the household vehicles and income. Regarding road shoulder width, 1-2 meters is the most preferred width from the travellers' safety perspective.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48295/et.2023.92.9"
    },
    {
        "id": 8279,
        "title": "A Combined Learning Based Classifier Using Decision Tree and Logistic Regression",
        "authors": "Seong-Jun Kim, Jihee Kim",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codit58514.2023.10284206"
    },
    {
        "id": 8280,
        "title": "Online shopping consumer perception analysis and future network security service technology using logistic regression model",
        "authors": "Feng Lu",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "In order to understand consumer perception, reduce risks in online shopping, and maintain online security, this study employs data envelopment analysis (DEA) to confirm the relationship between evaluation and stimuli. It establishes a model of stimuli-organism response and uses regression analysis to explore the relationships among negative online shopping evaluations, consumer perception of risk, and consumer behavior. This study employs attribution theory to analyze the impact of evaluations on consumer behavior and assesses the role of perceived risk as a mediator. The independent variable is negative comments, the dependent variable is consumer behavior, and logistic regression is used to empirically analyze the factors influencing online shopping security. The results indicate a positive correlation between the number of negative comments and consumers’ delayed purchase behavior, with a correlation coefficient of 41%. The intensity of negative comments significantly impacts consumers’ refusal to make a purchase, with a correlation coefficient of 38%. The length of negative comments substantially influences consumers’ opposition to purchasing, also with a correlation coefficient of 38%. There is a close relationship between perceived risk and consumers’ delayed shopping behavior and the number of negative comments, with 41% and 4% correlation coefficients, respectively. Perceived risk has a relatively smaller impact on consumers’ opposition to purchase behavior, with a correlation coefficient of 27%. The length, intensity, and number of negative comments are correlated with consumers’ opposition, refusal, and delayed consumption, negatively affecting consumer intent. Additionally, negative comments are related to perceived risk and consumer behavior. Perceived risk causally influences consumer behavior, while the convenience of shopping has a relatively minor impact on online shopping security. Factors like delivery speed, buyer reviews, brand, price, and consumer perception are significantly related to online shopping security. Consumer perception has the most significant impact on online shopping security, balancing secure and fast consumption under the guarantee of user experience. Strengthening consumer perception enhances consumers’ ability to process risk information, helping them better identify risks and avoid using hazardous network software, tools, or technologies, thereby reducing potential online security risks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1777"
    },
    {
        "id": 8281,
        "title": "Credit Card Fraud Detection using Machine Learning (Logistic Regression)",
        "authors": "Yadla Yogitha",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Abstract: Credit Card Fraud Detection (CCFD) is a crucial application in machine learning. It aims for safeguarding financial transaction. Identifying fraud transaction and real transactions and telling that is it fraud or real. Traditional methods for credit card fraud detection rely on basic statistical techniques .credit card remains a significant challenge in the financial industry .It rely on machine learning algorithms .Fraud detection very useful for financial institution and consumers worldwide .particularly logistic regression, has emerged as a potent tool in identifying fraudulent transactions. It will consider the before amount ,after amount ,time, pin numbers based on that it will detect fraud transactions .This paper explores the application of logistic regression in credit card fraud detection , focusing on its implementation ,challenges and effectiveness .This project works for finding fraud transactions. Logistic Regression ,have shown promising results in detecting fraudulent transactions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.58477"
    },
    {
        "id": 8282,
        "title": "Predicting Accurate Heart Attacks Using Logistic Regression",
        "authors": "Vishal Baral, Pranati Palai, Soumen Nayak",
        "published": "2023-7",
        "citations": 0,
        "abstract": "A heart attack is one of the leading causes of death today. According to a large data population used as a training set for the algorithm for machine learning, classification is a technique for predicting the target class from input data. A difficulty in clinical data analytics is predicting heart attacks with greater precision. The focal point of this work is to analyze the heart attack dataset (Kaggle repository) to find a Machine learning classifier technique that predicts if a person is prone to a heart attack with maximum accuracy based on various health factors. The efficacy of the three classifiers, namely Logistic Regression, Random Forest, and Decision Tree, is demonstrated for predicting heart attack. This work compares the three classification algorithms among various factors. Logistic Regression outperforms all for predicting the values from the dataset accurately.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47893/ijcct.2023.1444"
    },
    {
        "id": 8283,
        "title": "Hypertension Risk Prediction Among Diabetic Patients Using Unconditional Multivariate Logistic Regression Model",
        "authors": "Hongjian Zhu, Chenzhou Zhang, Zhuhong You",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbea58866.2023.00009"
    },
    {
        "id": 8284,
        "title": "Parkinson's Disease Analysis Using Logistic Regression",
        "authors": "Anita S Sastry, Vidya U K,  Srusthti, Harshitha T",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciisca59740.2023.00070"
    },
    {
        "id": 8285,
        "title": "Damage classification after the 2009 L’Aquila earthquake using multinomial logistic regression and neural networks",
        "authors": "Angelo Aloisio, Marco Martino Rosso, Andrea Matteo De Leo, Massimo Fragiacomo, Maria Basi",
        "published": "2023-10",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijdrr.2023.103959"
    },
    {
        "id": 8286,
        "title": "Prediction of Heart Disease by Feature Selection Technique using Particle Swarm Optimization based on Logistic Regression",
        "authors": "Priyanka Behki, Rishi Pal",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425670"
    },
    {
        "id": 8287,
        "title": "Random feature selection using random subspace logistic regression",
        "authors": "Nuttanan Wichitaksorn, Yingyue Kang, Faqiang Zhang",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119535"
    },
    {
        "id": 8288,
        "title": "Research on word classification based on logistic regression and machine learning",
        "authors": "Yudong Wang, Zhewen Huang, Yuhang Wang, Wenyi Chen, Xinrui Wei",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2686778"
    },
    {
        "id": 8289,
        "title": "Fake News Spotting using Interrelated Feature Selection Model using Logistic Regression",
        "authors": "V. Lakshman, V. Mounika, P. Tritisha, Sk. Firduas Fathima, Nafisa Begum",
        "published": "2023-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnt57126.2023.10134586"
    },
    {
        "id": 8290,
        "title": "Logistic regression vs. predictive mean matching for imputing binary covariates",
        "authors": "Peter C Austin, Stef van Buuren",
        "published": "2023-11",
        "citations": 0,
        "abstract": " Multivariate imputation using chained equations (MICE) is a popular algorithm for imputing missing data that entails specifying multivariate models through conditional distributions. For imputing missing continuous variables, two common imputation methods are the use of parametric imputation using a linear model and predictive mean matching. When imputing missing binary variables, the default approach is parametric imputation using a logistic regression model. In the R implementation of MICE, the use of predictive mean matching can be substantially faster than using logistic regression as the imputation model for missing binary variables. However, there is a paucity of research into the statistical performance of predictive mean matching for imputing missing binary variables. Our objective was to compare the statistical performance of predictive mean matching with that of logistic regression for imputing missing binary variables. Monte Carlo simulations were used to compare the statistical performance of predictive mean matching with that of logistic regression for imputing missing binary outcomes when the analysis model of scientific interest was a multivariable logistic regression model. We varied the size of the analysis samples ( N = 250, 500, 1,000, 5,000, and 10,000) and the prevalence of missing data (5%–50% in increments of 5%). In general, the statistical performance of predictive mean matching was virtually identical to that of logistic regression for imputing missing binary variables when the analysis model was a logistic regression model. This was true across a wide range of scenarios defined by sample size and the prevalence of missing data. In conclusion, predictive mean matching can be used to impute missing binary variables. The use of predictive mean matching to impute missing binary variables can result in a substantial reduction in computer processing time when conducting simulations of multiple imputation. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/09622802231198795"
    },
    {
        "id": 8291,
        "title": "Binary Logistic Regression Analysis on Risk Factors Associated with Hepatitis B Disease in Gusau Local Government Zamfara State, Nigeria",
        "authors": "Tolulope Olayemi James, Gerald Ike Onwuka, Usman Bello",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "This study focused on creating a binary logistic regression model to evaluate the risk factors for hepatitis B viral disease in the Gusau Local Government of Zamfara State, Nigeria. Secondary data was utilised, and the model identified independent predictors of hepatitis-b disease based on variables with a P-value < 0.05 and a 95% confidence interval for the odds ratio not less than 1. The results indicated that marital status, history of blood transfusion, multiple sex partners, and alcohol consumption were statistically associated with hepatitis-B virus infection, while gender and having an infected family member were not. Model selection criteria, including Akaike Information Criterion (AIC) and Bayesian Information Criterion (BIC), favoured a model with only significant predictors, revealing the existence of Hepatitis-B virus infection risk factors in patients from Gusau Local Government of Zamfara State.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57233/ijsgs.v9i3.531"
    },
    {
        "id": 8292,
        "title": "Determinants of coexistence of undernutrition and anemia among under-five children in Rwanda; evidence from 2019/20 demographic health survey: Application of bivariate binary logistic regression model",
        "authors": "Abebew Aklog Asmare, Yitateku Adugna Agmas",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "\nBackground\nUndernutrition and anemia are significant public health issues among under-5 children, with potential long-term consequences for growth, development, and overall health. Thus, this study aims to conduct a bivariate binary logistic regression model by accounting for the possible dependency of childhood undernutrition and anemia.\n\n\nMethods\nThe data came from the DHS program’s measurement. A total of 3,206 under-five children were involved in this study. A single composite index measure was calculated for stunting, wasting, and underweight using principal component analysis. A bivariate binary logistic regression model is used to assess the association between undernutrition and anemia given the effect of other predictors.\n\n\nResults\nAmong 3,206 under-five children considered in this study, 1482 (46.2%) and 658 (20.5%) children were agonized by anemia and undernutrition, respectively. In bivariate binary logistic regression model; Urban children [AOR = 0.751, 96% CI: 0.573–0.984; AOR = 0.663, 95% CI: 0.456–0.995] and anemic mothers [AOR = 1.160, 95% CI: 1.104–1.218; AOR = 1.663, 95% CI: 1.242–2.225] were significantly associated with both childhood anemia and undernutrition, respectively. Improved water sources [AOR = 0.681, 95% CI: 0.446–0.996], average-sized children [AOR = 0.567, 95% CI: 0.462–0.696], and diarrhea [AOR = 1.134, 95% CI: 1.120–2.792] were significantly associated with childhood anemia. Large-sized children [AOR = 0.882, 95% CI: 0.791–0.853] and those with fever [AOR = 1.152, 95% CI: 1.312–2.981] were significantly associated with under-five children’s undernutrition.\n\n\nConclusion\nThe prevalence of both undernutrition and anemia among under-five-year-old children was high in Rwanda. The following determinants are statistically associated with both childhood undernutrition and anemia: place of residence; source of drinking water; maternal anemia; being a twin; birth size of children; diarrhea; fever; and child age. Anemia and nutritional deficiencies must be treated concurrently under one program, with evidence-based policies aimed at vulnerable populations.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0290111"
    },
    {
        "id": 8293,
        "title": "Ascertain the Farmers and Traders’ Willingness to Participate in E-National Agriculture Market (eNAM):  Binary Logistic Regression Analysis",
        "authors": "Sandeep Gautam,  Supriya, Harshit Mishra, Vishal Gupta, Prateek Kumar, Ankit Kumar Shakya",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "National Agriculture Market (e-NAM) is an electronic trading portal that networks the existing APMC markets to create a unified national market for agricultural commodities. The main aim of the study was to determine the willingness to participate in e-NAM trading by farmers and traders in Sultanpur district of Uttar Pradesh. The primary data was collected through 90 farmers and 30 traders by face-to-face interview with the help of survey schedule; this study was conducted in 2021-22, to find out the willingness, Binary Logit regression model was used. In the study the explanatory variables of farmers were social category, age of the respondent, education, produce sold to arhatiya or village traders and istance from mandi, according to analysis if education increased then willingness of farmers also increased with a coefficient of 3.27 similarly if the farmer is selling his produce to mandi arhatiya rather than a village trader then his probability to participate in e-NAM will increase by about 2.38 times. On other hand explanatory variables of Traders were social category, age of the traders, education level of traders, lending money to farmer, number of functions involved by traders in mandi and Business profits etc. All explanatory variables are significantly but only one variable which was not significantly i.e. Business profits because traders were afraid that their income will be known.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ijecc/2023/v13i82153"
    },
    {
        "id": 8294,
        "title": "Diagnosis of Liver Diseases Using Machine Learning Algorithms and their Prediction Using Logistic Regression and ANN",
        "authors": "Puduri Sri Harshini, K Naresh, Sai Rohith Pamulapati, A Lavanya",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205819"
    },
    {
        "id": 8295,
        "title": "Estimating labor commuting patterns using polytomous response logistic regression",
        "authors": "Mark D. Ecker, Drew Conrad",
        "published": "2023-10-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s43546-023-00568-4"
    },
    {
        "id": 8296,
        "title": "Automated Detection of Biases within the Healthcare System Using Clustering and Logistic Regression",
        "authors": "Jyoti Prakhar, Md. Tanwir Uddin Haider",
        "published": "2023-3-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccae56788.2023.10111425"
    },
    {
        "id": 8297,
        "title": "Accurate SMS Spam Detection Using Support Vector Machine in Comparison with Logistic Regression",
        "authors": "Ram Bheemesh. K, Deepa. N",
        "published": "2023-4-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142266"
    },
    {
        "id": 8298,
        "title": "Stunting determinants among toddlers in Probolinggo district of Indonesia using parametric and nonparametric ordinal logistic regression models",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/6690"
    },
    {
        "id": 8299,
        "title": "Comparison of Dense Net and over Logistic Regression in Predicting Leukemia Classification with Improved Accuracy",
        "authors": "Barinepalli Vamsi kumar, S. Stella Jenifer Isbella",
        "published": "2023",
        "citations": 0,
        "abstract": "This study compares the performance of densenet and support vector machines (SVMs) in the diagnosis of leukemia disease, with the aim of improving the accuracy of the classification results. Materials and Method The Kaggle website is where the dataset was found. The dataset consists of 20 samples per group in JPG files with a resolution of 96 dpi and 512×512 pixel size.The sample size is determined using a pretest power of 80%, a threshold of 0.05, and a confidence interval of 95%. Results: For leukemia, dense net is 96.5%, whereas logistic regression is 89%. The significance levels for Densenet and logistic regression are data with p=.000 (p<0.05) statistical significance difference respectively. Conclusion: Based on the findings, I believe that densenet performs superior to logistic regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202339909002"
    },
    {
        "id": 8300,
        "title": "Film Review Sentiment Analysis: Comparison of Logistic Regression and Support Vector Classification Performance Based on TF-IDF",
        "authors": "Dadan Saepul Ramdan, Riri Damayanti Apnena, Castaka Agus Sugianto",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Film sentiment analysis is a process for evaluating a sentiment value that exists in film reviews, so that positive or negative responses from films can be identified. In this study, a sentiment analysis will be carried out on film reviews on IMBD. The analysis was carried out to find out which reviews were positive and negative from film critics. The method used to carry out sentiment analysis in this study is review analysis and processing with TF-IDF and a positive or negative prediction process based on reviews that have been processed using a logistic regression algorithm and support vector classification. The data to be used is film reviews on IMBD, which consists of 2000 data, which is divided into 1000 positive data and 1000 negative data. Which is where the data will be preprocessed first and split with a percentage of 70% training data and 30% testing data. In the prediction process using the logistic regression algorithm, obtaining a test accuracy of 80.61%. While the prediction process using the support vector classification algorithm obtains a test accuracy of 82.42%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33633/jais.v8i3.9090"
    },
    {
        "id": 8301,
        "title": "Demographic factors lead to mobile phone ownership in Tanzania mainland: A binary logistic regression approach",
        "authors": "Mohamed K Mwanga, Lucas Salati, Dickson Luambano",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22271/maths.2023.v8.i2a.944"
    },
    {
        "id": 8302,
        "title": "Exploring the medical decision-making patterns and influencing factors among the general Chinese public: a binary logistic regression analysis",
        "authors": "Yuwen Lyu, Qian Xu, Junrong Liu",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "Abstract\nObjective\nWith the ongoing evolution of the healthcare system and shifts in cultural paradigms, there is a pressing need to delve into the medical decision-making behaviors of general Chinese public and understand their underlying motivations. This research seeks to elucidate the prevailing tendencies in these decision-making processes and to empirically validate the pivotal factors that shape their choices, offering valuable insights for healthcare policymakers and institutions.\n\nMethod\nA comprehensive survey was administered to 2,696 Chinese residents to examine their medical decision-making patterns. These patterns were classified into two primary categories: Unilateral Decision-making (Doctor-dominant, Family-centric, and Patient-driven subtypes) and Collaborative Decision-making (Doctor-led, Doctor-Patient, Patient-Family, and Doctor-Patient-Family subtypes). Binary logistic regression analysis was employed to empirically pinpoint the significant factors influencing these decision-making frameworks.\n\nResults\nThe study's analysis reveals distinct preferences in medical decision-making among Chinese residents. In the Collaborative Decision-making category, chosen by 70.81% of participants, the subtypes are as follows: Doctor-led (29.90%), Doctor-Patient (13.54%), Patient-Family (2.93%), and Doctor-Patient-Family (24.44%). The Unilateral Decision-making, preferred by 29.19%, includes Doctor-dominant (23.22%), Family-centric (1.74%), and Patient-driven (4.23%) models. The preference for Collaborative Decision-making is associated with higher educational levels, specific marital statuses (particularly married but childless), and choices of rural residents' basic medical insurance or occupational basic medical insurance. In contrast, Unilateral Decision-making correlates with males, individuals with religious beliefs, certain occupational roles (like civil servants), and holders of commercial or publicly funded medical insurance.\n\nConclusion\nThis study elucidates the complex interplay of socio-cultural and individual determinants shaping medical decision-making in China. The findings reveal a marked inclination towards collaborative models, closely linked to educational level, marital status, and specific insurance types, reflecting an evolving trend towards participatory healthcare. Simultaneously, the persistence of unilateral models, influenced by gender, religious beliefs, and occupational roles, highlights the heterogeneity within Chinese healthcare preferences. These insights are crucial for policymakers and healthcare practitioners, underscoring the need for adaptable, culturally attuned healthcare frameworks that cater to this diversity, thereby enhancing patient engagement and healthcare efficacy.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12889-024-18338-8"
    },
    {
        "id": 8303,
        "title": "Comparing the Efficiency of Heart Disease Prediction using Novel Random Forest, Logistic Regression and Decision Tree And SVM Algorithms",
        "authors": "S.T.P. Prasanna, T. Veeramani",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: The aim of the work is to evaluate the accuracy and precision in predicting heart disease using Support Vector Machine (SVM), Random forest (RF), Logistic Regression (LR), Decision Tree (DT) Classification algorithms. Materials and Methods: Classification algorithm is appealed on a heart dataset which consists of 180 records. A framework for heart disease prediction in the medical sector comparing Random forest, Logistic Regression, Decision Tree and SVM classifiers has been proposed and developed. The sample size was calculated as 55 in each group using G power 80%. Sample size was calculated using clincalc analysis, with alpha and beta values 0.05 and 0.5, 95% confidence, pretest power 80% and enrolment ratio 1. Results: The Novel Random Forest Algorithm (92.13%), Support Vector Machine (62.51%), Logistic Regression (84.89%), Decision Tree (86.25%) classifiers produce respectively. SVM, RF exists a statistically significant difference between the two groups (p=0.001,p=.004;p<0.05).LR, RF exists a statistically insignificant difference between the two groups (p=.103, P=.080;p>0.05) both with confidence interval 95%. Hence Random forest is better than SVM, RF, DT classifiers. Conclusion: The results show that the performance of RF is better when compared with SVM, LR and DT in terms of both precision and accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.14911499"
    },
    {
        "id": 8304,
        "title": "An innovative enhanced bankruptcy prediction using logistic regression and compare with convolutional neural network",
        "authors": "G. Havishya, B. Aishwarya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178974"
    }
]