[
    {
        "id": 9105,
        "title": "Comparative Analysis of the Bernoulli and Multinomial Naive Bayes Classifiers for Text Classification in Machine Learning",
        "authors": "Neli Kalcheva, Ginka Marinova, Maya Todorova",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icai58806.2023.10339077"
    },
    {
        "id": 9106,
        "title": "Internet Traffic Classification by Aggregating Correlated Naive Bayes Predictions",
        "authors": "",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2021.19.5.nq21080"
    },
    {
        "id": 9107,
        "title": "A Study on the Optimization of Text Emotional Classification Based on Class Representation Words and Naive Bayes",
        "authors": "Hongyu Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.18-11-2022.2327117"
    },
    {
        "id": 9108,
        "title": "A SURVEY: NAIVE BAYES’-ENHANCED TEXT-BASED PERSONALITY ANALYSIS",
        "authors": "",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46405"
    },
    {
        "id": 9109,
        "title": "Conversion of American Sign Language to Text Using Deep Learning for Feature Extraction and Naive Bayes for Classification",
        "authors": "Nishanth Addepalli, Ravi Kanth Pabolu, Siva Ganesh Chennuru, Vara Lakshmi Vissampalli, G L Madhumati",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126201"
    },
    {
        "id": 9110,
        "title": "Implementation of Machine Learning for Text Classification Using the Naive Bayes Algorithm in Academic Information Systems at Sebelas Maret University Indonesia",
        "authors": "Muhammad Haris Humaidi,  Sutrisno, Pringgo Widyo Laksono",
        "published": "2023",
        "citations": 0,
        "abstract": "This study implements machine learning using the Naive Bayes algorithm to create a text classification in an engineering professional program information system. The methods used include text data collection, preprocessing, feature extraction, Naive Bayes model training, and evaluation using data testing. This study made a classification model to predict text categories with a test accuracy rate of 0.975 and a training accuracy of 0.967. This research contributes to the development of text classification in information systems and can be used as a basis for further study.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202346502048"
    },
    {
        "id": 9111,
        "title": "Application of Naive Bayes to Students’ Performance Classification",
        "authors": "Olawale Basheer Akanbi",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "Naive Bayes Classifier is a strong tool or model in classifying students' performance based on various factors. Thus, this research developed a classification model that can accurately classify students into different academic performance categories. The study utilized data, collected from 1,422 students at the University of Ibadan, Nigeria. Descriptive statistics and data visualization techniques were used to gain insights into the distribution and relationships among the variables. Subsequently, a Naive Bayes classifier model was built using 70% of the data for training and 30% for testing. In addition, a Support Vector Machine (SVM) model was built to compare with the performance of the Naive Bayes model. The results of the descriptive statistics show that the respondents comprise of 846 females and 576 males. From the female respondents, 144 of them had First Class grade, 432 had Second Class Upper, 252 had Second Class Lower, and the remaining 18 had Third Class. From the male respondents, 144 of them had First Class grade, 198 had Second Class Upper, 216 had Second Class Lower, and the remaining 18 had Third Class. The Naive bayes model achieved an overall accuracy of 87%, while the SVM model achieved an overall accuracy of 85%. The results highlighted that department, grade in the first year, and monthly allowance were the most crucial features for classifying performance outcomes, while gender, age group and whether or not the respondents’ parents are educated, exerted the least significant influence on the models. Thus, on average, the Naive Bayes model outperformed the SVM in the classification of students’ performance based on the data collected. Also, the early academic performance, and financial support are significant factors in determining students' overall performance in the Institution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ajpas/2023/v25i1536"
    },
    {
        "id": 9112,
        "title": "Spam email classification based on SVM, Transformer and Naive Bayes",
        "authors": "Yijun Qiao",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "As a matter of fact, with the booming of information and big data, there are too many unwanted e-mails called spam sent to peoples e-mail account in recent years. On this basis, it could lead to a lot of problems including occupying the public resources, causing financial loss and so on. With this in mind, spam filtering technique is in need to solve the problem and address the issues. In reality, based on previous analysis, machine learning methods are very effective in spam filtering. On this basis, this study carried out background research of machine learning algorithms in spam filtering, and find the spam e-mail dataset of Kaggle.com, and implement 3 algorithms on the dataset. According to the analysis, Transformer and SVM work better on the dataset, and SVM is the best. At the same time, the current limitations are discussed as well. In addition, the prospects are demonstrated in the meantime.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/48/20241337"
    },
    {
        "id": 9113,
        "title": "Privacy-preserving Naive Bayes classification based on secure two-party computation",
        "authors": "Kun Liu, Chunming Tang",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>With the proliferation of data and machine learning techniques, there is a growing need to develop methods that enable collaborative training and prediction of sensitive data while preserving privacy. This paper proposes a new protocol for privacy-preserving Naive Bayes classification using secure two-party computation (STPC). The key idea is to split the training data between two non-colluding servers using STPC to train the model without leaking information. The servers secretly share their data and the intermediate computations using cryptographic techniques like Beaver's multiplication triples and Yao's garbled circuits. We implement and evaluate our protocols on the MNIST dataset, demonstrating that they achieve the same accuracy as plaintext computation with reasonable overhead. A formal security analysis in the semi-honest model shows that the scheme protects the privacy of the training data. Our work advances privacy-preserving machine learning by enabling secure outsourced Naive Bayes classification with applications such as fraud detection, medical diagnosis, and predictive analytics on confidential data from multiple entities. The modular design allows embedding different secure matrix multiplication techniques, making the framework adaptable. This line of research paves the way for practical and secure data mining in a distributed manner, upholding stringent privacy regulations.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.20231459"
    },
    {
        "id": 9114,
        "title": "Classification of Traffic Congestion in Indonesia Using the Naive Bayes Classification Method",
        "authors": "Abdul Robi Padri, Asro Asro, Indra Indra",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "The purpose of this research is to analyze the accuracy of congestion data using Google Colab in detecting congestion by the province in Indonesia the author tries to test strategies for dealing with congestion in the Indonesian region by utilizing the Naïve Bayes method. In this journal, apply with Google Collab . This research uses data that comes from crawling data on Twitter. Using the Naive Bayes method to find the shortest route is efficient and not congested. Implementation of online school transportation using the naive Bayes method in minimizing travel costs to pick up students can reduce traffic jams, reduce accidents, reduce student tardiness, and minimize travel costs. The Naive Bayes method can be used to identify relevant information about traffic jams in Indonesia through Twitter data with a good degree of accuracy. These results can assist decision-making and strategic planning in overcoming the problem of traffic congestion in Indonesia. Therefore, this research implies that it can help improve the accuracy of traffic congestion data in Indonesia. By using Google Colab, more advanced analysis methods and machine learning algorithms can be applied to process the existing traffic data. Additionally, utilizing Google Colab allows for fast and efficient data processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58344/jws.v2i6.285"
    },
    {
        "id": 9115,
        "title": "Secure outsourced NB: Accurate and efficient privacy-preserving Naive Bayes classification",
        "authors": "Xueli Zhao, Zhihua Xia",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2022.103011"
    },
    {
        "id": 9116,
        "title": "Performance test of Naive Bayes and SVM methods on classification of malnutrition status in children",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/8429"
    },
    {
        "id": 9117,
        "title": "E-mail Spam Classification using KNN and Naive Bayes",
        "authors": "Qianhe Ouyang, Jiahe Tian, Jiale Wei",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "E-mail spam filtering is becoming a critical and concerned issue in network security recently, and multiple machine learning techniques have been applied to tackle such sort of classification problem. With the emerging of machine learning framework, most of the tasks has been changed via the effective machine learning algorithms with satisfying performance and high speed. However, the underlying performances of different algorithms under certain given circumstances still lack of an intuitive demonstration. Hence, this study mainly focuses on the performance of two widely-used algorithms (KNN and Naive Bayes) from metrics including accuracy and running time, comparing the unique advantage of each algorithm when classifying emails. The paper uses thousands of spam data to feed two algorithms and analyzes both results respectively, indicating that KNN classifier performs better when determining the spam messages while the opposite is true for the Naive Bayes classifier. Thus, designers can pick an appropriate algorithm easily when dealing with spam filter issues under a given dataset whose features and properties are known.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v38i.5699"
    },
    {
        "id": 9118,
        "title": "PREDICTIVE MODELING OF BROILER CHICKEN PRODUCTION USING THE NAIVE BAYES CLASSIFICATION ALGORITHM",
        "authors": "Novia Hasdyna",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "Serious challenges are faced by broiler chicken farmers in Seumirah Village, Nisam Antara Subdistrict, North Aceh Regency, in their efforts to create high-quality and productive chickens. These difficulties not only impact the farmers' income but also result in recurring losses every year. This research aims to design a system using the Naive Bayes Classifier algorithm to assess the capacity and classify production types based on specific criteria such as population, age, depletion, FCR (Feed Conversion Ratio), IP (Index Performance), and BW (Body Weight). The system aims to classify broiler chicken production as either increasing (profitable) or decreasing (unprofitable). In the development of this predictive system, the PHP programming language is employed, with a MySQL database as the data storage medium. The results of this broiler chicken production prediction system have proven effective in providing information in the form of profit or loss reports based on the harvest results for each monthly period. The implementation of this system is expected to assist in optimizing farmers' production management, increasing business profitability, and providing better guidance for future business decisions. The classification results using the Naive Bayes method indicate an accuracy rate of 86,67 and error rate of 13,3%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33480/techno.v21i1.5354"
    },
    {
        "id": 9119,
        "title": "Analyzing Customer Satisfaction using Support Vector Machine and Naive Bayes Utilizing Filipino Text",
        "authors": "Joseph B. Campit",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "The study aimed to compare the classification performance of Support Vector Machine (SVM) and Naive Bayes (NB) machine learning models for estimating customer satisfaction utilizing Filipino text. Specifically, it analyzed the characteristics of the customer satisfaction data. It also examined the impact of different model configurations, including n-gram, stop words, and stemming, on the classification performance of the two models. The research employed qualitative and quantitative methods, utilizing text analytics and sentiment analysis to extract and analyze valuable information from unstructured responses from a satisfaction survey of the University President’s leadership performance conducted among PSU personnel and students. The dataset comprised 56,000 Filipino and English-word responses, manually annotated and randomly split into training and testing datasets. The study followed a general framework encompassing data pre-processing, modeling, and model comparison. To validate the classifiers’ classification performance, a 10-fold cross-validation approach was employed. The findings revealed that most personnel and students expressed positive sentiment toward the University President’s leadership performance. SVM outperformed the NB model across all different model configurations. With both stop word removal and stemming, the SVM trigram model achieved the highest classification performance for estimating customer satisfaction, using 75% of the data for training and 25% for testing. The proposed model holds the potential for estimating customer satisfaction using other unstructured customer satisfaction data utilizing Filipino text.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/232015.2023.19.50"
    },
    {
        "id": 9120,
        "title": "Wood Type Identification System using Naive Bayes Classification",
        "authors": "Muhammad Anas Yulianto, Abdul Fadlil",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "Wood, a forest product and natural resource, is a raw material used to make household goods. Some types of wood have almost the same pattern or structure. Wood quality varies greatly depending on the tree species and the environmental conditions in which it grows. This makes it challenging to identify the type of wood, especially for wooden furniture users. Therefore, wood classification is essential to ensure that the wood used meets the required quality standards and requirements. Automatic classification of wood using image processing has several advantages and can make it easier for humans. One of the image processing methods for wood classification is the Naïve Bayes method. Feature extraction technique using GLCM using contrast, correlation, energy, and homogeneity attributes. The GLCM methods can be combined to create a system design to distinguish five wood species using an image-based wood type identification system. The study results have successfully designed a system to determine five types of wood using the framework of an image-based wood type identification system. An application system has been produced to distinguish five types of wood using the framework of an image-based wood type identification system with the GLCM feature extraction method and the Naive Bayes classification method. The application system successfully identified wood species with a test accuracy rate of 88%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59247/csol.v1i3.52"
    },
    {
        "id": 9121,
        "title": "Higher classification accuracy of income class using logistic regression algorithm over naive bayes algorithm",
        "authors": "Mohamed Zaid, T. Rajendran",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178999"
    },
    {
        "id": 9122,
        "title": "Naive Bayes and Decision Tree Algorithms for BRI Life Sharia Insurance Product Classification",
        "authors": "Rika Astuti",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "Law 12 of 2012 mandates that the government increase access to higher education for high achievers and underprivileged people. One of the efforts to realize this is by providing KIP Lectures. To ensure that beneficiaries are eligible for KIP scholarships, it is necessary to classify scholarship recipients correctly using data mining classification techniques. The classification technique chosen is k-Nearest Neighbor (K-NN). K-NN is a classification method that relies heavily on the k parameter in carrying out classification. K-NN was applied to the KIP Scholarship applicant dataset at UIN Malang in 2022. The test scenario in this research is to compare the k-odd and k-even parameters to find the most optimal k value in K-NN. The highest accuracy value obtained by k-odd is 0.71 or 71% when k=9, and the highest for k-even is 0.67 or 67% when k=10. Using optimal k parameters is proven to improve k-NN performance. The K-NN algorithm with k-odd parameters, namely k=9, is the best method for classifying KIP scholarship recipients in this research. The results of this research can be considered in determining KIP scholarship recipients worthy of using K-NN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34288/jri.v5i4.246"
    },
    {
        "id": 9123,
        "title": "Diagnosis and multiclass classification of diabetic retinopathy using enhanced multi thresholding optimization algorithms and improved Naive Bayes classifier",
        "authors": "Usharani Bhimavarapu",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18659-1"
    },
    {
        "id": 9124,
        "title": "Spatial cone object classification based on improved naive Bayes algorithm",
        "authors": "Guanjie Chen, Caiyun Wang, Yida Wu, Huiwen Zhang",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3014491"
    },
    {
        "id": 9125,
        "title": "Palm print identification and classification in the field of biometric in CNN using naive bayes",
        "authors": "Akash Kumar Selvakumar, Charlyn George",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0139920"
    },
    {
        "id": 9126,
        "title": "Comparison of Naive Bayes Method with Support Vector Machine in Helpdesk Ticket Classification",
        "authors": "Arief Wibowo, Hariyanto Hariyanto",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "The technical support department or helpdesk department is a unit that requires a quick response in handling its tasks. The company's helpdesk team can consist of several individuals who know specific or specialized issues. Typically, technical problems are handled with an application that can track issues based on tickets. Ticket queue systems are used to facilitate control over the actions of the service or repair provided by the team. Helpdesk applications assist in addressing issues reported by users and then help upper-level management distribute tasks and monitor the helpdesk team's performance, including providing solutions to users' various problems. This research aims to predict the placement of fields that serve assistance based on the corpus users provide in the natural language. Prediction modelling is done using the Naïve Bayes and Support Vector Machine algorithms. The modelling results show that the accuracy rate of helpdesk service prediction with the Naïve Bayes algorithm reaches 82.06%, while the accuracy rate of prediction with the Support Vector Machine algorithm reaches 85.30%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30871/jaic.v7i2.6376"
    },
    {
        "id": 9127,
        "title": "Maximizing AUC to learn weighted naive Bayes for imbalanced data classification",
        "authors": "Taeheung Kim, Jong-Seok Lee",
        "published": "2023-5",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119564"
    },
    {
        "id": 9128,
        "title": "Sentiment Analysis of PLN Mobile Review Data Using Lexicon Vader and Naive Bayes Classification",
        "authors": "Yessy Asri, Muhamad Fajri",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconnect56593.2023.10327064"
    },
    {
        "id": 9129,
        "title": "Performance Analysis and Classification of Class Imbalanced Dataset Using Complement Naive Bayes Approach",
        "authors": "Bhaskar Marapelli, Sreedevi Kadiyala, Chandra Srinivas Potluri",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accthpa57160.2023.10083369"
    },
    {
        "id": 9130,
        "title": "Tri-Hybrid Naive Bayes Classification Model for Early Cardiovascular Disease Detection",
        "authors": "Zulkiflu Umar, Danlami Gabi, Nurudeen M. Ibrahim",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "Cardiovascular disease is a major global health problem affecting people around the globe. Although modern medicine has contributed in providing significant data to help mitigate cardiovascular disease, however, there is still needs to provide an ideal solution that will help in detecting early cardiovascular diseases. As a result, existing researchers have proposed several hybrid cardiovascular disease detection techniques using both machine learning and deep learning approaches. However, most solution requires improvement especially in term of accuracy detection. In this paper, a tri-hybrid Naïve Bayes classification algorithm for accuracy prediction of early cardiovascular disease detection is developed. In the developed algorithm, the strength of the conventional Naïve Bayes classification algorithm is improved with that of decision tree approach to achieve better accuracy. To further enhance its accuracy, Neural Network (NN) procedure is later incorporated into the improved Naïve Bayes classification algorithm. Implementation of the developed tri-hybrid algorithm is carried out on Waikato Environment for Knowledge Analysis (WEKA) and evaluated using dataset from the kaggle website that contain instances of 1025 and 14 attributes. Experimental results based on confusion matrix for performance evaluation indicates the developed tri-hybrid Naïve Bayes algorithm has achieved high classification accuracy and recall rates of 98.54 and 99% respectively when compared with that of the benchmarked schemes. The performance of the proposed solution deployed can help cardiologist make better prediction in the diagnosis of the heart disease. Although several machine learning algorithms as seen in the literatures are trained on historical data, these algorithms may not be able to accurately predict the risk of heart disease in patients who are exposed to new or emerging risk factors.  Further research is to experiments a wider range of algorithms with a build in model that can detect early cardiovascular diseases as well improve accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46792/fuoyejet.v8i2.980"
    },
    {
        "id": 9131,
        "title": "Classification of spam detection using random forest algorithm over naive bayes algorithm based on accuracy",
        "authors": "K. Seshasayana Reddy, A. Gayathri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0166577"
    },
    {
        "id": 9132,
        "title": "Improved accuracy of mammogram image classification using novel naive bayes classifier over ant colony optimisation",
        "authors": "Ruchitha Chenna Venkata Reddy, Geetha Mariappan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0134679"
    },
    {
        "id": 9133,
        "title": "Application of Naive Bayes Algorithm for Physical Fitness Level Classification",
        "authors": "Erick BURHAEIN, Akhmad FADJERI, Ibnu Prasetyo WİDİYONO",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "The implementation of physical fitness tests requires adequate facilities, so technology is needed to make it easier without having to provide facilities. The purpose of this study is to make it easier to get the results of a person's physical fitness level using age, gender, height and weight data through an intelligent system using the naïve Bayes algorithm without having to do a physical fitness test. This research is included in the Experimental research. The method used in this study used machine learning and classification with the naïve Bayes algorithm. Data analysis techniques use probability by using data tests and evaluations. The evaluation used uses accuracy. The population in this study was 100 college students. Training model scheme 98 and test 2 get an accuracy value when training is 100%, on testing an accuracy value of 50%. The best model is used as a reference in predicting new data, using 5 new data where 3 data already know the VO2Max value with the same prediction value and actual value, then 2 new data are not yet known VO2Max value, the 4th data gets a value of 44.2 and the 5th data gets a value of 33.2. The results of VO2Max testing using the naïve Bayes algorithm are declared accountable. Contribution to future research is to multiply research datasets to improve accuracy and improve user interface quality through development research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33438/ijdshs.1330745"
    },
    {
        "id": 9134,
        "title": "Implementation of Naive Bayes classification algorithm for Twitter user sentiment analysis on ChatGPT using Python programming language",
        "authors": "Adhitia Erfina, Muhamad Rifki Nurul",
        "published": "2023-6-7",
        "citations": 7,
        "abstract": "ChatGPT (Generative Pre-Trained Transformer) is a chatbot that is being widely used by the public. This technology is based on Artificial Intelligence and is capable of having conversational interactions with its users just like humans, but in the form of automated text. Because of this capability, online forums such as Brainly and the like can be overtaken by these smart chatbots. Therefore, this study was conducted to determine the positive and negative sentiments towards ChatGPT using Naive Bayes Classification algorithm on 5000 Twitter users. Data was collected by scraping technique and Python programming language was used in data analysis. The results showed that the majority of Twitter users had a positive sentiment of 57.6% towards ChatGPT, while the negative sentiment reached 42.4%. The resulting classification model had an accuracy of 80%, indicating a good classification model in determining sentiment probabilities. These findings provide a basis for the development of better AI chatbot technology that can meet user needs. The results of this study provide insights into user sentiment towards ChatGPT and can be used as a reference for future AI chatbot development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56294/dm202345"
    },
    {
        "id": 9135,
        "title": "Utilizing KNIME as a Machine Learning Classification Tool: A Practical Demonstration with SVM, Random Forest, and Naive Bayes",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.62"
    },
    {
        "id": 9136,
        "title": "Chinese cabbage leaf disease prediction and classification using Naive Bayes VGG-19 convolution deep neural network",
        "authors": "Vishnu Kumar Kaliappan, Anuprabha K",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsss58085.2023.10407076"
    },
    {
        "id": 9137,
        "title": "Website Classification Through Exploratory Data Analysis Using Naive Bayes, Random Forest, and Support Vector Machine Classifier",
        "authors": "Kanwarpartap Singh Gill, Vatsala Anand, Rupesh Gupta",
        "published": "2023-6-23",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205766"
    },
    {
        "id": 9138,
        "title": "Analisis Text Mining Klasifikasi Kegiatan Keluarga menggunakan Orange dengan Metode Naive Bayes",
        "authors": "Arsya Fathiarahma, Apriade Voutama, Taufik Ridwan, Nono Heryana",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "Abstrak \nPeran ganda yang dilakukan oleh wanita kerap kali menimbulkan konflik dalam keluarga. Konflik dapat terjadi karena kurangnya peran keluarga dalam membantu keseimbangan antara pekerjaan di rumah dan kantor yang dialami oleh para wanita karir sekaligus ibu. Algoritma Naïve Bayes dipergunakan pada penelitian ini dengan tujuan untuk mengetahui hasil penerapan klasifikasi algoritma Naïve Bayes berdasarkan peran, aktivitas, umur dan minat dalam sebuah keluarga. Sejumlah  287 data record yang dihasilkan dari survei dipergunakan dalam penelitian ini dan dilakukan split data 80:20  untuk data training dan data testing dengan menggunakan tools orange data mining. Hasil penelitian menampilkan bahwa akurasi perhitungan dengan algoritma Naïve Bayes mencapai  93% dengan kesimpulan bahwa penggunaan tools orange data mining  menghasilkan akurasi yang baik.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54914/jtt.v9i1.606"
    },
    {
        "id": 9139,
        "title": "Emotional Insights into Online Lectures: A Text-Driven Analysis Using Naive Bayes During the Pandemic Times",
        "authors": "Dian Rezky Wulandari, Casi Setianingsih, Fussy Mentari Dirgantara",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apwimob59963.2023.10365640"
    },
    {
        "id": 9140,
        "title": "Classification of Types of Computer Network Attacks Through IDS (Intrusion Detection System) using Naive Bayes Classifier",
        "authors": "Tri Widodo, Adam Sekti",
        "published": "2023-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5120/ijca2023922531"
    },
    {
        "id": 9141,
        "title": "A Novel and Robust Breast Cancer classification based on Histopathological Images using Naive Bayes Classifier",
        "authors": "Sajiv G, Ramkumar G",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10083855"
    },
    {
        "id": 9142,
        "title": "Naive Bayes Classification Model for Precondition-Postcondition in Software Requirements",
        "authors": "Daffa Hilmy Fadhlurrohman, Mira Kania Sabariah, Muhammad Johan Alibasa, Jati Hiliamsyah Husen",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icodsa58501.2023.10277397"
    },
    {
        "id": 9143,
        "title": "Exploring Natural Language Processing for FakeNews Detection and Classification: A Comparative Analysis of Naive Bayes, SVM and XGBoost",
        "authors": "Paulo Henrique Lira Junior, Luciano Cabral",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "In the digital age, the spread of fake news has emerged as a significant issue, demanding the need for reliable and scalable solutions to preserve the trustworthiness of news sources and safeguard public opinion. This study proposes an exploration of the application of Natural Language Processing (NLP) techniques for the detection and categorization of fake news. Our specific focus lies on three widely used machine learning algorithms: Naive Bayes, Support Vector Machines (SVM), and XGBoost. By conducting a comprehensive evaluation of these approaches, our objective is to assess their effectiveness in identifying fake news articles and contribute to the development of robust tools for countering misinformation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21528/cbic2023-117"
    },
    {
        "id": 9144,
        "title": "Comparative Analysis of Text Classification using SVM, Naïve Bayes, and KNN Models",
        "authors": "Anubhav Bhalla",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220728"
    },
    {
        "id": 9145,
        "title": "Classification of Malicious URLs Using Naive Bayes and Genetic Algorithm",
        "authors": "Murat KOCA, İsa AVCI, Mohammed Abdulkareem Shakir AL-HAYANİ",
        "published": "2023-8-31",
        "citations": 1,
        "abstract": "The financial losses of vulnerable and insecure websites are increasing day by day. The proposed system in this research presents a strategy based on factor analysis of website categories and accurate identification of unknown information to classify safe and dangerous websites and protect users from the previous one. Probability calculations based on Naive Bayes and other powerful approaches are used throughout the website classification procedure to evaluate and train the website classification model. According to our study, the Naive Bayes approach was benign and showed successful results compared to other tests. This strategy is best optimized to solve the problem of distinguishing secure websites from unsafe ones. The vulnerability data categorization training model included in this datasheet had a better degree of precision. In this study, the best accuracy probability of 96% was achieved in Naive Bayes' NSL-KDD data set categorization",
        "keywords": "",
        "link": "http://dx.doi.org/10.35377/saucis...1273536"
    },
    {
        "id": 9146,
        "title": "Recursive Feature Elimination with Naive Bayes Classification of Modern Contraception in Reproductive-Aged Women in Kenya",
        "authors": "Levi Kiplang’at Bor, Anthony Wanjoya, Samuel Mwalili, Dennis Kirui",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.ajnhs.20240501.11"
    },
    {
        "id": 9147,
        "title": "Hypertension Identification Using Naive Bayes Classification Method and Pan Tompkins Feature Extraction",
        "authors": "Abdi Dharma, Anita Sofia Rahmi, Erwin Sitompul, Mardi Turnip, Nendi Suhendi Syafei, Arjon Turnip",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ict60153.2023.10374032"
    },
    {
        "id": 9148,
        "title": "UNBALANCED MULTICLASS CLASSIFICATION WITH ADAPTIVE SYNTHETIC MULTINOMIAL NAIVE BAYES APPROACH",
        "authors": "Fatkhurokhman Fauzi, . Ismatullah, Indah Manfaati Nur",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Opinions related to rising fuel prices need to be seen and analysed. Public opinion is closely related to public policy in Indonesia in the future. Twitter is one of the media that people use to convey their opinions. This study uses sentiment analysis to look at this phenomenon. Sentiment is divided into three categories: positive, neutral, and negative. The methods used in this research are Adaptive Synthetic Multinomial Naive Bayes, Adaptive Synthetic k-nearest neighbours, and Adaptive Synthetic Random Forest. The Adaptive Synthetic method is used to handle unbalanced data. The data used in this study are public arguments per province in Indonesia. The results obtained in this study are negative sentiments that dominate all provinces in Indonesia. There is a relationship between negative sentiment and the level of education, internet use, and the human development index. Adaptive Synthetic Multinomial Naive Bayes performed better than other methods, with an accuracy of 0.882. The highest accuracy of the Adaptive Synthetic Multinomial Naive Bayes method is 0.990 in Papua Barat Province.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35784/iapgos.3740"
    },
    {
        "id": 9149,
        "title": "Nutritional Status Classification Of Stunting In Toddlers Using Naive Bayes Classifier Method",
        "authors": " Risky Devandra Hartana,  Enny Itje Sela",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "Stunting in toddlers is one of the prevalent issues of malnutrition in Indonesia. The causes of Stunting are diverse, and one contributing factor is the insufficient nutritional intake required for toddlers. The categorization of Stunting nutritional status in toddlers is crucial to identify those experiencing Stunting, enabling appropriate interventions to prevent more serious health problems in the future. This research aims to develop a classification model for short nutritional status in toddlers using the Naive Bayes Classifier method. The data utilized in this study originate from anthropometric measurements of toddlers in the Malebo area, Kandangan, Temanggung, Central Java. The anthropometric data include weight, height, and age of the toddlers. This data is then processed using the Naive Bayes Classifier method to classify the nutritional status of Stunting in toddlers. The results of this research are expected to assist in identifying toddlers experiencing Stunting, facilitating appropriate interventions to prevent more serious health issues in the future. Additionally, the Naive Bayes Classifier method employed can be applied in similar studies to enhance the quality of life, especially for children in Indonesia, particularly in the Malebo area, Kandangan, Temanggung, Central Java.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51903/jtie.v3i1.154"
    },
    {
        "id": 9150,
        "title": "Application of the Naive Bayes Method in the Classification of Employee Status at PT. Prosperous New Light",
        "authors": "Khaerullah Rahmat S, Indra Kanedi, Jhoanne Fredricka",
        "published": "2023-1-7",
        "citations": 0,
        "abstract": "\r\n Sinar Baru Makmur In determining the extension of an employee's contract, it is taken from the results of an employee's performance appraisal, if the performance results are good or very good, a contract extension will be carried out. However, in determining the results of employee contract extensions there are still some subjective judgments, and family relationships that create gaps with other employees in determining the final outcome of the assessment. To avoid subjectivity in evaluating employee performance, this study created an application for evaluating employees by classifying them using the Naive Bayes method. Employee status classification application at PT. Sinar Baru Makmur is created using the Visual Basic .Net programming language. The application can help manage employee performance appraisal evaluation data and can also help provide recommendations for the eligibility of employee status whether to be extended or not renewed based on the classification results of the Naive Bayes Method.\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.37676/jmcs.v2i1.3395"
    },
    {
        "id": 9151,
        "title": "Classifying Muslim Ideologies from Islamic Websites using Text Analysis Based on Naive Bayes and TF-IDF",
        "authors": "Akeem Olowolayemo, Salma Moustafa Sharey Moustafa",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "Reliable digital Islamic information is one of the challenges faced by innocent Islamic information seekers such as young Muslims, new Muslims as well as others who desire to find authentic information about Islam, Prophet Muhammad (saw), and Muslims, in general. Several deviant ideologies abound, and they also present their information using the internet, sometimes involving digital deception. In the digital era, misleading Islamic information may affect people’s beliefs, behaviours, and attitudes. Many websites are equally based on several schools of thought regarding Islamic practices which could be difficult for the new Muslims, and the young generation of Muslims to recognize what to follow among these different websites based on the information presented on the sites. Some other variants of practices are considered to be deviants by the mainstream Sunni scholars which may be misleading for innocent Islamic information seekers including non-Muslims. Consequently, the need to categorize different Islamic websites based on different schools and branches becomes imperative. This initial study focuses classification of Islamic websites utilising website categorization and text classification approach to their textual contents. The proposed technique classified 60 Islamic websites into two various categories Sunni and Shia using TF-IDF for features extraction while using Multinomial Naive Bayes for classification. In addition, extracting the keywords for each of the two categories assisted in the classification process. The results show that Multinomial Naive Bayes was easily implemented and predicted the categories of Islamic websites with an accuracy of 0.89, precision 1.0, recall 0.80, as well as an F1 score of 0.89. The keywords that differentiate Sunni websites from Shia's websites were extracted. It was found that the best keywords that can be used in search engines to identify Sunni websites are Islam and Muslim, while Shia and Imam are the most prominent keywords that can be used to identify Shia's websites.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31436/ijpcc.v10i1.321"
    },
    {
        "id": 9152,
        "title": "Text Mining Algorithm Naive Bayes Classifier to Improve Quality Sentiment Analysis Passport Mobile Application",
        "authors": "Wilonotomo ., Budy Mulyawan, M. Ryanindityo, Muhammad Alvi Syahrin, Feni Yuli Triana",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31014/aior.1991.07.01.475"
    },
    {
        "id": 9153,
        "title": "Customer Classification Using Naive Bayes Classifier With Genetic Algorithm Feature Selection",
        "authors": "Juliansyah Putra Tanjung, Fenny Chintya Tampubolon, Ari Wahyuda Panggabean, M. Anjas Asmara Nandrawan",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "There is a tendency to decrease the number of speedy customers in the operational area of ​​North Sumatra due to customer dissatisfaction. Termination of employment is carried out by the customer against PT. Telekomunikasi Indonesia, Tbk in North Sumatra. There is no management of customer data classification so that classification information based on certain product purchases cannot be known. Naïve Bayes is a classification algorithm that is easy to use but has weaknesses which result in poor performance, therefore feature selection is needed, the genetic algorithm is an algorithm that is able to select attributes in research, will be selected based on the highest weight so that the accuracy of the prediction results is more optimal. The steps taken in the measurement model using the Naive Bayes Classifier (NBC) approach and the model using the GA-NBC approach obtained accurate results from cross validation measurements, Confusion Matrix, ROC curves for the classification of existing and speedy telephone subscribers. The stages of the Naive Bayes process are: data collection, data preprocessing, processing of the Naive Bayes Classifier algorithm. Then the results are validated and evaluated using the Text Mining Algorithm, and calculating the parameters based on the genetic algorithm. The accuracy produced by the Naive Bayes Classifier model is 85.08%. The accuracy produced by the Naive Bayes Classifier model with the selection of Genetic Algorithm features increased to 89.31%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i1.12182"
    },
    {
        "id": 9154,
        "title": "An Efficient Hybrid Classifier for MRI Brain Images Classification Using Machine Learning Based Naive Bayes Algorithm",
        "authors": "Madhu M. Nayak, Sumithra Devi Kengeri Anjanappa",
        "published": "2023-2-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-022-01614-y"
    },
    {
        "id": 9155,
        "title": "Using Natural Language Processing for Programming Language Code Classification with Multinomial Naive Bayes",
        "authors": "Ayman Hussein Odeh, Munther Odeh, Hussein Odeh, Nada Odeh",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ria.370515"
    },
    {
        "id": 9156,
        "title": "Early Prediction of Heart Diseases using Naive Bayes Classification Algorithm and Laplace Smoothing Technique",
        "authors": "Subhashini Narayan,  Sathiyamoorthy E.",
        "published": "2023-1-13",
        "citations": 1,
        "abstract": "Nowadays, medical diseases are one of the primary causes of death, and it is one the major concerns of developed countries. So, the disease identification process needs a lot of attention since if the diseases are idenfied at the early stage, the rate of death can be decreased. Machine learning techniques is one of the popular approaches that is used for identifying the diseases at the early stage. In this paper, two machine learning techniques, namely Naive Bayes classification algorithm and Laplace smoothing technique are used to predict the heart disease. Here, many medical details are used, such as gender, age, fasting blood sugar, blood pressure, cholesterol, etc. to predict the hearth disease of a patient. The proposed decision system supports avoiding unnecessary diagnosis test, which can be highly beneficial to start the treatment quickly. Thus, both time and money can be saved. Both the performance analysis and the experimental results show the efficiency of the proposed scheme over the existing schemes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijghpc.316157"
    },
    {
        "id": 9157,
        "title": "Comparative Study of K-NN, Naive Bayes and SVM for Face Expression Classification Techniques",
        "authors": "Viola Bakiasi Shtino, Markela Muça",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nClassification is a data mining technique used to predict group membership for data instances within a given dataset. Classification is considered as an example of supervised learning as training data associated with class labels is given as input. This comparative study focuses on the application of K-Nearest Neighbors (K-NN), Naive Bayes, and Support Vector Machines (SVM) classification techniques in the context of face expression recognition. The study aims to evaluate and compare the performance of these techniques in accurately classifying facial expressions, their advantages and disadvantages.\nFacial expression recognition is an important area in computer vision and emotion analysis. It involves identifying and classifying different facial expressions such as happiness, sadness, anger, fear, surprise and disgust. Accurate classification of facial expressions is crucial for various applications, including human-computer interaction, affective computing and psychological research.\nK-NN is a non-parametric algorithm that classifies data based on the majority class of its K-nearest neighbors. Naive Bayes is a probabilistic algorithm that makes classification decisions based on the Bayes theorem and assumes independence between features. SVM is a machine learning algorithm that constructs a hyperplane to separate different classes of data.\nDataset such as Affectnet is used to conduct the study including labeled facial expression images. Three algorithms are tested on this dataset to evaluate their performance in correctly classifying facial expressions. Performance metrics such as accuracy, precision, recall, and F1-score are used to assess the classification performance of each technique. Software used for conducting the experiments is Python.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/bjir-2023-0015"
    },
    {
        "id": 9158,
        "title": "Naive Bayes and KNN for Airline Passenger Satisfaction Classification: Comparative Analysis",
        "authors": "Annisa Nurdina, Audita Bella Intan Puspita",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "Air transportation is vital due to technological advancements and globalization. It is affordable and accessible worldwide, providing efficient services to reach destinations globally. This discussion focuses on full-service airlines that offer online-based services. Previous research indicates that available facilities and services influence passenger satisfaction. Previous research on customer satisfaction showed a correlation between satisfaction and services without accurate figures. In the present study, the customer satisfaction figure is measured using the Naive Bayes and K-Nearest Neighbour (K-NN) algorithm to obtain a tested level of accuracy. In this analysis, we will compare the effectiveness of Naive Bayes and K-NN algorithms in classifying airline passenger satisfaction. The results show that the accuracy of the Naive Bayes method of the two algorithms is higher than the K-NN method. The accuracy value of the Naive Bayes method is 84.48%, while the accuracy value of the K-NN method is 65.38%. From the test results, the precision value for Naive Bayes is 82.25%, and K-NN is 67.35%. Furthermore, the recall value for Naive Bayes is 82.43%, and K-NN is 74.33%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52465/joiser.v1i2.167"
    },
    {
        "id": 9159,
        "title": "Classification of Naive Bayes Algorithm on Dengue Hemorrhagic Fever and Typhoid Fever Based on Hematology Results",
        "authors": "Yuni Handayani, Alvin Rainaldy Hakim",
        "published": "2023-2-17",
        "citations": 0,
        "abstract": "The application of increasing technology developed explicitly in the health field would significantly have an urgent role in guaranteeing quality service. Application deep data mining techniques classifier method, one among them used for classify something possibility, for example for classification disease. Dengue Hemorrhagic Fever is a disease caused by the dengue virus biting the Aedes aegypti mosquito. Meanwhile, Typhoid Fever is a disease caused by the bacterium Salmonella typhi. The second disease could attack all types of circles, fine children or mature ones. The second disease is almost the same symptom, so a proper diagnosis is needed to differentiate it. Study this applies the Naive Bayes algorithm to classify Dengue Hemorrhagic Fever and Typhoid Fever using 250 yield data test blood routine hematology at Tugurejo Hospital. Attributes used in the study, age, type sex, temperature, leukocytes, erythrocytes, hemoglobin, hematocrit, platelets, anti-dengue IgG, anti-dengue IgM, salmonella typhi o and salmonella Typhi h. The Naïve Bayes method is one of the techniques that can be used to perform analysis in determining the diagnostic results from a number of data studied with the aim of producing optimal results. The use of the Naïve Bayes method in this application is due to the probability that the accuracy value of the Nave Bayes method is close to the accuracy value of the experts.[12] The results of testing the Naive Bayes method using a confusion matrix show Recall value is 97.62%, Precision is 93.89%, accuracy is 93.33%, and Error Rate is 6 %. It can be concluded that this method is suitable for classifying Dengue Hemorrhagic Fever and Typhoid Fever and can be applied in studying this.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33633/jais.v8i1.7547"
    },
    {
        "id": 9160,
        "title": "Classification of Hearing Loss Degrees with Naive Bayes Algorithm",
        "authors": "Okky Putra Barus,  Romindo,  Jefri Junifer Pangaribuan",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "According to the World Health Organization (WHO), hearing loss is one of the fourth leading causes of disability. The number of people with hearing loss continues to increase yearly. This increase occurred due to delays in recognizing hearing loss, leading to delays in providing treatment. To solve this problem, one solution to deal with this is early identification to detect the degree of hearing loss. This research will use machine learning to classify the degree of hearing loss. The algorithm implemented in this study is naive Bayes. This study uses a data set from the Zenodo open access repository with 3105 raw data and 19 features. This study evaluates the performance of overall accuracy, precision, recall, and f1-score and classified four classes: mild, moderate, moderately severe, and severe. The methodology classification stages in this study include data preprocessing, data training, data testing, and evaluation. From evaluating the performance of the Naive Bayes algorithm,  the classification results obtained the highest impacts in the form of 94% overall accuracy, 100% precision, 100% recall and 97% f1-score in classifying the degree of hearing loss.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.29207/resti.v7i4.4683"
    },
    {
        "id": 9161,
        "title": "Enhancing Malware Detection through Machine Learning: A Comparative Analysis of Random Forest and Naive Bayes Classification Systems",
        "authors": "D Asir",
        "published": "2024",
        "citations": 0,
        "abstract": "Malware, a type of malicious software encompassing viruses, worms, Trojans, backdoors, and spyware, poses a grave threat to the confidentiality, integrity, and functionality of computer systems, given their integral role in everyday life. To combat the escalating sophistication of malware attacks, deep-learning-based Malware Detection Systems (MDSs) have emerged as indispensable components of both economic and national security. Utilizing a dataset sourced from a repository, our research focuses on classifying observations into benign and malicious software for Android devices, employing machine learning algorithms such as Random Forest and Naïve Bayes. The dataset comprises 100,000 observations with 35 features, and our evaluation metrics encompass accuracy, precision, recall, and F1-score. This study underscores the significance of MDSs in safeguarding against evolving cyber threats, utilizing cutting-edge machine learning techniques to bolster defense mechanisms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62226/ijarst20241332"
    },
    {
        "id": 9162,
        "title": "Perbandingan Algoritma Naïve Bayes dan K-Nearest Neighbors untuk Klasifikasi Metabolik Sindrom",
        "authors": "Fitriana Sholekhah, Adinda Dwi Putri, Rahmaddeni Rahmaddeni, Luasiana Efrizoni",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "Kondisi medis yang dikenal sebagai sindrom metabolik berpotensi meningkatkan kemungkinan penyakit jantung koroner, stroke, serangan jantung dan diabetes tipe 2. Sindrom metabolik juga dapat menyebabkan gula darah tinggi, kadar kolesterol rendah, obesitas secara bersamaan dan kelebihan lemak di daerah pinggang. Jika kombinasi dari ketiga kondisi ini terjadi maka dapat dikatakan penyakit ini  sebagai sindrom metabolik. Selain itu, sindrom metabolik juga dikaitkan dengan resistensi insulin, artinya dimana sel-sel tubuh tidak merespon baik terhadap efek insulin yang menyebabkan kadar gula darah tinggi karena gula tidak terserap ke dalam sel dengan baik. Sindrom metabolik tumbuh seiring meningkatnya obesitas di Asia, dengan perkiraan prevalensi yang terus naik. Ini berpotensi meningkatkan kasus penyakit kardiovaskular dan risiko kematian. Oleh karena itu, perlu dikembangkan model untuk mendiagnosis sindrom metabolik. Penelitian ini bertujuan untuk membandingkan kinerja algoritma klasifikasi utama, yaitu Naïve Bayes (NB) dan K-Nearest Neighbors (KNN) dalam mendeteksi sindrom metabolik. Hasil dari penelitian ini menunjukkan bahwa penggunaan algoritma Naïve Bayes menghasilkan akurasi sebesar 79%, sedangkan akurasi tertinggi dari algoritma K-Nearest Neighbors (KNN) adalah 82%. Kesimpulannya, dari hasil penelitian ini menunjukkan bahwa algoritma K-NN dengan pembagian data 50:50 lebih efektif dalam memprediksi dan mengklasifikasikan sindrom metabolik.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1249"
    },
    {
        "id": 9163,
        "title": "A classification and extraction method of attribute hybrid big data based on Naive Bayes algorithm",
        "authors": "Liantian Li, Ling Yang",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "In the identification of network text information, the existing technology is difficult to accurately extract and classify text information with high propagation speed and high update speed. In order to solve this problem, the research combines the Naive Bayes algorithm with the feature two-dimensional information gain weighting method, uses the feature weighting method to optimize the Naive Bayes algorithm, and calculates the dimension of different documents and data categories through a new feature operation method. The data gain between them can improve its classification performance, and the classification models are compared and analyzed in the actual Chinese and English databases. The research results show that the classification accuracy rates of the IGDC-DWNB model in the Sogou database, 20-newsgroup database, Fudan database and Ruster21578 database are 0.89, 0.89, 0.93, and 0.88, respectively, which are higher than other classification models in the same environment. It can be seen that the model designed in the research has higher classification accuracy, stronger overall performance, and stronger reliability and robustness in practical applications, which can provide a new development idea for big data classification technology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jcm-226802"
    },
    {
        "id": 9164,
        "title": "Comparison Analysis of Classification Model Performance in Lung Cancer Prediction Using Decision Tree, Naive Bayes, and Support Vector Machine",
        "authors": " Dewi Widyawati,  Amaliah Faradibah",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "This research aims to analyze the performance of three classification models, namely Decision Tree Classifier, Support Vector Machine, and Naive Bayes Classifier, in predicting lung cancer using the \"Lung Cancer Prediction\" dataset. The performance evaluation metrics used include accuracy, precision weighted, recall weighted, and F1 weighted. As a preliminary step, exploratory data analysis (EDA) and dataset preprocessing, including feature selection, data cleaning, and data transformation, were conducted. The test data results showed that the Decision Tree Classifier and Naive Bayes Classifier had similar performances with high accuracy, precision, recall, and F1 values. Meanwhile, the Support Vector Machine also exhibited competitive performance, although its precision weighted value was slightly lower. Additionally, an outlier analysis was conducted using box plots, revealing that the Decision Tree Classifier had 2 outlier values, while the Support Vector Machine had 4 outlier values, and Naive Bayes had no outlier values. In conclusion, all three classification models demonstrated good potential in lung cancer prediction. However, selecting the best model requires consideration of relevant evaluation metrics for the application and accommodating the limitations of each model. Further evaluation and in-depth analysis are needed to ensure the reliability of the models in predicting lung cancer cases more accurately and consistently.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56705/ijodas.v4i2.76"
    },
    {
        "id": 9165,
        "title": "DATA MINING UNTUK CLASSIFICATION DALAM MENDETEKSI KERUSAKAN ELEKTROKARDIOGRAM MENGGUNAKAN NAIVE BAYES",
        "authors": "Chronika Putriani Sihombing, Heri Nurdiyanto",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29100/jipi.v8i3.3894"
    },
    {
        "id": 9166,
        "title": "Efficient plant leaf disease detection using support vector machine algorithm and compare its features with Naive Bayes classification",
        "authors": "Y. Aravind Reddy, M. Adimoolam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0174001"
    },
    {
        "id": 9167,
        "title": "A Machine Learning Perspective on Daisy and Dandelion Classification: Gaussian Naive Bayes with Sobel",
        "authors": "Christian Dwi Suhendra, Effan Najwaini, Eny Maria, Edi Faizal",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "This study explores the classification of Daisy and Dandelion flowers using a Gaussian Naive Bayes classifier, enhanced by Sobel segmentation and Hu moment feature extraction. The research adopted a quantitative approach, utilizing a balanced dataset of Daisy and Dandelion images. The Sobel operator was employed for image segmentation, accentuating the floral features crucial for classification. Hu moments, known for their invariance to image transformations, were extracted as features. The Gaussian Naive Bayes algorithm was then applied, with its performance evaluated through a 5-fold cross-validation process. The results exhibited moderate accuracy, with the highest recorded at 60%, and precision peaking at 62.60%. These findings indicate a reasonable level of effectiveness in distinguishing between the two species, though variations in performance metrics suggested room for improvement. The study contributes to the field of botanical image classification by demonstrating the potential of integrating image processing techniques with machine learning for flower classification. However, it also highlights the limitations of the Gaussian Naive Bayes approach in handling complex image data. Future research directions include exploring more advanced machine learning algorithms and expanding the feature set to enhance classification accuracy. The practical implications of this research extend to ecological monitoring and agricultural studies, where efficient and accurate plant classification is vital",
        "keywords": "",
        "link": "http://dx.doi.org/10.56705/ijodas.v4i3.112"
    },
    {
        "id": 9168,
        "title": "Penerapan Text Mining Pada Sistem Rekomendasi Pembimbing Skripsi Mahasiswa Menggunakan Algoritma Naive Bayes Classifier di Program Studi Ilmu Komputer UIN Sumatera Utara Medan",
        "authors": "Rakhmat Kurniawan. R, Muhammad Ikhsan",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "Penunjukan dosen pembimbing skripsi oleh program studi akan disesuaikan dengan rumpun keilmuan dosen dengan topik dari judul proposal skripsi mahasiswa. Selain rumpun keilmuan, program studi juga harus berusaha mendistribusikan dosen pembimbing secara proporsional, sehingga potensi terjadinya kelebihan beban kerja pada dosen pembimbing dapat dihindari. Hal ini berlaku untuk dosen pembimbing I dan dosen pembimbing II. Selanjutnya dirasa perlu melakukan penelitian untuk mengatasi masalah tersebut. Dengan harapan memudahkan pengelola program studi dalam menentukan Pembimbing Skripsi yang sesuai antara topik dengan keilmuan dosen. Selanjutnya mempercepat proses penentuan judul skripsi mahasiswa dan tentunya juga akan mempercepat proses penyelesaian studi mahasiswa strata 1. Maka dirancanglah sebuah sistem yang mampu merekomendasi dosen pembimbing yang sesuai dengan topik skripsi yang diajukan melalui teknologi text mining menggunakan algoritma NBC. Algoritma NBC mampu untuk mendeteksi topik yang ada pada suatu koleksi dokumen beserta besarnya kemunculan topik tersebut.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i6.3500"
    },
    {
        "id": 9169,
        "title": "Text Mining: Sistem Prediksi Cyberbullying pada Platform Twitter menggunakan Logistic Regression, KNN, dan Naive Bayes",
        "authors": "Aditya Erlangga Wibowo, Alpian Khairi, Hildiana Humairoh, M Irvin Fadillah, M. Jordy Dwi Hartawan",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Kemajuan pesat teknologi dan sosial media bisa memudahkan orang-orang untuk berkomunikasi dan juga memberikan informasi. Namun sosial media dapat membagikan efek negatif melalui cara membuat ketikan negatif atau komentar yang semaunya yang bertujuan untuk merendahkan bahkan menjatuhkan seseorang tanpa melihat perasaan orang tersebut. Hal tersebut yang membuat terjadinya aktivitas kekerasan di dalam ruang siber (Cyberbullying). Pemrosesan bahasa juga dikenal sebagai text preprocessing mencakup text to corpus, cleansing, case folding, dan stopword removal sebagai fase paling awal yang harus dilakukan dalam penelitian ini. Kemudian langkah selanjutnya adalah feature selection berguna untuk menggantikan dokumen teks menjadi sebuah matriks yang bertujuan menggunakan fitur yang ditemukan di semua kata sebagai parameter atau kriteria klasifikasi. Dengan menggunakan tiga algoritma yaitu Logistic Regression, KNN, dan Naive Bayes classification, maka kita dapat menentukan apakah komentar tersebut mengandung makna bullying atau tidak. Prosedurnya adalah dengan mengurangi peluang dari setiap kata baru berdasarkan class dan perkalian class conditional probability. Dari hasil pengujian memakai dataset \"komentar cyberbullying\" yang diperoleh dari Algoritma Data Science School. Hasil terbaik dari ketiga algoritma tersebut diperoleh dengan menggunakan metode Naive Bayes, dengan accuracy sebesar 80,73%, precision 77,55%, dan recall sebesar 85,07%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36706/jres.v4i1.56"
    },
    {
        "id": 9170,
        "title": "Comparison of tuberculosis disease classification using support vector machine and Naive Bayes algorithm",
        "authors": "Yogiek Indra Kurniawan, Aini Hanifa, Lasmedi Afuan, Ari Fadli, Muhammad Syaiful Aliim",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0110987"
    },
    {
        "id": 9171,
        "title": "Novel classification to detect metro water fraudulent in houses using naive bayes and comparison of prediction accuracy with decision tree analysis algorithms",
        "authors": "D. Sreekanth, K. Thinakaran",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0172958"
    },
    {
        "id": 9172,
        "title": "Naive Bayes and SVM-based Classification of Myocardial Tissue with Echocardiography Images for Heart Disease Diagnosis",
        "authors": "Jamunadevi C, Prarthana V, Arun Prasath D, Pandikumar S, M Manimaran",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370212"
    },
    {
        "id": 9173,
        "title": "Nonparametric Regression Analysis of BE4DBE2 Relationship with n and z Variables using Naive Bayes and SVM Classification on Nuclear Data",
        "authors": "Ruben Cornelius Siagian",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "This research article describes several analyses of nuclear data using various statistical methods. The first analysis uses linear regression to investigate the relationship between the independent variables (n and z) and the response variable (BE4DBE2). The second analysis uses a nonparametric regression model to overcome the assumptions of normality and linearity in the data. The third analysis uses the Naive Bayes method to classify nuclear data based on variables n and z. The fourth analysis uses a decision tree to classify nuclear data based on the same variables. Finally, the article describes an SVM analysis and a K-means analysis to classify and group nuclide data. The article presents clear and organized descriptions of each analysis, including visual representations of the results. The findings of each analysis are discussed, providing valuable insights into the relationships between the variables and the response variable. The article demonstrates the usefulness of statistical methods in analyzing nuclear data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18495/comengapp.v12i3.443"
    },
    {
        "id": 9174,
        "title": "HYBRIDIZATION OF THE NAIVE BAYES CLASSIFICATION METHOD IN THE FRESHWATER FISH SEED SELLER CLASSIFICATION MODEL",
        "authors": "M Hafidz Ariansyah, Esmi Nur Fitri, Sri Winarno, Asih Rohmani, Fikri Budiman, Junta Zeniarja, Edi Sugiarto",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "Freshwater fish seed sellers play several roles in the supply chain process in the freshwater fish farming business. The role of the seller of freshwater fish seeds in this process is to distribute fish seeds which are one of the upstream sources in the supply chain process. Freshwater fish cultivators must select competent freshwater fish seed sellers so the supply chain process can run well. A large number of freshwater fish seed sellers in the market remind freshwater fish cultivators to choose the quality of the freshwater fish seed seller in terms of seed quality, low prices, shipping that can reach many areas, ergonomic packaging, and others. This study proposes Hybrid Naïve Bayes Classifiers (HNBCs) as a machine learning method for classification. This study aimed to compare the seed seller classification method in which the appropriate pattern of seed seller was identified by hybridization of Naïve Bayes Classifiers (NBCs), and then the researchers conducted performance appraisal and evaluation. The results are beneficial for freshwater fish cultivators and researchers which will enable them to formulate their plans according to the predicted results. The proposed method has produced significant results by achieving a training data accuracy of 82.61% and the testing data accuracy of 73.91%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.2.715"
    },
    {
        "id": 9175,
        "title": "APPLICATION OF DATA MINING USING NAIVE BAYES ALGORITHM FOR CLASSIFICATION OF EMPLOYEE CONTRACT EXTENSION AT PT TORINI JAYA ABADI",
        "authors": " Winda Yulianti, Wiyanto Wiyanto,  Nisa Nurhidayanti",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "An employment contract is an agreement made verbally or in writing between an employee and an employer, the working status of contract employees in a company is an important matter and needs to be considered in order to achieve company goals. PT Torini Jaya Abadi is a company that uses a work contract system. Every year there must be employees who are protected or their work contracts are terminated. In terms of determining whether an employee is strained or terminates his work contract, there are often difficulties in determining this. This is done to create a system that can help determine the extension of an employee's work contract by classifying it into the labels Extended and Disconnected which have 18 Variables for the process of assessing employees who will have problems or termination of employment contract. This system uses the Naïve Bayes method and is built using the Bootstrap programming language and MySQL database. The results of this study are a system that helps PT Torini Jaya Abadi in extending employee work contracts.\r\n \r\nKeywords : Employment Contract, Naïve Bayes algoritm, PHP MySQL",
        "keywords": "",
        "link": "http://dx.doi.org/10.51401/jinteks.v5i3.3348"
    },
    {
        "id": 9176,
        "title": "Validate students performance based on enrolled module using classification technique of novel naive bayes comparing with logistic regression",
        "authors": "C. Vamsi Krishna, S. Ashokkumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0179810"
    },
    {
        "id": 9177,
        "title": "KLASIFIKASI KEMANCETAN LALU LINTAS DI INDONESIA MENGGUNAKAN METODE NAIVE BAYES CLASSIFICATION",
        "authors": "Abdul Robi Padri",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": " ABSTRACTTujuan dari penelitian ini untuk data menganalisis akurasi kemancetan menggunakan google colab  dalam mendeteksi kemacetan berdasarkan provinsi di indonesia, penulis mencoba menguji strategi dalam menangani Kemacetan wilayah indonesia, dengan memanfaatkan metode naïve bayes. Pada jurnal ini menerapkan dengan google colab. Penelitian ini memakai data yang bersumber dari crawling data di twiter. Penggunaan metode naive bayes dalam mencari Rute terpendek efesien dan tidak mancet. Penerapan Angkot Sekolah online menggunakan Metode naive bayes dalam Minimalisir Biaya Perjalanan menjemput Siswa dapat mengurangi macet, mengurangi kecelakaan, mengurangi waktu keterlambatan siswa, minimalisir ongkos perjalanan. Saran yang diberikan yaitu menjadi bahan evaluasi bagi pemerintah dalam menangani Kemacetan di indonesia, secara efisien, aman dan transparanKeyword: Klasifikasi kemancetan, naïve bayes,  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.24176/simet.v14i2.10102"
    },
    {
        "id": 9178,
        "title": "A Comparison of Text Classification Methods: Naïve Bayes and Support Vector Machine for E-Commerce Item Classification",
        "authors": "Arnold Pramudita, Raphael Wijaya, Steven Cokro, Ghinaa Zain Nabiilah,  Rojali",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitacee58587.2023.10276728"
    },
    {
        "id": 9179,
        "title": "COMPARISON OF K-NEAREST NEIGHBOR AND NAIVE BAYES METHODS FOR CLASSIFICATION OF NEWS CONTENT",
        "authors": "Andi Tejawati, Anindita Septiarini, Rondongalo Rismawati, Novianti Puspitasari",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "With the development of technology, news reading via the internet or digital tends to increase. In addition, there are about 300 to 400 news articles in one month and many categories of news articles in a web portal. It makes the editor's performance more and more because an editor must be able to edit articles from various channels and at the same time have to categorize articles one by one manually into several specified categories. This study aims to compare the K-Nearest Neighbor (KNN) and Naive Bayes methods to classify news content in order to obtain the best method. The data used in this study are news articles from the web portal kaltimtoday.co from January 2022 to March 2022. Therefore 576 data are obtained. The results showed that the application of the KNN and Naive Bayes methods could be used to classify news content. The KNN method is able to produce a higher accuracy value than Naïve Bayes, reaching 86% and 51% with test data of 100 news articles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.2.676"
    },
    {
        "id": 9180,
        "title": "Sentiment analysis on the classification of Kereta Commuter Indonesia passenger opinions through Twitter using the naive bayes method",
        "authors": "Mathilda F. P. Kabangnga, Dedi Trisnawarman, Desi Arisandi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0126975"
    },
    {
        "id": 9181,
        "title": "Arabic Web Page Classification with AraBert and Mixture vectorization Methods: Analysis Using K-NN, LSTM and Naive Bayes",
        "authors": "Abdelmounaim Kerkri, Mohamed Amine Madani, Hicham Ghouch, Karima El Majdoub",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idsta58916.2023.10317860"
    },
    {
        "id": 9182,
        "title": "CLASSIFICATION OF ROASTING RATES IN COFFEE BEANS BY DIGITAL IMAGE PROCESSING USING THE NAIVE BAYES CLASSIFIER (NBC) METHOD",
        "authors": "M. Mahaputra Hidayat, Eko Prasetyo, Bambang Teguh Wicaksono",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Coffee is the bean of the coffee plant and is the source of coffee drinks. Coffee beans must pass through the coffee roasting stage or also called coffee roasting, from this stage of the process the coffee will be roasted and this process also has its own level. At this stage of the roasting process coffee shop business people often do not know this process, then in this case used Local Binary Pattern (LBP) method. LBP is a simple and very efficient texture operator by labeling pixels by doing thresholding on each pixel neighbors and considers the result as a binary number. This method is used to obtain the texture ektrasi of an image. While for the classification method using the Naive Bayes Classifier (NBC) method. Naive Bayes is a simple probabilistic classifier that calculates a set of probabilities by summing the frequencies and combinations of values from a given dataset. The algorithm uses Bayes' theorem and assumes all the independent or non-interdependent attributes given by the values on the class variables. From the test results by comparing training data and testing data obtained an accuracy rate of 81%. For an image-based developed system with display recognition difficulties, this performance is good.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31284/j.iptek.2023.v27i1.3697"
    },
    {
        "id": 9183,
        "title": "Precision in Classification: A Comparative Study of Logistic Regression, Naive Bayes, LSTM, and CNN for Spam Email Detection",
        "authors": "Et al. Ratnam Dodda",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "This research presents a comprehensive comparative study on the precision of classification algorithms applied to spam email detection. The study focuses on four distinct algorithms: Logistic Regression, Naive Bayes, Long Short-Term Memory (LSTM), and Convolutional Neural Network (CNN). The evaluation encompasses a common dataset to ensure a fair and rigorous assessment of each algorithm’s performance. We investigate and analyze precision metrics, considering the trade- offs between true positives and false positives. The comparative study provides insights into the strengths and limitations of each algorithm in effectively identifying spam emails. The results contribute valuable knowledge to the field of email security and classification, guiding practitioners and researchers towards informed algorithm selection based on precision considerations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.9233"
    },
    {
        "id": 9184,
        "title": "Red Chili Classification Using HSV Feature Extraction and Naive Bayes Classifier",
        "authors": " Hermawan Syahputra, Josua Nainggolan, Johanes Apriadi Parlinggoman Sirait,  Muhammad Fadlan Ikromi, Putri Ameliya Lubis",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "In the culinary industry, the classification of red chili pepper types is used to identify varieties that differ in terms of flavor, pungency, or other uniqueness. This enables their proper use in various recipes and meals. In the market, the classification of red chili pepper types helps in pricing, variety selection, or quality standards applied. For this reason, the purpose of this research is to classify red chili peppers using HSV Feature Extraction and Naive Bayes Clasifier. The stages carried out include: data collection, preprocessing, feature extraction and classification. Red chilies are grouped into 4 classes, namely large red chilies, cakplak red chilies, curly red chilies and chili red chilies. The red chili data used is 119 training data and 123 testing data. In the preprocessing, the image is converted to grayscale, then converted to binary image with the thresholding method. Furthermore, feature extraction is done with the HSV method. Finally, classification is done with Naive Bayes. The results of the study provide an accuracy value for training data of 92.43% and for testing data obtained an accuracy of 92.69%. This method is suitable for use in classification because it gives good results",
        "keywords": "",
        "link": "http://dx.doi.org/10.37373/tekno.v11i1.593"
    },
    {
        "id": 9185,
        "title": "Classification Of Maternal Health Risk Using Three Models Naive Bayes Method",
        "authors": "Nurul Fathanah Mustamin, Firman Aziz, Firmansyah Firmansyah, Pertiwi Ishak",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Lack of information related to maternal health care during pregnancy and post-pregnancy, especially in rural areas, results in many cases of pregnancy complications. Risk analysis for pregnant women is really needed as a reference in handling pregnant women so that the risk to pregnant women can be minimized. To analyze the risk of pregnant women can use data mining techniques by classifying the risk of pregnant women. This study proposes to classify Maternal Health Risk using the Naive Bayes method with three models, namely Gaussian, Multinomial, and Bournolli. The data used is the health data of pregnant women based on risk intensity which is grouped into three classes, namely low, mid and high risk. while the attributes are Age, Systolic Blood Pressure as SystolicBP, Diastolic BP as DiastolicBP, Blood Sugar as BS, Body Temperature as BodyTemp, and HeartRate. The results show that among the three Naïve Bayes models that have the best performance are the Multinomial and Bournolli with an accuracy of 84.8% while the Gaussian produces an accuracy of 82.6%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ijccs.84242"
    },
    {
        "id": 9186,
        "title": "Comparison of KNN, naive bayes, and decision tree methods in predicting the accuracy of classification of immunotherapy dataset",
        "authors": "Nadhifa Reska, Khansa Tsabita",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Health is crucial for humans to carry out daily activities, and cancer is the second leading cause of death worldwide. Maintaining health is essential in minimizing factors associated with cancer. Immunotherapy is a new cancer treatment technique that has s shown a bigger success rate compared with conventional techniques. However, the effectiveness of this method depends on accurate diagnosis, which requires deeper analysis and research on classification methods. This study compares the accuracy of KNN, Naive Bayes, and Decision Tree classification methods in predicting the accuracy of immunotherapy treatment. The goal is to find the most effective classification techniques that can provide more accurate predictive results in treating diseases using immunotherapy. Based on the test results of Naive Bayes, Decision Tree, and K-Nearest Neighbor, the result obtained of accuracy rates are 81.11%, 80.00%, and 74.44%. From the accuracy comparison, it is known that the Naive Bayes algorithm is the most effective algorithm with the highest accuracy value of 81.11%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52465/josre.v1i2.170"
    },
    {
        "id": 9187,
        "title": "A classification-based graduate profiles based on tracer study using Naive Bayes classifier algorithm",
        "authors": "Junus Sinuraya,  Friendly",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0117418"
    },
    {
        "id": 9188,
        "title": "Comparison of Naive Bayes and PSO-Based Naive Bayes Algorithms for Prediction of Covid-19 Patient Recovery Data in Indonesia",
        "authors": " Alvina Felicia Watratan,  Ema Utami,  Anggit Dwi Hartanto",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "A brand new disease known as COVID 19 was identified in 2019 but has yet to infect humans (World Health Organization, 2019). This group of viruses can infect mammals, including humans and birds, and cause sickness. People commonly contract coronaviruses from the flu and other minor respiratory diseases, but they can also spread serious diseases such as SARS, MERS, and the deadly COVID-19. Therefore, to avoid further casualties, this number must be decreased. It is crucial to understand the variables that can truly reduce the danger of death and gauge the propensity for recovery in Covid-19 patients. Several techniques in data mining can be used to forecast patient recovery rates depending on various characteristics. The criteria of this study included gender, age, province, and status. The Naive Bayes (NB) and Pso-based Naive Bayes algorithms are compared in this study using patient data sets to determine whether the strategy is more accurate. The findings of this study reveal that the NB method has a 94.07% accuracy rate, a precision value of 14%, a recall value of 1% and an AUC value of 0.613, according to the study data. The accuracy rate of the Naive Bayes based on PSO is 95.56%, the precision is 25%, the recall is 1%, and the AUC is 0.540.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.29207/resti.v7i4.4893"
    },
    {
        "id": 9189,
        "title": "Penggunaan Algoritma Naive Bayes Dalam Text Mining Untuk Klasifikasi Pasal UU ITE",
        "authors": "Farhan Farhan, Triase Triase, Aninda Muliani Harahap",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "Saat ini, kemajuan informasi dan teknologi terus mengalami perkembangan yang pesat. Meskipun memberikan kemudahan bagi manusia, pengguna internet juga bisa mengalami risiko dalam keamanan dan privasi data mereka. Untuk mengatasi hal ini, UU ITE dibuat sebagai bentuk perlindungan bagi pengguna internet. Namun, masih banyak masyarakat yang melanggar peraturan dalam UU ITE. Untuk meningkatkan kesadaran pengguna internet, teknologi Machine Learning digunakan dengan metode Text Mining untuk mengklasifikasikan pelanggaran UU ITE berdasarkan teks kronologi pelanggaran dengan menggunakan algoritma Naive Bayes. Penelitian ini difokuskan pada pasal 27 dan 28 dengan total data sebanyak 245 kronologi pelanggaran. Pada implementasinya pada aplikasi web, menggunakan micro web framework Python yaitu Flask yang membantu dalam mengeksekusi teks kronologi dari text pre-processing, weighting, learning, dan testing sehingga menghasilkan informasi mengenai ancaman pasal yang mempunyai probabilitas tinggi untuk dilanggar. Hasil penelitian menunjukkan akurasi sebesar 80% dengan 196 total data latih dan 49 total data uji. Hal ini menunjukkan bahwa algoritma Naive Bayes mampu menghasilkan tingkat akurasi yang tinggi dalam mengklasifikasikan sebuah teks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53513/jsk.v6i2.7896"
    },
    {
        "id": 9190,
        "title": "Machine Learning Approaches for Fish Pond Water Quality Classification: Random Forest, Gaussian Naive Bayes, and Decision Tree Comparison",
        "authors": "Danuri Danuri, Muhammad Mohd Pozi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.21-9-2023.2342964"
    },
    {
        "id": 9191,
        "title": "A COMPARISON OF ARTIFICIAL NEURAL NETWORK AND NAIVE BAYES CLASSIFICATION USING UNBALANCED DATA HANDLING",
        "authors": "Nila Lestari, Indahwati Indahwati, Erfiani Erfiani, Elisa D Julianti",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Classification is a supervised learning method that predicts the class of objects whose labels are unknown. Classification in machine learning will produce good performance if it has a balanced data class on the response variable. Therefore, unbalanced classification is a problem that must be taken seriously. This study will handle unbalanced data using the Synthetic Minority Over-Sampling Technique (SMOTE). The classification methods that are quite popular are the Naïve Bayes Classifier (NB) and the Resilient Backpropagation Artificial Neural Network (Rprop-ANN). The data used comes from the Health Nutrition Research and Development Agency (Balitbangkes) which consists of 2499 observations. This study examines the use of NB and ANN using the SMOTE method to classify the incidence of anemia in young women in Indonesia. Modeling is done on 80% of training data and predictions on 20% of test data. The analysis shows that SMOTE can perform better than not handling unbalanced data. Based on the results of the study, the best method for predicting the incidence of anemia is the Naïve Bayes method, with the sensitivity value of 82%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol17iss3pp1585-1594"
    },
    {
        "id": 9192,
        "title": "Comparison of K-Nearest Neighbor, Naive Bayes Classifier, Decision Tree, and Logistic Regression in Classification of Non-Performing Financing",
        "authors": "Rizky Putra, Iis Dewi Ratih",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "The Non-Performing Financing (NPF) indicator of one of the Islamic Banks in Indonesia in the 1st to 3rd quarter of 2021 in a row of 9.69%; 9.97%; 9.46%. The NPF movement tends to improve slightly from time to time but still exceeds the maximum limit stipulated in Bank Indonesia’s Regulation Number 23/2/PBI/2021, which is no more than 5%. This shows that the Islamic bank has a financing performance that can be said to be less good. Preventive steps that can be taken to reduce the NPF ratio in order to improve the health of the bank is to classify prospective financing customers. This research was conducted using the K-Nearest Neighbor (KNN), Naive Bayes Classifier (NBC), Decision Tree, and Logistics Regression classification methods to predict potential financing customers. The dataset is divided into 80% training and 20% testing. It was found that the best classification result was the Naive Bayes Classifier in the proportion of distribution of 80% training data and 20% testing data with an accuracy value of 84.69%, sensitivity of 58.25%, and specificity of 90.16%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47679/ijasca.v2i2.35"
    },
    {
        "id": 9193,
        "title": "Naive Bayes classification-based surface water gap-filling from partially contaminated optical remote sensing image",
        "authors": "Bingxin Bai, Yumin Tan, Gennadii Donchyts, Arjen Haag, Bo Xu, Ge Chen, Albrecht H. Weerts",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jhydrol.2022.128791"
    },
    {
        "id": 9194,
        "title": "Eligibility Classification of Aid Recipients Hope Family Program in Cinta Rakyat Village Using the Method Weighted Naive Bayes with Laplace Smoothing",
        "authors": "Nurjannah Nurjannah, Hendra Cipta, Rima Aprilia",
        "published": "2023-12-24",
        "citations": 0,
        "abstract": "The Indonesian government sometimes faces difficulties in dealing with poverty problems.  The Indonesian government utilizes a number of programs and stimulants to overcome the problem of poverty.  The government's PKH program offers conditional assistance to low-income families who have been designated as PKH recipient households.  PKH provision is still below optimal standards, this may be because the data used is not updated frequently.  To assist village officials in determining which residents are eligible to receive PKH assistance, this research tries to classify the eligibility of recipient residents in Cinta Rakyat Village.  With the Weighted Naive Bayes method, classification calculations are not only based on probability distributions but also by adding weights to each attribute to the class.  Assisted with Laplace Smoothing to avoid a probability value of 0. As a result, there are eight factors that determine a person's eligibility to receive PKH assistance, including age, occupation, income, number of family members, number of dependent school children, quality of house, type of floor, and type of walls. As well as classification into eligible and non-eligible groups.  And obtained test results using the Confusion Matrix with an accuracy value of 95.65%, error rate of 4.34%, sensitivity of 100% and specificity of 94.74%.  To identify village communities who deserve PKH assistance, Cinta Rakyat Village administrators can use the findings of this research.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.20956/j.v20i2.32069"
    },
    {
        "id": 9195,
        "title": "Spam Sorting Based on Naive Bayes Algorithm",
        "authors": "Hang Gao",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbta60381.2023.00023"
    },
    {
        "id": 9196,
        "title": "Komparasi Metode Naive Bayes dan SVM pada Sentimen Twitter Mengenai Persoalan Perpu Cipta Kerja",
        "authors": "Nur Muhammad Farhan, Bayu Setiaji",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Salah satu yang baru ini ramai diperbincangkan adalah persoalan UU Cipta Kerja yang banyak ragam orang berbincangkan mengenai dampak postif dan negatif mengenai hal tersebut. Oleh karena itu analisa sentimen pada persoalan UU Cipta Kerja untuk bisa mengetahui berapaa banyak orang yang menolak atau mendukung hal tersebut. Penelitian ini menggunakan data tweet sebanyak 622 data tweet yang berbahasa Indonesia. Kemudian ulasan tersebut di katagorikan ke beberapa sentimen dan algoritma, sentimen positif mendapatkan sebanyak 224 tweet, sebanyak 332 tweet yang bersentimen negative, dan sebanyak 66 bersentimen netral. Kemudian data tersebut dimasukkan kedalam algoritma Naïve Bayes dan SVM untuk menentukan tingkat akurasi yang didapatkan. Algoritma Naïve Bayes mendapatkan akurasi 73% dengan data akurasi training 87% dan SVM mendapatkan 78% untuk data testing dengan akurasi 99% dengan data training. Dari hasil tersebut menunjukka bahwa tingkat akurasi algoritma SVM lebih tinggi daripada akurasi algoritma Naïve Bayes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i5.3375"
    },
    {
        "id": 9197,
        "title": "Spectral–Spatial Classification With Naive Bayes and Adaptive FFT for Improved Classification Accuracy of Hyperspectral Images",
        "authors": "Arvind Kumar Singh, Renuvenkataswamy Sunkara, Govind R. Kadambi, Vasile Palade",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jstars.2023.3327346"
    },
    {
        "id": 9198,
        "title": "A Novel Fuzzy Geometric Naive Bayes Network for Online Skills Assessment in Training Based on Virtual Reality",
        "authors": "Jodavid Ferreira, Arthur Lopes, Liliane Machado, Ronei Moraes",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012211000003595"
    },
    {
        "id": 9199,
        "title": "Improving the Accuracy of Intrusion Detection System in the Detection of DoS using Naive Bayes with Lasso Feature Elimination and Comparing with Naive Bayes without Feature Elimination in Wireless Adhoc Network",
        "authors": "A. Senthil Kumar, T J Nagalakshmi, Meenakshisundaram. N",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10199248"
    },
    {
        "id": 9200,
        "title": "Migraine Categorization based on the Integration of EMD and Naive Bayes Classification",
        "authors": "Nyi Nyein Aung, Wanus Srimaharaj",
        "published": "2023-3-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ectidamtncon57770.2023.10139707"
    },
    {
        "id": 9201,
        "title": "Comparison of Naive Bayes Method and Binary Logistics Regression on Classification of Social Assistance Recipients Program Keluarga Harapan (PKH)",
        "authors": " Fanni Rahma Sari,  Fadhilah Fitri,  Atus Amadi Putra,  Dony Permana",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "Population density is one of the causes of economic inequality in society. One of the solutions provided by the government is to distribute social assistance. In 2007 the government created a social assistance program called the “Program Keluarga Harapan” (PKH) with the aim of alleviating poverty. There are several problems in the distribution of social assistance, one of which is receiving aid that is not right on target. Therefore, an appropriate method is needed in classifying the recipients of social assistance properly. This study will use two methods, namely Naive Bayes and Binary Logistic Regression to compare which method is better on the data used. The data used is the DTKS data for PKH assistance recipients in the Anduring Village in 2020. Based on the results obtained, the accuracy of the Naive Bayes method is 70% and Binary Logistic Regression is 73%. So the best method in measuring classification is Binary Logistic Regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol1-iss2/24"
    },
    {
        "id": 9202,
        "title": "Classification of Heart Disease: Comparative Analysis using KNN, Random Forest, Gaussian Naive Bayes, XGBoost, SVM, Decision Tree, and Logistic Regression",
        "authors": "Yoshiven Boer, Lianca Valencia, Melisa Rachel Setiadi, Karli Eka Setiawan, Muhammad Fikri Hasani",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoris60118.2023.10352195"
    },
    {
        "id": 9203,
        "title": "Performance Analysis of Naive Bayes Variation Method in Spice Image Classification Using Histogram of Gradient Oriented (HOG) Feature Extraction",
        "authors": "Taufik Ismail Simanjuntak, Muhathir Muhathir, Fadlisyah Fadlisyah, Ira Safira",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "Indonesia has a lot of natural wealth of spices. The diversity of spices is an inseparable aspect of Indonesian history. Spices and seasonings are biological resources that have long played an important role in human life. Indonesian spices have almost the same color and shape. The purpose of this study was to analyze the performance of the Naïve Bayes variation method in classifying spices using a Histogram Of Oriented Gradient (HOG) feature extraction. Based on 3 tests, the performance of the four Naïve Bayes variation methods carried out in this study, it can be seen that testing 5 types of spices using the Gaussian Naïve Bayes method obtained the best performance with an accuracy of 0.946, a precision of 0.95, a recall of 0.945, f1 score of 0.947, f beta score of 0.946, and Jaccard score of 0.90. Where as using the Complement Naïve Bayes method gets the lowest performance. From the results of this study it can be concluded that by utilizing HOG feature extraction and the Naïve Bayes variation method, maximum classification results are obtained in classifying spices. To obtain more accurate classification results, consider using other methods and other feature extraction",
        "keywords": "",
        "link": "http://dx.doi.org/10.31289/jite.v7i1.7957"
    },
    {
        "id": 9204,
        "title": "Sentiment Classification on Twitter Social Media Using K-Means Clustering, C4.5 and Naive Bayes (Case Study: Blocking Paypal by Kominfo)",
        "authors": "Muhammad Zulkarnain Lubis, Hartono Hartono, B Herawan Hayadi",
        "published": "2023-3-5",
        "citations": 0,
        "abstract": "Kominfo (Ministry of Communication and Information) requires all PSEs (Electronic System Providers) to register themselves so that their access is not blocked, as shown in the case of Paypal and several other PSEs. The blocking case reaps mixed opinions from netizens, especially Twitter social media users. We use the sentiment values obtained from the content of tweets collected through the crawling process and employ the K-Means Clustering to group them into clusters. Finally, we use these clusters as the target in a dataset and classify them using the C4.5 and Naive Bayes algorithms. Of the 1000 netizen tweets studied, we found that 6.5% of netizens supported the blocking action, 75.4% did not care or felt that the blocking action had no effect on them, and 15.4% did not support the blocking by Kominfo. The classification results in this study resulted in a 98.2% accuracy value, a 95% precision value, and a 95.5% recall value.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35842/icostec.v2i1.41"
    },
    {
        "id": 9205,
        "title": "Multinomial Naive Bayes Algorithm for Indonesian language Sentiment Classification Related to Jakarta International Stadium (JIS)",
        "authors": "Daffa Rizki Surya Pratama, Tb Ai Munandar, Khairunnisa Fadhilla Ramdhania",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "The research focuses on analysing public evaluations, particularly those on Google Maps, about the Jakarta International Stadium (JIS). The study aims to employ the multinomial Naive Bayes algorithm to ascertain the sentiment expressed in these reviews. The objective of this study was to employ the multinomial Naive Bayes method to analyse the reviews on Google Maps pertaining to the Jakarta International Stadium (JIS). The utilised data consists of 2971 public reviews on Google Maps specifically pertaining to Jakarta International Stadium (JIS). These reviews were acquired through web scraping using a data miner. The acquired data is next processed in the text preparation phase to generate a prepared dataset suitable for analysis. This preprocessing stage includes operations such as casefolding, stopword removal, tokenizing, and stemming. The study yielded an accuracy of 0.83, or 83%, when tested on 733 data points. Out of these, 292 positive data points were correctly anticipated, while 59 positive data points were incorrectly forecast. Additionally, 317 negative data points were correctly predicted, while 65 negative data points were incorrectly predicted. The conducted modelling is subsequently categorised using a novel dataset of 161 review data points, with the objective of discerning the sentiment expressed within the dataset. The analysis of the new dataset yielded 101 reviews with positive sentiment and 50 reviews with negative sentiment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58776/ijitcsa.v2i1.118"
    },
    {
        "id": 9206,
        "title": "Safeguarding Job Seekers: Research Insights into Fake Job Detection with SGD Classifier and Naive Bayes",
        "authors": "DEVIKA S.Y, Dr. Ganesh D",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0761"
    },
    {
        "id": 9207,
        "title": "Implementasi Klasifikasi Naive Bayes dan Pemodelan Topik dengan Latent Dirichlet Allocation untuk Data Ulasan Video Game Lokal Pada Platform Steam",
        "authors": "Yusra Sakti Wardhana, Ayundyah Kesumawati Ayundyah Kesumawati",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Industri video game global terus meroket dengan partisipasi pemain yang meningkat setiap tahun. Steam, sebagai platform distribusi digital terbesar yang dikembangkan oleh Valve Corporation, memungkinkan pengguna memberikan ulasan terbuka tentang video game. Prediksi sentimen yang akurat dalam ulasan online dapat meningkatkan peluang keuntungan bagi pengembang video game. Penelitian ini fokus pada klasifikasi dan pemodelan topik ulasan video game lokal di Steam menggunakan metode Naïve Bayes dan Latent Dirichlet Allocation. Sebelum penyeimbangan data, tingkat akurasi klasifikasi Naïve Bayes mencapai 86%, dan setelah penyeimbangan data, turun menjadi 81%.  Untuk pemodelan topik, penelitian ini mendapatkan 5 topik dengan nilai probabilitas 0.38807 untuk ulasan “Recommended” yaitu topik 1 membahas fitur video game stardew valley, topik 2 membahas puzzle dengan tema fantasy, topik 3 membahas visual art dan soundtrack, topik 4 membahas update patch disertai puzzle dengan musik, dan topik 5 membahas karakter dan gameplay, sedangkan 3 topik dengan nilai probabilitas 0.28095 untuk ulasan “Not Recommended” yaitu topik 1 membahas masalah bug gameplay, topik 2 membahas bug boss battle, dan topik 3 membahas masalah performa video game",
        "keywords": "",
        "link": "http://dx.doi.org/10.20885/esds.vol1.iss.3.art41"
    },
    {
        "id": 9208,
        "title": "Implementation of Naive Bayes Classification Algorithm in Determining Appropriate Help Targets of Unlimited Houses (RTLH) in Bojonegoro District",
        "authors": "Anissa Nurul Farida Tussholikhah, Nurissaidah Ulinnuha, Wika Dianita Utami",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "Rumah merupakan salah satu kebutuhan primer bagi setiap individu, dan termasuk kedalam aset terpenting yang harus dimiliki. Kelayakan rumah yang layak huni dan tidak layak huni harus dipertimbangkan. Rumah yang tidak memenuhi kecukupan minimum dari segi ruang dan luas ruangan dianggap sebagai Rumah tidak layak huni (RTLH). Untuk mengatasi terjadinya peningkatan RTLH maka pemerintah menanggulanginya dengan memberikan bantuan kepada masyarakat yang layak menerima dengan tepat sasaran. Penelitian ini bertujuan untuk menerapkan metode Naïve Bayes dalam menentukan bantuan tepat sasaran menggunakan dua kelas penelitian, yakni layak menerima bantuan RTLH dan tidak layak menerima bantuan RTLH. Dari analisis klasifikasi menggunakan confusion matrix didapatkan hasil akurasi sebesar 63%, recall 100% dan presisi 25% untuk 400 data training dan 100 data testing dari total 500 data dengan 10 atribut pengujian.The house is one of the primary needs for every individual, and is included in the most important asset that must be owned. The livability of the livable and uninhabitable houses should be considered. A house that does not meet the minimum adequacy in terms of space and room area is considered an uninhabitable house (RTLH). To overcome the increase in RTLH, the government overcomes it by providing assistance to people who deserve to receive it on target. This study aims to apply the Naïve Bayes method in determining targeted assistance using two research classes, namely eligible to receive RTLH assistance and not eligible to receive RTLH assistance. From the classification analysis using the confusion matrix, the results obtained are 63% accuracy, 100% recall and 25% precision for 400 training data and 100 testing data from a total of 500 data with 10 test attributes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24114/cess.v8i2.46295"
    },
    {
        "id": 9209,
        "title": "Community perceptions classification towards the development of transportation access at Darmo Corridor Surabaya using SVM and naive bayes methods",
        "authors": "A Hapsery, A B Tribhuwaneswari",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nThis research conducts Classification of Public Perceptions of Transportation Access Development in Darmo Corridor Surabaya using SVM and Naive Bayes methods. The increasing mobility demands necessitate adequate public transportation facilities, such as the Surabaya bus, which has been operational since 2018. The Darmo corridor has witnessed significant development in public transportation facilities and infrastructure, serving as a transit point between two Surabaya bus routes. The purpose of this study is to evaluate public perception towards the implementation of Transit Oriented Development (TOD) concept in the corridor. In this study, a qualitative descriptive analysis was conducted on various aspects of TOD implementation, such as pedestrian paths, bicycle lanes, and green open spaces. Furthermore, public perception was analyzed using Naive Bayes Classifier and SVM methods by collecting data from Twitter accounts and giving weights based on the frequency of words in the tweets. From the analysis it could be concluded Naïve Bayes is not suitable for classification because it’s not stable enough, the SVM Methods matchs 95% proven when its repeated for 5 more time it. The results showed that the Darmo corridor successfully implemented the TOD concept well, with 90% of the community giving a positive response to the TOD implementation in the area. This finding indicates the success of TOD initiatives in improving transportation facilities and infrastructure in Darmo corridor.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1755-1315/1263/1/012031"
    },
    {
        "id": 9210,
        "title": "Analisis Sentimen Terhadap Aplikasi Pluang Menggunakan Algoritma Naive Bayes dan Support Vector Machine (SVM)",
        "authors": "Bagas Akbar Maulana, Muhammad Jazilul Fahmi, Ari Muhamad Imran, Nutriana Hidayati",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "Analisis sentimen merupakan proses menganalisis teks untuk menentukan sentimen yang diungkapkan, seperti positif, negatif, atau netral. Analisis sentimen dapat digunakan untuk berbagai tujuan, seperti memahami opini publik, mengukur kepuasan pelanggan, dan mendeteksi penipuan. Dalam penelitian ini, kami menerapkan metode klasifikasi sentimen untuk menganalisis ulasan aplikasi Pluang. Aplikasi Pluang adalah aplikasi investasi digital yang menawarkan berbagai produk investasi, seperti emas, saham, dan reksa dana. Kami menggunakan dua model klasifikasi sentimen, yaitu Naive Bayes dan SVM. Hasil penelitian menunjukkan bahwa model SVM bekerja lebih baik dibandingkan model Naive Bayes. Secara spesifik, model SVM memiliki akurasi sebesar 99,50%, presisi 99,67%, recall 99,33%, dan skor F1 sebesar 99,50%. Sedangkan model Naive Bayes memiliki akurasi sebesar 99,25%, presisi sebesar 99,44%, recall sebesar 99,06%, dan skor F1 sebesar 99,25%. Kelebihan model SVM dibandingkan model Naive Bayes adalah kemampuannya untuk membedakan teks positif dan negatif dengan lebih baik. Ini disebabkan oleh beberapa faktor, antara lain: Data negatif memiliki karakteristik yang lebih beragam daripada data positif, SVM menggunakan teknik kernel yang mampu memetakan data ke dalam ruang dimensi yang lebih tinggi, sehingga dapat memodelkan hubungan antar data dengan lebih baik. Secara keseluruhan, penelitian ini menunjukkan bahwa SVM merupakan metode klasifikasi yang efektif untuk menganalisis sentimen ulasan aplikasi Pluang.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1206"
    },
    {
        "id": 9211,
        "title": "Discovery and Comparison of the Relationship between Sleep Health and Lifestyle with PCA, Naive Bayes and Random Forest Trees Methods",
        "authors": "Serkan AYAN, Turgay Tugay BİLGİN",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Uyku, günlük yaşamın temel bir unsuru olarak kabul edilir ve genel sağlık ile refahın sürdürülmesinde önemli bir rol oynar. Bu araştırma, Kaggle platformundan elde edilen \"Uyku Sağlığı Yaşam Tarzı\" veri setini kullanarak bir tahmin modeli oluşturmayı, bu modeli Principal Component Analysis (PCA) yöntemi, Naive Bayes yöntemi ve Rastgele Orman Ağaçları yöntemiyle değerlendirmeyi ve görselleştirmeler gerçekleştirmeyi amaçlamaktadır. İncelenen veri seti, KNIME platformunda PCA modülü ile boyut azaltma işlemine tabi tutulmuş ve elde edilen çıktılar sunulmuştur. Uyku kalitesini etkilediği düşünülen öznitelikler arasındaki ilişkiler, korelasyon hesaplamaları ile belirlenmiştir. Ayrıca, veri seti Naive Bayes ve Rastgele Orman Ağaçları yöntemleriyle analiz edilmiş, tahmin sonuçları KNIME ortamında değerlendirilmiştir. Elde edilen sonuçlar tablolar halinde sunulmuştur. Bu karşılaştırmaların dağılım matrisleri, KNIME platformundaki Scatter Plot modülü kullanılarak görselleştirilmiştir. Bu çalışmanın en önemli katkısı uyku verileri içeren veri setlerinde kullanılabilecek metodolojiler arasında en etkili olan yöntemi belirlemektir. Bulgular, tartışma ve sonuçlar bölümünde detaylı bir şekilde ele alınmıştır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33461/uybisbbd.1415925"
    },
    {
        "id": 9212,
        "title": "Diabetes Analysis Based on Naive Bayes Model",
        "authors": "Linyue Zhang",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "As a matter of fact, diabetes has been one of the most disturbing diseases in human beings’ daily life in recent years. With this in mind, the method to predict diabetes has been conducted through artificial intelligence technology including machine learning as well as big data analysis. On this basis, this study is going to discuss the possibility of predicting diabetes via one of the widely used machine learning scenarios, i.e., Naive Bayes models. According to the analysis, the result shows that although the accuracy is improved after parameter changing, the value is 75.61%, still below 80%. In other words, it indicates that the features offered nowadays are still abundant enough to realize high accuracy predictions. Despite the low accuracy, the result still can be used and applied in many fields, such as the pre-processing of another model’s building. Overall, these results shed light on guiding further exploration of diabetes analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/6hv11s80"
    },
    {
        "id": 9213,
        "title": "PENERAPAN METODE NAIVE BAYES UNTUK MEMPREDIKSI PENYAKIT JANTUNG",
        "authors": "Atthohiroh Atthohiroh, Rama Ayu, Sri Maharani",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "The heart is one of the human organs that has an important function to circulate blood throughout the body. In caring for the human heart, one must know how to take care of the heart and check the health conditions of the heart regularly and do it early in order to avoid dangerous diseases that attack the heart. In this study, a heart disease diagnostic examination was carried out using machine learning with the Naïve Bayes method. The criteria used in predicting heart disease with Naïve Bayes in this study were gender, BP (pneumonia), Cholesterol (cholesterol), and Maxhr. The purpose of using Naive Bayes in this study is to predict using simple probabilities based on the application of Bayes' rules. In this study, Naive Bayes produced a Precision value for heart disease of 87% and for those without 75%, a recall value for those with heart disease 81% and those without heart disease 82%, support values for those with heart disease 84% and those who do not. 78%.Keywords: machine learning, naïve bayes, jantung  Jantung merupakan salah satu organ manusia yang memiliki fungsi penting untuk mengalirkan darah keseluruh tubuh. Dalam merawat jantung manusia harus mengetahui cara menjaga jantung dan memeriksa kondisi kesehatan jantung secara berkala dan dilakukan sejak dini guna menghindari penyakit berbahaya menyerang jantung. Pada penelitian ini dilakukan pemeriksaan diagnosa penyakt jantung menggunakan machine learning dengan metode Naïve Bayes. Kriteria yang digunakan dalam memprediksi penyakit jantung dengan Naïve Bayes dalam penelitian ini yaitu gender(jenis kelamin), BP(radang paru-paru), Cholesterol(kolestrol), dan Maxhr. Tujuannya penggunaan Naive bayes dalam penelitian ini untuk memprediksi menggunakan probabilitas sederhana berdasarkan pada penerapan aturan bayes. Pada penelitian ini naive Bayes menghasilkan nilai Precision untuk penyakit jantung 87% dan untuk yang tidak 75%, nilai recall untuk yang terkena penyakit jantung 81% dan yang tidak terkena penyakit jantung 82%, nilai support untuk yang terkena penyakit jantung 84% dan yang tidak 78% . Kata Kunci: machine learning, naïve bayes, jantung  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54314/teknisi.v3i1.1252"
    },
    {
        "id": 9214,
        "title": "Junk Information Recognition Based on Naive Bayes",
        "authors": "Yuanyao Zhang",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": " This work mainly aims to learn and improve the existing methods of identifying spam information. In this work, the fundamental central principle is applied to naive Bayes. The improvement part is to use naive Bayes to achieve automatic recognition and reporting of spam information in the system, as well as a refined classification of spam information. This paper aims to further deal with junk information (illegal information) through naive Bayes, so as to meet the needs of People's Daily life. In the simple junk information recognition, add life elements, so that junk information recognition more life, close to life, service human.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ajst.v6i2.9442"
    },
    {
        "id": 9215,
        "title": "PREDICTING THE NOVEL CORONAVIRUS USING THE NAIVE BAYES CLASSIFIER",
        "authors": "",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets33647"
    },
    {
        "id": 9216,
        "title": "Spam filter based on naive bayes algorithm",
        "authors": "Mengyuan Han",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "The widespread use of Electronic Mail (E-mail) has led to a significant increase in spam, which has severely impeded the growth and well-being of the Internet. To mitigate this issue, the implementation of email filtering techniques has become necessary, requiring the use of specific technological tools. Presently, the K-Nearest Neighbor (KNN), Support Vector Machine (SVM), and Naive Bayes (NB) algorithms are commonly used in probability statistical classification methods for email filtering. Among these, the NB algorithm is the most classical, with its rich mathematical theory as the basis, high classification efficiency, and straightforward algorithmic approach. However, the algorithm relies on the conditional independence assumption, making the accuracy susceptible to the correlation between attributes. This study focuses on email filtering techniques based on the NB algorithm, conducting experiments to evaluate the classification accuracy and proposing feasible improvements to weaken the independence assumption. The experimental results demonstrated the effectiveness of the employed method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/15/20230844"
    },
    {
        "id": 9217,
        "title": "Analisis Sentimen Ulasan pada Gojek Menggunakan Metode Naive Bayes",
        "authors": "Putri Yuniar,  Kismiantini",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "Abstrak\nGojek merupakan layanan transportasi online yang banyak digunakan di Indonesia. Penting bagi perusahaan untuk memahami persepsi masyarakat terhadap kualitas pelayanan dan produk yang ditawarkan. Namun, sulit untuk memantau banyaknya pendapat masyarakat untuk diproses secara manual. Tujuan dari penelitian ini yaitu mengklasifikasikan ulasan pada aplikasi Gojek dan menganalisis asosiasi kata dari hasil klasifikasi untuk mengetahui topik yang banyak dibicarakan dengan menggunakan data dari halaman Google Play. Beberapa tahapan yang dilakukan dalam analisis sentimen penelitian ini diantaranya yaitu pengumpulan data, preprocessing, perhitungan skor sentimen, pelabelan kelas sentimen, dan pengklasifikasian data dengan metode Naïve Bayes Classifier serta dilakukan asosiasi teks. Metode Naïve Bayes Classifier yaitu metode klasifikasi yang sederhana namun menghasilkan tingkat akurasi yang tinggi. Hasil penelitian dari data yang dikumpulkan pada 1-31 Januari 2023 dengan total sebanyak 4.198 ulasan, cenderung memiliki sentimen positif. Penelitian menggunakan metode Naïve Bayes Classifier dengan 3 rasio pembagian data training dan data testing (70%:30%, 80%:20%, 90%:10%) menghasilkan tingkat akurasi tertinggi yaitu 89,9% dengan pembagian 90% data training dan 10% data testing.\nAbstract\nGojek is an online transportation service that is widely used in Indonesia. It is important for companies to understand how people perceive the quality of the services and products they provide. However, it is difficult to monitor the number of people's opinions to be processed manually. The heading of this research is to classify reviews on the Gojek application and to analyze word associations from the classification results to find out topics that are widely discussed using data from the Google Play page. In this study, several steps of sentiment analysis were carried out, including collecting data, preprocessing, determining sentiment scores, labeling sentiment classes, and classifying data data using the Naïve Bayes Classifier method and carrying out text associations. The Naïve Bayes Classifier method is a simple classification method but produces a high level of accuracy. The research results from data collected on January 1-31 2023 with a total of 4,198 reviews tend to have positive sentiment. The research used the Naïve Bayes Classifier method with three ratios of spliting training and testing data (70%:30%, 80%:20%, 90%:10%) resulting in the highest level of accuracy, namely 89.9% with a 90% division of training data and 10% testing data. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.29313/statistika.v23i2.2353"
    },
    {
        "id": 9218,
        "title": "POI Route Recommendation Model Based on Symmetrical Naive Bayes Classification Spatial Accessibility and Improved Cockroach Swarm Optimization Algorithm",
        "authors": "Xiao Zhou, Zheng Zhang, Xinjian Liang, Mingzhan Su",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "The commonly used POI route recommendation methods usually ignore the effects of tourists’ interests and transportation geographical conditions, and so may not output the optimal results. To solve the problems, we propose a POI route recommendation model based on symmetrical Naive Bayes classification spatial accessibility (NBCSA) and an improved cockroach swarm optimization algorithm (ICSOA), aiming to recommend POI routes that satisfy tourists’ interests and have the lowest travel costs under tourism transportation geographical conditions. Using the historical POIs visited by tourists as the training set, we construct an improved symmetrical Naive Bayes classification algorithm (NBCA), and the POIs in the destination city are divided into categories by tourists’ preferences. Then we propose an improved NBCSA model to calculate the spatial accessibility field strength (SAFS) for each category’s POIs. Based on the recommended POIs, we propose the ICSOA to recommend optimal POI routes. The experiment verifies that the proposed algorithm can effectively classify the POIs and recommend POIs that best match the tourists’ interests and produce the lowest travel costs. Compared with the TCA and GDA method, the proposed algorithm can output the POI routes with lower travel costs and has higher algorithm execution efficiency. Among the output optimal routes, the proposed algorithm can reduce costs by 5.62% at the lowest and 52.25% at the highest.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sym16040424"
    },
    {
        "id": 9219,
        "title": "PREDIKSI PENDERITA DIABETES MENGGUNAKAN METODE NAIVE BAYES",
        "authors": "Citra Agustina Rahayu",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Prediksi adalah upaya memperkirakan sesuatu yang akan terjadi di masa depan dengan menggunakan berbagai informasi yang relevan pada waktu sebelumnya dengan menggunakan metode ilmiah. Data mining adalah kumpulan berbagai data atau informasi yang memiliki berbagai fungsi dan sangat bermanfaat di masa mendatang. Pemanfaatan data mining juga tidak hanya untuk teknologi saja melainkan bisa untuk Bidang Kesehatan salah satunya memprediksi penyakit diabetes dengan menggunakan metode Naive Bayes yaitu algoritma yang meminimalkan Kesehatan dari semua metode yang lain. Diabetes mellitus juga dikenal sebagai sekelompok masalah metabolism yang ditandai dengan tingginya kadar gula darah yang berkepanjangan. Diabetes dapat menyebabkan masalah kesehatan yang serius termasuk penyakit kardiovaskular. Penelitian ini bertujuan untuk memprediksi dan mengukur tingkat akurasi penyakit Diabetes. Pengumpulan data yang dilakukan di RSUD dr.soekardjo dengan menghasilkan 502 data pada rekam medis July 2019 – Desember 2022. Pengolahan Naive Bayes menghasilkan prediksi dengan 5 kali pengujian yaitu sebesar 57,38%, 70,27%, 78,26%, 85,71% dan 88,93%.  Akurasi tertinggi sebesar 95.92% artinya rule yang dihasilkan mendekati 100%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23960/jitet.v11i3.3055"
    },
    {
        "id": 9220,
        "title": "Research on Naive Bayes Integration Method based on Kmeans++ digital teaching clustering",
        "authors": "Tao Liu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00069"
    },
    {
        "id": 9221,
        "title": "Arc Circularitie Naive Bayes for Occupational Safety Helmet Detection",
        "authors": "Taufiq Rizaldi, Hermawan Arief Putranto",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Occupational Safety and Health (OHS) is an effort to guarantee and protect the safety and health of every worker through efforts to prevent work accidents and work-related diseases. Safety Helmet is one of the components that must exist and be used in accordance with Occupational Safety and Health standards. Detection of safety helmets usage is one of the efforts to support these activities. The application of Arc Circularity Naive Bayes is used to detect whether an object meets the ratio of a circle by utilizing RGB and HSV image filtering and classification using Naïve Bayes. That method is used to detect whether a worker uses a safety helmet or not, it also detects helm color. The average value of accuracy is 50.8, precision is 58.3%, recall is 66.0%, and f1-score is 59.5% which are calculated using the Confusion Matrix",
        "keywords": "",
        "link": "http://dx.doi.org/10.28989/compiler.v12i2.1760"
    },
    {
        "id": 9222,
        "title": "Classification of Orange Fruit Using Convolutional Neural Network, Support Vector Machine, K-Nearest Neighbor and Naive Bayes Methods Based on Color Analysis",
        "authors": "Widhi Ersa Pratiwi, Mhd Arief Hasan, Gusyella Mustika, Siti Sarah, Dwi Suci Ramadhani, Fadli Julizar,  Ferry",
        "published": "2023-2-16",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccosite57641.2023.10127775"
    },
    {
        "id": 9223,
        "title": "Naive Feature Selection: A Nearly Tight Convex Relaxation for Sparse Naive Bayes",
        "authors": "Armin Askari, Alexandre d’Aspremont, Laurent El Ghaoui",
        "published": "2024-2",
        "citations": 1,
        "abstract": " Because of its linear complexity, naive Bayes classification remains an attractive supervised learning method, especially in very large-scale settings. We propose a sparse version of naive Bayes, which can be used for feature selection. This leads to a combinatorial maximum-likelihood problem, for which we provide an exact solution in the case of binary data, or a bound in the multinomial case. We prove that our convex relaxation bounds become tight as the marginal contribution of additional features decreases using a priori duality gap bounds derived from the Shapley–Folkman theorem. We show how to produce primal solutions satisfying these bounds. Both binary and multinomial sparse models are solvable in time almost linear in problem size, representing a very small extra relative cost compared with the classical naive Bayes. Numerical experiments on text data show that the naive Bayes feature selection method is as statistically effective as state-of-the-art feature selection methods such as recursive feature elimination, l1-penalized logistic regression, and LASSO while being orders of magnitude faster (a python implementation can be found at https://github.com/aspremon/NaiveFeatureSelection ).  Funding: A. d’Aspremont acknowledges support from the Fonds AXA Pour la Recherche and Kamet Ventures [Machine Learning and Optimisation Joint Research Initiative] and a Google-focused award as well as funding from Agence Nationale de la Recherche [Grant ANR-19-P3IA-0001]. L. El Ghaoui acknowledges support from Berkeley Artificial Intelligence Research and the Tsinghua–Berkeley–Shenzhen Institute. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/moor.2023.1356"
    },
    {
        "id": 9224,
        "title": "The classification of emotion based on human voice by using Mel Frequency Cepstrum Coefficient (MFCC) and Naive Bayes method",
        "authors": " Safriadi,  Mahlil, Hari Toha Hidayat, Muhammad Nasir,  Anwar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0117958"
    },
    {
        "id": 9225,
        "title": "Particle swarm optimization comparison on decision tree and Naive Bayes for pandemic graduation classification",
        "authors": "Embun Fajar Wati, Anggi Puspita Sari, Enok Tuti Alawiah, Martua Hami Siregar, Biktra Rudianto",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0128448"
    },
    {
        "id": 9226,
        "title": "Opinion classification for IMDb review based using naive bayes method",
        "authors": "Chairul Rizal, Decky Antony Kifta, Rusli Halil Nasution, Aysyah Rengganis, Ronal Watrianthos",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0171628"
    },
    {
        "id": 9227,
        "title": "Sentiment Analysis of Twitter Comments Using Naive Bayes Classifier",
        "authors": "Ziyao Zhang",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Social media has a significant role in how people express their emotions and elaborate on their opinions in today's culture. There are many new forms of social media, and Twitter is one of them. In this experiment, the sentiment of pre-processed Twitter comment data was examined using naive Bayes and logistic regression techniques. In order to categorise the emotional tendency of text for Twitter comments, a naive Bayesian classifier is created. In processing this material, the Naive Bayes and logistic regression models' benefits and drawbacks are compared and summarised. Naive Bayes can achieve good accuracy with binary emotion analysis. The accuracy of the naive Bayes model is 0.06 points higher than that of logic training under identical processing settings, and the recall rate is 0.05 points higher.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-7064/10/20231338"
    },
    {
        "id": 9228,
        "title": "A Comprehensive Comparative Study of Machine Learning Methods for Chronic Kidney Disease Classification: Decision Tree, Support Vector Machine, and Naive Bayes",
        "authors": "Admi Syarif, Olivia Desti Riana, Dewi Asiah Shofiana, Akmal Junaidi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141063"
    },
    {
        "id": 9229,
        "title": "Sms Spam Classifier by Naive Bayes Classifier",
        "authors": "Pankaj Gupta, Ajay Sahu, Ashish Singh, Abhishek Awasthi, Rishu Singh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4386505"
    },
    {
        "id": 9230,
        "title": "Klasifikasi Performa Akademik Siswa Menggunakan Metode Decision Tree dan Naive Bayes",
        "authors": "Abdul Rahman",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "Getting good academic performance is the goal of the learning process carried out by the education office under the auspices of the Ministry of Education and supervised by the government. Governments that want to be successful in educating students should pay attention to their new generation because they are the future successors of the nation. Students of all levels are the benchmark for a country's success.  Therefore, it is necessary to know the student's academic performance from an early age, in order to get special treatment related to the student's learning achievement.  In this study, the academic achievement of students from various levels of education such as elementary, middle, and high schools was tried to be determined by applying various data mining classification methods such as Decision Tree and Naive Bayes. This data grouping is open where the data can be accessed easily and can be used in future research.  The data grouping is divided into 3 categories, namely Low (L), Medium (M) and High (H). From the results of the dataset trial, it shows that the highest classification accuracy is Decision Tree of 83.89% and Naive Bayes of 85.97%. Thus the Naïve Bayes method is more accurate in grouping students' academic performance data.   The results of this study will be used to create a student grouping system based on student learning performance using the appropriate algorithm. So that his contribution later when creating the application system for the formation of study groups can use the Naïve Bayes method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33020/saintekom.v13i1.349"
    },
    {
        "id": 9231,
        "title": "Feature Selection for Phishing Website by Using Naive Bayes Classifier",
        "authors": "Twana Mustafa, Murat Karabatak",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdfs58141.2023.10131884"
    },
    {
        "id": 9232,
        "title": "Rigorous non-disjoint discretization for naive Bayes",
        "authors": "Huan Zhang, Liangxiao Jiang, Geoffrey I. Webb",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109554"
    },
    {
        "id": 9233,
        "title": "Detection of fake news using Naive Bayes and Passive Aggressive Classifier",
        "authors": "",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets40659"
    },
    {
        "id": 9234,
        "title": "Implementation of text mining for classification of drug effectiveness using the naïve bayes algorithm",
        "authors": "Deny Haryadi, Dewi Marini Umi Atmaja, Arif Rahman Hakim",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0205662"
    },
    {
        "id": 9235,
        "title": "Logging lithofacies identification using Query by Committee strategy and Gaussian mixture Naive Bayes",
        "authors": "Q. Ren, H. Zhang, L. Azevedo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.2023101423"
    },
    {
        "id": 9236,
        "title": "Prevention of Aflatoxin in Peanut Using Naive Bayes Model",
        "authors": "R. Subha,  Suchithra",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idciot56793.2023.10053416"
    },
    {
        "id": 9237,
        "title": "Application of the Naive Bayes Classifier Method and Fuzzy Analytical Hierarchy Process in Determining Books Eligible for Publishing",
        "authors": "Mochamad Denny Irwansyah, Teguh Puja Negara, Erniyati Erniyati, Puspa Citra",
        "published": "2024-1-29",
        "citations": 1,
        "abstract": "The manuscript selection process is the process of assessing manuscripts worthy of publication. The Editor's job is to provide an evaluation of each manuscript based on the assessment criteria and sub-criteria. By using a decision support system, it can make it easier for policymakers to determine the suitability of a manuscript. In this research, a decision support system is applied to select papers that are worthy of publication, namely the Fuzzy Analytical Hierarchy Process (F-AHP) method for selecting the suitability of manuscripts using subjective criteria and the Naïve Bayes method for classifying books based on their genre. The test results using the F-AHP method produced an accuracy rate of 83.33% using 30 books out of 150 books and using the Naïve Bayes method produced an accuracy rate of 80% using 30 books from the internet. This system uses the Visual Studi Code IDE, Firebase, and Pythonanywhere as its database with an Android display.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33751/komputasi.v21i1.6677"
    },
    {
        "id": 9238,
        "title": "Penerapan Algoritma Naive Bayes Untuk Rekomendasi Genset",
        "authors": "Chandra Wijaya, Alyauma Hajjah",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "\r\nPada saat ini, teknologi merupakan penggerak penting bagi suatu negara. Perkembangan teknologi di bidang ekonomi ditandai dengan munculnya online shop. PT. Yanmarindo Perkasa merupakan perusahaan yang bergerak di bidang jual beli mesin, perkakas, sparepart dan lain- lain. Barang yang dijual sangat beragam menyebabkan bingungnya konsumen dalam memilih barang yang ingin dibeli karena barang dengan jenis yang sama memiliki tipe berbeda. Untuk mengatasi hal tersebut, dibutuhkan  suatu sistem rekomendasi untuk memberikan rekomendasi barang yang sesuai dengan kriteria dan kebutuhan konsumen. Sistem rekomendasi ini dibangun menggunakan algoritma Naïve Bayes sebagai salah satu bagian dari data mining. Algoritma Naïve Bayes adalah metode klasifikasi yang didasarkan pada probabilitas dan statistik. Sistem rekomendasi ini terbatas pada mesin genset dimana data training yang digunakan yaitu kombinasi dari data spesifikasi dan data penjualan genset. Algoritma Naïve Bayes digunakan untuk mencari probabilitas terbesar dari seluruh instance pada atribut target seperti merek, bahan bakar, kapasitas, tegangan dan penyalaan. Dari salah satu contoh data uji yang dimasukkan, terdapat satu genset yang tampil sebagai hasil rekomendasi dari perhitungan algoritma Naïve Bayes. Berdasarkan hal tersebut, terbukti bahwa algoritma Naïve Bayes dapat digunakan untuk memberikan rekomendasi genset sesuai dengan kebutuhan dan kriteria konsumen. Dengan penerapan algoritma ini pada sistem rekomendasi genset, diharapkan dapat memberikan hasil yang akurat dan mengurangi kebimbangan konsumen dalam mencari genset.\r\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.59697/jtik.v7i1.32"
    },
    {
        "id": 9239,
        "title": "Perbandingan Algoritma Naive Bayes dan Decision Tree(C4.5) dalam Klasifikasi Dosen Berprestasi",
        "authors": "Andy Supriyadi",
        "published": "2023-3-11",
        "citations": 1,
        "abstract": "Abstract – Enhancing the execution of Tri Dharma for lecturers is one of the factors in obtaining and sustaining the level of universities with good institution achievement. The Rectorate should exercise consideration while making a decision to reward lecturers who do very well. The information was gathered through speaking with members of the rectorate staff to classify lectures at Sebelas Maret University. In this study, accuracy results in the classification based on lecturers' accomplishments will be compared. International and national publications, education level, the length of doctoral studies, becoming an associate professor, and the length of certification as a lecturer are the features considered in the classification. To categorize lecturers according to their accomplishment, the algorithms Naive Bayes and Support Vector Machine were applied. 350 records of training data and 130 records of testing data total 500 records in this study. From 2018 to 2021, the study was carried out at Sebelas Maret University. The accuracy value obtained from 10-fold cross validation the testing using the Naive Bayes method is 94,80%, while the accuracy value obtained from the testing using the Decision Tree is 95,80%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29407/gj.v7i1.19797"
    },
    {
        "id": 9240,
        "title": "Komparasi Algoritma K-NN, Naive Bayes dan SVM untuk Prediksi Kelulusan Mahasiswa Tingkat Akhir",
        "authors": "Aulia Putri, Cindy Syaficha Hardiana, Elma Novfuja, Farida Try Puspa Siregar, Rahmaddeni Rahmaddeni, Yulia Fatma, Refni Wahyuni",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "Mahasiswa tingkat akhir adalah seorang pelajar yang sedang berjuang demi mendapat gelar sarjana dan memilih tujuan hidup dengan tugas yang baru seperti pekerjaan yang sesuai dengan minat dan bakatnya. Untuk mendapatkan tingkat kelulusan dengan baik dan tepat waktu. Mahasiswa sangat bergantung pada pengaruh dari faktor dalam dan luar kampus. Pemilihan dan penentuan data yang digunakan, diambil dari data publik. Dengan 379 orang mahasiswa tahap akhir sebagai responden. Pengujian ini membandingkan algoritma K-NN, NBC, dan SVM yang lebih baik menyelesaikan masalah terkait prediksi tingkat kelulusan mahasiswa pascasarjana. Berdasarkan perbandingan algoritma tersebut dengan teknik splitting data, didapatkan bahwa Algoritma K-NN (K-Nearest Neighbor) memiliki rata-rata lebih tinggi dibandingkan (NBC) Naïve Bayes Classifier dan SVM (Support Vector Machine) untuk prediksi kelulusan mahasiswa tingkat akhir dengan akurasi 87,8%, presisi 87,8%, dan recall 84%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v3i1.610"
    },
    {
        "id": 9241,
        "title": "Pembuatan Aplikasi Data Mining Untuk Memperediksi Masa Studi Mahasiswa Menggunakan Algoritma Naive Bayes",
        "authors": "Victor Tarigan",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "Data mining is a series of processes to obtain additional value information that is not known manually from a database. Data mining also manages experience or even mistakes in the past to improve the quality of the analysis model, one of which is the learning ability of data mining techniques, namely classification. Class is a learning task that is a new object into one of the class labels or categories on the old object that has been previously defined. This classification uses one method of data mining algorithm that is Naive Bayes.Naive Bayes algorithm works based on a certain distance between two objects by setting the value of k. The value of k is a parameter to determine the distance between the new object to the old object.By using the data mining technique, the university can obtain student academic data, namely the Achievement Index (IP) to predict the student's study period.In this data mining application consists of data testing and data training with NIM input.PHP and the database used is MySQL.The results of this data mining application this system can predict the results of the classification of student study period based on GPA 4 first semester, the average value of high school time, and grades in high school.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36987/informatika.v11i1.3847"
    },
    {
        "id": 9242,
        "title": "ANALISIS KEPUASAN KONSUMEN TERHADAP KUALITAS PRODUK MENGGUNAKAN ALGORITMA NAIVE BAYES",
        "authors": "Ahmad Suwandi, Rahmat Fauzi",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Current technological developments have brought changes to human lifestyles, such as lifestyle, selection of antic goods and communication equipment such as smartphones and other devices. Nowadays it is known that the collection of branded items is also a lifestyle trend such as bags, rings, clothes and other fashions. Batam as an industrial city encourages investors to invest in Batam, because Batam is the most strategic city and is an international trade route directly adjacent to Singapore. The problem that often occurs at PT Tas Import Sukses in serving consumers is that the goods sent are not on demand, so consumers suspect that the products traded do not have good quality. And if there is a problem, the company responds with a very slow time. The purpose of this study is to analyze consumer satisfaction with the quality of products at PT Tas Import Sukses using the Naïve Bayes method, to determine the level of consumer satisfaction with the quality of bag products. And the last is to find out the level of accuracy in determining product satisfaction and quality with the Naïve Bayes method. While the results of this study are that satisfaction is strongly influenced by the level of service, while the second order is product quality, where the average level of satisfaction accuracy using the naïve bayes algorithm is 91%, pression 89% and recall 88.33%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i7.7921"
    },
    {
        "id": 9243,
        "title": "KLASIFIKASI PENYAKIT PADI MELALUI CITRA DAUN MENGGUNAKAN METODE NAIVE BAYES",
        "authors": "Rahmi Rahmi Burhanuddin",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "Pertumbuhan ekonomi Indonesia yang tergantung pada sektor pertanian, khususnya produksi padi, menyoroti pentingnya mendeteksi dan mengidentifikasi penyakit pada tanaman padi. Penelitian ini mengusulkan metode Naïve Bayes untuk klasifikasi penyakit padi melalui analisis citra daun. Fokusnya adalah membandingkan akurasi dengan dan tanpa penerapan augmentasi data. Dengan menggunakan dataset \"Classification of Rice Diseases Using Leaf Images\" dari Kaggle, model Naïve Bayes mencapai akurasi 76.0%, dengan prediksi tingkat keyakinan 100.0% terhadap kategori \"blight\" pada contoh tertentu. Hasil ini menunjukkan potensi metode Naïve Bayes dalam prediksi penyakit padi secara efisien. Pengembangan selanjutnya dapat melibatkan peningkatan jumlah dataset dan eksplorasi teknik augmentasi data untuk meningkatkan akurasi. Penelitian ini memberikan kontribusi positif pada ketahanan pangan dan ekonomi Indonesia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23960/jitet.v12i2.4012"
    },
    {
        "id": 9244,
        "title": "Application of Naive Bayes Model, SVM and Deep Learning Predicting",
        "authors": "Padeli Padeli, Aris Martono, Sudaryono Sudaryono",
        "published": "2023-2-7",
        "citations": 0,
        "abstract": "The college hopes that every semester students are able to pay tuition properly and smoothly. The hope is that the institution will be able to  maintain  monthly  cash  flow so  that  its  operational  and maintenance costs can be met. Therefore, this study was conducted to predict and fulfill the institution's cash-in from the method of paying tuition fees either by cash, installments, or sometimes late payments every semester. In predicting the method of paying tuition fees, using student  profile data (name,  name,  study program)  and achievement index  every  semester  for  5  semesters  passed  and  the  method  of payment  (cash,  installments,  and  late--cash  or  installments).  Using the Naive Bayes (NB) method, Support Vector Machine (SVM), and Deep Learning, this study aims to forecast tuition costs. The Classification Prediction Model with Naive Bayes, SVM, and Deep Learning produces Confusion Matrix Performance NB with an Accuracy of 91.49%, Confusion Matrix Performance SVM with an Accuracy of 85.11%, and Confusion Matrix Performance Deep Learning with an Accuracy of 89.36%, according to the research findings.\r\nKeywords—Payments, Algorithm, Performance",
        "keywords": "",
        "link": "http://dx.doi.org/10.33050/cices.v9i1.2584"
    },
    {
        "id": 9245,
        "title": "Analysis And Comparison Of Prediction Of Heart Disease Using Novel Random Forest And Naive Bayes Algorithm",
        "authors": "G. Pavithraa, S. Sivaprasad",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim : Prediction of heart disease using Novel Random Forest and comparing its accuracy with Naive Bayes algorithm. Materials and methods: Two groups are proposed for predicting the accuracy (%) of heart disease. Namely, the Novel Random Forest and Naive Bayes algorithm. Here we take 20 samples each for evaluation and compared. The sample size was calculated using G power with pretest power at 80% and the alpha of 0.05 value. Result : The Novel Random Forest gives better accuracy (86.40%) compared to the Naive Bayes accuracy (80.08%). Therefore the statistical significance of Novel Random Forest is better than Naive Bayes algorithm. Conclusion: From the result, it can be concluded that Novel Random Forest helps in predicting heart disease with more accuracy compared to Naive Bayes algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.788793"
    },
    {
        "id": 9246,
        "title": "Estimation of Accuracy Rate in Predicting Cardiovascular Disease using Gaussian Naive Bayes Algorithm with Logistic Regression",
        "authors": "T. Vishnuvardhan, A. Rama",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: Comparison of accuracy rate in prediction of cardiovascular disease using Naive Bayes with Logistic Regression. Materials and Methods: The Naive Bayes (N=10) and Logistic Regression Algorithm (N=10) these two algorithms are calculated by using 2 Groups and taken 20 samples for both algorithm and accuracy in this work. The sample size is determined using the G power Calculator and it’s found to be 10. Results: Based on the Results Accuracy obtained in terms of accuracy is identified by Naive Bayes (87.02%) over the Logistic Regression algorithm (92.18%). Statistical significance difference between novel Naive Bayes algorithm and Logistic Regression Algorithm was found to be p=0.001 (2 tailed) (p<0.05). Conclusion: Prediction of cardiovascular disease using Logistic Regression is significantly better than the Naive Bayes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15321537"
    },
    {
        "id": 9247,
        "title": "Analisis Sentimen Menggunakan Metode Naive Bayes Terhadap Childfree",
        "authors": "Amellia Veronica Agustin, Fitria Nur Sa'adah, Yuyun Umaidah",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Childfree terjadi pada individu atau pasangan yang secara sukarela memilih untuk tidak memiliki anak. Fenomena Childfree semakin menarik perhatian masyarakat modern dan mempengaruhi keputusan hidup banyak individu. Data yang digunakan diperoleh dengan melakukan crawling data pada sosial media twitter. Dalam analisis sentimen kali ini menggunakan metode naïve bayes, data akan diflasifikasikan menjadi dua hasil, yaitu sentimen negatif dan positif. Setelah itu, data tersebut akan dinilai menggunakan pengujian dengan confusion matrix untuk mengukur akurasi, recall, dan precision. Hasil pengujian dengan Rapidminer menunjukan tingkat akurasi naive bayes yang tinggi sebesar 96%, untuk sentimen positif menghasilkan nilai precision 84,13%, dan nilai recall 100%. Sedangkan untuk sentimen negatif menunjukkan nilai precision 94,92%, dan recall 100%. Hasil klasifikasi tersebut menghasilkan 254 tweet negatif, dan 74 tweet positif. Analisis sentimen menggunakan metode Naïve Bayes dapat memberikan wawasan yang berharga tentang pandangan dan sentimen masyarakat terhadap Childfree. Hasil penelitian ini penting untuk memahami dan menghargai keragaman pandangan terkait topik ini. Implikasi penelitian ini dapat digunakan untuk pengambilan keputusan yang lebih baik dalam konteks sosial, budaya, dan kebijakan yang berkaitan dengan keputusan Childfree.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35315/dinamik.v29i1.9455"
    },
    {
        "id": 9248,
        "title": "Retracted: Naive Bayes Algorithm Mining Mobile Phone Trojan Crime Clues",
        "authors": "",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9793406"
    },
    {
        "id": 9249,
        "title": "Detecting Background Dynamic Scenes using Naive Bayes Classifier Analysis Compared to CNN Analysis",
        "authors": "Asha Rani Borah",
        "published": "2023-9-20",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276062"
    },
    {
        "id": 9250,
        "title": "PENDETEKSIAN KALIMAT SINDIRAN MENGGUNAKAN ALGORITMA NAIVE BAYES",
        "authors": "Muhammad Fikry, Safwandi Safwandi",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Dalam kehidupan masyarakat modern ini tidak terlepas dari dari media sosial, dimana penggunaan media sosial yang tidak bijak bisa mengakibatkan hal yang fatal. Dimasa sekarang ini banyak terjadi kasus pem-bully-an maupun kasus dimana masyarakat saling sindir menyindir sehingga terjadi saling permusuhan antar masyarakat. Pada penelitian kali ini penulis akan membuat sebuah sistem untuk mendeteksi kalimat-kalimat sindiran yang sering terjadi dalam kehidupan sehari-hari masyarakat indonesia. Penulis menggunakan metode Naive Bayes, Metode ini juga sangat sering digunakan oleh peneliti-peneliti lain karena tingkat akurasinya yang tinggi.Kata Kunci—Pendeteksian kalimat, Kalimat sindiran, Deteksi sindiran, Naive Bayes, Metode Naive Bayes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29103/tts.v4i3.14744"
    },
    {
        "id": 9251,
        "title": "Classification Interest Customer XL Internet Card Using Naive Bayes Algorithm At PT XML Tronik",
        "authors": " Dede Yusuf,  Zulfikar Yusya Mubarak,  Nuni Wulansari,  Annisa Rahayu P,  Fajar Nur Wibowo,  Opi Irawansah,  Asharryadi Noegroho,  Atika Mahmudah,  Nurul Alfiah",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "In the world of trade, competition within a company has become commonplace and makes business people always think about breakthroughs that can ensure the continuity of their business . Basically companies have valuable assets but are rarely used as a reference, these assets are in the form of databases with large numbers. PT.XML Tronik is a company that has been in the technology sector for a long time, one of which is selling GSM Card Providers in Indonesia. The classification method used is the Naïve Bayes Algorithm, where Naïve Bayes is used to classify statistical and probability methods . Method This research uses several stages starting from data collection , analysis sales , data processing using naïve Bayes method and proceed with measurements level accuracy use WEKA application . From the results of data mining using the Naïve Bayes Algorithm, this researcher found patterns of interest in buying XL Card customers at PT.XML Tronik . Based on the results of the analysis carried out, using 20% of the test data with negative and positive labels. So that it can produce a sign ending with an accuracy level of 84.6667% with a precision of 97% and a recall of 83%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24090/ieibzawa.v1i.700"
    },
    {
        "id": 9252,
        "title": "Analisis Sentimen Ulasan Aplikasi Capcut Menggunakan Metode Naive Bayes",
        "authors": "VF Anindya W, Andri Wijaya -",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "Penelitian ini mengeksplorasi sentimen pengguna terhadap aplikasi pengeditan video, CapCut, menggunakan metode Naïve Bayes. Studi ini didasarkan pada pertumbuhan pesat industri pengeditan video mobile dan urgensi memahami respon pengguna. Data yang dianalisis berasal dari berbagai sumber online, diolah dengan metode Naïve Bayes untuk mengklasifikasikan sentimen menjadi positif, negatif, dan netral. Proses penelitian melibatkan pra-pemrosesan data, ekstraksi fitur, serta pelatihan model. Hasilnya menunjukkan efektivitas metode Naïve Bayes dalam mengidentifikasi sentimen dengan tingkat akurasi yang signifikan. Klasifikasi sentimen ini memberikan pandangan berharga bagi pengembang CapCut untuk meningkatkan kualitas aplikasi. Implikasi penelitian ini tidak hanya berdampak pada pengembangan CapCut, tetapi juga pada pengembangan metode analisis sentimen dalam konteks pengeditan video mobile. Hasil penelitian ini penting dalam memberikan wawasan mendalam terhadap preferensi pengguna, mendukung pengembangan aplikasi, serta meningkatkan pengalaman pengguna secara keseluruhan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31602/jssi.v2i1.13372"
    },
    {
        "id": 9253,
        "title": "Gradient Boosting and Naive Bayes Crop Yield Prediction and Fertilizer Recommendation",
        "authors": "Surya R, Sukanya S. T",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "Farmers use Big Data to get information on changing Weather, Rainfall, Fertilizer Usage, Rainfall, and other factors that impact the crop yield. The yield of a crop is mainly determined by the climatic conditions like Temperature, Rainfall, Soil Conditions, and Fertilizers. All of this information assists farmers in making accurate and dependable decisions that maximize their productivity from cultivating the land. Recently, the Machine Learning Algorithms are used by the researchers to predict the yield of a crop before its actual cultivation. Firstly, Pre-process the data in a Python environment and then apply the Map Reduce Framework, which further analyses and processes the large volume of data. Secondly, K-means Clustering is employed on results gained from Map Reduce and provides a mean result on the data in terms of accuracy. Using Gradient Boosting Algorithm to predict the yield of crops based on the parameters like State, District, Area, Seasons, Rainfall, Temperature, and Area. To enhance the yield, this work study also suggests a fertilizer based on the soil conditions like NPK Values, Soil Type, Soil PH, Humidity, and Moisture. Fertilizer Recommendation is primarily done by using the Naive Bayes [NB] Algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59544/puyi9607/ngcesi23p11"
    },
    {
        "id": 9254,
        "title": "Empirical Copula based Naive Bayes Classifier",
        "authors": "Tanishi Srivastava, Dristi De, Prerna Sharma, Debarka Sengupta",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10083573"
    },
    {
        "id": 9255,
        "title": "Klasifikasi Gender Berdasarkan Fingerprint Menggunakan Metode Naive Bayes Classifier",
        "authors": "Cindhy Herumawan, Efi Anisa",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No two fingerprints are identical, as everyone has their own characteristics. The most fundamental problem lies in the results of the fingerprint image, typically due to inconsistencies in the emphasis of the fingerprint and the position of the fingerprint, resulting in inconsistencies in the thickness of the black line and shifting positions, which negatively impact the overall performance of the system. To solve this issue, research is required on a classifier that assumes all attributes exist independently. The NBC (Naïve Bayes Classifier) is a classifier based on the assumption that all attributes are independent. The NBC method for gender classification based on fingerprints consists of three steps. The initial step is to evaluate the quality of the image to be processed. This is demonstrated by the consistency of the grayscale values, which are not skewed when converted to a binary image. The second is the selection of data that exhibits no data deviation, which also leads to errors in the classification procedure that follows. With the existence of machine learning, class-based measurement formulations can be acquired through training. Even with unbalanced data, it is preferable to use NBC for classification purposes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35814/asiimetrik.v5i1.3801"
    },
    {
        "id": 9256,
        "title": "MENENTUKAN KELAYAKAN PENERIMA KIP MENGGUNAKAN KLASIFIKASI DENGAN METODE ALGORITMA NAIVE BAYES",
        "authors": "Afdul Hadi, Irfan Ali",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "Pemerintah berupaya meningkatkan pendidikan dengan menerbitkan Program Indonesia Pintar (PIP) yang dukungannya berupa Kartu Indonesia Pintar (KIP). KIP memberikan dana berupa hibah pendidikan kepada anak usia 6-21 tahun. Sejak akhir tahun 2014, program KIP menjadi bagian dari Program Bantuan Siswa Miskin (BSM). Ketidaktepatan target dalam penyaluran KIP di SMAN 1 Lemahabang mengakibatkan target tidak merata dan tidak sesuai harapan. Begitu banyak siswa tanpa dukungan ini harus memilih pendidikan, memilih bekerja, dan memotong biaya. keluarga. Tujuan dari penelitian ini adalah menggunakan algoritma Naive Bayes untuk menyasar dan melakukan klasifikasi yang sesuai dengan harapan SMAN 1 Lemahabang sehingga sekolah dapat dengan mudah menentukan kelayakan calon penerima KIP-nya. Untuk itu Metode yang digunakan penulis adalah Algoritma Naive Bayes, yang dapat mengklasifikasikan calon penerima KIP dengan sangat akurat dan akurat. Ada beberapa hasil yang diperoleh Naive Bayes. Yaitu hasil presisi 60,63%, hasil presisi 92,62%, hasil recall 57,50%, dan hasil AUC 0,730. Menurut derajat diagnosis saat ini, nilai AUC-nya sebesar 0,730 termasuk dalam klasifikasi wajar. Artinya algoritma naive bayes untuk pemilihan metode sudah cukup.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i1.6311"
    },
    {
        "id": 9257,
        "title": "Analisis Sentimen Opini Publik Terhadap Chatgpt di Twitter Menggunakan Metode Naive Bayes",
        "authors": "Donny Panca Donny",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "The presence of ChatGPT, which is based on Artificial Intelligence (AI), has attracted public attention and become a polemic. This application is very helpful for users in finding information, translating languages, and generating text similar to human speech. OpenAI's decision to launch the ChatGPT Plus service is related to its monetization strategy and maintaining user interest. In this regard, a study was conducted using the Naïve Bayes method to classify the sentiment of the Twitter community towards ChatGPT in the period 30/11/2022 to 31/12/2022. This study took 5001 tweet data from the available dataset, and used TF-IDF feature extraction and BOW feature extraction, with data division into 70% training data and 30% test data. This research gets the highest accuracy value of 59% using BOW feature extraction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47747/jurnalnik.v4i4.1417"
    },
    {
        "id": 9258,
        "title": "Fake News Detection using Naive Bayes Classifier and Passive Aggressive Classifier",
        "authors": "Valdet Shabani, Abdullah Havolli, Arianit Maraj, Lorik Fetahu",
        "published": "2023-6-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/meco58584.2023.10155036"
    },
    {
        "id": 9259,
        "title": "PEMILIHAN  KUALITAS PRODUK KELAPA SAWIT MENGGUNAKAN METODE NAIVE BAYES DI LABUHANBATU SELATAN",
        "authors": "Dinda Nurhasanah, Dinda Ayu Lestari, Syamsiah Simatupang",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "Indonesia is one of the highest palm oil producers in the world. Palm oil is one of the well-known natural resources in the world today because it has high economic value, such as being able to produce palm oil, fuel and others. In Indonesia, one of the largest palm oil producers is the province of Riau, according to the Central Statistics Agency (BPS) noted that Riau will be the largest palm oil producing region in Indonesia in 2021 with as many as 8,629 thousand tons. The quality of CPO is one of the main factors for customers to make purchasing decisions, especially the standards contained in the Indonesian National Standard (SNI) 01-2901-2006. The final quality of this palm oil product is determined by the combined results of CPO quality and kernel quality. Good quality raw materials will affect the selling price of raw materials for a good quality final product. Selection of the quality of palm oil products still uses old methods such as laboratory testing to check water content, free fatty acid levels, and others in the manufacture of CPO, which takes several days to get the results. The purpose of this study is to classify the quality of palm oil products with a method. Having an application/web can help the laboratory produce good CPO. The method used in this study is the Naive Bayes method to obtain data quickly and accurately. The accuracy of the Naive Bayes method in determining the quality of palm oil products is 82.05%.Keywords: qualification, quality, palm oil, naïve bayes Indonesia merupakan salah satu penghasil minyak kelapa sawit tertinggi di dunia. Kelapa sawit adalah salah satu sumber daya alam yang terkenal saat ini didunia karena memiliki nilai ekonomis yang tinggi seperti dapat menghasilkan minyak sawit, bahan bakar dan lainnya. Di indonesia salah satu penghasil kelapa sawit terbesar adalah provinsi Riau, menurut Badan Pusat Statistik (BPS) mencatat Riau menjadi daerah penghasil kelapa sawit terbesar Di Indonesia pada tahun 2021 sebanyak 8.629 ribu ton. Kualitas CPO adalah salah satu faktor utama bagi pelanggan untuk membuat keputusan pembelian khususnya standar yang terdapat pada Standar Nasional Indonesia (SNI) 01-2901-2006. Kualitas akhir dari produk kelapa sawit ini ditentukan dari gabungan hasil kualitas CPO dan kualitas kernel. Bahan mentah yang berkualitas baik akan mempengaruhi harga jual bahan mentah untuk kualitas akhir produk yang baik. Pemilihan kualitas produk kelapa sawitnya masih memakai cara yang lama seperti pengujian laboratorium untuk pengecekan kadar air, kadar asam lemak bebas, dan lainnya dalam pembuatan CPO, yang membutuhkan beberapa hari untuk mendapatkan hasilnya. Tujuan dari penelitian ini adalah  mengklasifikasikan kualitas produk kelapa sawit dengan sebuah metode. Dengan adanya aplikasi/web dapat membantu pihak laboratorium dalam menghasilkan CPO yang baik. Metode yang digunakan dalam penelitian ini adalah metode Naive Bayes untuk memperoleh data dengan cepat dan akurat.Tingkat akurasi metode Naive Bayes dalam menentukan kualitas produk kelapa sawit adalah sebesar 82,05%.Kata Kunci: klasifikasi, kualitas, kelapa sawit, naïve bayes",
        "keywords": "",
        "link": "http://dx.doi.org/10.54314/teknisi.v3i1.1254"
    },
    {
        "id": 9260,
        "title": "Komparasi Metode KNN dan Naive Bayes Terhadap Analisis Sentimen Pengguna Aplikasi Shopee",
        "authors": "Salman Alfaris,  Kusnawi",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Penelitian ini membandingkan keakuratan dan efektivitas KNN dan Naïve Bayes dalam menganalisis sentimen ulasan aplikasi Shopee di Google Playstore. Dalam penelitian ini, penulis mengumpulkan 2000 data terbaru dari ulasan aplikasi Shopee di Google Playstore dengan teknik web scraping. Data tersebut kemudian dibersihkan dan diberi label, menghasilkan 707 ulasan positif dan 1293 ulasan negatif. Proses preprocessing dilakukan, termasuk case folding, tokenisasi, filtering, dan stemming. Setelah tahap pengolahan data, penulis menerapkan algoritma K-Nearest Neighbor (KNN) dengan tingkat akurasi 70%. Data uji terdiri dari 400 data (20% dari total data), dengan 268 ulasan negatif dan 132 ulasan positif. Sementara itu, metode Naïve Bayes Classifier mencapai tingkat akurasi 71%. Data uji yang digunakan sama dengan KNN. Hasil penelitian menunjukkan bahwa Naïve Bayes Classifier memiliki tingkat akurasi yang lebih tinggi dibandingkan KNN. Penelitian ini diharapkan memberikan pemahaman tentang penggunaan KNN dan Naïve Bayes dalam menganalisis sentimen pengguna aplikasi Shopee di Google Playstore.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i5.3304"
    },
    {
        "id": 9261,
        "title": "Malware Analysis Using RNN and Naive Bayes Algorithm",
        "authors": "M. SureshKumar, Theerej C, Arathi P, P. Shanmugapriya",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccebs58601.2023.10448891"
    },
    {
        "id": 9262,
        "title": "Incorporating BERT with Naive Bayes into Neutral Sentiment Analysis",
        "authors": "Zesheng Shi, Tianhao Cao, Xiangyue Zhang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsca59871.2023.10392592"
    },
    {
        "id": 9263,
        "title": "Penerapan Data Mining Menggunakan Metode Algoritma Naive Bayes Classifier untuk Mendukung Strategi Promosi",
        "authors": "Aulia Yahyah Sari, Encep Supriatna",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "The purpose of this study is to make it easier to find out the prediction results with the classification method from PPDB data for 2021-2022 to support promotion strategies at the Skye Foundation with the Naive Bayes Classifier Algorithm and to find out the level of accuracy in classification in determining promotion strategies. In this study the authors used 210 data as training data and 53 data as testing data for manual testing in excel and for testing using RapidMiner tools. Based on the results of the analysis in the research conducted, the results of predicting registration and non-registration quickly and accurately from tests carried out by comparing training data with data testing using RapidMiner tools obtained an accuracy rate of 92.45%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32627/dimamu.v3i1.837"
    },
    {
        "id": 9264,
        "title": "NAIVE BAYES DAN WORDCLOUD UNTUK ANALISIS SENTIMEN WISATA HALAL PULAU LOMBOK",
        "authors": " Irvandi, Bambang Irawan, Odi Nurdiawan",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "Lombok merupakan salah satu destinasi wisata halal di Indonesia dan sudah diakui dunia. Untuk membuktikan asumsi tersebut berdasarkan sumber dari opini wisatawan, maka perlu dilakukan analisis sentimen apakah keberadaannya sesuai dengan yang diharapkan. Google Maps merupakan salah satu platform yang dapat menunjukkan lokasi pulau Lombok beserta ulasan tertulis dari wisatawan yang pernah berkunjung. Pengumpulan data ulasan dilakukan melalui teknik Web Scraping pada Google Maps Review, kemudian data diolah menggunakan RapidMiner dengan algoritma Naive Bayes. Visualisasi Wordcloud juga ditampilkan untuk memunculkan kata-kata yang sering diutarakan wisatawan. Text preprocessing yang dilakukan meliputi tokenize, filter token by length, transform case, stopword, dan stemming. Dari hasil pengujian model algoritma Naive Bayes didapatkan tingkat akurasi sebesar 74,75%. Visualisasi Wordcloud juga menemukan kata terbanyak teratas antara lain \"indah\", \"wisata\". “pantai”, “alam”, “gunung”, dan “masjid”.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31949/infotech.v9i1.5322"
    },
    {
        "id": 9265,
        "title": "SISTEM PENDUKUNG KEPUTUSAN PENERIMAAN BEASISWA MENGGUNAKAN METODE MULTINOMIAL NAIVE BAYES",
        "authors": "Agus Setia Budi, Arda Gusema Susilowati",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "Pentingnya menimba ilmu untuk masadepan yang lebih baik, apalagi jika siswa memiliki prestasi, namun harus berhenti di tengah jalandikarenakan tidak memiliki biaya. Universitas Islam Lamongan memberikan beasiswa kepadasiswa yang berprestasi dan tidak mampu. Pemberian beasiswa berdasarkan kriteria yangsudah ditetapkan kemudian dilakukan perankinganmenggunakan excel. Berdasarkan masalah tersebut, akan dibuat sistem pendukung keputusanpenerimaan beasiswa menggunakan metodeMultinomial Naive Bayesdan mengukur tingkat akurasi dari sistem yang telah dibuat. Tujuan dari penelitian ini adalah membuat sistem pendukungkeputusan penerimaan beasiswa menggunakanmetodeMultinomialNaive Bayes. Sistem pendukungkeputusan merupakan penyelesaian dari suatu masalah yang ada. Penelitian ini menggunakan metode Multinomial Naive Bayesyang merupakan metode terbaik dari kalangan klasifikasi. Data yang digunakan dalam perhitungan adalah data kriteria siswa dari tahun sebelumnya yang diperoleh dari rumah beasiswa Universitas Islam Lamongan. Perhitungan MultinomialNaive Bayesdilakukan dengan mencari probabilitas setiap kategori kemudian dicari nilai yang tertinggi. Nilai tertinggimerupakan hasil dari perhitungan. Berdasarkan perhitungan yang telah dilakukan sistem pendukung keputusan penerimaan beasiswa menggunakan metode MultinomialNaive Bayesmemiliki tingkat akurasi sebesar 92,73%. Tingkat akurasi tersebut menunjukkan bahwa sistem pendukung keputusan penerimaan beasiswa menggunakan metode Multinomial Naive Bayessangat layak digunakan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24929/jars.v1i01.2447"
    },
    {
        "id": 9266,
        "title": "Heart Plaque Detection with Improved Accuracy using Naive Bayes and comparing with Least Squares Support Vector Machine",
        "authors": "V.S. Kumar, K. Vidhya",
        "published": "2023-2-14",
        "citations": 1,
        "abstract": "Aim: The main aim of this research is to detect heart plaque using the Naive Bayes algorithm with improved accuracy and comparing it with Least Squares Support Vector Machine. Materials and Methods: Naive Bayes algorithm and Least squares Support Vector Machine algorithms are two groups compared in this study. In the Kaggle dataset on Heart Plaque Disease, there were a total of 20 samples. Clincalc is used to calculate sample G power of 0.08 with 95% confidence interval. The training dataset (n = 489 (70 %)) and the test dataset (n = 277 (30 %)) are divided into two groups. Result: The accuracy of the Naive Bayes algorithm and the Least Squares Support Vector Machine algorithm is assessed. The Naive Bayes method was 78% accurate, whereas the Least Squares Support Vector Machine method was only 67.3% correct.Conclusion: In this work, the Naive Bayes algorithm outperformed the Least Squares Support Vector Machine algorithm in detecting heart plaque disease in the dataset under consideration. Keywords Heart Plaque disease, Novel intensity feature, Naive Bayes algorithm, Least Squares Support Vector Machine, Prediction, Machine learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.15951599"
    },
    {
        "id": 9267,
        "title": "Aplikasi Monitoring Detak Jantung Menggunakan Sensor Max30102 dan Algoritma Gaussian Naive Bayes",
        "authors": " Beni Mustiko Aji,  Wahyu Sri Utami",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Kesehatan jantung penting karena faktor utama penyebab kematian di Indonesia, terutama di kalangan lansia. Namun lansia tidak rutin dipantau karena Pos Kesehatan Terpadu (Posyandu) Ngudi Makmur tidak memiliki akses pemeriksaan detak jantung. Penulis menyarankan solusi untuk masalah ini, yaitu aplikasi monitoring detak jantung dengan sensor max30102 untuk memonitoring detak jantung menggunakan algoritma gaussian naive bayes yang diharapkan mampu membantu pemeriksaan detak jantung pada lansia di Posyandu Ngudi Makmur. Aplikasi ini memungkinkan pemantauan detak jantung secara terus menerus. Guna menjamin kelancaran proses pengembangan, teknik pengujian black box digunakan untuk pengujian fungsional aplikasi. Secara fungsionalitas, aplikasi ini telah sesuai dengan yang diharapkan oleh penulis. Selain itu, penulis mengembangkan perangkat untuk mengukur detak jantung menggunakan sensor max30102. Akurasi sebesar 95,8% ditemukan pada hasil kalibrasi perangkat yang digunakan, sedangkan pengujian algoritma gaussian naive bayes menggunakan metode k-fold cross validation menunjukkan akurasi sebesar 91%. Diharapkan para lansia di Posyandu Ngudi Makmur dapat lebih rutin memeriksa kesehatan jantung mereka.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32520/jupel.v5i3.2803"
    },
    {
        "id": 9268,
        "title": "Pelayanan di BBPJN Sumut dengan Metode Naive Bayes",
        "authors": "Reni Lestari, Syahira Elfiandani Nasution",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "SIPINTER (Sistem Pelayanan Informasi Publik Terintegretasi) adalah aplikasi pelayanan terpadu secara online BBPJN Sumatra Utara merupakan inovasi layanan publik Balai Besar Pelaksanaan Jalan Nasional Sumatra Utara meliputi; Layanan Perizinan, Layanan Sewa Peralatan BMN, Layanan Lab. Pengujian Bahan Kontruksi dan Layanan Pelaksanaan Komunikasi Publik (PIP dan Dumas). Aplikasi  SIPINTER adalah upaya pemerintah Sumatra Utara memudahkan masyarakatnya melakukan proses perizinan, dispensasi dan rekomendasi pemanfaatan bagian-bagian jalan di BBPJN Sumatra Utara tanpa perlu datang langsung untuk mengajukan permohonan jutru mengaksesnya secara online melalui PC atau komputer dan smartphone.  Tujuan penelitian ini adalah untuk mengetahui bagaimana perancangan aplikasi SIPINTER dapat meningkatkan pelayanan BPPJN di wilayah sumatra Utara. Dalam penelitian ini menggunakan metode penelitian Kualitatif dengan pendekatan deksripsi analisis. Dalam penggunaan aplikasi SIPINTER menunjukkan keterbatasan dalam menguasai teknologi sehingga masyarakat pun harus menyelesaikan permasalahan tersebut melalui online. Dalam rangka mendorong terciptanya akuntabilitas kinerja instansi pemerintah sebagai salah satu prasyarat untuk terciptanya pemerintah yang baik dan terpercaya, diperlukan penyelenggaraan Sistem Akuntabilitas Kinerja Instansi Pemerintah (SAKIP) yang mengintegrasikan dari sistem perencanaan, pemrograman, penganggaran, serta pelaksanaan program dan kegiatan yang kemudian dituangkan dalam laporan kinerja instansi pemerintah. Sehingga pada pengaplikasian aplikasi SIPINTER BPPJN pada masyarakat Sumatra Utara perlu ditingkatkan.\r\nKata kunci: Aplikasi SIPINTER, Online, BBPJN",
        "keywords": "",
        "link": "http://dx.doi.org/10.55537/cosie.v2i1.575"
    },
    {
        "id": 9269,
        "title": "Analisis Segmen Pelanggan Dalam Merespon Produk Menggunakan Metode KNN, Naive Bayes, Decision Tree, Ensemble, Linear Regression",
        "authors": "Eri Mardiani",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "-",
        "keywords": "",
        "link": "http://dx.doi.org/10.47313/jig.v26i2.2942"
    },
    {
        "id": 9270,
        "title": "Klasifikasi UMKM Menggunakan Algoritma Naive Bayes Berdasarkan Sudah Pernah Mempunyai Atau Mengurus Sertifikat Halal",
        "authors": "Guritna Wijaya",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Peran UMKM sangat besar untuk pertumbuhan perekonomian Indonesia. Pada tahun 2021 tercatat ada 288 data UMKM yang sudah atau belum memiliki setifikasi halal dari ruang halal. namun pada perkembangnya UMKM ini sangat minim kesadaran sekali dalam Sertifikasi Halalkan usahanya, karena seiring perkembangan ekonomi di dunia, para konsumen dunia terlebih di Indonesia ini di dominasikan oleh Penduduk muslim. Tujuan penelitian ini adalah untuk mengetahui berapa nilai akurasi yang diperoleh dari data ikm-halal-2022 Mitra RuangHalal Pulau Jawa 7 Des 2022. Metode penelitian dalam penelitian ini menggunakan metode Knowledge Discovery in Databases (KDD) dengan penerapan model klasifikasi metode naive bayes dengan tahapan pertama Menginput Data Latih pada RapidMiner, Melakukan proses data di Pilih & bersihkan, lakukan transformasi data, proses penambangan data, dan terakhir evaluasi. Hasil yang didapat menunjukkan nilai akurasi sebesar 92,41% dengan prediksi Belum dan ternyata Ya Belum sebanyak 2128, prediksi Belum dan tenyata Ya Sudah sebanyak 0, prediksi Sudah dan ternyata Ya Belum sebanyak 22, prediksi Sudah dan ternyata Ya Sudah sebanyak 212.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33365/jdmsi.v4i1.2634"
    },
    {
        "id": 9271,
        "title": "SISTEM PAKAR DIAGNOSA KERUSAKAN KENDARAAN BERMOTOR JENIS MATIC MENGGUNAKAN METODE NAIVE BAYES",
        "authors": "Yohan Kristianto Mudinah",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Sepeda motor matic ialah salah satu tipe sepeda motor yang memanfaatkan transmisi otomatis untuk mengubah gigi dan mengatur percepatan, berbeda dengan sepeda motor manual yang memerlukan pergantian gigi manual oleh pengendara. Kemudahan penggunaan dan kenyamanan dalam berkendara yang membuat sepeda motor matic menjadi sebuah pilihan utama banyak orang. Disisi lain sepeda motor matic dinilai lebih irit bahan bakar dan ramah lingkungan. Sepeda motor matic membutuhkan perawatan secara berkala agar dapat berfungsi secara baik. Kerusakan sepeda motor matic dapat terjadi karena kecerobohan pengguna dalam melakukan perawatan. Hal ini akibat dari kurangnya pengetahuan terhadap kerusakan sepeda motor matic dan tidak semua pemilik motor matic mempunyai kemampuan untuk melakukan perbaikan terhadap kerusakan sepeda motornya. Maka dikembangkan sebuah sistem pakar yang merupakan ilmu komputer berdasarkan pengetahuan dari pakar-pakar. Sistem pakar ini dibuat dengan menggunakan naive bayes sebagai metode untuk mengatasi ketidakpastian diagnosis yang mana naive bayes digunakan untuk memperhitungkan probabilitas dengan adanya tambahan nilai bobot yang diberikan oleh pakar.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59697/jik.v8i1.473"
    },
    {
        "id": 9272,
        "title": "PENDEKATAN DATA MINING UNTUK MEMILIH PRODUK TERLARIS MENGGUNAKAN ALGORITMA NAIVE BAYES",
        "authors": "Hidup Perjuangan Rajagukguk, Rahmat Fauzi",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Technological advances today can be exploited to process data into more useful information. In data collection, information collection is especially useful to maximize profits and develop marketing strategies. One way to increase profits is by using data mining techniques to help business actors in making decisions about stocks, increased profits and more. The Matahari Department Store is the largest retail platform in Indonesia, one of the retail stores located in Batam is the Matahari Department store Nagoya Hill Batam. The transaction data on the store that is still processed does not use a method that causes the processing of product sales data to be less effective and less efficient. Seeing from the number of transactions, a system is needed to predict the sale of the best-selling product as long as it can determine the correct stock for the products sold and can increase the profit, sale and purchase of the product. This research was conducted with the aim of applying data mining methods using the Naive Bayes Classifier algorithm to select the best-selling products in the outlet of the Matahari Nagoya Hill Batam Department Store. By using the collected sales data, the system is expected to increase profits steadily and avoid shortages of product stocks. Through analysis using the Naive Bayes Classifier method, the study achieved an accuracy of 67% and obtained a bag sales result to be the best-selling sale during January 2023 through March 2023 with a sales percentage of 20%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i7.7892"
    },
    {
        "id": 9273,
        "title": "Analisis Sentimen Pengunaaan Aplikasi Kinemaster Menggunakan Metode Naive Bayes",
        "authors": "Kevin Kevin, Margareta Enjeli, Andri Wijaya",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk menganalisis sentimen terkait penggunaan aplikasi Kinemaster dengan menggunakan metode Naive Bayes. Fokus utama adalah memahami sentimen pengguna yang terungkap dari ulasan dan umpan balik terkait Kinemaster, sebuah aplikasi penyunting video yang populer. Tujuan utama adalah menerapkan teknik machine learning, khususnya klasifikasi Naive Bayes, untuk mengidentifikasi dan mengelompokkan sentimen yang terungkap dalam ulasan pengguna. Metodologi penelitian ini melibatkan pengumpulan dataset yang signifikan berupa ulasan dan umpan balik yang dihasilkan oleh pengguna terkait aplikasi Kinemaster dari berbagai platform online. Untuk mempersiapkan dataset untuk analisis, teknik preprocessing diterapkan guna membersihkan dan mempersiapkan data. Selain itu, algoritma Naive Bayes digunakan untuk mengklasifikasikan sentimen yang terungkap dalam ulasan Google Play Store sebagai positif, negatif, atau netral. Ulasan di Google Play Store terus bertambah dari hari ke hari. Oleh karena itu, perlu dilakukan analisis terhadap ulasan-ulasan tersebut melalui analisis sentimen terhadap ulasan-ulasan KineMaster. Langkah pertama dalam analisis sentimen adalah observasi, preprocessing, yaitu proses tokenisasi, stopword removal, dan stemming. Data dibagi menjadi dua bagian, yaitu data latih dan data uji, dengan perbandingan 80:20. Algoritma yang digunakan adalah Naive Bayes classifier yang memiliki akurasi 85%, presisi 82%, recall 74% dan f1 score 78%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58602/jics.v2i2.24"
    },
    {
        "id": 9274,
        "title": "Analisis Prediksi Resiko Diabetes Tahap Awal Menggunakan Algoritma Naive Bayes",
        "authors": "Muhtajuddin Danny, Asep Muhidin",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Diabetes merupakan salah satu penyakit kronis yang diakibatkan adanya kelainan sekresi insulin pada kenaikan glukosa secara tidak teratur. Resiko penyakit stroke, penyakit jantung, kebutaan bahkan hingga resiko kematian merupakan penyakit komplikasi yang terjadi ketika adanya peningkatakn gula darah dalam tubuh pada penderita diabetes. Diabetes merupakan salah satu penyakit yang memiliki faktor resiko kematian yang tinggi. Deteksi dini penyakit diabetes perlu dilakukan sebagai upaya dalam menurukan tingkat kematian yang diakibatkan oleh faktor penyakit tersebut. Model yang diusulkan yaitu menerapkan algoritma Naive Bayes sebagai algoritma pengklasifikasi. Dataset yang dijadikan sebagai objek penelitian yaitu dataset Early Stage Diabetes Risk Prediction merupakan dataset terbuka yang bersumber dari UCI Machine Learning. Metode-metode yang digunakan dalam melakukan prediksi yaitu metode data mining. Data mining merupakan serangkaian tindakan untuk menemukan hubungan dari pola dan kecenderungan dari data yang disimpan. Desain alur sistem klasifikasi jenis pada penelitian ini, dimulai dari penentuan Dataset, Loading dan baca data, Analisis Eksplorasi Data, Data Preprocessing, membangun model data, evaluasi Confusion Matrix, dan Hyperparameter Tuning. Didapatkan nilai True Positive sebanyak 276, True Negative sebanyak 180, False Positive sebanyak 20 dan False Negative sebanyak 44. Nilai akurasi yang didapatkan dalam penelitian yaitu sebesar 87.88% dengan kategori Good Classification serta memiliki error rate yang rendah yaitu 12.12% termasuk kedalam kategori Good Error Rate. Hasil penelitian tersebut menunjukan bahwa algoritma Naive Bayes memiliki kinerja yang baik serta dapat dijadikan sebagai landasan dalam memprediksi risiko diabetes tahap awal.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37012/jtik.v9i2.2017"
    },
    {
        "id": 9275,
        "title": "Optimalisasi Metode Naive Bayes Classifier Untuk Prediksi Persetujuan Kredit",
        "authors": "Achmad Syakur, Rendri Purwandi Putra, Christina Juliane",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "Kredit adalah bentuk pembiayaan yang banyak orang ajukan ke bank atau perusahaan penyedia kredit. Dalam proses pengajuan kredit, dilakukan analisis untuk menentukan apakah kredit yang diajukan layak atau tidak. Penelitian ini bertujuan untuk membantu bank atau perusahaan penyedia kredit dalam melakukan persetujuan kredit dengan efektif dan akurat dalam menentukan status pengajuan. Penelitian ini menggunakan teknik data mining dan kumpulan dataset yang berasal dari kaggle.com. Terdapat 12 atribut dan 2 kelas yang digunakan dalam penelitian ini. Dalam penelitian ini, metode klasifikasi Naive Bayes dan optimasi kelompok partikel (PSO) digunakan. Prediksi persetujuan kredit dengan metode naïve bayes classifier menghasilkan nilai akurasi sebesar 80,00% dengan nilai AUC 0,884. Sebaliknya, prediksi persetujuan kredit dengan metode particle swarm optimization (PSO) menghasilkan nilai akurasi sebesar 96,67% dengan nilai AUC 0,69.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v13i1.3622"
    },
    {
        "id": 9276,
        "title": "Retracted: Teaching Design of Mathematics Application Based on Naive Bayes",
        "authors": "",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9787256"
    },
    {
        "id": 9277,
        "title": "Perancangan E-Diagnosa Penyakit Osteoarthritis Menggunakan Metode Ripple Down Rules Dan Naive Bayes",
        "authors": "Firman Jaya Telaumbanua",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "The purpose of this study was to solve the problem of optimizing the time used by rheumatology specialists in providing services to the number of patients who came for consultation in a limited time to provide information on the diagnosis of Osteoarthritis. The source of research data on the diagnosis of Osteoarthritis used in the study was obtained from a specialist in rheumatology at the Royal Prima General Hospital. The expert system in the form of Electronic-Diagnosa (E-Diagnosa) of Osteoarthritis in this study was built with Visual Basic Net 2008 and MySQL as data storage space. The expert system built by the author applies the Ripple Down Rules and Naïve Bayes methods with each different function. Ripple Down Rules serves to establish the rule as an initial diagnosis based on expert knowledge, then the Naïve Bayes method as a method of calculating the level of vitality in the form of the percentage of disease experienced by patients as a final decision based on the knowledge base formed using the Ripple Down Rules method. The results of this study are expected to be the best solution to solve the time optimization problem used by rheumatology specialists at the Royal Prima General Hospital and the theory generated in this study can be a reference for future researchers who use the same topic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/jussi.v2i2.3291"
    },
    {
        "id": 9278,
        "title": "Hybrid Sentiment Analysis: Majority Voting with Multinomial Naive Bayes and Logistic Regression on IMDB Dataset",
        "authors": " Zakaria, Andi Sunyoto",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoiact59844.2023.10455937"
    },
    {
        "id": 9279,
        "title": "ANALISIS SENTIMEN MASYARAKAT TERHADAP PAYLATER MENGGUNAKAN METODE NAIVE BAYES CLASSIFIER",
        "authors": " Alfandi Safira, Firman Noor Hasan",
        "published": "2023-1-28",
        "citations": 0,
        "abstract": "Online shopping is so popular with the public because it is easy and convenient to do. The convenience of online shopping is supported by the payment method via paylater. However, paylater also results in bad behavior such as impulse buying. Various responses from the community made researchers conduct research to find out the public's view of paylater. In this study, researchers tried to do sentiment analysis using the Naive Bayes Classifier and TextBlob methods from the TetxBlob library with the Python programming language. From the dataset collected via Twitter, it produces 405 data. Sentiment analysis using the Naive Bayes Classifier method produces a negative sentiment of 70.62% or 286 data, positive sentiment is 22.72% or 92 data, neutral sentiment is 6.67% or 27 data. Meanwhile, using the TextBlob method also produced more negative sentiment, namely 55.8% or 226 data, positive sentiment collected 33.09% or 134 data, neutral sentiment amounted to 11.11% or 45 data. Thus, it can be concluded that the community feels unfavorable towards the use of paylater. In testing the model with the confussion matrix, it can be seen that the Naive Bayes Classifier algorithm is more accurate by 91% compared to TextBlob which is only 61%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31849/zn.v5i1.12856"
    },
    {
        "id": 9280,
        "title": "Sentiment Analysis on Twitter Social Media Regarding Depression Disorder Using the Naive Bayes Method",
        "authors": "Nur Lickha Lavenia, Reisa Permatasari",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "Depression disorder is a serious issue in mental health that affects many individuals worldwide. This research analyzes the sentiments related to depression disorder on Twitter using the Naïve Bayes method. Depression-related tweet data was collected through snscrape and processed to eliminate irrelevant information. Three Naïve Bayes methods, namely Multinomial, Gaussian, and Bernoulli, were compared to classify positive, negative, or neutral sentiments in each tweet. The results of the study indicate that Multinomial Naïve Bayes exhibited the best performance with an accuracy rate of 90.13%, followed by Gaussian Naïve Bayes (88.38%), and Bernoulli Naïve Bayes (85.37%).",
        "keywords": "",
        "link": "http://dx.doi.org/10.60005/coreid.v1i2.14"
    },
    {
        "id": 9281,
        "title": "KLASIFIKASI MENGGUNAKAN METODE NAIVE BAYES UNTUK MENENTUKAN CALON PENERIMA PIP",
        "authors": "Angga Pebdika, Ruli Herdiana, Dodi Solihudin",
        "published": "2023-3-14",
        "citations": 1,
        "abstract": "Dalam dunia global saat ini, pendidikan sangat penting untuk lebih meningkatkan sumber daya manusia. Pendidikan akan membantu peserta didik mengenai pengembangkan sikap, keterampilan, serta kecerdasan intelektualnya untuk memberikan manusia yang terampil, cerdas, dan berakhlak mulia. Namun pendidikan seringkali tidak berjalan dengan baik, Ada beberapa faktor yang berkontribusi terhadap hal ini, Contoh yang paling menonjol adalah faktor ekonomi yang menyebabkan banyak anak putus sekolah. Oleh karena itu pemerintah membuat program agar masyarakat miskin dapat melanjutkan pendidikannya melalui program ini. Dalam penyusunan ini dicoba dengan memakai prosedur Naive Bayes. Metode ini merupakan metode mengklasifikasikan data satu atau lebih kategori yang telah diidentifikasi. Operasi Naive Bayes menggunakan perhitungan probabilitas dan statistik yang ditemukan oleh ilmuwan Inggris Thomas Bayes, yaitu memprediksi probabilitas masa depan berdasarkan pengalaman masa lalu. Tujuan dari penelitian ini adalah untuk menghindari kesalahan dalam menentukan penerimaan bantuan. Perlu diterapkan data mining dengan algoritma Naive Bayes yang bisa mengklasifikasi tingkat kelayakan siswa penerima PIP, sehingga didapat hasil penerimaan program Indonesia Pintar yang lebih akurat. Penelitian ini memberikan informasi baru tentang hasil dari proses analisis yang dilakukan, selain itu dengan menggunakan metode Naive Bayes, proses analisis tersebut dapat membuat model kelayakan untuk menerima program Indonesia Pintar berdasarkan karakteristik yang telah ditentukan sebelumnya. Hasil dari proses penelitian ini diharapkan dapat menciptakan sistem data mining yang dapat memberikan hasil seleksi yang sangat akurat dalam memilih penerimaan  PIP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i1.6303"
    },
    {
        "id": 9282,
        "title": "IMPLEMENTASI DATA MINING DENGAN ALGORITMA NAIVE BAYES UNTUK KLASIFIKASI KELAYAKAN PENERIMA BANTUAN SEMBAKO",
        "authors": "Ayu Entini, Koko Handoko",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "The percentage of the population receiving assistance was 5.19%, this figure increased compared to March 2022, while the line of aid recipients was recorded in 2022 of 783,730 people per capita per month. The number of poor households in Batu Aji District is Bukit Tempayang Village with 15,857 inhabitants, 300 poor households, 37,531 inhabitants in Buliang Village, 289 poor households, 28,693 The beneficiary of assistance is an inability to meet basic needs including food, clothing, education and housing. Thus it is necessary to carry out a strategy in dealing with the level of beneficiaries, namely by providing accurate and targeted data on beneficiaries. Naive Bayes is an algorithm that exists in data mining and is part of the data mining classification technique by using probability and statistical techniques to estimate or predict opportunities that will occur based on previous opportunities, namely there are two feasible and inappropriate classes. The results of the classification that will be carried out later will help in the processing of assistance to help make decisions regarding the classification of determining basic food recipients. And by testing calculations manually and using rapid minner software, you get an accuracy value of 80%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33884/comasiejournal.v9i3.7659"
    },
    {
        "id": 9283,
        "title": "Information Gain Berbasis Algoritma Naive Bayes Classifier Pada Pemodelan Prediksi Kelulusan",
        "authors": "Avira Budianita",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Salah satu permasalahan yang dihadapi institusi perguruan tinggi adalah tidak tepatnya waktu kelulusan mahasiswa. Setiap tahunnya, jumlah mahasiswa yang mendaftar tidak sebanding dengan jumlah lulusannya. Hal tersebut yang menjadi tugas program studi dalam memantau akademik mahasiswanya. Program studi perlu memiliki acuan untuk mengantisipasi mahasiswa yang berpotensi tidak lulus tepat waktu. Dewasa ini, banyak sekali metode untuk menyelesaikan berbagai permasalahan teknologi informasi salah satunya dengan data mining. Salah satu teknik dalam data mining yang dapat digunakan untuk memprediksi waktu kelulusan adalah klasifikasi dan salah satu algoritma klasifikasi adalah Naive Bayes Classifier (NBC). Penelitian ini menggunakan algoritma NBC dengan memanfaatkan seleksi fitur Information Gain dalam memprediksi waktu kelulusan mahasiswa. Tujuan dari pemanfaatan seleksi fitur sendiri adalah untuk mengurangi tingkat kompleksitas dan meningkatkan akurasi serta mampu mengetahui fitur-fitur apa saja yang paling berkontribusi terhadap tingkat akurasi. Hasil pengolahan dataset pada RapidMiner dengan menerapkan algoritma NBC dengan seleksi fitur Information Gain menunjukkan peningkatan akurasi dibandingkan dengan menggunakan standar NBC.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46772/intech.v5i1.1116"
    },
    {
        "id": 9284,
        "title": "Comparative Study of Elastic Net Regression, Naive Bayes &amp; Lasso Regression",
        "authors": "Rashika Bangroo, Sanjoy Raj Verma,  Shivangi,  Shakuntala",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/elexcom58812.2023.10370433"
    },
    {
        "id": 9285,
        "title": "ANALISIS SENTIMEN TERHADAP PEMBERHENTIAN TV ANALOG PADA TWITTER MENGGUNAKAN ALGORITMA NAIVE BAYES",
        "authors": "Andika Prasetyo,  Taufik Ridwan",
        "published": "2023-9-9",
        "citations": 0,
        "abstract": "Perkembangan teknologi menjadikan perubahan yang terjadi pada siaran televisi yang semulanya analog menjadi digital. Aturan tersebut menjadikan bahan perbincangan pada kalangan umum salah satunya pengguna Twitter. Hal itu menimbulkan opini pengguna Twitter pro-kontra. Mengenai hal ini perlu adanya analisis sentimen terhadap pemberhentian tv analog menggunakan algoritma Naive Bayes. Data yang diambil dengan kata kunci â€œtvanalogâ€ dalam kurun waktu 1 Januari 2022 s.d. 30 Desember 2022 dengan batas maksimal 100 data. Permodelan yang digunakan dengan data latih berjumlah 90 data dengan sentimen negatif berjumlah 65 data dan sentimen positif berjumlah 25 data. Data uji berjumlah 10 dimana jumlah data 5 negatif dan 5 positif. Permodelan algoritma Naive Bayes yang dibuat menggunakan alat bantu RapidMiner Studio 10.0. Metodologi yang diterapkan menggunakan AI project cycle yang diakhiri dengan tahap evaluation. Hasil performa dalam mencari akurasi pada model mendapatkan hasil akurasi 50% dimana hasil tersebut belum baik maka diperlukan data latih yang lebih banyak dan sentimen yang seimbang, agar mendapatkan hasil terbaik.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30736/jt.v15i2.991"
    },
    {
        "id": 9286,
        "title": "Prediksi Dampak Pembelajaran Hybrid Learning  Menggunakan Naive Bayes",
        "authors": "Yuyun Yusnida Lase, Yulia Fatmi,  Haryadi, Santi Prayudani",
        "published": "2023-12-24",
        "citations": 0,
        "abstract": "This research use to predict the impact of hybrid learning on Medan State Polytechnic students. This algorithm was chosen because it has excellent performance in classification compared to other algorithms. Statistical and probabilistic methods are used in the operation of this algorithm to make predictions about what will happen in the future. Technology mastery, level of teacher-student interaction, and mastery of teaching materials are the variables used in this study. The sample data used came from students of the Software Engineering Technology Study Program of Medan State Polytechnic. The prediction results carried out manually with naïve bayes, with training data of 100 (one hundred) students and test data of 1 (one) student, produced a result of 0.012, which indicates an increase in student academic results. The test results were proven using the phyton programming language. The first test results, with 20% test data, resulted in an increase in academic results by 86% around 13 students with an accuracy value of 80%, and the second test, with 40% test data, resulted in an increase in academic results by 92% around 29 students with an accuracy value of 88%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bit.v4i4.968"
    },
    {
        "id": 9287,
        "title": "PERBANDINGAN ALGORITMA C4.5 DAN NAIVE BAYES DALAM MENDETEKSI HIPERTENSI DI PUSKESMAS BANYUBIRU",
        "authors": "Kurniati Pratami,  Iwan Setiawan Wibisono",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "Hipertensi menjadi penyebab kematianÂ  nomor 1 di dunia setiap tahunnya karena merupakan pintu masuk penyakit lain, seperti : jantung, gagal ginjal, diabetes, dan stroke (Direktur Pencegahan dan Pengendalian Penyakit Tidak Menular (PPTM) Kemenkes RI, dr. Cut Putri Ariane, M.H.Kes.). Tujuan dari penelitian ini adalah mencari metode terbaik dalam mendeteksi penyakit hipertensi. Dalam penelitian ini, penulis menggunakan metode C4.5 dan Naive Bayes. Hasil penelitian menunjukan bahwa model C4.5 memiliki akurasi yang lebih baik dengan 74,00 % dibandingkan model Naive Bayes dengan akurasi 67,00 %. Kesimpulan penelitian ini adalah penerapan algoritma C4.5 sebagai metode terbaik dalam mendeteksi hipertensi terkendali dan tak terkendali di Puskesmas Banyubiru.\r\nÂ \r\nKata Kunci : Hipertensi, C4.5, dan Naive Bayes, Puskesmas Banyubiru.\r\n \r\nHypertension is the number 1 cause of death in the world every year because it is the entrance to other diseases, such as: heart, kidney failure, diabetes, and stroke (Director of Prevention and Control of Non-Communicable Diseases (PPTM) of the Indonesian Ministry of Health, dr. Cut Putri Ariane, M.H.Kes .). The purpose of this study was to find the best method for detecting hypertension. In this study, the authors used the C4.5 and Naive Bayes methods. The results showed that the C4.5 model has a better accuracy of 74.00% than the Naive Bayes model with an accuracy of 67.00%. The conclusion of this study is the application of the C4.5 algorithm as the best method for detecting controlled and uncontrolled hypertension at the Banyubiru Health Center.\r\nKeywords: Hypertension, C4.5, and Naive Bayes, Banyubiru Health Center.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35473/jamastika.v2i1.1937"
    },
    {
        "id": 9288,
        "title": "Classification of heart disease trigger factors using Naive Bayes method to predict the risk of heart disease using IoT-based heart rate sensors",
        "authors": "Jeffrey Jahja, Halim Agung, Teady Matius Surya Mulyana, Lukman Hakim, Evaria Sipayung",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0119083"
    },
    {
        "id": 9289,
        "title": "Design of an Automatic Classification System for Educational Reform Documents Based on Naive Bayes Algorithm",
        "authors": "Peng Zhang, Zifan Ma, Zeyuan Ren, Hongxiang Wang, Chuankai Zhang, Qing Wan, Dongxue Sun",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "With the continuous deepening of educational reform, a large number of educational policies, programs, and research reports have emerged, bringing a heavy burden of information processing and management to educators. Traditional manual classification and archiving methods are inefficient and susceptible to subjective factors. Therefore, an automated method is needed to quickly and accurately classify and archive documents into their respective categories. Based on this, this paper proposes a design of an automatic document classification system for educational reform based on the Naive Bayes algorithm to address the challenges of document management in the education field. Firstly, the relevant literature and document data in the field of educational reform are collected and organized to establish an annotated dataset for model detection. Secondly, the raw data are preprocessed by cleaning and transforming the original text data to make them more suitable for input into machine learning algorithms. Thirdly, various algorithms are trained and selected to determine the best algorithm for classifying educational reform documents. Finally, based on the determined algorithm, a corresponding classification software is designed to automatically classify and archive educational reform documents for analysis. Through experimental evaluation and result analysis, this research demonstrates the effectiveness and accuracy of the education reform document automatic classification system based on the Naive Bayes algorithm. This method can efficiently classify a large number of documents into their respective categories quickly and accurately, thereby improving the efficiency of educators and their information management capabilities. In the future, further exploration of feature extraction methods and machine learning algorithms can be conducted to optimize the classification performance and apply this method to practical management and decision-making in the education field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math12081127"
    },
    {
        "id": 9290,
        "title": "Automatic classification method of power user’s requirements text based on parallel naive Bayesian algorithm",
        "authors": "Anlei Liu, Xun Ma, Xuchao Jia, Kai Liu, Ming Ji, Jian Feng, Junlong Wang",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "In order to ensure the efficiency of power user’s requirements processing, an automatic classification method for demand test of power users based on parallel naive Bayesian algorithm is proposed. Polynomial naive Bayes is selected to build Hadoop cluster, and the feature words of power user’s requirements are selected through chi square test. The weight of each feature item is calculated by word frequency-inverse text frequency index method, and the weight sum of each category is calculated. The weight sum is input into naive Bayes algorithm to output the text classification results of power user’s requirements. At the same time, The naive Bayes classification algorithm is parallelized and encapsulated to reduce the cost of data movement and exchange in the classification process, and improve the operation efficiency of demand text classification of power user. The experimental results show that this method can accurately extract the feature words of power user’s requirements, effectively realize the automatic classification of power user’s requirements text, and have a more accurate classification effect. The average fitness value of the proposed method tends to be stable after more than 20 training times, and the number of network convergence steps is 7. When the ratio of energy function is about 0.4 and 0.6, the average IU value is the highest. When the required number of texts ranges from 500 to 1500, the delay time of text classification is 0.02 s, and the peak signal-to-noise ratio is more than 33, among which the highest peak signal-to-noise ratio is 42.52, and the normalization coefficient is 1.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-224170"
    },
    {
        "id": 9291,
        "title": "Fully Homomorphic Privacy-Preserving Naive Bayes Machine Learning and Classification",
        "authors": "Boyoung Han, Yeonghyeon Kim, Jina Choi, Hojune Shin, Younho Lee",
        "published": "2023-11-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3605759.3625262"
    },
    {
        "id": 9292,
        "title": "Comparison of Naive Bayes, K-Nearest Neighbor, and Support Vector Machine Classification Methods in Semi-Supervised Learning for Sentiment Analysis of Kereta Cepat Jakarta Bandung (KCJB)",
        "authors": " Muhammad Farhan,  Renata De La Rosa Manik,  Hana Raihanatul Jannah,  Lya Hulliyyatus Suadaa",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "Transportation technology has developed very rapidly in the 21st century; one of them is high-speed trains. Currently, the Indonesian government is implementing the construction of the Kereta Cepat Jakarta-Bandung (KCJB) project in collaboration with China. The construction of this fast train project has attracted various comments and opinions from the public on Twitter and social media. This research aims to compare the classification methods of Naïve Bayes, K-Nearest Neighbor (K-NN), and Support Vector Machine (SVM) in classifying sentiment in tweets about high-speed trains obtained by scraping Twitter. The comparison process was carried out using semi-supervised learning, and the results showed that the semi-supervised SVM model had the best performance with an average accuracy of 86%, followed by the semi-supervised Naïve Bayes model and semi-supervised K-NN with an average accuracy of 81% and 58% respectively. Overall, the prediction results from the three models conclude that there are more tweets with negative sentiment than tweets with positive and neutral sentiment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34123/icdsos.v2023i1.332"
    },
    {
        "id": 9293,
        "title": "A data-driven approach for scour detection around monopile-supported offshore wind turbines using Naive Bayes classification",
        "authors": "Satish Jawalageri, Ramin Ghiasi, Soroosh Jalilvand, Luke J. Prendergast, Abdollah Malekjafarian",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.marstruc.2023.103565"
    },
    {
        "id": 9294,
        "title": "SO‘Z MA’NOSINI ANIQLASHDA NAIVE BAYES ALGORITMIDAN FOYDALANISH",
        "authors": "B. B. Elov,  , H. I. Akhmedova,  ",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "One of the relevant issues of a natural language processing is word sense disambiguation. Homonyms are considered as an important element of determining the meaning of a word. Methods based on machine learning play a special role in solving this problem. Naive Bayes classifier is one of the important machine learning methods. When eliminating homonymy between different and grammatically similar groups of words in the Uzbek language, the Naive Bayes classifier differs from other methods in its simplicity and speed. This classifier is one of the most popular multi-class classification algorithms, and depending on the data in question, any of the 3 types of Naive Bayes algorithms (Gaussian, Polynomial, Bernoulli) can be used. This article scrutinizes the processes of using the classifier to identify homonymy between grammatically similar groups of words in the Uzbek language.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36522/2181-9637-2023-3-4"
    },
    {
        "id": 9295,
        "title": "Metode SVM dan Naive Bayes untuk Analisis Sentimen ChatGPT di Twitter",
        "authors": "Dedy Atmajaya, Annisa Febrianti, Herdianti Darwis",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "Pertumbuhan pesat platform media sosial telah memberikan jalur baru bagi individu untuk mengungkapkan pendapat dan sentimen mereka. Analisis sentimen dari konten yang dibuat oleh pengguna di platform seperti Twitter menjadi semakin penting dalam memahami opini publik dan tren sosial. Penelitian ini bertujuan untuk membandingkan kinerja dua algoritma machine learning, Support Vector Machine (SVM) dan Naive Bayes, dalam menganalisis sentimen pengguna Twitter mengenai ChatGPT, sebuah model bahasa canggih. Sentimen akan diberi label menggunakan dua alat analisis sentimen yang terkenal, Vader dan Roberta. Penelitian ini menggunakan data Twitter sebanyak 1000 dataset yang terkait dengan ChatGPT dan mengevaluasi akurasi, presisi, dan recall dari model SVM dan Naive Bayes. Hasil penelitian ini menunjukkan perbedaan yang jelas dalam kinerja model: SVM yang digabungkan dengan Vader mencapai tingkat akurasi, presisi, dan recall sebesar 59%, dengan F1-score sebesar 55%. Secara signifikan lebih unggul dibandingkan dengan model sebaliknya, dimana SVM dengan label RoBERTa menghasilkan akurasi sebesar 55%, presisi sebesar 58%, recall sebesar 55%, dan F1-score sebesar 52%. Naive Bayes menunjukkan kinerja yang relatif lebih rendah. Dengan menggunakan Vader, Naïve Bayes mencapai tingkat akurasi dan recall sebesar 47%, presisi sebesar 46%, dan F1-score yang lebih rendah sebesar 32%. Sedangkan, menggunakan RoBERTa dengan Naive Bayes menunjukkan penurunan akurasi menjadi 43%, recall sebesar 43%, presisi sebesar 18%, dan F1-score sebesar 26%. Pengendalian SVM dinilai memiliki kinerja yang lebih unggul dalam mengolah analisis sentimen pengguna Twitter mengenai opini tentang ChatGPT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i4.3341"
    },
    {
        "id": 9296,
        "title": "PREDIKSI PENENTUAN PEMOHON KREDIT SEPEDA MOTOR MENGGUNAKAN ALGORITMA NAIVE BAYES",
        "authors": "Nur Aeni Widiastuti, Akhmad Khanif Zyen, Nor Safik",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "Penentuan kelayakan pengajuan kredit motor pada sebuah perusahaan Dealer adalah hal yang sangat penting, mengingat jika terjadi kesalahan pengambilan keputusan maka akan berdampak pada kerugian perusahaan yang ada pada tempat penelitian ini yaitu Dealer Muncul jaya. Perlu adanya Algoritma Klasifikasi untuk memecahkan permasalahan ini, ada salah satu Algoritma Klasifikasi yang sudah terbukti akurasi dan kecepatan yang tinggi untuk  memecahkan permasalahan tersebut yaitu Algoritma Naive Bayes. Oleh karena itu penulis menganalisis Penentuan Kelayakan Pegajuan Kredit dengan metode Naïve Bayes untuk menentukan layak tidaknya sebuah pengajuan kredit motor. Penulis membuat perhitungan metode Naïve Bayes secara manual menggunakan Excel dan menggunakan aplikasi pendukung Rapidminer 5.3 untuk pengujian akurasi terhadap sistem yang buat. Pengujian dilakukan dengan menyiapkan data training sebanyak 180 data dan data testing sebanyak 33 data yang dipilih secara random. Didapat Hasil pengujian akurasi dengan Metode Naïve Bayes cukup tinggi yaitu sebesar 93,94% dengan persentase eror 6,06%. Jadi, dapat disimpulkan bahwa aplikasi yang dibuat dapat mendukung pengambilan keputusan penentuan kelayakan kredit motor.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34001/jdpt.v10i2.4689"
    },
    {
        "id": 9297,
        "title": "Penerapan Algoritma KNN, Naive Bayes Dan C4.5 Dalam Memprediksi Kelulusan Mahasiswa",
        "authors": "Embun Fajar Wati, Biktra Rudianto",
        "published": "2023-1-7",
        "citations": 0,
        "abstract": "Seleksi penerimaan mahasiswa baru berfungsi untuk mendapatkan mahasiswa yang berkualitas. Kualitas mahasiswa dapat diukur dengan masa pendidikan di perguruan tinggi. Lulusan yang tepat waktu yang mempunyai predikat mahasiswa berkualitas. Jumlah kelulusan mahasiswa sangat mempengaruhi penilaian akreditasi bagi suatu perguruan tinggi. Banyak faktor yang sangat berpengaruh terhadap ketepatan waktu kelulusan bagi mahasiswa seperti, jenis kelamin, umur, status pernikahan, IPK, dan status pekerjaan. Kelima faktor inilah yang akan dijadikan variabel input dalam menentukan klasifikasi kelulusan mahasiswa. Variabel-variabel tersebut akan diolah dengan algoritma KNN (K-Nearest Neighbor), Naive Baye, C4.5. Data mahasiswa diseleksi sebanyak 300 mahasiswa. Data preprocessing menggunakan data mahasiswa yang terdiri dari data pribadi (jenis kelamin, umur, status pernikahan, dan status pekerjaan) dan data akademik (IPK). Berdasarkan data kelulusan, 203 siswa lulus tepat waktu dan 97 siswa lulus terlambat.Setelah dilakukan transformasi, keseluruhan data dapat digunakan karena tidak ada nilai yang kosong. Data yang diubah adalah umur (muda : 19 - 24, tua : 25 - 50) dan IPK (besar : 3 - 4, kecil : 1 - 2.9). Hasil confusion matrix, menunjukkan bahwa Naive Bayes mempunyai accuracy 100.00% dan AUC 1.000 lebih tinggi dibandingkan dengan C4.5 dan KNN. Sehingga algoritma Naive Bayes mempunyai kinerja yang lebih baik dibandingkan dengan KNN dan C4.5.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22441/format.2022.v11.i2.009"
    },
    {
        "id": 9298,
        "title": "An Efficient Approach to Detect Liver Disorder Using Naive Bayes in Comparison with Decision Tree Algorithm to Measure Accuracy",
        "authors": "M.M. Zaheer, P. Nirmala",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "Aim: To process an effective approach to detect liver disorder using Naive Bayes algorithm in comparison with Decision tree algorithm to measure accuracy. Methods & Materials: There are 20 samples used for both groups, where group 1 is Naive Bayes algorithm and group 2 is Decision tree algorithm which are effectively used for the identification of liver disorder approach. Result: It is a novel detection method, and it has been discovered that the Naive Bayes algorithm performs better than the Decision tree algorithm. Each sample has a distinct level of accuracy, with Naive Bayes having a mean accuracy of 94.80%, which is higher than the decision tree algorithm 92.20%. The statistical results show that the Naive Bayes and Decision tree algorithms have different statistical significance levels of p=0.01, i.e., p<.0.05 (independent sample T-test). Conclusion: On the basis of a liver disorder analysis, it is obvious that the Naive Bayes algorithm has a higher mean accuracy value than the Decision tree method. The Naive Bayes algorithm has a 94.80% accuracy rating, while decision tree has 92.20% rating. KEYWORD Naive bayes, Decision tree, Innovative liver disorder detection, Liver disorder, Machine learning, Artificial intelligence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2022.25.10471053"
    },
    {
        "id": 9299,
        "title": "IMPLEMENTASI ALGORITMA NAIVE BAYES UNTUK PREDIKSI CALON PENERIMA BLT",
        "authors": " Muhamad Adhi Mukti, Wiyanto Wiyanto,  Ismasari Nawangsih",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Permasalahan terjadi di Desa Tridaysakti, Kabupaten Bekasi banyak masyarakat yang tidak mendapatkan BLT, masyarakat menilai pihak desa kurang objektif dan tidak transparan dalam proses penerima BLT. Diperlukan prediksi dalam proses perhitungan kriteria penerima BLT dengan menggunakkan teknik Data Mining yaitu Algoritma Naive Bayes untuk memberi pengetahuan serta membuat keputusan data kepada masyarakat sehingga dapat mengetahui layak atau tidak menerima BLT. Algoritma Naive Bayes ini akan di implementasikan ke sistem informasi menggunakkan bahasa pemrograman PHP. Pada penelitian digunakan metode CRISP-DM dalam pengembangan sistem, untuk pengujiannya menggunakan perhitungan manual  dan Rapidminer yaitu perhitungan manual data training sebanyak 282 data dan data testing  2 data metode Naive Bayes, pengujian dilakukan dengan perhitungan nilai Confussion Matrix dihasilkan Accuracy,Precision, dan Recall yaitu masing-masing 100%.. Data training sebanyak 197 dan data testing sebanyak 85 data dengan pengujian RapidMiner didapatkan hasil Performance nilai tingkat Accuracy sebesar 98,82% , Precision sebesar 100%, dan Recall sebesar 96,97%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51401/jinteks.v5i3.3106"
    },
    {
        "id": 9300,
        "title": "Credit Risk Analysis Using Naive Bayes in Machine Learning",
        "authors": "Prof. S.P. Gade",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: A method of data analysis called machine learning automates the creation of analytical models. It is an area of artificial intelligence based on the idea that robots can learn from data, recognise patterns, and form opinions with little help from people. One of the most important and difficult tasks facing banks is the evaluation of credit risk. To prevent financial loss, accuracy is crucial in the classification of credit data. Lending money to people who need it is a major operation in the banking sector. The depositor bank receives the interest earned by the main borrowers in order to repay the principal borrowed from them. Financial risk management is increasingly focusing on credit risk analysis. The ability to estimate credit risk, monitor it, trust the model, and process loans well are essential for decision-making and transparency. In this study, we develop binary classifiers based on machine learning and deep learning models on actual data to forecast the likelihood of loan default. In the aforementioned research, we examine various methods for credit risk analysis that are used to the assessment of credit risk datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.52943"
    },
    {
        "id": 9301,
        "title": "Machine Learning Approaches for DDoS Attack Detection: Naive Bayes vs Logistic Regression",
        "authors": "Latha R, S. John Justin Thangaraj",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smarttechcon57526.2023.10391376"
    },
    {
        "id": 9302,
        "title": "Recognizing Public Satisfaction Toward Kampus Mengajar Program with Naive Bayes",
        "authors": "Ridwan Suhud, Arafat Febriandirza, Intan Permatasari, Farhan Ramadan",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3ina60834.2023.10285769"
    },
    {
        "id": 9303,
        "title": "Implementasi Metode Naive Bayes Untuk Klasifikasi Ulasan Pada Aplikasi Telegram",
        "authors": "Satria Budi",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "Ulasan aplikasi merupakan salah satu bentuk ekspresi pengguna terhadap aplikasi yang digunakannya. Ulasan tertulis biasanya berupa kritik, saran atau sekedar perasaan pengguna setelah menggunakan aplikasi. Salah satu aplikasi yang memiliki banyak ulasan penggunanya adalah Telegram. Telegram sendiri merupakan platform komunikasi instan yang dapat diunduh melalui Google Play Store. Penelitian ini bertujuan untuk mengklasifikasikan teks dengan dataset 5.000 ulasan aplikasi Telegram di Google Play Store ke dalam kelompok yang memiliki nilai positif, negative, atau netral. Penelitian ini menerapkan metode TF-IDF dan Naive Bayes Classifier untuk pembobotan dan pengklasifikasian data. Hasil pengujian terhadap data test dengan menggunakan metode Naive Bayes Classifier menghasilkan nilai akurasi sebesar 85,6 %, presisi 86,8%, recall 85,7% dan f1-score 85,5%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31539/intecoms.v6i2.8284"
    },
    {
        "id": 9304,
        "title": "Twitter Sentiment Analysis using Enhanced TF-DIF Naive Bayes Classifier Approach",
        "authors": "M. Sindhuja, Kuriseti Sai Nitin, Kotharu Srujana Devi",
        "published": "2023-2-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccmc56507.2023.10084106"
    }
]