[
    {
        "id": 12105,
        "title": "Joint Optimization of Well Control and Placement Using Monte-Carlo Tree Search Based Variable selection",
        "authors": "A. Kumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310863"
    },
    {
        "id": 12106,
        "title": "Solving Job Shop Problems with Neural Monte Carlo Tree Search",
        "authors": "Marco Kemmerling, Anas Abdelrazeq, Robert Schmitt",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012311700003636"
    },
    {
        "id": 12107,
        "title": "Neural Architecture Search Method Based on Improved Monte Carlo Tree Search",
        "authors": "Jianyun Qiu, Yuntao Zhao, Weigang Li",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451718"
    },
    {
        "id": 12108,
        "title": "Exploring search space trees using an adapted version of Monte Carlo tree search for combinatorial optimization problems",
        "authors": "Jorik Jooken, Pieter Leyman, Tony Wauters, Patrick De Causmaecker",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cor.2022.106070"
    },
    {
        "id": 12109,
        "title": "Monte Carlo Tree Search and Convex Optimization for Decision Support in Beyond-Visual-Range Air Combat",
        "authors": "Edvards Scukins, Markus Klein, Lars Kroon, Petter Ögren",
        "published": "2023-6-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icuas57906.2023.10156124"
    },
    {
        "id": 12110,
        "title": "Hedging of financial derivative contracts via Monte Carlo tree search",
        "authors": "Oleg Szehr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21314/jcf.2023.009"
    },
    {
        "id": 12111,
        "title": "Feature Acquisition Using Monte Carlo Tree Search*",
        "authors": "Sungsoo Lim, Diego Klabjan, Mark B. Shapiro",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386713"
    },
    {
        "id": 12112,
        "title": "Predictive Models and Monte Carlo Tree Search: A Pipeline for Believable Agents",
        "authors": "Cristiana Pacheco, Diego Perez-Liebana",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cog57401.2023.10333155"
    },
    {
        "id": 12113,
        "title": "Transfer Learning in Monte Carlo Tree Search",
        "authors": "Nathan Cleaver, Kourosh Neshatian",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csde59766.2023.10487142"
    },
    {
        "id": 12114,
        "title": "Beyond UCT: MAB Exploration Improvements for Monte Carlo Tree Search",
        "authors": "Robert C. Gray, Jichen Zhu, Santiago Ontañón",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cog57401.2023.10333233"
    },
    {
        "id": 12115,
        "title": "Decoupled Monte Carlo Tree Search for Cooperative Multi-Agent Planning",
        "authors": "Okan Asik, Fatma Başak Aydemir, Hüseyin Levent Akın",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "The number of agents exponentially increases the complexity of a cooperative multi-agent planning problem. Decoupled planning is one of the viable approaches to reduce this complexity. By integrating decoupled planning with Monte Carlo Tree Search, we present a new scalable planning approach. The search tree maintains the updates of the individual actions of each agent separately. However, this separation brings coordination and action synchronization problems. When the agent does not know the action of the other agent, it uses the returned reward to deduce the desirability of its action. When a deterministic action selection policy is used in the Monte Carlo Tree Search algorithm, the actions of agents are synchronized. Of all possible action combinations, only some of them are evaluated. We show the effect of action synchronization on different problems and propose stochastic action selection policies. We also propose a combined method as a pruning step in centralized planning to address the coordination problem in decoupled planning. We create a centralized search tree with a subset of joint actions selected by the evaluation of decoupled planning. We empirically show that decoupled planning has a similar performance compared to a central planning algorithm when stochastic action selection is used in repeated matrix games and multi-agent planning problems. We also show that the combined method improves the performance of the decoupled method in different problems. We compare the proposed method to a decoupled method in regard to a warehouse commissioning problem. Our method achieved more than 10% improvement in performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13031936"
    },
    {
        "id": 12116,
        "title": "Automated Knowledge Distillation via Monte Carlo Tree Search",
        "authors": "Lujun Li, Peijie Dong, Zimian Wei, Ya Yang",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01597"
    },
    {
        "id": 12117,
        "title": "Application of Monte Carlo Tree Search algorithm in Go playing",
        "authors": "Wanyi Jiang",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "The reputation of Monte Carlo Tree Search (MCTS) algorithm is built upon its ability to handle a large number of options and make optimal decisions and detailed plans in situations with limited information. It was initially applied in the game of Go, a traditional and complex combinatorial strategy game, which severely challenged the efficiency of traditional brute-force algorithms that relied on simulating every node and branch in the search tree. The success of AlphaGo, developed by Google, represents a significant advancement in artificial intelligence technology, utilizing deep learning networks and MCTS techniques. In this article, we analyze the limitations of traditional brute-force approaches in Go playing and compare them with the application of MCTS, which overcomes these limitations through the iterative process of four steps: selection, expansion, simulation, and back-propagation. The discussion covers the application of MCTS in the game of Go. Besides, we evaluate the advantages and shortcomings of the MCTS algorithm. The article concludes with a summary and prospects for future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/53/20241503"
    },
    {
        "id": 12118,
        "title": "Routing optimization with Monte Carlo Tree Search-based multi-agent reinforcement learning",
        "authors": "Qi Wang, Yongsheng Hao",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-04881-1"
    },
    {
        "id": 12119,
        "title": "AlphaSyn: Logic Synthesis Optimization with Efficient Monte Carlo Tree Search",
        "authors": "Zehua Pei, Fangzhou Liu, Zhuolun He, Guojin Chen, Haisheng Zheng, Keren Zhu, Bei Yu",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccad57390.2023.10323856"
    },
    {
        "id": 12120,
        "title": "Monte-Carlo tree search with Epsilon-Greedy for game of amazons",
        "authors": "Chuan Tian",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "The Game of the Amazons is an abstract strategy board game. It has a high computational complexity similar to the game of Go. Due to its NP-complete nature and large branching factor of game tree, finding the optimal move given a specific game state is infeasible and it is not trivial to design a computer algorithm that is competitive to an expert in the game of amazons. One way to tackle this problem is to leverage the Monte-Carlo Tree Search by using random simulations. In this article, a computationally cheap heuristic function is proposed and use together with Monte-Carlo Tree Search algorithm with Epsilon-Greedy policy aiming to design a competitive AI for the Game of the Amazon. The effectiveness of the -greedy based Monte-Carlo algorithm is compared to the widely used MCTS with Upper Confidence Bound and other classical tree search method such as breadth-first search, depth-first search, minmax search and alpha-beta pruning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230956"
    },
    {
        "id": 12121,
        "title": "Monte Carlo Tree Search Based Trajectory Generation for Automated Vehicles in Interactive Traffic Environments",
        "authors": "Tinu Vellamattathil Baby, Baisravan HomChaudhuri",
        "published": "2023-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/acc55779.2023.10156530"
    },
    {
        "id": 12122,
        "title": "Hierarchical Monte Carlo Tree Search for Latent Skill Planning",
        "authors": "Yue Pei",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590005"
    },
    {
        "id": 12123,
        "title": "Monte Carlo Tree Search and Machine Learning Techniques on Block Go Programs",
        "authors": "Shi-Jim Yen, Ken-Wen Lee",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icasi57738.2023.10179581"
    },
    {
        "id": 12124,
        "title": "Monte Carlo Tree Search-based Deep Reinforcement Learning for Flexible Operation &amp; Maintenance Optimization of a Nuclear Power Plant",
        "authors": "Zhaojun Hao, Francesco Di Maio, Enrico Zio",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jsasus.2023.08.001"
    },
    {
        "id": 12125,
        "title": "Anti-jamming Equilibrium Strategy Learning of Frequency Agile Radar based on Monte Carlo Tree Search",
        "authors": "Chao Wang, Bo Jiu, Wenqiang Pu, Kang Li, Yu Zhao, Hongwei Liu",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/radar54928.2023.10371079"
    },
    {
        "id": 12126,
        "title": "An Efficient Node Selection Policy for Value Network Based Monte Carlo Tree Search",
        "authors": "Xiaotian Liu, Yijie Peng, Gongbo Zhang, Ruihan Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4450999"
    },
    {
        "id": 12127,
        "title": "Perturbation-Based Best Arm Identification for Efficient Task Planning with Monte-Carlo Tree Search",
        "authors": "Daejong Jin, Juhan Park, Kyungjae Lee",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10161169"
    },
    {
        "id": 12128,
        "title": "A Conflict Resolution Strategy at a Taxiway Intersection by Combining a Monte Carlo Tree Search with Prior Knowledge",
        "authors": "Dong Sui, Hanping Chen, Tingting Zhou",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "With the escalating complexity of surface operations at large airports, the conflict risk for aircraft taxiing has correspondingly increased. Usually, the Air Traffic Controllers (ATCOs) generate route, speed and holding instructions to resolve conflicts. In this paper, we introduce a conflict resolution framework that incorporates prior knowledge by integrating a Multi-Layer Perceptron (MLP) neural network into the Monte Carlo Tree Search (MCTS) approach. The neural network is trained to learn the allocation strategy for waiting time extracted from actual aircraft taxiing trajectory data. Subsequently, the action probability distribution generated with the neural network is embedded into the MCTS algorithm as a heuristic evaluation function to guide the search process in finding the optimal conflict resolution strategy. Experimental results show that the average conflict resolution rate is 96.8% in different conflict scenarios, and the taxiing time required to resolve conflicts is reduced by an average of 42.77% compared to the taxiing time in actual airport surface operations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/aerospace10110914"
    },
    {
        "id": 12129,
        "title": "User Cold-Start Learning In Recommender Systems Using Monte Carlo Tree Search",
        "authors": "Dilina Chandika Rajapakse, Douglas Leith",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "We consider the cold-start task for new users of a recommender system whereby a new user is asked to rate a few items with the aim of quickly discovering the user’s preferences. This is a combinatorial stochastic learning task, and so difficult in general. In this paper we study the use of Monte Carlo Tree Search (MCTS) to dynamically select the sequence of items presented to a new user. We find that the MCTS-based cold-start approach is able to consistently quickly identify the preferences of a user with significantly higher accuracy than with either a decision-tree or a state of the art bandit-based approach without incurring higher regret i.e the learning performance is fundamentally superior to that of the state of the art. This boost in recommender accuracy is achieved in a computationally lightweight fashion. The MCTS approach is flexible in the sense that it can readily extended to incorporate different types of user feedback including explicit ratings, ranked comparisons and missing not at random data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3618002"
    },
    {
        "id": 12130,
        "title": "Efficient Object Manipulation Planning with Monte Carlo Tree Search",
        "authors": "Huaijiang Zhu, Avadesh Meduri, Ludovic Righetti",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341813"
    },
    {
        "id": 12131,
        "title": "Augmenting Monte Carlo Tree Search for managing service level agreements",
        "authors": "Masih Fadaki, Atie Asadikia",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijpe.2024.109206"
    },
    {
        "id": 12132,
        "title": "Efficient graph neural architecture search using Monte Carlo Tree search and prediction network",
        "authors": "TianJin Deng, Jia Wu",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118916"
    },
    {
        "id": 12133,
        "title": "Prompt-Based Monte-Carlo Tree Search for Goal-oriented Dialogue Policy Planning",
        "authors": "Xiao Yu, Maximillian Chen, Zhou Yu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.439"
    },
    {
        "id": 12134,
        "title": "User Association and Load Balancing Based on Monte Carlo Tree Search",
        "authors": "Hyeon-Min Yoo, Jung-Mo Moon, Jeehyeon Na, Een-Kee Hong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3330872"
    },
    {
        "id": 12135,
        "title": "Decentralised Multi-Robot Exploration Using Monte Carlo Tree Search",
        "authors": "Sean Bone, Luca Bartolomei, Florian Kennel-Maushart, Margarita Chli",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341485"
    },
    {
        "id": 12136,
        "title": "Tensor Implementation of Monte-Carlo Tree Search for Model-Based Reinforcement Learning",
        "authors": "Marek Baláž, Peter Tarábek",
        "published": "2023-1-20",
        "citations": 2,
        "abstract": "Monte-Carlo tree search (MCTS) is a widely used heuristic search algorithm. In model-based reinforcement learning, MCTS is often utilized to improve action selection process. However, model-based reinforcement learning methods need to process large number of observations during the training. If MCTS is involved, it is necessary to run one instance of MCTS for each observation in every iteration of training. Therefore, there is a need for efficient method to process multiple instances of MCTS. We propose a MCTS implementation that can process batch of observations in fully parallel fashion on a single GPU using tensor operations. We demonstrate efficiency of the proposed approach on a MuZero reinforcement learning algorithm. Empirical results have shown that our method outperforms other approaches and scale well with increasing number of observations and simulations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13031406"
    },
    {
        "id": 12137,
        "title": "A Comprehensive Optimal Design of Inductors Using Monte Carlo Tree Search",
        "authors": "Shuli Yin, Hayaho Sato, Hajime Igarashi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmag.2023.3308214"
    },
    {
        "id": 12138,
        "title": "Elastic Monte Carlo Tree Search",
        "authors": "Linjie Xu, Alexander Dockhorn, Diego Perez-Liebana",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tg.2023.3282351"
    },
    {
        "id": 12139,
        "title": "SCAN: Socially-Aware Navigation Using Monte Carlo Tree Search",
        "authors": "Jeongwoo Oh, Jaeseok Heo, Junseo Lee, Gunmin Lee, Minjae Kang, Jeongho Park, Songhwai Oh",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160270"
    },
    {
        "id": 12140,
        "title": "A Case for Monte Carlo Tree Search in Adaptive Traffic Signal Control: Modifiability, Interpretability and Generalization",
        "authors": "Ilia Smirnov, Scott Sanner, Baher Abdulhai",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422214"
    },
    {
        "id": 12141,
        "title": "Generating High Coherence Monophonic Music Using Monte-Carlo Tree Search",
        "authors": "Xiao Fu, Hangyu Deng, Xin Yuan, Jinglu Hu",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmm.2022.3165718"
    },
    {
        "id": 12142,
        "title": "Monte Carlo tree search control scheme for multibody dynamics applications",
        "authors": "Yixuan Tang, Grzegorz Orzechowski, Aleš Prokop, Aki Mikkola",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "AbstractThere is considerable interest in applying reinforcement learning (RL) to improve machine control across multiple industries, and the automotive industry is one of the prime examples. Monte Carlo Tree Search (MCTS) has emerged and proven powerful in decision-making games, even without understanding the rules. In this study, multibody system dynamics (MSD) control is first modeled as a Markov Decision Process and solved with Monte Carlo Tree Search. Based on randomized search space exploration, the MCTS framework builds a selective search tree by repeatedly applying a Monte Carlo rollout at each child node. However, without a library of available choices, deciding among the many possibilities for agent parameters can be intimidating. In addition, the MCTS poses a significant challenge for searching due to the large branching factor. This challenge is typically overcome by appropriate parameter design, search guiding, action reduction, parallelization, and early termination. To address these shortcomings, the overarching goal of this study is to provide needed insight into inverted pendulum controls via vanilla and modified MCTS agents, respectively. A series of reward functions are well-designed according to the control goal, which maps a specific distribution shape of reward bonus and guides the MCTS-based control to maintain the upright position. Numerical examples show that the reward-modified MCTS algorithms significantly improve the control performance and robustness of the default choice of a constant reward that constitutes the vanilla MCTS. The exponentially decaying reward functions perform better than the constant value or polynomial reward functions. Moreover, the exploitation vs. exploration trade-off and discount parameters are carefully tested. The study’s results can guide the research of RL-based MSD users.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11071-024-09509-8"
    },
    {
        "id": 12143,
        "title": "MCTS-GEB: Monte Carlo Tree Search is a Good E-graph Builder",
        "authors": "Guoliang He, Zak Singh, Eiko Yoneki",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3578356.3592577"
    },
    {
        "id": 12144,
        "title": "Lazy Nested Monte Carlo Search for Coalition Structure Generation",
        "authors": "Milo Roucairol, Jérôme Arjonilla, Abdallah Saffidine, Tristan Cazenave",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012302300003636"
    },
    {
        "id": 12145,
        "title": "Collaborative Cost Multi-Agent Decision-Making Algorithm with Factored-Value Monte Carlo Tree Search and Max-Plus",
        "authors": "Nii-Emil Alexander-Reindorf, Paul Cotae",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "In this paper, we describe the Factored Value MCTS Hybrid Cost-Max-Plus algorithm, a collection of decision-making algorithms (centralized, decentralized, and hybrid) for a multi-agent system in a collaborative setting that considers action costs. Our proposed algorithm is made up of two steps. In the first step, each agent searches for the best individual actions with the lowest cost using the Monte Carlo Tree Search (MCTS) algorithm. Each agent’s most promising activities are chosen and presented to the team. The Hybrid Cost Max-Plus method is utilized for joint action selection in the second step. The Hybrid Cost Max-Plus algorithm improves the well-known centralized and distributed Max-Plus algorithm by incorporating the cost of actions in agent interactions. The Max-Plus algorithm employed the Coordination Graph framework, which exploits agent dependencies to decompose the global payoff function as the sum of local terms. In terms of the number of agents and their interactions, the suggested Factored Value MCTS-Hybrid Cost-Max-Plus method is online, anytime, distributed, and scalable. Our contribution competes with state-of-the-art methodologies and algorithms by leveraging the locality of agent interactions for planning and acting utilizing MCTS and Max-Plus algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/g14060075"
    },
    {
        "id": 12146,
        "title": "A Study of Monte Carlo Tree Search-Based Model for High Frequency Trading",
        "authors": "Yu-Yi Chuang, Yi-Cheng Liao, Chih-Hsiang Chang, Chien-Feng Huang",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlc58545.2023.10327988"
    },
    {
        "id": 12147,
        "title": "Monte-Carlo Tree Search with Prioritized Node Expansion for Multi-Goal Task Planning",
        "authors": "Kai Pfeiffer, Leonardo Edgar, Quang-Cuong Pham",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342430"
    },
    {
        "id": 12148,
        "title": "Optimal Cislunar Architecture Design Using Monte Carlo Tree Search Methods",
        "authors": "Michael Klonowski, Marcus J. Holzinger, Naomi Owens Fahrner",
        "published": "2023-6-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40295-023-00383-x"
    },
    {
        "id": 12149,
        "title": "D2D Cooperative Communication Network Resource Allocation Algorithm Based on Improved Monte Carlo Tree Search",
        "authors": "Xinzhou Li, Guifen Chen",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3280604"
    },
    {
        "id": 12150,
        "title": "Aerial Vehicle Routing and Scheduling for UAS Traffic Management: A Hybrid Monte Carlo Tree Search Approach",
        "authors": "Kenny Chour, Priyank Pradeep, Alexey A. Munishkin, Krishna M. Kalyanam",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasc58513.2023.10311314"
    },
    {
        "id": 12151,
        "title": "A New Approach in Discrete Event System by Deep Monte Carlo Tree Search",
        "authors": "Tianxiang Ou, Jianwen Cao, Yanan Lu, Yupeng Wang, Xuesong Wu",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nnice58320.2023.10105686"
    },
    {
        "id": 12152,
        "title": "Improving Performance Insensitivity of Large-Scale Multiobjective Optimization via Monte Carlo Tree Search",
        "authors": "Haokai Hong, Min Jiang, Gary G. Yen",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcyb.2023.3265652"
    },
    {
        "id": 12153,
        "title": "Decentralized Monte Carlo Tree Search for Partially Observable Multi-Agent Pathfinding",
        "authors": "Alexey Skrynnik, Anton Andreychuk, Konstantin Yakovlev, Aleksandr Panov",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "The Multi-Agent Pathfinding (MAPF) problem involves finding a set of conflict-free paths for a group of agents confined to a graph. In typical MAPF scenarios, the graph and the agents' starting and ending vertices are known beforehand, allowing the use of centralized planning algorithms. However, in this study, we focus on the decentralized MAPF setting, where the agents may observe the other agents only locally and are restricted in communications with each other. Specifically, we investigate the lifelong variant of MAPF, where new goals are continually assigned to the agents upon completion of previous ones. Drawing inspiration from the successful AlphaZero approach, we propose a decentralized multi-agent Monte Carlo Tree Search (MCTS) method for MAPF tasks. Our approach utilizes the agent's observations to recreate the intrinsic Markov decision process, which is then used for planning with a tailored for multi-agent tasks version of neural MCTS. The experimental results show that our approach outperforms state-of-the-art learnable MAPF solvers. The source code is available at https://github.com/AIRI-Institute/mats-lp.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i16.29703"
    },
    {
        "id": 12154,
        "title": "Multi-Agent Assisted Shortest Path Planning using Monte Carlo Tree Search",
        "authors": "Abhay Singh Bhadoriya, Swaroop Darbha, Sivakumar Rathinam, David Casbeer, Steven J. Rasmussen, Satyanarayana G. Manyam",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-2655"
    },
    {
        "id": 12155,
        "title": "Beyond games: a systematic review of neural Monte Carlo tree search applications",
        "authors": "Marco Kemmerling, Daniel Lütticke, Robert H. Schmitt",
        "published": "2024-1",
        "citations": 1,
        "abstract": "AbstractThe advent of AlphaGo and its successors marked the beginning of a new paradigm in playing games using artificial intelligence. This was achieved by combining Monte Carlo tree search, a planning procedure, and deep learning. While the impact on the domain of games has been undeniable, it is less clear how useful similar approaches are in applications beyond games and how they need to be adapted from the original methodology. We perform a systematic literature review of peer-reviewed articles detailing the application of neural Monte Carlo tree search methods in domains other than games. Our goal is to systematically assess how such methods are structured in practice and if their success can be extended to other domains. We find applications in a variety of domains, many distinct ways of guiding the tree search using learned policy and value functions, and various training methods. Our review maps the current landscape of algorithms in the family of neural monte carlo tree search as they are applied to practical problems, which is a first step towards a more principled way of designing such algorithms for specific problems and their requirements.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-05240-w"
    },
    {
        "id": 12156,
        "title": "Retrosynthetic planning with experience-guided Monte Carlo tree search",
        "authors": "Siqi Hong, Hankz Hankui Zhuo, Kebing Jin, Guang Shao, Zhanwen Zhou",
        "published": "2023-6-10",
        "citations": 3,
        "abstract": "AbstractIn retrosynthetic planning, the huge number of possible routes to synthesize a complex molecule using simple building blocks leads to a combinatorial explosion of possibilities. Even experienced chemists often have difficulty to select the most promising transformations. The current approaches rely on human-defined or machine-trained score functions which have limited chemical knowledge or use expensive estimation methods for guiding. Here we propose an experience-guided Monte Carlo tree search (EG-MCTS) to deal with this problem. Instead of rollout, we build an experience guidance network to learn knowledge from synthetic experiences during the search. Experiments on benchmark USPTO datasets show that, EG-MCTS gains significant improvement over state-of-the-art approaches both in efficiency and effectiveness. In a comparative experiment with the literature, our computer-generated routes mostly matched the reported routes. Routes designed for real drug compounds exhibit the effectiveness of EG-MCTS on assisting chemists performing retrosynthetic analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s42004-023-00911-8"
    },
    {
        "id": 12157,
        "title": "Multi-Agent Task Assignment and Sequencing using Monte Carlo Tree Search and Process Algebra",
        "authors": "Steven J. Rasmussen, David Casbeer, Abhay Singh Bhadoriya, Swaroop Darbha, Satyanarayana G. Manyam",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2023-1473"
    },
    {
        "id": 12158,
        "title": "Pipe Routing Design for Aero-Engine Using Monte Carlo Tree Search Method",
        "authors": "Hongbin Xu, Jiang Fan, Qingze Meng, Yuming Su",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\nPipe routing design (PRD) is a complex process that involves a large search space and requires experienced professionals. Despite advancements in aero-engine design, PRD remains a stage that is not completely automated. In this article, we present a new approach to PRD by formulating it as a Markov decision process and proposing a pipe routing design method based on Monte Carlo Tree Search (PRD-MCTS). Firstly, this paper uses an intelligent algorithm to look for enough paths for each pair of joints. Secondly, PRD-MCTS regards each path as a candidate choice, and then PRD-MCTS randomly chooses a path and calculates the probability of collision-free routing until the set time. The method selects the path with the highest probability and updates the environment for the next selection. A simplified environment from the aero engine verifies the correctness of the methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2569/1/012017"
    },
    {
        "id": 12159,
        "title": "A Monte Carlo Tree Search with Ant Colony Optimization for Inter-domain Path Computation Problem",
        "authors": "Do Tuan Anh, Phung Bao Ha, Nguyen Thai Ha, Do Tien Dzung, Ban Ha Bang, Pham Dang Hai",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3628797.3628972"
    },
    {
        "id": 12160,
        "title": "A Framework for Monte-Carlo Tree Search on CPU-FPGA Heterogeneous Platform via on-chip Dynamic Tree Management",
        "authors": "Yuan Meng, Rajgopal Kannan, Viktor Prasanna",
        "published": "2023-2-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3543622.3573177"
    },
    {
        "id": 12161,
        "title": "Monte Carlo graph search for quantum circuit optimization",
        "authors": "Bodo Rosenhahn, Tobias J. Osborne",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physreva.108.062615"
    },
    {
        "id": 12162,
        "title": "The Investment Strategy Optimization based on BL Stock Price Selection based on Arima and Time Series fitting based on Monte Carlo and Optimization Strategy",
        "authors": "Li Yuan, Xuan Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.18-11-2022.2326922"
    },
    {
        "id": 12163,
        "title": "AlphaRoute: Large-Scale Coordinated Route Planning via Monte Carlo Tree Search",
        "authors": "Guiyang Luo, Yantao Wang, Hui Zhang, Quan Yuan, Jinglin Li",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "This paper proposes AlphaRoute, an AlphaGo inspired algorithm for coordinating large-scale routes, built upon graph attention reinforcement learning and Monte Carlo Tree Search (MCTS). We first partition the road network into regions and model large-scale coordinated route planning as a Markov game, where each partitioned region is treated as a player instead of each driver. Then, AlphaRoute applies a bilevel optimization framework, consisting of several region planners and a global planner, where the region planner coordinates the route choices for vehicles located in the region and generates several strategies, and the global planner evaluates the combination of strategies. \n\tAlphaRoute is built on graph  attention network for evaluating each state  and MCTS algorithm for dynamically visiting and simulating the future state for narrowing down the search space. AlphaRoute is capable of 1) bridging user fairness and system efficiency, 2) achieving higher search efficiency by alleviating the curse of dimensionality problems, and 3) making an effective and informed route planning by simulating over the future to capture traffic dynamics. \n\tComprehensive experiments are conducted on two real-world road networks as compared with several baselines to evaluate the performance, and results show that AlphaRoute achieves the lowest travel time, and is efficient and effective for coordinating large-scale routes and alleviating the traffic congestion problem. The code will be publicly available.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i10.26422"
    },
    {
        "id": 12164,
        "title": "Demand response for residential building heating: Effective Monte Carlo Tree Search control based on physics-informed neural networks",
        "authors": "Fabio Pavirani, Gargya Gokhale, Bert Claessens, Chris Develder",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.enbuild.2024.114161"
    },
    {
        "id": 12165,
        "title": "A Monte Carlo tree search-based method for decision making of generator serial restoration sequence",
        "authors": "Wenwen Xu, Shuting Chen, Guangxin Han, Nan Yu, Han Xu",
        "published": "2023-1-12",
        "citations": 0,
        "abstract": "Reasonable generator serial restoration sequence is a key issue to the system restoration following blackouts. This paper proposed an optimization method for the decision making of generator serial restoration sequence based on Monte Carlo tree search algorithm. First, the generator serial restoration sequence mechanism during the restoration process is analyzed. Considering the maximization of the total power generation capacity as the objective function, this paper also consider generator’s hot start. Second, the Monte Carlo tree search algorithm (MCTS) is applied to decide the generator serial restoration sequence. In the simulation stage of MCTS, the Dijkstra’s algorithm is utilized to determine the shortest path between the selected generator and the recovered power system. Finally, the IEEE 39 bus system and Hebei power grid system are used to validate the proposed algorithm. Simulation results show that the proposed method is efficiency and it can provide an reasonable generator serial restoration sequence to maximizing power generation during the restoration process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fenrg.2022.1007914"
    },
    {
        "id": 12166,
        "title": "Monte Carlo Tree Search in the Presence of Transition Uncertainty",
        "authors": "Farnaz Kohankhaki, Kiarash Aghakasiri, Hongming Zhang, Ting-Han Wei, Chao Gao, Martin Müller",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Monte Carlo Tree Search (MCTS) is an immensely popular search-based framework used for decision making. It is traditionally applied to domains where a perfect simulation model of the environment is available. We study and improve MCTS in the context where the environment model is given but imperfect. We show that the discrepancy between the model and the actual environment can lead to significant performance degradation with standard MCTS. We therefore develop Uncertainty Adapted MCTS (UA-MCTS), a more robust algorithm within the MCTS framework. We estimate the transition uncertainty in the given model, and direct the search towards more certain transitions in the state space. We modify all four MCTS phases to improve the search behavior by considering these estimates. We prove, in the corrupted bandit case, that adding uncertainty information to adapt UCB leads to tighter regret bound than standard UCB. Empirically, we evaluate UA-MCTS and its individual components on the deterministic domains from the MinAtar test suite. Our results demonstrate that UA-MCTS strongly improves MCTS in the presence of model transition errors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i18.29994"
    },
    {
        "id": 12167,
        "title": "Automatic mechanistic inference from large families of Boolean models generated by Monte Carlo tree search",
        "authors": "Bryan J. Glazer, Jonathan T. Lifferth, Carlos F. Lopez",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Many important processes in biology, such as signaling and gene regulation, can be described using logic models. These logic models are typically built to behaviorally emulate experimentally observed phenotypes, which are assumed to be steady states of a biological system. Most models are built by hand and therefore researchers are only able to consider one or perhaps a few potential mechanisms. We present a method to automatically synthesize Boolean logic models with a specified set of steady states. Our method, called MC-Boomer, is based on Monte Carlo Tree Search an efficient, parallel search method using reinforcement learning. Our approach enables users to constrain the model search space using prior knowledge or biochemical interaction databases, thus leading to generation of biologically plausible mechanistic hypotheses. Our approach can generate very large numbers of data-consistent models. To help develop mechanistic insight from these models, we developed analytical tools for multi-model inference and model selection. These tools reveal the key sets of interactions that govern the behavior of the models. We demonstrate that MC-Boomer works well at reconstructing randomly generated models. Then, using single time point measurements and reasonable biological constraints, our method generates hundreds of thousands of candidate models that match experimentally validated in-vivo behaviors of the Drosophila segment polarity network. Finally we outline how our multi-model analysis procedures elucidate potentially novel biological mechanisms and provide opportunities for model-driven experimental validation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fcell.2023.1198359"
    },
    {
        "id": 12168,
        "title": "The Monte Carlo tree search based bandwidth slicing allocation algorithm",
        "authors": "Shun-Chieh Chang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03521-3"
    },
    {
        "id": 12169,
        "title": "A Monte Carlo tree search conceptual framework for feature model analyses",
        "authors": "Jose-Miguel Horcas, José A. Galindo, Ruben Heradio, David Fernandez-Amoros, David Benavides",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jss.2022.111551"
    },
    {
        "id": 12170,
        "title": "A Monte Carlo Enhanced PSO Algorithm for Optimization Design of Heliostat Field",
        "authors": "Bin Zhao*",
        "published": "2023",
        "citations": 0,
        "abstract": "Tower solar thermal power generation technology is a new low-carbon and environmentally friendly clean energy technology. In this paper, based on Monte Carlo algorithm model and particle swarm optimization PSO algorithm, the optimization model of heliostatic mirror field is constructed, which is of great practical significance for effectively improving the collection and conversion efficiency of solar energy and promoting the sustainable development of clean energy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/oajda-16000105"
    },
    {
        "id": 12171,
        "title": "De Novo Drug Design Using Transformer-Based Machine Translation and Reinforcement Learning of an Adaptive Monte Carlo Tree Search",
        "authors": "Dony Ang, Cyril Rakovski, Hagop S. Atamian",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "The discovery of novel therapeutic compounds through de novo drug design represents a critical challenge in the field of pharmaceutical research. Traditional drug discovery approaches are often resource intensive and time consuming, leading researchers to explore innovative methods that harness the power of deep learning and reinforcement learning techniques. Here, we introduce a novel drug design approach called drugAI that leverages the Encoder–Decoder Transformer architecture in tandem with Reinforcement Learning via a Monte Carlo Tree Search (RL-MCTS) to expedite the process of drug discovery while ensuring the production of valid small molecules with drug-like characteristics and strong binding affinities towards their targets. We successfully integrated the Encoder–Decoder Transformer architecture, which generates molecular structures (drugs) from scratch with the RL-MCTS, serving as a reinforcement learning framework. The RL-MCTS combines the exploitation and exploration capabilities of a Monte Carlo Tree Search with the machine translation of a transformer-based Encoder–Decoder model. This dynamic approach allows the model to iteratively refine its drug candidate generation process, ensuring that the generated molecules adhere to essential physicochemical and biological constraints and effectively bind to their targets. The results from drugAI showcase the effectiveness of the proposed approach across various benchmark datasets, demonstrating a significant improvement in both the validity and drug-likeness of the generated compounds, compared to two existing benchmark methods. Moreover, drugAI ensures that the generated molecules exhibit strong binding affinities to their respective targets. In summary, this research highlights the real-world applications of drugAI in drug discovery pipelines, potentially accelerating the identification of promising drug candidates for a wide range of diseases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ph17020161"
    },
    {
        "id": 12172,
        "title": "Offline and Online Algorithms for Cache Allocation with Monte Carlo Tree Search and a Learned Model",
        "authors": "Yibin Gu, Hua Wang, Man Luo, Jingyu Tang, Ke Zhou",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccd58817.2023.00028"
    },
    {
        "id": 12173,
        "title": "A Resource Sharing Approach for Logic Synthesis Based on Monte Carlo Tree Search",
        "authors": "Qirui Yang, Kang Zhao, Wenjian Yu, Yun Shao, Yong Xiao",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iseda59274.2023.10218521"
    },
    {
        "id": 12174,
        "title": "Temporal Logic Explanations for Dynamic Decision Systems Using Anchors and Monte Carlo Tree Search (Abstract Reprint)",
        "authors": "Tzu-Yi Chiu, Jerome Le Ny, Jean-Pierre David",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "For many automated perception and decision tasks, state-of-the-art performance may be obtained by algorithms that are too complex for their behavior to be completely understandable or predictable by human users, e.g., because they employ large machine learning models. To integrate these algorithms into safety-critical decision and control systems, it is particularly important to develop methods that can promote trust into their decisions and help explore their failure modes. In this article, we combine the anchors methodology with Monte Carlo Tree Search to provide local model-agnostic explanations for the behaviors of a given black-box model making decisions by processing time-varying input signals. Our approach searches for descriptive explanations for these decisions in the form of properties of the input signals, expressed in Signal Temporal Logic, which are highly likely to reproduce the observed behavior. To illustrate the methodology, we apply it in simulations to the analysis of a hybrid (continuous-discrete) control system and a collision avoidance system for unmanned aircraft (ACAS Xu) implemented by a neural network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i20.30594"
    },
    {
        "id": 12175,
        "title": "Validation Check of Neural Network using Monte Carlo Stochastic Optimization Method (MOST)",
        "authors": "Hana Hebishima, Sinichi Inage",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/iciae2023.033"
    },
    {
        "id": 12176,
        "title": "Interpretability of rectangle packing solutions with Monte Carlo tree search",
        "authors": "Yeray Galán López, Cristian González García, Vicente García Díaz, Edward Rolando Núñez Valdez, Alberto Gómez Gómez",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "AbstractPacking problems have been studied for a long time and have great applications in real-world scenarios. In recent times, with problems in the industrial world increasing in size, exact algorithms are often not a viable option and faster approaches are needed. We study Monte Carlo tree search, a random sampling algorithm that has gained great importance in literature in the last few years. We propose three approaches based on MCTS and its integration with metaheuristic algorithms or deep learning models to obtain approximated solutions to packing problems that are also interpretable by means of MCTS exploration and from which knowledge can be extracted. We focus on two-dimensional rectangle packing problems in our experimentation and use several well known benchmarks from literature to compare our solutions with existing approaches and offer a view on the potential uses for knowledge extraction from our method. We manage to match the quality of state-of-the-art methods, with improvements in time with respect to some of them and greater interpretability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10732-024-09525-2"
    },
    {
        "id": 12177,
        "title": "Automated Quantum Circuit Design With Nested Monte Carlo Tree Search",
        "authors": "Peiyong Wang, Muhammad Usman, Udaya Parampalli, Lloyd C. L. Hollenberg, Casey R. Myers",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tqe.2023.3265709"
    },
    {
        "id": 12178,
        "title": "A double Actor-Critic learning system embedding improved Monte Carlo tree search",
        "authors": "Hongjun Zhu, Yong Xie, Suijun Zheng",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-024-09513-4"
    },
    {
        "id": 12179,
        "title": "Temporal logic explanations for dynamic decision systems using anchors and Monte Carlo Tree Search",
        "authors": "Tzu-Yi Chiu, Jerome Le Ny, Jean-Pierre David",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.artint.2023.103897"
    },
    {
        "id": 12180,
        "title": "A Parallel Monte-Carlo Tree Search-Based Metaheuristic For Optimal Fleet Composition Considering Vehicle Routing Using Branch &amp; Bound",
        "authors": "T. M. J. T. Baltussen, M. Goutham, M. Menon, S. G. Garrow, M. Santillo, S. Stockar",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iv55152.2023.10186562"
    },
    {
        "id": 12181,
        "title": "Surrogate-assisted Monte Carlo Tree Search for real-time video games",
        "authors": "Man-Je Kim, Donghyeon Lee, Jun Suk Kim, Chang Wook Ahn",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108152"
    },
    {
        "id": 12182,
        "title": "Exploring the first-move balance point of Go-Moku based on reinforcement learning and Monte Carlo tree search",
        "authors": "Pengsen Liu, Jizhe Zhou, Jiancheng Lv",
        "published": "2023-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2022.110207"
    },
    {
        "id": 12183,
        "title": "Multi-cloud service provision based on decision tree and two-layer Restricted Monte Carlo Tree Search",
        "authors": "Wenjuan Li, Jian Cao, Bin Zhou, Shuiguang Deng, Qifei Zhang, Keyong Hu, Jing Li, Haili Zhao",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iot.2023.100751"
    },
    {
        "id": 12184,
        "title": "Penerapan Non-Deterministic Finite Automata (NFA) dan Decision Making Menggunakan Algoritma Monte Carlo Tree Search (MCTS) Menentukan Perilaku Non-Player Character (NPC) Pada Game The Last Hope",
        "authors": "Revie Danial Pramadya",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "Perkembangan game juga berkembang pesat di Indonesia, banyak game baru yang tersebar di industri game. Para desainer game berlomba-lomba membuat game-game terbaru karena melihat peluang yang dihadirkan oleh banyaknya pengguna ponsel yang terbiasa bermain game.\r\nPembuatan game ini dilakukan menggunakan software Unity 2D, menggunakan bahasa C# (C Sharp) dan berjalan di android dengan bergenre roguelike. Permodelan Non-deterministic Finite Automata (NFA) digunakan untuk mengatur pergerakan NPC Boss.\r\nDalam game ini pemain akan menyelesai sebuah stage dimana di dalam stage terdapat beberapa musuh, Ketika selesai menyelesaikan satu stage, stage berikut nya akan muncul Kembali dengan musuh yang lebih banyak hingga stage terakhir, untuk menambahkan keseruan di stage terakhir terdapat Boss untuk dikalahkan. Tujuan penelitian ini ingin menerapkan NFA pada NPC Boss untuk mengatur pergerakannya sehingga permainan akan semakin menantang dan ingin membuktikan apakah algoritma Monte Carlo Tree Search (MCTS) yang sering digunakan pada game turn-base ini bisa digunakan pada game yang real-time dengan genre roguelike.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37859/coscitech.v4i2.5419"
    },
    {
        "id": 12185,
        "title": "Validation Check of Optimization Method using Monte Carlo Method for Multi-objective Function",
        "authors": "Shinichi Inage, Chikako Dozono, Mina Arakaki, Hana Hebishima",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12792/iciae2023.052"
    },
    {
        "id": 12186,
        "title": "Correlated Atmospheric Variations Using Optimization of Dft Parameters for Monte Carlo Simulations Of Indian Space Missionscorrelated Atmospheric Variations Using Optimization of Dft Parameters for Monte Carlo Simulations Of Indian Space Missions",
        "authors": " S. Balamurugan,  V. Adimurthy,  V. Ashok",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "In space systems, atmospheric parameters are required for launch vehicle trajectory design and simulations, aerodynamic load characterization, Monte Carlo trajectory dispersion studies, re-entry of spent stages, safe recovery of reusable stages, etc. A need is felt to modify existing models over the Indian region to assimilate appropriate atmospheric dispersions. The correlated connectivity of the atmospheric profiles measured over various altitude regimes has to be ensured. A new methodology to generate any required number of atmospheric profiles is carried out in this paper. The dynamic processes of the lower and upper atmosphere are markedly different, leading to different mathematical models to generate the respective profiles. For the generation of lower altitude temperature profiles, Discrete Fourier Transform strategy is utilized; and for upper altitudes, Cumulative Distribution Function is used. Corresponding pressure and density profiles are generated using hypsometric equations. The variations in the atmospheric temperature profiles at different frequencies need to be captured to ascertain correct parameter bounds, particularly for density profiles. To generate any number of Monte Carlo atmospheric profiles replicating the observed variation and dispersion bounds in all frequency bands, a unique evolutionary optimization methodology is devised to ensure the required balance between convergence and diversification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61653/joast.v73i4.2021.103"
    },
    {
        "id": 12187,
        "title": "A self-learning Monte Carlo tree search algorithm for robot path planning",
        "authors": "Wei Li, Yi Liu, Yan Ma, Kang Xu, Jiang Qiu, Zhongxue Gan",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "This paper proposes a self-learning Monte Carlo tree search algorithm (SL-MCTS), which has the ability to continuously improve its problem-solving ability in single-player scenarios. SL-MCTS combines the MCTS algorithm with a two-branch neural network (PV-Network). The MCTS architecture can balance the search for exploration and exploitation. PV-Network replaces the rollout process of MCTS and predicts the promising search direction and the value of nodes, which increases the MCTS convergence speed and search efficiency. The paper proposes an effective method to assess the trajectory of the current model during the self-learning process by comparing the performance of the current model with that of its best-performing historical model. Additionally, this method can encourage SL-MCTS to generate optimal solutions during the self-learning process. We evaluate the performance of SL-MCTS on the robot path planning scenario. The experimental results show that the performance of SL-MCTS is far superior to the traditional MCTS and single-player MCTS algorithms in terms of path quality and time consumption, especially its time consumption is half less than that of the traditional MCTS algorithms. SL-MCTS also performs comparably to other iterative-based search algorithms designed specifically for path planning tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnbot.2023.1039644"
    },
    {
        "id": 12188,
        "title": "NeuroEscape: Ordered Escape Routing via Monte-Carlo Tree Search and Neural Network",
        "authors": "Zhiyang Chen, Tsung-Yi Ho, Ulf Schlichtmann, Datao Chen, Mingyu Liu, Hailong Yao, Xia Yin",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccad57390.2023.10323718"
    },
    {
        "id": 12189,
        "title": "Adaptive multilevel Monte Carlo for risk averse optimization",
        "authors": "F. Nobile",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/admos.2023.081"
    },
    {
        "id": 12190,
        "title": "Application of quasi-Monte Carlo and importance sampling to Monte Carlo-based fault tree quantification for seismic probabilistic risk assessment of nuclear power plants",
        "authors": "Kotaro KUBO, Yoichi TANAKA, Yuto HAKUTA, Daisuke ARAKE, Tomoaki UCHIYAMA, Ken MURAMATSU",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1299/mej.23-00051"
    },
    {
        "id": 12191,
        "title": "Planning spatial networks with Monte Carlo tree search",
        "authors": "Victor-Alexandru Darvariu, Stephen Hailes, Mirco Musolesi",
        "published": "2023-1",
        "citations": 1,
        "abstract": "We tackle the problem of goal-directed graph construction: given a starting graph, finding a set of edges whose addition maximally improves a global objective function. This problem emerges in many transportation and infrastructure networks that are of critical importance to society. We identify two significant shortcomings of present reinforcement learning methods: their exclusive focus on topology to the detriment of spatial characteristics (which are known to influence the growth and density of links), as well as the rapid growth in the action spaces and costs of model training. Our formulation as a deterministic Markov decision process allows us to adopt the Monte Carlo tree search framework, an artificial intelligence decision-time planning method. We propose improvements over the standard upper confidence bounds for trees (UCT) algorithm for this family of problems that addresses their single-agent nature, the trade-off between the cost of edges and their contribution to the objective, and an action space linear in the number of nodes. Our approach yields substantial improvements over UCT for increasing the efficiency and attack resilience of synthetic networks and real-world Internet backbone and metro systems, while using a wall clock time budget similar to other search-based algorithms. We also demonstrate that our approach scales to significantly larger networks than previous reinforcement learning methods, since it does not require training a model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1098/rspa.2022.0383"
    },
    {
        "id": 12192,
        "title": "Real-Time Adaptive Energy Management for Hybrid Electric Vehicles Based on Monte Carlo Tree Search",
        "authors": "Ningkang Yang, Lijin Han, Shumin Ruan, Wannian Zhang, Hui Liu, Changle Xiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tte.2023.3305520"
    },
    {
        "id": 12193,
        "title": "Multi-Objective Automatic Design of Permanent Magnet Motor Using Monte Carlo Tree Search",
        "authors": "Hayaho Sato, Hajime Igarashi",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmag.2023.3254510"
    },
    {
        "id": 12194,
        "title": "Option Pricing Based on Black-Scholes Model, Monte Carlo Method and Binomial Tree Model",
        "authors": "Yutong Xiao",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "Contemporarily, option is one of the widely implemented underlying assets to hedge the risk of portfolio and satisfy certain trading motivation for investors. To obtain extra return based on investment, it is crucial to utilize and apply an accuracy and suitable tool to price option. On this basis, this study focused on comparing and applying different model to achieve the goal of option pricing. To be specific, the Python code was used to help make calculations and list the results, with three functions to price options with three diverse methods. This paper chose Alphabet Inc., Amazon, Meta Platforms, Spotify, Sunrun, and Tesla, Inc. and priced the options using the historical market data from July 20, 2022, to October 20, 2022. Reasonable results for each option are achieved with differences between each method, offering price ranges for the options. These results offer a guideline for applying different methods to option pricing and compare the effectiveness of the three methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.4315"
    },
    {
        "id": 12195,
        "title": "Hypothesis selection with Monte Carlo tree search for feature-based simultaneous localization and mapping in non-static environments",
        "authors": "Kristin Nielsen, Gustaf Hendeby",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": " A static world assumption is often used when considering the simultaneous localization and mapping (SLAM) problem. In reality, especially when long-term autonomy is the objective, this is not a valid assumption. This paper studies a scenario where landmarks can occupy multiple discrete positions at different points in time, where each possible position is added to a multi-hypothesis map representation. A selector-mixture distribution is introduced and used in the observation model. Each landmark position hypothesis is associated with one component in the mixture. The landmark movements are modeled by a discrete Markov chain and the Monte Carlo tree search algorithm is suggested to be used as component selector. The non-static environment model is further incorporated into the factor graph formulation of the SLAM problem and is solved by iterating between estimating discrete variables with a component selector and optimizing continuous variables with an efficient state-of-the-art nonlinear least squares SLAM solver. The proposed non-static SLAM system is validated in numerical simulation and with a publicly available dataset by showing that a non-static environment can successfully be navigated. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/02783649231215095"
    },
    {
        "id": 12196,
        "title": "Resampling Strategy in Sequential Monte Carlo for Constrained Sampling Problems",
        "authors": "Chencheng Cai, Rong Chen, Ming Lin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0185"
    },
    {
        "id": 12197,
        "title": "Optimization design for slip/no-slip configuration of hydrophobic sliding bearings using Monte Carlo search",
        "authors": "Wenxin Zhang, Bao Zhu",
        "published": "2023-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.triboint.2022.108034"
    },
    {
        "id": 12198,
        "title": "A Monte Carlo Sampling Strategy for the Automated Operational Modal Analysis of Road Bridges",
        "authors": "M. Civera, B. Chiaia",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/latam.2024.046"
    },
    {
        "id": 12199,
        "title": "A Monte Carlo Sampling Strategy for the Automated Operational Modal Analysis of Road Bridges",
        "authors": "M. Civera, B. Chiaia",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23967/latam.2023.046"
    },
    {
        "id": 12200,
        "title": "State Space Emulation and Annealed Sequential Monte Carlo for High Dimensional Optimization",
        "authors": "Chencheng Cai, Rong Chen",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0120"
    },
    {
        "id": 12201,
        "title": "Optimization of the redundancy allocation problem: Genetic algorithm and Monte Carlo simulation with discrete events",
        "authors": "Merve UZUNER ŞAHİN, Orhan DENGİZ, Berna DENGİZ",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "Sistem güvenilirliği, iletişim ve elektronik sistemler gibi ileri teknolojiye sahip modern mühendislik sistemlerinin tasarımı ve analizinde yaygın olarak kullanılan önemli ölçütlerden biridir. Günlük hayatımıza giren, çoğu çalışma alanında ve sosyal yaşamda kullandığımız uygulamaları doğrudan etkileyen altyapı tasarım problemlerinin bir kısmı güvenilirlik ölçütünü dikkate alan eniyileme problemi olarak tanımlanmaktadır. Bu nedenle bu tür problemlerin çözümü, farklı disiplinlerde çalışan birçok araştırmacının yoğun ilgisini çekmektedir. Sistem güvenilirliğinin eniyilenmesi için alan yazında yaygın olarak kullanılan Yedek Bileşen Tahsis Problemi (YBTP), sistemde yer alan bileşenlere paralel olarak yerleştirilen kullanıma hazır bileşenler ile yeni sistemlerin tasarlanması olarak tanımlanabilir.  Böylece, güvenilirlik başarım ölçütü dikkate alınarak daha yüksek güvenilirlik değerine sahip sistem tasarımlarının elde edilmesi sağlanabilmektedir. Sistem özelliklerine bağlı olarak seçilen uygun yöntemle sistemin güvenilirlik değeri elde edilir. Bu çalışmada, artan arıza ve tamir oranlarının dikkate alındığı YBTP’de sistem güvenilirliğini gerçekçi bir yaklaşımla tahmin etmek için Kesikli Olaylı Benzetim (KOB) modeli, sistemin eniyilenmesi için ise Genetik Algoritma (GA) geliştirilmiştir. KOB modelinin geçerliliği test problemleri üzerinde gösterilmiştir. Önerilen yaklaşımla, YBTP için daha yüksek güvenilirliğe sahip sistem tasarımlarının daha düşük maliyetlerle elde edilebilmesi sağlanmıştır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17341/gazimmfd.1107901"
    },
    {
        "id": 12202,
        "title": "Maximal coverage problems with routing constraints using cross-entropy Monte Carlo tree search",
        "authors": "Pao-Te Lin, Kuo-Shih Tseng",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10514-024-10156-6"
    },
    {
        "id": 12203,
        "title": "Correction: Accelerating copolymer inverse design using monte carlo tree search",
        "authors": "Tarak K. Patra, Troy D. Loeffler, Subramanian K. R. S. Sankaranarayanan",
        "published": "2023",
        "citations": 0,
        "abstract": "Correction for ‘Accelerating copolymer inverse design using monte carlo tree search’ by Tarak K. Patra et al., Nanoscale, 2020, 12, 23653–23662, https://doi.org/10.1039/D0NR06091G.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1039/d3nr90182c"
    },
    {
        "id": 12204,
        "title": "Portfolio Optimization by Monte Carlo Simulation",
        "authors": "Ankang Li",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "In this paper, Monte Carlo simulation is used for constructing Efficient Frontier and optimizing the portfolio. Then the performance of the optimized portfolio had been evaluated and compared to the performance of the whole market, Firstly, this study collected the closing prices of five stocks in different industries that was listed in New York stock exchange between 2023/01/01 and 2023/04/12. Secondly, to testify if the construction of the portfolio can possibly mitigate the volatility, the correlation coefficient between these chosen stocks has been calculated. Then, Monte Carlo simulation has been used to construct the Efficient Frontier and find the weights of Maximum Sharpe Ratio portfolio and Minimum Variance portfolio. Lastly, this study put the market price data between 2023/03/12 and 2023/04/12 into the portfolios which had been built in the last step. The returns were compared to the S&P 500 subsequently. As the results shows, the Maximum Sharpe Ratio portfolio is performed better than S&P 500, Minimum Variance portfolio is performed worse than S&P 500. The results of this paper show the performance of these two portfolios compare to the market, which may help investors to decide which strategy to use when it comes to constructing a portfolio.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/50/20230568"
    },
    {
        "id": 12205,
        "title": "Consistency of Monte Carlo Estimators for Risk-Neutral PDE-Constrained Optimization",
        "authors": "Johannes Milz",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00245-023-09967-3"
    },
    {
        "id": 12206,
        "title": "Monte Carlo Simulation-Based Regression Tree Algorithm for Predicting Energy Consumption from Scarce Dataset",
        "authors": "Tony Darmanto, Jimmy Tjen, Genrawan Hoendarto",
        "published": "2024",
        "citations": 0,
        "abstract": "Most data-driven techniques rely on the availability of data. Hence, when the data provided is not sufficient, the algorithm might not work as intended. Thus, it is important to be able to predict the dynamics of the data, even when the number of available data is low, or scarce. This study aimed to predict the power consumption of a building given a scarce dataset via a novel Monte Carlo simulation-based Regression Tree (MCRT) algorithm. The main idea is to train Monte Carlo simulation on each leaf generated by the regression tree algorithm. Thus, the prediction no longer depends on the average of the samples contained in the leaf, but now depends on the probability of the samples. The proposed algorithm was validated on 2 datasets obtained from Universitas Widya Dharma Pontianak (UWDP), Indonesia and Trapeznikov Institute of Control Sciences (TICS), Russia. To show that the MCRT algorithm is better than the RT algorithm a two-tail hypothesis was proposed. Based on the experiments which were run on Python software with 16 GB RAM, 7th Gen Core i7 machine on 50 datasets randomly generated from the UWDP electrical data, it can be concluded that the MCRT algorithm performs better than the previous RT algorithm used to model scarce datasets with P-value = 0.000319.  Furthermore, the proposed algorithm improves the model predictive accuracy of the RT algorithm by up to 2%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47852/bonviewjdsis42022395"
    },
    {
        "id": 12207,
        "title": "Method for control drum position critical search with Monte Carlo codes",
        "authors": "Dean Price, Nathan Roskoff",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.pnucene.2023.104731"
    },
    {
        "id": 12208,
        "title": "Pipeline Risk Analysis Optimization with Monte Carlo Method Using Gamma Distribution",
        "authors": "",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7454/jmef.v2i3.1041"
    },
    {
        "id": 12209,
        "title": "Research on the investment strategy of hydrogen refueling stations based on Monte Carlo simulation",
        "authors": "Xungang Chen, Jinxun Yao",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icems59686.2023.10345226"
    },
    {
        "id": 12210,
        "title": "SwISS: A scalable Markov chain Monte Carlo divide‐and‐conquer strategy",
        "authors": "Callum Vyner, Christopher Nemeth, Chris Sherlock",
        "published": "2023-1",
        "citations": 1,
        "abstract": "Divide‐and‐conquer strategies for Monte Carlo algorithms are an increasingly popular approach to making Bayesian inference scalable to large data sets. In its simplest form, the data are partitioned across multiple computing cores and a separate Markov chain Monte Carlo algorithm on each core targets the associated partial posterior distribution, which we refer to as a sub‐posterior, that is, the posterior given only the data from the segment of the partition associated with that core. Divide‐and‐conquer techniques reduce computational, memory and disk bottle necks but make it difficult to recombine the sub‐posterior samples. We propose SwISS: Sub‐posteriors with Inflation, Scaling and Shifting; a new approach for recombining the sub‐posterior samples, which is simple to apply, scales to high‐dimensional parameter spaces and accurately approximates the original posterior distribution through affine transformations of the sub‐posterior samples. We prove that our transformation is asymptotically optimal across a natural set of affine transformations and illustrate the efficacy of SwISS against competing algorithms on synthetic and real‐world data sets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/sta4.523"
    },
    {
        "id": 12211,
        "title": "Monte Carlo tree search algorithms for risk-aware and multi-objective reinforcement learning",
        "authors": "Conor F. Hayes, Mathieu Reymond, Diederik M. Roijers, Enda Howley, Patrick Mannion",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractIn many risk-aware and multi-objective reinforcement learning settings, the utility of the user is derived from a single execution of a policy. In these settings, making decisions based on the average future returns is not suitable. For example, in a medical setting a patient may only have one opportunity to treat their illness. Making decisions using just the expected future returns–known in reinforcement learning as the value–cannot account for the potential range of adverse or positive outcomes a decision may have. Therefore, we should use the distribution over expected future returns differently to represent the critical information that the agent requires at decision time by taking both the future and accrued returns into consideration. In this paper, we propose two novel Monte Carlo tree search algorithms. Firstly, we present a Monte Carlo tree search algorithm that can compute policies for nonlinear utility functions (NLU-MCTS) by optimising the utility of the different possible returns attainable from individual policy executions, resulting in good policies for both risk-aware and multi-objective settings. Secondly, we propose a distributional Monte Carlo tree search algorithm (DMCTS) which extends NLU-MCTS. DMCTS computes an approximate posterior distribution over the utility of the returns, and utilises Thompson sampling during planning to compute policies in risk-aware and multi-objective settings. Both algorithms outperform the state-of-the-art in multi-objective reinforcement learning for the expected utility of the returns.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10458-022-09596-0"
    },
    {
        "id": 12212,
        "title": "A policy-based Monte Carlo tree search method for container pre-marshalling",
        "authors": "Ziliang Wang, Chenhao Zhou, Ada Che, Jingkun Gao",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/00207543.2023.2279130"
    },
    {
        "id": 12213,
        "title": "Investigating Hamiltonian Monte Carlo for Real-time Network Traffic Prediction",
        "authors": "Pavan Chaudhary, Sandeep Kumar Jain, A Rengarajan",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470670"
    },
    {
        "id": 12214,
        "title": "A new tolerance allocation approach based on decision tree and Monte Carlo simulation",
        "authors": "Lazhar Homri, Mohammad R. Mirafzal, Jean-Yves Dantan",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cirp.2023.03.017"
    },
    {
        "id": 12215,
        "title": "SISTEM PREDIKSI PENJUALAN MENGGUNAKAN KOMBINASI METODE MONTE CARLO DAN DECISION TREE BERBASIS WEBSITE",
        "authors": "Natasya Berliana Arifin Berliana Arifin, Asmianto Asmianto",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Perdagangan merupakan salah satu sektor yang berkontribusi besar bagi pertumbuhan ekonomi nasional. Namun kurangnya pemahaman mengenai strategi pemasaran menyebabkan tidak sedikit pedagang yang mengalami kerugian. Perkembangan teknologi informasi dan komunikasi yang pesat menyesuaikan dengan kegiatan manusia yang semakin modern. Berbagai permasalahan yang kompleks dapat dimodelkan dan disimulasikan terlebih dahulu sebelum diimplementasikan sehingga didapat hasil yang optimal. Salah satu strategi mencapai target penjualan adalah mempersiapkan stok barang, hal ini dilakukan untuk menghindari terjadinya kekurangan ataupun kelebihan stok. Dalam mempersiapkan stok barang nilai prediksi dapat dijadikan sebagai acuan untuk menentukan penjualan selanjutnya. Metode Monte Carlo dan Decision Tree adalah adalah dua metode yang dapat digunakan untuk melakukan prediksi, kedua metode ini juga sudah terbukti berhasil dalam menentukan prediksi. Secara umum pembuatan sistem prediksi ini terdiri dari beberapa langkah, diantanya: pengumpulan data, perhitungan prediksi menggunakan kombinasi metode Monte Carlo dan Decision Tree, menghitung tingkat akurasi prediksi, membangun sistem prediksi berbasis website, dan melakukan evaluasi dan pengembangan sistem. Penggunaan sistem prediksi sudah banyak dilakukan dan terbukti hasil akurasinya yang tinggi. Hasil prediksi penjualan yang didapatkan dari proses simulasi pada sistem prediksi berbasis website menggunakan kombinasi metode Monte Carlo dan Decision Tree yang dikembangkan dengan metode waterfall untuk tahun penjualan 2017, 2020,, dan 2021 memiliki tingkat akurasi MAPE pada range 93,7%-94,8% dan berdasarkan Confusion Matrix presentasi akurasi pada range 83%-100%. Dengan demikian, sistem prediksi berbasis website ini dapat diterapkan untuk memprediksi penjualan pada masa yang akan datang dan dapat dimanfaatkan oleh para pedagang untuk mengambil keputusan yang terbaik dalam mempersiapkan stok barang.\r\nKata Kunci: Prediksi, Monte Carlo, Decision Tree, Waterfall, Website.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26740/mathunesa.v11n2.p274-286"
    },
    {
        "id": 12216,
        "title": "Reliability analysis of wind power gearbox based on fault tree and monte carlo simulation",
        "authors": "Lin Chen",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Abstract\nThe gearbox is an important speed-up component in wind turbine, and the environment in which wind turbine operates is generally harsh. For maintenance and replacement of the gearbox and its difficult operation, it is self-evident that it is important to ensure its reliable operation. Through collecting and analyzing the structural and functional principle of the gearbox and data of common failure modes, the fault tree of the gearbox is established, and failure rate data and corresponding distribution are obtained by manual and data inquiry for each bottom event. Combining Monte Carlo simulation, the reliability curves of each bottom event mode of the gearbox, the gearbox, and important components are solved, and the assumptions of improving the important bottom events are made. By comparing the curves with the previous ones, it is proved that the improvement of important components can effectively improve the system’s reliability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2584/1/012102"
    },
    {
        "id": 12217,
        "title": "Optimization of financial market risk prediction system based on computer data simulation and Markov chain Monte Carlo",
        "authors": "Zhang Yuanfang",
        "published": "2023-5-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08370-y"
    },
    {
        "id": 12218,
        "title": "Exploration of Profitability in Rotational Trading Strategy Based on Monte Carlo Simulation",
        "authors": "Yingjie Wu",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Rotational trading strategy is an active trading strategy that adjusts positions to manage risk based on Value at Risk (VaR) in quantitative investment. Unpredictable and unusual Black Swan events make it difficult to predict and effectively mitigate the risks associated with such events. The importance of rational and efficient risk management has been highlighted by events such as the US-China trade war starting in 2018, the global spread of the COVID-19 pandemic from 2019 to 2022, stock market circuit breakers, and the oil crash in the Oil Fund. In this paper, we start from the perspective of VaR backtesting, count the occurrences of abnormal losses within a statistical interval, and establish a risk avoidance model for rotational trading to identify potential market risks and reallocate assets at suitable times. The aim of this paper is to explore whether this rotational trading strategy based on Monte Carlo simulation can effectively manage risks and achieve robust profitability in the US market under a volatile financial environment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/66/20241246"
    },
    {
        "id": 12219,
        "title": "Least Squares Monte Carlo and Pathwise Optimization for Merchant Energy Production",
        "authors": "Bo Yang, Selvaprabu Nadarajah, Nicola Secomandi",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "Modeling as real options the operations of energy production companies that operate in wholesale markets gives rise to a challenging Markov decision process. In “Least Squares Monte Carlo and Pathwise Optimization for Merchant Energy Production,” Yang, Nadarajah, and Secomandi study the performance of two reinforcement learning techniques that can be used to determine feasible operating policies and optimality bounds for this model, namely least squares Monte Carlo and pathwise optimization, extending the applicability of the latter method beyond optimal stopping by using principal component analysis and block coordinate descent. They find that both approaches lead to near optimal policies, but pathwise optimization outperforms least squares Monte Carlo in terms of dual bounds at the expense of more sizable computational requirements. These findings have potential relevance for managers of energy production assets that use analytics to optimize their operations and researchers interested in broadening the scope of pathwise optimization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/opre.2018.0341"
    },
    {
        "id": 12220,
        "title": "Parallelized Monte Carlo Optimization With GPU for Real-time Ballistic Target Tracking",
        "authors": "Juhyeon Park, Minjoon Lee, Heoncheol Lee, Yeji Hwang, Wonseok Choi, Bora Jeong",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5302/j.icros.2023.23.0061"
    },
    {
        "id": 12221,
        "title": "Quantum Architecture Search for Quantum Monte Carlo Integration via Conditional Parameterized Circuits with Application to Finance",
        "authors": "Mark-Oliver Wolf, Tom Ewen, Ivica Turkalj",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00070"
    },
    {
        "id": 12222,
        "title": "Hardware implementation of Monte Carlo and RSM method for the optimization of cutting force during turning of NiTi shape memory alloy",
        "authors": "M. KOWALCZYK",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Abstract. This study was conducted to understand the exact turning of the NiTi shape memory alloy and consisted of four stages: experimental work, function modelling using RSM method, Monte Carlo method optimization and hardware implementation of Monte Carlo method . This article has the following main objectives: to develop a framework for solving machining optimization problems using the Monte Carlo method and hardware implementation of MC method. The solutions presented in this paper are important from the point of view of practical solutions related to the prediction and optimization of the cutting forces components Fc, Fp and Ff  during turning of NiTi shape memory alloy. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21741/9781644902479-138"
    },
    {
        "id": 12223,
        "title": "Research on the Fault Tree Analysis of Aeroengine High- Energy Debris Intolerance Based on the Monte Carlo",
        "authors": "Fang Guo, Huiyun Yang, Jiawei Liu, Haitao Ren",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmiii58949.2023.00047"
    },
    {
        "id": 12224,
        "title": "Portfolio Optimization Based on Markowitz Investment Theory and Monte Carlo Simulation",
        "authors": "Senfan Ding",
        "published": "2024",
        "citations": 0,
        "abstract": "In the current global economic recovery, the market still has a certain degree of volatility, in the case of volatility or bad market how to go to the portfolio and optimize it is a very critical task. In this paper, based on Markowitz’s investment theory, Monte Carlo algorithm is applied to achieve portfolio optimization, which is verified by the dataset of five A-share data selected as a representative dataset in the period of global epidemic. For the model and the algorithm, good results are achieved for the objective market, and the market conditions are successfully represented; for the portfolio optimization, the high-risk and highreturn portfolio with the highest Sharpe ratio is finally found, and compared with the portfolio with minimized risk, and the portfolio with the highest Sharpe ratio is concluded as the optimal portfolio for this experiment, which is the optimal portfolio for this experiment, and should not be pursued for low risk but will be the best portfolio for this experiment in the turbulent and downturn market. In a volatile and depressed market, it should not be pursued for low risk but will result in a loss of return, and it should be maximized with a certain degree of volatility.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/shsconf/202418801009"
    },
    {
        "id": 12225,
        "title": "Multilevel quasi-Monte Carlo for optimization under uncertainty",
        "authors": "Philipp A. Guth, Andreas Van Barel",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00211-023-01364-w"
    },
    {
        "id": 12226,
        "title": "Design Optimization of a Wafer Dough Blade Using Artificial Neural Network and Monte-Carlo Simulation",
        "authors": "Murat MAYDA, Mesut BİTKİN",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "In this work, a systematic method to conduct the surrogate-based design optimization is proposed by utilizing Artificial Neural Network and Monte Carlo Simulation. To show its applicability, the design optimization of a wafer dough blade that is an important component in the food industry is carried out. In the optimization problem, design variables or inputs are totally six variables including distances, diameter and thickness, and design responses or outputs are the blade mass, the maximum stress occurred on it, and its surface area. When the results of the initial and optimum designs are compared, there is a significant decrease in the maximum stress (nearly 66%) whereas there was a reasonable low difference in both the mass and surface area. Thanks to the proposed method, it can be possible to take into account the experimental data instead of analytical data in a design problem. Moreover, the followed method provides engineers with a practical and systematic way to find the optimum solution for even nonlinear problems needs to be solved during engineering design process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5755/j02.mech.32249"
    },
    {
        "id": 12227,
        "title": "How Trustworthy Is Your Tree? Bayesian Phylogenetic Effective Sample Size Through the Lens of Monte Carlo Error",
        "authors": "Andrew Magee, Michael Karcher, Frederick A. Matsen IV, Volodymyr M. Minin",
        "published": "2024-6-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/22-ba1339"
    },
    {
        "id": 12228,
        "title": "Monte Carlo and Optimization Hybrid Methodology for Improving Workspace Modeling of Planar Manipulators",
        "authors": "Huige Chen, Shuangling Wang, Yi Cao",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isrimt59937.2023.10428482"
    },
    {
        "id": 12229,
        "title": "AMPL Based Optimization Tool for Reliability Assessment of Multi-Terminal HVDC Networks Using the Monte Carlo Method",
        "authors": "Manuel Valois-Rodriguez, Lothar Löwer",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gtd49768.2023.00042"
    },
    {
        "id": 12230,
        "title": "A Monte Carlo strategy to simulate positrons and positronium in biological materials",
        "authors": "Malgorzata Franz, Jan Franz",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "We present an algorithm for Monte Carlo simulations of positron tracks in biological materials. The algorithm takes into account the cross-section data for elastic and inelastic collisions between positrons and molecules and processes like direct annihilation, ionization and positronium formation. In the case of positronium formation, the algorithm considers the interactions of positronium with molecules. The algorithm can be used to identify the processes that are responsible to determine the lifetime of the positrons and their annihilation mechanism (direct or through positronium formation).",
        "keywords": "",
        "link": "http://dx.doi.org/10.5604/01.3001.0054.1822"
    },
    {
        "id": 12231,
        "title": "Multilevel Monte Carlo EM scheme for MV-SDEs with small noise",
        "authors": "Ulises Botija-Munoz, Chenggui Yuan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/naco.2024013"
    },
    {
        "id": 12232,
        "title": "Monte Carlo Thought Search: Large Language Model Querying for Complex Scientific Reasoning in Catalyst Design",
        "authors": "Henry Sprueill, Carl Edwards, Mariefel Olarte, Udishnu Sanyal, Heng Ji, Sutanay Choudhury",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.560"
    },
    {
        "id": 12233,
        "title": "A NOVEL HYBRID HARMONY SEARCH (HS) WITH WAR STRATEGY OPTIMIZATION (WSO) FOR SOLVING OPTIMIZATION PROBLEMS",
        "authors": "Sameerah Khaleel",
        "published": "2024-1-27",
        "citations": 0,
        "abstract": "The usage of nature-inspired meta-heuristic algorithms is increasing due to their simplicity and versatility. These algorithms are widely used in numerous domains, especially in scientific fields such as operations research, computer science, artificial intelligence, and mathematics. Based on the core principles of exploration and exploitation, they provide flexible problem-solving abilities. This study presents a novel method to improve the effectiveness of the War Strategy Optimization (WSO) algorithm for optimization issues. The suggested approach combines the WSO technique with the Harmony Search (HS) algorithm, resulting in a hybrid algorithm called H-WSO. The aim is to enhance the overall optimization performance by leveraging the capabilities of both algorithms through the integration of swarm intelligence approaches.      In order to assess the effectiveness of the recently suggested H-WSO algorithm, a set of experiments was carried out on 50 benchmark test functions. These functions included both unimodal and multimodal functions and spanned across different dimensions. The findings from these studies clearly showed a notable enhancement in the efficiency of the H-WSO algorithm when compared to the original WSO algorithm. Various metrics were utilized to evaluate the effectiveness of the proposed algorithm, including the optimal fitness function value (Mean), Standard Deviation (St.d), and Median. The H-WSO algorithm regularly shows higher efficiency than the WSO algorithm, making it a promising and practical approach for addressing complicated optimization challenges",
        "keywords": "",
        "link": "http://dx.doi.org/10.26782/jmcms.2024.01.00003"
    },
    {
        "id": 12234,
        "title": "Predictive equivalent consumption minimization strategy for power-split hybrid electric vehicles using Monte Carlo algorithm",
        "authors": "Merve Nur GÜL, Ozan YAZAR, Serdar COŞKUN, Fengqi ZHANG, Lin Lİ, İrem ERSÖZ KAYA",
        "published": "2023-1-6",
        "citations": 1,
        "abstract": "Bu çalışma, güç paylaşımlı bir hibrit elektrikli araç (HEA) için, Monte Carlo (MC) algoritmasına dayalı olarak tahmin edilen sürüş çevrimi hızlarını kullanan öngörülü eşdeğer tüketim minimizasyonu stratejisi (Ö-ETMS) önermektedir. Önerilen Ö-ETMS, enerji kaynakları arasındaki güç dağılımını en iyi şekilde belirlemek için MC algoritması tarafından tahmin edilen hız profillerinden tam olarak yararlanmaktadır. Bu çalışmada; MC tabanlı Ö-ETMS metodunu doğrulamak için, New European Driving Cycle (NEDC), Worldwide Harmonised Light Vehicles Test Procedure (WLTP), Urban Dynamometer Driving Schedule (UDDS), Highway Fuel Economy Test (HWFET), New York City Cycle (NYCC), California Unified Cycle (LA-92) ve tüm döngülerin kombinasyonu (ALL-CYC) çevrimleri kullanılmış; toplam yedi tekrarlı sürüş döngüsü altında bir dizi simülasyon çalışması gerçekleştirilmiştir. MC tabanlı Ö-ETMS stratejisi, standart ETMS ile karşılaştırılmıştır. NEDC çevriminde %6,01, WLTP çevriminde %9,09, UDDS çevriminde %6,33, HWFET çevriminde %5,14, NYCC çevriminde %1,96, LA-92 çevriminde %11,47 ve ALL-CYC çevriminde %7,92 oranla yakıt tasarrufu elde edilmiştir. Bu makaledeki sonuçlar, önerilen stratejinin yaygın olarak kullanılan temel yönteme kıyasla, rekabetçi bir yakıt tasarrufu sağladığını ortaya koymaktadır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17341/gazimmfd.1040940"
    },
    {
        "id": 12235,
        "title": "Optimization-Based Energy System Planning Under Long-Term Uncertainty: Rapid Monte Carlo Analysis Using Linear Regression",
        "authors": "Hagen Seele, Jan Tautorus, Christiane Reinert, Niklas Von Der Aßen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52202/069564-0223"
    },
    {
        "id": 12236,
        "title": "A secure optimal placement strategy based on Monte Carlo simulation and hypothesis testing",
        "authors": "Marwa Thabet, Mouhebeddine Berrima, Brahim Hnich",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.future.2022.07.025"
    },
    {
        "id": 12237,
        "title": "Auto-calibration strategy for the equilibration phase of Gibbs ensemble Monte Carlo simulations",
        "authors": "Niklas Mayr, Michael Haring, Thomas Wallek",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/08927022.2023.2221355"
    },
    {
        "id": 12238,
        "title": "Post-storm repair crew dispatch for distribution grid restoration using stochastic Monte Carlo tree search and deep neural networks",
        "authors": "Hang Shuai, Fangxing Li, Buxin She, Xiaofei Wang, Jin Zhao",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijepes.2022.108477"
    },
    {
        "id": 12239,
        "title": "Multilevel Monte Carlo  FEM  for elliptic PDEs with Besov random tree priors",
        "authors": "Christoph Schwab, Andreas Stein",
        "published": "2023-9-30",
        "citations": 1,
        "abstract": "AbstractWe develop a multilevel Monte Carlo (MLMC)-FEM algorithm for linear, elliptic diffusion problems in polytopal domain$${\\mathcal {D}}\\subset {\\mathbb {R}}^d$$D⊂Rd, with Besov-tree random coefficients. This is to say that the logarithms of the diffusion coefficients are sampled from so-called Besov-tree priors, which have recently been proposed to model data for fractal phenomena in science and engineering. Numerical analysis of the fully discrete FEM for the elliptic PDE includes quadrature approximation and must account for (a) nonuniform pathwise upper and lower coefficient bounds, and for (b) low path-regularity of the Besov-tree coefficients. Admissible non-parametric random coefficients correspond to random functions exhibiting singularities on random fractals with tunable fractal dimension, but involve no a-priori specification of the fractal geometry of singular supports of sample paths. Optimal complexity and convergence rate estimates for quantities of interest and for their second moments are proved. A convergence analysis for MLMC-FEM is performed which yields choices of the algorithmic steering parameters for efficient implementation. A complexity (“error vs work”) analysis of the MLMC-FEM approximations is provided.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40072-023-00313-w"
    },
    {
        "id": 12240,
        "title": "A Novel Information-Directed Tree-Search Algorithm for RIS Phase Optimization in Massive MIMO",
        "authors": "I. Zakir Ahmed, Hamid Sadjadpour, Shahram Yousefi",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074174"
    },
    {
        "id": 12241,
        "title": "Variance Reduction of Resampling for Sequential Monte Carlo",
        "authors": "Xiongming Dai, Gerald Baumgartner",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012252100003636"
    },
    {
        "id": 12242,
        "title": "In search of the ground-state crystal structure of Ta2O5 from ab initio and Monte Carlo simulations",
        "authors": "Andrea Pedrielli, Nicola M. Pugno, Maurizio Dapor, Simone Taioli",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.commatsci.2022.111828"
    },
    {
        "id": 12243,
        "title": "Correction to “A review of Monte Carlo and <scp>quasi‐Monte</scp> Carlo sampling techniques”",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/wics.1650"
    },
    {
        "id": 12244,
        "title": "Monte Carlo estimates of extremes of stationary/nonstationary Gaussian processes",
        "authors": "Mircea Dan Grigoriu",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nFinite-dimensional (FD) models \n\n\n\n\nX\nd\n\n⁢\n\n(\nt\n)\n\n\n\n\nX_{d}(t)\n\n, i.e., deterministic functions of time and finite sets of 𝑑 random variables, are constructed for stationary and nonstationary Gaussian processes \n\n\n\nX\n⁢\n\n(\nt\n)\n\n\n\n\nX(t)\n\n with continuous samples defined on a bounded time interval \n\n\n\n[\n0\n,\nτ\n]\n\n\n\n[0,\\tau]\n\n.\nThe basis functions of these FD models are finite sets of eigenfunctions of the correlation functions of \n\n\n\nX\n⁢\n\n(\nt\n)\n\n\n\n\nX(t)\n\n and of trigonometric functions.\nNumerical illustrations are presented for a stationary Gaussian process \n\n\n\nX\n⁢\n\n(\nt\n)\n\n\n\n\nX(t)\n\n with exponential correlation function and a nonstationary version of this process obtained by time distortion.\nIt was found that the FD models are consistent with the theoretical results in the sense that their samples approach the target samples as the stochastic dimension is increased.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/mcma-2023-2006"
    },
    {
        "id": 12245,
        "title": "PENJADWALAN PERAWATAN MESIN MILLING PIPE DENGAN PENDEKATAN SIMULASI MONTE CARLO PADA PT WPP",
        "authors": "Moch. Faries Firmansyah, Wiwin Widiasih",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "PT WPP merupakan industri manufaktur yang memproduksi pipa stainlees. Karena keadaan daya saing bisnis saat ini, organisasi harus dapat mempertahankan ketergantungan peralatan manufaktur mereka untuk memastikan kelancaran proses produksi.. PT WPP mengaplikasikan metode preventive maintenance pada perawatan mesin produksinya hanya saja dalam penentuan jadwal belum optimal, hanya berlandaskan patokan dari kegagalan-kegagalan yang terjadi sebelumnya. Dalam mesin produksi pipa stainlees, PT WPP memiliki 3 mesin produksi yaitu mesin slitter, mesin milling pipe, dan mesin polishing. Mesin produksi yang memiliki breakdown tertinggi yaitu mesin milling pipe dengan frekuensi breakdown 444. Berdasarkan analisis pareto didapatkan 8 komponen kritis  dengan downtime tertinggi yaitu abrasive, gearbox, sander, cutter, as cutter, welding, water pump, dan hower. Simulasi monte carlo dapat menguji jadwal perawatan yang optimal. Hasil dari Simulasi didapatkan interval waktu perawatan preventive untuk komponen abrasive 11 hari, komponen gearbox 15 hari, komponen sander 23 hari, komponen cutter 9 hari, komponen as cutter 170 hari, komponen welding 43 hari, komponen water pump 32 hari, dan komponen hower 25 hari. Dengan mengaplikasikan interval waktu optimum dapat meningkatkan keandalan menjadi 35,33% hingga 65,33%.                       ABSTRACT PT WPP is a manufacturing industry that produces stainless steel pipes. Due to the current state of business competitiveness, organizations must be able to maintain dependence on their manufacturing equipment to ensure the smooth running of the production process. PT WPP applies the preventive maintenance method to the maintenance of its production machines but the schedule is not optimal, only based on the benchmark of failures that occur previously. In terms of stainless steel pipe production machines, PT WPP has 3 production machines namely slitter machines, pipe milling machines and polishing machines. The production machine that has the highest breakdown is the pipe milling machine with a breakdown frequency of 444. Based on the Pareto analysis, 8 critical components with the highest downtime are obtained, namely abrasives, gearbox, sander, cutter, axle cutter, welding, water pump, and hower. Monte carlo simulation can test the optimal maintenance schedule. The results of the simulation obtained preventive maintenance time intervals for abrasive components 11 days, gearbox components 15 days, sander components 23 days, cutter components 9 days, axle components cutter 170 days, welding components 43 days, water pump components 32 days, and hower components 25 day. Applying the optimum time interval can increase the reliability to 35.33% to 65.33%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51804/jiso.v6i1.40-47"
    },
    {
        "id": 12246,
        "title": "A review of Monte Carlo and <scp>quasi‐Monte</scp> Carlo sampling techniques",
        "authors": "Ying‐Chao Hung",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractThis article presents a comprehensive review and comparison of the Monte Carlo and quasi‐Monte Carlo sampling techniques, which are widely used in numerical integration, simulation, and optimization. Monte Carlo sampling involves the generation of pseudorandom numbers or vectors to estimate unknown quantities of interest. In contrast, quasi‐Monte Carlo sampling is specialized for situations where uniformity and reduced variance are important. It generates a deterministic low‐discrepancy sequence that spans the entire sampling space. This review aims to analyze the strengths and distinctions of these two sampling methodologies, offering valuable insights to researchers in search of sampling techniques aligned with their specific research objectives and needs. Furthermore, it seeks to equip practitioners with efficient algorithms for practical implementations.This article is categorized under:\nStatistical and Graphical Methods of Data Analysis > Monte Carlo Methods\nAlgorithms and Computational Methods > Numerical Methods\nStatistical and Graphical Methods of Data Analysis > Sampling\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/wics.1637"
    },
    {
        "id": 12247,
        "title": "Epidemic monitoring in real-time based on dynamic grid search and Monte Carlo numerical simulation algorithm",
        "authors": "Xin Chen, Huijun Ning, Liuwang Guo, Dongming Diao, Xinru Zhou, Xiaoliang Zhang",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "Building upon the foundational principles of the grid search algorithm and Monte Carlo numerical simulation, this article introduces an innovative epidemic monitoring and prevention plan. The plan offers the capability to accurately identify the sources of infectious diseases and predict the final scale and duration of the epidemic. The proposed plan is implemented in schools and society, utilizing computer simulation analysis. Through this analysis, the plan enables precise localization of infection sources for various demographic groups, with an error rate of less than 3%. Additionally, the plan allows for the estimation of the epidemic cycle duration, which typically spans around 14 days. Notably, higher population density enhances fault tolerance and prediction accuracy, resulting in smaller errors and more reliable simulation outcomes. Overall, this study provides highly valuable theoretical guidance for effective epidemic prevention and control efforts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1479"
    },
    {
        "id": 12248,
        "title": "Optimization of breast treatment planning towards lower dose rate: A Monte Carlo simulation study",
        "authors": "Abdollah Khorshidi, Mansour Ashoor, Ahmad Abdollahi",
        "published": "2023",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.imu.2023.101220"
    },
    {
        "id": 12249,
        "title": "Four Directed Search Algorithm: A New Optimization Method and Its Hyper Strategy Investigation",
        "authors": "",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.1031.51"
    },
    {
        "id": 12250,
        "title": "A Survey on Search Strategy of Evolutionary Multi-Objective Optimization Algorithms",
        "authors": "Zitong Wang, Yan Pei, Jianqiang Li",
        "published": "2023-4-6",
        "citations": 11,
        "abstract": "The multi-objective optimization problem is difficult to solve with conventional optimization methods and algorithms because there are conflicts among several optimization objectives and functions. Through the efforts of researchers and experts from different fields for the last 30 years, the research and application of multi-objective evolutionary algorithms (MOEA) have made excellent progress in solving such problems. MOEA has become one of the primary used methods and technologies in the realm of multi-objective optimization. It is also a hotspot in the evolutionary computation research community. This survey provides a comprehensive investigation of MOEA algorithms that have emerged in recent decades and summarizes and classifies the classical MOEAs by evolutionary mechanism from the viewpoint of the search strategy. This paper divides them into three categories considering the search strategy of MOEA, i.e., decomposition-based MOEA algorithms, dominant relation-based MOEA algorithms, and evaluation index-based MOEA algorithms. This paper selects the relevant representative algorithms for a detailed summary and analysis. As a prospective research direction, we propose to combine the chaotic evolution algorithm with these representative search strategies for improving the search capability of multi-objective optimization algorithms. The capability of the new multi-objective evolutionary algorithm has been discussed, which further proposes the future research direction of MOEA. It also lays a foundation for the application and development of MOEA with these prospective works in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13074643"
    },
    {
        "id": 12251,
        "title": "Polya tree Monte Carlo method",
        "authors": "Haoxin Zhuang, Liqun Diao, Grace Y. Yi",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csda.2022.107665"
    },
    {
        "id": 12252,
        "title": "Playing With Monte-Carlo Tree Search [AI-eXplained]",
        "authors": "Yunlong Zhao, Chengpeng Hu, Jialin Liu",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mci.2023.3328150"
    },
    {
        "id": 12253,
        "title": "MapZero: Mapping for Coarse-grained Reconfigurable Architectures with Reinforcement Learning and Monte-Carlo Tree Search",
        "authors": "Xiangyu Kong, Yi Huang, Jianfeng Zhu, Xingchen Man, Yang Liu, Chunyang Feng, Pengfei Gou, Minggui Tang, Shaojun Wei, Leibo Liu",
        "published": "2023-6-17",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3579371.3589081"
    },
    {
        "id": 12254,
        "title": "Maximum Entropy Inverse Reinforcement Learning Using Monte Carlo Tree Search for Autonomous Driving",
        "authors": "Júnior Anderson Rodrigues da Silva, Valdir Grassi, Denis Fernando Wolf",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tits.2024.3363497"
    },
    {
        "id": 12255,
        "title": "A 3D Monte Carlo tree search method for railway alignment optimization",
        "authors": "Guanghui Wang, Hao Pu, Taoran Song, Paul Schonfeld, Wei Li, Hong Zhang, Lihui Peng, Jianping Hu, Junfei Qiao",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.111158"
    },
    {
        "id": 12256,
        "title": "Perceptual error optimization for Monte Carlo animation rendering",
        "authors": "Miša Korać, Corentin Salaün, Iliyan Georgiev, Pascal Grittmann, Philipp Slusallek, Karol Myszkowski, Gurprit Singh",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3610548.3618146"
    },
    {
        "id": 12257,
        "title": "Nonlinear Modeling and Transmission Efficiency Optimization of MCR-WPT System Based on Monte Carlo-Interior Point Method",
        "authors": "Zhihan Wu, Yanwei Jiang, Guanquan Xiu, Yongcai Wu, Xujian Shu",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "With the optimization goal of improving the transmission efficiency of the magnetically coupled resonant wireless power transmission (MCR-WPT) system, the influencing factors and suppression methods of frequency splitting phenomenon (FSP) are analyzed from the perspective of input impedance based on the mutual inductance model. Then we propose the Monte Carlo-Interior Point method (MC-IPM) for nonlinear modeling to determine the optimal system parameters while ensuring that the system does not suffer from FSP. Finally, the simulation results show that the proposed method can obtain the optimal parameters faster and achieve higher transmission efficiency. The optimized system can meet the practical requirements and provides a reference value for improving the transmission performance of MCR-WPT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12092071"
    },
    {
        "id": 12258,
        "title": "Monte-Carlo techniques for radiotherapy applications I: introduction and overview of the different Monte-Carlo codes",
        "authors": "Andrew L. Fielding",
        "published": "2023",
        "citations": 5,
        "abstract": "Abstract\n\nIntroduction:\nThe dose calculation plays a crucial role in many aspects of contemporary clinical radiotherapy treatment planning process. It therefore goes without saying that the accuracy of the dose calculation is of very high importance. The gold standard for absorbed dose calculation is the Monte-Carlo algorithm.\n\n\nMethods:\nThis first of two papers gives an overview of the main openly available and supported codes that have been widely used for radiotherapy simulations.\n\n\nResults:\nThe paper aims to provide an overview of Monte-Carlo in the field of radiotherapy and point the reader in the right direction of work that could help them get started or develop their existing understanding and use of Monte-Carlo algorithms in their practice.\n\n\nConclusions:\nIt also serves as a useful companion to a curated collection of papers on Monte-Carlo that have been published in this journal.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1460396923000079"
    },
    {
        "id": 12259,
        "title": "Coverage Optimization Strategy of UWSNs Based on Improved Sparrow Search Algorithm",
        "authors": "Lu Liu, Yuming Mao",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "Randomly distributed nodes lead to low coverage rate and low connectivity in the underwater wireless sensor networks (UWSNs). An UWSNs node coverage optimization strategy based on the Improved Sparrow Search Algorithm (ISSA) is designed to improve coverage rate and connectivity. The ISSA algorithm effectively balances the global and local optimization capabilities of nodes by introducing nonlinear inertia weights and Levy flight strategy, thereby avoiding the algorithm from getting trapped in local optima. Simulation experiments demonstrate that ISSA achieves optimal deployment results in a short time. It not only improves network coverage but also maintains good network connectivity and reduces node redundancy, thereby e ffectively reducing network energy consumption. Compared to other common algorithms , ISSA can increase network coverage up to 8.4% and improve network utilization up to11.8%, and meets the deployment requirements.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/wbgqzz54"
    },
    {
        "id": 12260,
        "title": "GAMMA, E-BEAM &amp;amp; X-RAY RADIATION STERILIZATION EQUIVALENCY: RESULTS OF THE MONTE CARLO SIMULATIONS",
        "authors": "Thomas Kroc",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1959821"
    },
    {
        "id": 12261,
        "title": "Research on Multi-objective Replacement Strategy for Railway Freight Car Brake Shoes Based on Monte Carlo Simulation",
        "authors": "Jiayi Sun, Jing Ma, Qiang Wang, Anqi Shan, Zengqiang Jiang",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/phm-hangzhou58797.2023.10482664"
    },
    {
        "id": 12262,
        "title": "Anatomy of path integral Monte Carlo: Algebraic derivation of the harmonic oscillator’s universal discrete imaginary-time propagator and its sequential optimization",
        "authors": "Siu A. Chin",
        "published": "2023-10-7",
        "citations": 1,
        "abstract": "The direct integration of the harmonic oscillator path integral obscures the fundamental structure of its discrete, imaginary time propagator (density matrix). This work, by first proving an operator identity for contracting two free propagators into one in the presence of interaction, derives the discrete propagator by simple algebra without doing any integration. This discrete propagator is universal, having the same two hyperbolic coefficient functions for all short-time propagators. Individual short-time propagator only modifies the coefficient function’s argument, its portal parameter, whose convergent order is the same as the thermodynamic energy. Moreover, the thermodynamic energy can be given in a closed form for any short-time propagator. Since the portal parameter can be systematically optimized by matching the expansion of the product of the two coefficients, any short-time propagator can be optimized sequentially, order by order, by matching the product coefficient’s expansion alone, without computing the energy. Previous empirical findings on the convergence of fourth and sixth-order propagators can now be understood analytically. An eight-order convergent short-time propagator is also derived.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0164086"
    },
    {
        "id": 12263,
        "title": "Meta variance reduction for Monte Carlo estimation of energetic particle confinement during stellarator optimization",
        "authors": "Frederick Law, Antoine Cerfon, Benjamin Peherstorfer, Florian Wechsung",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jcp.2023.112524"
    },
    {
        "id": 12264,
        "title": "Markov Chain Monte Carlo optimization applied to double stars from Miller &amp; Pitman research",
        "authors": "Maksym Ersteniuk, Timothy Banks, Edwin Budding, Michael D. Rhodes",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12036-024-09997-5"
    },
    {
        "id": 12265,
        "title": "Evaluation of mining projects subjected to economic uncertainties using the Monte Carlo simulation and the binomial tree method: Case study in a phosphate mine in Egypt",
        "authors": "Ahmed Kamel, Mohamed Elwageeh, Stefano Bonduà, Mohamed Elkarmoty",
        "published": "2023-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.resourpol.2022.103266"
    },
    {
        "id": 12266,
        "title": "Wireless sensor network coverage optimization strategy based on improved cuckoo search algorithm",
        "authors": "Siyang Li",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004648"
    },
    {
        "id": 12267,
        "title": "Kazıklarla Güçlendirilmiş Şevlerde Monte Carlo Simülasyon Yöntemi Uygulaması",
        "authors": "Yesim TUSKAN, Yusuf ERZİN",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Bu çalışmada, kazıklarla güçlendirilmiş bir şevin simülasyon modeli geliştirilmiştir. Manisa-İzmir Devlet Yolu (Türkiye) doğu kesiminde yer alan hasar görmüş bir şevin güvenlik sayısının (FS) kemerlenme etkisi göz önüne alınarak değerlendirilmesi için iki boyutlu sonlu elemanlar yöntemi (2D-FEM) kullanılmıştır. Ek olarak, güvenilirliğe dayalı bir tasarım yöntemi olan Monte Carlo Simülasyonu (MCS), deprem sırasında güçlendirilmiş şevlerin stabilitesini ve güçlendirilmiş şevlerin kayma olasılığını doğru bir şekilde tahmin etmek için kullanılmıştır. Olasılık ve istatistiksel teori bilgisi, önerilen problemi çözmek ve herhangi bir fiziksel test olmaksızın sayısal çözümler üretmek için deterministik çalışmalarda kullanılmaktadır. Geliştirilen MCS ve FEM modellerinin tahmin kapasitesini değerlendirmek için güvenilirlik indeksi ve yenilme olasılığı hesaplanmıştır. Son olarak, hesaplanan indisler hem geliştirilmiş MCS'nin hem de FEM'in heyelanın FS değerlerini oldukça verimli bir şekilde tahmin edebildiğini açıkça ortaya koymaktadır.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35414/akufemubid.1287644"
    },
    {
        "id": 12268,
        "title": "Monte Carlo simulation and optimization of neutron ray shielding performance of related materials",
        "authors": "Tongyan Cui, Faquan Wang, Linhan Bing, Rui Wang, Zhongjian Ma, Qingxiu Jia",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.net.2024.04.002"
    },
    {
        "id": 12269,
        "title": "Deep Reinforcement Learning Using Optimized Monte Carlo Tree Search in EWN",
        "authors": "Yixian Zhang, Zhuoxuan Li, Yiding Cao, Xuan Zhao, Jinde Cao",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tg.2023.3308898"
    },
    {
        "id": 12270,
        "title": "Adaptive Design of Alloys for CO<sub>2</sub> Activation and Methanation via Reinforcement Learning Monte Carlo Tree Search Algorithm",
        "authors": "Zhilong Song, Qionghua Zhou, Shuaihua Lu, Sae Dieb, Chongyi Ling, Jinlan Wang",
        "published": "2023-4-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jpclett.3c00242"
    },
    {
        "id": 12271,
        "title": "A search for short-period Tausworthe generators over Fb with application to Markov chain quasi-Monte Carlo",
        "authors": "Shin Harase",
        "published": "2024-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/00949655.2024.2312951"
    },
    {
        "id": 12272,
        "title": "VGAE-MCTS: A New Molecular Generative Model Combining the Variational Graph Auto-Encoder and Monte Carlo Tree Search",
        "authors": "Hiroaki Iwata, Taichi Nakai, Takuto Koyama, Shigeyuki Matsumoto, Ryosuke Kojima, Yasushi Okuno",
        "published": "2023-12-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jcim.3c01220"
    },
    {
        "id": 12273,
        "title": "Backtracking search optimization algorithm with dual scatter search strategy for automated test case generation",
        "authors": "Jingru Ren, Wenming Zhu",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jksuci.2023.101600"
    },
    {
        "id": 12274,
        "title": "Monte Carlo method for parabolic equations involving fractional Laplacian",
        "authors": "Caiyu Jiao, Changpin Li",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "Abstract\nWe apply the Monte Carlo method to solving the Dirichlet problem of linear parabolic equations with fractional\nLaplacian. This method exploits the idea of weak approximation of related stochastic differential equations\ndriven by the symmetric stable Lévy process with jumps. We utilize the jump-adapted scheme to approximate\nLévy process which gives exact exit time to the boundary. When the solution has low regularity, we establish\na numerical scheme by removing the small jumps of the Lévy process and then show the convergence order. When\nthe solution has higher regularity, we build up a higher-order numerical scheme by replacing small jumps with a\nsimple process and then display the higher convergence order. Finally, numerical experiments including\nten- and one hundred-dimensional cases are presented, which confirm the theoretical estimates and show the numerical\nefficiency of the proposed schemes for high-dimensional parabolic equations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/mcma-2022-2129"
    },
    {
        "id": 12275,
        "title": "Combinatorial Optimization Design of Search Tree Model Based on Hash Storage",
        "authors": "Yun Liu, Jiajun Li, Jingjing Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140574"
    },
    {
        "id": 12276,
        "title": "Optimization of the ART Tomographic Reconstruction Algorithm - Monte Carlo Simulation",
        "authors": "S. Raviraja, K. Seethalakshmi, Sumit Kushwaha, Vishnu Priya P M, Kallakunta Ravi Kumar, Bijesh Dhyani, V. Prabhu",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaaic56838.2023.10141047"
    },
    {
        "id": 12277,
        "title": "Development of QSAR Model Based on Monte Carlo Optimization for Predicting GABAA Receptor Binding of Newly Emerging Benzodiazepines",
        "authors": "Aleksandra Antović, Radovan Karadžić, Jelena V. Živković, Aleksandar M. Veselinović",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "The rising prevalence and appeal of designer benzodiazepines (DBZDs) pose a significant public health concern. To evaluate this threat, the biological activity/potency of DBZDs was examined through in silico studies. To gain a deeper understanding of their pharmacology, we employed the Monte Carlo optimization conformation-independent method as a tool for developing QSAR models. These models were built using optimal molecular descriptors derived from both SMILES notation and molecular graph representations. The resulting QSAR model demonstrated robustness and a high degree of predictability, proving to be very reliable. The newly discovered molecular fragments used in the  computeraided design of the new compounds were believed to have caused the increase and decrease of the studied activity. Molecular docking studies were used to make the final assessment of the designed inhibitors and excellent correlation with the results of QSAR modeling was observed. This discovery paves the way for the swift prediction of binding activity for emerging benzodiazepines, offering a faster and more cost-effective alternative to traditional in vitro/in vivo analyses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17344/acsi.2023.8465"
    },
    {
        "id": 12278,
        "title": "Reliability Estimation and Optimization of a Smart Meter Architecture Using a Monte Carlo Simulation",
        "authors": "Tobias Altenburg, Daniel Staegemann, Matthias Volk, Klaus Turowski",
        "published": "2023-6-10",
        "citations": 0,
        "abstract": "AbstractThe technological evolution is dominating the social change. There is a constant increase in the number of networked devices and the use of smart meters has become more relevant. A required feature of smart meter architectures is reliability, which ensures the continuous provision of the services of the system. In this article, the research question “How can a low-fault smart metering architecture be achieved based on constructive methods?” is answered with the objective of designing a low-fault smart meter architecture. By implementing optimization methods, an improvement in reliability can be achieved. A structured approach to reliability optimization using topological modifications to the architecture is described, along with evaluation of the improved reliability. For this purpose, reliability block diagrams are combined with Monte Carlo simulation to calculate the most realistic approximation of system reliability. Finally, the results of the individual reliability analyses are summarized and compared to show the optimization potential.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01917-8"
    },
    {
        "id": 12279,
        "title": "Spallation target optimization for ADS by Monte Carlo codes",
        "authors": "M Mumyapan, M Ghergherehchi, D H Ha, H Namgoong, J S Chai",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "Abstract\nAccelerator Driven System are advanced system for the use of Thorium as fuel, aiming to reduce nuclear waste through transmutation. The spallation target, which is responsible for producing neutrons, is one of the main parts of the ADS system. In this research, neutronic parameters of spallation targets consisting of several materials LBE, Mercury, and Lead, on the cylindrical and conic shapes using Monte Carlo codes (FLUKA, PHITS, MCNPX) were investigated. Energy deposition and spallation neutron yield of spallation target with different shapes and dimensions have been calculated to optimization of the target. According to the results, the neutron yield values from MCNPX and PHITS are similar and it’s close to the experimental result. On the other hand, the error rate of the values in FLUKA is higher.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2420/1/012079"
    },
    {
        "id": 12280,
        "title": "Monte Carlo Optimization Based QSAR Modeling of Angiotensin II Receptor Antagonists",
        "authors": "Nemanja Nikolić, Tomislav Kostić, Mlađan Golubović, Tamara Nikolić, Marija Marinković, Velimir Perić, Sara Mladenović, Aleksandar M. Veselinović",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "The pathogenesis of essential hypertension, congestive heart failure, and reno-vascular hypertension is related to angiotensin II. This study presents QSAR modeling for a set of compounds acting as angiotensin II receptor antagonists based on the Monte Carlo optimization with molecular graph-based and SMILES notation based descriptors. Conformation independent QSAR models were developed for three random splits. Various statistical approaches were used to assess the statistical quality of the developed models, and the obtained results were very good. This study used a novel statistical metric known as the index of ideality of correlation for the final assessment of the model, and the results that were obtained suggested that the model was good. Also, molecular fragments which account for the increases and/or decreases of a studied activity were defined and then used for the computer-aided design of new compounds as potential angiotensin II receptor antagonists. The final assessment of the designed inhibitors, was performed with the use of molecular docking studies, highlighting exceptional correlation with the QSAR modeling results. The methodology which is presented in this research can be applied for seeking new agents for cardiovascular disorders treatment by angiotensin II receptor antagonism.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17344/acsi.2023.8081"
    },
    {
        "id": 12281,
        "title": "Surrogate-based drag optimization of Autonomous Remotely Vehicle using an improved Sequentially Constrained Monte Carlo Method",
        "authors": "Xinwang Liu, Xiaohang Ji, Lei Lei",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2024.117047"
    },
    {
        "id": 12282,
        "title": "Optimization of Monte Carlo Method-Based QSPR modeling for lipophilicity in radiopharmaceuticals",
        "authors": "Fariba Bamdi, Fereshteh Shiri, Shahin Ahmadi, Maryam Salahinejad, Faezeh Bazzi-Allahri",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cplett.2024.141239"
    },
    {
        "id": 12283,
        "title": "Monte Carlo Estimation of Mass Attenuation Coefficients of Some ZnO-doped Glass Samples",
        "authors": "Aycan ŞENGÜL",
        "published": "2023-9-27",
        "citations": 1,
        "abstract": "Bu çalışma, Monte Carlo yöntemi kullanılarak ZnO katkılı bazı cam örneklerinin toplam kütle zayıflama katsayılarını hesaplamayı amaçlamaktadır. Simülasyonlar basitçe, silindir şeklinde soğurucu bir malzeme, NaI(Tl) detektörü,kolimatör ve soğurucuya doğru paralel bir ışın olarak yönlendirilen mono-enerjik fotonlar yayan nokta kaynaktan oluşmaktadır. Problem geometrisindeki tüm bileşenler, numune dışındaki malzemelerde herhangi bir etkileşimi önlemek için vakum bir küre ile çevrelenmiştir. Simülasyon düzeneği bu şekliyle, saçılan fotonların dedektördeki toplam akıya katkı yapması engellemiştir. Simülasyonlar, 10 keV-20 MeV enerji aralığında 39 farklı foton enerjisinde GAMOS 6.2 paketi kullanılarak gerçekleştirilmiştir. Bu çalışma .çinko oksitin cam örneklere ilave edilmesinin cam örneklerinin radyasyon soğurma özelliklerini arttırdığını göstermiştir.  Çalışmanın sonuçları XCOM değerleri ile karşılaştırıldığında iyi bir uyum görülmektedir. Monte Carlo tekniğinin, basit bir model geometrisi kullanarak, geniş bir enerji aralığında, kütlesel zayıflama katsayılarının hesaplanması için bir alternatif olarak kullanılabileceğini ortaya koymuştur.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21205/deufmd.2023257518"
    },
    {
        "id": 12284,
        "title": "Full-Band Monte Carlo Study of Hot Carriers for Advection-Diffusion Monte Carlo Simulations",
        "authors": "Rémi Helleboid, Jérôme Saint-Martin, Marco Pala, Philippe Dollfus, Gabriel Mugny, Isobel Nicholson, Denis Rideau",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/sispad57422.2023.10319557"
    },
    {
        "id": 12285,
        "title": "Multi-strategy chimp optimization algorithm for global optimization and minimum spanning tree",
        "authors": "Nating Du, Yongquan Zhou, Qifang Luo, Ming Jiang, Wu Deng",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09174-w"
    },
    {
        "id": 12286,
        "title": "Optimization Study of KNN Classification Algorithm on Large-Scale Datasets: Real-Time Optimization Strategy Based on Balanced KD Tree and Multi-threaded Parallel Computing",
        "authors": "Kangjie Cao, Jinyao Wu, Qianhang Huang, Yichao Gan",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichci58871.2023.10277807"
    },
    {
        "id": 12287,
        "title": "Economic Optimization of the Inspection Period for Sensors with Hidden Failures: A Monte Carlo Simulation Approach",
        "authors": "Ricardo J. G. Mateus, Rui Assis, João A. Rodrigues, P. Carmona Marques",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/eu6.20230021"
    },
    {
        "id": 12288,
        "title": "Monte Carlo based continuous aperture optimization for VMAT on conventional and MR‐linacs: A proof of concept",
        "authors": "Shiqin Su, Parmveer Atwal, I Antoniu Popescu",
        "published": "2023-6",
        "citations": 1,
        "abstract": "AbstractBackgroundCurrently, the commercial treatment planning systems for magnetic‐resonance guided linear accelerators (MR‐linacs) only support step‐and‐shoot intensity‐modulated radiation therapy (IMRT). However, recent studies have shown the feasibility of delivering arc therapy on MR‐linacs, which is expected to improve dose distributions and delivery speed. By accurately accounting for the electron return effect in the presence of a magnetic field, a Monte Carlo (MC) algorithm is ideally suited for the inverse treatment planning of this technique.PurposeWe propose a novel MC‐based continuous aperture optimization (MCCAO) algorithm for volumetric modulated arc therapy (VMAT), including applications to VMAT on MR‐linacs and trajectory‐based VMAT. A unique feature of MCCAO is that the continuous character of gantry rotation and multileaf collimator (MLC) motion is accounted for at every stage of the optimization.MethodsThe optimization process uses a multistage simulation of 4D dose distribution. A phase space is scored at the top surface of the MLC and the energy deposition of each particle history is mapped to its position in this phase space. A progressive sampling method is used, where both MLC leaf positions and monitor unit (MU) weights are randomly changed, while respecting the linac mechanical limits. Due to the continuous nature of the leaf motion, such changes affect not only a single control point, but propagate to the adjacent ones as well, and the corresponding dose distribution changes are accounted for. A dose–volume cost function is used, which includes the MC statistical uncertainty.ResultsWe applied our optimization technique to various treatment sites, using standard and flattening‐filter‐free (FFF) 6 MV beam models, with and without a 1.5 T magnetic field. MCCAO generates deliverable plans, whose dose distributions are in good agreement with measurements on ArcCHECK and stereotactic radiosurgery End‐To‐End Phantom.ConclusionsWe show that the novel MCCAO method generates VMAT plans that meet clinical objectives for both conventional and MR‐linacs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mp.16358"
    },
    {
        "id": 12289,
        "title": "In-silico activity prediction and docking studies of some flavonol derivatives as anti-prostate cancer agents based on Monte Carlo optimization",
        "authors": "Faezeh Tajiani, Shahin Ahmadi, Shahram Lotfi, Parvin Kumar, Ali Almasirad",
        "published": "2023-7-26",
        "citations": 4,
        "abstract": "AbstractThe QSAR models are employed to predict the anti-proliferative activity of 81 derivatives of flavonol against prostate cancer using the Monte Carlo algorithm based on the index of ideality of correlation (IIC) criterion. CORAL software is employed to design the QSAR models. The molecular structures of flavonols are demonstrated using the simplified molecular input line entry system (SMILES) notation. The models are developed with the hybrid optimal descriptors i.e. using both SMILES and hydrogen-suppressed molecular graph (HSG). The QSAR model developed for split 3 is selected as a prominent model ($${R}_{Validation}^{2}$$RValidation2= 0.727,$${IIC}_{validation}$$IICvalidation= 0.628,$${Q}_{Validation}^{2}$$QValidation2= 0.642, and$${\\overline{r} }_{m}^{2}$$r¯m2=0.615). The model is interpreted mechanistically by identifying the characteristics responsible for the promoter of the increase or decrease. The structural attributes as promoters of increase of pIC50were aliphatic carbon atom connected to double-bound (C…=…, aliphatic oxygen atom connected to aliphatic carbon (O…C…), branching on aromatic ring (c…(…), and aliphatic nitrogen (N…). The pIC50of eight natural flavonols with pIC50more than 4.0, were predicted by the best model. The molecular docking is also performed for natural flavonols on the PC-3 cell line using the protein (PDB: 3RUK).",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13065-023-00999-y"
    },
    {
        "id": 12290,
        "title": "Proposal and validation of an optimization method using Monte Carlo method for multi-objective functions",
        "authors": "Sin-ichi Inage, Shouki Ohgi, Yoshinori Takahashi",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matcom.2023.08.001"
    },
    {
        "id": 12291,
        "title": "Design and optimization of graphene quantum dot-based luminescent solar concentrator using Monte-Carlo simulation",
        "authors": "Milad Rastkar Mirzaei, Ali Rostami, Samiye Matloub, Masoumeh Nazari",
        "published": "2023-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.enbenv.2021.10.002"
    },
    {
        "id": 12292,
        "title": "Monte Carlo simulations for targeted beta therapy: An optimization for liver lesions and comparison of dose distributions in other organs",
        "authors": "Ayhan Kara, Emil Mammadzada",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.radmp.2023.11.001"
    },
    {
        "id": 12293,
        "title": "Comparison of optimization techniques for the Monte Carlo simulation of clearance monitors",
        "authors": "Federico Alejandro Geser, Malgorzata Magdalena Kasprzak, Sabine Mayer",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "Abstract\nIn this work, simulations of the clearance monitor HWM-1800 (Ludlum GmbH, Hamburg) with the Monte Carlo (MC) code FLUKA were performed and optimized. Nowadays, clearance monitors are being widely implemented for decommissioning activities in nuclear reactors and particle accelerator facilities. For every situation, a different calibration is typically needed, depending on the material composition of the samples to be released, their volume and the expected radionuclides. For this reason, MC simulations present a practical tool to obtain information on the capabilities of clearance monitors for different configurations. Early models of clearance monitors worked as counters, providing an energy-integrated value of the measured net count rates. However, modern devices have a multi-channel analyzer, which allows constructing pulse-height spectra. The results of the MC simulations were optimized for both of the described situations: comparing the integrated net count rates and performing a spectral analysis. The performance of both methodologies is evaluated in terms of their discrepancy with the experimentally measured values, and the possible improvements for the optimization with spectral analysis are further discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/rpd/ncac289"
    },
    {
        "id": 12294,
        "title": "Monte Carlo spin simulations of magnetic noise: The search for pivoting",
        "authors": "D. L. Mickelsen, Ruqian Wu, Clare C. Yu",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevb.109.144510"
    },
    {
        "id": 12295,
        "title": "Sampling-Distribution-Based Evaluation for Monte Carlo Rendering",
        "authors": "Christian Freude, Hiroyuki Sakai, Károly Zsolnai-Fehér, Michael Wimmer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011886300003417"
    },
    {
        "id": 12296,
        "title": "Simulating the 3D Distribution of Absorbed Shortwave Radiation in a Tree Crown: Comparison of Simplified and Monte Carlo Models",
        "authors": "H. Oshio, T. Asawa",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "AbstractUrban trees are expected to alleviate severe thermal environments in summer. The absorbed shortwave radiation is a key variable to estimate the microclimatic effects of trees. In numerical simulation tools for the urban and built thermal environment, the difficulty lies in how to calculate the absorbed radiation in terms of accuracy and computational load. Here we investigated the difference between a radiative transfer model calculating scattering by the Monte Carlo method and a simpler model that accounts for scattering by modifying the optical depth. The calculations of absorbed radiation were performed under various conditions of leaf normal distribution and zenith angle of incident radiation, using tree models represented by voxels with different leaf area density values. For the photosynthetically active radiation, the relative difference between models was less than 10% for most cases. For the near‐infrared radiation, the difference was also small for a large canopy consisting of several trees. The difference was 30%–60% and 0%–20% for zenith angles of incident radiation of 0° and 60°, respectively, for small isolated trees with a crown height and width of less than 5 m, which was a significantly different condition from a uniform canopy. This large difference was related to the uniformity of the canopy and was explained by the transmittance from each voxel to the outside of the canopy. The present study enables us to evaluate the applicability of the simple model and correct the difference from the Monte Carlo model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2023jd038612"
    },
    {
        "id": 12297,
        "title": "Intelligent Train Tracking Control Based on Monte Carlo Tree Method",
        "authors": "Zixu Zhao, Jidong Lv, Boyuan Zhou, Wanli Lu, Ming Chai, Hongjie Liu",
        "published": "2023-9-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itsc57777.2023.10422578"
    },
    {
        "id": 12298,
        "title": "Minimum spanning tree niching-based differential evolution with knowledge-driven update strategy for multimodal optimization problems",
        "authors": "Xiangqian Li, Hong Zhao, Jing Liu",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110589"
    },
    {
        "id": 12299,
        "title": "Impact of Electric Vehicle on Residential Power Distribution Considering Energy Management Strategy and Stochastic Monte Carlo Algorithm",
        "authors": "Abdulgader Alsharif, Chee Wei Tan, Razman Ayop, Ahmed Al Smin, Abdussalam Ali Ahmed, Farag Hamed Kuwil, Mohamed Mohamed Khaleel",
        "published": "2023-1-27",
        "citations": 10,
        "abstract": "The area of a Microgrid (μG) is a very fast-growing and promising system for overcoming power barriers. This paper examines the impacts of a microgrid system considering Electric Vehicle Grid Integration (EVGI) based on stochastic metaheuristic methods. One of the biggest challenges to slowing down global climate change is the transition to sustainable mobility. Renewable Energy Sources (RESs) integrated with Evs are considered a solution for the power and environmental issues needed to achieve Sustainable Development Goal Seven (SDG7) and Climate Action Goal 13 (CAG13). The aforementioned goals can be achieved by coupling Evs with the utility grid and other RESs using Vehicle-to-Grid (V2G) technology to form a hybrid system. Overloading is a challenge due to the unknown number of loads (unknown number of Evs). Thus, this study helps to establish the system impact of the uncertainties (arrival and departure Evs) by proposing Stochastic Monte Carlo Method (SMCM) to be addressed. The main objective of this research is to size the system configurations using a metaheuristic algorithm and analyze the impact of an uncertain number of Evs on the distribution of residential power in Tripoli-Libya to gain a cost-effective, reliable, and renewable system. The Improved Antlion Optimization (IALO) algorithm is an optimization technique used for determining the optimal number of configurations of the hybrid system considering multiple sources, while the Rule-Based Energy Management Strategy (RB-EMS) controlling algorithm is used to control the flow of power in the electric power system. The sensitivity analysis of the effect parameters has been taken into account to assess the expected impact in the future. The results obtained from the sizing, controlling, and sensitivity analyses are discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16031358"
    },
    {
        "id": 12300,
        "title": "Research on multi-strategy improved sparrow search optimization algorithm",
        "authors": "Teng Fei, Hongjun Wang, Lanxue Liu, Liyi Zhang, Kangle Wu, Jianing Guo",
        "published": "2023",
        "citations": 2,
        "abstract": "<abstract>\n<p>To address the issues with inadequate search space, sluggish convergence and easy fall into local optimality during iteration of the sparrow search algorithm (SSA), a multi-strategy improved sparrow search algorithm (ISSA), is developed. First, the population dynamic adjustment strategy is carried out to restrict the amount of sparrow population discoverers and joiners. Second, the update strategy in the mining phase of the honeypot optimization algorithm (HBA) is combined to change the update formula of the joiner's position to enhance the global exploration ability of the algorithm. Finally, the optimal position of population discoverers is perturbed using the perturbation operator and levy flight strategy to improve the ability of the algorithm to jump out of local optimum. The experimental simulations are put up against the basic sparrow search algorithm and the other four swarm intelligence (SI) algorithms in 13 benchmark test functions, and the Wilcoxon rank sum test is used to determine whether the algorithm is significantly different from the other algorithms. The results show that the improved sparrow search algorithm has better convergence and solution accuracy, and the global optimization ability is greatly improved. When the proposed algorithm is used in pilot optimization in channel estimation, the bit error rate is greatly improved, which shows the superiority of the proposed algorithm in engineering application.</p>\n</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023767"
    },
    {
        "id": 12301,
        "title": "Optimization Stability in Excited-State-Specific Variational Monte Carlo",
        "authors": "Leon Otis, Eric Neuscamman",
        "published": "2023-2-14",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jctc.2c00642"
    },
    {
        "id": 12302,
        "title": "Computation of forces and stresses in solids: Towards accurate structural optimization with auxiliary-field quantum Monte Carlo",
        "authors": "Siyuan Chen, Shiwei Zhang",
        "published": "2023-5-26",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevb.107.195150"
    },
    {
        "id": 12303,
        "title": "Error Estimation and Optimization of the Direct Simulation Monte Carlo Method Taking into Account Spatial Regularization",
        "authors": "M. Yu. Plotnikov, E. V. Shkarupa",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s0965542523070114"
    },
    {
        "id": 12304,
        "title": "Optimization of the Eclipse TPS beam configuration parameters for small field dosimetry using Monte Carlo simulations and experimental measurements",
        "authors": "Tony Younes, Frédéric Chatrie, Marianne Zinutti, Luc Simon, Georges Fares, Laure Vieillevigne",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ejmp.2023.103141"
    }
]