[
    {
        "id": 2305,
        "title": "Towards real-world implementations of quantum machine learning",
        "authors": "Junyu Liu",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/qv-2023-11-29-77"
    },
    {
        "id": 2306,
        "title": "Pulse-efficient quantum machine learning",
        "authors": "André Melo, Nathan Earnest-Noble, Francesco Tacchino",
        "published": "2023-10-9",
        "citations": 2,
        "abstract": "Quantum machine learning algorithms based on parameterized quantum circuits are promising candidates for near-term quantum advantage. Although these algorithms are compatible with the current generation of quantum processors, device noise limits their performance, for example by inducing an exponential flattening of loss landscapes. Error suppression schemes such as dynamical decoupling and Pauli twirling alleviate this issue by reducing noise at the hardware level. A recent addition to this toolbox of techniques is pulse-efficient transpilation, which reduces circuit schedule duration by exploiting hardware-native cross-resonance interaction. In this work, we investigate the impact of pulse-efficient circuits on near-term algorithms for quantum machine learning. We report results for two standard experiments: binary classification on a synthetic dataset with quantum neural networks and handwritten digit recognition with quantum kernel estimation. In both cases, we find that pulse-efficient transpilation vastly reduces average circuit durations and, as a result, significantly improves classification accuracy. We conclude by applying pulse-efficient transpilation to the Hamiltonian Variational Ansatz and show that it delays the onset of noise-induced barren plateaus.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-10-09-1130"
    },
    {
        "id": 2307,
        "title": "Stationary states of a dissipative two-qubit quantum channel and their applications for quantum machine learning",
        "authors": "E. Ghasemian",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00096-2"
    },
    {
        "id": 2308,
        "title": "Preface: International Workshop on Machine Learning and Quantum Computing Applications in Medicine and Physics",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/12.0025020"
    },
    {
        "id": 2309,
        "title": "SEQUENT: Towards Traceable Quantum Machine Learning Using Sequential Quantum Enhanced Training",
        "authors": "Philipp Altmann, Leo Sünkel, Jonas Stein, Tobias Müller, Christoph Roch, Claudia Linnhoff-Popien",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011772400003393"
    },
    {
        "id": 2310,
        "title": "Disentangling Quantum and Classical Contributions in Hybrid Quantum Machine Learning Architectures",
        "authors": "Michael Kölle, Jonas Maurer, Philipp Altmann, Leo Sünkel, Jonas Stein, Claudia Linnhoff-Popien",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012381600003636"
    },
    {
        "id": 2311,
        "title": "Generalization despite overfitting in quantum machine learning models",
        "authors": "Evan Peters, Maria Schuld",
        "published": "2023-12-20",
        "citations": 3,
        "abstract": "The widespread success of deep neural networks has revealed a surprise in classical machine learning: very complex models often generalize well while simultaneously overfitting training data. This phenomenon of benign overfitting has been studied for a variety of classical models with the goal of better understanding the mechanisms behind deep learning. Characterizing the phenomenon in the context of quantum machine learning might similarly improve our understanding of the relationship between overfitting, overparameterization, and generalization. In this work, we provide a characterization of benign overfitting in quantum models. To do this, we derive the behavior of a classical interpolating Fourier features models for regression on noisy signals, and show how a class of quantum models exhibits analogous features, thereby linking the structure of quantum circuits (such as data-encoding and state preparation operations) to overparameterization and overfitting in quantum models. We intuitively explain these features according to the ability of the quantum model to interpolate noisy data with locally \"spiky\" behavior and provide a concrete demonstration example of benign overfitting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-12-20-1210"
    },
    {
        "id": 2312,
        "title": "A direct error correction method for quantum machine learning",
        "authors": "Hiroshi Ohno",
        "published": "2023-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-03863-z"
    },
    {
        "id": 2313,
        "title": "Fourier Series Weight in Quantum Machine Learning",
        "authors": "Parfait Atchade-Adelomou",
        "published": "2024",
        "citations": 0,
        "abstract": "In this work, we aim to confirm the impact of the Fourier series on the quantum machine learning model. We will propose models, tests, and demonstrations to achieve this objective. We designed a quantum machine learning leveraged on the Hamiltonian encoding. With a subtle change, we performed the trigonometric interpolation, binary and multiclass classifier, and a quantum signal processing application. We also proposed a block diagram of determining approximately the Fourier coefficient based on quantum machine learning. We performed and tested all the proposed models using the Pennylane framework.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2024.41108"
    },
    {
        "id": 2314,
        "title": "Quantum circuit fidelity estimation using machine learning",
        "authors": "Avi Vadali, Rutuja Kshirsagar, Prasanth Shyamsundar, Gabriel N. Perdue",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00121-4"
    },
    {
        "id": 2315,
        "title": "Quantum Machine Learning with Quantum Topological Data Analysis",
        "authors": "Ankit Khandelwal, M Girish Chandra",
        "published": "2023-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10176"
    },
    {
        "id": 2316,
        "title": "MAQML: a Meta-approach to Quantum Machine Learning with Accentuated Sample Variations for Unobtrusive Mental Health Monitoring",
        "authors": "Anupama Padha, Anita Sahoo",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00108-1"
    },
    {
        "id": 2317,
        "title": "Towards quantum machine learning",
        "authors": "Michael Brooks",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/d41586-023-01718-2"
    },
    {
        "id": 2318,
        "title": "Subtleties in the trainability of quantum machine learning models",
        "authors": "Supanut Thanasilp, Samson Wang, Nhat Anh Nghiem, Patrick Coles, Marco Cerezo",
        "published": "2023-6",
        "citations": 8,
        "abstract": "AbstractA new paradigm for data science has emerged, with quantum data, quantum models, and quantum computational devices. This field, called quantum machine learning (QML), aims to achieve a speedup over traditional machine learning for data analysis. However, its success usually hinges on efficiently training the parameters in quantum neural networks, and the field of QML is still lacking theoretical scaling results for their trainability. Some trainability results have been proven for a closely related field called variational quantum algorithms (VQAs). While both fields involve training a parametrized quantum circuit, there are crucial differences that make the results for one setting not readily applicable to the other. In this work, we bridge the two frameworks and show that gradient scaling results for VQAs can also be applied to study the gradient scaling of QML models. Our results indicate that features deemed detrimental for VQA trainability can also lead to issues such as barren plateaus in QML. Consequently, our work has implications for several QML proposals in the literature. In addition, we provide theoretical and numerical evidence that QML models exhibit further trainability issues not present in VQAs, arising from the use of a training dataset. We refer to these as dataset-induced barren plateaus. These results are most relevant when dealing with classical data, as here the choice of embedding scheme (i.e., the map between classical data and quantum states) can greatly affect the gradient scaling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00103-6"
    },
    {
        "id": 2319,
        "title": "Seeking a quantum advantage for machine learning",
        "authors": "",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s42256-023-00710-9"
    },
    {
        "id": 2320,
        "title": "Is Quantum Tomography a Difficult Problem for Machine Learning?",
        "authors": "Philippe Jacquet",
        "published": "2023-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/psf2022005047"
    },
    {
        "id": 2321,
        "title": "Non-IID quantum federated learning with one-shot communication complexity",
        "authors": "Haimeng Zhao",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-022-00091-z"
    },
    {
        "id": 2322,
        "title": "Hybrid Quantum-Classical Machine Learning for Sentiment Analysis",
        "authors": "Abu Kaisar Mohammad Masum, Anshul Maurya, Dhruthi Sridhar Murthy,  Pratibha, Naveed Mahmud",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00149"
    },
    {
        "id": 2323,
        "title": "Quantum Conformal Prediction for Reliable Uncertainty Quantification in Quantum Machine Learning",
        "authors": "Sangwoo Park, Osvaldo Simeone",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tqe.2023.3333224"
    },
    {
        "id": 2324,
        "title": "Quantum intelligence in medicine: Empowering thyroid disease prediction through advanced machine learning",
        "authors": "Mohemmed Sha",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "AbstractThe medical information system is rich in datasets, but no intelligent systems can easily analyse the disease. Recently, ML (Machine Learning)‐based algorithms have acted as a handy diagnostic tool to identify whether a person is affected by thyroid or not. However, they produced classification with low accuracy and led to misclassification. Hence, the proposed system combines quantum computing with ML techniques to enhance computational power and precision. The system employs modified QPSO (Quantum Particle Swarm Optimisation) for feature selection since its searching performance is better than that of conventional PSO for selecting the optimum global position of the particle, thus selecting the relevant feature. Whereas, the QSVM (Quantum Support Vector Machine) is implemented for more accurate classification than classical SVM, as it tends to capture complex patterns in data produced due to high dimensional feature space applied by quantum kernel functions. This combination of modified QPSO and QSVM tends to increase the performance accuracy significantly. The efficiency of the proposed model is measured based on derivative parameters, such as F‐1‐score, recall, precision and accuracy, with corresponding confusion matrix and ROC. Further, the classification is compared with other traditional approaches to predict the accuracy of the proposed model with traditional methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/qtc2.12078"
    },
    {
        "id": 2325,
        "title": "Adversarial machine learning phases of matter",
        "authors": "Si Jiang, Sirui Lu, Dong-Ling Deng",
        "published": "2023-11-22",
        "citations": 1,
        "abstract": "AbstractWe study the robustness of machine learning approaches to adversarial perturbations, with a focus on supervised learning scenarios. We find that typical phase classifiers based on deep neural networks are extremely vulnerable to adversarial perturbations: adding a tiny amount of carefully crafted noises into the original legitimate examples will cause the classifiers to make incorrect predictions at a notably high confidence level. Through the lens of activation maps, we find that some important underlying physical principles and symmetries remain to be adequately captured for classifiers with even near-perfect performance. This explains why adversarial perturbations exist for fooling these classifiers. In addition, we find that, after adversarial training the classifiers will become more consistent with physical laws and consequently more robust to certain kinds of adversarial perturbations. Our results provide valuable guidance for both theoretical and experimental future studies on applying machine learning techniques to condensed matter physics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s44214-023-00043-z"
    },
    {
        "id": 2326,
        "title": "Quantum Computing for Data Scientists and Quantum Machine Learning",
        "authors": "Bandla Umesh Chandra -",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "Quantum computation and quantum information have sparked tremendous interest across a wide range of scientific disciplines, from physics to chemistry and engineering, as well as computer science, mathematics, and statistics. Data science is the application of statistical methodologies, computer algorithms, and domain scientific data to extract knowledge and insights from large amounts of data and solve complicated real-world issues. As a result, quantum machine learning has carved itself a distinct niche in the world of computers. When the potential of quantum computing characteristics is employed for machine learning, quantum technology advances to an advanced degree. When quantum computing capabilities are incorporated into standard methods, they give extraordinary parallel computing power for addressing complicated problems. The core of this work is a comparison of the fundamental principles of quantum computing and their superiority over traditional computing. This paper discusses application-based algorithms including QSVM, QPCA, and Q-KNN, as well as Grover's algorithm, the most common and foundational quantum machine learning technique.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i06.8830"
    },
    {
        "id": 2327,
        "title": "Towards room-temperature integrated quantum photonics through reduction of the quantum decoherence using machine learning",
        "authors": "Pablo A. Postigo",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2683220"
    },
    {
        "id": 2328,
        "title": "Quantum reinforcement learning via policy iteration",
        "authors": "El Amine Cherrat, Iordanis Kerenidis, Anupam Prakash",
        "published": "2023-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00116-1"
    },
    {
        "id": 2329,
        "title": "Optimized multifidelity machine learning for quantum chemistry",
        "authors": "Vivin Vinod, Ulrich Kleinekathöfer, Peter Zaspel",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nMachine learning (ML) provides access to fast and accurate quantum chemistry (QC) calculations for various properties of interest such as excitation energies. It is often the case that high accuracy in prediction using a ML model, demands a large and costly training set. Various solutions and procedures have been presented to reduce this cost. These include methods such as Δ-ML, hierarchical-ML, and multifidelity machine learning (MFML). MFML combines various Δ-ML like sub-models for various fidelities according to a fixed scheme derived from the sparse grid combination technique. In this work we implement an optimization procedure to combine multifidelity models in a flexible scheme resulting in optimized MFML (o-MFML) that provides superior prediction capabilities. This hyperparameter optimization is carried out on a holdout validation set of the property of interest. This work benchmarks the o-MFML method in predicting the atomization energies on the QM7b dataset, and again in the prediction of excitation energies for three molecules of growing size. The results indicate that o-MFML is a strong methodological improvement over MFML and provides lower error of prediction. Even in cases of poor data distributions and lack of clear hierarchies among the fidelities, which were previously identified as issues for multifidelity methods, the o-MFML is advantageous for the prediction of quantum chemical properties.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/ad2cef"
    },
    {
        "id": 2330,
        "title": "Quantum Advantage Seeker with Kernels (QuASK): a software framework to speed up the research in quantum machine learning",
        "authors": "Francesco Di Marcantonio, Massimiliano Incudini, Davide Tezza, Michele Grossi",
        "published": "2023-6",
        "citations": 2,
        "abstract": "AbstractExploiting the properties of quantum information to the benefit of machine learning models is perhaps the most active field of research in quantum computation. This interest has supported the development of a multitude of software frameworks (e.g. Qiskit, Pennylane, Braket) to implement, simulate, and execute quantum algorithms. Most of them allow us to define quantum circuits, run basic quantum algorithms, and access low-level primitives depending on the hardware such software is supposed to run. For most experiments, these frameworks have to be manually integrated within a larger machine learning software pipeline. The researcher is in charge of knowing different software packages, integrating them through the development of long code scripts, analyzing the results, and generating the plots. Long code often leads to erroneous applications, due to the average number of bugs growing proportional with respect to the program length. Moreover, other researchers will struggle to understand and reproduce the experiment, due to the need to be familiar with all the different software frameworks involved in the code script. We propose QuASK, an open-source quantum machine learning framework written in Python that aids the researcher in performing their experiments, with particular attention to quantum kernel techniques. QuASK can be used as a command-line tool to download datasets, pre-process them, quantum machine learning routines, analyze and visualize the results. QuASK implements most state-of-the-art algorithms to analyze the data through quantum kernels, with the possibility to use projected kernels, (gradient-descent) trainable quantum kernels, and structure-optimized quantum kernels. Our framework can also be used as a library and integrated into pre-existing software, maximizing code reuse.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00107-2"
    },
    {
        "id": 2331,
        "title": "Quantum machine learning for image classification",
        "authors": "Arsenii Senokosov, Alexandr Sedykh, Asel Sagingalieva, Basil Kyriacou, Alexey Melnikov",
        "published": "2024-3-1",
        "citations": 1,
        "abstract": "Abstract\nImage classification, a pivotal task in multiple industries, faces computational challenges due to the burgeoning volume of visual data. This research addresses these challenges by introducing two quantum machine learning models that leverage the principles of quantum mechanics for effective computations. Our first model, a hybrid quantum neural network with parallel quantum circuits, enables the execution of computations even in the noisy intermediate-scale quantum era, where circuits with a large number of qubits are currently infeasible. This model demonstrated a record-breaking classification accuracy of 99.21% on the full MNIST dataset, surpassing the performance of known quantum–classical models, while having eight times fewer parameters than its classical counterpart. Also, the results of testing this hybrid model on a Medical MNIST (classification accuracy over 99%), and on CIFAR-10 (classification accuracy over 82%), can serve as evidence of the generalizability of the model and highlights the efficiency of quantum layers in distinguishing common features of input data. Our second model introduces a hybrid quantum neural network with a Quanvolutional layer, reducing image resolution via a convolution process. The model matches the performance of its classical counterpart, having four times fewer trainable parameters, and outperforms a classical model with equal weight parameters. These models represent advancements in quantum machine learning research and illuminate the path towards more accurate image classification systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/ad2aef"
    },
    {
        "id": 2332,
        "title": "Quantum machine learning framework for virtual screening in drug discovery: a prospective quantum advantage",
        "authors": "Stefano Mensa, Emre Sahin, Francesco Tacchino, Panagiotis Kl Barkoutsos, Ivano Tavernelli",
        "published": "2023-3-1",
        "citations": 16,
        "abstract": "Abstract\nMachine Learning for ligand based virtual screening (LB-VS) is an important in-silico tool for discovering new drugs in a faster and cost-effective manner, especially for emerging diseases such as COVID-19. In this paper, we propose a general-purpose framework combining a classical Support Vector Classifier algorithm with quantum kernel estimation for LB-VS on real-world databases, and we argue in favor of its prospective quantum advantage. Indeed, we heuristically prove that our quantum integrated workflow can, at least in some relevant instances, provide a tangible advantage compared to state-of-art classical algorithms operating on the same datasets, showing strong dependence on target and features selection method. Finally, we test our algorithm on IBM Quantum processors using ADRB2 and COVID-19 datasets, showing that hardware simulations provide results in line with the predicted performances and can surpass classical equivalents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acb900"
    },
    {
        "id": 2333,
        "title": "Exploring the Potential of Quantum-Based Machine Learning: A Comparative Study of QSVM and Classical Machine Learning Algorithms",
        "authors": "Zeynep Özpolat, Murat Karabatak",
        "published": "2023-5-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdfs58141.2023.10131821"
    },
    {
        "id": 2334,
        "title": "Machine learning solutions for cluster reconstruction in planar calorimeters",
        "authors": "Michał Mazurek, Wojciech Krzemień",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0206089"
    },
    {
        "id": 2335,
        "title": "Machine learning for optical quantum metrology",
        "authors": "Luca Pezzè",
        "published": "2023-3-21",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.ap.5.2.020501"
    },
    {
        "id": 2336,
        "title": "Advancements in Quantum Machine Learning and Quantum Deep Learning: A Comprehensive Review of Algorithms, Challenges, and Future Directions",
        "authors": "G S Priyanka, M Venkatesan, P Prabhavathy",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iq-cchess56596.2023.10391745"
    },
    {
        "id": 2337,
        "title": "Hybrid classical-quantum transfer learning for text classification",
        "authors": "Ebrahim Ardeshir-Larijani, Mohammad Mahdi Nasiri Fatmehsari",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00147-2"
    },
    {
        "id": 2338,
        "title": "Pancreatic Cancer Data Classification with Quantum Machine Learning",
        "authors": "Amit Saxena, Smita Saxena",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/jqc.2023.044555"
    },
    {
        "id": 2339,
        "title": "Quantum machine learning based on continuous variable single-photon states: an elementary foundation for quantum neural networks",
        "authors": "Ebrahim Ghasemian, Abolhassan Razminia, Habib Rostami",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-04137-4"
    },
    {
        "id": 2340,
        "title": "Machine-learning enhanced quantum state tomography and quantum noise reduction to the advanced gravitational wave detectors",
        "authors": "Ray-Kuang Lee",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3012148"
    },
    {
        "id": 2341,
        "title": "Learning Circular Hidden Quantum Markov Models: A Tensor Network Approach",
        "authors": "Mohammad Ali Javidian, Vaneet Aggarwal, Zubin Jacob",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tqe.2023.3319254"
    },
    {
        "id": 2342,
        "title": "Hybrid Quantum Machine learning using Quantum Integrated Cloud Architecture (QICA)",
        "authors": "Samih Fadli, Bharat S Rawal, Andrew Mentges",
        "published": "2023-2-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074394"
    },
    {
        "id": 2343,
        "title": "Grover’s search with learning oracle for constrained binary optimization problems",
        "authors": "Hiroshi Ohno",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00148-1"
    },
    {
        "id": 2344,
        "title": "Variational quantum circuit-based quantum machine learning approach for predicting corrosion inhibition efficiency of pyridine-quinoline compounds",
        "authors": "Muhamad Akrom, Supriadi Rustad, Hermawan Kresno Dipojono",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mtquan.2024.100007"
    },
    {
        "id": 2345,
        "title": "Quantum Neural Networks: Bridging Quantum Computing and Machine Learning",
        "authors": "Reji Kurien Thomas",
        "published": "2023-6-15",
        "citations": 2,
        "abstract": "The usage of QNNs is one approach that might be used to close the knowledge gap that exists between the domains of machine learning and quantum computing. As a result of this research, a full analysis of QNNs has been offered, covering a wide range of issues including their theoretical underpinnings, training techniques, benefits, limits, applications, and assessment methodologies. Quantum neural networks, also known as QNNs, are a type of artificial neural network that makes use of the power of quantum computing. These networks provide the promise for a significant improvement in processing speed as well as greater representation capabilities. On the other hand, in order to make full advantage of the benefits that QNNs give, obstacles such as scalability concerns and hardware restrictions need to be addressed and fixed. The fact that QNNs have the potential to be applied in such a broad range of different sectors is evidence of both the adaptability and the significance of this rapidly developing field of study. It will be necessary to do more study and investigation if there is to be any hope of making headway in the field of quantum machine learning with regard to the creation of QNNs and of realizing their full potential.",
        "keywords": "",
        "link": "http://dx.doi.org/10.9734/ajrcos/2023/v16i3340"
    },
    {
        "id": 2346,
        "title": "Quantum-Enhanced Neural Networks for Binary Classification: Leveraging Quantum Features to Improve Machine Learning",
        "authors": "",
        "published": "2024-2-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets48969"
    },
    {
        "id": 2347,
        "title": "Experimental realization of a quantum classification: Bell state measurement via machine learning",
        "authors": "Qing-Yuan Wu, Zhe Meng, Xiao-Xiao Chen, Jian Li, Jia-Zhi Yang, An-Ning Zhang",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "The Bell state is a crucial resource for the realization of quantum information tasks, and when combined with orbital angular momentum (OAM), it enables a high-dimensional Hilbert space, which is essential for high-capacity quantum communication. In this study, we demonstrate the recognition of OAM Bell states using interference patterns generated by a classical light source and a single-photon source from a Sagnac interferometer-based OAM Bell state evolution device. The interference patterns exhibit a one-to-one correspondence with the input Bell states, providing conclusive evidence for the full recognition of OAM Bell states. Furthermore, we introduce machine learning to the field of Bell state recognition by proposing a neural network model capable of accurately recognizing higher order single-photon OAM Bell states, even in the undersampling case. In particular, the model’s training set includes interference patterns of OAM Bell states generated by classical light sources, yet it is able to recognize single-photon OAM Bell states with high accuracy, without relying on quantum resources during training. Our innovative application of neural networks to the recognition of single-photon OAM Bell states not only circumvents the resource consumption and experimental difficulties associated with quantum light sources but also facilitates the study of OAM-based quantum information.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0149414"
    },
    {
        "id": 2348,
        "title": "Quantum machine learning approach for classification: case studies and implications",
        "authors": "Nadia Ahmed Sharna, Emamul Islam",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3010006"
    },
    {
        "id": 2349,
        "title": "Shipping inspection trial of quantum machine learning toward  sustainable quantum factory",
        "authors": "Takao Tomono, Satoko Natsubori",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "In recent years, the diversification of consumer values has led to an increase in the number of small-quantity, high-mix products. For many manufacturing companies, shipping inspections of such products are of great importance. As all products have the same value, good and defective products need to be efficiently identified. Now, a promising future application of quantum technology is considered to be quantum machine learning. We believe that the quantum classifier for SVMs using quantum kernels is one of the areas where quantum advantages can be demonstrated. At present, there are few examples of quantum classifiers applied to real problems in manufacturing processes. In this study, we aim to build a classifier that can demonstrate the quantum advantage and compare SVMs using classical and quantum kernels with conventional ResNet. Initially, a binarised image was generated after image pre-processing. After principal component analysis and dimensionality reduction were performed on the images, SVM with kernels was carried out. The kernel-based SVMs was then compared with the conventionally implemented Residual neural network (ResNet) using an evaluation index: F1-score. The results showed that the F1-score of SVMs using classical kernels was equivalent to that of Resnet. In addition, SVMs using quantum kernels showed higher F1-score than ResNet. In addition, the impact of the feature map and principal components of the quantum kernel was also investigated. It was found that when the feature map became more complex, conversely, circuit generation took more time. It was also found that the principal components are highly relevant to the image and cannot lead to simple results. In the future, we plan to accumulate more experimental data, look for scenes where quantum machine learning can be used and apply it to the manufacturing field.  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36001/phmap.2023.v4i1.3733"
    },
    {
        "id": 2350,
        "title": "Improving phishing detection in Ethereum transaction network using Quantum Machine Learning",
        "authors": "Anupama Ray, Sai Sakunthala, Anil Prabhakar",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00125"
    },
    {
        "id": 2351,
        "title": "A quantum information theoretic view on a deep quantum neural network",
        "authors": "Beatrix C. Hiesmayr",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0203600"
    },
    {
        "id": 2352,
        "title": "A Classifiers Experimentation with Quantum Machine Learning",
        "authors": "Chaiyaporn Khemapatapan, Thammanoon Thepsena, Aomduan Jeamaon",
        "published": "2023-3-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieecon56657.2023.10126672"
    },
    {
        "id": 2353,
        "title": "Exploiting Symmetry in Variational Quantum Machine Learning",
        "authors": "Johannes Jakob Meyer, Marian Mularski, Elies Gil-Fuster, Antonio Anna Mele, Francesco Arzani, Alissa Wilms, Jens Eisert",
        "published": "2023-3-17",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/prxquantum.4.010328"
    },
    {
        "id": 2354,
        "title": "Comparing quantum and classical machine learning for Vector Boson Scattering background reduction at the Large Hadron Collider",
        "authors": "Davide Cugini, Dario Gerace, Pietro Govoni, Aurora Perego, Davide Valsecchi",
        "published": "2023-12",
        "citations": 1,
        "abstract": "AbstractWe report on a consistent comparison between techniques of quantum and classical machine learning applied to the classification of signal and background events for the Vector Boson Scattering processes, studied at the Large Hadron Collider installed at the CERN laboratory. Quantum machine learning algorithms based on variational quantum circuits are run on freely available quantum computing hardware, showing very good performances as compared to deep neural networks run on classical computing facilities. In particular, we show that such kind of quantum neural networks is able to correctly classify the targeted signal with an Area Under the characteristic Curve (AUC) that is very close to the one obtained with the corresponding classical neural network, but employing a much lower number of resources, as well as less variable data in the training set. Albeit giving a proof-of-principle demonstration with limited quantum computing resources, this work represents one of the first steps towards the use of near term and noisy quantum hardware for practical event classification in High Energy Physics experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00106-3"
    },
    {
        "id": 2355,
        "title": "Quantum-Improved Weather Forecasting: Integrating Quantum Machine Learning for Precise Prediction and Disaster Mitigation",
        "authors": "S Suhas, S Divya",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iq-cchess56596.2023.10391714"
    },
    {
        "id": 2356,
        "title": "A new quantum machine learning algorithm: split hidden quantum Markov model inspired by quantum conditional master equation",
        "authors": "Xiao-Yu Li, Qin-Sheng Zhu, Yong Hu, Hao Wu, Guo-Wu Yang, Lian-Hui Yu, Geng Chen",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "The Hidden Quantum Markov Model (HQMM) has significant potential for analyzing time-series data and studying stochastic processes in the quantum domain as an upgrading option with potential advantages over classical Markov models. In this paper, we introduced the split HQMM (SHQMM) for implementing the hidden quantum Markov process, utilizing the conditional master equation with a fine balance condition to demonstrate the interconnections among the internal states of the quantum system. The experimental results suggest that our model outperforms previous models in terms of scope of applications and robustness. Additionally, we establish a new learning algorithm to solve parameters in HQMM by relating the quantum conditional master equation to the HQMM. Finally, our study provides clear evidence that the quantum transport system can be considered a physical representation of HQMM. The SHQMM with accompanying algorithms present a novel method to analyze quantum systems and time series grounded in physical implementation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2024-01-24-1232"
    },
    {
        "id": 2357,
        "title": "Machine Learning in the Quantum Era",
        "authors": "Sachin Khurana, Manisha J Nene",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425372"
    },
    {
        "id": 2358,
        "title": "An Empirical Study of Bugs in Quantum Machine Learning Frameworks",
        "authors": "Pengzhan Zhao, Xiongfei Wu, Junjie Luo, Zhuo Li, Jianjun Zhao",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qsw59989.2023.00018"
    },
    {
        "id": 2359,
        "title": "An Experimental Study on the Differences between Classical Machine Learning and Quantum Machine Learning Models",
        "authors": " Vineet Kumar,  Subrata Sahana",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "The field of Machine Learning (ML) brought a massive revolution and change in how normal day operations used to happen in various businesses. The idea of ML was quite simple, merging two separate fields, Mathematics and Computer Science. This simple idea is the very reason that so many predictive and classification-based applications exist today. The development of such applications is a time-consuming process and is very computationally heavy because in the corporate world, a very large amount of historical data is used and processed. The training processes such as pre-processing, data engineering and transformations, deep learning, training and testing are themselves time consuming. A very new field of computer science deals with solving this exact problem of time consumption. Quantum Computing (QC) tries to solve these problems by using the concepts of Quantum Mechanics during computations. The QC technology claims to be not only fast in its computational speed but also more efficient and accurate as well. The following article consists of an experiment conducted where a machine learning model is trained in a classical computing environment using K-Nearest Neighbors (KNN) algorithm versus in a quantum computing environment using Quantum K-Nearest Neighbors (QKNN) algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58260/j.nras.2202.0107"
    },
    {
        "id": 2360,
        "title": "Quantum photonics based health monitoring system using music data analysis by machine learning models",
        "authors": "Jing Zhu",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06129-1"
    },
    {
        "id": 2361,
        "title": "Machine learning meets quantum mechanics in catalysis",
        "authors": "James P. Lewis, Pengju Ren, Xiaodong Wen, Yongwang Li, Guanhua Chen",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Over the past decade many researchers have applied machine learning algorithms with computational chemistry and materials science tools to explore properties of catalysts. There is a rapid increase in publications demonstrating the use of machine learning for rational catalyst design. In our perspective, targeted tools for rational catalyst design will continue to make significant contributions. However, the community should focus on developing high-throughput simulation tools that utilize molecular dynamics capabilities for thorough exploration of the complex potential energy surfaces that exist, particularly in heterogeneous catalysis. Catalyst-specific databases should be developed to contain enough data to represent the complex multi-dimensional space that defines structure-function relationships. Machine learning tools will continue to impact rational catalyst design; however, we believe that more sophisticated pattern recognition algorithms would yield better understanding of structure-function relationships for heterogeneous catalysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frqst.2023.1232903"
    },
    {
        "id": 2362,
        "title": "Resource frugal optimizer for quantum machine learning",
        "authors": "Charles Moussa, Max Hunter Gordon, Michal Baczyk, M Cerezo, Lukasz Cincio, Patrick J Coles",
        "published": "2023-10-1",
        "citations": 2,
        "abstract": "Abstract\nQuantum-enhanced data science, also known as quantum machine learning (QML), is of growing interest as an application of near-term quantum computers. Variational QML algorithms have the potential to solve practical problems on real hardware, particularly when involving quantum data. However, training these algorithms can be challenging and calls for tailored optimization procedures. Specifically, QML applications can require a large shot-count overhead due to the large datasets involved. In this work, we advocate for simultaneous random sampling over both the dataset as well as the measurement operators that define the loss function. We consider a highly general loss function that encompasses many QML applications, and we show how to construct an unbiased estimator of its gradient. This allows us to propose a shot-frugal gradient descent optimizer called Refoqus (REsource Frugal Optimizer for QUantum Stochastic gradient descent). Our numerics indicate that Refoqus can save several orders of magnitude in shot cost, even relative to optimizers that sample over measurement operators alone.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2058-9565/acef55"
    },
    {
        "id": 2363,
        "title": "Advances in Quantum Medical Image Analysis Using Machine Learning: Current Status and Future Directions",
        "authors": "Nadine Matondo-Mvula, Khaled Elleithy",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00049"
    },
    {
        "id": 2364,
        "title": "Generative model for learning quantum ensemble with optimal transport loss",
        "authors": "Hiroyuki Tezuka, Shumpei Uno, Naoki Yamamoto",
        "published": "2024-6",
        "citations": 0,
        "abstract": "AbstractGenerative modeling is an unsupervised machine learning framework, that exhibits strong performance in various machine learning tasks. Recently, we find several quantum versions of generative model, some of which are even proven to have quantum advantage. However, those methods are not directly applicable to construct a generative model for learning a set of quantum states, i.e., ensemble. In this paper, we propose a quantum generative model that can learn quantum ensemble, in an unsupervised machine learning framework. The key idea is to introduce a new loss function calculated based on optimal transport loss, which have been widely used in classical machine learning due to its good properties; e.g., no need to ensure the common support of two ensembles. We then give in-depth analysis on this measure, such as the scaling property of the approximation error. We also demonstrate the generative modeling with the application to quantum anomaly detection problem, that cannot be handled via existing methods. The proposed model paves the way for a wide application such as the health check of quantum devices and efficient initialization of quantum computation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00142-7"
    },
    {
        "id": 2365,
        "title": "Quantum transfer learning for acceptability judgements",
        "authors": "Giuseppe Buonaiuto, Raffaele Guarasci, Aniello Minutolo, Giuseppe De Pietro, Massimo Esposito",
        "published": "2024-6",
        "citations": 1,
        "abstract": "AbstractHybrid quantum-classical classifiers promise to positively impact critical aspects of natural language processing tasks, particularly classification-related ones. Among the possibilities currently investigated, quantum transfer learning, i.e., using a quantum circuit for fine-tuning pre-trained classical models for a specific task, is attracting significant attention as a potential platform for proving quantum advantage. This work shows potential advantages, in terms of both performance and expressiveness, of quantum transfer learning algorithms trained on embedding vectors extracted from a large language model to perform classification on a classical linguistics task—acceptability judgements. Acceptability judgement is the ability to determine whether a sentence is considered natural and well-formed by a native speaker. The approach has been tested on sentences extracted from ItaCoLa, a corpus that collects Italian sentences labeled with their acceptability judgement. The evaluation phase shows results for the quantum transfer learning pipeline comparable to state-of-the-art classical transfer learning algorithms, proving current quantum computers’ capabilities to tackle NLP tasks for ready-to-use applications. Furthermore, a qualitative linguistic analysis, aided by explainable AI methods, reveals the capabilities of quantum transfer learning algorithms to correctly classify complex and more structured sentences, compared to their classical counterpart. This finding sets the ground for a quantifiable quantum advantage in NLP in the near future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00141-8"
    },
    {
        "id": 2366,
        "title": "Bayesian learning of parameterised quantum circuits",
        "authors": "Samuel Duffield, Marcello Benedetti, Matthias Rosenkranz",
        "published": "2023-6-1",
        "citations": 2,
        "abstract": "Abstract\nCurrently available quantum computers suffer from constraints including hardware noise and a limited number of qubits. As such, variational quantum algorithms that utilise a classical optimiser in order to train a parameterised quantum circuit have drawn significant attention for near-term practical applications of quantum technology. In this work, we take a probabilistic point of view and reformulate the classical optimisation as an approximation of a Bayesian posterior. The posterior is induced by combining the cost function to be minimised with a prior distribution over the parameters of the quantum circuit. We describe a dimension reduction strategy based on a maximum a posteriori point estimate with a Laplace prior. Experiments on the Quantinuum H1-2 computer show that the resulting circuits are faster to execute and less noisy than the circuits trained without the dimension reduction strategy. We subsequently describe a posterior sampling strategy based on stochastic gradient Langevin dynamics. Numerical simulations on three different problems show that the strategy is capable of generating samples from the full posterior and avoiding local optima.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc8b7"
    },
    {
        "id": 2367,
        "title": "Advances in Quantum Machine Learning and Deep Learning for Image Classification: A Survey",
        "authors": "Ruba Kharsa, Ahmed Bouridane, Abbes Amira",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126843"
    },
    {
        "id": 2368,
        "title": "Conditional generative models for learning stochastic processes",
        "authors": "Salvatore Certo, Anh Pham, Nicolas Robles, Andrew Vlasic",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00129-w"
    },
    {
        "id": 2369,
        "title": "Quantum and Classical Computing using Machine Learning Techniques",
        "authors": "S. Padmakala",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370566"
    },
    {
        "id": 2370,
        "title": "Machine Learning Force Fields for Colloidal Quantum Dots",
        "authors": "Mario Fernández-Pendás, Ivan Infante",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29363/nanoge.matsus.2024.385"
    },
    {
        "id": 2371,
        "title": "Quantum Computing in Machine Learning - The Future of Quantum Computing",
        "authors": " Vinutha R,  Haripriya V",
        "published": "2024-3-23",
        "citations": 0,
        "abstract": "In order to solve challenging optimization issues, analyze data effectively, and improve the capabilities of current machine learning algorithms, quantum computing has the potential to revolutionize the area of machine learning. The proposed work examines the fundamental ideas and methods of quantum computing—including quantum gates, quantum circuits, and quantum algorithms—as they relate to machine learning in this abstract. Various quantum computing applications in machine learning, including quantum neural networks, quantum support vector machines, and conventional methods influenced by quantum mechanics are also discussed. A review of state-of-the-art in quantum computing for machine learning, including recent advancements in quantum hardware and software has been done and the future prospects of this fascinating area has been examined.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-15955"
    },
    {
        "id": 2372,
        "title": "Quantum Machine Learning: Past, Present, and Future",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ajcis.2023.061214"
    },
    {
        "id": 2373,
        "title": "Evaluating Quantum Machine Learning Approaches for Histopathological Cancer Detection: Classical, Hybrid Simulation, and IBM Quantum Computing",
        "authors": "Biswaraj Baral, Reek Majumdar, Bhavika Bhalgamiya, Taposh Dutta Roy",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10222"
    },
    {
        "id": 2374,
        "title": "The New Answer to Drug Discovery: Quantum Machine Learning in Preclinical Drug Development",
        "authors": "Yew Kee Wong, Yifan Zhou, Yan Shing Liang, Haichuan Qiu, Yu Xi Wu, Bin He",
        "published": "2023-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/prml59573.2023.10348356"
    },
    {
        "id": 2375,
        "title": "From conceptual spaces to quantum concepts: formalising and learning structured conceptual models",
        "authors": "Sean Tull, Razin A. Shaikh, Sara Sabrina Zemljič, Stephen Clark",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00134-z"
    },
    {
        "id": 2376,
        "title": "Quantum photonics based music signal analysis with optical sensor in health monitoring using machine learning model",
        "authors": "Siwen Li",
        "published": "2024-1-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06247-w"
    },
    {
        "id": 2377,
        "title": "Quantum Machine Learning—An Overview",
        "authors": "Kyriaki A. Tychola, Theofanis Kalampokas, George A. Papakostas",
        "published": "2023-5-24",
        "citations": 8,
        "abstract": "Quantum computing has been proven to excel in factorization issues and unordered search problems due to its capability of quantum parallelism. This unique feature allows exponential speed-up in solving certain problems. However, this advantage does not apply universally, and challenges arise when combining classical and quantum computing to achieve acceleration in computation speed. This paper aims to address these challenges by exploring the current state of quantum machine learning and benchmarking the performance of quantum and classical algorithms in terms of accuracy. Specifically, we conducted experiments with three datasets for binary classification, implementing Support Vector Machine (SVM) and Quantum SVM (QSVM) algorithms. Our findings suggest that the QSVM algorithm outperforms classical SVM on complex datasets, and the performance gap between quantum and classical models increases with dataset complexity, as simple models tend to overfit with complex datasets. While there is still a long way to go in terms of developing quantum hardware with sufficient resources, quantum machine learning holds great potential in areas such as unsupervised learning and generative models. Moving forward, more efforts are needed to explore new quantum learning models that can leverage the power of quantum mechanics to overcome the limitations of classical machine learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12112379"
    },
    {
        "id": 2378,
        "title": "Optical wearable sensor based dance motion detection in health monitoring system using quantum machine learning model",
        "authors": "Yaxin Hou",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06143-3"
    },
    {
        "id": 2379,
        "title": "Expressivity of Variational Quantum Machine Learning on the Boolean Cube",
        "authors": "Dylan Herman, Rudy Raymond, Muyuan Li, Nicolas Robles, Antonio Mezzacapo, Marco Pistoia",
        "published": "2023",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tqe.2023.3255206"
    },
    {
        "id": 2380,
        "title": "Application of quantum machine learning using quantum kernel algorithms on multiclass neuron M-type classification",
        "authors": "Xavier Vasques, Hanhee Paik, Laura Cif",
        "published": "2023-7-17",
        "citations": 1,
        "abstract": "AbstractThe functional characterization of different neuronal types has been a longstanding and crucial challenge. With the advent of physical quantum computers, it has become possible to apply quantum machine learning algorithms to translate theoretical research into practical solutions. Previous studies have shown the advantages of quantum algorithms on artificially generated datasets, and initial experiments with small binary classification problems have yielded comparable outcomes to classical algorithms. However, it is essential to investigate the potential quantum advantage using real-world data. To the best of our knowledge, this study is the first to propose the utilization of quantum systems to classify neuron morphologies, thereby enhancing our understanding of the performance of automatic multiclass neuron classification using quantum kernel methods. We examined the influence of feature engineering on classification accuracy and found that quantum kernel methods achieved similar performance to classical methods, with certain advantages observed in various configurations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-38558-z"
    },
    {
        "id": 2381,
        "title": "Quantum convolutional neural networks for multi-channel supervised learning",
        "authors": "Anthony M. Smaldone, Gregory W. Kyro, Victor S. Batista",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00130-3"
    },
    {
        "id": 2382,
        "title": "Quantum computer based feature selection in machine learning",
        "authors": "Gerhard Hellstern, Vanessa Dehn, Martin Zaefferer",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "AbstractThe problem of selecting an appropriate number of features in supervised learning problems is investigated. Starting with common methods in machine learning, the feature selection task is treated as a quadratic unconstrained optimisation problem (QUBO), which can be tackled with classical numerical methods as well as within a quantum computing framework. The different results in small problem instances are compared. According to the results of the authors’ study, whether the QUBO method outperforms other feature selection methods depends on the data set. In an extension to a larger data set with 27 features, the authors compare the convergence behaviour of the QUBO methods via quantum computing with classical stochastic optimisation methods. Due to persisting error rates, the classical stochastic optimisation methods are still superior.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/qtc2.12086"
    },
    {
        "id": 2383,
        "title": "The effect of superposition and entanglement on hybrid quantum machine learning for weather forecasting",
        "authors": "Besir Ogur, Ihsan Yılmaz",
        "published": "2023-2",
        "citations": 0,
        "abstract": "Recently,  proposed algorithms for quantum computing and generated quantum computer technologies continue to evolve. On the other hand, machine learning has become an essential method for solving many problems such as computer vision, natural language processing, prediction and classification. Quantum machine learning is a new field developed by combining the advantages of these two primary methods. As a hybrid approach to quantum and classical computing, variational quantum circuits are a form of machine learning that allows predicting an output value against input variables. In this study, the effects of superposition and entanglement on weather forecasting, were investigated using a variational quantum circuit model when the dataset size is small. The use of the entanglement layer between the variational layers has made significant improvements on the circuit performance. The use of the superposition layer before the data encoding layer resulted in the use of less variational layers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26421/qic23.3-4-1"
    },
    {
        "id": 2384,
        "title": "On the Applicability of Quantum Machine Learning",
        "authors": "Sebastian Raubitzek, Kevin Mallinger",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "In this article, we investigate the applicability of quantum machine learning for classification tasks using two quantum classifiers from the Qiskit Python environment: the variational quantum circuit and the quantum kernel estimator (QKE). We provide a first evaluation on the performance of these classifiers when using a hyperparameter search on six widely known and publicly available benchmark datasets and analyze how their performance varies with the number of samples on two artificially generated test classification datasets. As quantum machine learning is based on unitary transformations, this paper explores data structures and application fields that could be particularly suitable for quantum advantages. Hereby, this paper introduces a novel dataset based on concepts from quantum mechanics using the exponential map of a Lie algebra. This dataset will be made publicly available and contributes a novel contribution to the empirical evaluation of quantum supremacy. We further compared the performance of VQC and QKE on six widely applicable datasets to contextualize our results. Our results demonstrate that the VQC and QKE perform better than basic machine learning algorithms, such as advanced linear regression models (Ridge and Lasso). They do not match the accuracy and runtime performance of sophisticated modern boosting classifiers such as XGBoost, LightGBM, or CatBoost. Therefore, we conclude that while quantum machine learning algorithms have the potential to surpass classical machine learning methods in the future, especially when physical quantum infrastructure becomes widely available, they currently lag behind classical approaches. Our investigations also show that classical machine learning approaches have superior performance classifying datasets based on group structures, compared to quantum approaches that particularly use unitary processes. Furthermore, our findings highlight the significant impact of different quantum simulators, feature maps, and quantum circuits on the performance of the employed quantum estimators. This observation emphasizes the need for researchers to provide detailed explanations of their hyperparameter choices for quantum machine learning algorithms, as this aspect is currently overlooked in many studies within the field. To facilitate further research in this area and ensure the transparency of our study, we have made the complete code available in a linked GitHub repository.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25070992"
    },
    {
        "id": 2385,
        "title": "Contribution of Artificial Intelligence and Machine Learning in Development of Quantum Computing",
        "authors": "Manikanta Korrapati",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4778852"
    },
    {
        "id": 2386,
        "title": "A Quick Overview of Quantum Machine Learning",
        "authors": "Jehn-Ruey Jiang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecice59523.2023.10383149"
    },
    {
        "id": 2387,
        "title": "Quantum Machine Learning and Recent Advancements",
        "authors": "Manjunath T D, Biswajit Bhowmik",
        "published": "2023-1-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisc56616.2023.10085586"
    },
    {
        "id": 2388,
        "title": "Telecom‐Band Quantum Dots Compatible with Silicon Photonics for Photonic Quantum Applications",
        "authors": "Ryota Katsumi, Yasutomo Ota, Mohamed Benyoucef",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "AbstractSilicon photonics is promising for quantum photonics applications owing to its large‐scale and high‐performance circuitry enabled by complementary‐metal‐oxide‐semiconductor fabrication processes. However, there is a lack of bright single‐photon sources (SPSs) capable of deterministic operation on Si platforms, which largely limits their applications. To this end, on‐Si integration of high‐performance solid‐state quantum emitters, such as semiconductor quantum dots (QDs), is greatly desired. In particular, it is preferable to integrate SPSs emitting at telecom wavelengths for fully leveraging the power of silicon photonics, including efficient chip‐to‐fiber coupling. In this review, recent progress and challenges in the integration of telecom QD SPSs onto silicon photonic platforms are discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/qute.202300423"
    },
    {
        "id": 2389,
        "title": "Quantum-aided feature selection model – A quantum machine learning approach",
        "authors": "Rupam Bhagawati, Thiruselvan Subramanian",
        "published": "2023",
        "citations": 0,
        "abstract": "The accuracy of information retrieval systems is measured by the relevancy of retrieved results as per the user’s query. Relevant results are presented by performing various methods viz. indexing and crawling and the output of these processes is the retrieved results that have to pass through the ranking process which is the central goal of information retrieval systems. The ranking is carried out through the classification or clustering of processed results which can include redundant and noisy features. The accuracy of classification or clusters for the ranking process can be maximized by removing noisy and duplicate features through the feature selection method. Although feature selection is an expensive computational process, after many decades, quantum computation tools are in use for many algorithms to implement realistic problems, particularly in the standard of Quantum Annealing. This paper focuses to prospect the standard of quantum computing in order to increase the quality of information classes through the feature selection method. The persuasiveness of the quantum approach is comparable to the classical process that focused on the reliability of quantum methodology from different perspectives.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jdmsc-1735"
    },
    {
        "id": 2390,
        "title": "Automated segmentation and classification of hand thermal images in rheumatoid arthritis using machine learning algorithms: A comparison with quantum machine learning technique",
        "authors": "R.K. Ahalya, U. Snekhalatha, Varun Dhanraj",
        "published": "2023-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jtherbio.2022.103404"
    },
    {
        "id": 2391,
        "title": "Financial fraud detection: A comparative study of quantum machine learning models",
        "authors": "Nouhaila Innan, Muhammad Al-Zafar Khan, Mohamed Bennai",
        "published": "2024-3",
        "citations": 1,
        "abstract": " In this research, a comparative study of four Quantum Machine Learning (QML) models was conducted for fraud detection in finance. We proved that the Quantum Support Vector Classifier model achieved the highest performance, with F1 scores of [Formula: see text] for fraud and nonfraud classes. Other models like the Variational Quantum Classifier (VQC), Estimator Quantum Neural Network (QNN), and Sampler QNN demonstrate promising results, propelling the potential of QML classification for financial applications. While they exhibit certain limitations, the insights attained pave the way for future enhancements and optimization strategies. However, challenges exist, including the need for more efficient quantum algorithms and larger and more complex datasets. This paper provides solutions to overcome current limitations and contributes new insights to the field of QML in fraud detection, with important implications for its future development. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0219749923500442"
    },
    {
        "id": 2392,
        "title": "Enhancing sports performance through quantum-based wearable health monitoring data analysis using machine learning",
        "authors": "Feng Du",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-05800-x"
    },
    {
        "id": 2393,
        "title": "Artificial intelligence and machine learning for quantum technologies",
        "authors": "Mario Krenn, Jonas Landgraf, Thomas Foesel, Florian Marquardt",
        "published": "2023-1-3",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physreva.107.010101"
    },
    {
        "id": 2394,
        "title": "Encrypted machine learning of molecular quantum properties",
        "authors": "Jan Weinreich, Guido Falk von Rudorff, O Anatole von Lilienfeld",
        "published": "2023-6-1",
        "citations": 1,
        "abstract": "Abstract\nLarge machine learning (ML) models with improved predictions have become widely available in the chemical sciences. Unfortunately, these models do not protect the privacy necessary within commercial settings, prohibiting the use of potentially extremely valuable data by others. Encrypting the prediction process can solve this problem by double-blind model evaluation and prohibits the extraction of training or query data. However, contemporary ML models based on fully homomorphic encryption or federated learning are either too expensive for practical use or have to trade higher speed for weaker security. We have implemented secure and computationally feasible encrypted ML models using oblivious transfer enabling and secure predictions of molecular quantum properties across chemical compound space. However, we find that encrypted predictions using kernel ridge regression models are a million times more expensive than without encryption. This demonstrates a dire need for a compact ML model architecture, including molecular representation and kernel matrix size, that minimizes model evaluation costs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc928"
    },
    {
        "id": 2395,
        "title": "Quantum machine learning of large datasets using randomized measurements",
        "authors": "Tobias Haug, Chris N Self, M S Kim",
        "published": "2023-3-1",
        "citations": 11,
        "abstract": "Abstract\nQuantum computers promise to enhance machine learning for practical applications. Quantum machine learning for real-world data has to handle extensive amounts of high-dimensional data. However, conventional methods for measuring quantum kernels are impractical for large datasets as they scale with the square of the dataset size. Here, we measure quantum kernels using randomized measurements. The quantum computation time scales linearly with dataset size and quadratic for classical post-processing. While our method scales in general exponentially in qubit number, we gain a substantial speed-up when running on intermediate-sized quantum computers. Further, we efficiently encode high-dimensional data into quantum computers with the number of features scaling linearly with the circuit depth. The encoding is characterized by the quantum Fisher information metric and is related to the radial basis function kernel. Our approach is robust to noise via a cost-free error mitigation scheme. We demonstrate the advantages of our methods for noisy quantum computers by classifying images with the IBM quantum computer. To achieve further speedups we distribute the quantum computational tasks between different quantum computers. Our method enables benchmarking of quantum machine learning algorithms with large datasets on currently available quantum computers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acb0b4"
    },
    {
        "id": 2396,
        "title": "Optical sensor based quantum computing in sports medicine for diagnosis and data analysis using machine learning model",
        "authors": "Wanghao Xu",
        "published": "2024-1-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06066-z"
    },
    {
        "id": 2397,
        "title": "Quantum Matching Algorithm for Biometric Fingerprints",
        "authors": "Gabriela Mogos",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3647750.3647780"
    },
    {
        "id": 2398,
        "title": "Exploring Quantum Machine Learning for Electroencephalogram Classification",
        "authors": "Raymond Ho, Kevin Hung",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscaie57739.2023.10165407"
    },
    {
        "id": 2399,
        "title": "Luminescence Study of CdSe Quantum Dots Using Machine Learning Techniques",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55487/29w2p285"
    },
    {
        "id": 2400,
        "title": "Variational Methods in Optical Quantum Machine Learning",
        "authors": "Marco Simonetti, Damiano Perri, Osvaldo Gervasi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3335625"
    },
    {
        "id": 2401,
        "title": "Teaching Quantum Machine Learning in Computer Science",
        "authors": "Gennaro De Luca, Yinong Chen",
        "published": "2023-3-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isads56919.2023.10092171"
    },
    {
        "id": 2402,
        "title": "Quantum Machine Learning: A Review and Case Studies",
        "authors": "Amine Zeguendry, Zahi Jarir, Mohamed Quafafou",
        "published": "2023-2-3",
        "citations": 27,
        "abstract": "Despite its undeniable success, classical machine learning remains a resource-intensive process. Practical computational efforts for training state-of-the-art models can now only be handled by high speed computer hardware. As this trend is expected to continue, it should come as no surprise that an increasing number of machine learning researchers are investigating the possible advantages of quantum computing. The scientific literature on Quantum Machine Learning is now enormous, and a review of its current state that can be comprehended without a physics background is necessary. The objective of this study is to present a review of Quantum Machine Learning from the perspective of conventional techniques. Departing from giving a research path from fundamental quantum theory through Quantum Machine Learning algorithms from a computer scientist’s perspective, we discuss a set of basic algorithms for Quantum Machine Learning, which are the fundamental components for Quantum Machine Learning algorithms. We implement the Quanvolutional Neural Networks (QNNs) on a quantum computer to recognize handwritten digits, and compare its performance to that of its classical counterpart, the Convolutional Neural Networks (CNNs). Additionally, we implement the QSVM on the breast cancer dataset and compare it to the classical SVM. Finally, we implement the Variational Quantum Classifier (VQC) and many classical classifiers on the Iris dataset to compare their accuracies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25020287"
    },
    {
        "id": 2403,
        "title": "The effects of quantum hardware properties on the performances of variational quantum learning algorithms",
        "authors": "Giuseppe Buonaiuto, Francesco Gargiulo, Giuseppe De Pietro, Massimo Esposito, Marco Pota",
        "published": "2024-6",
        "citations": 1,
        "abstract": "AbstractIn-depth theoretical and practical research is nowadays being performed on variational quantum algorithms (VQAs), which have the potential to surpass traditional, classical, algorithms on a variety of problems, in physics, chemistry, biology, and optimization. Because they are hybrid quantum-classical algorithms, it takes a certain set of optimal conditions for their full potential to be exploited. For VQAs, the construction of an appropriate ansatz in particular is crucial, since it lays the ground for efficiently solving the particular problem being addressed. To prevent severe negative effects that hamper quantum computation, the substantial noise, together with the structural limitations, characteristic of currently available devices must be also taken into consideration while building the ansatz. In this work the effect of the quantum hardware structure, namely the topological properties emerging from the couplings between the physical qubits and the basis gates of the device itself, on the performances of VQAs is addressed. Specifically, it is here experimentally shown that a complex connectivity in the ansatz, albeit being beneficial for exploring wider sets of solutions, introduces an overhead of gates during the transpilation on a quantum computer that increases the overall error rate, thus undermining the quality of the training. It is hence necessary, when implementing a variation quantum learning algorithm, to find the right balance between a sufficiently parametrized ansatz and a minimal cost in terms of resources during transpilation. Moreover, the experimental finding allows to construct a heuristic metric function, which aids the decision-making process on the best possible ansatz structure to be deployed on a given quantum hardware, thus fostering a more efficient application of VQAs in realistic situations. The experiments are performed on two widely used variational algorithms, the VQE (variational quantum eigensolver) and the VQC (variational quantum classifier), both tested on two different problems, the first on the Markowitz portfolio optimization using real-world financial data, and the latter on a classification task performed on the Iris dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00144-5"
    },
    {
        "id": 2404,
        "title": "Machine Learning Approaches to Evaluating Quantum Phase Estimation Algorithm Output",
        "authors": "Charles Woodrum, David Weeks",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/naecon58068.2023.10365987"
    },
    {
        "id": 2405,
        "title": "The State of Quantum Learning: A Comparative Review Towards Classical Machine Learning",
        "authors": "Tanvir M. Mahim, A.H.M.A. Rahim, M. Mosaddequr Rahman",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441113"
    },
    {
        "id": 2406,
        "title": "Decohering tensor network quantum machine learning models",
        "authors": "Haoran Liao, Ian Convy, Zhibo Yang, K. Birgitta Whaley",
        "published": "2023-6",
        "citations": 4,
        "abstract": "AbstractTensor network quantum machine learning (QML) models are promising applications on near-term quantum hardware. While decoherence of qubits is expected to decrease the performance of QML models, it is unclear to what extent the diminished performance can be compensated for by adding ancillas to the models and accordingly increasing the virtual bond dimension of the models. We investigate here the competition between decoherence and adding ancillas on the classification performance of two models, with an analysis of the decoherence effect from the perspective of regression. We present numerical evidence that the fully decohered unitary tree tensor network (TTN) with two ancillas performs at least as well as the non-decohered unitary TTN, suggesting that it is beneficial to add at least two ancillas to the unitary TTN regardless of the amount of decoherence may be consequently introduced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-022-00095-9"
    },
    {
        "id": 2407,
        "title": "Workshop Summary: Quantum Machine Learning",
        "authors": "Volker Tresp, Steffen Udluft, Daniel Hein, Werner Hauptmann, Martin Leib, Christopher Mutschler, Daniel D. Scherer, Wolfgang Mauerer",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.10174"
    },
    {
        "id": 2408,
        "title": "Music photonic signal analysis based health monitoring system using classification by quantum machine learning techniques",
        "authors": "Dingjie Hou",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-05960-w"
    },
    {
        "id": 2409,
        "title": "5G Radio Link Failure Prediction using Quantum Machine Learning",
        "authors": "S Vigneshwaran, P Vignesh, R. Anuradha, N. Sathishkumar",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iq-cchess56596.2023.10391770"
    },
    {
        "id": 2410,
        "title": "Improving Quantum Circuit Synthesis with Machine Learning",
        "authors": "Mathias Weiden, Ed Younis, Justin Kalloor, John Kubiatowicz, Costin Iancu",
        "published": "2023-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00093"
    },
    {
        "id": 2411,
        "title": "Machine and quantum learning for diamond-based quantum applications",
        "authors": "Dylan G Stone, Carlo Bradac",
        "published": "2023-3-1",
        "citations": 2,
        "abstract": "Abstract\nIn recent years, machine and quantum learning have gained considerable momentum sustained by growth in computational power and data availability and have shown exceptional aptness for solving recognition- and classification-type problems, as well as problems that require complex, strategic planning. In this work, we discuss and analyze the role machine and quantum learning are playing in the development of diamond-based quantum technologies. This matters as diamond and its optically addressable spin defects are becoming prime hardware candidates for solid state-based applications in quantum information, computing and metrology. Through a selected number of demonstrations, we show that machine and quantum learning are leading to both practical and fundamental improvements in measurement speed and accuracy. This is crucial for quantum applications, especially for those where coherence time and signal-to-noise ratio are scarce resources. We summarize some of the most prominent machine and quantum learning approaches that have been conducive to the presented advances and discuss their potential, as well as their limits, for proposed and future quantum applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2633-4356/acb30a"
    },
    {
        "id": 2412,
        "title": "Application of machine learning to experimental design in quantum mechanics",
        "authors": "Federico Belliardo, Fabio Zoratti, Vittorio Giovannetti",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": " The recent advances in Machine Learning hold great promises for the field of quantum sensing and metrology. With the help of reinforcement learning, we can tame the complexity of quantum systems and solve the problem of optimal experimental design. Reinforcement learning is a powerful model-free technique that allows an agent, which is typically a neural network, to learn the best strategy to reach a certain goal in a completely a priori unknown environment. However, in general, we know something about the quantum system the agent is interacting with, at least that it follows the rules of quantum mechanics. In quantum metrology, we typically have a model for the system and only some parameters of the evolution or of the initial state are unknown. We present here a general Machine Learning technique that can optimize the precision of quantum sensors, and in doing so it exploits the knowledge we have on the system. We have developed a Python package to automate a broad class of optimizations that can be found in the tasks of quantum parameter estimation, quantum metrology and quantum hypothesis testing. What the agent is learning here is an optimal adaptive strategy, that, on the basis of the previous outcomes, decides the next measurements to perform. It works both for Bayesian estimation and for frequentist estimation. The user is required to implement the physics of the system to be studied and state which parameters in the experiment are controllable and which are unknowns. The functions of the library allow then to easily train a neural network agent for optimizing the precision of the sensor, by simulating the experiment. We have explored some applications of this technique to magnetometry on NV centers (both DC and AC), to state discrimination in quantum optics and to phase estimation. So far, we were able to certify better results than the current state-of-the-art controls for many examples. The Machine Learning technique developed here can be applied in all those scenarios where the quantum system is well characterized and relatively simple and small. In these cases, we can squeeze every last bit of information from a quantum sensor by controlling it with a neural network appropriately trained. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0219749924500023"
    },
    {
        "id": 2413,
        "title": "Machine learning for modeling mortality with respect to smog and ambient air temperature",
        "authors": "Tomasz Fruboes, Marek J. Dąbrowski, Krzysztof Nawrocki, Wojciech Moraczewski, Dorota Gałczyńska-Zych",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0203796"
    },
    {
        "id": 2414,
        "title": "Quaternion-based machine learning on topological quantum systems",
        "authors": "Min-Ruei Lin, Wan-Ju Li, Shin-Ming Huang",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "Abstract\nTopological phase classifications have been intensively studied via machine-learning techniques where different forms of the training data are proposed in order to maximize the information extracted from the systems of interests. Due to the complexity in quantum physics, advanced mathematical architecture should be considered in designing machines. In this work, we incorporate quaternion algebras into data analysis either in the frame of supervised and unsupervised learning to classify two-dimensional Chern insulators. For the unsupervised-learning aspect, we apply the principal component analysis on the quaternion-transformed eigenstates to distinguish topological phases. For the supervised-learning aspect, we construct our machine by adding one quaternion convolutional layer on top of a conventional convolutional neural network. The machine takes quaternion-transformed configurations as inputs and successfully classify all distinct topological phases, even for those states that have different distributions from those states seen by the machine during the training process. Our work demonstrates the power of quaternion algebras on extracting crucial features from the targeted data and the advantages of quaternion-based neural networks than conventional ones in the tasks of topological phase classifications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc0d6"
    },
    {
        "id": 2415,
        "title": "Machine Learning Quantum Systems with Magnetic p-bits",
        "authors": "Shuvro Chowdhury, Kerem Y. Camsari",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/intermagshortpapers58606.2023.10228205"
    },
    {
        "id": 2416,
        "title": "Quantum Prototype Clustering: Advancing AI Enhanced Machine Learning",
        "authors": "Ishan Shivansh Bangroo, Ravi Kumar",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc60394.2023.10440984"
    },
    {
        "id": 2417,
        "title": "Early steroid detection in athlete players using quantum photonics and machine learning model based analysis",
        "authors": "Changfeng Ning, Menglu Li, Linna Ge",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06130-8"
    },
    {
        "id": 2418,
        "title": "A Novel Stochastic LSTM Model Inspired by Quantum Machine Learning",
        "authors": "Joseph Lindsay, Ramtin Zand",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isqed57927.2023.10129344"
    },
    {
        "id": 2419,
        "title": "Wireless Broadband Signal Detection Scheme Based on Quantum Machine Learning",
        "authors": "Jiale Zhang",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaica58456.2023.10405526"
    },
    {
        "id": 2420,
        "title": "Homomorphic Encryption Based on Post-Quantum Cryptography",
        "authors": "Abel C. H. Chen",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmlant59547.2023.10372974"
    },
    {
        "id": 2421,
        "title": "High Dimensional Quantum Machine Learning With Small Quantum Computers",
        "authors": "Simon C. Marshall, Casper Gyurik, Vedran Dunjko",
        "published": "2023-8-9",
        "citations": 7,
        "abstract": "Quantum computers hold great promise to enhance machine learning, but their current qubit counts restrict the realisation of this promise. To deal with this limitation the community has produced a set of techniques for evaluating large quantum circuits on smaller quantum devices. These techniques work by evaluating many smaller circuits on the smaller machine, that are then combined in a polynomial to replicate the output of the larger machine. This scheme requires more circuit evaluations than are practical for general circuits. However, we investigate the possibility that for certain applications many of these subcircuits are superfluous, and that a much smaller sum is sufficient to estimate the full circuit. We construct a machine learning model that may be capable of approximating the outputs of the larger circuit with much fewer circuit evaluations. We successfully apply our model to the task of digit recognition, using simulated quantum computers much smaller than the data dimension. The model is also applied to the task of approximating a random 10 qubit PQC with simulated access to a 5 qubit computer, even with only relatively modest number of circuits our model provides an accurate approximation of the 10 qubit PQCs output, superior to a neural network attempt. The developed method might be useful for implementing quantum models on larger data throughout the NISQ era.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22331/q-2023-08-09-1078"
    },
    {
        "id": 2422,
        "title": "Quantum Leap: Exploring the Potential of Quantum Machine Learning for Communication Networks",
        "authors": "Soumaya Cherkaoui",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616388.3625543"
    },
    {
        "id": 2423,
        "title": "Expressive quantum supervised machine learning using Kerr-nonlinear parametric oscillators",
        "authors": "Yuichiro Mori, Kouhei Nakaji, Yuichiro Matsuzaki, Shiro Kawabata",
        "published": "2024-6",
        "citations": 0,
        "abstract": "AbstractQuantum machine learning with variational quantum algorithms (VQA) has been actively investigated as a practical algorithm in the noisy intermediate-scale quantum (NISQ) era. Recent researches reveal that the data reuploading, which repeatedly encode classical data into quantum circuit, is necessary for obtaining the expressive quantum machine learning model in the conventional quantum computing architecture. However, the data reuploading tends to require a large amount of quantum resources, which motivates us to find an alternative strategy for realizing the expressive quantum machine learning efficiently. In this paper, we propose quantum machine learning with Kerr-nonlinear parametric oscillators (KPOs), as another promising quantum computing device. We use not only the ground state and first excited state but also higher excited states, which allows us to use a large Hilbert space even if we have a single KPO. Our numerical simulations show that the expressibility of our method with only one mode of the KPO is much higher than that of the conventional method with six qubits. Our results pave the way towards resource-efficient quantum machine learning, which is essential for the practical applications in the NISQ era.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00152-5"
    },
    {
        "id": 2424,
        "title": "Quantum Machine Learning: Bridging the Gap Between Quantum Computing and Artificial Intelligence: An Overview",
        "authors": "Arathi Choppakatla",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Abstract: Quantum Machine Learning (QML) at the intersection of quantum computing and artificial intelligence (AI) is explored, emphasizing its role in connecting these domains. The transformative potential of QML in enhancing classical machine learning and the introduction of the Variational Quantum Classifier (VQC) algorithm (Ref. 4) are highlighted. Fundamental quantum principles, quantum feature maps, and the VQC's use of parameterized quantum circuits are discussed (Refs. 1, 3). The paper addresses practical implementation, optimization techniques, and the VQC's performance through empirical evaluations (Ref. 4). Implications of QML extend to diverse applications (Ref. 5), positioning it as a bridge between quantum computing and AI to unlock transformative possibilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.55318"
    },
    {
        "id": 2425,
        "title": "Explainable representation learning of small quantum states",
        "authors": "Felix Frohnert, Evert van Nieuwenburg",
        "published": "2024-3-1",
        "citations": 1,
        "abstract": "Abstract\nUnsupervised machine learning models build an internal representation of their training data without the need for explicit human guidance or feature engineering. This learned representation provides insights into which features of the data are relevant for the task at hand. In the context of quantum physics, training models to describe quantum states without human intervention offers a promising approach to gaining insight into how machines represent complex quantum states. The ability to interpret the learned representation may offer a new perspective on non-trivial features of quantum systems and their efficient representation. We train a generative model on two-qubit density matrices generated by a parameterized quantum circuit. In a series of computational experiments, we investigate the learned representation of the model and its internal understanding of the data. We observe that the model learns an interpretable representation which relates the quantum states to their underlying entanglement characteristics. In particular, our results demonstrate that the latent representation of the model is directly correlated with the entanglement measure concurrence. The insights from this study represent proof of concept toward interpretable machine learning of quantum states. Our approach offers insight into how machines learn to represent small-scale quantum systems autonomously.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/ad16a0"
    },
    {
        "id": 2426,
        "title": "The enhancement of quantum machine learning models via quantum Fourier transform in near-term applications",
        "authors": "Esteban Payares, Juan Carlos Martínez",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0163355"
    },
    {
        "id": 2427,
        "title": "Temperature characterization of 660 nm quantum well semiconductor laser",
        "authors": "Rehab Joko Hussin, Ivan Bahnam Karomi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0196162"
    },
    {
        "id": 2428,
        "title": "Classical and quantum machine learning applications in spintronics",
        "authors": "Kumar J. B. Ghosh, Sumit Ghosh",
        "published": "2023",
        "citations": 2,
        "abstract": "Prediction of physical observables with machine learning for spintronic and molecular devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1039/d2dd00094f"
    },
    {
        "id": 2429,
        "title": "Scalable neural quantum states architecture for quantum chemistry",
        "authors": "Tianchen Zhao, James Stokes, Shravan Veerapaneni",
        "published": "2023-6-1",
        "citations": 8,
        "abstract": "Abstract\nVariational optimization of neural-network representations of quantum states has been successfully applied to solve interacting fermionic problems. Despite rapid developments, significant scalability challenges arise when considering molecules of large scale, which correspond to non-locally interacting quantum spin Hamiltonians consisting of sums of thousands or even millions of Pauli operators. In this work, we introduce scalable parallelization strategies to improve neural-network-based variational quantum Monte Carlo calculations for ab-initio quantum chemistry applications. We establish GPU-supported local energy parallelism to compute the optimization objective for Hamiltonians of potentially complex molecules. Using autoregressive sampling techniques, we demonstrate systematic improvement in wall-clock timings required to achieve coupled cluster with up to double excitations baseline target energies. The performance is further enhanced by accommodating the structure of resultant spin Hamiltonians into the autoregressive sampling ordering. The algorithm achieves promising performance in comparison with the classical approximate methods and exhibits both running time and scalability advantages over existing neural-network based methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acdb2f"
    },
    {
        "id": 2430,
        "title": "Machine learning in biophotonics: progress and challenges",
        "authors": "Sphumelele Ndlovu, Patience Mthunzi-Kufa",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2662811"
    },
    {
        "id": 2431,
        "title": "A Quantum Machine Learning Approach to Spatiotemporal Emission Modelling",
        "authors": "Kelly Zheng, Jesse Van Griensven, Roydon Fraser",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "Despite the growing impact of emissions on our health and the environment, there remains an unmet need for emission concentration prediction and forecasting. The accumulating monitoring station and satellite data make the problem well-suited for quantum machine learning. This work takes a quantum machine learning approach to the spatiotemporal prediction of emission concentration. A quantum quanvolutional neural network model was developed and compared to a classical spatiotemporal ConvLSTM model using an evaluation framework of baseline models and metrics of per-pixel loss and intersection over union accuracy. The quantum quanvolutional neural network developed successfully generates one-hour-ahead emission concentration forecasts with increasingly lower loss (6.5% and 30.5% less) and higher accuracy (18.4% and 18.6% higher) compared to the input-independent and random baselines at the end of training. The quantum model was also comparable to the classical ConvLSTM model, with slightly lower loss (4%) but also slightly lower accuracy (3.7%). The study’s results suggest that the quantum machine learning approach has the potential to improve emission concentration modeling and could become a powerful tool for accurately predicting air pollution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/atmos14060944"
    },
    {
        "id": 2432,
        "title": "Exploring Quantum Machine Learning for Explainable Malware Detection",
        "authors": "Giovanni Ciaramella, Fabio Martinelli, Francesco Mercaldo, Antonella Santone",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191964"
    },
    {
        "id": 2433,
        "title": "Machine learning methods for simulating particle response in the zero degree calorimeter at the ALICE experiment, CERN",
        "authors": "Jan Dubiński, Kamil Deja, Sandro Wenzel, Przemysław Rokita, Tomasz Trzciński",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0203567"
    },
    {
        "id": 2434,
        "title": "Design of Quantum Machine Learning Course for a Computer Science Program",
        "authors": "Sathish Kumar, Temitope Adeniyi, Ahmad Alomari, Santanu Ganguly",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.20326"
    },
    {
        "id": 2435,
        "title": "Benchmarking Photonic Quantum Machine Learning Simulators",
        "authors": "Henrik Varga, Attila Kiss, Zoltán Kolarovszki",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/saci58269.2023.10158603"
    },
    {
        "id": 2436,
        "title": "On Laws of Thought—A Quantum-like Machine Learning Approach",
        "authors": "Lizhi Xin, Kevin Xin, Houwen Xin",
        "published": "2023-8-15",
        "citations": 0,
        "abstract": "Incorporating insights from quantum theory, we propose a machine learning-based decision-making model, including a logic tree and a value tree; a genetic programming algorithm is applied to optimize both the logic tree and value tree. The logic tree and value tree together depict the entire decision-making process of a decision-maker. We applied this framework to the financial market, and a “machine economist” is developed to study a time series of the Dow Jones index. The “machine economist” will obtain a set of optimized strategies to maximize profits, and discover the efficient market hypothesis (random walk).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e25081213"
    },
    {
        "id": 2437,
        "title": "Quantum Machine Learning: A Review",
        "authors": "Soumyadip Sarkar",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "Abstract: Quantum machine learning is an emerging field that aims to leverage the unique properties of quantum computing to accelerate machine learning tasks. In this paper, we review recent advances in quantum machine learning and discuss the potential applications and challenges associated with this technology. Specifically, we examine the current state of quantum machine learning algorithms, including variational quantum algorithms, quantum neural networks, and quantum generative models. We also discuss the challenges associated with practical quantum computing resources, algorithm design, and interdisciplinary collaboration. Furthermore, we highlight the potential applications of quantum machine learning in areas such as drug discovery, speech and image recognition, financial modeling, and many others. We also examine the ethical and societal implications of this technology, including the potential impact on privacy and security. Finally, we discuss future prospects for quantum machine learning, including the potential for quantum-inspired classical algorithms and the development of error correction techniques. We conclude by emphasizing the importance of interdisciplinary collaboration in the continued advancement of this field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.49421"
    },
    {
        "id": 2438,
        "title": "Machine Learning Optimization of Quantum Circuit Layouts",
        "authors": "Alexandru Paler, Lucian Sasu, Adrian-Cătălin Florea, Răzvan Andonie",
        "published": "2023-6-30",
        "citations": 7,
        "abstract": "The quantum circuit layout (QCL) problem involves mapping out a quantum circuit such that the constraints of the device are satisfied. We introduce a quantum circuit mapping heuristic, QXX, and its machine learning version, QXX-MLP. The latter automatically infers the optimal QXX parameter values such that the laid out circuit has a reduced depth. In order to speed up circuit compilation, before laying the circuits out, we use a Gaussian function to estimate the depth of the compiled circuits. This Gaussian also informs the compiler about the circuit region that influences most the resulting circuit’s depth. We present empiric evidence for the feasibility of learning the layout method using approximation. QXX and QXX-MLP open the path to feasible large-scale QCL methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3565271"
    },
    {
        "id": 2439,
        "title": "Benchmarking Differential Evolution on a Quantum Simulator",
        "authors": "Parthasarathy Srinivasan",
        "published": "2023",
        "citations": 0,
        "abstract": "The use of Evolutionary Algorithms (EA) for solving Mathematical/Computational Optimization Problems is inspired by the biological processes of Evolution. Few of the primitives involved in the Evolutionary process/paradigm are selection of ’Fit’ individuals (from a population sample) for retention, cloning, mutation, discarding, breeding, crossover etc. In the Evolutionary Algorithm abstraction, the individuals are deemed to be solution candidates to an Optimization problem and additional solution(/sets) are built by applying analogies to the above primitives (cloning, mutation etc.) by means of evaluating a ’Fitness’ function/criterion. One such algorithm is Differential Evolution(DE) which can be used to compute the minima of functions such as the rastrigin function and rosenbrock function. This work is an attempt to study the result of applying the DE method on these functions with candidate individuals generated on classical Turing modeled computation and comparing the same with those on state of the art Quantum computation.The study benchmarks the convergence of these functions by varying the parameters initialized and reports timing, convergence, and resource utilization results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54364/aaiml.2023.1196"
    },
    {
        "id": 2440,
        "title": "Performance Evaluation of Quantum-Based Machine Learning Algorithms for Cardiac Arrhythmia Classification",
        "authors": "Zeynep Ozpolat, Murat Karabatak",
        "published": "2023-3-14",
        "citations": 6,
        "abstract": "The electrocardiogram (ECG) is the most common technique used to diagnose heart diseases. The electrical signals produced by the heart are recorded by chest electrodes and by the extremity electrodes placed on the limbs. Many diseases, such as arrhythmia, cardiomyopathy, coronary heart disease, and heart failure, can be diagnosed by examining ECG signals. The interpretation of these signals by experts may take a long time, and there may be differences between expert interpretations. Since technological developments are intertwined with the medical sciences, computer-assisted diagnostic methods have recently come forward. In computer science, machine learning techniques are often preferred for automatic detection. Quantum-based structures have emerged to increase the machine learning algorithm’s speed and classification performance. In this study, a quantum-based machine learning algorithm is applied to classify heart rhythms. The ECG properties were converted to qubit structure using principal component analysis (PCA). The resulting qubits are classified using the quantum support vector machine (QSVM) algorithm. Quantum computer simulation over Qiskit was used for classification studies. Within the scope of experimental studies, comparisons between classical SVM and QSVM were made using different data amounts and qubit numbers. In the results of the analysis, classical SVM achieved 86.96% accuracy, and QSVM achieved 84.64% accuracy. Despite the fact that the entire dataset was not used due to various limitations, these successful performances were achieved. Classification of medical data such as that from ECG has shown that quantum-based machine learning frameworks perform well despite current resource constraints. In this respect, the study includes essential contributions to the use of quantum-based machine learning methods on signal data in medicine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061099"
    },
    {
        "id": 2441,
        "title": "A Post-Quantum Privacy-Enhancing Blockchain-Based Transaction Framework with Access Control",
        "authors": "Lingyun Li, Xianhui Lu, Kunpeng Wang",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "Protecting the transaction from address-based tracking is one of the core issues in blockchain privacypreservation. In this paper, we propose a transaction framework through which the trader of a transactionorganization transacts on the blockchain public chain with privacy-enhancing; meanwhile, the manager gets access to the trader's transaction with access control based on cryptography. In the proposedframework, the hash-based one-time address is utilized to protect transactions from unauthorized tracking; furthermore, the hash-based one-time signature is creatively being used twice to verify and track thetransactions safely in the semi-honest model; through access control, the authorized managers can obtaintransaction information within their authorities. Compared with the standard Bitcoin transaction system, the proposed system achieves privacy-enhancing and post-quantum security.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130809"
    },
    {
        "id": 2442,
        "title": "Machine Learning-Based Predictive Modeling for Designing Transmon Superconducting Qubits",
        "authors": "Ferris Prima Nugraha, Qiming Shao",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00154"
    },
    {
        "id": 2443,
        "title": "Revolutionizing heart disease prediction with quantum-enhanced machine learning",
        "authors": "S. Venkatesh Babu, P. Ramya, Jeffin Gracewell",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "AbstractThe recent developments in quantum technology have opened up new opportunities for machine learning algorithms to assist the healthcare industry in diagnosing complex health disorders, such as heart disease. In this work, we summarize the effectiveness of QuEML in heart disease prediction. To evaluate the performance of QuEML against traditional machine learning algorithms, the Kaggle heart disease dataset was used which contains 1190 samples out of which 53% of samples are labeled as positive samples and rest 47% samples are labeled as negative samples. The performance of QuEML was evaluated in terms of accuracy, precision, recall, specificity, F1 score, and training time against traditional machine learning algorithms. From the experimental results, it has been observed that proposed quantum approaches predicted around 50.03% of positive samples as positive and an average of 44.65% of negative samples are predicted as negative whereas traditional machine learning approaches could predict around 49.78% of positive samples as positive and 44.31% of negative samples as negative. Furthermore, the computational complexity of QuEML was measured which consumed average of 670 µs for its training whereas traditional machine learning algorithms could consume an average 862.5 µs for training. Hence, QuEL was found to be a promising approach in heart disease prediction with an accuracy rate of 0.6% higher and training time of 192.5 µs faster than that of traditional machine learning approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-55991-w"
    },
    {
        "id": 2444,
        "title": "E-healthcare application cyber security analysis using quantum machine learning in malicious user detection",
        "authors": "Zhenkun Liu, Xu Jia, Bin Li",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-05854-x"
    },
    {
        "id": 2445,
        "title": "Understanding quantum machine learning also requires rethinking generalization",
        "authors": "Elies Gil-Fuster, Jens Eisert, Carlos Bravo-Prieto",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "AbstractQuantum machine learning models have shown successful generalization performance even when trained with few data. In this work, through systematic randomization experiments, we show that traditional approaches to understanding generalization fail to explain the behavior of such quantum models. Our experiments reveal that state-of-the-art quantum neural networks accurately fit random states and random labeling of training data. This ability to memorize random data defies current notions of small generalization error, problematizing approaches that build on complexity measures such as the VC dimension, the Rademacher complexity, and all their uniform relatives. We complement our empirical results with a theoretical construction showing that quantum neural networks can fit arbitrary labels to quantum states, hinting at their memorization ability. Our results do not preclude the possibility of good generalization with few training data but rather rule out any possible guarantees based only on the properties of the model family. These findings expose a fundamental challenge in the conventional understanding of generalization in quantum machine learning and highlight the need for a paradigm shift in the study of quantum models for machine learning tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41467-024-45882-z"
    },
    {
        "id": 2446,
        "title": "QLDT+: Efficient Construction of a Quantum Logic Decision Tree",
        "authors": "Ingo Schmitt",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589883.3589895"
    },
    {
        "id": 2447,
        "title": "Geometric properties of quantum entanglement and machine learning",
        "authors": "S. V. Zuev",
        "published": "2023-10-5",
        "citations": 1,
        "abstract": "Objectives. Fast data analysis based on hidden patterns is one of the main issues for adaptive artificial intelligence systems development. This paper aims to propose and verify a method of such analysis based on the representation of data in the form of a quantum state, or, alternatively, in the form of a geometric object in a space allowing online machine learning.Methods. This paper uses Feynman formalism to represent quantum states and operations on them, the representation of quantum computing in the form of quantum circuits, geometric transformations, topological classification, as well as methods of classical and quantum machine learning. The Python programming language is used as a development tool. Optimization tools for machine learning are taken from the SciPy module. The datasets for analysis are taken from open sources. Data preprocessing was performed by the method of mapping features into numerical vectors, then the method of bringing the data to the desired dimension was applied. The data was then displayed in a quantum state. A proprietary quantum computing emulator is used (it is in the public domain).Results. The results of computational experiments revealed the ability of very simple quantum circuits to classify data without optimization. Comparative indicators of classification quality are obtained without the use of optimization, as well as with its use. Experiments were carried out with different datasets and for different values of the dimension of feature spaces. The efficiency of the models and methods of machine learning proposed in the work, as well as methods of combining them into network structures, is practically confirmed.Conclusions. The proposed method of machine learning and the model of quantum neural networks can be used to create adaptive artificial intelligence systems as part of an online learning module. Free online optimization learning process allows it to be applied in data streaming, that is, adapting to changes in the environment. The developed software does not require quantum computers and can be used in the development of artificial intelligence systems in Python as imported modules.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32362/2500-316x-2023-11-5-19-33"
    },
    {
        "id": 2448,
        "title": "Boosting the performance of quantum annealers using machine learning",
        "authors": "Jure Brence, Dragan Mihailović, Viktor V. Kabanov, Ljupčo Todorovski, Sašo Džeroski, Jaka Vodeb",
        "published": "2023-6",
        "citations": 1,
        "abstract": "AbstractNoisy intermediate-scale quantum (NISQ) devices are spearheading the second quantum revolution. Of these, quantum annealers are the only ones currently offering real world, commercial applications on as many as 5000 qubits. The size of problems that can be solved by quantum annealers is limited mainly by errors caused by environmental noise and intrinsic imperfections of the processor. We address the issue of intrinsic imperfections with a novel error correction approach, based on machine learning methods. Our approach adjusts the input Hamiltonian to maximize the probability of finding the solution. In our experiments, the proposed error correction method improved the performance of annealing by up to three orders of magnitude and enabled the solving of a previously intractable, maximally complex problem.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-022-00092-y"
    },
    {
        "id": 2449,
        "title": "Parallel hybrid quantum-classical machine learning for kernelized time-series classification",
        "authors": "Jack S. Baker, Gilchan Park, Kwangmin Yu, Ara Ghukasyan, Oktay Goktas, Santosh Kumar Radha",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-024-00149-0"
    },
    {
        "id": 2450,
        "title": "Quantum Machine Learning for Optical and SAR Classification",
        "authors": "Leslie Miller, Glen Uehara, Aradhita Sharma, Andreas Spanias",
        "published": "2023-6-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsp58604.2023.10167979"
    },
    {
        "id": 2451,
        "title": "Quantum machine learning for demappers of low order modulations of 5G and beyond",
        "authors": "Khoirul Anwar, Mohamad Yusoff Bin Alias",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0179240"
    },
    {
        "id": 2452,
        "title": "Machine Learning Optimal Control Pulses in an Optical Quantum Memory",
        "authors": "Elizabeth Robertson, Luisa Esguerra, Leon Meßner, Guillermo Gallego, Janik Wolters",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cleo/europe-eqec57999.2023.10232106"
    },
    {
        "id": 2453,
        "title": "Comparative Analysis of Classification Efficiency of Quantum Machine Learning Algorithms",
        "authors": "Savita Kumari Sheoran, Vikesh Yadav",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486763"
    },
    {
        "id": 2454,
        "title": "SWAP-test algorithm implemented on the photonic platform for Quantum Machine Learning",
        "authors": "Alessio Baldazzi, Nicolò Leone, Stefano Azzini, Matteo Sanna, Lorenzo Pavesi",
        "published": "2023",
        "citations": 0,
        "abstract": "We design an integrated photonic chip to implement the SWAP-test algorithm: using single-particle entanglement as a resource, the circuit can be used to estimate the scalar product of two qubits for quantum kernel methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/iprsn.2023.ith3b.1"
    },
    {
        "id": 2455,
        "title": "Tensor Networks for Interpretable and Efficient Quantum-Inspired Machine Learning",
        "authors": "Shi-Ju Ran, Gang Su",
        "published": "2023-1",
        "citations": 0,
        "abstract": "It is a critical challenge to simultaneously achieve high interpretability and high efficiency with the current schemes of deep machine learning (ML). The tensor network (TN), a well-established mathematical tool originating from quantum mechanics, has shown its unique advantages in developing efficient “white-box” ML schemes. Here, we provide a brief review of the inspiring progress in TN-based ML. On the one hand, the interpretability of TN ML can be accommodated by a solid theoretical foundation based on quantum information and many-body physics. On the other hand, high efficiency can be obtained from powerful TN representations and the advanced computational techniques developed in quantum many-body physics. Keeping pace with the rapid development of quantum computers, TNs are expected to produce novel schemes runnable on quantum hardware in the direction of “quantum artificial intelligence” in the near future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34133/icomputing.0061"
    },
    {
        "id": 2456,
        "title": "QuMoS: A Framework for Preserving Security of Quantum Machine Learning Model",
        "authors": "Zhepeng Wang, Jinyang Li, Zhirui Hu, Blake Gage, Elizabeth Iwasawa, Weiwen Jiang",
        "published": "2023-9-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00123"
    },
    {
        "id": 2457,
        "title": "Multiparameter estimation of continuous-time quantum walk Hamiltonians through machine learning",
        "authors": "Ilaria Gianani, Claudia Benedetti",
        "published": "2023-3-1",
        "citations": 2,
        "abstract": "The characterization of the Hamiltonian parameters defining a quantum walk is of paramount importance when performing a variety of tasks, from quantum communication to computation. When dealing with physical implementations of quantum walks, the parameters themselves may not be directly accessible, and, thus, it is necessary to find alternative estimation strategies exploiting other observables. Here, we perform the multiparameter estimation of the Hamiltonian parameters characterizing a continuous-time quantum walk over a line graph with n-neighbor interactions using a deep neural network model fed with experimental probabilities at a given evolution time. We compare our results with the bounds derived from estimation theory and find that the neural network acts as a nearly optimal estimator both when the estimation of two or three parameters is performed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1116/5.0137398"
    },
    {
        "id": 2458,
        "title": "If AI machine cannot think, can QI machine think?—from negative numbers to quantum intelligence for mind-light-matter unity",
        "authors": "Wen-Ran Zhang",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42484-023-00104-5"
    },
    {
        "id": 2459,
        "title": "Efficient characterization of blinking quantum emitters from scarce data sets via machine learning",
        "authors": "G Landry, C Bradac",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nSingle photon emitters are core building blocks of quantum technologies, with established and emerging applications ranging from quantum computing and communication to metrology and sensing. Regardless of their nature, quantum emitters universally display fluorescence intermittency or photoblinking: interaction with the environment can cause the emitters to undergo quantum jumps between on and off states that correlate with higher and lower photoemission events, respectively. Understanding and quantifying the mechanism and dynamics of photoblinking is important for both fundamental and practical reasons. However, the analysis of blinking time traces is often afflicted by data scarcity. Blinking emitters can photo-bleach and cease to fluoresce over time scales that are too short for their photodynamics to be captured by traditional statistical methods. Here, we demonstrate two approaches based on machine learning that directly address this problem. We present a multi-feature regression algorithm and a genetic algorithm that allow for the extraction of blinking on/off switching rates with ⩾85% accuracy, and with ⩾10× less data and ⩾20× higher precision than traditional methods based on statistical inference. Our algorithms effectively extend the range of surveyable blinking systems and trapping dynamics to those that would otherwise be considered too short-lived to be investigated. They are therefore a powerful tool to help gain a better understanding of the physical mechanism of photoblinking, with practical benefits for applications based on quantum emitters that rely on either mitigating or harnessing the phenomenon.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2633-4356/ad2e3b"
    },
    {
        "id": 2460,
        "title": "Enhanced image diagnosing approach in medicine using quantum adaptive machine learning techniques",
        "authors": "Sajja Suneel, R. Krishnamoorthy, Anandbabu Gopatoti, Lakshmana Phaneendra Maguluri, Prathyusha Kuncha, G. Sunil",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06203-8"
    },
    {
        "id": 2461,
        "title": "Machine learning based hybrid ensemble models for prediction of organic dyes photophysical properties: Absorption wavelengths, emission wavelengths, and quantum yields",
        "authors": "Kapil Dev Mahato, S. S. Gourab Kumar Das, Chandrashekhar Azad, Uday Kumar",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Fluorescent organic dyes are extensively used in the design and discovery of new materials, photovoltaic cells, light sensors, imaging applications, medicinal chemistry, drug design, energy harvesting technologies, dye and pigment industries, and pharmaceutical industries, among other things. However, designing and synthesizing new fluorescent organic dyes with desirable properties for specific applications requires knowledge of the chemical and physical properties of previously studied molecules. It is a difficult task for experimentalists to identify the photophysical properties of the required chemical molecule at negligible time and financial cost. For this purpose, machine learning-based models are a highly demanding technique for estimating photophysical properties and may be an alternative approach to density functional theory. In this study, we used 15 single models and proposed three different hybrid models to assess a dataset of 3066 organic materials for predicting photophysical properties. The performance of these models was evaluated using three evaluation parameters: mean absolute error, root mean squared error, and the coefficient of determination (R2) on the test-size data. All the proposed hybrid models achieved the highest accuracy (R2) of 97.28%, 95.19%, and 74.01% for predicting the absorption wavelengths, emission wavelengths, and quantum yields, respectively. These resultant outcomes of the proposed hybrid models are ∼1.9%, ∼2.7%, and ∼2.4% higher than the recently reported best models’ values in the same dataset for absorption wavelengths, emission wavelengths, and quantum yields, respectively. This research promotes the quick and accurate production of new fluorescent organic dyes with desirable photophysical properties for specific applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0181294"
    },
    {
        "id": 2462,
        "title": "Exploring the Vulnerabilities of Machine Learning and Quantum Machine Learning to Adversarial Attacks Using a Malware Dataset: A Comparative Analysis",
        "authors": "Mst Shapna Akter, Hossain Shahriar, Iysa Iqbal, MD Hossain, M.A. Karim, Victor Clincy, Razvan Voicu",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sse60056.2023.00037"
    },
    {
        "id": 2463,
        "title": "Non-linear support vector machine classification models using kernel tricks with applications",
        "authors": "Seror Faeq Mohammed, Ghadeer Jasim Mohammed Mahdi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0196147"
    },
    {
        "id": 2464,
        "title": "Prediction of sports fatigue degree based on spectral sensors and machine learning algorithms",
        "authors": "Hongyan Yao",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-024-06531-3"
    },
    {
        "id": 2465,
        "title": "A Review of Quantum Machine Learning for Image Classification",
        "authors": "Qiting Li, Zhaolong Huang, Hang Yang, Meimei Song",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imse61332.2023.00021"
    },
    {
        "id": 2466,
        "title": "MLQD: A package for machine learning-based quantum dissipative dynamics",
        "authors": "Arif Ullah, Pavlo O. Dral",
        "published": "2024-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cpc.2023.108940"
    },
    {
        "id": 2467,
        "title": "EKSPLORASI KAPASITAS PENGKODEAN AMPLITUDO UNTUK MODEL QUANTUM MACHINE LEARNING",
        "authors": " Rabiatul Adawiyah,  Munifah",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "Komputasi kuantum melakukan perhitungan dengan menggunakan fenomena fisik dan prinsip mekanika kuantum untuk memecahkan masalah. Bentuk komputasi ini secara teoritis telah terbukti memberikan percepatan pada beberapa masalah pemrosesan modern. Perkembangan baru dalam teknologi kuantum mulai bermunculan, dan penerapan model pembelajaran untuk perangkat baru ini terus berkembang. Dengan banyak antisipasi pemanfaatan fenomena kuantum di bidang Machine Learning telah menjadi jelas. Penelitian ini mengembangkan model kerangka kerja perangkat lunak TensorFlow Quantum (TFQ) untuk tujuan machine learning. Kedua model yang dikembangkan memanfaatkan teknik pengkodean informasi dari pengkodean amplitudo untuk penyusunan keadaan dalam model pembelajaran kuantum. Tujuan dari penelitian ini adalah mengeksplorasi kapasitas pengkodean amplitudo untuk menyediakan persiapan keadaan yang diperkaya dalam metode pembelajaran dan analisis mendalam tentang properti data yang memberikan wawasan tentang data pelatihan menggunakan Variational Quantum Classifier (VQC). Munculnya metode baru ini menimbulkan pertanyaan tentang cara terbaik menggunakan alat ini, tujuannya adalah untuk memberikan beberapa penjelasan ikhtisar untuk keadaan machine learning kuantum yang dapat diterapkan mengingat kendala perangkat yang sebenarnya. Hasil penelitian ini menunjukkan ada keuntungan yang jelas untuk menggunakan pengkodean amplitudo dibandingkan metode lain seperti ditunjukkan menggunakan jaringan saraf klasik kuantum hibrid di TFQ. Selain itu, ada beberapa langkah prapemrosesan yang dapat menghasilkan lebih banyak data kaya fitur saat menggunakan VQC, pada dasarnya teorema makan siang tidak gratis berlaku untuk metode pembelajaran kuantum seperti halnya dalam teknik klasik. Informasi meskipun dikodekan dalam bentuk kuantum tidak mengubah langkah-langkah penyiapan data tetapi melibatkan cara-cara baru untuk memahami dan mengapresiasi metode-metode baru ini. Pekerjaan masa depan di bidang ini akan membutuhkan perluasan ke dalam teknik klasifikasi multikelas yang cukup dikembangkan untuk dapat diterapkan dalam pekerjaan seperti ini.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51903/informatika.v3i1.232"
    },
    {
        "id": 2468,
        "title": "Machine learning quantum mechanical ground states based on stochastic mechanics",
        "authors": "Kai-Hendrik Henk, Wolfgang Paul",
        "published": "2023-12-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physreva.108.062412"
    },
    {
        "id": 2469,
        "title": "EEG-Based Emotion Recognition Using Quantum Machine Learning",
        "authors": "Divya Garg, Gyanendra Kumar Verma, Awadhesh Kumar Singh",
        "published": "2023-6-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01943-6"
    },
    {
        "id": 2470,
        "title": "Blind Processing Methods for Quantum Channels: Identification, Equalization and Source Separation",
        "authors": "Yannick Deville, Alain Deville",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mlsp55844.2023.10285938"
    },
    {
        "id": 2471,
        "title": "Classical vs. Quantum Machine Learning for Breast Cancer Detection",
        "authors": "Sonia Díaz-Santos, Daniel Escanez-Exposito",
        "published": "2023-4-17",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/drcn57075.2023.10108230"
    },
    {
        "id": 2472,
        "title": "Case Study-Based Approach of Quantum Machine Learning in Cybersecurity: Quantum Support Vector Machine for Malware Classification and Protection",
        "authors": "Mst Shapna Akter, Hossain Shahriar, Sheikh Iqbal Ahamed, Kishor Datta Gupta, Muhammad Rahman, Atef Mohamed, Mohammad Rahman, Akond Rahman, Fan Wu",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00161"
    },
    {
        "id": 2473,
        "title": "Quantum Machine Learning: Scope for real-world problems",
        "authors": "Abhishek Jadhav, Akhtar Rasool, Manasi Gyanchandani",
        "published": "2023",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.235"
    },
    {
        "id": 2474,
        "title": "Quantum Kerr learning",
        "authors": "Junyu Liu, Changchun Zhong, Matthew Otten, Anirban Chandra, Cristian L Cortes, Chaoyang Ti, Stephen K Gray, Xu Han",
        "published": "2023-6-1",
        "citations": 4,
        "abstract": "Abstract\nQuantum machine learning is a rapidly evolving field of research that could facilitate important applications for quantum computing and also significantly impact data-driven sciences. In our work, based on various arguments from complexity theory and physics, we demonstrate that a single Kerr mode can provide some ‘quantum enhancements’ when dealing with kernel-based methods. Using kernel properties, neural tangent kernel theory, first-order perturbation theory of the Kerr non-linearity, and non-perturbative numerical simulations, we show that quantum enhancements could happen in terms of convergence time and generalization error. Furthermore, we make explicit indications on how higher-dimensional input data could be considered. Finally, we propose an experimental protocol, that we call quantum Kerr learning, based on circuit QED.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acc726"
    },
    {
        "id": 2475,
        "title": "Deep quantum graph dreaming: deciphering neural network insights into quantum experiments",
        "authors": "Tareq Jaouni, Sören Arlt, Carlos Ruiz-Gonzalez, Ebrahim Karimi, Xuemei Gu, Mario Krenn",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nDespite their promise to facilitate new scientific discoveries, the opaqueness of neural networks presents a challenge in interpreting the logic behind their findings. Here, we use a eXplainable-AI technique called inception or deep dreaming, which has been invented in machine learning for computer vision. We use this technique to explore what neural networks learn about quantum optics experiments. Our story begins by training deep neural networks on the properties of quantum systems. Once trained, we ‘invert’ the neural network—effectively asking how it imagines a quantum system with a specific property, and how it would continuously modify the quantum system to change a property. We find that the network can shift the initial distribution of properties of the quantum system, and we can conceptualize the learned strategies of the neural network. Interestingly, we find that, in the first layers, the neural network identifies simple properties, while in the deeper ones, it can identify complex quantum structures and even quantum entanglement. This is in reminiscence of long-understood properties known in computer vision, which we now identify in a complex natural science task. Our approach could be useful in a more interpretable way to develop new advanced AI-based scientific discovery techniques in quantum physics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/ad2628"
    },
    {
        "id": 2476,
        "title": "An Empirical Comparison of Optimizers for Quantum Machine Learning with SPSA-Based Gradients",
        "authors": "Marco Wiedmann, Marc Hölle, Maniraman Periyasamy, Nico Meyer, Christian Ufrecht, Daniel D. Scherer, Axel Plinge, Christopher Mutschler",
        "published": "2023-9-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/qce57702.2023.00058"
    },
    {
        "id": 2477,
        "title": "Optimization of tripartite quantum steering inequalities via machine learning",
        "authors": "Guo-Zhu Pan, Ming Yang, Jian Zhou, Jun Zhou, Ming Kong, Gang Zhang",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-03873-x"
    },
    {
        "id": 2478,
        "title": "Application of Machine Learning to Quantum Cascade Laser Design",
        "authors": "Andres Correa Hernandez, Claire F. Gmachl",
        "published": "2023-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciss56502.2023.10089756"
    },
    {
        "id": 2479,
        "title": "Explainable Heart Disease Prediction Using Ensemble-Quantum Machine Learning Approach",
        "authors": "Ghada Abdulsalam, Souham Meshoul, Hadil Shaiba",
        "published": "2023",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.032262"
    },
    {
        "id": 2480,
        "title": "Quantum Metrology Assisted by Machine Learning",
        "authors": "Jiahao Huang, Min Zhuang, Jungeng Zhou, Yi Shen, Chaohong Lee",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "AbstractQuantum metrology aims to measure physical quantities based on fundamental quantum principles, enhancing measurement precision through resources like quantum entanglement and quantum correlations. This field holds promise for advancing quantum‐enhanced sensors, including atomic clocks and magnetometers. However, practical constraints exist in the four fundamental steps of quantum metrology, including initialization, sensing, readout, and estimation. Valuable resources, such as coherence time, impose limitations on the performance of quantum sensors. Machine learning, enabling learning and prediction without explicit knowledge, provides a powerful tool in optimizing quantum metrology with limited resources. This article reviews the fundamental principles, potential applications, and recent advancements in quantum metrology assisted by machine learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/qute.202300329"
    },
    {
        "id": 2481,
        "title": "Unlocking the Potential of Quantum Machine Learning to Advance Drug Discovery",
        "authors": "Maria Avramouli, Ilias K. Savvas, Anna Vasilaki, Georgia Garani",
        "published": "2023-5-25",
        "citations": 5,
        "abstract": "The drug discovery process is a rigorous and time-consuming endeavor, typically requiring several years of extensive research and development. Although classical machine learning (ML) has proven successful in this field, its computational demands in terms of speed and resources are significant. In recent years, researchers have sought to explore the potential benefits of quantum computing (QC) in the context of machine learning (ML), leading to the emergence of quantum machine learning (QML) as a distinct research field. The objective of the current study is twofold: first, to present a review of the proposed QML algorithms for application in the drug discovery pipeline, and second, to compare QML algorithms with their classical and hybrid counterparts in terms of their efficiency. A query-based search of various databases took place, and five different categories of algorithms were identified in which QML was implemented. The majority of QML applications in drug discovery are primarily focused on the initial stages of the drug discovery pipeline, particularly with regard to the identification of novel drug-like molecules. Comparison results revealed that QML algorithms are strong rivals to the classical ones, and a hybrid solution is the recommended approach at present.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12112402"
    },
    {
        "id": 2482,
        "title": "Preface: 4th International Conference on Pure Science (ICPS 2023)",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/12.0024402"
    },
    {
        "id": 2483,
        "title": "Quantum Machine Learning for Security Data Analysis",
        "authors": "Dhanunjai Bandi, Yong Shi, Hossain Shahriar, Dan Lo, Kun Suo, Hongmei Chi, Kai Qian",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174430"
    },
    {
        "id": 2484,
        "title": "Universal adversarial perturbations for multiple classification tasks with quantum classifiers",
        "authors": "Yun-Zhong Qiu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nQuantum adversarial machine learning is an emerging field that studies the vulnerability of quantum learning systems against adversarial perturbations and develops possible defense strategies. Quantum universal adversarial perturbations are small perturbations, which can make different input samples into adversarial examples that may deceive a given quantum classifier. This is a field that was rarely looked into but worthwhile investigating because universal perturbations might simplify malicious attacks to a large extent, causing unexpected devastation to quantum machine learning models. In this paper, we take a step forward and explore the quantum universal perturbations in the context of heterogeneous classification tasks. In particular, we find that quantum classifiers that achieve almost state-of-the-art accuracy on two different classification tasks can be both conclusively deceived by one carefully-crafted universal perturbation. This result is explicitly demonstrated with well-designed quantum continual learning models with elastic weight consolidation method to avoid catastrophic forgetting, as well as real-life heterogeneous datasets from hand-written digits and medical MRI images. Our results provide a simple and efficient way to generate universal perturbations on heterogeneous classification tasks and thus would provide valuable guidance for future quantum learning technologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acffa3"
    },
    {
        "id": 2485,
        "title": "Oncological Applications of Quantum Machine Learning",
        "authors": "Milad Rahimi, Farkhondeh Asadi",
        "published": "2023-1",
        "citations": 0,
        "abstract": " Background: Cancer is a leading cause of death worldwide. Machine learning (ML) and quantum computers (QCs) have recently advanced significantly. Numerous studies have examined the application of quantum machine learning (QML) in healthcare and validated its superiority over classical ML algorithms. Objectives: This review investigates and reports the oncological applications of QML. Methods: In March 2023, an electronic investigation of PubMed, Scopus, Web of Science, IEEE, and Cochrane databases was performed. The articles were screened based on titles and abstracts, and their full texts were examined. Results: Initially, a total of 207 articles were retrieved. Thereafter, 9 articles were included in the study, most of which were published from 2020 onwards. The results indicated the implementation of various QML techniques in different aspects of oncology, such as reducing mammography image noise, edge detection of breast cancer, clinical decision support in radiotherapy treatment, and cancer classification. Conclusion: These studies revealed that integrating quantum science with ML can significantly improve patient care and clinical outcomes. Future studies should explore the integration of QC and ML and the development of novel algorithms to enhance cancer prognosis, diagnosis, and treatment planning. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/15330338231215214"
    },
    {
        "id": 2486,
        "title": "A Hybrid Quantum-Classical Machine Learning Approach to Vision Sensor Data Analysis in Aerospace Applications",
        "authors": "Mohammed Syed, Paul Garcia",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasc58513.2023.10311313"
    },
    {
        "id": 2487,
        "title": "Research on a Quantum Machine Learning Approach to Mismatched Filter Design",
        "authors": "Junxiang Xiao, Shen Dong, Linghao Xia",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccisp59915.2023.10355822"
    },
    {
        "id": 2488,
        "title": "Quantum Computing and Machine Learning for Cybersecurity: Distributed Denial of Service (DDoS) Attack Detection on Smart Micro-Grid",
        "authors": "Dhaou Said",
        "published": "2023-4-20",
        "citations": 4,
        "abstract": "Machine learning (ML) is efficiently disrupting and modernizing cities in terms of service quality for mobility, security, robotics, healthcare, electricity, finance, etc. Despite their undeniable success, ML algorithms need crucial computational efforts with high-speed computing hardware to deal with model complexity and commitments to obtain efficient, reliable, and resilient solutions. Quantum computing (QC) is presented as a strong candidate to help MLs reach their best performance especially for cybersecurity issues and digital defense. This paper presents quantum support vector machine (QSVM) model to detect distributed denial of service (DDoS) attacks on smart micro-grid (SMG). An evaluation of our approach against a real dataset of DDoS attack instances shows the effectiveness of our proposed model. Finally, conclusions and some open issues and challenges of the fitting of ML with QC are presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16083572"
    },
    {
        "id": 2489,
        "title": "Machine learning with neural networks for parameter optimization in twin-field quantum key distribution",
        "authors": "Jia-Le Kang, Ming-Hui Zhang, Xiao-Peng Liu, Jia-Hui Xie",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-04063-5"
    },
    {
        "id": 2490,
        "title": "On a quantum inspired approach to train machine learning models",
        "authors": "Jean Michel Sellier",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractIn this work, a novel technique to train machine learning models is introduced, which is based on digital simulations of certain types of quantum systems. This represents a drastic departure from the standard approach of quantum machine learning which, to this day, is based on the use of actual physical quantum systems. To provide a clear context, the field of quantum inspired machine learning is first provided. Then, we proceed with a detailed description of our proposed method. To conclude, some preliminary, yet compelling, results are presented and discussed. Although at a seminal stage, the author firmly believes that this approach could represent a valid and robust alternative to the way machine learning models are trained today.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ail2.89"
    },
    {
        "id": 2491,
        "title": "Deep Bayesian experimental design for quantum many-body systems",
        "authors": "Leopoldo Sarra, Florian Marquardt",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nBayesian experimental design is a technique that allows to efficiently select measurements to characterize a physical system by maximizing the expected information gain. Recent developments in deep neural networks and normalizing flows allow for a more efficient approximation of the posterior and thus the extension of this technique to complex high-dimensional situations. In this paper, we show how this approach holds promise for adaptive measurement strategies to characterize present-day quantum technology platforms. In particular, we focus on arrays of coupled cavities and qubit arrays. Both represent model systems of high relevance for modern applications, like quantum simulations and computing, and both have been realized in platforms where measurement and control can be exploited to characterize and counteract unavoidable disorder. Thus, they represent ideal targets for applications of Bayesian experimental design.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/ad020d"
    },
    {
        "id": 2492,
        "title": "Practical advantage of quantum machine learning in ghost imaging",
        "authors": "Tailong Xiao, Xinliang Zhai, Xiaoyan Wu, Jianping Fan, Guihua Zeng",
        "published": "2023-7-10",
        "citations": 3,
        "abstract": "AbstractDemonstrating the practical advantage of quantum computation remains a long-standing challenge whereas quantum machine learning becomes a promising application that can be resorted to. In this work, we investigate the practical advantage of quantum machine learning in ghost imaging by overcoming the limitations of classical methods in blind object identification and imaging. We propose two hybrid quantum-classical machine learning algorithms and a physical-inspired patch strategy to allow distributed quantum learning with parallel variational circuits. In light of the algorithm, we conduct experiments for imaging-free object identification and blind ghost imaging under different physical sampling rates. We further quantitatively analyze the advantage through the lens of information geometry and generalization capability. The numerical results showcase that quantum machine learning can restore high-quality images but classical machine learning fails. The advantage of identification rate are up to 10% via fair comparison with the classical machine learning methods. Our work explores a physics-related application capable of practical quantum advantage, which highlights the prospect of quantum computation in the machine learning field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s42005-023-01290-1"
    },
    {
        "id": 2493,
        "title": "Machine learning algorithm based on optical sensors for simulating sports tourism environment",
        "authors": "Huaming Tang, Na Quan",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-06252-z"
    },
    {
        "id": 2494,
        "title": "Hybrid Quantum-Classical Convolutional Neural Network Model for Image Classification",
        "authors": "Fan Fan, Yilei Shi, Tobias Guggemos, Xiao Xiang Zhu",
        "published": "2024",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3312170"
    },
    {
        "id": 2495,
        "title": "Computational synthesis of a new generation of 2D-based perovskite quantum materials",
        "authors": "Chinedu E. Ekuma",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "Perovskite-based optoelectronic devices have emerged as a promising energy source due to their potential for scalable production. This study introduces “perovskene,” a novel class of 2D materials derived from the ABC3-like perovskites, synthesized via a data-driven, high-throughput computational strategy. We harness machine learning and multitarget deep neural networks to systematically investigate the structure–property relations, paving the way for targeted material design and optimization in fields such as renewable energy, electronics, and catalysis. The characterization of over 1500 synthesized structures shows that more than 500 structures are stable, revealing properties such as ultra-low work function and large magnetic moment, underscoring the potential for advanced technological applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0189497"
    },
    {
        "id": 2496,
        "title": "Quantum machine learning assisted lung cancer telemedicine",
        "authors": "Alemayehu Getahun Kumela, Abebe Belay Gemta, Alemu Kebede Hordofa, Habtamu Dagnaw, Umer Sheferedin, Mulugeta Tadesse",
        "published": "2023-7-1",
        "citations": 5,
        "abstract": "The rapidly increasing human population, the high cost of medical equipment, and the spread of multifactor diseases have transformed the entire healthcare industry into an electronic consulting, telediagnosis, delivery, and treatment model to avoid the physical personalization of patients. Despite this, we face many challenges, including low sensitivity of medical instruments, signal losses, and security of medical records. This study aims to develop a lung cancer telemedicine platform that utilizes classical and quantum computing models to classify lung cancer subtypes and stages and develop effective telemedicine techniques. By using optoplasmonic biosensors, the biosignals (that show lung cancer) were extracted and correlated with cloud datasets (containing patient information) to determine the dose of laser interstitial thermal therapy (LITT). Then, applying quantum teleportation, the biosignals and doses of LITT were teleported between two healthcare stations. From the numerical result, we observed the maximum sensitivity (10 421 nm/RIU) of the proposed biosensor, a minimum degree of the loss function and maximum correlation of data from the quantum machine learning model, and high teleportation fidelity (96% transmission fidelity for biosignals and 98% teleportation fidelity for doses LITT). This shows the proposed telemedicine schemes anticipated solutions for the long-distance faithful lung cancer telemedicine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0153566"
    },
    {
        "id": 2497,
        "title": "Optimization of a quantum cascade laser cavity for single-spatial-mode operation via machine learning",
        "authors": "S. A. Jacobs, J. D. Kirch, Y. Hu, S. Suri, B. Knipfer, Z. Yu, D. Botez, R. Marsland, L. J. Mawst",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Neural networks, trained with the ADAM algorithm followed by a globally convergent modification to Newton’s method, are developed to predict the threshold gain of the fundamental and first higher-order modes as functions of the refractive-index profile in a quantum cascade laser cavity. The networks are used to optimize the design of a refractive-index profile that provides essentially single-spatial-mode performance in a nominally multi-moded cavity by maximizing the threshold-gain differential between the modes. The use of neural networks allows the optimization to be performed in seconds, instead of days or weeks which would be required if Maxwell’s equations were repeatedly solved to obtain the threshold gains.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0158204"
    },
    {
        "id": 2498,
        "title": "Network traffic reduction with spatially flexible optical networks using machine learning techniques",
        "authors": "Aiqiang Wang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11082-023-05275-w"
    },
    {
        "id": 2499,
        "title": "Image Classification Based on Quantum Machine Learning",
        "authors": "Haocheng Xiong, Xinyuan Duan, Yue Yu, Junhan Zhang, Hao Yin",
        "published": "2023-5-19",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmsp58539.2023.10170998"
    },
    {
        "id": 2500,
        "title": "Machine-Learning-Based Qubit Allocation for Error Reduction in Quantum Circuits",
        "authors": "Travis LeCompte, Fang Qi, Xu Yuan, Nian-Feng Tzeng, M. Hassan Najafi, Lu Peng",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tqe.2023.3301899"
    },
    {
        "id": 2501,
        "title": "Enhancing Quantum Key Distribution Protocols with Machine Learning Techniques",
        "authors": "Bommi R.M, M. Nalini, N Vijayaraj, A.Mary Joy Kinol",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccebs58601.2023.10448811"
    },
    {
        "id": 2502,
        "title": "Rotation systems of some topological graph operations",
        "authors": "Qays Rashid Shakir",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0195996"
    },
    {
        "id": 2503,
        "title": "Research Oriented Reviewing of Quantum Machine Learning",
        "authors": "Aishwarya C, Venkatesan M, Prabhavathy P",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47392/irjash.2023.s022"
    },
    {
        "id": 2504,
        "title": "Machine learning designed optical lattice atom interferometer",
        "authors": "Victor Colussi, Justin Copenhaver, Maximilian Seifert, Michael Perlin, Murray Holland",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3003353"
    }
]