[
    {
        "id": 20705,
        "title": "A low-cost TinyML model for Mosquito Detection in Resource-Constrained Environments",
        "authors": "Gibson Kimutai, Anna Förster",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3582515.3609514"
    },
    {
        "id": 20706,
        "title": "CRYPTOGRAPHIC SOLUTIONS FOR RESOURCE-CONSTRAINED ENVIRONMENTS: SECURING THE INTERNET OF THINGS",
        "authors": "",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46741"
    },
    {
        "id": 20707,
        "title": "Efficient Adaptive Federated Learning in Resource-Constrained IoT Environments",
        "authors": "Zunming Chen, Hongyan Cui, Qiuji Luan, Yu Xi",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10436932"
    },
    {
        "id": 20708,
        "title": "Evaluating the Use of Interpretable Quantized Convolutional Neural Networks for Resource-Constrained Deployment",
        "authors": "Harry Rogers, Beatriz De La Iglesia, Tahmina Zebin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012231900003598"
    },
    {
        "id": 20709,
        "title": "Characterizing Distributed Inferencing at the Edge in Resource-Constrained Environments",
        "authors": "Scott Brown, David Harman, Cleon Anderson, Matthew Dwyer",
        "published": "2023-10-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/milcom58377.2023.10356309"
    },
    {
        "id": 20710,
        "title": "Leveraging Knowledge Distillation for Efficient Deep Reinforcement Learning in Resource-Constrained Environments",
        "authors": "Guanlin Meng",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424815"
    },
    {
        "id": 20711,
        "title": "Blockchain-based Resource Registration in Constrained IoT Environments",
        "authors": "Kheireddine Zaghouani, Badis Djamaa, Ali Yachir",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeccs56710.2023.10104987"
    },
    {
        "id": 20712,
        "title": "An extremely lightweight CNN model for the diagnosis of chest radiographs in resource‐constrained environments",
        "authors": "Gautam Kumar, Nirbhay Sharma, Angshuman Paul",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractBackgroundIn recent years, deep learning methods have been successfully used for chest x‐ray diagnosis. However, such deep learning models often contain millions of trainable parameters and have high computation demands. As a result, providing the benefits of cutting‐edge deep learning technology to areas with low computational resources would not be easy. Computationally lightweight deep learning models may potentially alleviate this problem.PurposeWe aim to create a computationally lightweight model for the diagnosis of chest radiographs. Our model has only  0.14M parameters and  550 KB size. These make the proposed model potentially useful for deployment in resource‐constrained environments.MethodsWe fuse the concept of depthwise convolutions with squeeze and expand blocks to design the proposed architecture. The basic building block of our model is called Depthwise Convolution In Squeeze and Expand (DCISE) block. Using these DCISE blocks, we design an extremely lightweight convolutional neural network model (ExLNet), a computationally lightweight convolutional neural network (CNN) model for chest x‐ray diagnosis.ResultsWe perform rigorous experiments on three publicly available datasets, namely, National Institutes of Health (NIH), VinBig ,and Chexpert for binary and multi‐class classification tasks. We train the proposed architecture on NIH dataset and evaluate the performance on VinBig and Chexpert datasets. The proposed method outperforms several state‐of‐the‐art approaches for both binary and multi‐class classification tasks despite having a significantly less number of parameters.ConclusionsWe design a lightweight CNN architecture for the chest x‐ray classification task by introducing ExLNet which uses a novel DCISE blocks to reduce the computational burden. We show the effectiveness of the proposed architecture through various experiments performed on publicly available datasets. The proposed architecture shows consistent performance in binary as well as multi‐class classification tasks and outperforms other lightweight CNN architectures. Due to a significant reduction in the computational requirements, our method can be useful for resource‐constrained clinical environment as well.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mp.16722"
    },
    {
        "id": 20713,
        "title": "Lightweight block ciphers for resource-constrained environments: A comprehensive survey",
        "authors": "Yue Zhong, Jieming Gu",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.future.2024.03.054"
    },
    {
        "id": 20714,
        "title": "Less is More: Deep Learning Framework for Digital Forensics in Resource-Constrained Environments",
        "authors": "Suman Rath, Tapadhir Das, Ignacio Astaburuaga, Shamik Sengupta",
        "published": "2023-5-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdfs58141.2023.10131803"
    },
    {
        "id": 20715,
        "title": "Retracted: Vision Sensor-Based Real-Time Fire Detection in Resource-Constrained IoT Environments",
        "authors": "",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9846578"
    },
    {
        "id": 20716,
        "title": "Reducing the Barriers to Designing 3D-Printable Prosthetics In Resource-Constrained Environments",
        "authors": "Junghun Lee, Andrew Chesang, Michael Gichane, Moise Busogi, Jean Byiringiro, Conrad Tucker",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "Abstract\nProsthetic devices remain unaffordable to many patients in resource-constrained environments. The design process of personalized prosthetic devices is sophisticated and requires specialized equipment and trained professionals who may have limited availability. The situation is further exacerbated by the fact that the resources are frequently situated away from underserved communities, compounding the issue of accessibility. Lowering the barriers to accessing required equipment and minimizing the involvement of trained professionals in designing and manufacturing prosthetic devices can potentially minimize the required visits to the prosthetists and lower the associated costs. Traditional prosthetic and orthotic device creation methods can take up to several months. There are attempts to leverage advanced technologies to enhance the design process, but they require special equipment such as 3D scanners and MRI equipment in addition to the active involvement of specialists.\nThis work proposes a computer vision method for creating a virtual model of the affected human limb. We also propose an automated approach for generating the socket from the virtual model and scaling other parts of the prosthetic device. The prosthetic device designed through the proposed process is realized via a 3D printer. We present a case study demonstrating the feasibility of our approach, using a mobile phone and open-source software to reconstruct a virtual representation of an upper limb and customize a prosthetic hand with minimal input from a specialist.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/detc2023-116399"
    },
    {
        "id": 20717,
        "title": "An Evaluation of AI-Based Network Intrusion Detection in Resource-Constrained Environments",
        "authors": "Syed Rizvi, Mark Scanlon, Jimmy McGibney, John Sheppard",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uemcon59035.2023.10315971"
    },
    {
        "id": 20718,
        "title": "Quantized Distillation: Optimizing Driver Activity Recognition Models for Resource-Constrained Environments",
        "authors": "Calvin Tanama, Kunyu Peng, Zdravko Marinov, Rainer Stiefelhagen, Alina Roitberg",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342203"
    },
    {
        "id": 20719,
        "title": "Pruning Federated Learning Models for Anomaly Detection in Resource-Constrained Environments",
        "authors": "Simone Magnani, Stefano Braghin, Ambrish Rawat, Roberto Doriguzzi-Corin, Mark Purcell, Domenico Siracusa",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386446"
    },
    {
        "id": 20720,
        "title": "Performance and Applicability of Post-Quantum Digital Signature Algorithms in Resource-Constrained Environments",
        "authors": "Marin Vidaković, Kruno Miličević",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "The continuous development of quantum computing necessitates the development of quantum-resistant cryptographic algorithms. In response to this demand, the National Institute of Standards and Technology selected standardized algorithms including Crystals-Dilithium, Falcon, and Sphincs+ for digital signatures. This paper provides a comparative evaluation of these algorithms across key metrics. The results indicate varying strengths and weaknesses for each algorithm, underscoring the importance of context-specific deployments. Our findings indicate that Dilithium offers advantages in low-power scenarios, Falcon excels in signature verification speed, and Sphincs+ provides robust security at the cost of computational efficiency. These results underscore the importance of context-specific deployments in specific and resource-constrained technological applications, like IoT, smart cards, blockchain, and vehicle-to-vehicle communication.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16110518"
    },
    {
        "id": 20721,
        "title": "Deep neural networks optimization for resource-constrained environments: techniques and models",
        "authors": "Raafi Careem, Md Gapar Md Johar, Ali Khatibi",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "This paper aims to present a comprehensive review of advanced techniques and models with a specific focus on deep neural network (DNN) for resource-constrained environments (RCE). The paper contributes by highlighting the RCE devices, analyzing challenges, reviewing a broad range of optimization techniques and DNN models, and offering a comparative assessment. The findings provide potential optimization techniques and recommend a baseline model for future development. It encompasses a broad range of DNN optimization techniques, including network pruning, weight quantization, knowledge distillation, depthwise separable convolution, residual connections, factorization, dense connections, and compound scaling. Moreover, the review analyzes the established optimization models which utilizes the above optimization techniques. A comprehensive analysis is conducted for each technique and model, considering its specific attributes, usability, strengths, and limitations in the context of effective deployment in RCEs. The review also presents a comparative assessment of advanced DNN models’ deployment for image classification, employing key evaluation metrics such as accuracy and efficiency factors like memory and inference time. The article concludes with the finding that combining depthwise separable convolution, weight quantization, and pruning represents potential optimization techniques, while also recommending EfficientNetB1 as a baseline model for the future development of optimization models in RCE image classification.<p> </p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v33.i3.pp1843-1854"
    },
    {
        "id": 20722,
        "title": "CNN-based, contextualized, real-time fire detection in computational resource-constrained environments",
        "authors": "Eleni Tsalera, Andreas Papadakis, Ioannis Voyiatzis, Maria Samarakou",
        "published": "2023-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.egyr.2023.05.260"
    },
    {
        "id": 20723,
        "title": "Deep reinforcement learning for application scheduling in resource-constrained, multi-tenant serverless computing environments",
        "authors": "Anupama Mampage, Shanika Karunasekera, Rajkumar Buyya",
        "published": "2023-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.future.2023.02.006"
    },
    {
        "id": 20724,
        "title": "Use of Blockchain in Securing IoT systems with Resource Constrained Devices",
        "authors": "Ritvij Kumar Sharma, Neena Goveas",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsa-c57050.2023.00055"
    },
    {
        "id": 20725,
        "title": "Perception-aware model predictive control for constrained control in unknown environments",
        "authors": "Angelo D. Bonzanini, Ali Mesbah, Stefano Di Cairano",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.automatica.2023.111418"
    },
    {
        "id": 20726,
        "title": "Digital Transformation of Micro-Enterprises in Resource-Constrained Environments: A Digital Bricolag",
        "authors": "Stan Karanasios, Aljona Zorina, PK Senyo, John K. Effah",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5465/amproc.2023.16064abstract"
    },
    {
        "id": 20727,
        "title": "AICOM-MP: an AI-based monkeypox detector for resource-constrained environments",
        "authors": "Tianyi Yang, Tianze Yang, Andrew Liu, Na An, Shaoshan Liu, Xue Liu",
        "published": "2024-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09540091.2024.2306962"
    },
    {
        "id": 20728,
        "title": "A Privacy-Aware Federated Learning Framework for Distributed Energy Resource Analytics in Constrained Environments",
        "authors": "Aditya Sundararajan, Robert A. Bridges, Mohammed Olama, Maximiliano Ferrari",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isgt-la56058.2023.10328226"
    },
    {
        "id": 20729,
        "title": "Challenges in Federated Learning for Resource-Constrained IoT Environments: Energy Efficiency, Privacy, and Statistical Heterogeneity",
        "authors": "Muhammad Umair, Wooi-Haw Tan, Yee-Loo Foo",
        "published": "2023-12-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraie59459.2023.10468189"
    },
    {
        "id": 20730,
        "title": "Blockchain in the Construction Industry: Developing a Conceptual Model for a Resource Sharing Decentralised Application (DApp)",
        "authors": "Eduardo Castillo",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47330/cbc.2023.ixmg7556"
    },
    {
        "id": 20731,
        "title": "HRC-CLSS: An Hybrid Resource Constrained Certificate-Less Signcryption Solution for Securing Crowdsourced IIoT Environments",
        "authors": "B Yamini, A Srinivasan, M. Selvi, S. Sumithra, T. Sathya, G S Uthayakumar",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220832"
    },
    {
        "id": 20732,
        "title": "A Simplified Method of Manually Constructing Small Format Tissue Microarray for Use in Resource-Constrained Settings",
        "authors": "Seetu Palo",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30699/ijp.2023.562055.2972"
    },
    {
        "id": 20733,
        "title": "Understanding resource use of an invasive species: Diet of the common warthog in Eastern Cape succulent thicket",
        "authors": "Nokubonga Mgqatsa, Kanyisa Jama, Marietjie Landman, Graham I.H. Kerley",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jaridenv.2024.105155"
    },
    {
        "id": 20734,
        "title": "Intermediaries as drivers of innovation development in resource-constrained environments: Insights from the Kenyan water sector",
        "authors": "Anne M.J. Hyvärinen, Marko Keskinen, Jarkko Levänen",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.technovation.2024.102956"
    },
    {
        "id": 20735,
        "title": "Federated Learning via Decentralized Dataset Distillation in Resource-Constrained Edge Environments",
        "authors": "Rui Song, Dai Liu, Dave Zhenyu Chen, Andreas Festag, Carsten Trinitis, Martin Schulz, Alois Knoll",
        "published": "2023-6-18",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191879"
    },
    {
        "id": 20736,
        "title": "Complexity-Driven Model Compression for Resource-constrained Deep Learning on Edge",
        "authors": "Muhammad Zawish, Steven Davy, Lizy Abraham",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tai.2024.3353157"
    },
    {
        "id": 20737,
        "title": "Survey of Dynamic Resource-Constrained Reward Collection Problems: Unified Model and Analysis",
        "authors": "Santiago R. Balseiro, Omar Besbes, Dana Pizarro",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": " Dynamic resource allocation problems arise under a variety of settings. In “Survey of Dynamic Resource-Constrained Reward Collection Problems: Unified Model and Analysis,” Balseiro, Besbes, and Pizarro introduce a unifying model for a large class of dynamic optimization problems dubbed dynamic resource-constrained reward collection (DRC2) problems. Surveying the literature, they show that this class encompasses a variety of disparate and classical problems typically studied separately, such as dynamic pricing with capacity constraints, dynamic bidding with budgets, network revenue management, online matching, or order fulfillment. Furthermore, they establish that the DRC2 class is amenable to analysis by characterizing the performance of a central, certainty-equivalent heuristic. Notably, they provide a novel unifying analysis that isolates the drivers of performance, recovers as corollaries some existing specialized results, generalizes other existing results by weakening the assumptions required, and yields new results in specialized settings for which no such characterization was available. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/opre.2023.2441"
    },
    {
        "id": 20738,
        "title": "Efficient Data Encryption and Signature Generation Scheme for Resource-Constrained IoT Environments",
        "authors": "Vilas D. Alagdeve, Rupinder Singh, Vasukidevi G, Bhawana Parihar, S. Dhananjeyan, B. Ashreetha",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i-smac58438.2023.10290224"
    },
    {
        "id": 20739,
        "title": "Portable ultrasound devices for obstetric care in resource-constrained environments: mapping the landscape",
        "authors": "Bryan J. Ranger, Elizabeth Bradburn, Qingchao Chen, Micah Kim, J. Alison Noble, Aris T. Papageorghiou",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "Background The WHO’s recommendations on antenatal care underscore the need for ultrasound assessment during pregnancy. Given that maternal and perinatal mortality remains unacceptably high in low- and middle-income countries (LMICs), these guidelines are imperative for achieving better outcomes. In recent years, portable ultrasound devices have become increasingly popular in LMICs due to their cost-effectiveness, useability, and adoptability in resource-constrained settings. This desk review presents the capabilities and costs of currently available portable ultrasound devices, and is meant to serve as a resource for clinicians and researchers in the imaging community. Methods A list of ideal technical features for portable ultrasound devices was developed in consultation with subject matter experts (SMEs). Features included image acquisition modes, cost, portability, compatibility, connectivity, data storage and security, and regulatory certification status. Information on each of the devices was collected from publicly available information, input from SMEs and/or discussions with company representatives. Results 14 devices were identified and included in this review. The output is meant to provide objective information on ideal technical features for available ultrasound systems to researchers and clinicians working in obstetric ultrasound in LMICs. No product endorsements are provided. Conclusions This desk review provides an overview of the landscape of low-cost portable ultrasound probes for use in obstetrics in LMICs, and provides a description of key capabilities and costs for each. Methods could be applied to mapping the landscape of portable ultrasound devices for other clinical applications, or may be extended to reviewing other types of healthcare technologies. Further studies are recommended to evaluate portable ultrasound devices for usability and durability in global field settings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12688/gatesopenres.15088.1"
    },
    {
        "id": 20740,
        "title": "Drivers of resource allocation for breeding under variable environments in a bet hedger",
        "authors": "Daniel Oro, Cassidy Waldrep, Albert Bertolero, Meritxell Genovart",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractThe evolutionary theory of life histories predicts that there is a trade‐off between survival and reproduction: since adult survival in long‐lived organisms is high, then breeding investment is more variable and more dependent on conditions (e.g. food availability and individual experience). Clutch features influence fitness prospects, but how a bet hedger builds its clutch in temporally varying environments is quite unknown. Using 27‐year data on 2847 clutches of known‐age breeders, we analyse how Audouin's gulls (Larus audouinii), a species showing a combination of conservative and adaptive bet‐hedging breeding strategies, can allocate energy by laying clutches and eggs of different sizes. Results show that both food availability and age influenced clutch size and total egg volume in a clutch. Interestingly, we found an interaction between food and age on egg parameters: total volume in two‐egg clutches, laid mostly by younger breeders, did not significantly change with food availability and the quadratic pattern in clutch size over the range of ages was less marked as long as food conditions became harsher. With increased food, females invested more by building larger first eggs, whereas they were more conservative on second and third eggs. Furthermore, asymmetries in egg volume within three‐egg clutches increased with food availability for old females. Egg size profiles of two‐egg clutches suggest that gulls should exhibit progressive reduction of the size of the third egg before shifting to a two‐egg clutch size. Food availability influenced all parameters studied, whereas age affected the amount of energy allocated for producing eggs (their size and number) but not the way of allocating those energies (i.e. asymmetries within the clutch). Despite the range of factors affecting the clutch, results suggest that females can allocate the amount of resources in a clutch optimally to increase their fitness under variable environments via bet‐hedging.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ece3.10485"
    },
    {
        "id": 20741,
        "title": "A comprehensive model explaining teachers’ intentions to use mobile-based assessment",
        "authors": "Hüseyin Ateş, Rabia Meryem Yilmaz",
        "published": "2023-4-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10494820.2023.2194928"
    },
    {
        "id": 20742,
        "title": "Entrepreneurship as emancipation: a process framework for female entrepreneurs in resource-constrained environments",
        "authors": "Bede Akorige Atarah, Vladi Finotto, Eimear Nolan, André van Stel",
        "published": "2023-7-28",
        "citations": 3,
        "abstract": "PurposeThe aim of this research is to determine the stages that women in resource-constrained environments go through in order to emancipate themselves through entrepreneurial activities. Based on their fieldwork, the authors develop a process framework of emancipation-through-entrepreneurship.Design/methodology/approachSemi-structured interviews were conducted with 57 female entrepreneurs in two resource-constrained countries in West Africa. Non-participant observations were employed as a secondary data collection technique to provide important sources of information for triangulation.FindingsThis study's findings indicate that the process of female emancipation through entrepreneurship begins with the perception of one's personal motivations, followed by the choice of economic activities, the gathering of various necessary resources, and finally the commencement and running of a venture to bring about the desired emancipation. Various factors, such as family, the external environment, personal qualities and ease of operations, were found to influence the choice of entrepreneurial activities. We also found that human, social, cultural and political capital interact to produce economic capital, a central form of capital for the starting and running of ventures in resource-constrained environments.Originality/valueAlthough extant studies have shown that entrepreneurship can be a vehicle for women to liberate themselves from various constraints, it is as yet unclear which process these women follow to achieve such emancipation. The development of a process framework of emancipation-through-entrepreneurship is the key contribution of this paper. Despite extant research demonstrating that entrepreneurship can assist women in financially limited settings to achieve economic independence, the specific steps these women take in the process remain unclear. Thus, this paper presents a process framework that focuses on women in constrained environments and their journey to emancipation through entrepreneurship.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/jsbed-05-2022-0243"
    },
    {
        "id": 20743,
        "title": "Sampling methods based on expected traffic-volume information for long-term rotation-based bridge SHM in resource-constrained environments",
        "authors": "Alan J. Ferguson, Connor O’Higgins, David Hester, Roger Woods",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ymssp.2023.110933"
    },
    {
        "id": 20744,
        "title": "SmartLite: A DBMS-Based Serving System for DNN Inference in Resource-Constrained Environments",
        "authors": "Qiuru Lin, Sai Wu, Junbo Zhao, Jian Dai, Meng Shi, Gang Chen, Feifei Li",
        "published": "2023-11",
        "citations": 0,
        "abstract": "Many IoT applications require the use of multiple deep neural networks (DNNs) to perform various tasks on low-cost edge devices with limited computation resources. However, existing DNN model serving platforms, such as TensorFlow Serving and TorchServe, are resource-intensive and require high-performance GPUs that are often not available on low-cost edge devices. In this paper, we propose SmartLite, a lightweight DBMS that addresses these challenges by storing the parameters and structural information of neural networks as database tables and implementing neural network operators inside the DBMS engine. SmartLite quantizes model parameters as binarized values, applies neural pruning techniques to compress the models, and transforms tensor manipulations into value lookup operations of the DBMS to reduce computation overhead. Experimental results show that SmartLite requires 98% less memory while achieving about a 134% performance speedup compared to Torch-Serve. Our proposed solution addresses the challenges of running multiple DNN models on low-cost edge devices and provides a significant contribution to the field of IoT applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14778/3632093.3632095"
    },
    {
        "id": 20745,
        "title": "Enhancing motivation and academic performance through gamified digital game-based learning methodology using the ARCS model",
        "authors": "Rubén Camacho-Sánchez, Jorge Serna Bardavío, Aaron Rillo-Albert, Pere Lavega-Burgués",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10494820.2023.2294762"
    },
    {
        "id": 20746,
        "title": "A Resource Aware Memory Requirement Calculation Model for Memory Constrained Context-Aware Systems",
        "authors": "Mumtaz Ali, Muhammad Arshad, Ijaz Uddin, Gauhar Ali, Muhammad Asim, Mohammed ELAffendi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3361317"
    },
    {
        "id": 20747,
        "title": "Efficient Transfer Learning Model for Automated Diabetic Retinopathy Grading in Resource-Constrained Environment",
        "authors": "K. Chandrakala, Y. Tulasi, D. Shanmukhi, M. RaveenaRai, D. SriHarshitha",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacrs58579.2023.10404251"
    },
    {
        "id": 20748,
        "title": "Resource Constrained Model Compression via Minimax Optimization for Spiking Neural Networks",
        "authors": "Jue Chen, Huan Yuan, Jianchao Tan, Bin Chen, Chengru Song, Di Zhang",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3611838"
    },
    {
        "id": 20749,
        "title": "Extremely Lightweight Constant-Round Membership-Authenticated Group Key Establishment for Resource-Constrained Smart Environments toward 5G",
        "authors": "Chingfang Hsu, Zhe Xia, Tianshu Cheng, Lein Harn",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "AbstractWith rapid development of next-generation mobile networks and communications (5G networks), group-oriented applications in resource-constrained smart environments (RSEs), such as smart homes and smart classrooms, have attracted great attentions. Due to the insecure communications between resource-constrained devices, secure group communications in RSE toward 5G face many challenges. In RSE toward 5G, lightweight communications and low computational overheads are crucial. Besides, the private tokens used to generate the group key are expected to be reused multiple times. However, the conventional frameworks for secure group communications cannot meet these requirements. A practical construction of extremely lightweight constant-round membership authenticated group key establishment framework is proposed in this paper for RSE toward 5G, which not only implements identity authentication among the members and group key establishment but also ensures extremely lightweight computation and communication costs by each group member. In our proposed scheme, the increase in the number of group members will not lead to a linear or logarithmic increase in the communication and calculation costs at the member side. Our framework also resists external and internal attacks and meets all the desirable security features. In this framework, the privacy of tokens can be well protected, so that they can be reused for multiple times. Therefore, our scheme significantly reduces the costs of communication and calculation, and it is more efficient compared with the related schemes in the literature. This proposal is fairly suitable for lightweight membership authentication and group key establishment in RSE toward 5G.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/comjnl/bxad023"
    },
    {
        "id": 20750,
        "title": "LDVNet: Lightweight and Detail-Aware Vision Network for Image Recognition Tasks in Resource-Constrained Environments",
        "authors": "Yuchen Liu, Hu Liang, Ran Qiu, Shengrong Zhao",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpads60453.2023.00354"
    },
    {
        "id": 20751,
        "title": "Cardiovascular Disease Preliminary Diagnosis Application Using SQL Queries: Filling Diagnostic Gaps in Resource-Constrained Environments",
        "authors": "Rafał Doniec, Eva Odima Berepiki, Natalia Piaseczna, Szymon Sieciński, Artur Piet, Muhammad Tausif Irshad, Ewaryst Tkacz, Marcin Grzegorzek, Wojciech Glinkowski",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "Cardiovascular diseases (CVDs) are chronic diseases associated with a high risk of mortality and morbidity. Early detection of CVD is crucial to initiating timely interventions, such as appropriate counseling and medication, which can effectively manage the condition and improve patient outcomes. This study introduces an innovative ontology-based model for the diagnosis of CVD, aimed at improving decision support systems in healthcare. We developed a database model inspired by ontology principles, tailored for the efficient processing and analysis of CVD-related data. Our model’s effectiveness is demonstrated through its integration into a web application, showcasing significant improvements in diagnostic accuracy and utility in resource-limited settings. Our findings indicate a promising direction for the application of artificial intelligence (AI) in early CVD detection and management, offering a scalable solution to healthcare challenges in diverse environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14031320"
    },
    {
        "id": 20752,
        "title": "Adversarial Training Method for Machine Learning Model in a Resource-Constrained Environment",
        "authors": "Mohammed Rajhi, Niki Pissinou",
        "published": "2023-10-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616391.3622768"
    },
    {
        "id": 20753,
        "title": "An integrated chance-constrained stochastic model for a preemptive multi-skilled multi-mode resource-constrained project scheduling problem: A case study of building a sports center",
        "authors": "Seyed-Ali Mirnezami, Reza Tavakkoli-Moghaddam, Reza Shahabi-Shahmiri, Mohammad Ghasemi",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106726"
    },
    {
        "id": 20754,
        "title": "Do More with Less: Single-Model, Multi-Goal Architectures for Resource-Constrained Robots",
        "authors": "Zili Wang, Drew Threatt, Sean B. Andersson, Roberto Tron",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10341879"
    },
    {
        "id": 20755,
        "title": "Asset Pricing in the Resource-Constrained Brain",
        "authors": "Hammad Siddiqi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4714217"
    },
    {
        "id": 20756,
        "title": "Let's Get Our Heads Out of the Clouds: A scalable and sustainable approach to HPC Training Labs for Resource Constrained Environments and anyone else stuck in the Clouds",
        "authors": "Bryan Johnston, Lara Timm, Eugene de Beste, Mabatho Hashatsi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22369/issn.2153-4136/15/1/13"
    },
    {
        "id": 20757,
        "title": "Novel 3D-printed device to enable prolonged ocular irrigation in austere and resource-constrained environments",
        "authors": "Nicholas A Chartrain, C Wisdom, V B Ho, K M Jackson",
        "published": "2024-4-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/military-2023-002627"
    },
    {
        "id": 20758,
        "title": "<i>American Journal of Sports Medicine</i> Reviewers and Loved Ones: You Are the “Impact Factor” Improving Lives in Resource-Constrained and Unconstrained Environments Worldwide",
        "authors": "Theodore J. Ganley",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/03635465231194351"
    },
    {
        "id": 20759,
        "title": "Robust Three-Factor Lightweight Authentication Based on Extended Chaotic Maps for Portable Resource-Constrained Devices",
        "authors": "Arijit Karati, Yu-Sheng Chang, Ting-Yu Chen",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012077600003555"
    },
    {
        "id": 20760,
        "title": "Improving training datasets for resource-constrained speaker recognition neural networks",
        "authors": "Pierre-Michel Bousquet, Mickael Rouvier",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-210"
    },
    {
        "id": 20761,
        "title": "A reactive scheduling approach for the resource-constrained project scheduling problem with dynamic resource disruption",
        "authors": "Jiaojiao Xu, Sijun Bai",
        "published": "2023-3-20",
        "citations": 2,
        "abstract": "PurposeThis paper aims to develop an algorithm to study the impact of dynamic resource disruption on project makespan and provide a suitable resource disruption ratio for various complex industrial and emergency projects.Design/methodology/approachThis paper addresses the RCPSP in dynamic environments, which assumes resources will be disrupted randomly, that is, the information about resource disruption is not known in advance. To this end, a reactive scheduling model is proposed for the case of random dynamic disruptions of resources. To solve the reactive scheduling model, a hybrid genetic algorithm with a variable neighborhood search is proposed.FindingsThe results obtained on the PSLIB instances prove the performance advantage of the algorithm; through sensitivity analysis, it can be obtained, the project makespan increases exponentially as the number of disruptions increase. Furthermore, if more than 50% of the project's resources are randomly disrupted, the project makespan will be significantly impacted.Originality/valueThe paper focuses on the impact of dynamic resource disruptions on project makespan. Few studies have considered stochastic, dynamic resource uncertainty. In addition, this research proposes a reasonable scheduling algorithm for the research problem, and the conclusions drawn from the research provide decision support for project managers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/k-09-2022-1339"
    },
    {
        "id": 20762,
        "title": "A feasible molecular diagnostic strategy for rare genetic disorders within resource-constrained environments",
        "authors": "Maria Mabyalwa Mudau, Heather Seymour, Patracia Nevondwe, Robyn Kerr, Careni Spencer, Candice Feben, Zané Lombard, Engela Honey, Amanda Krause, Nadia Carstens",
        "published": "2023-10-10",
        "citations": 1,
        "abstract": "AbstractTimely and accurate diagnosis of rare genetic disorders is critical, as it enables improved patient management and prognosis. In a resource-constrained environment such as the South African State healthcare system, the challenge is to design appropriate and cost-effective assays that will enable accurate genetic diagnostic services in patients of African ancestry across a broad disease spectrum. Next-generation sequencing (NGS) has transformed testing approaches for many Mendelian disorders, but this technology is still relatively new in our setting and requires cost-effective ways to implement. As a proof of concept, we describe a feasible diagnostic strategy for genetic disorders frequently seen in our genetics clinics (RASopathies, Cornelia de Lange syndrome, Treacher Collins syndrome, and CHARGE syndrome). The custom-designed targeted NGS gene panel enabled concurrent variant screening for these disorders. Samples were batched during sequencing and analyzed selectively based on the clinical phenotype. The strategy employed in the current study was cost-effective, with sequencing and analysis done at USD849.68 per sample and achieving an overall detection rate of 54.5%. The strategy employed is cost-effective as it allows batching of samples from patients with different diseases in a single run, an approach that can be utilized with rare and less frequently ordered molecular diagnostic tests. The subsequent selective analysis pipeline allowed for timeous reporting back of patients results. This is feasible with a reasonable yield and can be employed for the molecular diagnosis of a wide range of rare monogenic disorders in a resource-constrained environment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12687-023-00674-8"
    },
    {
        "id": 20763,
        "title": "Exploring the role of high school students’ internet use on their internet self-efficacy: a structural equation model",
        "authors": "Hua-yang Zhang, Yi-xin Wang, Wei Liu",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10494820.2023.2255235"
    },
    {
        "id": 20764,
        "title": "An Efficient Approximate Dynamic Programming Approach for Resource-Constrained Project Scheduling with Uncertain Task Duration",
        "authors": "Alireza Etminaniesfahani, Hanyu Gu, Leila Naeni, Amir Salehipour",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012356200003639"
    },
    {
        "id": 20765,
        "title": "Resource constrained neural network training",
        "authors": "Mariusz Pietrołaj, Marek Blok",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "AbstractModern applications of neural-network-based AI solutions tend to move from datacenter backends to low-power edge devices. Environmental, computational, and power constraints are inevitable consequences of such a shift. Limiting the bit count of neural network parameters proved to be a valid technique for speeding up and increasing efficiency of the inference process. Hence, it is understandable that a similar approach is gaining momentum in the field of neural network training. In the face of growing complexity of neural network architectures, reducing resources required for preparation of new models would not only improve cost efficiency but also enable a variety of new AI applications on modern personal devices. In this work, we present a deep refinement of neural network parameters limitation with the use of the asymmetric exponent method. In addition to the previous research, we study new techniques of floating-point variables limitation, representation, and rounding. Moreover, by leveraging exponent offset, we present floating-point precision adjustments without an increase in variables’ bit count. The proposed method allowed us to train LeNet, AlexNet and ResNet-18 convolutional neural networks with a custom 8-bit floating-point representation achieving minimal or no results degradation in comparison to baseline 32-bit floating-point variables.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-52356-1"
    },
    {
        "id": 20766,
        "title": "Factors associated with prolonged emergency department length of stay in a resource-constrained setting",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "Prolonged length of stay (LOS) in the emergency department (ED) is a key factor in measuring ED crowding worldwide. This study aimed to identify factors associated with prolonged LOS in the ED to better understand these factors at our institution. This was a retrospective record review examining factors associated with prolonged emergency department length of stay (>6-hours). Data were collected from electronic medical records, including patient demographics, chief complaints, triage acuity level, medication administration, diagnostic testing, consultations and patient disposition. In 2019, we recorded a total of 36,068 patient visits at our ED. Of these, 6439 (17.9%) patients met our definition of prolonged ED LOS (more than 6-hours) and were included in our analysis. Using multivariate analysis, we found that consulting services carried the highest predictor for prolonged ED LOS, with an adjusted odds ratio (aOR) of 23.0 and 95% confidence interval (CI) of 20.4–25.8. Followed by medication administration (aOR 2.0, CI 1.8–2.3), laboratory investigations (aOR 1.7, CI 1.5–2.0), radiological studies (aOR 1.8, CI 1.6–2.0), and non-Saudi nationality (aOR 1.3, CI 1.2–1.4), all p < 0.01. ED LOS may be reduced by optimizing the process of laboratory/radiology testing and medication administration. More importantly however, implementing a timeframe monitoring system for consultations while emphasizing accelerated decision-making and disposition for patients can reduce ED LOS.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22514/sv.2024.019"
    },
    {
        "id": 20767,
        "title": "A robust resource allocation model for optimizing data skew and consumption rate in cloud-based IoT environments",
        "authors": "K. Raghavendar, Isha Batra, Arun Malik",
        "published": "2023-6",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100200"
    },
    {
        "id": 20768,
        "title": "AdaL-PSO A New Adaptive Algorithm for the Multi-Skilled Resource-Constrained Project Scheduling Problem",
        "authors": "Phan Thanh Toan, Do Van Tuan",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "MS-RCPSP is a combinatorial optimization problem that has many practical applications, this problem has been proven to belong to the NP-hard class, the approach to solving this problem is to use algorithms to find approximate solution. This paper proposed a New Adaptive Local Particle Swarm Optimization algorithm for the MS-RCPSP problem. The solution for the class of NP-Hard problems is to find approximate solutions using metaheuristic algorithms. However, most metaheuristic-based algorithms have a weakness that can be fallen into local extreme after a number of evolution generations. In this paper, we adopted a new adaptive nonlinear weight update strategy based on fitness value and new neighborhood topology for Particle Swarm Optimization algorithm, thereby helping to prevent PSO from falling into local extremes. The new algorithm is called AdaL-PSO. A numerical analysis is carried out using iMOPSE benchmark dataset and is compared with some other early algorithms. Results presented suggest the prospect of our proposed algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15625/2525-2518/17919"
    },
    {
        "id": 20769,
        "title": "Paving the way towards a methodology to faithfully assess physical, physiological, and cognitive impacts of Augmented Reality under constrained environments: a Head-Mounted Display use case",
        "authors": "Benjamin Rémi Berton, Chloé Morel-Targosz, Romain Chaumillon, Marion Wolff",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3624323.3624332"
    },
    {
        "id": 20770,
        "title": "Linking Resource Mobilization Approaches and Venture Performance in Resource-Constrained Environment",
        "authors": "Abiodun Samuel Adegbile, Tahiru Azaaviele Liedong",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5465/amproc.2023.13053abstract"
    },
    {
        "id": 20771,
        "title": "Multi-Objective Multi-Skill Resource-Constrained Project Scheduling Considering Flexible Resource Profiles",
        "authors": "Xu Luo, Shunsheng Guo, Baigang Du, Xinhao Luo, Jun Guo",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "This paper addresses a novel multi-skill resource-constrained project scheduling problem with flexible resource profiles (F-MSRCPSP), in which the resource allocation of each activity consists of a certain number of discrete resources and is allowed to be adjusted over its duration. The F-MSRCPSP aims, therefore, to determine the flexible resource profile of each activity to minimize the make-span and total cost simultaneously. Then, a hybrid multi-objective fruit fly optimization algorithm is proposed to handle the concerned problem. In the proposed algorithm, two flexible parallel and serial schedule generation schemes are introduced, aiming to schedule activities and adjust allocated resource combinations. Additionally, two heuristic strategies are proposed to effectively select suitable resource combinations for activities. Moreover, a series of operators has been developed, including the rejoining operator, empirical re-arrangement operator, and empirical re-selection operator. These operators aim to accelerate the convergence speed and enhance the exploration of the proposed algorithm. Finally, the orthogonal test is used to select the optimal parameter combination, and comparative experiments based on tests with different scales are conducted, along with a t-test. The experimental results demonstrate that MOFOA-HS is effective in solving the F-MSRCPSP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14051921"
    },
    {
        "id": 20772,
        "title": "Resource-Restricted Environments Based Memory-Efficient Compressed Convolutional Neural Network Model for Image-Level Object Classification",
        "authors": "Zahra Waheed, Shehzad Khalid, Syed Mursleen Riaz, Sajid Gul Khawaja, Rimsha Tariq",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2022.3230008"
    },
    {
        "id": 20773,
        "title": "Research on the development of an effective mechanism of using public online education resource platform: TOE model combined with FS-QCA",
        "authors": "Guomin Chen, Pengrun Chen, Ying Wang, Nan Zhu",
        "published": "2023-9-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10494820.2023.2251038"
    },
    {
        "id": 20774,
        "title": "Indian Model of Integrated Healthcare (IMIH): a conceptual framework for a coordinated referral system in resource-constrained settings",
        "authors": "Moonis Mirza, Madhur Verma, Arun Aggarwal, Sidhartha Satpathy, Soumya Swaroop Sahoo, Rakesh Kakkar",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "Abstract\nIntroduction\nWith the escalating burden of chronic disease and multimorbidity in India, owing to its ageing population and overwhelming health needs, the Indian Health care delivery System (HDS) is under constant pressure due to rising public expectations and ambitious new health goals. The three tired HDS should work in coherence to ensure continuity of care, which needs a coordinated referral system. This calls for optimising health care through Integrated care (IC). The existing IC models have been primarily developed and adopted in High-Income Countries. The present study attempts to review the applicability of existing IC models and frame a customised model for resource-constrained settings.\n\nMethods\nA two-stage methodology was used. Firstly, a narrative literature review was done to identify gaps in existing IC models, as per the World Health Organization framework approach. The literature search was done from electronic journal article databases, and relevant literature that reported conceptual and theoretical concepts of IC. Secondly, we conceptualised an IC concept according to India's existing HDS, validated by multiple rounds of brainstorming among co-authors. Further senior co-authors independently reviewed the conceptualised IC model as per national relevance.\n\nResults\nExisting IC models were categorised as individual, group and disease-specific, and population-based models. The limitations of having prolonged delivery time, focusing only on chronic diseases and being economically expensive to implement, along with requirement of completely restructuring and reorganising the existing HDS makes the adoption of existing IC models not feasible for India. The Indian Model of Integrated Healthcare (IMIH) model proposes three levels of integration: Macro, Meso, and Micro levels, using the existing HDS. The core components include a Central Gateway Control Room, using existing digital platforms at macro levels, a bucket overflow model at the meso level, a Triple-layered Concentric Circle outpatient department (OPD) design, and a three-door OPD concept at the micro level.\n\nConclusion\nIMIH offers features that consider resource constraints and local context of LMICs while being economically viable. It envisages a step toward UHC by optimising existing resources and ensuring a continuum of care. However, health being a state subject, various socio-political and legal/administrative issues warrant further discussion before implementation.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12913-023-10454-2"
    },
    {
        "id": 20775,
        "title": "A prediction model for ranking branch-and-bound procedures for the resource-constrained project scheduling problem",
        "authors": "Weikang Guo, Mario Vanhoucke, José Coelho",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ejor.2022.08.042"
    },
    {
        "id": 20776,
        "title": "Spatially-Constrained Anomaly Detection in Crowded Environments using Meta-Heuristic Algorithm",
        "authors": "RJ Anandhi",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10276052"
    },
    {
        "id": 20777,
        "title": "To use or not to use ChatGPT in higher education? A study of students’ acceptance and use of technology",
        "authors": "Artur Strzelecki",
        "published": "2023-5-8",
        "citations": 81,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10494820.2023.2209881"
    },
    {
        "id": 20778,
        "title": "Efficient Resource Augmentation of Resource Constrained UAVs Through EdgeCPS",
        "authors": "Sangil Ha, Euteum Choi, Dongbeom Ko, Sungjoo Kang, Seongjin Lee",
        "published": "2023-3-27",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3555776.3577846"
    },
    {
        "id": 20779,
        "title": "Coastal communities’ livelihoods conditioned by resource use dynamics and changing environments in Lindi Region, South-Eastern Tanzania",
        "authors": "Pius Z. Yanda, Anselm R. Mwajombe, Brown Gwambene",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.marpol.2023.105532"
    },
    {
        "id": 20780,
        "title": "NASLMRP: Design of a Negotiation Aware Service Level Agreement Model for Resource Provisioning in Cloud Environments",
        "authors": "Pallavi Shelke, Rekha Shahapurkar",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "Cloud resource provisioning requires examining tasks, dependencies, deadlines, and capacity distribution. Scalability is hindered by incomplete or complex models. Comprehensive models with low-to-moderate QoS are unsuitable for real-time scenarios. This research proposes a Negotiation Aware SLA Model for Resource Provisioning in cloud deployments to address these challenges. In the proposed model, a task-level SLA maximizes resource allocation fairness and incorporates task dependency for correlated task types. This process's new tasks are processed by an efficient hierarchical task clustering process. Priority is assigned to each task. For efficient provisioning, an Elephant Herding Optimization (EHO) model allocates resources to these clusters based on task deadline and make-span levels. The EHO Model suggests a fitness function that shortens the make-span and raises deadline awareness. Q-Learning is used in the VM-aware negotiation framework for capacity tuning and task-shifting to post-process allocated tasks for faster task execution with minimal overhead. Because of these operations, the proposed model outperforms state-of-the-art models in heterogeneous cloud configurations and across multiple task types. The proposed model outperformed existing models in terms of make-span, deadline hit ratio, 9.2% lower computational cycles, 4.9% lower energy consumption, and 5.4% lower computational complexity, making it suitable for large-scale, real-time task scheduling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.8114"
    },
    {
        "id": 20781,
        "title": "An Iterative Online Approach to Safe Learning in Unknown Constrained Environments",
        "authors": "Minh Vu, Shen Zeng",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cdc49753.2023.10384171"
    },
    {
        "id": 20782,
        "title": "Resource allocation capabilities of commercial project management software packages for resource leveling and resource constrained project scheduling problems: A comparative study",
        "authors": "Noor Hussein Farooq Albayati,  , Saman Aminbakhsh",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31462/jcemi.2023.02104123"
    },
    {
        "id": 20783,
        "title": "A Cost Minimization Model for a Multi-mode, Multi-skilled, Resource-constrained Project Scheduling Problem with Discrete Time-cost-quality-risk Trade-off",
        "authors": "Ronaldo Villena Polancos, Rosemary Ruiz Seva",
        "published": "2023-1-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587889.3588207"
    },
    {
        "id": 20784,
        "title": "A Risk Minimization Model for a Multi-Skilled, Multi-Mode Resource-Constrained Project Scheduling Problem with Discrete Time-Cost-Quality-Risk Trade-Off",
        "authors": "Ronaldo V. Polancos, Rosemary R. Seva",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10429247.2023.2264161"
    },
    {
        "id": 20785,
        "title": "A Model-Specific End-to-End Design Methodology for Resource-Constrained TinyML Hardware",
        "authors": "Yanchi Dong, Tianyu Jia, Kaixuan Du, Yiqi Jing, Qijun Wang, Pixian Zhan, Yadong Zhang, Fengyun Yan, Yufei Ma, Yun Liang, Le Ye, Ru Huang",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dac56929.2023.10247791"
    },
    {
        "id": 20786,
        "title": "Achieving High Efficiency: Resource sharing techniques in artificial neural networks for resource-constrained devices",
        "authors": "Y Gorbounov, H Chen",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Abstract\nArtificial neural networks emerged in the early 1940s as a connectionist approach to modeling the behavior of interconnected living nerve cells within the intricate cognitive framework of the brain. Over the years, this idea has undergone unprecedented proliferation of ever-expanding application areas, accompanied by an exponential surge in the mathematical formalism employed. This prodigious growth poses severe demands on computational hardware infrastructure. The current research suggests a novel approach for optimizing artificial neural network architectures using resource-sharing techniques. It is discussed the concept of merging context-switching and time-division multiplexing in building a single-neuron artificial neural network with the aid of an FPGA device. This would benefit the significant reduction of hardware resources and the possibility of creating small yet very efficient artificial neural networks without deteriorating the dynamical system performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2719/1/012005"
    },
    {
        "id": 20787,
        "title": "Testing the robustness of a structural model for discerning use and non-use values of ecosystem services",
        "authors": "Hyunjung Kim, Frank Lupi",
        "published": "2023-8",
        "citations": 0,
        "abstract": "AbstractA theoretically consistent structural model facilitates definition and measurement of use and non-use benefits of ecosystem services. Unlike many previous approaches that utilize multiple stated choice situations, we apply this conceptual framework to a travel cost random utility model and a consequential single referendum contingent valuation research design for simultaneously estimating use and non-use willingness to pay for environmental quality improvement. We employ Monte Carlo generated data to evaluate properties of key parameters and examine the robustness of this method of measuring use and non-use values associated with quality change. The simulation study confirms that this new method, combined with simulated revealed and stated preference data can generally, but not always, be applied to successfully identify use and non-use values of various ecosystems while consistency is ensured.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/age.2023.26"
    },
    {
        "id": 20788,
        "title": "Using trusted responders in constrained aviation environments to reduce authentication overhead",
        "authors": "Jonathan Graefe, Laurent Leonardon, Mahmoud Esmael",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icns58246.2023.10124308"
    },
    {
        "id": 20789,
        "title": "Remote Pedestrian Localization Systems for Resource-Constrained Environments: A Systematic Review",
        "authors": "Asiimwe Paddy Junior, Luis Enrique Díez, Alfonso Bahillo, Odongo Steven Eyobu",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3266957"
    },
    {
        "id": 20790,
        "title": "On Resource-Constrained Stabilization of Nonlinear Parabolic PDE Systems with Parametric Drift",
        "authors": "Amr Zedan, Nael H. El-Farra",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/acc55779.2023.10155992"
    },
    {
        "id": 20791,
        "title": "Maximizing Computing Accuracy on Resource-Constrained Architectures",
        "authors": "Van-Phu Ha, Olivier Sentieys",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/date56975.2023.10136991"
    },
    {
        "id": 20792,
        "title": "A genetic algorithm with resource buffers for the resource-constrained multi-project scheduling problem",
        "authors": "Dries Bredael, Mario Vanhoucke",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ejor.2023.11.009"
    },
    {
        "id": 20793,
        "title": "Optimizing Reinforcement Learning-Based Visual Navigation for Resource-Constrained Devices",
        "authors": "U. Vijetha, V. Geetha",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3323801"
    },
    {
        "id": 20794,
        "title": "COMPARISON OF POINT-OF-CARE HEMOGLOBIN A1C TESTING WITH CENTRAL LABORATORY METHOD FOR ITS USE IN SCREENING AND MONITORING OF DIABETES MELLITUS IN A RESOURCE-CONSTRAINED SETTING",
        "authors": "Sara Reza,  ",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "Objective: The aim of this study is to evaluate the analytical performance of the Point-Of-Care Testing HbA1c analyzer for its use as an alternate to the central/core laboratory method.    Material and Methods: This was a cross-sectional study in which 176 samples of HbA1c were analyzed by POCT HbA1c analyzer (A1C EZ 2.0) and central laboratory analyzer (Cobas 6000) as comparative instrument.  Results: Based on the Bland-Altman plot, the HbA1c level for 164 out of 176 (93.18%) subjects analyzed by the POCT-HbA1c was within the range of the 95% limit of agreement. The area under the receiver operating characteristic (ROC) curve for clinical diagnosis of diabetes was 0.91. The sensitivity and specificity for HbA1c POCT were 94.5% and 88.0%.  Using regression analysis, the slope of the A1C EZ 2.0 vs the Cobas 6000 Analyzer was 0.934, with an intercept of 0.20 and a correlation coefficient of 0.97.  Conclusion: This study concludes that the POCT-HbA1c analyzer is a suitable replacement for central/core laboratory HbA1c measurement. It is useful for screening and monitoring of diabetes mellitus in certain situations especially in a resource constraint setting.  Keywords: Diabetes mellitus, Screening, Monitoring, HbA1c, Point-of-care testing",
        "keywords": "",
        "link": "http://dx.doi.org/10.55629/pakjpathol.v34i3.788"
    },
    {
        "id": 20795,
        "title": "Embedded Encryption and Compression Solution for Resource-Constrained ARM Microcontrollers",
        "authors": "Shameera Cassim, Tristyn Ferreiro, Amit Kumar Mishra",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/radioelektronika57919.2023.10109050"
    },
    {
        "id": 20796,
        "title": "Efficient Moving Target Detection Using Resource-Constrained Neural Networks",
        "authors": "Dimitris Milioris",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icasspw59220.2023.10193347"
    },
    {
        "id": 20797,
        "title": "Proposing new clustering-based algorithms for the multi-skilled resource-constrained multi-project scheduling problem with resource leveling adjustments",
        "authors": "Ehsan Goudarzi, Hamid Esmaeeli, Kia Parsa, Shervin Asadzadeh",
        "published": "2023-11-16",
        "citations": 2,
        "abstract": "PurposeThe target of this research is to develop a mathematical model which combines the Resource-Constrained Multi-Project Scheduling Problem (RCMPSP) and the Multi-Skilled Resource-Constrained Project Scheduling Problem (MSRCPSP). Due to the importance of resource management, the proposed formulation comprises resource leveling considerations as well. The model aims to simultaneously optimize: (1) the total time to accomplish all projects and (2) the total deviation of resource consumptions from the uniform utilization levels.Design/methodology/approachThe K-Means (KM) and Fuzzy C-Means (FCM) clustering methods have been separately applied to discover the clusters of activities which have the most similar resource demands. The discovered clusters are given to the scheduling process as priori knowledge. Consequently, the execution times of the activities with the most common resource requests will not overlap. The intricacy of the problem led us to incorporate the KM and FCM techniques into a meta-heuristic called the Bi-objective Symbiosis Organisms Search (BSOS) algorithm so that the real-life samples of this problem could be solved. Therefore, two clustering-based algorithms, namely, the BSOS-KM and BSOS-FCM have been developed.FindingsComparisons between the BSOS-KM, BSOS-FCM and the BSOS method without any clustering approach show that the clustering techniques could enhance the optimization process. Another hybrid clustering-based methodology called the NSGA-II-SPE has been added to the comparisons to evaluate the developed resource leveling framework.Practical implicationsThe practical importance of the model and the clustering-based algorithms have been demonstrated in planning several construction projects, where multiple water supply systems are concurrently constructed.Originality/valueReviewing the literature revealed that there was a need for a hybrid formulation that embraces the characteristics of the RCMPSP and MSRCPSP with resource leveling considerations. Moreover, the application of clustering algorithms as resource leveling techniques was not studied sufficiently in the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/k-06-2023-1044"
    },
    {
        "id": 20798,
        "title": "Ecotoxicity of Single-Use Plastics to Earthworms",
        "authors": "Teresa Rodríguez, Dana Represas, Emilio V. Carral",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "The excessive use of plastics in recent years, especially so-called single-use plastics, has led to an incipient increase in the presence of this material in the soil. As soil is the essential production factor in agriculture, this study aims to test the toxicity to earthworms of different concentrations of plastics using the same substrate for each sample. Earthworms are the main bioindicator of soil quality and are of particular ecological value because their disappearance or loss in population would have disastrous consequences for the environment. This study examines the growth, mortality and reproductive cycle of individual earthworms. The species to be studied is Eisenia fetida and during the test, individuals are immersed in five different concentrations: 1 mg/kg; 10 mg/kg; 100 mg/kg; 1000 mg/kg; and 2000 mg/kg. Bioplastic OK industrial compost (that meet the requirements established to comply with compostability according to EN 13432) was used. Whether the plastic in any of those concentrations is harmful to the worm population was then be checked. The test shows the mixture of PLA and PBAT (biodegradable plastic) studied has no significant effect on the population of Eisenia fetida. None of the variables studied yields significant data on this plastic and the effect it causes on the population of earthworms, Eisenia fetida.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/environments10030041"
    },
    {
        "id": 20799,
        "title": "Federated Learning with Pareto Optimality for Resource Efficiency and Fast Model Convergence in Mobile Environments",
        "authors": "June-Pyo Jung, Young-Bae Ko, Sung-Hwa Lim",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "Federated learning (FL) is an emerging distributed learning technique through which models can be trained using the data collected by user devices in resource-constrained situations while protecting user privacy. However, FL has three main limitations: First, the parameter server (PS), which aggregates the local models that are trained using local user data, is typically far from users. The large distance may burden the path links between the PS and local nodes, thereby increasing the consumption of the network and computing resources. Second, user device resources are limited, but this aspect is not considered in the training of the local model and transmission of the model parameters. Third, the PS-side links tend to become highly loaded as the number of participating clients increases. The links become congested owing to the large size of model parameters. In this study, we propose a resource-efficient FL scheme. We follow the Pareto optimality concept with the biased client selection to limit client participation, thereby ensuring efficient resource consumption and rapid model convergence. In addition, we propose a hierarchical structure with location-based clustering for device-to-device communication using k-means clustering. Simulation results show that with prate at 0.75, the proposed scheme effectively reduced transmitted and received network traffic by 75.89% and 78.77%, respectively, compared to the FedAvg method. It also achieves faster model convergence compared to other FL mechanisms, such as FedAvg and D2D-FedAvg.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24082476"
    },
    {
        "id": 20800,
        "title": "Lightweight Anonymous Key Sharing Authentication Protocol for Resource-Constrained IoT Devices",
        "authors": "Gunawan Widjaja",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smarttechcon57526.2023.10391317"
    },
    {
        "id": 20801,
        "title": "Intelligent classification model of land resource use using deep learning in remote sensing images",
        "authors": "Qingtao Liao",
        "published": "2023-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecolmodel.2022.110231"
    },
    {
        "id": 20802,
        "title": "Resource-constrained FPGA Design for Satellite Component Feature Extraction",
        "authors": "Andrew Ekblad, Trupti Mahendrakar, Ryan White, Markus Wilde, Isaac Silver, Brooke Wheeler",
        "published": "2023-3-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115681"
    },
    {
        "id": 20803,
        "title": "Sculpting DistilBERT: Enhancing Efficiency in Resource-Constrained Scenarios",
        "authors": "V. Prema, V. Elavazhahan",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smart59791.2023.10428568"
    },
    {
        "id": 20804,
        "title": "Recent Lightweight cryptography (LWC) based security advances for resource-constrained IoT networks",
        "authors": "Shraiyash Pandey, Bharat Bhushan",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-024-03714-4"
    },
    {
        "id": 20805,
        "title": "Using Technology Acceptance Model (TAM Model) to Increase Effectiveness the Use of Human Resource Information System (HRIS)",
        "authors": "Hariyadi Sumantri, Martinus Tukiran, Sufrin Hannan",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "Studies related to HRIS Applications show that the Technology Acceptance Model can be used to increase the use of HRIS Applications in a company. This research aims to test and reveal empirical factors that influence using the HRIS-Pakoku Application in the Pako Group. The two direct factors are perceived ease of use and perceived usefulness, and the indirect factor is a behavioural intention to use. This research was conducted at Pako Group using a questionnaire survey method, and samples were taken using the proposed stratified random sampling technique of 138 employees using HRIS at Pako Group. SEM analysis is used to determine the influence between research variables. The research results show a positive and significant influence of perceived ease of use on actual system use, a positive and significant influence of perceived usefulness on actual system use, and a positive and significant influence of behavioural intention to use on actual system use. There is a positive and insignificant influence of perceived ease of use on actual use through intention to use behaviour, and there is a positive and insignificant influence of perceived usefulness on actual system use through intention to use behaviour.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32832/jm-uika.v14i3.14492"
    },
    {
        "id": 20806,
        "title": "Resource-constrained repetitive project scheduling with soft logic",
        "authors": "Xin Zou, Zhuang Rong",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "PurposeIn repetitive projects, repetition offers more possibilities for activity scheduling at the sub-activity level. However, existing resource-constrained repetitive scheduling problem (RCRSP) models assume that there is only one sequence in performing the sub-activities of each activity, resulting in an inefficient resource allocation. This paper proposes a novel repetitive scheduling model for solving RCRSP with soft logic.Design/methodology/approachIn this paper, a constraint programming model is developed to solve the RCRSP using soft logic, aiming at the possible relationship between parallel execution, orderly execution or partial parallel and partial orderly execution of different sub activities of the same activity in repetitive projects. The proposed model integrated crew assignment strategies and allowed continuous or fragmented execution.FindingsWhen solving RCRSP, it is necessary to take soft logic into account. If managers only consider the fixed logic between sub-activities, they are likely to develop a delayed schedule. The practicality and effectiveness of the model were verified by a housing project based on eight different scenarios. The results showed that the constraint programming model outperformed its equivalent mathematical model in terms of solving speed and solution quality.Originality/valueAvailable studies assume a fixed logic between sub-activities of the same activity in repetitive projects. However, there is no fixed construction sequence between sub-activities for some projects, e.g. hotel renovation projects. Therefore, this paper considers the soft logic relationship between sub-activities and investigates how to make the objective optimal without violating the resource availability constraint.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ecam-08-2022-0703"
    },
    {
        "id": 20807,
        "title": "Performance Evaluation of PicoRV32 RISC-V Softcore for Resource-Constrained Devices",
        "authors": "Marek Jahnke, Lucas Bublitz, Ulf Kulau",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/norcas58970.2023.10305479"
    },
    {
        "id": 20808,
        "title": "Evaluating Compact Convolutional Neural Networks for Object Recognition Using Sensor Data on Resource-Constrained Devices",
        "authors": "Icaro Camelo, Ana-Maria Cretu",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ecsa-10-16202"
    },
    {
        "id": 20809,
        "title": "Pixel Tampering Detection in Encrypted Surveillance Videos on Resource-Constrained Devices",
        "authors": "Ifeoluwapo Aribilola, Brian Lee, Mamoona Naveed Asghar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4679958"
    },
    {
        "id": 20810,
        "title": "Sleep Apnea Detection System Using Machine Learning on Resource-Constrained Devices",
        "authors": "Sayani Mallick, Shubhangi Gawali, Clement Onime, Neena Goveas",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/syscon53073.2023.10131117"
    },
    {
        "id": 20811,
        "title": "Visions of the sustainable society: Philippe Bihouix’s resource-constrained world and the age of low-tech.",
        "authors": "Brendan Sheehan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4367031"
    },
    {
        "id": 20812,
        "title": "A Hybrid Approach for WebRTC Video Streaming on Resource-Constrained Devices",
        "authors": "Bakary Diallo, Abdelaziz Ouamri, Mokhtar Keche",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "This paper introduces thorough comparative and interoperability analyses involving a browser-based P2P video streaming approach utilizing WebRTC (web real-time communication), along with WebRTC hybrid solutions developed using the React Native framework (for mobile) and the electron framework (for desktop and Raspberry Pi). The assessment is carried out based on various metrics, including CPU (central processing unit) load, RAM (random access memory) utilization, and network data consumption. The obtained findings highlight the potential of integrating WebRTC P2P video streaming into hybrid applications as a promising alternative for real-time video streaming applications in embedded systems; given that, compared to the current mainstreams, e.g., Chrome or Firefox, the proposed approach has superiority performance in terms of CPU load, RAM usage, and network occupancy. The results also demonstrated that interoperability is ensured between the two types of applications (web-based and hybrid-based one).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12183775"
    },
    {
        "id": 20813,
        "title": "Metaheuristics for the bi-objective resource-constrained project scheduling problem with time-dependent resource costs: An experimental comparison",
        "authors": "Sofía Rodríguez-Ballesteros, Javier Alcaraz, Laura Anton-Sanchez",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cor.2023.106489"
    },
    {
        "id": 20814,
        "title": "Heterogeneous Coverage and Multi-Resource Allocation in Supply-Constrained Teams",
        "authors": "Mela Coffey, Alyssa Pierson",
        "published": "2023-5-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160414"
    },
    {
        "id": 20815,
        "title": "A new proactive and reactive approach for resource-constrained project scheduling problem under activity and resource disruption: a scenario-based robust optimization approach",
        "authors": "Maziar Khoshsirat, Seyed Meysam Mousavi",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10479-024-05895-9"
    },
    {
        "id": 20816,
        "title": "Ensemble intelligence algorithms and soil environmental quality to model economic quantity of land resource allocation and spatial inequality",
        "authors": "Feng Gao, Shiyi Yi, Xiaonuo Li, Weiping Chen",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.landusepol.2024.107147"
    },
    {
        "id": 20817,
        "title": "PDP-CNN: A Deep Learning Model for Post-Hurricane Reconnaissance of Electricity Infrastructure on Resource-Constrained Embedded Systems at the Edge",
        "authors": "Ashkan B. Jeddi, Abdollah Shafieezadeh, Roshanak Nateghi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tim.2023.3236321"
    },
    {
        "id": 20818,
        "title": "An Integrated Model for Multi-Mode Resource-Constrained Multi-Project Scheduling Problems Considering Supply Management with Sustainable Approach in the Construction Industry under Uncertainty Using Evidence Theory and Optimization Algorithms",
        "authors": "Mahyar Ghoroqi, Parviz Ghoddousi, Ahmad Makui, Ali Akbar Shirzadi Javid, Saeed Talebi",
        "published": "2023-8-8",
        "citations": 2,
        "abstract": "In this study, the multi-mode resource-constrained multi-project scheduling problems (MMRCMPSPs) considering supply management and sustainable approach in the construction industry under uncertain conditions have been investigated using evidence theory to mathematical modeling and solving by multi-objective optimization algorithms. In this regard, a multi-objective mathematical model has been proposed, in which the first objective function aims to maximize a weighted selection of projects based on economic, environmental, technical, social, organizational, and competitive factors; the second objective function is focused on maximizing profit, and the third objective function is aimed at minimizing the risk of supply management. Moreover, various components, such as interest rates, carbon penalties, and other implementation limitations and additional constraints, have also been considered in the modeling and mathematical relationships to improve the model’s performance and make it more relevant to real-world conditions and related issues, leading to better practical applications. In the mathematical modeling adopted, the processing time of project activities has been considered uncertain, and the evidence theory has been utilized. This method can provide a flexible and rational approach based on evidence and knowledge in the face of uncertainty. In addition, to solve the proposed multi-objective mathematical model, metaheuristic optimization algorithms, such as the differential evolution (DE) algorithm based on the Pareto archive, have been used, and for evaluating the results, the non-dominated sorting genetic algorithm II (NSGA-II) has also been employed. Furthermore, the results have been compared based on multi-objective evaluation criteria, such as quality metric (QM), spacing metric (SM), and diversity metric (DM). It is worth noting that to investigate the performance and application of the proposed model, multiple evaluations have been conducted on sample problems with different dimensions, as well as a case study on residential apartment construction projects by a contracting company. In this respect, the answers obtained from solving the model using the multi-objective DE algorithm were better and superior to the NSGA-II algorithm and had a more favorable performance. Generally, the results indicate that using the integrated multi-objective mathematical model in the present research for managing and scheduling multi-mode resource-constrained multi-project problems, especially in the construction industry, can lead to an optimal state consistent with the desired objectives and can significantly improve the progress and completion of projects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13082023"
    },
    {
        "id": 20819,
        "title": "An Integer Linear Programming Model for Quality Maximization of a Multi-mode, Multi-skilled, Resource-constrained Project Scheduling Problem with Discrete Time-cost-quality-risk Trade-off",
        "authors": "Ronaldo Villena Polancos, Rosemary Ruiz Seva",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3587889.3588206"
    },
    {
        "id": 20820,
        "title": "Data-Driven Task Offloading Method for Resource-Constrained Terminals via Unified Resource Model",
        "authors": "Xueshuo Chen, Yuxing Mao, Hongyu Wang, Yihang Xu, Danyang Li, Siyang Liu, Xianping Zhao",
        "published": "2023-6-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jiot.2023.3235065"
    },
    {
        "id": 20821,
        "title": "Practical Notes on the Current ESMO Consensus Guidelines for the Management of Patients with Metastatic Colorectal Cancer in Resource-Constrained Environments of Low- to Middle-Income Countries",
        "authors": "Jean-Marc Maurel, Maria Belen Tamayo, Rosario Pitargue, Annielyn Beryl Ong-Cornel, Piyush Mehta, Doudou Diouf, Chetan Deshmukh, Maheboob Basade, Salif Balde, Eunice Adanza-Cutillar, Shaheenah Dawood",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1159/000530275"
    },
    {
        "id": 20822,
        "title": "The Resource Constrained IOT Systems of Blockchain in Optimal Deployment Mechanism",
        "authors": "Madhur Taneja",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10441852"
    },
    {
        "id": 20823,
        "title": "DQN based Blockchain Data Storage in Resource-constrained IoT System",
        "authors": "Boyi Lei, Jianhong Zhou, Maode Ma, Xianhua Niu",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wcnc55385.2023.10118634"
    },
    {
        "id": 20824,
        "title": "A Framework for Seamless Trajectory Estimation and Navigation of Robotic Sensor Platform with Resource-Constrained Embedded Controller",
        "authors": "Pankhi Kashyap, Hardik Ghoshal, Siddharth Tallur",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sensors56945.2023.10324982"
    },
    {
        "id": 20825,
        "title": "tSIP: A Lightweight SIP-Based Messaging Protocol for Resource-Constrained Embedded Devices",
        "authors": "Haytham Khalil, Khalid Elgazzar",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/softcom58365.2023.10271628"
    },
    {
        "id": 20826,
        "title": "Deep learning acceleration at the resource-constrained tactical edge",
        "authors": "Billy Geerhart, Venkat R. Dasari, Peng Wang, Brian Rapp",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386886"
    },
    {
        "id": 20827,
        "title": "Magnetic tunnel junction model in Verilog-A for use in CAD environments for integrated circuits",
        "authors": " Lobkova M. D.,  Skirdkov P. N.,  Zvezdin K. A.",
        "published": "2023",
        "citations": 0,
        "abstract": "\n    Electrical model of a magnetic tunnel junction is developed in Verilog-A language, which can use in CAD systems to design an integrated circuit of spintronics devices. In order to check the correct operation of the model verification tests were created and carried out in Cadence ADE. Each test corresponds to the operating mode of the magnetic tunnel junction: switching, generation, rectification. Thus, the developed model can be used to simulate hybrid circuits comprising CMOS elements and magnetic tunnel junctions. Keywords: magnetic tunnel junction, MTJ, spintronics, spintronics devices, magnetic tunnel junction model in Verilog-A, MTJ model development, MTJ operating modes. \n   ",
        "keywords": "",
        "link": "http://dx.doi.org/10.21883/pss.2023.06.56100.06h"
    },
    {
        "id": 20828,
        "title": "RCD-SGD: Resource-Constrained Distributed SGD in Heterogeneous Environment Via Submodular Partitioning",
        "authors": "Haoze He, Parijat Dube",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00150"
    },
    {
        "id": 20829,
        "title": "Solving the Resource-Constrained Project Scheduling Problem (RCPSP) with Quantum Annealing",
        "authors": "Luis Fernando Pérez Armas, Stefan Creemers, Samuel Deleplanque",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4689017"
    },
    {
        "id": 20830,
        "title": "Treatment Approaches Towards the Management of Peptic Ulcer Disease in a Resource Constrained Setting",
        "authors": "",
        "published": "2023-12-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14738/bjhmr.106.15940"
    },
    {
        "id": 20831,
        "title": "Paleoindian land use at pluvial Lake Mojave: A temporally and seasonally dynamic wetlands resource patch in California’s central Mojave Desert",
        "authors": "Edward J. Knell, Jan Taylor, Matthew E. Kirby, Albert Garcia",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jasrep.2023.104059"
    },
    {
        "id": 20832,
        "title": "The Use of Thalidomide in Severe Refractory Anaemia Due to Gastric Antral Vascular Ectasia (GAVE) in Cirrhosis in a resource constrained set up-A case series from South India",
        "authors": "Sandheep Janardhanan, Bibin Perindakkad,  Mumthaz c",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jceh.2023.07.289"
    },
    {
        "id": 20833,
        "title": "Technical Note: Multimarket Cournot Equilibria with Heterogeneous Resource-Constrained Firms",
        "authors": "René Caldentey, Martin B. Haugh",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": " Charactering Cournot equilibria in settings with asymmetric firms is a challenging problem. In their technical note “Multimarket Cournot Equilibria with Heterogeneous Resource-Constrained Firms,” R. Caldentey and M. Haugh consider competition in a multimarket setting where firms are subject to varying budget or capacity constraints. They explicitly characterize the unique equilibrium in this environment by introducing the concepts of augmented and cutoff budgets for firms and markets. In particular, they show that a firm operates in a particular market if only if its augmented budget surpasses the market’s cutoff budget. They also investigate how the equilibrium properties change as the number of firms N varies while maintaining a fixed aggregate budget. They show via a numerical study that increasing N leads to a higher total output across all markets but that this monotonicity need not hold individual at the level of an individual market level. They also show that, although the firms’ cumulative payoff decreases in N, the consumer surplus and social surplus increase in N. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/opre.2022.0664"
    },
    {
        "id": 20834,
        "title": "A Machine Learning Approach to Resource Management in Cloud Computing Environments",
        "authors": "Samuel Manam, Klaus Moessner, Philip Asuquo",
        "published": "2023-9-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/africon55910.2023.10293275"
    },
    {
        "id": 20835,
        "title": "Multimedia contents confidentiality preservation in constrained environments: a dynamic approach",
        "authors": "Amina Souyah",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14863-7"
    },
    {
        "id": 20836,
        "title": "Secure Software Updates for Resource-Constrained IoT on The Blockchain",
        "authors": "Sanjay Sharma, Preety Sharma",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10182546"
    },
    {
        "id": 20837,
        "title": "Joint Modelling of Slot Filling and Intent Detection in Constrained Resource Scenarios",
        "authors": "Qixuan Li",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "In the era of pervasive smart devices, natural language understanding (NLU) holds a pivotal role for facilitating intelligent interactions and decision-making. Core to NLU are slot filling and intent recognition, essential tasks for comprehending user input. While joint modelling of these tasks has gained prominence, the challenges of realizing efficient joint models on resource-constrained devices have emerged as significant. These devices possess limited computational capacity and real-time requirements, necessitating lightweight and efficient models. In this study, we explore the design of a resource-efficient joint model for slot filling and intent recognition. Through leveraging BERT, , graph neural networks, and mask mechanisms, our model achieves the dual goals of semantic slot prediction and intent classification. We focus on model design, training, and real-time inference, aiming to contribute to the paradigm of resource-constrained natural language understanding. Our investigation demonstrates the efficacy of our approach, even when working with a reduced dataset, underscoring the model's applicability to real-world scenarios with limited resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v5i2.13124"
    },
    {
        "id": 20838,
        "title": "A Hybrid Cryptographic Algorithm for Resource-Constrained IoT Devices",
        "authors": "S. Metilda Florence, Stavin Alban, Harish Mogalipuvvu",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486560"
    },
    {
        "id": 20839,
        "title": "Distributed Device-Specific Anomaly Detection for Resource-Constrained Devices",
        "authors": "Christian Lübben, Marc-Oliver Pahl",
        "published": "2023-5-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/noms56928.2023.10154372"
    },
    {
        "id": 20840,
        "title": "Autoencoder-Based PPG Compression for Resource-Constrained Device",
        "authors": "Suvichak Santiwongkarn, Natakorn Kornworakarn, Prapun Suksompong, Tanut Choksatchawathi, Thitikorn Kaewlee, Theerawit Wilaiprasitporn",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssp53291.2023.10207971"
    },
    {
        "id": 20841,
        "title": "Efficient Read Disturb Management Schemes in Resource-Constrained Flash Memory Controller",
        "authors": "Ikjoon Son, Jin-Soo Kim",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nvmsa58981.2023.00022"
    },
    {
        "id": 20842,
        "title": "Design of a Lightweight Cryptographic Scheme for Resource-Constrained Internet of Things Devices",
        "authors": "Nahla Ibrahim, Johnson Agbinya",
        "published": "2023-3-30",
        "citations": 1,
        "abstract": "We propose an ultra-lightweight cryptographic scheme called “Small Lightweight Cryptographic Algorithm (SLA)”. The SLA relies on substitution–permutation network (SPN). It utilizes 64-bit plaintext and supports a key length of 80/128-bits. The SLA cipher includes nonlinear layers, XOR operations, and round permutation layers. The S-box serves to introduce nonlinearity in the entire scheme design. It plays a vital role in increasing the complexity and robustness of the design. The S-box can thwart attacks such as linear and differential attacks. The scheme makes it possible to breed many active S-boxes in a short number of rounds, hindering analytical attacks on the cipher. When compared to other currently used ciphers, SLA has a higher throughput. Additionally, we demonstrate the SLA’s performance as an ultra-lightweight compact cipher, and its security analysis. The SLA cipher’s design is well suited for applications where small-scale embedded system dissipation is critical. The SLA algorithm is implemented using Python.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13074398"
    },
    {
        "id": 20843,
        "title": "Constrained k-means algorithm for resource allocation in mobile cloudlets",
        "authors": "Rasim M. Alguliyev, Ramiz M. Aliguliyev, Rashid G. Alakbarov",
        "published": "2023-3-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14736/kyb-2023-1-0088"
    },
    {
        "id": 20844,
        "title": "A Novel Modified Ant Colony Optimization for Solving Multi-Skill Resource-Constrained Project Scheduling Problem",
        "authors": "Chiabwoot Ratanavilisagul",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccia59741.2023.00020"
    },
    {
        "id": 20845,
        "title": "Short Essay Series - Singapore's Journey in Energy and Resource Law",
        "authors": "Albert Tan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4659226"
    },
    {
        "id": 20846,
        "title": "A Lightweight Blockchain Framework for secure transaction in resource constrained IoT devices",
        "authors": "Rashmi Raj, Mohona Ghosh",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rait57693.2023.10126898"
    },
    {
        "id": 20847,
        "title": "Real-time Pedestrian Detection Using Resource Constrained Embedded Platforms – A Review",
        "authors": "Grace Cocks, Teresito Magbag, Maryam Hemmati, Kevin I-Kai Wang",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/swc57546.2023.10448873"
    },
    {
        "id": 20848,
        "title": "Robust constrained nonlinear Model Predictive Control with Gated Recurrent Unit model",
        "authors": "Irene Schimperna, Lalo Magni",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.automatica.2023.111472"
    },
    {
        "id": 20849,
        "title": "Reconstruction of Chest Wall Defects in Resource-Constrained Settings",
        "authors": "Nicholas L. Berlin, Adeyiza O. Momoh",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1245/s10434-024-15154-7"
    },
    {
        "id": 20850,
        "title": "Dynamic routing for efficient waste collection in resource constrained societies",
        "authors": "Marut Priyadarshi, Meet Maratha, Mohammad Anish, Vaibhav Kumar",
        "published": "2023-2-9",
        "citations": 3,
        "abstract": "AbstractWaste collection in developing nations faces multi-fold challenges, such as resource constraints and real-time changes in waste values, while finding the optimal routes. This paper attempts to address these challenges by modeling real-time waste values in smart bins and Collection Vehicles (CV). Further, waste value prioritized routes for coordinated CV, during various time intervals are modeled in a multi-agent environment for finding good routes. The CV, as agents, implement the formulated linear program to maximize the collected waste while minimizing the distance to the central depot. The city of Chandigarh, India, was divided into regions and the model was implemented to achieve significantly better performance in terms of waste collected in less distance and total bins covered when compared to the existing scenario. The stakeholders can use the outcomes to effectively plan the resources for better collection practices, which will have a positive impact on the environment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-29593-x"
    },
    {
        "id": 20851,
        "title": "The Use of Constructed Wetlands to Treat Effluents for Water Reuse",
        "authors": "Sandro Xavier de Campos, Manuel Soto",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "Constructed wetland systems (CWs) are technologies based on natural processes for pollutant removal and have been more and more accepted in the treatment of domestic and industrial wastewater. This study selected and reviewed articles published in the last six years involving the use of different CW conceptions and their association with other technologies to treat different effluents and evaluated the quality of the effluents for reuse. From a total of 81 articles reviewed, 41 presented quantitative data on the quality of the treated effluent in relation to the requirements of the reuse regulations in different countries of the world. CWs can be used to treat gray water and runoff water, as well as domestic and industrial effluents with the purpose of reusing them. While studies on the removal of new chemical and biological substances have increased, challenges are associated with the optimization of CWs to improve the removal of pathogens and new contaminants that have appeared more recently. The potential for the improved removal of those pollutants lies in the association of CWs with conventional and advanced technologies in new configurations. We concluded that studies related to the reuse of effluents using CWs are in constant evolution, with experiments at different scales. The perspectives are promising since CWs are an economic, environmentally friendly, and efficient technology to help in the mitigation of water scarcity problems imposed by climate changes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/environments11020035"
    },
    {
        "id": 20852,
        "title": "Enhancing UAS Sensor Operators' Performance in Constrained Network Environments",
        "authors": "Benjamin Purman,  , Daryn Dever, Bridget Furlong, Matthew Nulle",
        "published": "2023-5-16",
        "citations": 0,
        "abstract": "\n\t\t\t\t\t\t\tUnmanned aerial systems (UASs) are currently utilized to for a wide range of intelligence, surveillance, and reconnaissance (ISR) tasks. However, current operations require transmitting video data from the UAS platform to sensor operators at the ground control station (GCS) in realtime. This approach limits operations to environments where a high-bandwidth, low-latency data connection is available between the UAS platform and the GCS. Our paper examines the effectiveness of Forward Observer, an architecture which mitigates these networking limitations for UAS sensor operators. Forward Observer is designed around the notion of 'bursty' data products. Bursty data products are compressed image files that summarize events in UAS video stream data. To generate these products, Forward Observer incorporates on-board analytics (e.g., object detection, semantic labeling) to identify content of interest, and it incorporates recommendation algorithms to prioritize content to send to the operator. To examine Forward Observer's effectiveness, experienced sensor operators engaged in an ISR task under three conditions: (1) immediate access to bursty data products; (2) limited bandwidth for bursty data product transmission; and (3) Forward Observer capabilities in a limited bandwidth. Results across all research questions found that, with Forward Observer, participants had greater time task efficiency, the amount of data needed for their task was significantly less, and confidence generally increased after approximately six minutes in the ISR task. Implications of these results show that Forward Observer's bursty data products and on-board analytics and prioritization capabilities positively contribute to sensor operators' ISR task efficiency and success.\n\t\t\t\t\t\t",
        "keywords": "",
        "link": "http://dx.doi.org/10.4050/f-0079-2023-18613"
    },
    {
        "id": 20853,
        "title": "vStream IT: Video Streaming for Resource Constrained IoTs - An Optimal Control Approach",
        "authors": "Rohit Gupta, V. Mahendran, Venkataramana Badarla",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/comsnets59351.2024.10427461"
    },
    {
        "id": 20854,
        "title": "Efficient and Secure: Privacy-Preserving Federated Learning for Resource-Constrained Devices",
        "authors": "Muhammad Ayat Hidayat, Yugo Nakamura, Yutaka Arakawa",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mdm58254.2023.00038"
    },
    {
        "id": 20855,
        "title": "Image Classification on Resource-Constrained Microcontrollers",
        "authors": "Seungtae Hong, Gunju Park, Jeong-Si Kim",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictc58733.2023.10393661"
    },
    {
        "id": 20856,
        "title": "Obfuscated Memory Malware Detection in Resource-Constrained IoT Devices for Smart City Applications",
        "authors": "Sakib Shahriar Shafin, Gour Karmakar, Iven Mareels",
        "published": "2023-6-5",
        "citations": 8,
        "abstract": "Obfuscated Memory Malware (OMM) presents significant threats to interconnected systems, including smart city applications, for its ability to evade detection through concealment tactics. Existing OMM detection methods primarily focus on binary detection. Their multiclass versions consider a few families only and, thereby, fail to detect much existing and emerging malware. Moreover, their large memory size makes them unsuitable to be executed in resource-constrained embedded/IoT devices. To address this problem, in this paper, we propose a multiclass but lightweight malware detection method capable of identifying recent malware and is suitable to execute in embedded devices. For this, the method considers a hybrid model by combining the feature-learning capabilities of convolutional neural networks with the temporal modeling advantage of bidirectional long short-term memory. The proposed architecture exhibits compact size and fast processing speed, making it suitable for deployment in IoT devices that constitute the major components of smart city systems. Extensive experiments with the recent CIC-Malmem-2022 OMM dataset demonstrate that our method outperforms other machine learning-based models proposed in the literature in both detecting OMM and identifying specific attack types. Our proposed method thus offers a robust yet compact model executable in IoT devices for defending against obfuscated malware.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23115348"
    },
    {
        "id": 20857,
        "title": "The challenges of implementing infection prevention and antimicrobial stewardship programs in resource-constrained settings",
        "authors": "Salma Abbas",
        "published": "2024",
        "citations": 0,
        "abstract": "Abstract\nThe burden of healthcare-associated infections (HAIs) and antimicrobial resistance (AMR) is disproportionately high in low and middle-income countries. Barriers to implementing effective antimicrobial stewardship and infection prevention programs include the lack of a structural framework, consensus guidelines, educational opportunities, trained personnel, funding, and access to resources such as manpower, information technology, and diagnostics. Socioeconomic instability with supply chain interruptions, poor skilled staff retention, absence of mandates, and inadequate support to enforce existing policies further aggravates the situation. Failure to implement measures to tackle AMR and HAIs effectively will result in repercussions globally.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/ash.2024.35"
    },
    {
        "id": 20858,
        "title": "Performance Analysis for Resource Constrained Decentralized Federated Learning Over Wireless Networks",
        "authors": "Zhigang Yan, Dong Li",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcomm.2024.3362143"
    },
    {
        "id": 20859,
        "title": "A Comprehensive Performance Evaluation of Procedural Geometry Workloads on Resource-Constrained Devices",
        "authors": "Edon Govori, Ilir Murturi, Schahram Dustdar",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edge60047.2023.00049"
    },
    {
        "id": 20860,
        "title": "Enhanced Recovery Program after Pylorus Preserving Pancreaticoduodenectomy in a Resource Constrained Country",
        "authors": "H. Ahmed, H. Bari, Z. Hyidar, I. Ahmed",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.hpb.2023.07.504"
    },
    {
        "id": 20861,
        "title": "Modified Differential Evolution Algorithm for Solving Multi-Skill Resource-Constrained Project Scheduling Problem",
        "authors": "Akarasate Homwiseswongsa, Chiabwoot Ratanavilisagul",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitee59582.2023.10317769"
    },
    {
        "id": 20862,
        "title": "Design of a Blockchain-Based Secure Storage Architecture for Resource-Constrained Healthcare",
        "authors": "Laura Rodrigues Soares, Jéferson Campos Nobre, Gabriel Kerschner",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscc58397.2023.10218178"
    },
    {
        "id": 20863,
        "title": "A two-stage method for doubly resource constrained elementary shortest path problems",
        "authors": "Xuefeng Jin, Shunzheng Yu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.knosys.2024.111661"
    },
    {
        "id": 20864,
        "title": "PerconAI 2023: 2nd Workshop on Pervasive and Resource-Constrained Artificial Intelligence - Program",
        "authors": "",
        "published": "2023-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/percomworkshops56833.2023.10150360"
    },
    {
        "id": 20865,
        "title": "Performance Tradeoff in DNN-based Coexisting Applications in Resource-Constrained Cyber-Physical Systems",
        "authors": "Elijah Spicer, Sabur Baidya",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartcomp58114.2023.00053"
    },
    {
        "id": 20866,
        "title": "Deep reinforcement learning for solving resource constrained project scheduling problems with resource disruptions",
        "authors": "Hongxia Cai, Yunqi Bian, Lilan Liu",
        "published": "2024-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rcim.2023.102628"
    },
    {
        "id": 20867,
        "title": "LEVERAGING MOBILE TECHNOLOGY FOR ENHANCED DIAGNOSIS OF TROPICAL FEBRILE DISEASES IN RESOURCE-CONSTRAINED SETTINGS",
        "authors": "",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33965/ijcsis_2023180207"
    },
    {
        "id": 20868,
        "title": "EE407 Economic Assessment in Resource-Constrained Systems – a Case Study Using an Individual-Level Simulation Model in Wet Age-Related Macular Degeneration and Diabetic Macular Oedema",
        "authors": "T. Li, V. Berdunov, R. Postema, M. Bagijn, O. Cox, R.D. Hamilton, G. Machnicki",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jval.2023.09.673"
    },
    {
        "id": 20869,
        "title": "A holistic mathematical cyber security model in fog resource management in computing environments",
        "authors": "Prabhat Kumar Srivastava, Ashish Kumar Srivastava, Raja Rao Budaraju, Rama Krishna Yellapragada, Sasidhar Attuluri, Smaranika Mohapatra",
        "published": "2024",
        "citations": 0,
        "abstract": "In the evolving landscape of computing environments, fog computing has emerged as a pivotal technology for handling the increasing demands of Internet of Things (IoT) applications. Fog computing, with its decentralized approach, brings computational power closer to IoT devices, reducing latency and bandwidth constraints. However, this distributed architecture poses significant cybersecurity challenges, necessitating a holistic mathematical model to ensure the security and integrity of fog resources. This review presents a comprehensive mathematical cyber security model that is tailored to fog resource management in computing environments. The models generally encompass a wide array of security aspects, including data confidentiality, integrity, availability, and authentication. Leveraging advanced mathematical techniques, the models offer a robust framework for assessing and enhancing security in fog computing systems. The key components include threat modeling, risk assessment, and dynamic resource allocation strategies. By systematically analyzing potential threats and vulnerabilities specific to fog computing, these models assist in devising effective countermeasures and security policies. Moreover, there is a need to incorporate an adaptive resource allocation algorithm to dynamically allocate computing resources based on security priorities and real-time threat assessments. This review demonstrates the effectiveness of the mathematical cyber security model in bolstering the resilience of fog computing environments. The review highlights the need for safeguarding the next generation of fog computing systems against cyber threats, fostering the continued growth and adoption of transformative technology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47974/jdmsc-1962"
    },
    {
        "id": 20870,
        "title": "Li-IDS: An Approach Towards a Lightweight IDS for Resource-Constrained IoT",
        "authors": "Mahawish Fatima, Osama Rehman, Ibrahim M.H Rehman",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10216096"
    },
    {
        "id": 20871,
        "title": "Shielding in Resource-Constrained Goal POMDPs",
        "authors": "Michal Ajdarów, Šimon Brlej, Petr Novotný",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "We consider partially observable Markov decision processes (POMDPs) modeling an agent that needs a supply of a certain resource (e.g., electricity stored in batteries) to operate correctly. The resource is consumed by the agent's actions and can be replenished only in certain states. The agent aims to minimize the expected cost of reaching some goal while preventing resource exhaustion, a problem we call resource-constrained goal optimization (RSGO). We take a two-step approach to the RSGO problem. First, using formal methods techniques, we design an algorithm computing a shield for a given scenario: a procedure that observes the agent and prevents it from using actions that might eventually lead to resource exhaustion. Second, we augment the POMCP heuristic search algorithm for POMDP planning with our shields to obtain an algorithm solving the RSGO problem. We implement our algorithm and present experiments showing its applicability to benchmarks from the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i12.26715"
    },
    {
        "id": 20872,
        "title": "Context-Aware Task Handling in Resource-Constrained Robots with Virtualization",
        "authors": "Ramyad Hadidi, Nima Shoghi Ghaleshahi, Bahar Asgari, Hyesoon Kim",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edge60047.2023.00047"
    },
    {
        "id": 20873,
        "title": "YoseUe: “trimming” Random Forest’s training towards resource-constrained inference",
        "authors": "Alessandro Verosimile, Alessandro Tierno, Andrea Damiani, Marco D. Santambrogio",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asp-dac58780.2024.10473804"
    },
    {
        "id": 20874,
        "title": "LEVERAGING ARTIFICIAL INTELIGENCE FOR DEVELOPMENT OF A COST-EFFECTIVE BRONCHOSCOPY SIMULATOR FOR RESOURCE-CONSTRAINED SETTINGS",
        "authors": "ANDRES L MORA, ERIN DEBIASI",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chest.2023.07.2542"
    },
    {
        "id": 20875,
        "title": "Functional analysis of variance (ANOVA) for carbon flux estimates from remote sensing data",
        "authors": "Jonathan Hobbs, Matthias Katzfuss, Hai Nguyen, Vineet Yadav, Junjie Liu",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract. The constellation of Earth-observing satellites has now produced atmospheric greenhouse gas concentration estimates covering a period of several years. Their global coverage is providing additional information on the global carbon cycle. These products can be combined with complex inversion systems to infer the magnitude of carbon sources and sinks around the globe. Multiple factors, including the atmospheric transport model and satellite product aggregation method, can impact such flux estimates. Analysis of variance (ANOVA) is a well-established statistical framework for estimating common signals while partitioning variability across factors in the analysis of experiments. Functional ANOVA extends this approach with a statistical model that incorporates spatiotemporal correlation for each ANOVA component. The approach is illustrated on inversion experiments with different satellite retrieval aggregation methods and identifies consistent significant patterns in flux increments that span large spatial scales. Functional ANOVA identifies these patterns while accounting for the uncertainty at small spatial scales that is attributed to differences in the aggregation method. Functional ANOVA is also applied to a recent flux model intercomparison project (MIP), and the relative magnitudes of inversion system effects and data source (satellite versus in situ) are similar but exhibit slightly different importance for fluxes over different continents. In all examples, the unexplained residual variability is locally sizable in magnitude but with limited spatial and temporal correlation. These common behaviors across flux inversion experiments demonstrate the diagnostic capability for functional ANOVA to simultaneously distinguish the spatiotemporal coherence of carbon cycle processes and algorithmic factors.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/gmd-17-1133-2024"
    },
    {
        "id": 20876,
        "title": "On multiple imputation-based reconstruction of degraded faces and recognition in multiple constrained environments",
        "authors": "Joseph Agyapong Mensah, Eric Ocran, Louis Asiedu",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sciaf.2023.e01964"
    },
    {
        "id": 20877,
        "title": "A chance-constrained programming method with credibility measure for solving the multi-skill multi-mode resource-constrained project scheduling problem",
        "authors": "Mohammad Ghasemi, Ripon K. Chakrabortty, Reza Shahabi-Shahmiri, Seyed-Ali Mirnezami",
        "published": "2023-9-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15623599.2023.2252255"
    },
    {
        "id": 20878,
        "title": "Deploying Machine Learning in Resource-Constrained Devices for Human Activity Recognition",
        "authors": "Rafael Schild Reusch, Leonardo Rezende Juracy, Fernando Gehm Moraes",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sbesc60926.2023.10324073"
    },
    {
        "id": 20879,
        "title": "Resource-Constrained Device Characterization for Detecting Sleep Apnea Using Machine Learning",
        "authors": "Sayani Mallick, Pranav Ruparel, Shubhangi Gawali, Neena Goveas",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10216211"
    },
    {
        "id": 20880,
        "title": "High frequency architecture of SLIM lightweight block cipher for resource-constrained IoT applications",
        "authors": "Pravin Kumar, Zeesha Mishra, Bibhudendra Acharya",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmoce57812.2023.10164839"
    },
    {
        "id": 20881,
        "title": "A Chosen-Provably-Secure Attack-Resistant Light-Weight Digital Signature Based on Elliptical Curve for Resource Constrained Applications",
        "authors": "Dhanashree K Toradmalle,  , K Amarendra",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i16.410"
    },
    {
        "id": 20882,
        "title": "Edge analytics on resource constrained devices",
        "authors": "Omer Rana, Sean Savitz, Charith Perera",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcse.2023.10059382"
    },
    {
        "id": 20883,
        "title": "What tuberculosis infection control measures are effective in resource-constrained primary healthcare facilities? A systematic review of the literature",
        "authors": " Marme,  Rutherford,  Harris",
        "published": "2023-3-22",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22605/rrh7175"
    },
    {
        "id": 20884,
        "title": "An imperialist competitive algorithm with adaptive cooperation for resource-constrained unrelated parallel machines scheduling with setup time",
        "authors": "Fengteng Dai, Deming Lei",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326702"
    },
    {
        "id": 20885,
        "title": "Digital monitoring for data-driven antimicrobial stewardship: a process perspective from resource-constrained contexts in India",
        "authors": "Yogita Thakral",
        "published": "2023-8-2",
        "citations": 2,
        "abstract": "Antimicrobial Resistance (AMR) is one of society’s most urgent global issues, requiring urgent multidisciplinary-based research and practice approaches to engage with these policies. Several global and national policy statements have been released in the last two decades, particularly emphasising the strengthening of the digital surveillance system. However, implementing these initiatives remains patchy, particularly in the context of public health systems in Low- and Middle-Income Countries. This paper argues that one of the significant reasons contributing to this sub-optimal uptake of these systems is that the top-down implementation models do not adequately cater to the needs, aspirations, and capacities of the health facility staff, who, ultimately, are the end users of the system. The paper highlights the importance of digital technology in healthcare facilities with resource constraints to promote the responsible use of antibiotics. It discusses the process of developing an evidence base for action in low- and middle-income countries (LMICs) through digitally mediated data-driven policy. This process is conceptualised as a three-phase process, which involves stabilising data entry, generating outcomes, and taking action at the local level. The paper argues the need for bottom-up implementation models, which emphasise the need to understand the practices users engage with in their everyday work and design the digital system to add value and not work to these everyday practices. The paper emphasises the importance of building local capacities to develop effective and sustainable antimicrobial stewardship (AMS) programs through enabling networking around digital solutions, creating value in networked partnerships, initiating conversations around data, and raising awareness of the digital to develop AMS programs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frabi.2023.1214826"
    },
    {
        "id": 20886,
        "title": "Efficient hardware implementations of lightweight Simeck Cipher for resource-constrained applications",
        "authors": "Kaluri Praveen Raja, Zeesha Mishra, Pulkit Singh, Bibhudendra Acharya",
        "published": "2023-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.vlsi.2022.10.009"
    },
    {
        "id": 20887,
        "title": "Robustifying the resource-constrained project scheduling against uncertain durations",
        "authors": "Fang Fu, Qi Liu, Guodong Yu",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122002"
    },
    {
        "id": 20888,
        "title": "Edge analytics on resource constrained devices",
        "authors": "Sean Savitz, Charith Perera, Omer Rana",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcse.2023.133674"
    },
    {
        "id": 20889,
        "title": "Energy Consumption Constrained Resource Cell Optimization Based on Multipoint Channel Charting",
        "authors": "Yuanqing Ye, Zhikun Chen, Ming Zhao, Sihai Zhang",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wcsp58612.2023.10404263"
    },
    {
        "id": 20890,
        "title": "Comparison of Virtual Machines and Bare Metal for CNFs at Resource-Constrained Network Edge",
        "authors": "Paul Veitch, Adam Broadbent, Arsham Farshad",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/netsoft57336.2023.10175415"
    },
    {
        "id": 20891,
        "title": "A Heuristic Algorithm for a Robust Resource-Constrained Project Scheduling Problem with Multi-Skilled Resources",
        "authors": "Weibao You, Zhe Xu, Ming Lu",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485231.019"
    },
    {
        "id": 20892,
        "title": "Touch and Motion Sensor Data Collection on Smart Devices in Constrained and Unconstrained Environments",
        "authors": "Faheem Nikhat H, Saad Yunus Sait, Sarathchandra Mantavalam, Abhijeet Rastogi",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nelex59773.2023.10420975"
    },
    {
        "id": 20893,
        "title": "CSMA/CA-based Random Access Control Suitable for Delay-Constrained Packet Transfer in Smart Factory Environments",
        "authors": "Hideki Tode, Kaita Takemoto, Yosuke Tanigawa",
        "published": "2023-3-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciot57267.2023.10084878"
    },
    {
        "id": 20894,
        "title": "Adversarial Object Rearrangement in Constrained Environments with Heterogeneous Graph Neural Networks",
        "authors": "Xibai Lou, Houjian Yu, Ross Worobel, Yang Yang, Changhyun Choi",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342412"
    },
    {
        "id": 20895,
        "title": "Frontier Research on Low-Resource Speech Recognition Technology",
        "authors": "Wushour Slam, Yanan Li, Nurmamet Urouvas",
        "published": "2023-11-10",
        "citations": 1,
        "abstract": "With the development of continuous speech recognition technology, users have put forward higher requirements in terms of speech recognition accuracy. Low-resource speech recognition, as a typical speech recognition technology under restricted conditions, has become a research hotspot nowadays because of its low recognition rate and great application value. Under the premise of low-resource speech recognition technology, this paper reviews the research status of feature extraction and acoustic models, and conducts research on resource expansion. Especially in terms of the technical challenges faced by this technology, solutions are proposed, and future research directions are prospected.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23229096"
    },
    {
        "id": 20896,
        "title": "Computation Efficient ECG Classification on Resource Constrained Devices",
        "authors": "Andrea Arigliano, Andrea Malagoli, Luca Bedogni",
        "published": "2023-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/percomworkshops56833.2023.10150333"
    },
    {
        "id": 20897,
        "title": "Reinforcement learning based flow and energy management in resource-constrained wireless networks",
        "authors": "Hrishikesh Dutta, Amit Kumar Bhuyan, Subir Biswas",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comcom.2023.02.011"
    },
    {
        "id": 20898,
        "title": "Resource-Constrained Scheduling Algorithms for Stochastic Independent Tasks With Unknown Probability Distribution",
        "authors": "Yiqin Gao, Yves Robert, Frédéric Vivien",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00453-023-01100-8"
    },
    {
        "id": 20899,
        "title": "High frequency architecture of lightweight authenticated cipher ELEPHANT -160 for resource-constrained IoT applications",
        "authors": "Nidhi Baurai, Zeesha Mishra, Bijayananda Patnaik, Bibhudendra Acharya",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ocit59427.2023.10430512"
    },
    {
        "id": 20900,
        "title": "RarePlanes Soar Higher: Self-Supervised Pretraining for Resource Constrained and Synthetic Datasets",
        "authors": "Justin Downes, Will Gleave, Dan Nakada",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw58289.2023.00041"
    },
    {
        "id": 20901,
        "title": "Quantized autoencoder (QAE) intrusion detection system for anomaly detection in resource-constrained IoT devices using RT-IoT2022 dataset",
        "authors": "B S Sharmila, Rohini Nagapadma",
        "published": "2023-9-5",
        "citations": 2,
        "abstract": "AbstractIn recent years, many researchers focused on unsupervised learning for network anomaly detection in edge devices to identify attacks. The deployment of the unsupervised autoencoder model is computationally expensive in resource-constrained edge devices. This study proposes quantized autoencoder (QAE) model for intrusion detection systems to detect anomalies. QAE is an optimization model derived from autoencoders that incorporate pruning, clustering, and integer quantization techniques. Quantized autoencoder uint8 (QAE-u8) and quantized autoencoder float16 (QAE-f16) are two variants of QAE built to deploy computationally expensive AI models into Edge devices. First, we have generated a Real-Time Internet of Things 2022 dataset for normal and attack traffic. The autoencoder model operates on normal traffic during the training phase. The same model is then used to reconstruct anomaly traffic under the assumption that the reconstruction error (RE) of the anomaly will be high, which helps to identify the attacks. Furthermore, we study the performance of the autoencoders, QAE-u8, and QAE-f16 using accuracy, precision, recall, and F1 score through an extensive experimental study. We showed that QAE-u8 outperforms all other models with a reduction of 70.01% in average memory utilization, 92.23% in memory size compression, and 27.94% in peak CPU utilization. Thus, the proposed QAE-u8 model is more suitable for deployment on resource-constrained IoT edge devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s42400-023-00178-5"
    },
    {
        "id": 20902,
        "title": "Multi-armed bandits for resource efficient, online optimization of language model pre-training: the use case of dynamic masking",
        "authors": "Inigo Urteaga, Moulay Zaidane Draidia, Tomer Lancewicki, Shahram Khadivi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.675"
    },
    {
        "id": 20903,
        "title": "High frequency architecture of lightweight authenticated cipher ASCON-128 for resource-constrained IoT devices",
        "authors": "Linga Pallavi, Pulkit Singh, Bijayananda Patnaik, Bibhudendra Acharya",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ocit59427.2023.10430713"
    },
    {
        "id": 20904,
        "title": "Pixel tampering detection in encrypted surveillance videos on resource-constrained devices",
        "authors": "Ifeoluwapo Aribilola, Brian Lee, Mamoona Naveed Asghar",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iot.2023.101058"
    }
]