[
    {
        "id": 26105,
        "title": "A new definition and three categories for classifying ecosystems",
        "authors": "Jaime Gómez-Márquez",
        "published": "2023-3-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20935/acadbiol6072"
    },
    {
        "id": 26106,
        "title": "Framework for Choosing a Supervised Machine Learning Method for Classification Based on Object Categories : Classifying Subjectivity of Online Comments by Product Categories",
        "authors": "Alexandre St-Vincent Villeneuve, Michel Plaisent",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3628454.3630041"
    },
    {
        "id": 26107,
        "title": "Classifying Recollements of Derived Module Categories for Derived Discrete Algebras",
        "authors": "Xiuli Bian",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10468-023-10220-2"
    },
    {
        "id": 26108,
        "title": "RankMix: Data Augmentation for Weakly Supervised Learning of Classifying Whole Slide Images with Diverse Sizes and Imbalanced Categories",
        "authors": "Yuan-Chih Chen, Chun-Shien Lu",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.02292"
    },
    {
        "id": 26109,
        "title": "Alexander Kalbarczyk: Predication and Ontology. Studies and Texts on Avicennian and Post-Avicennian Readings of Aristotle’s Categories",
        "authors": "Matthias Perkams",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17104/0017-1417-2024-1-77"
    },
    {
        "id": 26110,
        "title": "Critical Reading of Informational Texts Scaffold: Evaluating the Efficacy of an Instructional Scaffold for Reading Multiple Scientific Texts",
        "authors": "Vanessa Vongkulluksn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2018262"
    },
    {
        "id": 26111,
        "title": "DATA AUGMENTATION IN TEXT CLASSIFICATION WITH MULTIPLE CATEGORIES",
        "authors": "B. Pavlyshenko, M. Stasiuk",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30970/eli.25.6"
    },
    {
        "id": 26112,
        "title": "Deep-BERT: Transfer Learning for Classifying Multilingual Offensive Texts on Social Media",
        "authors": "Md. Anwar Hussen Wadud, M. F. Mridha, Jungpil Shin, Kamruddin Nur, Aloke Kumar Saha",
        "published": "2023",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.027841"
    },
    {
        "id": 26113,
        "title": "Classifying Sentiments on Social Media Texts: A GPT-4 Preliminary Study",
        "authors": "Lany Laguna Maceda, Jennifer Laraya Llovido, Miles Biago Artiaga, Mideth Balawiswis Abisado",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3639233.3639353"
    },
    {
        "id": 26114,
        "title": "Classifying chemicals into toxicity categories based on LC50 values- Pros and cons",
        "authors": "K. Sadasivan Pillai,  ,  ",
        "published": "2023-9-2",
        "citations": 0,
        "abstract": "It is a usual practice to determine LC50 value in acute toxicity studies conducted in aquatic organisms as an initial step to assess the toxicity of chemicals. In regulatory toxicity studies, normally conducted in GLP (Good Laboratory Practice) certified facilities, acute toxicity of chemicals is evaluated in fish, crustacea, and or alga following the methods given in OECD Guidelines. The chemicals are classified into different toxicity categories based on the LC50/EC50 determined from the acute toxicity studies. For calculating LC50 in acute toxicity tests, the methods given in the OECD (2019) Guidelines are Probit or Logit Analysis (Litchfield & Wilcoxon method and Probit Analysis), Spearman-Karber method, the binomial method, the moving average method, and the graphical method. LC50 is the concentration of a substance that causes 50 % mortality in a batch of test organisms (eg. fish). In acute toxicity studies with laboratory animals like rats, mice, rabbits, etc, instead of LC50, the terminology LD50 is used. The procedure for the calculation of both LC50 and LD50 is same. In this article, LC50 and LD50 are written interchangeably. It means if 100 fish are exposed to LC50, theoretically 50 fish would die. In fact, the inventor of LC50 (Trevan, 1927) defined LC50 as the median lethal concentration. Like any other median value, the LC50 is not affected by extreme values of either side. Unfortunately, Trevan was ruthlessly misquoted by the animal ethicists, as they believed that he was responsible for killing millions of animals for determining the median lethal concentration. According to Rowan (1983), the median lethal concentration in animals varies considerably among the species and is affected by environmental factors. Trevan proposed median lethal concentration (LD50) in frogs and rodents for biological standardization of digitalis extract, insulin, and diphtheria toxin when he was working at Wellcome Research Labs, Beckenham (Pillai et al., 2021a). Trevan never promoted sacrificing more animals to determine median lethal concentration. He was aware of the fact that the determination of median lethal concentration is affected by several factors. The 'characteristic' of a dose-response curve proposed by Trevan is species and test substance-specific. However, after Trevan, LD50s were determined in acute toxicity studies to evaluate the effect of a substance, not for the biological standardization of drugs. His intention was to establish a numerical quality control standard to assess batch-to-batch variation, if any,  of the therapeutic products of the Wellcome Research Labs.              Based on the LC50/EC50 values determined in aquatic toxicity studies, the chemicals are classified into a hazard category. For example, according to United Nations Global Harmonized System (GHS), if the 96 LC50 of a chemical to fish is ≤ 1 mg l-1 , this chemical is classified into hazard category I (GHS, 2019).Though several methods are prescribed in OECD (2019) Guidelines, if the mortality data are adequate, Probit Analysis of Finney (1978) and Litchfield and Wilcoxon (1949) method may be preferred to determine LC50 as these methods provide additional valuable information on the concentration-mortality relationship. If the lowest mortality obtained is close to 16% and the highest mortality is close to 84%, most of the above-mentioned methods would result in a more or less similar LC50value (Pillai et al., 2021a).Calculation of LC50 manually by the Litchfield and Wilcoxon method is somewhat easier, but Probit Analysis is a bit cumbersome. Commercial statistical software is available for the calculation of LC50 by both the above methods.  But, using the software without understanding the underlying concepts of the statistical methods has certain disadvantages. Researchers also present the toxicity of a substance in terms of LC10, LC90, etc. Since the variability of these estimates is large, their biological relevance is limited. Concentration-mortality curve in the 16-84% mortality range is linear, hence the LC50 determined from this concentration-mortality curve is reliable. The method of Litchfield and Wilcoxon (1949), uses the 16-84% mortality range for calculating LC50. This method does not consider mortality below 16 and above 84% for the LC50 calculation. But Probit Analysis by Finney (1978) considers all mortality values (excluding 0 and 100 % mortality) for the calculation of LC50.              Researchers in academic institutions use LC50 values to compare the toxicity of the test substances - the lower the LC50, the substance is more toxic, and vice-versa (Islam et al., 2021).Toxicity grading of substances solely based on LC50 is inappropriate. Recently, the appropriate use of LC50 values for the GHS classification of chemicals has been questioned (Pillai et al., 2021a). LC50s vary in a wide range from one species to the other (Geyer et al., 1993) and many times are irreproducible within the same species (Peres and Pihan, 1991), as the physico-chemical parameters of dilution water play a crucial role in LC50 experiments. Hrovat et al. (2009) reported significant variability of fish LC50 test results for 44 compounds. A consistent LC50 could not be obtained in more than 750 tests conducted on fathead minnows with 644 chemicals (Mc Carty, 2012).              It is a statutory requirement for the United Nations GHS that the environmental hazards should be mentioned on the labels of chemicals for distribution. The European Chemicals Agency (ECHA, 2017) uses fish LC50 for the environmental classification of a chemical according to the GHS of Classification, Labelling and Packaging of Chemicals (Paparella et al., 2021). The major disadvantage of such labelling is that the LC50 value alone does not provide information on the toxicity profile of chemicals. Showing a similar LC50 does not mean that the toxicity profile of the chemicals is same. It is important to consider the slopes of the concentration-mortality curve when comparing the LC50s of the chemicals. The slope which reflects the concentration-mortality relationship provides a better understanding of the causality between a toxicant and response (Tsatsakis et al., 2018). In Probit Analysis, parallel regression lines of mortality probits on log concentrations indicate that the mode of action of chemicals on test organisms is similar (Finney, 1978). If the regression lines are not parallel, it is a clear indication that the chemicals possess different modes of action on that particular organism. Also, it is important to present LC50 with 95% confidence limits. If the 95% confidence limits of LC50s of the chemicals are distinctly separate, LC50s can be considered different from each other. The LC50s cannot be considered different from each other if the 95% confidence limits of the LC50s overlap. Chemicals with similar LC50 values may manifest toxicity differently. Similarly, chemicals with different LC50 values may manifest similar toxicity effects; hence, the classification of chemicals into various groups based on LC50 values may not have much relevance (Pillai et al., 2021b).              Ethical conduct of fish toxicity studies and euthanizing of exposed fish are emphasized in the OECD (2019) and CCSEA (Committee for Control and Supervision of Experiments on Animals) Guidelines (CPCSEA, 2021).  Earlier the fish toxicity studies were conducted with 10 fish exposed to each test concentration, but the revised OECD (2019) Guideline recommends a minimum number of 7 fish for each test concentration. The probable mortality data that can be obtained in an acute test where 7 numbers of fish are exposed to each test concentration are (number of fish died/total number of fish exposed) 0/7, 1/7, 2/7, 3/7, 4/7, 5/7, 6/7, or 7/7. For calculating LC50 values by the methods of Litchfield and Wilcoxon (1949) and Finney (1978), 0 and 100% mortality are not used, since no probit values can be assigned for 0 and 100% mortality. The remaining 6 numbers of mortality data are adequate for calculating a reliable LC50 value, if the mortality data spreads over all phases of the concentration-mortality curve, particularly covering 16-84% mortality region. If the mortality data does not spread over all the phases of the concentration-mortality curve in a concentration-dependent manner, the confidence limits of LC50 could be exploded (Pillai et al., 2021b).              Estimation of LD50 in rodents by the methods of Litchfield and Wilcoxon (1949) and Finney (1978) is discouraged by US Consumer Product Safety Commission, US Environmental Protection Agency, US Food and Drug Administration, National Toxicology Program, and OECD, due to ethical reasons and poor reproducibility of LD50 values. But, classical methods are used to determine LC50 values in environmental toxicity studies, especially with aquatic organisms. It is more biologically relevant to interpret LC50 in terms of the slope of concentration-mortality curve and confidence interval of LC50.              My association with Dr. R.C. Dalela and Journal of Environmental Biology began in the early 1980s when he was working at D.A.V College Muzaffarnagar.  His research work and enthusiasm for bringing up the Journal of Environmental Biology to an international standard fascinated me. I realized from his research work that he was a committed environmentalist.  I had an opportunity to majorly organize two national conferences of the Academy of Environmental Biology. He always occupied the front row in the conferences listening to all scientific presentations keenly. He had taken a lot of hardships to bring the journal to this sustainable level with a WOS Impact Factor of 0.70. I remember as it had happened yesterday, my meeting with him at D.A.V. College, Muzaffarnagar, at JRF, Vapi, Marathwada Ambedkar University, Aurangabad, and in Chennai. He was an excellent teacher, a great scientist, a mentor to several researchers, and self-disciplined.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22438/jeb/44/5/editorial"
    },
    {
        "id": 26115,
        "title": "Multiple Bin-Size Bin Packing Problem Considering Incompatible Product Categories",
        "authors": "Yu-Chung Tsao, Jo-Ying Tai, Tsung-Hui Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4382833"
    },
    {
        "id": 26116,
        "title": "Higher Auslander’s defect and classifying substructures of $$\\varvec{n}$$-exangulated categories",
        "authors": "Jiangsheng Hu, Yajun Ma, Dongdong Zhang, Panyue Zhou",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10485-023-09713-4"
    },
    {
        "id": 26117,
        "title": "Multiple Award Categories Amplify Partner Appreciation",
        "authors": "Erin Sandage",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/vmr.32010"
    },
    {
        "id": 26118,
        "title": "Discursive Elements Directing  Reading Process: Categories of Prediction in Informative Texts in Turkish Textbooks",
        "authors": "Nermin YAZICI, Günçe GÜNDUĞDU",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Bu çalışmada ortaokul Türkçe 5. ve 8. sınıf ders kitaplarındaki bilgilendirici metinlerde yer alan ve okuma sürecinde okuru yönlendiren söylemsel düzenlemelerin Tadros’un (1998) önerdiği Kestirim Kategorileri (Numaralandırma, İleri Etiketleme, Aktarım, Özetleme, Varsayma, Soru) çerçevesinde betimlenmesi amaçlanmıştır. Bu amaç doğrultusunda, çalışmada öncelikle Tadros’un sınıflaması araştırmacılar tarafından seçilen metin örnekleri üzerinden tanıtılmış, sonrasında mevcut sınıflama Türkçe ders kitaplarındaki bilgilendirici metinlerdeki söylemsel düzenlemelerin analizinde kullanılmıştır. Çalışma nitel araştırma yöntemlerinden durum çalışması yöntemiyle tasarlanmıştır. Çalışmanın verileri doküman analizi tekniği ile elde edilmiş olup, çalışma kapsamında ortaokul Türkçe 5. ve 8. sınıf ders kitaplarında yer alan bilgilendirici metinler incelenmiştir. Çalışmada ulaşılan verilerin analizinde içerik analizi yöntemine başvurulmuştur. Çalışma sonucunda her iki düzeydeki metinlerde de çeşitli kestirim ifadelerine rastlandığı; 5. sınıf Türkçe ders kitabında en yüksek sıklığın Aktarım kategorisinde, 8. sınıf Türkçe ders kitabında ise Soru kategorisinde gözlemlendiği belirlenmiştir. Mevcut bulgular değerlendirildiğinde, söylemsel düzenlemelerin ana dili eğitiminin temel araçlarından biri olan ders kitaplarındaki temsiliyetinin, öğrencilerin okuma stratejisi geliştirme, biçimsel şema bilgilerini destekleme, metin türüne özgü dilsel düzenlemeleri fark etme ve metin alıcısıyla etkileşimde olan metinler üretebilmeleri bakımından önemli olduğu düşünülmektedir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35233/oyea.1200444"
    },
    {
        "id": 26119,
        "title": "Comparing the potential of IR-spectroscopic techniques to gas chromatography coupled to ion mobility spectrometry for classifying virgin olive oil categories",
        "authors": "Clemente Ortiz-Romero, Rocío Ríos-Reina, Diego L. García-González, María José Cardador, Raquel M Callejón, Lourdes Arce",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.fochx.2023.100738"
    },
    {
        "id": 26120,
        "title": "Dominant Characteristics of Subject Categories in a Multiple-Category Hierarchical Scheme: A Case Study of Scopus",
        "authors": "Eungi Kim, Da-Yeong Jeong",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "The Scopus journal classification method, known as All Science Journal Classification (ASJC), follows a hierarchical organization of subject categories: minor, major, and supergroups. At the minor level, journals are assigned to one or more subject categories. We refer to this classification scheme as a multiple-category hierarchical scheme. The objective of this study is to investigate the dominant characteristics of subject categories within the Scopus database and quantify their dominance using various subject indices. To conduct the study, we formulated a set of subject category indices, including the Number of Journals (J), Total Instances of Subject Categories (SC), Number of Unique Subject Categories (USC), and Dominance Index (DOMI). The results showed that high DOMI values in subject categories indicate specialization and limited associations with other fields. There were minimal correlations between DOMI and other subject category indices like J, SC, and USC, demonstrating their uniqueness and independence. The study also revealed that subject categories within the Health Sciences exhibited higher DOMI values and greater specialization compared to those in the Physical Sciences, indicating a pronounced dominance in Health Sciences minor categories. Finally, minor subject categories exhibited more variation in subject category indices compared to their upper-level subject categories, highlighting the intricate variations within the hierarchical system of the Scopus classification. These findings have implications for researchers, emphasizing the need to consider a subject category’s dominance and associations when selecting journals for their research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/publications11040051"
    },
    {
        "id": 26121,
        "title": "An Evaluation of Hybrid Deep Learning Models for Classifying Multiple Lower Limb Actions",
        "authors": "Zilu Wang, Ian Daly, Junhua Li",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/embc40787.2023.10340894"
    },
    {
        "id": 26122,
        "title": "A data-driven and generalizable model for classifying outdoor recreation opportunities at multiple spatial extents",
        "authors": "Hongchao Zhang, Jordan W. Smith",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.landurbplan.2023.104876"
    },
    {
        "id": 26123,
        "title": "Resource Redeployment and the Pursuit of Multiple Categories in a Stigmatized Industry",
        "authors": "Yoo Jung Ha",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5465/amproc.2023.12607abstract"
    },
    {
        "id": 26124,
        "title": "Weight of authorship evidence with multiple categories of stylometric features: A multinomial-based discrete model",
        "authors": "Shunichi Ishihara",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.scijus.2022.12.007"
    },
    {
        "id": 26125,
        "title": "What is in your résumé? The effects of multiple social categories in résumé screening",
        "authors": "Luisa Helena Pinto, Rita Portugal, Patricia Viana",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "PurposeNumerous studies have shown that minority workers are disadvantaged in the labour market due to stereotypes and discrimination. However, published research on résumé screening has overlooked the effects of multiple social categorisations pertaining to candidates' gender, education and origin. This study addresses this gap and examines whether the gender, the level of education and the national origin cues mentioned in the résumé affect the perceived employability of candidates.Design/methodology/approachThis study employs an experimental between-subjects factorial design in that 12 résumés varying in gender, education and national origin were rated by 373 Portuguese working adults.FindingsThe results documented a gender premium as women were favoured in interpersonal and job skills but not in job suitability, and an education premium, since higher educated candidates were preferred despite their gender and origin. No meaningful interactions for gender × education × national origin were observed, which suggests that ingroup favouritism and outgroup discrimination in résumé screening can be averted.Originality/valueThe findings endorse a multidimensional view of perceived employability by investigating candidates' skills and job suitability from the viewpoint of the decision-makers, which extends our understanding of résumé-screening discrimination. This is critical to prevent hiring discrimination at an earlier career stage, which can increase youth employment and enhance the integration in the labour market of local minorities such as women, inexperienced workers and second-generation immigrants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/pr-04-2023-0290"
    },
    {
        "id": 26126,
        "title": "Extracting and classifying exceptional <scp>COVID‐19</scp> measures from multilingual legal texts: The merits and limitations of automated approaches",
        "authors": "Clara Egger, Tommaso Caselli, Georgios Tziafas, Eugénie de Saint Phalle, Wietse de Vries",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "AbstractThis paper contributes to ongoing scholarly debates on the merits and limitations of computational legal text analysis by reflecting on the results of a research project documenting exceptional COVID‐19 management measures in Europe. The variety of exceptional measures adopted in countries characterized by different legal systems and natural languages, as well as the rapid evolution of such measures, pose considerable challenges to manual textual analysis methods traditionally used in the social sciences. To address these challenges, we develop a supervised classifier to support the manual coding of exceptional policies by a multinational team of human coders. After presenting the results of various natural language processing (NLP) experiments, we show that human‐in‐the‐loop approaches to computational text analysis outperform unsupervised approaches in accurately extracting policy events from legal texts. We draw lessons from our experience to ensure the successful integration of NLP methods into social science research agendas.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/rego.12557"
    },
    {
        "id": 26127,
        "title": "RWD40 Assessing the Representativeness of Body Mass Index Categories Across Multiple Types of Secondary Data Sources",
        "authors": "L. Boulanger",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jval.2023.09.2758"
    },
    {
        "id": 26128,
        "title": "Method for classifying aspects of argumentation in Russian-language texts",
        "authors": "Татьяна Анатольевна Пескишева, Валерия Сергеевна Головизнина, Евгений Вячеславович Котельников, Ирина Николаевна Фищева",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "Автоматический анализ аргументации в текстах привлекает в последние\n        \tгоды внимание исследователей в связи с широким диапазоном приложений,\n        \tв частности, в анализе научных и юридических текстов, новостных статей,\n        \tполитических дебатов, студенческих эссе и социальных медиа. Новая задача\n        \tв этой области— анализ аргументации с учетом аспектов, где под аспектом\n        \tпонимается свойство объекта, относительно которого строится довод. Учет\n        \tаспектов позволяет уточнить направленность аргументации и понимание\n        \tаргументационной структуры, а также может быть использован для генерации\n        \tвысококачественных и специфичных для выбранных аспектов доводов.\nВ статье предлагается метод классификации аспектов аргументации\n        \tв текстах на русском языке, построение на его основе и исследование\n        \tмоделей классификации аспектов аргументации с использованием машинного\n        \tобучения и нейронных сетей. Впервые сформирован русскоязычный текстовый\n        \tкорпус, включающий 1426 предложений и размеченный по 16 аспектам\n        \tаргументации, построена нейросетевая языковая модель классификации\n        \tаргументов ArgBERT и обучены модели Random Forest для классификации\n        \tаспектов аргументации. Качество классификации на основе Random Forest\n        \tсоставляет в среднем F1=0,6373. Наилучшее качество разработанные модели\n        \tдемонстрируют для аспектов «Безопасность», «Влияние на здоровье»,\n        \t«Влияние на психику», «Отношение властей» и «Уровень жизни» (F1-мера\n        \tвыше 0,75).",
        "keywords": "",
        "link": "http://dx.doi.org/10.25209/2079-3316-2023-14-4-25-45"
    },
    {
        "id": 26129,
        "title": "A novel deep learning method for recognizing texts printed with multiple different printing methods",
        "authors": "Jarmo Koponen, Keijo Haataja, Pekka Toivanen",
        "published": "2023-4-20",
        "citations": 1,
        "abstract": "Background: Text recognition of cardboard pharmaceutical packages with machine vision is a challenging task due to the different curvatures of packaging surfaces and different printing methods. Methods: In this research, a novel deep learning method based on regions with convolutional neural networks (R-CNN) for recognizing binarized expiration dates and batch codes printed using different printing methods is proposed. The novel method recognizes the characters in the images without the need to extract handcrafted features. In detail, this approach performs text recognition considering the whole image as an input extracting and learning salient character features straight from packaging surface images. Results: The expiration date and manufacturing batch codes of a real-life pharmaceutical packaging image set are recognized with 91.1% precision with a novel deep learning-based model, while Tesseract OCR text recognition performance with the same image set is 38.3%. The novel model outperformed Tesseract OCR also in tests evaluating recall, accuracy, and F-Measure performance. Furthermore, the novel model was evaluated in terms of multi-object recognition accuracy and the number of unrecognized characters, in order to achieve performance values comparable to existing multi-object recognition methods. Conclusions: The results of this study reveal that the novel deep learning method outperforms the well-established optical character recognition method in recognizing texts printed using different printing methods. The novel method presented in the study recognizes texts printed with different printing methods with high precision. The novel deep learning method is suitable for recognizing texts printed on curved surfaces with proper preprocessing. The problem investigated in the study differs from previous research in the field, focusing on the recognition of texts printed with different printing methods. The research thus fills a gap in text recognition that existed in the research of the field. Furthermore, the study presents new ideas that will be utilized in our future research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12688/f1000research.131775.1"
    },
    {
        "id": 26130,
        "title": "Examining students’ help-seeking when learning from multiple texts",
        "authors": "Hye Yeon Lee, Alexandra List",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cedpsych.2023.102232"
    },
    {
        "id": 26131,
        "title": "APPLICATION OF MULTIPLE MACHINE LEARNING TECHNIQUES IN CLASSIFYING OBESITY LEVEL USING MULTIVARIATE DATASET",
        "authors": "Kenneth Dynielle Lawas,  ",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "People's health is important. It must be preserved. There are a variety of issues that might contribute to a person's health, including their lifestyle. One of the most prominent concerns during this pandemic is a person's body weight, which is particularly significant these days. Obesity is one of those body diseases about which it is important to be aware of the reasons. This study intends to create different machine learning models to define what causes obesity, select the most appropriate model that did the best, and discuss how accurate it performed. It can also be used in determining the how the obesity impact in our daily lives. Through the use of different machine learning models such as KNN, Random Forest, Gradient Boosting and Ada Boost, the study be able to obtain the appropriate model. Despite being trained on unbalanced data, the classifiers utilized were able to predict the properties of the presented datasets that Random Forest has an accuracy of 83.6%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26483/ijarcs.v14i5.7027"
    },
    {
        "id": 26132,
        "title": "Densely Connected Networks with Multiple Features for Classifying Sound Signals with Reverberation",
        "authors": "Zhuo Chen, Dazhi Gao, Kai Sun, Xiaojing Zhao, Yueqi Yu, Zhennan Wang",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "In indoor environments, reverberation can distort the signalseceived by active noise cancelation devices, posing a challenge to sound classification. Therefore, we combined three speech spectral features based on different frequency scales into a densely connected network (DenseNet) to accomplish sound classification with reverberation effects. We adopted the DenseNet structure to make the model lightweight A dataset was created based on experimental and simulation methods, andhe classification goal was to distinguish between music signals, song signals, and speech signals. Using this framework, effectivexperiments were conducted. It was shown that the classification accuracy of the approach based on DenseNet and fused features reached 95.90%, betterhan the results based on other convolutional neural networks (CNNs). The size of the optimized DenseNet model is only 3.09 MB, which is only 7.76% of the size before optimization. We migrated the model to the Android platform. The modified model can discriminate sound clips faster on Android thanhe network before the modification. This shows that the approach based on DenseNet and fused features can dealith sound classification tasks in different indoor scenes, and the lightweight model can be deployed on embedded devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23167225"
    },
    {
        "id": 26133,
        "title": "Multiple Channels Model Based on Mel Spectrogram for Classifying Abnormalities in Lung Sound",
        "authors": "Pham Thi Viet Huong, Le Duc Thinh, Phung Van Kien, Tran Anh Vu",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "Lung sound analysis plays an important role in the assessment and diagnosis of respiratory conditions and diseases. It can provide valuable information about the functioning of the respiratory system, including the airways, lungs, and associated structures. By analyzing the characteristics of lung sounds, healthcare professionals can gain insights into the presence of abnormalities, such as airway obstructions, lung diseases, and respiratory infections. In this paper, a multiple channel model for processing and classifying abnormalities in lung sound is proposed, which utilize the characteristics of Mel spectrogram and the Empirical Mode Decomposition (EMD). Unlike previous research which directly convert the lung sound into scalogram or spectrogram, the pre-processing of the original audio signal is considered and focused in this paper. This pre-processing step includes denoising, resampling, padding and augmentation, which incredibly increase the quality of the input signal. Finally, the multiple channel is put into the VGG16 deep learning model to classify the abnormalities in lung sound, including wheezes, crackles, and both. The model is trained and tested on the benchmark ICBHI dataset. The proposed model has shown better performance when compared with the state-of-the-art researches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4028/p-21pucq"
    },
    {
        "id": 26134,
        "title": "Critical Reading of Informational Texts (CRIT) Scaffold: Evaluating the efficacy of an instructional scaffold for reading multiple scientific texts",
        "authors": "Vanessa W. Vongkulluksn, Christina Nishiyama, Monica Ceja Rodriguez, E. Michael Nussbaum",
        "published": "2023-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cedpsych.2023.102229"
    },
    {
        "id": 26135,
        "title": "Retrieval-induced forgetting of spatial position depends on access to multiple shared features within categories",
        "authors": "Shaohang Liu, Josie Briscoe, Christopher Kent",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractRetrieval-induced forgetting (RIF) is typically observed in verbal memory tasks, although a few studies have observed RIF in visual spatial tasks. This leaves an open question as to whether RIF depends on semantic identity to link across semantic properties of objects, or whether RIF depends on access to the perceptual features of objects. To explore RIF of spatial positions, we report three experiments utilizing a continuous measure of the accessibility and precision for objects that were distinguished by their shape, color, and spatial region. After a study phase, half of the objects in a single-color category were selectively practiced for their spatial position, by requiring the object to be placed in the exact spatial position seen previously. Finally, all objects were probed for their spatial position at test. No RIF occurred for objects that shared only one color feature but were located within the same spatial region (in Experiment 1) or when objects shared the same color, but were located within different spatial regions (in Experiment 3). However, RIF did occur when objects shared the same spatial region and the same color (Experiment 2). Overall, the interim recall of the spatial positions of cue-objects impairs access to the position of other cue-objects within the same color category, but only when these groups had sufficient overlapping and competing features. The finding that RIF only occurs to the accessibility of spatial positions, not the precision of visual spatial memory, was interpreted as consistent with inhibitory theories of forgetting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3758/s13421-022-01384-1"
    },
    {
        "id": 26136,
        "title": "Optimal Model for Classifying Texts by Functional Style",
        "authors": "Dinara KAIBASSOVA,  , Alla OLEINIKOVA, Balzhan MAKHANOVA,  ,  ",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Nowadays natural language processing is evolving due to significant improvements in data access and increased computing power, especially in areas such as healthcare, media, finance and human resources. The purpose of this article is to study the methods of intellectual analysis of texts in determining the style of texts and to create an optimal model. The sources of text data used to determine the style of texts are considered. The body of the text is fully processed and experiments are carried out using the necessary methods. K-neighbors and BERT models were used for text classification",
        "keywords": "",
        "link": "http://dx.doi.org/10.52209/1609-1825_2023_1_365"
    },
    {
        "id": 26137,
        "title": "Classifying Free Texts Into Predefined Sections Using AI in Regulatory Documents: A Case Study with Drug Labeling Documents",
        "authors": "Magnus Gray, Joshua Xu, Weida Tong, Leihong Wu",
        "published": "2023-8-21",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.chemrestox.3c00028"
    },
    {
        "id": 26138,
        "title": "Content and quantity of highlights and annotations predict learning from multiple digital texts",
        "authors": "Alexandra List, Chang-Jen Lin",
        "published": "2023-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compedu.2023.104791"
    },
    {
        "id": 26139,
        "title": "Classifying Words with 3-sort Automata",
        "authors": "Tomasz Jastrząb, Frédéric Lardeux, Éric Monfroy",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012454100003636"
    },
    {
        "id": 26140,
        "title": "A UNIFIED PARADIGM OF CLASSIFYING GI TRACT DISEASES IN ENDOSCOPY IMAGES USING MULTIPLE FEATURES FUSION",
        "authors": "Muhammad Afraz,  , Abdul Haseeb, Abdul Muiz Fayyaz",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "The automatic identification of Gastrointestinal (GI) tract diseases in endoscopy images has been associated with the domain of medical imaging and computer vision. Its classification has various challenges, including color, low contrast, lesion shape, and complex background. A Deep features-based method for the classification of gastrointestinal disease is implemented in this article. The method suggested involves four significant steps: preprocessing, extraction of handcrafted, and deep Convolutional neural network features (Deep CNN), selection of solid features, fusion, and classification. 3D-Median filtering in the preprocessing stage increases the lesion contrast. The second stage extracts the features centered on the shape. The extracted features are of three types: HOG features, ResNet50, and Xception. Principal Component Analysis (PCA) is chosen to select extracted features, combined by concatenating them in a single array. A support vector system eventually categorizes fused features into multiple classes. The Kvasir dataset is used for the proposed model. The SVM has outstanding efficiency reached 96.6 percent, showing the proposed system's robustness",
        "keywords": "",
        "link": "http://dx.doi.org/10.32010/26166127.2023.6.1.49.76"
    },
    {
        "id": 26141,
        "title": "Relative cluster categories and Higgs categories",
        "authors": "Yilin Wu",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aim.2023.109040"
    },
    {
        "id": 26142,
        "title": "Triangulated categories of periodic complexes and orbit categories",
        "authors": "Jian Liu",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21136/cmj.2023.0234-22"
    },
    {
        "id": 26143,
        "title": "Up with Categories, Down with Sets; Out with Categories, In with Sets!",
        "authors": "Jonathan Kirby",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "Abstract\nPractical approaches to the notions of subsets and extension sets are compared, coming from broadly set-theoretic and category-theoretic traditions of mathematics. I argue that the set-theoretic approach is the most practical for ‘looking down’ or ‘in’ at subsets and the category-theoretic approach is the most practical for ‘looking up’ or ‘out’ at extensions, and suggest some guiding principles for using these approaches without recourse to either category theory or axiomatic set theory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/philmat/nkae010"
    },
    {
        "id": 26144,
        "title": "Social justice reasoning when students learn about social issues using multiple texts",
        "authors": "Alexandra List",
        "published": "2023-5-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0163853x.2023.2197692"
    },
    {
        "id": 26145,
        "title": "A new method for classifying maize by combining the phenological information of multiple satellite-based spectral bands",
        "authors": "Qiongyan Peng, Ruoque Shen, Jie Dong, Wei Han, Jianxi Huang, Tao Ye, Wenzhi Zhao, Wenping Yuan",
        "published": "2023-1-4",
        "citations": 2,
        "abstract": "Introduction: Using satellite data to identify the planting area of summer crops is difficult because of their similar phenological characteristics.Methods: This study developed a new method for differentiating maize from other summer crops based on the revised time-weighted dynamic time warping (TWDTW) method, a phenology-based classification method, by combining the phenological information of multiple spectral bands and indexes instead of one single index. First, we compared the phenological characteristics of four main summer crops in Henan Province of China in terms of multiple spectral bands and indexes. The key phenological periods of each band and index were determined by comparing the identification accuracy based on the county-level statistical areas of maize. Second, we improved the TWDTW distance calculation for multiple bands and indexes by summing the rank maps of a single band or index. Third, we evaluated the performance of a multi-band and multi-period TWDTW method using Sentinel-2 time series of all spectral bands and some synthetic indexes for maize classification in Henan Province.Results and Discussion: The results showed that the combination of red edge (740.2 nm) and short-wave infrared (2202.4 nm) outperformed all others and its overall accuracy of maize planting area was about 91.77% based on 2431 field samples. At the county level, the planting area of maize matched the statistical area closely. The results of this study demonstrate that the revised TWDTW makes effective use of crop phenological information and improves the extraction accuracy of summer crops’ planting areas over a large scale. Additionally, multiple band combinations are more effective for summer crops mapping than a single band or index input.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fenvs.2022.1089007"
    },
    {
        "id": 26146,
        "title": "Classifying Electrical Faults in a Distribution System Using K-Nearest Neighbor (KNN) Model in Presence of Multiple Distributed Generators",
        "authors": "Saurabh Awasthi, Gagan Singh, Nafees Ahamad",
        "published": "2024-2-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40031-024-00994-4"
    },
    {
        "id": 26147,
        "title": "A robust primary liver cancer subtype related to prognosis and drug response based on a multiple combined classifying strategy",
        "authors": "Jielian Deng, Guichuan Lai, Cong Zhang, Kangjie Li, Wenyan Zhu, Biao Xie, Xiaoni Zhong",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e25570"
    },
    {
        "id": 26148,
        "title": "Classifying Intelligence Tests Patterns Using Machine Learning Methods",
        "authors": "Georgios Liapis, Loukritira Stefanou, Ioannis Vlahavas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011606500003411"
    },
    {
        "id": 26149,
        "title": "An equivalence between enriched ∞-categories and ∞-categories with weak action",
        "authors": "Hadrian Heine",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aim.2023.108941"
    },
    {
        "id": 26150,
        "title": "Formal balls of Q-categories",
        "authors": "Xianbo Yang, Dexue Zhang",
        "published": "2023-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52547/cgasa.2022.102914"
    },
    {
        "id": 26151,
        "title": "Examination of the performance of ASEL and MPViT algorithms for classifying mangrove species of multiple natural reserves of Beibu Gulf, south China",
        "authors": "Bolin Fu, Xu He, Yiyin Liang, Tengfang Deng, Huajian Li, Hongchang He, Mingming Jia, Donglin Fan, Feng Wang",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecolind.2023.110870"
    },
    {
        "id": 26152,
        "title": "Multiple Interpretation and Fragmented Texts Within a Historical Corpus: The Case of Old East Slavic Vernacular Writing",
        "authors": "Dmitri Sitchinava",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Abstract\nThe paper presents the issue of fragmented and/or ambiguously interpreted texts within the corpora of Old East Slavic vernacular writing. One of these corpora, the corpus of the Old East Slavic birchbark letters, is already available, the other, comprising the texts of Old East Slavic inscriptions, is under preparation. Due to the fragmentary state of many birchbark and epigraphy texts, their lemmatization and grammatical tagging may be uncertain and multiple interpretations may coexist. Some lemmas survive only in fragments which are nevertheless relevant for the study of lexicon. The grammatical status of many fragments may be firmly established despite lacking lexical information. However the relevant data on these fragments is not available in the word indices and corpora that take into consideration only best-preserved word forms. In the paper, the representation and annotation of such word forms within the Old East Slavic vernacular corpora is presented, and relative frequencies of such phenomena within the birchbark letter corpus are shown, with some case studies showing the relevance of the annotation of fragmented forms. The existing approaches, namely for the classical epigraphy within the EpiDoc standard and in the Hittite syntactic treebanks, are also briefly presented and compared to the solution found within the Old East Slavic vernacular corpora.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/jazcas-2023-0044"
    },
    {
        "id": 26153,
        "title": "JACK OF ALL TRADES, MASTER OF EVERYTHING? COMPETING ROUTES OF CONSUMER RESPONSES TOWARD MULTIPLE PRODUCT CATEGORIES ENDORSEMENT OF FASHION INFLUENCERS",
        "authors": "Bayu Aji Aritejo,  , Widya Paramita, Sahid Susilo Nugroho",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15444/gmc2023.12.09.01"
    },
    {
        "id": 26154,
        "title": "Contamination in mangrove ecosystems: A synthesis of literature reviews across multiple contaminant categories",
        "authors": "Geoffrey T. Szafranski, Elise F. Granek",
        "published": "2023-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.marpolbul.2023.115595"
    },
    {
        "id": 26155,
        "title": "Jack of all trades, master of everything? Competing routes of consumer responses toward multiple product categories endorsements by fashion influencers",
        "authors": "Bayu Aji Aritejo, Widya Paramita, Sahid Susilo Nugroho",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/20932685.2023.2257719"
    },
    {
        "id": 26156,
        "title": "Deep Hybrid Bagging Ensembles for Classifying Histopathological Breast Cancer Images",
        "authors": "Fatima-Zahrae Nakach, Ali Idri, Hasnae Zerouaoui",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011704200003393"
    },
    {
        "id": 26157,
        "title": "Fuzzy Logic System for Classifying Multiple Sclerosis Patients as High, Medium, or Low Responders to Interferon-Beta",
        "authors": "Edgar Rafael Ponce de Leon-Sanchez, Jorge Domingo Mendiola-Santibañez, Omar Arturo Dominguez-Ramirez, Ana Marcela Herrera-Navarro, Alberto Vazquez-Cervantes, Hugo Jimenez-Hernandez, Horacio Senties-Madrid",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "Interferon-beta is one of the most widely prescribed disease-modifying therapies for multiple sclerosis patients. However, this treatment is only partially effective, and a significant proportion of patients do not respond to this drug. This paper proposes an alternative fuzzy logic system, based on the opinion of a neurology expert, to classify relapsing–remitting multiple sclerosis patients as high, medium, or low responders to interferon-beta. Also, a pipeline prediction model trained with biomarkers associated with interferon-beta responses is proposed, for predicting whether patients are potential candidates to be treated with this drug, in order to avoid ineffective therapies. The classification results showed that the fuzzy system presented 100% efficiency, compared to an unsupervised hierarchical clustering method (52%). So, the performance of the prediction model was evaluated, and 0.8 testing accuracy was achieved. Hence, a pipeline model, including data standardization, data compression, and a learning algorithm, could be a useful tool for getting reliable predictions about responses to interferon-beta.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/technologies11040109"
    },
    {
        "id": 26158,
        "title": "But We Will Not Give Up the Categories! (De)valuing the Categories in South Asian Performance Traditions",
        "authors": "Brahma Prakash",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Interdisciplinary and cross-disciplinary approaches and practices are increasingly celebrated in a larger field of Theatre and Performance studies. However, the existing categories and divisions that are typically valued in Indian and South Asian contexts are often seen as sacrosanct divisions that inform artistic practices and institutional policies, such as the division based on dance, music, and theatre.  Most of these categories and divisions are based on the Western discourses on theatre and performance practices, and in most cases, the artistic practices and cultural performances in India do not maintain such rigid boundaries between song, dance, music, or ritual and theatre. This essay offers a critique of categories and divisions existing in the encompassing field of theatre and performance studies in India. It is argued that these divisions not only create hierarchies of genre but also exclude the communities whose performance practices do not ascribe to the similar divisions and categories. They continue to perpetuate hierarchical values in terms of aesthetic and cultural taste. I argue that devaluing these categories would be a step further to a radical decolonization of the field of study. The essay also asks why decolonial discourses have informed diasporic South Asian scholarship, but have not had a similar appeal in their home countries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33303/gpsv5n1-2a112"
    },
    {
        "id": 26159,
        "title": "Entity Linking Method for Chinese Short Texts with Multiple Embedded Representations",
        "authors": "Yongqi Shi, Ruopeng Yang, Changsheng Yin, Yiwei Lu, Yuantao Yang, Yu Tao",
        "published": "2023-6-15",
        "citations": 2,
        "abstract": "Entity linking, a crucial task in the realm of natural language processing, aims to link entity mentions in a text to their corresponding entities in the knowledge base. While long documents provide abundant contextual information, facilitating feature extraction for entity identification and disambiguation, entity linking in Chinese short texts presents significant challenges. This study introduces an innovative approach to entity linking within Chinese short texts, combining multiple embedding representations. It integrates embedding representations from both entities and relations in the knowledge graph triples, as well as embedding representations from the descriptive text of entities and relations, to enhance the performance of entity linking. The method also incorporates external semantic supplements to strengthen the model’s feature learning capabilities. The Multi-Embedding Representation–Bidirectional Encoder Representation from Transformers–Bidirectional Gated Recurrent Unit (MER-BERT-BiGRU) neural network model is employed for embedding learning. The precision, recall, and F1 scores reached 89.73%, 92.18%, and 90.94% respectively, demonstrating the effectiveness of our approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12122692"
    },
    {
        "id": 26160,
        "title": "Multiple bin-size bin packing problem considering incompatible product categories",
        "authors": "Yu-Chung Tsao, Jo-Ying Tai, Thuy-Linh Vu, Tsung-Hui Chen",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123340"
    },
    {
        "id": 26161,
        "title": "To Clarity and Beyond: Situating Higher-Order, Critical, and Critical-Analytic Thinking in the Literature on Learning from Multiple Texts",
        "authors": "Alexandra List, Yuting Sun",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10648-023-09756-y"
    },
    {
        "id": 26162,
        "title": "DEFINITION OF MARKOV NETWORKS FROM THE POSITION OF THE THEORIES OF CATEGORIES AND N-CATEGORIES",
        "authors": "V. A. Konovalov",
        "published": "2023-8",
        "citations": 0,
        "abstract": "The study develops new provisions of the theory of Markov algorithms. The area of use of the N-scheme of the Markov algorithm, developed to replace its wellknown y-scheme, is being expanded. The study solves the scientific problem of developing the Markov algorithm in the direction of processing not only words, but also morphisms. Such a problem has not been posed or solved before in the theory of Markov algorithms. Morphisms that differ from each other by types, where some are numeric and others are categorical, are proposed to be processed together. In the study of methods for processing morphisms in the Markov algorithm, it is proposed to use the wellknown in science and practice idea of weighing numerical morphisms. The very idea of weighting morphisms is considered more broadly as a task for the synthesis of a Markov network from separate components, such as an N-schema Markov algorithm for a single data source and a Markov system for many sources of big data. Markov networks are introduced into scientific circulation using the methodology adopted for artificial neural networks. This approach allows us to reduce the time for comprehending the main theoretical provisions of Markov networks, in comparison with artificial neural networks. The same technique is used to classify diagrams of Markov occurrences of words in each other, which are the basis for the synthesis of Markov networks. Approaches to weighting the values of morphisms in Markov networks do not fundamentally differ from those used in artificial neural networks. Diagrams of Markov occurrences are considered from category-theoretic positions, where words are assumed to be associated categories, otherwise, n-categories. For Markov networks, theoretical considerations are given on the activation of their elements by a secret morphism. The use of category-theoretic positions in Markov networks allows us to say that these networks are also activated by all associators used in the N-scheme of the Markov algorithm, as well as by the control channel, which is also an associator. At the same time, associators are considered as n-category objects, which distinguishes Markov networks from artificial neural networks. An N-scheme of the Markov algorithm and a Markov system with weight coefficients and thresholds for weighting the values of morphisms are synthesized. It is concluded that Markov networks provide joint processing of words and morphisms, and it is in the network that additional methods of processing morphisms are implemented that were not previously taken into account in the theory of Markov algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14489/vkit.2023.08.pp.034-044"
    },
    {
        "id": 26163,
        "title": "Free gs-Monoidal Categories and Free Markov Categories",
        "authors": "Tobias Fritz, Wendong Liang",
        "published": "2023-4",
        "citations": 5,
        "abstract": "AbstractCategorical probability has recently seen significant advances through the formalism of Markov categories, within which several classical theorems have been proven in entirely abstract categorical terms. Closely related to Markov categories are gs-monoidal categories, also known as CD categories. These omit a condition that implements the normalization of probability. Extending work of Corradini and Gadducci, we construct free gs-monoidal and free Markov categories generated by a collection of morphisms of arbitrary arity and coarity. For free gs-monoidal categories, this comes in the form of an explicit combinatorial description of their morphisms as structured cospans of labeled hypergraphs. These can be thought of as a formalization of gs-monoidal string diagrams ($$=$$\n=\nterm graphs) as a combinatorial data structure. We formulate the appropriate 2-categorical universal property based on ideas of Walters and prove that our categories satisfy it. We expect our free categories to be relevant for computer implementations and we also argue that they can be used as statistical causal models generalizing Bayesian networks.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10485-023-09717-0"
    },
    {
        "id": 26164,
        "title": "Homological Transfer between Additive Categories and Higher Differential Additive Categories",
        "authors": "Xi Tang, Zhao Yong Huang",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10114-023-2193-8"
    },
    {
        "id": 26165,
        "title": "Using rhetorical devices to improve integration in writing based on multiple texts",
        "authors": "Eunseo Lee, Alexandra List, Gala Sofia Campos Oaxaca, Hye Yeon Lee, Hongcui Du",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10212-023-00778-2"
    },
    {
        "id": 26166,
        "title": "Investigating the role of prior knowledge in comprehending intratextual and intertextual relationships when reading multiple texts",
        "authors": "Burcu Demir, Ymkje E. Haverkamp, Jason L.G. Braasch, Ivar Bråten",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.lindif.2024.102442"
    },
    {
        "id": 26167,
        "title": "Realising perfect derived categories of Auslander algebras of type $\\mathbb{A}$ as Fukaya–Seidel categories",
        "authors": "Ilaria Di Dedda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4310/jsg.2023.v21.n2.a4"
    },
    {
        "id": 26168,
        "title": "Triangular matrix categories over quasi-hereditary categories",
        "authors": "Rafael Francisco Ochoa De La Cruz, Martin Ortíz Morales, Valente Santiago Vargas",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "Abstract\nIn this paper, we prove that the lower triangular matrix category \n\n\n\n$\\Lambda =\\left [ \\begin{smallmatrix} \\mathcal{T}&0\\\\ M&\\mathcal{U} \\end{smallmatrix} \\right ]$\n\n\n, where \n\n\n\n$\\mathcal{T}$\n\n\n and \n\n\n\n$\\mathcal{U}$\n\n\n are \n\n\n\n$\\textrm{Hom}$\n\n\n-finite, Krull–Schmidt \n\n\n\n$K$\n\n\n-quasi-hereditary categories and \n\n\n\n$M$\n\n\n is an \n\n\n\n$\\mathcal{U}\\otimes _K \\mathcal{T}^{op}$\n\n\n-module that satisfies suitable conditions, is quasi-hereditary. This result generalizes the work of B. Zhu in his study on triangular matrix algebras over quasi-hereditary algebras. Moreover, we obtain a characterization of the category of the \n\n\n\n$_\\Lambda \\Delta$\n\n\n-filtered \n\n\n\n$\\Lambda$\n\n\n-modules.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s0017089524000053"
    },
    {
        "id": 26169,
        "title": "Educational Inequalities at the Intersection of Multiple Social Categories: A﻿n Introduction and Systematic Review of the Multilevel Analysis of Individual Heterogeneity and Discriminatory Accuracy (MAIHDA) Approach",
        "authors": "Lena Keller, Oliver Lüdtke, Franzis Preckel, Martin Brunner",
        "published": "2023-3",
        "citations": 9,
        "abstract": "AbstractIntersectional approaches have become increasingly important for explaining educational inequalities because they help to improve our understanding of how individual experiences are shaped by simultaneous membership in multiple social categories that are associated with interconnected systems of power, privilege, and oppression. For years, there has been a call in psychological and educational research for quantitative approaches that can account for the intersection of multiple social categories. The present paper introduces the Multilevel Analysis of Individual Heterogeneity and Discriminatory Accuracy (MAIHDA) approach, a novel intersectional approach from epidemiology, to study educational inequalities. The MAIHDA approach uses a multilevel model as the statistical framework to define intersectional strata that represent individuals’ membership in multiple social categories. By partitioning the variance within and between intersectional strata, the MAIHDA approach allows identifying intersectional effects at the strata level as well as obtaining information on the discriminatory accuracy of these strata for predicting individual educational outcomes. Compared to conventional quantitative intersectional approaches, MAIHDA analyses have several advantages, including better scalability for higher dimensions, model parsimony, and precision-weighted estimates of strata with small sample sizes. We provide a systematic review of its past application and illustrate its use by analyzing inequalities in reading achievement across 40 unique intersectional strata (combining the social categories of gender, immigrant background, parental education, and parental occupational status) using data from 15-year-old students in Germany (N = 5451). We conclude that the MAIHDA approach is a valuable intersectional tool to study inequalities in educational contexts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10648-023-09733-5"
    },
    {
        "id": 26170,
        "title": "Ml Techniques: Classifying Dangerous Asteroids",
        "authors": "Seyed matin Malakouti",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4328181"
    },
    {
        "id": 26171,
        "title": "Classifying Indo-Pacific finless porpoise echolocation clicks",
        "authors": "Maura Shapiro",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "Better understanding of the porpoise echolocation clicks enables passive acoustic monitoring for the threatened species.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/10.0017938"
    },
    {
        "id": 26172,
        "title": "Coexistence of Multiple Writing Systems: Classifying Digraphia in Post-Socialist Countries",
        "authors": "Youngjoo Jung, Bora Kim",
        "published": "2023-8",
        "citations": 0,
        "abstract": "This study aims to specify the definitions of two terms, bigraphia and digraphia, and examine how these phenomena appear in post-socialist countries. It is currently a global phenomenon to use two or more writing systems in one country, due to the spread of English and the Internet. Bigraphia means when the function and prestige of two writing systems (or two varieties of one system) are equal. On the other hand, when there is a difference in the function and/or prestige between two writing systems, it is defined as digraphia. The paper examines the combination of writing systems in post-socialist countries such as Russia, Belarus, Serbia, and Uzbekistan. In-digraphia refers to a situation in which variations of one writing system coexist, and out-digraphia refers to a situation in which two different writing systems coexist. A narrower sense of digraphia is observed in Belarus today: Belarusian Cyrillic-Т(BC-T) is used to write Tarashkievitsa and Belarusian Cyrillic-N (BC-N) is used to write Narkamaŭka. Out-digraphia is observed in Serbia and Uzbekistan. In these countries, Cyrillic and Latin scripts are used to write Serbian and Uzbek. Out-digraphia is also confirmed in Russian texts: It is commonly thought that only Cyrillic letters are used to write Russian, but recently the use of the so-called “macaronic alphabet,” which is a mix of Cyrillic and Latin letters, has become common.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/18793665231188380"
    },
    {
        "id": 26173,
        "title": "n-exact Categories Arising from n-exangulated Categories",
        "authors": "Jian He, Pan Yue Zhou",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10114-023-1558-3"
    },
    {
        "id": 26174,
        "title": "A study on multiple texts usage patterns ofKorean language learners for academic purposes",
        "authors": "Mi-kyung Chang, Yoo-kyoung Lee",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15711/wr.78.0.15"
    },
    {
        "id": 26175,
        "title": "LIDL4Oliv: A Lightweight Incremental Deep Learning Model for Classifying Olive Diseases in Images",
        "authors": "Emna Guermazi, Afef Mdhaffar, Mohamed Jmaiel, Bernd Freisleben",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012466900003636"
    },
    {
        "id": 26176,
        "title": "Detecting and Classifying Inappropriate Content in Youtube Videos Using Deep Learning Approach",
        "authors": "Sanaboina Chandra Sekhar, Yandamuri Eswara Anil",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/mr23914100015"
    },
    {
        "id": 26177,
        "title": "Classifying Soccer Ball-on-Goal Position Through Kicker Shooting Action",
        "authors": "Javier Artiles, Daniel Hernández-Sosa, Oliverio Santana, Javier Lorenzo-Navarro, David Freire-Obregón",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012417100003654"
    },
    {
        "id": 26178,
        "title": "Exploring BERT for Predicting Vulnerability Categories in Device Configurations",
        "authors": "Dmitry Levshun, Dmitry Vesnin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012471800003648"
    },
    {
        "id": 26179,
        "title": "Use of intraoperative platelet-rich plasma during rotator cuff repair is correlated with increased patient-level charges across multiple categories",
        "authors": "Brandon M. Tauberg, Jacob C. Su, Ryan J. Warth, James M. Gregory",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jse.2023.01.031"
    },
    {
        "id": 26180,
        "title": "On Classifying Continuous Constraint Satisfaction Problems",
        "authors": "Tillmann Miltzow, Reinier F. Schmiermann",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "A continuous constraint satisfaction problem (CCSP) is a constraint\nsatisfaction problem (CSP) with an interval domain $U \\subset \\mathbb{R}$. We\nengage in a systematic study to classify CCSPs that are complete of the\nExistential Theory of the Reals, i.e., ER-complete. To define this class, we\nfirst consider the problem ETR, which also stands for Existential Theory of the\nReals. In an instance of this problem we are given some sentence of the form\n$\\exists x_1, \\ldots, x_n \\in \\mathbb{R} : \\Phi(x_1, \\ldots, x_n)$, where\n$\\Phi$ is a well-formed quantifier-free formula consisting of the symbols $\\{0,\n1, +, \\cdot, \\geq, >, \\wedge, \\vee, \\neg\\}$, the goal is to check whether this\nsentence is true. Now the class ER is the family of all problems that admit a\npolynomial-time many-one reduction to ETR. It is known that NP $\\subseteq$ ER\n$\\subseteq$ PSPACE.\n  We restrict our attention on CCSPs with addition constraints ($x + y = z$)\nand some other mild technical conditions. Previously, it was shown that\nmultiplication constraints ($x \\cdot y = z$), squaring constraints ($x^2 = y$),\nor inversion constraints ($x\\cdot y = 1$) are sufficient to establish\nER-completeness. We extend this in the strongest possible sense for equality\nconstraints as follows. We show that CCSPs (with addition constraints and some\nother mild technical conditions) that have any one well-behaved curved equality\nconstraint ($f(x,y) = 0$) are ER-complete. We further extend our results to\ninequality constraints. We show that any well-behaved convexly curved and any\nwell-behaved concavely curved inequality constraint ($f(x,y) \\geq 0$ and\n$g(x,y) \\geq 0$) imply ER-completeness on the class of such CCSPs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46298/theoretics.24.10"
    },
    {
        "id": 26181,
        "title": "CULTURAL HERITAGE OF THE\nEUROPEAN UNION: DEFINITION AND\n\nCATEGORIES",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30546/2218-9130.01.351.2024.132"
    },
    {
        "id": 26182,
        "title": "Spectral and temporal implementation of Japanese speakers’ English vowel categories: A corpus-based study",
        "authors": "Kakeru Yazawa, Takayuki Konishi, James Whang, Paola Escudero, Mariko Kondo",
        "published": "2023-3-20",
        "citations": 2,
        "abstract": "This study investigates the predictions of second language (L2) acquisition models — SLM, PAM-L2, and L2LP — on how native (L1) Japanese speakers implement the spectral and temporal aspects of L2 American English vowel categories. Data were obtained from 102 L1 Japanese speakers in the J-AESOP corpus, which also includes nativelikeness judgments by trained phoneticians. Spectrally, speakers judged to be less nativelike showed a strong influence of L1-L2 category assimilation, except L2 /æː/ whose dissimilarity from L1 categories likely triggered new category formation, in accordance with SLM and PAM-L2. However, more nativelike speakers showed vowel spectra similar to those of native English speakers for all vowels, which aligns better with L2LP. Temporally, although speakers tended to assimilate the phonetic length of English vowels to Japanese phonemic length distinctions, segment-level L1-L2 category similarity was not a significant predictor of the speakers’ nativelikeness. Instead, implementation of prosodic-level factors such as stress and phrase-final lengthening were better predictors. The results highlight the importance of suprasegmental factors in successful L2 category learning and also reveal a weakness in current models of L2 acquisition, which focus primarily on the segmental level. The use of speech corpora for L2 research is discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.16995/labphon.6427"
    },
    {
        "id": 26183,
        "title": "Classifying Message Application Using Kotlin",
        "authors": "",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Over the past few years, short message service (SMS) usage has significantly increased. This service is used to deliver text messages by billions of people. Service providers have launched a number of popular applications, including mobile banking, summons checkpoints, SMS chat, and others. This chapter explores the numerous SMS applications that are available to users and provides an outline of how this service is provided. We examine the causes of its success and the problems that need to be solved. We also look at upcoming trends and the difficulties that to improve this service, certain obstacles must be overcome. This chapter should help you understand how SMS applications work and what to expect from them going forwards given the improvements to current   SMS   and technological advancement. We propose a privacy-preserving Naive Bayes classifier and apply it to the problem of private text classification. In this setting, a party (Alice) holds a text message, while another party (Bob) holds a classifier. At the end of the protocol, Alice will only learn the result of the classifier applied to her text input and Bob learns nothing. Our solution is based on Secure Multiparty Computation (SMC). Our Rust implementation provides a fast and secure solution for the classification of unstructured text. Applying our solution to the case of spam detection (the solution is generic, and can be used in any other scenario in which the Naive Bayes classifier can be employed), we can classify an SMS as spam or ham in less than 340 ms in the case where the dictionary size of Bob’s model includes all words (n 5200) and Alice’s SMS has at most m 160 unigrams. In the case with n 369 and m 8 (the average of a spam SMS in the database), our solution takes only 21 ms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/daai/3/1/22"
    },
    {
        "id": 26184,
        "title": "Orality, Textuality, and the Homeric Epics: An Interdisciplinary Study of Oral Texts, Dictated Texts, and Wild Texts",
        "authors": " Frog",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5406/15351882.136.541.13"
    },
    {
        "id": 26185,
        "title": "Semantic Representation of Key Performance Indicators Categories for Prioritization",
        "authors": "Tarique Khan, Alex Mircoli, Domenico Potena, Claudia Diamantini",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011848700003467"
    },
    {
        "id": 26186,
        "title": "CNVVE: Dataset and Benchmark for Classifying Non-verbal Voice",
        "authors": "Ramin Hedeshy, Raphael Menges, Steffen Staab",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-201"
    },
    {
        "id": 26187,
        "title": "Categories of Wrong Beliefs—A Proposal",
        "authors": "Linda Brakel",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "Wrong beliefs, known by some as ‘alternative facts’, have proliferated lately in important areas of human life, including social, political, and public health domains. This can be and has been damaging. This brief article proposes an epistemological category classification of these wrong beliefs, with the following mappings: a) ‘No-Information’ marked by willful blindness produces ‘Empty Beliefs’; b) ‘Mis-Information’ yields ‘Mis(taken) Beliefs’; and c) ‘Dis-Information’ predicated on blatant distortions produces ‘Dis(torted) Beliefs’. This simple classification system, is perhaps epistemologically satisfying, and moreover could have positive policy implications.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/etxoil"
    },
    {
        "id": 26188,
        "title": "Attention2Minority: A salient instance inference-based multiple instance learning for classifying small lesions in whole slide images",
        "authors": "Ziyu Su, Mostafa Rezapour, Usama Sajjad, Metin Nafi Gurcan, Muhammad Khalid Khan Niazi",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.107607"
    },
    {
        "id": 26189,
        "title": "An Investigation of Deep-Learned Features for Classifying Radiographic Images of COVID-19",
        "authors": "Pedro Miguel, Adriano Cansian, Guilherme Rozendo, Giuliano Medalha, Marcelo Zanchetta do Nascimento, Leandro Neves",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012038500003467"
    },
    {
        "id": 26190,
        "title": "Classifying constructive comments",
        "authors": "Varada Kolhatkar, Nithum Thain, Jeffrey Sorensen, Lucas Dixon, Maite Taboada",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "We introduce the Constructive Comments Corpus (C3), comprised of 12,000 annotated news comments, intended to help build new tools for online communities to improve the quality of their discussions. We define constructive comments as high-quality comments that make a contribution to the conversation. We explain the crowd worker annotation scheme and de ne a taxonomy of subcharacteristics of constructiveness. The quality of the annotation scheme and the resulting dataset is evaluated using measurements of inter-annotator agreement, expert assessment of a sample, and by the constructiveness sub-characteristics, which we show provide a proxy for the general constructiveness concept. We provide models for constructiveness trained on C3 using both feature-based and a variety of deep learning approaches and demonstrate, through domain adaptation experiments, that these models capture general rather than topic- or domain-specific characteristics of constructiveness. We also examine the role that length plays in our models, as comment length could be easily gamed if models depend heavily upon this feature. By examining the errors made by each model and their distribution by length, we show that the best performing models are effective independently of comment length. The constructiveness corpus and our experiments pave the way for a moderation tool focused on promoting comments that make a meaningful contribution, rather than only filtering out undesirable content.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5210/fm.v28i4.13163"
    },
    {
        "id": 26191,
        "title": "A Comparative Study of Predicted Environmental Concentrations from ECETOC TRA Based on Environmental Release Categories/Specific Environmental Release Categories and K-CHESAR Using Main/Industrial/Use Categories",
        "authors": "Hyun Pyo Jeon, Jisu Yang, Hana Jo, Eun Kyung Choe, Sanghun Kim",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5668/jehs.2023.49.6.312"
    },
    {
        "id": 26192,
        "title": "Modular categories of Frobenius–Perron dimension p2q2r2 and perfect modular categories",
        "authors": "Dewei Zhou, Jingcheng Dong",
        "published": "2024-3",
        "citations": 0,
        "abstract": " We prove that modular categories of Frobenius–Perron dimension [Formula: see text] are solvable, where [Formula: see text] are prime numbers. As applications, we get that integral modular categories of Frobenius–Perron dimension less than [Formula: see text] are solvable, and hence integral perfect modular categories have Frobenius–Perron dimension greater than or equal to [Formula: see text]. When the modular categories considered are weakly group-theoretical, we further prove that integral perfect modular categories have Frobenius–Perron dimension greater than or equal to [Formula: see text]. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0129167x24500010"
    },
    {
        "id": 26193,
        "title": "Coherence within and across Categories: The Dynamic Viability of Product Categories on Kickstarter",
        "authors": "Jean-François Soublière, Jade Y. Lo, Eunice Y. Rhee",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5465/amj.2022.0105"
    },
    {
        "id": 26194,
        "title": "The categories of causation",
        "authors": "John Schwenkler",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11229-023-04409-7"
    },
    {
        "id": 26195,
        "title": "Filtered bicolimit presentations of locally presentable linear categories, Grothendieck categories and their tensor products",
        "authors": "Julia Ramos González",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2989/16073606.2024.2330717"
    },
    {
        "id": 26196,
        "title": "Castles Built on Sand: Observations from Classifying Academic Cybersecurity Datasets with Minimalist Methods",
        "authors": "Laurens D’hooge, Miel Verkerken, Tim Wauters, Filip De Turck, Bruno Volckaert",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011853300003482"
    },
    {
        "id": 26197,
        "title": "A COMPUTER CONTROLLED SYSTEM FOR ASSESSING AND CLASSIFYING NOISE INDUCED HEARING LOSS",
        "authors": "DS BROWN, TA GOODRICH",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25144/20903"
    },
    {
        "id": 26198,
        "title": "Categories of Wrong Beliefs—A Preliminary Proposal",
        "authors": "Linda Brakel",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Wrong beliefs, known by some as ‘alternative facts’, have proliferated lately in important areas of human life, including social, political, and public health domains. This can be and has been damaging. This brief article proposes an epistemological category classification of these wrong beliefs, with the following mappings: a) ‘No-Information’ marked by willful blindness produces ‘Empty Beliefs’; b) ‘Mis-Information’ yields ‘Mis(taken) Beliefs’; and c) ‘Dis-Information’ predicated on blatant distortions produces ‘Dis(torted) Beliefs’. This simple classification system, is perhaps epistemologically satisfying, and moreover could have positive policy implications.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/etxoil.2"
    },
    {
        "id": 26199,
        "title": "Approach for Classifying the Automatability of Verification and Validation Techniques",
        "authors": "Katharina Langenbach, Markus Rabe",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wsc60868.2023.10407984"
    },
    {
        "id": 26200,
        "title": "Active Learning for Classifying 2D Grid-Based Level Completability",
        "authors": "Mahsa Bazzaz, Seth Cooper",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cog57401.2023.10333212"
    },
    {
        "id": 26201,
        "title": "Categories of Wrong Beliefs—A Preliminary Proposal",
        "authors": "Linda Brakel",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "Wrong beliefs, known by some as ‘alternative facts’, have recently spread widely, causing damage in important areas of human life, including social, political, and public health domains. This article is a preliminary proposal consisting of two aspects. First, an analogy to biologic stigmergic effects is drawn. The claim is that social media products are the potent drivers of wrong belief proliferation rather than iterative individual person-to-person communications. Second, the article offers an epistemological category classification of wrong beliefs, with the following mappings: a) ‘No-Information’ marked by willful blindness results in ‘Empty Beliefs’; b) ‘Mis-Information’ yields ‘Mis(taken) Beliefs’; and c) ‘Dis-Information’ predicated on blatant distortions produces ‘Dis(torted) Beliefs’. This simple classification system is not merely epistemologically satisfying; it is functionally useful, providing a foundational definitional distinction between mis-information and dis-information—terms too often used interchangeably. To distinguish them will allow (even promote) basic research to go forth—for example by statistically tracking differential tendencies of malignant/distorted dis-information vs. mistaken/mis-information spread. Moreover, this sort of research could ultimately lead the way to positive policy implications.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/etxoil.3"
    },
    {
        "id": 26202,
        "title": "An analysis of multiple comparisons is conducted to account for correlations among various investigated variables across four categories of antipsychotics",
        "authors": " Maher A J. Alasasleh,  Raafat Hani Aburumman,  Arafat Khalaf Alzoubi,  Hala Abdel Hamid Al Najada,  Mohammad Wa'el Hindeyeh",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "Background: First-generation antipsychotics are dopamine receptor antagonists, while second-generation atypical antipsychotics are serotonin-dopamine antagonists. Aim: The study aims to compare the effectiveness of current anti-psychotic drugs in treating schizophrenia, focusing on their correlation with responsiveness rates in positive, negative, and psychopathological symptoms. Methods: The study focuses on schizophrenia-spectrum disorders in adults and elderly psychiatric patients at the Princess Aisha Bint Al Hussein Medical Centre. The study will assess the initial severity of patients and evaluate the therapeutic effectiveness of four categorical-based oral and LA-APDs: older oral drugs, older oral and depot drugs, newer oral drugs, and newer oral and depot drugs. The reduction percentages in each component will be monitored, and a Chi Square test will be performed to analyze other variables. Pearson or spearman correlations will be used to explore correlation values. Results: Upon aggregating the various symptom categories into a unified score using the Positive and Negative Scoring Scale (PANSS), this study revealed that 63.7% of patients exhibited a positive response, whereas 36.7% of patients did not respond favourably. This equated to 110 out of 303 patients responding, compared to 193 patients who did not respond. The Pearson and Spearman correlations exhibited a statistically significant positive relationship, with values of +0.581±0.038 and +0.574±0.040, respectively (χ 2=131.885, p-value=0.000). Conclusion: Our study concluded that Psychopathological symptom therapy and patient adherence improved significantly. The efficiency of pleasant symptoms decreased significantly, whereas negative symptoms increased slightly.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30574/wjbphs.2024.17.2.0051"
    },
    {
        "id": 26203,
        "title": "Artificial Intelligence Demonstrates Yet Another Talent: Classifying Myeloid Neoplasms",
        "authors": "Robert P. Hasserjian",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1182/hem.v20.5.202353"
    },
    {
        "id": 26204,
        "title": "NEWS TEXTS ON MILITARY TOPICS IN THE TRANSLATION ASPECT",
        "authors": "K. V. Holovenko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30525/978-9934-26-394-1-3"
    },
    {
        "id": 26205,
        "title": "Classifying Galaxy Images Using Improved Residual Networks",
        "authors": "Jaykumar Patel, Dan Wu",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "The field of astronomy has made tremendous progress in recent years thanks to advancements in technology and the development of sophisticated algorithms. One area of interest for astronomers is the classification of galaxy morphology, which involves categorizing galaxies based on their visual appearance. However, with the sheer number of galaxy images available, it would be a daunting task to manually classify them all. To address this challenge, a novel Residual Neural Network (ResNet) model, called ResNet_Var, that can classify galaxy images is proposed in this study. Subsets of the Galaxy Zoo 2 dataset are used in this research, one contains over 28,000 images for the five-class classification task, and the other contains over 25,000 images for the seven-class classification task. The overall classification accuracy of the ResNet_Var model was 95.35% for the five-class classification task and 93.54% for the sevenclass classification task.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131316"
    },
    {
        "id": 26206,
        "title": "Classifying Racism as a Behavioral Disorder: A Primer for All",
        "authors": "Frederick Johnson",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4689156"
    },
    {
        "id": 26207,
        "title": "How Buildings Relate—Classifying Architectural Interactions",
        "authors": "Marco Enia, Flavio Martella",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "In recent years, architectural interactions have become the center of many important reflections. However, there is little agreement on the subject. Some authors consider architecture to be about its relations with human and nonhuman agents. Others consider that buildings have an autonomous presence, which transcends all their interactions. These approaches are generally seen as incompatible. Although at the heart of the debate is the role of relations in architecture, their nature is not addressed. The discussion could gain clarity by recognizing the differences between them. In this paper, we propose a classification of architectural interactions, which may help to better inform further discussion on the topic. A closer look at architectural relations reveals that autonomy and relationality are not opposing, but complementary, aspects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/architecture3030027"
    },
    {
        "id": 26208,
        "title": "LABOR AND PERSONNEL POTENTIAL OF THE ENTERPRISE: INTERCONNECTION OF CATEGORIES",
        "authors": "Olga POSVALYUK,  ",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Personnel is a key component of the successful operation of enterprises of any industry sector, and their labor potential is the basis for the implementation of strategic plans and prospects for further development, which causes in-depth attention of both scientists and managers of various levels to the issue of effective personnel management. At the same time, modern domestic scientific opinion contains numerous theoretical inconsistencies in the personnel management issues of the enterprise, which are related to the actual management of the potential of employees, and this does not at all contribute to the development of practical approaches in the management of the potential of the personnel of Ukrainian enterprises. Theoretical substantiation of the relationship and interdependence between labor and personnel potential. The methodological basis of the research is general scientific and special methods of economic theory, and, in particular, methods of theoretical generalization, grouping, and comparative analysis and synthesis. Scientific views on the interpretation of the essence and separation of constituent elements of labor and personnel potentials have been studied. The characteristics of the studied potentials are summarized, with common and separate characteristics being highlighted. The substantive aspects of the concepts of “labour activity” and “personnel” as basic in the context of the study of labor and personnel potential have been studied. The ratio of personnel and labor potential of personnel at the enterprise level is characterized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31891/2307-5740-2023-316-2-35"
    },
    {
        "id": 26209,
        "title": "Barış Karabulut ranked in three categories in the Futgolf Championship...",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "Barış Karabulut ranked in three categories in the Futgolf Championship...",
        "keywords": "",
        "link": "http://dx.doi.org/10.32739/uha.id.42469"
    },
    {
        "id": 26210,
        "title": "On the Categories of Coalgebras, Dialgebras and Powerset Theory over L-Fuzzy Approximation Spaces",
        "authors": "Sutapa Mahato, S. Tiwari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012182100003595"
    },
    {
        "id": 26211,
        "title": "Classifying Preservice Teachers' Computational Thinking Skills Using Machine Learning Algorithms",
        "authors": "Hao-Yue Jin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2000873"
    },
    {
        "id": 26212,
        "title": "Convolutional Neural Networks for Classifying Electronic Components in Industrial Applications",
        "authors": "Stanisław Hożyń",
        "published": "2023-1-12",
        "citations": 4,
        "abstract": "Electronic component classification often constitutes the uncomplicated task of classifying a single object on a simple background. It is because, in many applications, a technological process employs constant lighting conditions, a fixed camera position, and a designated set of classified components. To date, there has not been an adequate attempt to develop a method for object classification under the above conditions in industrial applications. Therefore, this work focuses on the classification problem of a particular technological process. The process classifies electronic components on an assembly line using a fixed-mounted camera. The research investigated all the essential steps required to build a classification system, such as image acquisition, database creation, and neural network development. The first part of the experiment was devoted to creating an image dataset utilising the proposed image acquisition system. Then, custom and pre-trained networks were developed and tested. The results indicated that the pre-trained network (ResNet50) attained the highest accuracy (99.03%), which was better than the 98.99% achieved in relevant research on classifying elementary components. The proposed solution can be adapted to similar technological processes, where a defined set of components is classified under comparable conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16020887"
    },
    {
        "id": 26213,
        "title": "Classifying Abnormalities In Heart Beat Sound",
        "authors": "",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "Heartbeat sounds play a major role in the detection of various diseases such as heart disease, hyperthyroidism, and high blood pressure. in an early stage. In the proposed method various abnormal and healthy heartbeat audio signals are given as input and the features are extracted using MFCC (Melfrequency cepstral coefficients). Then, a Deep Learning Approach is applied in which the MFCC audio signals are sent to the CNN (Convolutional Neural Network) + LSTM (Long Short-Term Memory) model to extract and classify the abnormal heartbeat sounds with its associated disease. Thus, a system for classifying abnormal heartbeat sounds is proposed by leading a way to identify and diagnose diseases that are identified using heartbeat sounds in an early stage.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/cset/2/1/1"
    },
    {
        "id": 26214,
        "title": "Mapping Task Types and Gameplay Categories in the Context of Declarative Knowledge Training",
        "authors": "Bérénice Lemoine, Pierre Laforcade, Sébastien George",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011840100003470"
    },
    {
        "id": 26215,
        "title": "Early Classifying Multimodal Sequences",
        "authors": "Alexander Cao, Jean Utke, Diego Klabjan",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3577190.3614163"
    },
    {
        "id": 26216,
        "title": "Why Is the Baker Classification Inadequate for Classifying Silicone Implant Fibrous Capsules?",
        "authors": "Eduardo De Faria Castro Fleury",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.55776"
    },
    {
        "id": 26217,
        "title": "ISSUES OF LSP TEXTS TRANSLATION IN THE SPHERE OF LITERATURE STUDY",
        "authors": "B. V. Stasiuk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30525/978-9934-26-394-1-9"
    },
    {
        "id": 26218,
        "title": "Koszul duality for operadic categories",
        "authors": "Michael Batanin, Martin Markl",
        "published": "2023-6-16",
        "citations": 1,
        "abstract": "The aim of this paper (which is a sequel to Operadic categories as a natural environment for Koszul duality) is to set up the cornerstones of Koszul duality and Koszulity in the context of operads over a large class of operadic categories. In particular, for these operadic categories we will study concrete examples of binary quadratic operads, describe their Koszul duals and prove that they are Koszul. This includes operads (for operadic categories) whose algebras are the most important operad- and PROP-like structures such as the classical operads, their variants such as cyclic or modular operads, and also diverse versions of PROPs such as wheeled properads, dioperads, 12PROPs, and still more exotic objects such as permutads and pre-permutads.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32408/compositionality-5-4"
    },
    {
        "id": 26219,
        "title": "Classifying space via homotopy coherent nerve",
        "authors": "Kensuke Arakawa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4310/hha.2023.v25.n2.a16"
    },
    {
        "id": 26220,
        "title": "Comparative Analysis of Classification algorithms for Classifying Psychotypes",
        "authors": "Kalyani Adawadkar, Vaibhav Gandhi",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsmdi57622.2023.00091"
    },
    {
        "id": 26221,
        "title": "Machine Learning for Classifying Liver Diseases",
        "authors": "",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21608/iiis.2024.342004"
    },
    {
        "id": 26222,
        "title": "Classifying Argument Component using Deep Learning on English Dataset",
        "authors": "William Gunawan, Derwin Suhartono",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31449/inf.v47i5.4617"
    },
    {
        "id": 26223,
        "title": "Measuring and Classifying Levels of Futures",
        "authors": "Alexandre Costa-Leite",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29202/phil-cosm/31/2"
    },
    {
        "id": 26224,
        "title": "Classifying Skin Cancer and Acne using CNN",
        "authors": "Kshitiza Vasudeva, Saravanan Chandran",
        "published": "2023-2-21",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/kst57286.2023.10086873"
    },
    {
        "id": 26225,
        "title": "POSSESSIVE AND PLURAL CATEGORIES IN THE EPIC LANGUAGE «ZEVARKHON»",
        "authors": "G.S. Qodirova,  ",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "The  article  talks  about  the  expression  of  possessive  and  plural  categories  used  in  epic  language  through  lexical-semantic and grammatical means. Their lexical and methodological possibilities are revealed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37547/ajps/volume03issue12-22"
    },
    {
        "id": 26226,
        "title": "Convolutional Neural Network Approach to Classifying the CIFAR-10 Dataset",
        "authors": "Chaoyi Jiang, Guillermo Goldsztein",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Convolutional neural network (CNN) is a powerful tool that can be used in many applications of machine learning. This paper demonstrates the effectiveness of using a CNN to classify images in the CIFAR-10 dataset. The model achieved an accuracy of 0.6276 and a loss of 1.116452 on the validation set. It was observed that the accuracy of predictions varied from class to class, and this paper discusses the potential causes for this variation, such as similar classes sharing common features. Further research in this field could lead to improvement in driving assistance technology and eventually automated driving.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsrhs.v12i2.4388"
    },
    {
        "id": 26227,
        "title": "Addressing 'Special Issues' in Classifying Trademark Distinctiveness Using GPT-3",
        "authors": "John Goodhue, Leon Xing",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4582171"
    },
    {
        "id": 26228,
        "title": "Stochastic Study on CNN Approach for Classifying Images",
        "authors": "",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "Recent years have seen a surge in interest in artificial intelligence and computer vision applications, which are essential for many real-time tasks like video summarization, picture retrieval, and image categorization. Convolutional neural networks, which are employed in numerous image processing and computer vision applications, are one of the most popular deep learning techniques. In this study, a CNN model for classifying colour images is proposed. The proposed model was developed using deep learning tools in MATLAB. Additionally, three separate datasets of varying sizes were used to test the suggested model. With the largest dataset, the suggested model produced the highest accuracy, precision, and sensitivity results, which are as follows: accuracy is 0.9924, precision is 0.9947, and sensitivity is 0.9931 when compared to other models",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/ijfans/issue4/003"
    },
    {
        "id": 26229,
        "title": "Classifying Philippine Medicinal Plants Based on Their Leaves Using Deep Learning",
        "authors": "Epie F. Custodio",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174335"
    },
    {
        "id": 26230,
        "title": "Issues Regarding Determining Economic Crimes and Classifying Them in UAE",
        "authors": "Viktor Shestak, Alyona Tsyplakova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4384009"
    },
    {
        "id": 26231,
        "title": "Classifying nursing as a cost comes at a high price",
        "authors": "Linda Laskowski-Jones",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.nurse.0000903988.69253.e5"
    },
    {
        "id": 26232,
        "title": "Braided monoidal categories of coalgebras",
        "authors": "Jean-Paul Mavoungou",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47443/ejm.2023.046"
    },
    {
        "id": 26233,
        "title": "Cepstral Coefficients Effectiveness for Gunshot Classifying",
        "authors": "Jakub Svatos, Jan Holub",
        "published": "2024-4-9",
        "citations": 0,
        "abstract": "Abstract\nThis paper analyses the efficiency of various frequency cepstral coefficients (fCC) in a non-speech application, specifically in classifying acoustic impulse events - gunshots. There are various methods for such event identification available. The majority of these methods are based on time or frequency domain algorithms. However, both of these domains have their limitations and disadvantages. In this article, an fCC, combining the advantages of both frequency and time domains, is presented and analyzed. These originally speech features showed potential not only in speech-related applications but also in other acoustic applications. The comparison of the classification efficiency based on features obtained using four different fCC, namely Mel-frequency Cepstral Coefficients (MFCC), Inverse Mel-frequency Cepstral Coefficients (IMFCC), Linear-frequency Cepstral Coefficients (LFCC), and Gammatone-frequency Cepstral Coefficients (GTCC) is presented. An optimal frame length for an fCC calculation is also explored. Various gunshots from short guns and rifle guns of different calibers and multiple acoustic impulse events, similar to the gunshots, to represent false alarms are used. More than six hundred acoustic events records have been acquired and used for training and validation of two designed classifiers, Support Vector Machine, and Neural Network. Accuracy, Recall and Matthew's correlation coefficient measure the classification success rate. The results reveal the superiority of GFCC to other analyzed methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6501/ad3c5d"
    },
    {
        "id": 26234,
        "title": "Classifying Sexes",
        "authors": "Hane Htut Maung",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "In the political discourse regarding gender identity, the concept of biological sex has been weaponised by gender critical commentators to oppose gender affirmation for trans people. Recently, these commentators have appealed to an essentialist model of sex based on anisogamy, or relative gamete size, to argue that one’s sex is an immutable characteristic. I argue that the gender critical argument is unsound. The diverse purposes of sex classification and the complex variability of people’s sexual characteristics show that an essentialist model is untenable. I then consider how a more adequate theoretical framework from the philosophy of biology can accommodate this complexity and capture how sex is classified in relevant contexts. Further implications of the framework are explored which concern the vagueness, polysemy, and mutability of sex. These undercut the gender critical argument and show that the appeal to biological sex fails to undermine gender affirmation for trans people.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21825/digest.84674"
    },
    {
        "id": 26235,
        "title": "Preface",
        "authors": "Fernando Bermejo-Rubio",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1163/2451859x-00801001"
    },
    {
        "id": 26236,
        "title": "CLASSIFYING IMBALANCED DATA BASED ON DOS AND DDOS ATTACKS",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets33886"
    },
    {
        "id": 26237,
        "title": "METHODOLOGY FOR CLASSIFYING MONEY LAUNDERING RISKS TYPOLOGIES",
        "authors": "V. A. Konovalov",
        "published": "2023-4",
        "citations": 0,
        "abstract": "The method of classifying the typologies of money laundering and terrorist financing risks in big data from a variety of data sources of organizational systems is investigated. The main provisions of this technique are theoretically substantiated, reference models and calculation formulas are given. An algebraic approach for the synthesis of the method is proposed, a theoretical justification of the feasibility of its use is given. The algebraic approach to the synthesis of the methodology is implemented on the basis of category theory and the theory of algorithms, in particular the theory of Markov algorithms, which is considered outside of normal algorithms. The N-scheme of the Markov algorithm is considered, which was developed to replace its well-known g-scheme and provides processing of words in natural, artificial and combined languages, which can be represented in an ordered and extended Markov alphabet A±2, which takes into account many sources of big data. Methods for inputting incomplete, heterogeneous (heterogeneous) and non-representative input data samples are given. A method is proposed for converting input data samples into cycles of the Big Data Transfer Protocol. A reference model of the legal economic activity of the organizational system has been synthesized. This reference model is subjected to analysis and signs of illegal economic activity of mutually interacting organizational systems are highlighted. A reference model of the system for classifying the risks of laundering proceeds from crime and financing of terrorism has been developed. To combat money laundering, the N-scheme of the Markov algorithm for one data source and the Markov system, consisting of such schemes, for a variety of big data sources are theoretically substantiated. It is concluded that the synthesized Markov system provides a decomposition of words and their morphisms, contains a common data input control channel, and provides a classification of money laundering risks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14489/vkit.2023.04.pp.027-038"
    },
    {
        "id": 26238,
        "title": "Classifying tree topology changes along tropical line segments",
        "authors": "Shelby Cox",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2140/astat.2023.14.71"
    },
    {
        "id": 26239,
        "title": "The Prevalence and Categories of Impacted Maxillary Canines: A Radiographic Study",
        "authors": "Ebrahim Alshawy",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.40070"
    },
    {
        "id": 26240,
        "title": "Essentialism in the Categories",
        "authors": "Gabriel Shapiro",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Abstract\nAccording to the Categories, predicates can be ‘said of’ their subjects or they can be ‘present in’ their subjects. The said-of relation has received relatively little scholarly attention, and scholars disagree on the answers to four foundational questions about the relation. (i) What is it? (ii) Is it an essential relation? (iii) How is it related to predication? (iv) Is it primitive? I argue that A is said-of B just in case A is a formal part of B. On this account, said-of is an essential relation and it is definable, but it is not defined in terms of predication.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1163/15685284-bja10070"
    },
    {
        "id": 26241,
        "title": "Within-Style Investing: Evidence from Morningstar Categories",
        "authors": "Kevin Zhao",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4768145"
    },
    {
        "id": 26242,
        "title": "REGULATORY TECHNICAL SPECIFICATIONS FOR CERTAIN CATEGORIES OF BUILDING PRODUCTS",
        "authors": "",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33644/2313-6679-2-2023-7"
    },
    {
        "id": 26243,
        "title": "Evaluating Security Anomalies by Classifying Traffic Using Deep Learning",
        "authors": "Mohammadreza Samadzadeh, Najmeh Farajipour Ghohroud",
        "published": "2023-5-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icwr57742.2023.10138963"
    },
    {
        "id": 26244,
        "title": "THE SPECIFICS OF TRANSLATING SCIENTIFIC AND TECHNICAL TEXTS IN THE GERMAN-UKRAINIAN LANGUAGE PAIR",
        "authors": "A. S. Lashko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30525/978-9934-26-394-1-5"
    },
    {
        "id": 26245,
        "title": "An Intelligent Tool for Classifying Issue Reports",
        "authors": "Muhammad Laiq",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nlbse59153.2023.00010"
    },
    {
        "id": 26246,
        "title": "Analysis of CNN Optimizer for Classifying Letter Images",
        "authors": "Syifa Fauziah, Putu Harry Gunawan",
        "published": "2023-8-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icodsa58501.2023.10277347"
    },
    {
        "id": 26247,
        "title": "Classifying World War II era ciphers with machine learning",
        "authors": "Brooke Dalton, Mark Stamp",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/01611194.2024.2304888"
    },
    {
        "id": 26248,
        "title": "Applications of hypergraph-based methods in classifying and subtyping psychiatric disorders: a survey",
        "authors": "Ju Niu, Yuhui Du",
        "published": "2023",
        "citations": 0,
        "abstract": "Psychiatric disorders exhibit extremely high heterogeneity, thus making accurate diagnosis and timely treatment challenging. Numerous neuroimaging studies have revealed abnormal changes in brain functional connectivity among patients with psychiatric disorders. To better understand the complexity of these disorders, researchers have explored hypergraph-based methods. Using functional magnetic resonance imaging data and hypergraph theory, studies have modeled and analyzed brain functional connectivity hypernetworks to classify psychiatric disorders and identify associated biomarkers. Furthermore, modeling a subjects-level hypergraph aids in estimating potential higher-order relationships among individuals; thus, hypergraphs can be used for classifying psychiatric disorders and identifying biomarkers. Recent neuroimaging studies have revealed specific subtypes of psychiatric disorders with biological importance. Hypergraph-based clustering methods have been used to investigate subtypes of psychiatric disorders. However, limited work has surveyed the applications of hypergraph-based methods in classifying and subtyping psychiatric disorders. To address this gap, this article provides a thorough survey, and discusses current challenges and potential future research directions in this field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15212/radsci-2023-0008"
    },
    {
        "id": 26249,
        "title": "Writing Family and Literary History from Primary Texts",
        "authors": "Cristina Ramírez",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55520/fncef6xn"
    },
    {
        "id": 26250,
        "title": "Presentations for tensor categories",
        "authors": "James East",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4171/jca/82"
    },
    {
        "id": 26251,
        "title": "Fundamentals of Lie categories",
        "authors": "Žan Grad",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4171/jncg/563"
    },
    {
        "id": 26252,
        "title": "Abstract Categories Table of Contents",
        "authors": "",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s2059-7754(23)00480-7"
    },
    {
        "id": 26253,
        "title": "A categories equivalence of associative bimodules",
        "authors": "Victor LÓPEZ SOLÍS",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "In this paper we use the classical Wedderburn's Kronecker Factorization Theorem to prove that category of bimodules over $B$ and the category of bimodules over $M_{n}(B)$ are equivalent, where $B$ is some unital associative algebra. In addition to this, we classify the irreducible bimodules over $M_{n}(F).$",
        "keywords": "",
        "link": "http://dx.doi.org/10.24330/ieja.1438739"
    },
    {
        "id": 26254,
        "title": "Classifying Relevant Causes of Employee Absenteeism Using Machine Learning",
        "authors": "I. Fosić, A. Živković, I. Fosić",
        "published": "2023-5-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/mipro57284.2023.10159947"
    },
    {
        "id": 26255,
        "title": "Censorship, Press and Literature: the case of the Eighteen Texts, New Texts 1 and New Texts 2",
        "authors": "Θ. Πολυζωίδου",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "Στο παρόν άρθρο παρουσιάζεται μέρος της αποδελτίωσης των εφημερίδων Βήμα και Νέα αναφορικά με τους τόμους των Δεκαοχτώ Κειμένων, των Νέων Κειμένων 1 και Νέων Κειμένων 2, που αποτέλεσαν την πρώτη συλλογική πράξη αντίστασης διανοουμένων απέναντι στην απριλιανή δικτατορία. Στόχος μου είναι να καταγράψω ενδεικτικά δημοσιεύματα (άρθρα, σημειώματα, συνεντεύξεις) εστιάζοντας στην παρουσίαση και πρόσληψη των τόμων μέσα από τα δύο έντυπα καθώς και να προσεγγίσω τη σχέση λογοτεχνίας και Τύπου σε εποχές ανελευθερίας.\nThis paper presents part of the indexation from the newspapers Vima and Nea regarding the volumes of Eighteen Texts, New Texts 1 and New Texts 2, which constituted the first collective act of intellectuals’ resistance against the Regime of the Colonels. The primary aim is to record indicative publications (articles, memos, interviews) in order to emphasize on the presentation and reception of these three volumes from the newspapers and secondly is to approach the relationship between writers and the Press in times of Totalitarianism.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52607/26587157_2023_17_106"
    },
    {
        "id": 26256,
        "title": "A New Feature-Centered Method for Classifying Emotions Based on Context",
        "authors": "Bhavuk Samrat",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245944"
    },
    {
        "id": 26257,
        "title": "Envelopes and classifying spaces",
        "authors": "Nikita A. Karpenko",
        "published": "2023-10",
        "citations": 1,
        "abstract": "AbstractFor a split semisimple algebraic group H with its split maximal torus S, let  be the restriction homomorphism of the Chow rings  of the classifying spaces  of H and S, where W is the Weyl group. A constraint on the image of f, given by the Steenrod operations, has been applied to the spin groups in a previous paper. Here, we describe and apply to the spin groups another constraint, which is given by the reductive envelopes of H. We also recover in this way some older results on orthogonal groups.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mana.202200214"
    },
    {
        "id": 26258,
        "title": "Classifying Air Quality Using Machine Learning Models",
        "authors": "Eman Abdelfattah, Yuval Ashkenazi",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/uemcon59035.2023.10316018"
    },
    {
        "id": 26259,
        "title": "The Causal Unity of the Categories Meter, Kilogram, Second and Ampere and its Relation to Human Seeing",
        "authors": "Dorda G",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "It is shown that the analysis of the equation, which describes the identity of the phenomenon time, given by the effect of the pendulum (PE) and the effect of the third law of Kepler (3LK) results in the observation of the causal unity of the categories meter, kilogram, second and ampere, the categories of the classical system of units. Based on these experimentally confirmed findings, it is shown that the differentiation of the numerically expressed fundamental categories refers to the effect of the factor temperature, which in cumulate form is represented by the weather, modified by space, time and distance. Furthermore, it is shown that these findings refer to the process of human seeing. Finally, it is pointed out that the free decision of the human enables the moral valuation of the personal activities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/psbj-16000255"
    },
    {
        "id": 26260,
        "title": "Intrusion Detection Systems: Categories, Attack Detection and Response",
        "authors": "Adilah Nisar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4478816"
    },
    {
        "id": 26261,
        "title": "Multiplicities and Dimensions in Enveloping Tensor Categories",
        "authors": "Friedrich Knop",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "Abstract\nIn a previous paper, semisimple tensor categories were constructed from certain regular Mal’cev categories. In this paper, we calculate the tensor product multiplicities and the categorical dimensions of the simple objects. This yields also the Grothendieck ring. The main tool is the subquotient decomposition of the generating objects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/imrn/rnad303"
    },
    {
        "id": 26262,
        "title": "Polygroup objects in regular categories",
        "authors": "Alessandro Linzi",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract><p>We express the fundamental properties of commutative polygroups (also known as canonical hypergroups) in category-theoretic terms, over the category $  \\mathbf{Set} $ formed by sets and functions. For this, we employ regularity as well as the monoidal structure induced on the category $ {\\mathbf{Rel}} $ of sets and relations by cartesian products. We highlight how our approach can be generalised to any regular category. In addition, we consider the theory of partial multirings and find fully faithful functors between certain slice or coslice categories of the category of partial multirings and other categories formed by well-known mathematical structures and their morphisms.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024552"
    },
    {
        "id": 26263,
        "title": "Classifying Gravitational Waves with GMM and GLM techniques",
        "authors": "Sourav Dutta, Shwetabh Biswas, Reetanjali Moharana",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22323/1.444.1570"
    },
    {
        "id": 26264,
        "title": "Classifying Tor Traffic Encrypted Payload Using Machine Learning",
        "authors": "Pitpimon Choorod, George Weir, Anil Fernando",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3356073"
    },
    {
        "id": 26265,
        "title": "Classifying different national approaches to climate governance",
        "authors": "",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41558-022-01591-3"
    },
    {
        "id": 26266,
        "title": "Classifying handwriting samples according to their type using discriminant analysis",
        "authors": "Jagoda Dzida",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Classifying handwriting samples according to their type (i.e. natural, disguised, traced, simulated or unintentionally unnatural) is an important task in handwriting analysis. It may facilitate the collection of writing standards and also help experts to assess the differences between questioned material and comparative samples or to choose the best writing features and the most relevant examination protocol for the case. Current research aimed to create a method for classifying the type of a handwriting sample using discriminant analysis. Five basic types (i.e. natural, disguised, traced, simulated and unintentionally unnatural) and some subtypes were included in this study. Participants (N = 139) wrote their full signatures, fictional signatures or a short sentence. Motor and dimensional features were assessed. The methods proved to be more than twice as accurate in classifying samples according to their type than a random choice probability (e.g. 44% as opposed to 17% for the 6-types classifier). This proof-of-a-concept study demonstrates that handwriting samples may be classified according to their type with satisfying accuracy based on their writing features and statistical tools of discriminant analysis. However, further studies are necessary to improve the accuracy of the method.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4467/12307483pfs.22.013.17686"
    },
    {
        "id": 26267,
        "title": "Classifying Anticancer Peptides Using Gated Recurrent Unit",
        "authors": "Onur Karakaya, Zeynep Hilal Kilimci",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ismsit58785.2023.10304943"
    },
    {
        "id": 26268,
        "title": "Genetic Algorithm Based Over-Sampling with DNN in Classifying the Imbalanced Data Distribution Problem",
        "authors": "S Karthikeyan,  , T Kathirvalavakumar",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i8.863"
    },
    {
        "id": 26269,
        "title": "Classifying Human Thermal Images Using Deep Learning Technique in Artificial Intelligence",
        "authors": "Sathish Kumar Gurupatham, Ujjwal Purimetla, Kaliga Kumar",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Abstract\nDeep learning is a sub-field of machine learning that uses multi-layered artificial neural networks which has become very popular in recent times to perform tasks such as image and speech recognition, natural language processing, decision making and so on. It has several applications in mechanical engineering and especially in the manufacturing field, too. Applying image recognition concepts to inspect the defects in products (Quality control), scheduling maintenance of equipment based on the sensor data (Predictive maintenance), applying deep learning concepts to train the movements of robotic arms timely for welding & assembly in production workshops (Robotics), and using deep learning to optimize schedules & logistics (Supply chain optimization) could be some of the applications worth to mention. This paper focuses on classifying the thermal images of objects, especially thermal ones. This work discusses the application of three pre-trained convolutional neural network (CNN) models namely VGG16, MobileNetV2, and InceptionResNetV2 for classification of thermal images of two classes (two human faces) belonging to the same family with more resemblance in their appearance so as to increase the complexity in classifying. The procedure had two phases: The first phase has the training and testing with thermal images whereas the second phase has increased number of images with image augmentation technique to repeat the same process to improve the performance the models. The data-set used in the models consists of thermal images of two slightly different faces of the same family that were taken using a thermal imaging camera (Flir-E6). In the first phase, the data-set was divided into training, validation, and testing sets with each set consisting of 50 images, 30 images, and 20 images respectively. In the second phase, after the image augmentation, the data-set was divided into 350 training images, 120 validation images, and 50 testing images. The performance of the models was observed for 10,20, and 30 epochs. The learning rate was assigned to 0.0001 with Adam optimizer and a batch size of 10. The results showed that the model VGG16, in the initial phase, yields training and validation accuracy of 100% and 90% respectively. In the second phase, it yields training and validation accuracy of 100% and 90.83% respectively. The model could classify 19 out of 20 images correctly before image augmentation and 49 out of 50 images correctly after the image augmentation was applied. It shows an increase of 3% from 95% to 98% before and after image augmentation was applied. For the given input images, the other models, though they are well-established ones, did not perform better than VGG16.The confusion matrix was plotted for all the models for important results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/imece2023-109647"
    },
    {
        "id": 26270,
        "title": "Review Classification Based on Machine Learning: Classifying Game User Reviews",
        "authors": "Zhang Yejian, Shingo Takada",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3342294"
    },
    {
        "id": 26271,
        "title": "Classifying and grading liposarcoma by CT",
        "authors": "Tomomi Sanomachi, Hiroto Ishiki",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s1470-2045(24)00005-6"
    },
    {
        "id": 26272,
        "title": "Classifying Roads with Multi-Step Graph Embeddings",
        "authors": "Mohale E. Molefe, Jules R. Tapamo",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13053/cys-28-1-4891"
    },
    {
        "id": 26273,
        "title": "INVESTIGATING THE PERFORMANCE OF FEATURE ION METHODS IN CLASSIFYING STUDEN",
        "authors": "Özlem Bezek Güre",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35826/ijetsar.668"
    },
    {
        "id": 26274,
        "title": "Machine learning techniques for classifying dangerous asteroids",
        "authors": "Seyed Matin Malakouti, Mohammad Bagher Menhaj, Amir Abolfazl Suratgar",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mex.2023.102337"
    },
    {
        "id": 26275,
        "title": "Classifying Participant Standing and Sitting Postures Using Channel State Information",
        "authors": "Oliver Custance, Saad Khan, Simon Parkinson",
        "published": "2023-11-1",
        "citations": 1,
        "abstract": "Recently, channel state information (CSI) has been identified as beneficial in a wide range of applications, ranging from human activity recognition (HAR) to patient monitoring. However, these focused studies have resulted in data that are limited in scope. In this paper, we investigate the use of CSI data obtained from an ESP32 microcontroller to identify participants from sitting and standing postures in a many-to-one classification. The test is carried out in a controlled isolated environment to establish whether a pre-trained model can distinguish between participants. A total of 15 participants were recruited and asked to sit and stand between the transmitter (Tx) and the receiver (Rx), while their CSI data were recorded. Various pre-processing algorithms and techniques have been incorporated and tested on different classification algorithms, which have gone through parameter selection to enable a consistent testing template. Performance metrics such as the confusion matrix, accuracy, and elapsed time were captured. After extensive evaluation and testing of different classification models, it has been established that the hybrid LSTM-1DCNN model has an average accuracy of 84.29% and 74.13% for sitting and standing postures, respectively, in our dataset. The models were compared with the BedroomPi dataset and it was found that LSTM-1DCNN was the best model in terms of performance. It is also the most efficient model with respect to the time elapsed to sit and stand.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12214500"
    },
    {
        "id": 26276,
        "title": "The problem of identifying and classifying post-cemetery soils in urban areas",
        "authors": "A. Greinert, J. Kostecki",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.geoderma.2024.116774"
    },
    {
        "id": 26277,
        "title": "TensorFlow vs. PyTorch in Classifying Medical Images – preliminary results",
        "authors": "Liana Stanescu, Gabriela Dinu",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icstcc59206.2023.10308472"
    },
    {
        "id": 26278,
        "title": "Representations of Time in Texts about Space (Based on the Materials of Vastuvidya Texts in the Puranas)",
        "authors": "Elena Tyulina",
        "published": "2023",
        "citations": 0,
        "abstract": "The Puranas (“Tales of former times”) are a kind of presentation of the “history” of the world. In the Puranas, in comparison with the previous literature, much attention is paid to the idea of time. In these huge works devoted to the history of the creation of the universe and its consistent description, the entire universe is presented as a manifestation of the supreme deity (depending on the direction of the Purana it could be Vishnu or Shiva). The importance of the temporal component is explained by the fact that the supreme god has not only a material, “bodily” manifestation in the form of Purusha (a being from which the universe originated), but also in the form of Kala (kala), i.e., time. Indirectly, the length of time in the Puranas is related to the “length” of the text (the duration of its reading or reproduction), which affects the volume of these works, they include a huge corpus of works, ranging from mythological and ritual texts, ending with treatises on various branches of knowledge. The key to the formal integrity of the Puranas is that all texts, even highly specialized ones, are processed in accordance with some general guidelines. At the same time, a temporary component appears in the presentation of any topic. This has even affected texts such as vastuvidya (texts on construction and architecture), which are devoted to the category of space rather than time, since they set out the principles of organizing and sanctifying the space of any man-made objects and their surroundings. In the Puranas, the past appears in vastuvidya texts. This is a kind of “history” of the origin of the main rituals (for example, the history of the appearance of the vastu-mandala). But the main direction of time is the future. Recommendations about the most preferred sizes, proportions, and layouts are supported by predictions about how this will affect the fate of residents of buildings under construction. For this purpose, the folk tradition of fortune-telling and signs is used. The article shows these and other ways in which the highly specialized text of vastuvidya is transformed into a “puranic” text.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18254/s268684310029206-4"
    },
    {
        "id": 26279,
        "title": "Invertible objects in Franke's comodule categories",
        "authors": "Drew Heard",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "We study the Picard group of Franke's category of quasi-periodic $E_0E$-comodules for $E$ a 2-periodic Landweber exact cohomology theory of height $n$ such as Morava $E$-theory, showing that for $2p-2 > n^2+n$, this group is infinite cyclic, generated by the suspension of the unit. This is analogous to, but independent of, the corresponding calculations by Hovey and Sadofsky in the $E$-local stable homotopy category. We also give a computation of the Picard group of $I_n$-complete quasi-periodic $E_0E$-comodules when $E$ is Morava $E$-theory, as studied by Barthel-Schlank-Stapleton for $2p-2 \\ge n^2$ and $p-1 \\nmid n$, and compare this to the Picard group of the $K(n)$-local stable homotopy category, showing that they agree up to extension.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7146/math.scand.a-142361"
    },
    {
        "id": 26280,
        "title": "Influential Factors in Classifying Professionalism Levels of Teachers in Turkey",
        "authors": "Sümeyye DERİN, Emre TOPRAK",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "Teaching is a profession that requires professionalism. Professionalism is considered as a concept related to the improvement of teachers’ work quality, professional standards and public image. The development of professionalism depends on the identification of variables that may be associated with it. Current study aims to determine the order of importance of the influential factors in classifying teachers’ professionalism levels. For this purpose, data were collected from 500 teachers working in a city with metropolitan status in Central Anatolia. In the research, the Teacher Professionalism Scale was used to determine the professionalism levels of teachers, and the Happiness Scale was used to determine the level of happiness, one of the predictive variables. In the research; the data on the predictive variables were collected with the personal information form prepared by the researchers. Artificial neural networks were used in data analysis. In data analysis, 1000 different artificial neural network models were established for each sub-dimension and total score of professionalism. The importance mean of each predictor variable in classifying the professionalism sub-dimensions and total score was calculated in all models and the importance ranking of the variables was obtained. According to the findings obtained from the research, the level of happiness is determined as the most effective variable in classifying the professionalism total score, occupational awareness, contribution to the organization and emotional labor sub-dimensions. It was determined that the level of satisfaction with school is the most effective variable in classifying the personal development sub-dimension. Gender is the least effective variable in classifying the total score of teachers' professionalism; seniority is the least effective variable in classifying personal development and emotional labor sub-dimensions. In addition, it was determined that the weekly course load has the least effect in classifying the sub-dimensions of occupational awareness and contribution to the institution. Suggestions were presented in line with the findings obtained from the research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.19160/e-ijer.1130360"
    },
    {
        "id": 26281,
        "title": "Article 10: Processing of Special Categories of Personal Data",
        "authors": "Catherine Jasserand",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4467178"
    },
    {
        "id": 26282,
        "title": "Motivated Categories: Social Structures Shape the Construction of Social Categories Through Attentional Mechanisms",
        "authors": "Suraiya Allidina, William A. Cunningham",
        "published": "2023-11",
        "citations": 2,
        "abstract": " Social categorization is often framed as the antecedent to stereotyping, with perceivers rationally sorting the social world on the basis of perceptually salient categories before applying biased or motivated beliefs about those categories. Here, we instead suggest that the construction of social categories by individuals is itself subject to motivational influences, such that perceivers will attend to a given dimension of social categorization (e.g., race or gender) insofar as doing so fits within their motivations. Drawing from classic conceptualizations of social structure as the interplay of schemas and resources, we focus on how the motivations for shared schemas and for material benefits or resources may shape attention to social category dimensions. We outline the potential cognitive mechanisms through which these motivations may act on attention, before discussing the implications of this model for individual differences, conceptualizations of social categorization as rational information reduction, and prejudice reduction. Public Abstract Social categories like race and gender often give rise to stereotypes and prejudice, and a great deal of research has focused on how motivations influence these biased beliefs. Here, we focus on potential biases in how these categories are even formed in the first place, suggesting that motivations can influence the very categories people use to group others. We propose that motivations to share schemas with other people and to gain resources shape people’s attention to dimensions like race, gender, and age in different contexts. Specifically, people will pay attention to dimensions to the degree that the conclusions produced from using those dimensions align with their motivations. Overall, we suggest that simply examining the downstream effects of social categorization like stereotyping and prejudice is not enough, and that research should look earlier in the process at how and when we form the categories on which those stereotypes are based. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/10888683231172255"
    },
    {
        "id": 26283,
        "title": "The Morita Theory of Fusion 2-Categories",
        "authors": "Thibault D. Décoppet",
        "published": "2023-5-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21136/hs.2023.07"
    },
    {
        "id": 26284,
        "title": "Adorno and the categories of resistance",
        "authors": "Henry W. Pickford",
        "published": "2023-1-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/1467-8675.12652"
    },
    {
        "id": 26285,
        "title": "$\\infty$-operads as symmetric monoidal $\\infty$-categories",
        "authors": "Rune Haugseng, Joachim Kock",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5565/publmat6812406"
    },
    {
        "id": 26286,
        "title": "Towards higher super-$\\sigma$-model categories",
        "authors": "Rafał R. Suszek",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "A simplicial framework for the gerbe-theoretic modelling of supercharged-loop dynamics in the presence of worldsheet defects is discussed whose equivariantisation with respect to global supersymmetries of the bulk theory and subsequent orbit decomposition lead to a natural stratification of and cohomological superselection rules for target-space supergeometry, expected to encode essential information on the quantised 2d field theory. A physically relevant example is analysed in considerable detail.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21468/scipostphysproc.14.044"
    },
    {
        "id": 26287,
        "title": "Defining &amp; Classifying Idiopathic Sensory Processing Disorder",
        "authors": "Shelley Mulligan",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "Abstract\nDate Presented 04/22/2023\nA study examining the characteristics of children identified with idiopathic sensory processing disorder (SPD) and relations among specific types and subtypes of SPD as proposed by the 2007 nosology (Miller et al.) will be presented. A descriptive correlational nonexperimental design was used. Results suggested that current typologies may include more types and subtypes than are clinically useful, and the most effective ways of understanding SPD as its own diagnostic entity are discussed.\nPrimary Author and Speaker: Shelley Mulligan",
        "keywords": "",
        "link": "http://dx.doi.org/10.5014/ajot.2023.77s2-rp9"
    },
    {
        "id": 26288,
        "title": "A Hybrid Approach for Classifying Drug-Resistant Microscopic Species",
        "authors": "Harshitha D G, Suresh Jamadagni",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276032"
    },
    {
        "id": 26289,
        "title": "Classifying Clinically Important Cancers Using Deep Belief Networks",
        "authors": "Nikita Jain, R Kamalraj, Ajay Agrawal",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470868"
    },
    {
        "id": 26290,
        "title": "Re-classifying Digital Twin from The Perspective of Implementation Purpose",
        "authors": "David YK Chan",
        "published": "2023-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/an13.20230561"
    },
    {
        "id": 26291,
        "title": "On classifying spaces for dimension",
        "authors": "Alexander Dranishnikov",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.topol.2022.108360"
    },
    {
        "id": 26292,
        "title": "Multimodal Approach for Classifying Stress using Facial Emotion and Physiological Sensors",
        "authors": "M.S. Abirami, Umang Shringi, Aditya Mishra",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnwc57852.2023.10127519"
    },
    {
        "id": 26293,
        "title": "Detecting and Classifying Changes in Traffic Rules using Induction Loop Data",
        "authors": "Aziza Zhanabatyrova, Clayton Leite, Yu Xiao",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386419"
    },
    {
        "id": 26294,
        "title": "Image-based Automated Framework for Detecting and Classifying Unmanned Aerial Vehicles",
        "authors": "Raby Hamadi, Hakim Ghazzai, Yehia Massoud",
        "published": "2023-3-19",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sm57895.2023.10112531"
    },
    {
        "id": 26295,
        "title": "DEVELOPMENT OF A SYSTEM FOR LEARNING PATENT ACT TEXTS WHILE DRAWING THE MODIFICATION STRUCTURE BETWEEN CLAUSES OF THE TEXTS",
        "authors": "Takako Akakura, Toru Kano",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2023.2125"
    },
    {
        "id": 26296,
        "title": "CLASSIFYING TRANSVAGINAL SYNTHETIC MESH COMPLICATIONS: CAN WE IMPROVE THE CURRENT SYSTEM?",
        "authors": "J King, K Anderson, H Hashim",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cont.2023.100770"
    },
    {
        "id": 26297,
        "title": "Human Factors Analysis by Classifying Chemical Accidents into Operations",
        "authors": "Esra Yalcin, Gokcen Alev Ciftcioglu, Burcin Hulya Guzel",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "In the chemical industry, organizational and operational human factors significantly contribute to accidents. Chemical accidents occur in various operations of the industry due to a range of factors. Understanding the relationship between these factors and the accidents that happen is crucial in preventing similar accidents from happening repeatedly and promoting sustainability. Therefore, this study was divided into five operations: maintenance repair, process, loading unloading, storage, and shutdown startup of the chemical industry, to provide a more concrete, intuitive explanation of the interplay between causes and illustrate the routes to failure. The data were collected from 251 accident reports from various online data. The study was analyzed using the Human Factors Analysis and Classification System (HFACS) method as a conceptual framework. Each level’s frequency variables were obtained to define nominal and ordinal data. The chi-square test and Fisher’s exact test were used in the difference analysis of data in the model. The results show that the high-frequency accidents caused under the HFACS framework were organizational processes in the process (63.73%), in the storage (70.58%), and in the shutdown startup (91.66%), and skill-based errors in the maintenance repair (81.81%) and in the loading unloading (66.03%). Furthermore, resource management, technological environment, and personal readiness were significantly correlated with the operations. Human factors have differences in different operations in the chemical industry.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15108129"
    },
    {
        "id": 26298,
        "title": "A Hybrid Data Resampling Algorithm Combining Leader and SMOTE for Classifying the High Imbalanced Datasets",
        "authors": "S Karthikeyan,  , T Kathirvalavakumar",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i16.146"
    },
    {
        "id": 26299,
        "title": "Should Clinicians Reconsider Classifying MS As Relapsing or Progressive?",
        "authors": "Susan Kreimer",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.nt.0000920292.37847.ca"
    },
    {
        "id": 26300,
        "title": "Classifying topoi in synthetic guarded domain theory",
        "authors": "Daniele Palombi, Jonathan Sterling",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "Several different topoi have played an important role in the development and\napplications of synthetic guarded domain theory (SGDT), a new kind of synthetic\ndomain theory that abstracts the concept of guarded recursion frequently\nemployed in the semantics of programming languages. In order to unify the\naccounts of guarded recursion and coinduction, several authors have enriched\nSGDT with multiple \"clocks\" parameterizing different time-streams, leading to\nmore complex and difficult to understand topos models. Until now these topoi\nhave been understood very concretely qua categories of presheaves, and the\nlogico-geometrical question of what theories these topoi classify has remained\nopen. We show that several important topos models of SGDT classify very simple\ngeometric theories, and that the passage to various forms of multi-clock\nguarded recursion can be rephrased more compositionally in terms of the lower\nbagtopos construction of Vickers and variations thereon due to Johnstone. We\ncontribute to the consolidation of SGDT by isolating the universal property of\nmulti-clock guarded recursion as a modular construction that applies to any\ntopos model of single-clock guarded recursion.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46298/entics.10323"
    },
    {
        "id": 26301,
        "title": "A selective evolutionary heterogeneous ensemble algorithm for classifying imbalanced data",
        "authors": "Xiaomeng An, Sen Xu",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract>\n\t\t\t<p>Learning from imbalanced data is a challenging task, as with this type of data, most conventional supervised learning algorithms tend to favor the majority class, which has significantly more instances than the other classes. Ensemble learning is a robust solution for addressing the imbalanced classification problem. To construct a successful ensemble classifier, the diversity of base classifiers should receive specific attention. In this paper, we present a novel ensemble learning algorithm called Selective Evolutionary Heterogeneous Ensemble (SEHE), which produces diversity by two ways, as follows: 1) adopting multiple different sampling strategies to generate diverse training subsets and 2) training multiple heterogeneous base classifiers to construct an ensemble. In addition, considering that some low-quality base classifiers may pull down the performance of an ensemble and that it is difficult to estimate the potential of each base classifier directly, we profit from the idea of a selective ensemble to adaptively select base classifiers for constructing an ensemble. In particular, an evolutionary algorithm is adopted to conduct the procedure of adaptive selection in SEHE. The experimental results on 42 imbalanced data sets show that the SEHE is significantly superior to some state-of-the-art ensemble learning algorithms which are specifically designed for addressing the class imbalance problem, indicating its effectiveness and superiority.</p>\n\t\t</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/era.2023138"
    },
    {
        "id": 26302,
        "title": "Classifying Alzheimer's disease based on a convolutional neural network with MRI images",
        "authors": "",
        "published": "2023",
        "citations": 1,
        "abstract": "Alzheimer's disease is a significant disease that negatively affects daily life and reduces the quality of human life. Dementia and Alzheimer's disease occur as the loss of neurons or a decrease in the relationship between neurons. So far, no effective drug has been found in diagnosing this disease. For this reason, it has become essential for individuals to diagnose the disease early and to detect the disease before it progresses. However, early diagnosis of the disease is challenging. The disease can be diagnosed after significant and irreversible effects on humans occur. A lot of research has been done worldwide for early disease diagnosis. Deep learning algorithms have become essential in diagnosing this disease. Significant progress has been made in diagnosing the disease with models created using deep learning algorithms. This study used a sequential model, conv2D, maxPooling2D, and dense layers to diagnose and classify. According to the dataset from Kaggle, a 4-class dataset has been used in this study to diagnose Alzheimer's disease. According to the Alzheimer's MRI dataset, the disease has been classified as nondemented, moderate demented, mild demented, and very mild demented, respectively.  The proposed model has been trained using CNN. The number of layers and dropout rate have been used as performance metrics. In our study, activation Leaky ReLU was used. The SMOTE technique has been used to oversample the available data. This study's classification results will help experts make the right decisions. With F1Score, accuracy, recall, and precision values, 96.35% success was achieved in the CNN model. Different CNN methods can be used to advance these studies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33969/ais.2023050104"
    },
    {
        "id": 26303,
        "title": "A Retrospective Study on Classifying Gait Signals Using Entropy Measures",
        "authors": "Wael Suliman, Vinayakumar Ravi, Tuan D. Pham",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tencon58879.2023.10322319"
    },
    {
        "id": 26304,
        "title": "An integrative machine learning framework for classifying SEER breast cancer",
        "authors": "P. Manikandan, U. Durga, C. Ponnuraja",
        "published": "2023-4-1",
        "citations": 10,
        "abstract": "AbstractBreast cancer is the commonest type of cancer in women worldwide and the leading cause of mortality for females. The aim of this research is to classify the alive and death status of breast cancer patients using the Surveillance, Epidemiology, and End Results dataset. Due to its capacity to handle enormous data sets systematically, machine learning and deep learning has been widely employed in biomedical research to answer diverse classification difficulties. Pre-processing the data enables its visualization and analysis for use in making important decisions. This research presents a feasible machine learning-based approach for categorizing SEER breast cancer dataset. Moreover, a two-step feature selection method based on Variance Threshold and Principal Component Analysis was employed to select the features from the SEER breast cancer dataset. After selecting the features, the classification of the breast cancer dataset is carried out using Supervised and Ensemble learning techniques such as Ada Boosting, XG Boosting, Gradient Boosting, Naive Bayes and Decision Tree. Utilizing the train-test split and k-fold cross-validation approaches, the performance of various machine learning algorithms is examined. The accuracy of Decision Tree for both train-test split and cross validation achieved as 98%. In this study, it is observed that the Decision Tree algorithm outperforms other supervised and ensemble learning approaches for the SEER Breast Cancer dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-32029-1"
    }
]