[
    {
        "id": 9905,
        "title": "Algorithm Analysis of Trade Gravity Model Based on PageRank Algorithm",
        "authors": "Jiayi Chen",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00043"
    },
    {
        "id": 9906,
        "title": "Research on I-PageRank algorithm model of Process knowledge graph based on K-Shell decomposition algorithm",
        "authors": "Yanwei Huo, Hongyu Cheng",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00082"
    },
    {
        "id": 9907,
        "title": "Retracted: Internet Tourism Resource Retrieval Using PageRank Search Ranking Algorithm",
        "authors": " Complexity",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9758761"
    },
    {
        "id": 9908,
        "title": "Design and Algorithm Implementation of Visualization Platform to Promote Enterprise Listing Based on E-commerce Big Data Analysis Based on Quantum PageRank Algorithm",
        "authors": "",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1212.1003"
    },
    {
        "id": 9909,
        "title": "Rank NBA teams with Event-Driven PageRank Algorithm",
        "authors": "Liyuan Fan, Liming He",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3624288.3624292"
    },
    {
        "id": 9910,
        "title": "Comprehensive assessment of cable-stayed bridge based on Pagerank algorithm",
        "authors": "Ying Liu, Bing Wang, Xiaoling Liu",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "AbstractThis paper develops an improved structural health assessment method for cable-stayed bridge to address the issue of neglecting component correlations in existing assessment standards. Firstly, the directed graph of fault transmission between components in the cable-stayed bridge system was constructed. The Pagerank algorithm was used to analyze the degree of correlation between these components, and then the influencing degree of and the influenced degree of each component were determined. Secondly, considering the failure rate of individual components and the influenced degree of other component faults, a condition evaluation method with component correlation for cable-stayed bridge was proposed. Finally, the improved assessment method was applied to a super large-span steel cable-stayed bridge as a case study and compared with the relevant assessment specifications. The results show that main girder alignment, cable force and main tower alignment have a greater degree of correlation with other components and are important indicators for bridge health monitoring. Visual inspection of main girder and bridge bearing are the fault appearance components and should be paid attention to in preventive maintenance. The drainage system and electromechanical facilities are the fault source components and must be kept in good condition in daily inspections. The proposed method considers the interrelationships among components more comprehensively and can provide more reliable bridge health assessment results to support bridge maintenance decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s43251-023-00111-3"
    },
    {
        "id": 9911,
        "title": "DETECTING AND ANALYSIS THIRD PARTY TRACKING ON THE WEB USING A PAGERANK ALGORITHM",
        "authors": "",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46646"
    },
    {
        "id": 9912,
        "title": "Weighted PageRank Algorithm Search Engine Ranking Model for Web Pages",
        "authors": "S. Samsudeen Shaffi, I. Muthulakshmi",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.031494"
    },
    {
        "id": 9913,
        "title": "Art appreciation model design based on improved PageRank and ECA-ResNeXt50 algorithm",
        "authors": "Hang Yang, Jingyao Chen",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Image sentiment analysis technology can predict, measure and understand the emotional experience of human beings through images. Aiming at the problem of extracting emotional characteristics in art appreciation, this article puts forward an innovative method. Firstly, the PageRank algorithm is enhanced using tweet content similarity and time factors; secondly, the SE-ResNet network design is used to integrate Efficient Channel Attention (ECA) with the residual network structure, and ResNeXt50 is optimized to enhance the extraction of image sentiment features. Finally, the weight coefficients of overall emotions are dynamically adjusted to select a specific emotion incorporation strategy, resulting in effective bimodal fusion. The proposed model demonstrates exceptional performance in predicting sentiment labels, with maximum classification accuracy reaching 88.20%. The accuracy improvement of 21.34% compared to the traditional deep convolutional neural networks (DCNN) model attests to the effectiveness of this study. This research enriches images and texts’ emotion feature extraction capabilities and improves the accuracy of emotion fusion classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1734"
    },
    {
        "id": 9914,
        "title": "Evaluation of Taekwondo Players' Ranking Using the PageRank Algorithm",
        "authors": "Hai-Lian Sun, Seong-no Lee, Man-Keun Kim,  ",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "The purpose of this study is to apply the Olympic Kyorugi Ranking system and PageRank algorithm to the results of four world-class taekwondo competitions held from 2020 to 2023, including G20, G14, G10, and G6, to calculate the rankings. Based on the results, a comparison between the two algorithms is conducted to provide basic information for taekwondo ranking calculation methods. For the purpose of this study, information was collected from the official website of the World Taekwondo Federation. Use MS-Excel, PyCharm, and IBM SPSS (ver. 27) programs to process data. The results of this study are as follows. Firstly, using the PageRank algorithm, the gender and weight rankings of taekwondo athletes can be calculated. Secondly, using the PageRank system for ranking calculation is more suitable for considering the relative performance of players than using the Olympic Kyorugi Ranking system for ranking calculation. Thirdly, the ranking consistency calculated using the Olympic Kyorugi Ranking system and PageRank system is relatively low.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18789/jwstc.2023.40.19"
    },
    {
        "id": 9915,
        "title": "Medication Knowledge Graph Analysis Using the PageRank Algorithm",
        "authors": "S.M.Shamimul Hasan, Alina Peluso, Heidi A. Hanson, Anuj J. Kapadia",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00082"
    },
    {
        "id": 9916,
        "title": "PageRank Algorithm Based on Dynamic Damping Factor",
        "authors": "Zheng HaoLin, Hu Jin, Li WeiKai",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsi58851.2023.10303849"
    },
    {
        "id": 9917,
        "title": "Research on PageRank Based Core User Classification Algorithm for Digital Marketing",
        "authors": "Jie Yang",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceib57887.2023.10170524"
    },
    {
        "id": 9918,
        "title": "MHPR: Identification of Key Nodes in Multilayer Heterogeneous Combat Network Based on Improved PageRank Algorithm",
        "authors": "Chaoqing Xiao, Lina Lu, Chengyi Zeng, Jing Chen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451431"
    },
    {
        "id": 9919,
        "title": "A Structural and Semantic Evaluation Method for Social Media Datasets Based on PageRank Algorithm with Cluster Analysis",
        "authors": "Xinwei Yuan",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00065"
    },
    {
        "id": 9920,
        "title": "Enhancing a User Matchmaking Algorithm using Personalized PageRank",
        "authors": "Santipong Thaiprayoon, Herwig Unger",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3639233.3639346"
    },
    {
        "id": 9921,
        "title": "PageRank Centrality Computation Using Gradient Descent Algorithm",
        "authors": "Su-Ling Lee, Chien-Cheng Tseng",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecice59523.2023.10383107"
    },
    {
        "id": 9922,
        "title": "Retracted: PageRank Topic Finder based Algorithm for Multimedia Resources in Preschool Education",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9867326"
    },
    {
        "id": 9923,
        "title": "Implementation of PageRank Algorithm for Visualization and Weighting of Keyword Networks in Scientific Papers",
        "authors": "Adyanata Lubis",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47738/jads.v4i4.138"
    },
    {
        "id": 9924,
        "title": "Improved Key Node Recognition Method of Social Network Based on PageRank Algorithm",
        "authors": "Lei Hong, Yiji Qian, Chaofan Gong, Yurui Zhang, Xin Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.029180"
    },
    {
        "id": 9925,
        "title": "Retracted: SM-PageRank Algorithm-Based User Interest Model for Mobile Smart Tourism Platform",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9850362"
    },
    {
        "id": 9926,
        "title": "Importance Identification of Distribution Network Nodes based on Improved PageRank Algorithm",
        "authors": "Zhou Zhu, Zhifeng Qiu, Yanan Zhao",
        "published": "2023-1-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsie55183.2023.10175255"
    },
    {
        "id": 9927,
        "title": "An improved risk prioritization method for propulsion system based on heterogeneous information and PageRank algorithm",
        "authors": "Zhen Hua, Liguo Fei, Xiaochuan Jing",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118798"
    },
    {
        "id": 9928,
        "title": "Association of the PageRank algorithm with similarity-based methods for link prediction in complex networks",
        "authors": "Mourad Charikhi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2024.129552"
    },
    {
        "id": 9929,
        "title": "PageRank talent mining algorithm of power system based on cognitive load and DPCNN",
        "authors": "Kan Feng, Changliang Yang, Wenqiang Zhu, Kun Li, Ya Chen",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractPageRank talent mining in power system is an effective means for enterprises to recruit talents, which can correctly recommend talents in practical applications. At present, the mining evaluation index system is not perfect, and the consistency coefficient between the evaluation results and the actual situation is low in practical applications. Therefore, PageRank talent mining algorithm in power system based on cognitive load and dilated convolutional neural network (DPCNN) is proposed. The cognitive load and DPCNN are used to establish a talent capability evaluation system, calculate the index weight value, construct the PageRank talent capability evaluation model of the power system according to the corresponding weight of the index, determine the membership range of the index, calculate the comprehensive score of the appraiser's ability, and determine the ability level of the appraiser, thus realizing the PageRank talent mining algorithm of the power system. The experimental results show that the algorithm has high accuracy and objectivity, good encryption effect, cannot crack the attack node, the prediction error and the prediction relative error are closest to the standard value, the maximum error is 0.51, the maximum relative error is 0.82, and can achieve the accurate prediction of talent demand.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/cmu2.12721"
    },
    {
        "id": 9930,
        "title": "Research on Search Engine Optimization Strategies Based on Google Algorithm",
        "authors": "Fan Zhang",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csat61646.2023.00151"
    },
    {
        "id": 9931,
        "title": "GPPR: Geo-distributed Personalized PageRank Algorithm",
        "authors": "Zijun Chen,  , Delong Ma, Yishu Wang, Ye Yuan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21655/ijsi.1673-7288.00320"
    },
    {
        "id": 9932,
        "title": "Research on identification of key processes in machining process based on PageRank algorithm",
        "authors": "Dongyue Qu, Chao Li, Chaoyun Gu, Yuzhi Yao, Yong Zhan",
        "published": "2024-2",
        "citations": 0,
        "abstract": " Aiming at the difficulty of quantitatively evaluating the critical processes in the manufacturing process of complex mechanical products, a critical process identification method based on the PageRank algorithm is proposed with the goal of identifying key processes in the machining process. Based on the complex network theory, the error transfer network model of the machining process is established in this paper. Adopting the actual machining process as the data set of the complex network, the weights of the machining feature nodes are calculated by the PageRank ranking algorithm, and the nodes are ranked according to the weight values to assess the influence and importance of the nodes in the network model. Finally, taking the connecting rod machining process of a medium-speed marine diesel engine as an example, the results show that the method can quickly and effectively identify the key processes in the machining process. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/16878132241229988"
    },
    {
        "id": 9933,
        "title": "Research on Transmission Relationship of Grid Green Development Assessment Indicators Based on Improved PageRank ISM Big Data Algorithm",
        "authors": "Jihong Ye, Han Chen, Maojie Lai, Yinan Li, Hanxing Lin, Wenxin Chen, Bo Li",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbta60381.2023.00029"
    },
    {
        "id": 9934,
        "title": "Extending the Adapted PageRank Algorithm centrality model for urban street networks using non-local random walks",
        "authors": "David Bowater, Emmanuel Stefanakis",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.amc.2023.127888"
    },
    {
        "id": 9935,
        "title": "Application of the C4.5 Algorithm to Predict the Effectiveness of Google Adwords Ads",
        "authors": "Aditya Gusti, Sri Hadianti",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32520/stmsi.v12i1.1978"
    },
    {
        "id": 9936,
        "title": "Experimental comparison of PageRank vector calculation algorithms",
        "authors": "Daniel  A Skachkov, Sergey  I Gladyshev, Andrei Mikhailovich Raigorodsky",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20537/2076-7633-2023-15-2-369-379"
    },
    {
        "id": 9937,
        "title": "Дистанційне навчання, Google calendar, Google Slides, Google Docs, Google Chat.",
        "authors": "М. В. Яцко",
        "published": "2023-4-29",
        "citations": 22,
        "abstract": "Сучасний стан розвитку вищої освіти, під дією світової пандемії COVID-19, повномасштабного збройного вторгнення в Україну, перебуває в режимі дистанційного навчання. Так, поряд із класичними формами навчання, в широку практику входить дистанційне, що має свої переваги, та в певний момент часу є адекватною відповіддю на зовнішні обставини.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59948/osou4.2023.02"
    },
    {
        "id": 9938,
        "title": "Detection approach for unusable shared bikes enabled by reinforcement learning and PageRank algorithm",
        "authors": "Yu Zhou, Ran Zheng, Gang Kou",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jnlssr.2023.02.001"
    },
    {
        "id": 9939,
        "title": "Parallel Implementation of Statistical DBSCAN Algorithm for Spark-based Clustering on Google Cloud Platform",
        "authors": "",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0430.23"
    },
    {
        "id": 9940,
        "title": "A Method for Assessing the Security of Energy Trading Data Based on Big Data and the Pagerank Algorithm",
        "authors": "Weibin Ding, Deqi Zhang, Junjia Yang, Yanzuo Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.19-5-2023.2334237"
    },
    {
        "id": 9941,
        "title": "Pagerank SEO Algorithm : Issues, Complexity and Implementation",
        "authors": "Mpemba Ngoma Luz -, Kanyinda Kayembe Kam's -, Mayala Lemba Francis -, Likotelo Binene Camile -, Engombe Wedi Boniface -, Nsumbu Lukamba Telesphore -, Mbikayi Mpanya Jean Marcel -, Nlandu Ngunda Jean -, Mande Kumwimba Hydryce -, Balanga Koko Joe -",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "Today, the Internet users need an optimal search for information on the web. The display of web pages within a search engine is not a mystery. This implies good mathematical modeling and good knowledge of computer science for its implementation. The web is a directed graph that must be exploited. The matrices of its graph contain a structure of the links and the navigation of the Internet user. Considering the billions of hosted websites and the dynamism of the web, its links can be added at any time. Changing this link structure impacts the PageRank. Thus, for good stability, the algorithms must be improved.  PageRank algorithm that displays a good web page Search Engine Optimization (SEO) taking into account the score of each page, pay attention to many researches that make improvements day by day. Even though it is a basic formula, the PageRank algorithm makes a successful business. In this paper, we had not only implemented this algorithm in python but also explain how it works and calculated its complexity",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i02.2147"
    },
    {
        "id": 9942,
        "title": "Estimating the frequencies of vibration signals using a machine learning algorithm with explained predictions",
        "authors": "Daniela Giorgiana Burtea, Gilbert-Rainer Gillich, Cristian Tufisi",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Signals of short duration and containing a small number of cycles require special procedures if the precise estimation of their frequencies is intended. In this paper, we present an algorithm that allows accurate estimation of frequencies and simultaneously explains the decision regarding the prediction made. We first show why predictions regarding the frequency of signals mentioned above can contain significant errors and the prediction dependency on the analysis time. We then prove that the errors are systematic, and it is possible to train a neural network to quantify the errors and later correct the predictions. The algorithm also indicates the level of error by analyzing the signal-to-noise ratio. The algorithm was tested for numerous similar cases and proved to be reliable. At the end of the paper, we present how to use the algorithm using a signal generated with a known frequency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21595/vp.2023.23678"
    },
    {
        "id": 9943,
        "title": "Ant Colony Optimization with Simulated Annealing Algorithm for Google Maps",
        "authors": "Jai Keerthy Chowlur Revanna, Nushwan Yousif Baithoon Al-Nakash",
        "published": "2023-3-17",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaccs57279.2023.10112798"
    },
    {
        "id": 9944,
        "title": "IMPACT ON WEBSITE TRAFFIC DUE TO GOOGLE ALGORITHM UPDATE",
        "authors": " Netra Surana,  Dr. Deepali M. Gala,  Dr. Rajesh U. Kanthe",
        "published": "2023-1-28",
        "citations": 0,
        "abstract": "Search engine optimization is a digital marketing technique that helps you gain website traffic and website rankings. Over the years, SEO has evolved with future needs. However, webmasters have also found various loopholes that help them gain rankings on search engines. Google is well aware of that, which is why it constantly updates its algorithm to filter out the websites that use SEO tactics that are not in compliance with search engine best practices. For this purpose, it is important to understand Googles Algorithm and what it values, so that we can tailor our marketing strategy, and provide value to the users. For this purpose, in this research paper, we understand the factors that the algorithm considers before ranking websites or web pages in the top results. We also take a look at the important algorithm updates that have been rolled out in the past, and how they have impacted website traffic, and rankings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36713/epra12259"
    },
    {
        "id": 9945,
        "title": "A method for assessing the productivity trends of collective scientific subjects based on the modified PageRank algorithm",
        "authors": "Yurii Andrashko, Oleksandr Kuchanskyi, Andrii Biloshchytskyi, Oleksandr Pohoriliak, Myroslava Gladka, Ganna Slyvka-Tylyshchak, Dmytro Khlaponin, Ivan Chychkan",
        "published": "2023-2-28",
        "citations": 2,
        "abstract": "The task of calculating the productivity of collective scientific subjects is a relevant issue in scientometrics. This study formalized the problem of assessing productivity trends of collective scientific subjects. The TWPR-CI method for calculating the performance based on the modified PageRank algorithm is described. Formulas for calculating productivity have been derived that make it possible to take into account a change in the productivity of collective scientific subjects over time. The indicators of the basic average absolute change in performance and the chain average relative change in performance were chosen as the basis. To select promising, from the point of view of scientific work, collective subjects, preference is given to those whose basic average absolute change in productivity is positive or the chain average relative change in productivity exceeds unity. Verification of the method for assessing performance trends of collective scientific entities based on the modified PageRank algorithm using the public dataset Citation Network Dataset was carried out. The dataset includes more than 5 million scientific publications and 48 million citations. The citation of scientific publications of 27,500 collective scientific subjects for the period from 2000 to 2022 was analyzed. For this period, for 15 selected collective scientific subjects, performance is calculated using the TWPR-CI method, as well as estimates of productivity trends based on their average relative change. There are three classes of collective scientific subjects according to productivity trends. The results indicate the relevance of the proposed method for quantifying the productivity trends of collective scientific entities (higher education institutions, scientific institutes, laboratories, and other institutions engaged in scientific activities)",
        "keywords": "",
        "link": "http://dx.doi.org/10.15587/1729-4061.2023.273929"
    },
    {
        "id": 9946,
        "title": "Analisis Sentimen Tempat Wisata Berdasarkan Ulasan pada Google Maps Menggunakan Algoritma Support Vector Machine",
        "authors": "Joang Ipmawati, Saifulloh Saifulloh, Kusnawi Kusnawi",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "Era Revolusi Industri 4.0 ditandai oleh ketersediaan data yang melimpah, menciptakan peluang dalam proses pengambilan informasi. Salah satu proses pengambilan data tersebut mencakup pencarian informasi tentang tempat wisata di Yogyakarta (DIY). Proses pengambilan informasi ini dapat dilakukan melalui Google Maps, yang menyediakan detail seperti lokasi, jarak, bahkan ulasan pengunjung dalam bagian komentar, yang berasal dari ulasan tentang destinasi wisata tersebut. Dalam data informasi yang dikumpulkan, muncul berbagai masalah yang memerlukan identifikasi, mengarah pada gagasan penelitian untuk menganalisis sentimen terkait destinasi wisata dengan memanfaatkan ulasan pengguna di Google Maps. Metodologi penelitian yang digunakan dalam studi ini menggunakan Support Vector Machine (SVM) untuk mengategorikan ulasan ke dalam kategori sentimen positif, negatif, atau netral. Ulasan pengguna dari platform Google Maps diolah dan dilatih menggunakan SVM untuk mengidentifikasi pola sentimen. Hasil eksperimen menunjukkan efektivitas metode SVM dalam mengelola volume besar data ulasan untuk analisis sentimen, memberikan pemahaman yang lebih dalam tentang persepsi masyarakat terhadap destinasi wisata. Penelitian ini dapat berkontribusi pada pengembangan strategi pemasaran dan manajemen berdasarkan umpan balik pengguna secara real-time. Temuan penelitian mengenai kinerja metode SVM dalam klasifikasi analisis sentimen menggunakan Support Vector Machine (SVM) menunjukkan tingkat akurasi rata-rata sebesar 83,8% berdasarkan ulasan pengunjung di situs Google Maps.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i1.1066"
    },
    {
        "id": 9947,
        "title": "Genetic Algorithm Application in Route Optimization Using Google Maps API",
        "authors": "Ivan Hintoro, Sandy Kosasi, David David, Susanti Margaretha Kuway, Gat Gat",
        "published": "2023-7-25",
        "citations": 0,
        "abstract": "Route planning from several locations is a common problem encountered. Google Maps provides a feature to plan routes from multiple location but does not provide a feature to find the optimal route from these locations. Based on the survey, 61.9% of respondents have a low level of confidence when planning the optimal route from several locations. So we need software that can help in planning the route. This research utilizes genetic algorithms to help plan routes from several locations. The genetic algorithm used includes components in the form of chromosomes, fitness values, selection, crossover, and mutations. In addition, Google Maps API used as the data source that provides maps, directions, and distance matrices. The design method used extreme programming. The software is made using HTML, CSS, PHP, and JavaScript programming languages with MySQL DBMS. In addition, Black-box and White-box testing method is used in this research. The results of this study are route optimization software that works by using genetic algorithm components to obtain optimal route from several locations with the advantages of using Google Maps API and selecting location points and starting points that are flexible. This study aims to highlight the benefits, limitations, and future prospects of route optimization. The findings of this research will contribute to assist decision-makers in adopting effective strategies related to route optimization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33050/ccit.v16i2.2603"
    },
    {
        "id": 9948,
        "title": "Late Breaking Results: An Efficient Bridge-based Compression Algorithm for Topologically Quantum Error Corrected Circuits",
        "authors": "Wei-Hsiang Tseng, Yao-Wen Chang",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dac56929.2023.10247656"
    },
    {
        "id": 9949,
        "title": "Reliability modeling for failure correlations to a CNC lathe subsystem based on Pagerank Algorithm",
        "authors": "Dongwei Gu, Jin Guo, Wenbo Han, Song Gao, Xilu Zhao, Zhen Xu",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/08982112.2023.2208664"
    },
    {
        "id": 9950,
        "title": "Traveling Salesman Problem Multi-destination Route Recommendation System Using Genetic Algorithm and Google Maps API",
        "authors": "Catharina Adinda Mega Cahyani, Trianggoro Wiradinata",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5120/ijca2023922907"
    },
    {
        "id": 9951,
        "title": "Trustworthiness and Pagerank on the Ethereum Blockchain: Technical Report",
        "authors": "Scott Imig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4590362"
    },
    {
        "id": 9952,
        "title": "Extrapolated splitting methods for multilinear PageRank computations",
        "authors": "Maryam Boubekraoui",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apnum.2023.11.019"
    },
    {
        "id": 9953,
        "title": "Identification of Critical Nodes in Power Grid Based on Improved PageRank Algorithm and Power Flow Transfer Entropy",
        "authors": "Jinhui Zeng, Yisong Wu, Jie Liu, Dong He, Zheng Lan",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Identifying critical nodes in the power grid is a crucial aspect of power system security and stability analysis. However, the current methods for identification fall short in fully accounting for the power transfer characteristics between nodes and the consequences of node removal on the security and stability of power grid operation. To enhance the effective and accurate identification of critical nodes in the power grid, a method is proposed. This method is based on improved PageRank algorithm and node-weighted power flow transfer entropy, referred to as IPRA-PFTE. Firstly, based on the power flow and equivalent impedance between nodes, and the introduction of virtual nodes, an improved PageRank algorithm is obtained. Then the node-weighted power flow transfer entropy is derived by considering the uniformity of the transfer power flow distribution in the system following the removal of a node. Finally, the importance of nodes is obtained by combining the improved PageRank algorithm with the node-weighted power flow transfer entropy. The method’s effectiveness and accuracy are validated through simulation using the IEEE 39-bus example and subsequent comparison with existing methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13010184"
    },
    {
        "id": 9954,
        "title": "A distributed PageRank-based dynamic partition algorithm to improve distributed energy storages participation in frequency regulation",
        "authors": "Yujun Lin, Xuanang Lei, Qiufan Yang, Jianyu Zhou, Xia Chen, Jinyu Wen",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijepes.2023.109105"
    },
    {
        "id": 9955,
        "title": "Overlapping community detection in software ecosystem based on pheromone guided personalized PageRank algorithm",
        "authors": "Simin Wang, Xiangjuan Yao, Dunwei Gong, Huijie Tu",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.infsof.2023.107283"
    },
    {
        "id": 9956,
        "title": "Effects of Using Arabic Web Pages in Building Rank Estimation Algorithm for Google Search Engine Results Page",
        "authors": "Mohamed Almadhoun, Nurul Malim",
        "published": "2023",
        "citations": 1,
        "abstract": "Search Engine Optimization (SEO) aims to improve a website's reputation and user experience. Without effective SEO strategies, it requires significant investment in paid advertisements. Search Engines (SEs) use algorithms to rank results, assessing on-page and off-page factors for relevance. Machine learning techniques have been used to build classifiers for estimating page rank. However, no research has compared rank estimation with other languages or analyzed the effects of different languages on performance or differences between SEO factors. The study aims to improve rank estimation algorithms for Arabic web pages on desktop devices using a new multi-category dataset from Google Search Engine Results Page (SERP). The experimental findings suggest that Arabic web pages are more suitable than English ones for training a model to estimate the ranking of Arabic web pages. Machine learning models were applied to two datasets. SE scraping was used to collect URLs, descriptions, and other data from the Google SE. Data preprocessing steps were taken before using the datasets for rank estimation algorithms. Experiments were conducted to assess the implications of using Arabic and English web page datasets",
        "keywords": "",
        "link": "http://dx.doi.org/10.34028/iajit/20/6/15"
    },
    {
        "id": 9957,
        "title": "A novel training methodology for phase segmentation of steel microstructures using a deep learning algorithm",
        "authors": "Nikhil Chaurasia, Shikhar Krishn Jha, Sandeep Sangal",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mtla.2023.101803"
    },
    {
        "id": 9958,
        "title": "A Google Earth Engine Algorithm to Map Phenological Metrics in Mountain Areas Worldwide with Landsat Collection and Sentinel-2",
        "authors": "Tommaso Orusa, Annalisa Viani, Duke Cammareri, Enrico Borgogno Mondino",
        "published": "2023-2-21",
        "citations": 15,
        "abstract": "Google Earth Engine has deeply changed the way in which Earth observation data are processed, allowing the analysis of wide areas in a faster and more efficient way than ever before. Since its inception, many functions have been implemented by a rapidly expanding community, but none so far has focused on the computation of phenological metrics in mountain areas with high-resolution data. This work aimed to fill this gap by developing an open-source Google Earth Engine algorithm to map phenological metrics (PMs) such as the Start of Season, End of Season, and Length of Season and detect the Peak of Season in mountain areas worldwide using high-resolution free satellite data from the Landsat collection and Sentinel-2. The script was tested considering the entire Alpine chain. The validation was performed by the cross-computation of PMs using the R package greenbrown, which permits land surface phenology and trend analysis, and the Moderate-Resolution Imaging Spectroradiometer (MODIS) in homogeneous quote and land cover alpine landscapes. MAE and RMSE were computed. Therefore, this algorithm permits one to compute with a certain robustness PMs retrieved from higher-resolution free EO data from GEE in mountain areas worldwide.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/geomatics3010012"
    },
    {
        "id": 9959,
        "title": "Plagiarism Checker &amp; Link Advisor using concepts of Levenshtein Distance Algorithm with Google Query Search - An Approach",
        "authors": "Dhanraj Arvind Nandurkar, Priyanka Ujjainkar, Bhakti Miglani, Ayush Kanojiya",
        "published": "2023-1-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc56366.2023.10085404"
    },
    {
        "id": 9960,
        "title": "Analysis of Sentiment Adiraku App Reviews on Google Play Store Using Vector Machine Support Algorithm and Naïve Bayes",
        "authors": "Bayu Padilah, Adi Rizky Pratama, Ayu Ratna Juwita",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "The Adiraku application is considered to be able to facilitate and facilitate customers so that there is no need to come to the branch office to get information related to the number of installments that must be paid, due dates, credit simulations, and Adira Finance information offers to customers. A large number of reviews from users received makes it difficult for developers to read them, it will take too much time and effort if they have to read and analyze them manually. To find out which reviews are classified as positive or negative reviews. need a sentiment analysis of the review.  This study aims to find out how the opinions or opinions of its users on the services of the application, by analyzing these sentiments through a classification process using two algorithms, namely Support Vector Machine and Naïve Bayes. The data used amounted to 2000 data obtained from Google Playstore. Data is labeled into 2 classes namely positive class and negative. Furthermore, the data is divided into 70% training data and 30% testing data and methods used for testing using Bernoulli Naïve Bayes and Linear Kernel.  It was concluded that the number of user reviews of the Adiraku application on the Google Play Store showed more positive comments, amounting to 1412 positive and negative reviews, which was 588 reviews.  The Support Vector Machine algorithm performs better by getting the best accuracy value of 96%, while the Naïve Bayes algorithm gets an accuracy value of 85%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38101/sisfotek.v13i1.2943"
    },
    {
        "id": 9961,
        "title": "The Algebraic Approach: The Double Slit Experiment Explained",
        "authors": "",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "We present a new vision on the double-slit experiment (DSE) that does not use any waves or the so-called waveparticle duality. It is based on particles, viewed as localized vibrations. Rather than being illogical, or mysterious, the approach reproduces logically the interference patterns observed externally, using the well-known “amplification of stimulated emission” (ASE). The conservation of particle number is not observed. Different particles can present ASE with in-phase or counter phase behavior, making the patterns observed for electrons, other particles, even atoms. The Law of the Excluded Middle (LEM) is not broken illogically in two-states macroscopically, but broken naturally in three or more states, microscopically, using ASE. Any particle supporting ASE, in-phase or counter-phase, can enter a DSE, and provide an external interference pattern. Frequency plays a role, while amplitude is not considered. This work is important in quantum computing, possibly saving cost, time, and welcoming more participants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.02.05"
    },
    {
        "id": 9962,
        "title": "Extrapolation methods for multilinear PageRank",
        "authors": "Abdeslem Hafid Bentbib, Maryam Boubekraoui, Khalide Jbilou",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11075-024-01823-x"
    },
    {
        "id": 9963,
        "title": "A Data-Driven Strategy for Online Hate Speech Spreader Identification using Modified Pagerank",
        "authors": "Smita Ghosh, Shiv Jhalani",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Social media platforms have become breeding grounds for the dissemination of misinformation and harmful content, including hate speech. This research paper aims to tackle the urgent problem of hate speech circulation on Online Social Networks by primarily focusing on the early identification of users who are prone to spreading it. To achieve this objective, a novel data-driven metric is introduced, referred to as ’Hate Speech Potential’. Additionally, an innovative approach is proposed that leverages a modified version of the PageRank algorithm, termed the ’Hate Speech Potential Rank’ algorithm, to effectively detect and identify malicious users within a network. In a vast network with billions of nodes, the rapid spread of content makes timely detection and mitigation crucial. By assessing a user’s past behaviour of sharing or publishing hate speech, their ’Hate Speech Potential’ can be determined, enabling the identification of sources and spreaders of such content. The modified PageRank algorithm considers both the user’s individual characteristics and the influence of their neighbourhood, thereby capturing a more comprehensive picture of their sharing patterns. A pre-trained machine learning model was employed to accurately classify hate speech posts. By combining the predicted labels and user characteristics and implementing the modified PageRank algorithm, this paper aims to gain deeper insights into the dynamics of information dissemination within a social network, thereby contributing to a better understanding of user sharing behaviour and facilitating the development of effective strategies for addressing hate speech. K-Means clustering was used in experimental evaluations, demonstrating the effectiveness of the proposed approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131916"
    },
    {
        "id": 9964,
        "title": "Endotaxis: A neuromorphic algorithm for mapping, goal-learning, navigation, and patrolling",
        "authors": "Tony Zhang, Matthew Rosenberg, Zeyu Jing, Pietro Perona, Markus Meister",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "An animal entering a new environment typically faces three challenges: explore the space for resources, memorize their locations, and navigate towards those targets as needed. Here we propose a neural algorithm that can solve all these problems and operates reliably in diverse and complex environments. At its core, the mechanism makes use of a behavioral module common to all motile animals, namely the ability to follow an odor to its source. We show how the brain can learn to generate internal “virtual odors” that guide the animal to any location of interest. This endotaxis algorithm can be implemented with a simple 3-layer neural circuit using only biologically realistic structures and learning rules. Several neural components of this scheme are found in brains from insects to humans. Nature may have evolved a general mechanism for search and navigation on the ancient backbone of chemotaxis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7554/elife.84141.3"
    },
    {
        "id": 9965,
        "title": "Generalized quantum PageRank algorithm with arbitrary phase rotations",
        "authors": "Sergio A. Ortega, Miguel A. Martin-Delgado",
        "published": "2023-1-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevresearch.5.013061"
    },
    {
        "id": 9966,
        "title": "Endotaxis: A neuromorphic algorithm for mapping, goal-learning, navigation, and patrolling",
        "authors": "Tony Zhang, Matthew Rosenberg, Zeyu Jing, Pietro Perona, Markus Meister",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "An animal entering a new environment typically faces three challenges: explore the space for resources, memorize their locations, and navigate towards those targets as needed. Here we propose a neural algorithm that can solve all these problems and operates reliably in diverse and complex environments. At its core, the mechanism makes use of a behavioral module common to all motile animals, namely the ability to follow an odor to its source. We show how the brain can learn to generate internal “virtual odors” that guide the animal to any location of interest. This endotaxis algorithm can be implemented with a simple 3-layer neural circuit using only biologically realistic structures and learning rules. Several neural components of this scheme are found in brains from insects to humans. Nature may have evolved a general mechanism for search and navigation on the ancient backbone of chemotaxis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7554/elife.84141"
    },
    {
        "id": 9967,
        "title": "Automatic detection of water surfaces using K-means++ clustering algorithm with Landsat-9 and Sentinel-2 images on the Google Earth Engine Platform",
        "authors": "Osman Salih YILMAZ",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Water is the most essential requirement for sustaining the life cycle on Earth. These resources are constantly dynamic due to anthropogenic and climatological effects. Therefore, management and consistent water policies are necessary to be followed for the proper management of water resources. Monitoring water resources is possible by accurately determining the water surface boundaries and determining the change in water surface areas. In this context, the normalized difference water index (NDWI) and modified normalized difference water index (MNDWI) were computed using JavaScript on the Google Earth Engine through Landsat-9 and Sentinel-2 satellite images. Water pixels were extracted d from other details using the K-means++ cluster algorithm based on the calculated indices. The water surfaces were determined using the Otsu thresholding method, which is the most preferred method for the NDWI and MNDWI indices calculated from the Sentinel images and was used as verification data. The K-means++ clustering algorithm yielded successful results in detecting water surfaces. In the two indices used, the NDWI index was found to be more successful than the MNDWI index. For Landsat-9 images, OA, Kappa, and F1-scores in the NDWI index were calculated as 99.72%, 0.994, and 99.57%, respectively. The OA, Kappa, and F1-scores in the NDWI index for Sentinel-2 images were calculated as 99.39%, 0.986, and 99.04%, respectively. This study demonstrated that clustering algorithms can be successfully applied to automatically detect water surfaces.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30516/bilgesci.1262550"
    },
    {
        "id": 9968,
        "title": "Improved centrality measure based on the adapted PageRank algorithm for urban transportation multiplex networks",
        "authors": "Zhitao Li, Jinjun Tang, Chuyun Zhao, Fan Gao",
        "published": "2023-2",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chaos.2022.112998"
    },
    {
        "id": 9969,
        "title": "Improving variant calling using population data and deep learning",
        "authors": "Nae-Chyun Chen, Alexey Kolesnikov, Sidharth Goel, Taedong Yun, Pi-Chuan Chang, Andrew Carroll",
        "published": "2023-5-12",
        "citations": 1,
        "abstract": "AbstractLarge-scale population variant data is often used to filter and aid interpretation of variant calls in a single sample. These approaches do not incorporate population information directly into the process of variant calling, and are often limited to filtering which trades recall for precision. In this study, we develop population-aware DeepVariant models with a new channel encoding allele frequencies from the 1000 Genomes Project. This model reduces variant calling errors, improving both precision and recall in single samples, and reduces rare homozygous and pathogenic clinvar calls cohort-wide. We assess the use of population-specific or diverse reference panels, finding the greatest accuracy with diverse panels, suggesting that large, diverse panels are preferable to individual populations, even when the population matches sample ancestry. Finally, we show that this benefit generalizes to samples with different ancestry from the training data even when the ancestry is also excluded from the reference panel.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12859-023-05294-0"
    },
    {
        "id": 9970,
        "title": "Twin Primes Segmented Sieve of Zakiya (SSoZ) Explained",
        "authors": "",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "In 2014 I released The Segmented Sieve of Zakiya (SSoZ) [1]. It described a general method to find primes using an efficient prime sieve based on Prime Generators (PG).",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jctcsr.02.02.16"
    },
    {
        "id": 9971,
        "title": "Node-Centric Random Walk for Fast Index-Free Personalized PageRank",
        "authors": "Kohei Tsuchida, Naoki Matsumoto, Kunitake Kaneko",
        "published": "2023-1-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoin56518.2023.10049056"
    },
    {
        "id": 9972,
        "title": "A Speedup Method for Iterative Computation of Pagerank Centrality",
        "authors": "Chien-Cheng Tseng, Su-Ling Lee",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226913"
    },
    {
        "id": 9973,
        "title": "Workshop Google Mail, Google Drive, and Google Meet at HIMPAUDI  Grobogan Regency",
        "authors": "Henoch Juli Christanto,  Julius Victor Manuel Bata, Denny Jean Cross Sihombing,  Christine Dewi",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Munculnya revolusi industry 4.0 menuntut proses dalam mengolah, memproses, dan memindah data dan informasi dilakukan dengan capat dan efisien. Demikian juga dalam pendidikan, pendidik dituntut untuk memahami dan menggunakan perkembangan teknologi yang ada untuk meningkatkan mutu dan kualitas pendidikan. Namun dalam kenyataannya di Indonesia tidak semua pendidik tanggap teknologi. Akibatnya pemrosesan data dan informasi menjadi lambat dan sering menjadi masalah yang serius bila berkaitan dengan kebijakan pemerintah yang membutuhkan system terpusat. Pelatihan dasar teknologi seperti penggunaan Google Mail, Google Drive, dan Google Meet sangat dibutuhkan. Dengan adanya pelatihan ini dihasilkan bahwa para pendidik dapat menggunakan teknologi untuk birokrasi yang ada dan semakin tanggap akan teknologi sehingga kegiatann pendidik yang ada terkhususnya dalam HIMPAUDI dapat semakin produktif.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25170/mitra.v7i2.4222"
    },
    {
        "id": 9974,
        "title": "Google Scholar University Ranking Algorithm to Evaluate the Quality of Institutional Research",
        "authors": "Noor Ul Sabah, Muhammad Murad Khan, Ramzan Talib, Muhammad Anwar, Muhammad Sheraz Arshad Malik, Puteri Nor Ellyza Nohuddin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.037436"
    },
    {
        "id": 9975,
        "title": "A simple rule-based algorithm in Google Earth Engine for operational discrimination of rice paddies in Sefidroud Irrigation Network",
        "authors": "Parastoo Esmaeili, Majid Vazifedoust, Mehran Rahmani, Hadis Pakdel",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12517-023-11770-x"
    },
    {
        "id": 9976,
        "title": "Mangrove species mapping through phenological analysis using random forest algorithm on Google Earth Engine",
        "authors": "Muhammad Ari Purnomo Aji, Muhammad Kamal, Nur Mohammad Farda",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rsase.2023.100978"
    },
    {
        "id": 9977,
        "title": "Parallel Filtered Graphs for Hierarchical Clustering",
        "authors": "Shangdi Yu, Julian Shun",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00153"
    },
    {
        "id": 9978,
        "title": "On-Chain Reputation Ranking by Adaptive Weighted PageRank",
        "authors": "Thuat Do, Dung Do, Linh Nguyen",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rivf60135.2023.10471809"
    },
    {
        "id": 9979,
        "title": "OCR with Google Vision API and Tesseract",
        "authors": "Isabelle Gribomont",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "\n            Google Vision and Tesseract are both popular and powerful OCR tools, but they each have their weaknesses. In this lesson, you will learn how to combine the two to make the most of their individual strengths and achieve even more accurate OCR results.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.46430/phen0109"
    },
    {
        "id": 9980,
        "title": "Cache-Efficient Approach for Index-Free Personalized PageRank",
        "authors": "Kohei Tsuchida, Naoki Matsumoto, Andrew Shin, Kunitake Kaneko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3237738"
    },
    {
        "id": 9981,
        "title": "A Parameterized Multi-Splitting Iterative Method for Solving the PageRank Problem",
        "authors": "Yajun Xie, Lihua Hu, Changfeng Ma",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "In this paper, a new multi-parameter iterative algorithm is proposed to address the PageRank problem based on the multi-splitting iteration method. The proposed method solves two linear subsystems at each iteration by splitting the coefficient matrix, considering therefore inner and outer iteration to find the approximate solutions of these linear subsystems. It can be shown that the iterative sequence generated by the multi-parameter iterative algorithm finally converges to the PageRank vector when the parameters satisfy certain conditions. Numerical experiments show that the proposed algorithm has better convergence and numerical stability than the existing algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11153320"
    },
    {
        "id": 9982,
        "title": "On new PageRank computation methods using quantum computing",
        "authors": "Théodore Chapuis-Chkaiban, Zeno Toffano, Benoît Valiron",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-03856-y"
    },
    {
        "id": 9983,
        "title": "Sentiment Analysis on ChatGPT App Reviews on Google Play Store Using Random Forest Algorithm, Support Vector Machine and Naïve Bayes",
        "authors": "Gilbert Jeffson Sagala, Yusran Timur Samuel",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "This study aims to conduct a Sentiment Analysis on ChatGPT App reviews on the Google Play Store using three classification methods: Random Forest Algorithm, Support Vector Machine (SVM), and Naïve Bayes. The main purpose of this study is to detail and understand user sentiment towards the application. From a total of 2652 review data regarding ChatGPT performance from July 28, 2023, to January 28, 2024, the results were 2326 (87.71%) positive reviews and 326 (12.29%) negative reviews, which means that the public is more dominant in responding positively to the use of ChatGPT based on Google Play Store ratings. In this study, researchers used the f1-score to see which method works best because the data has an imbalance of data, so the f1-score is the best way to provide information about how well the model handles minority classes. Through the classification of three different algorithms with testing data taken from 796 (30%) from a total of 2652 rating reviews, it was found that Random Forest got an f1-score of 90% with positive correct data as much as 87.43% and negative accurate data as much as 0.75%, Support Vector Machine got an f1-score value of 90% with positive valid data as much as 86.80% and negative correct data as much as 0.13%,  and Naïve Bayes received an f1-score of 87% with positive, accurate data of 88.06% and negative valid data of 0.12%. Therefore, it can be concluded from this study that users who experienced the development of the ChatGPT application felt a more striking positive impact, and the Support Vector Machine and Random Forest methods became the most effective methods in this study, proven by the highest f1-score value.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58451/ijebss.v2i04.148"
    },
    {
        "id": 9984,
        "title": "Coastal Water Quality Retrieval Based on Random Forest Coupled with Whale Optimization Algorithm using Sentinel-2 Data from Google Earth Engine",
        "authors": "Hani Ghasemi, Alireza Taheri Dehkordi, Mohsen Jafari, Mohammad Javad Valadan Zoej",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icspis59665.2023.10402692"
    },
    {
        "id": 9985,
        "title": "Sentiment Analysis of DANA Application Reviews on Google Play Store Using Naïve Bayes Classifier Algorithm Based on Information Gain",
        "authors": " Cindy Caterine Yolanda,  Syafriandi Syafriandi,  Yenni Kurniawati,  Dina Fitria",
        "published": "2024-2-25",
        "citations": 0,
        "abstract": "DANA is a digital payment platform that provides various features to make it easier for users to make payments, transfers, and balance replenishment online. DANA application users provide a variety of reviews that include both constructive and critical opinions, which can be valuable input for DANA application developers. The purpose of this research is to evaluate the results of sentiment classification of DANA application user reviews on the Google Play Store service using the Naïve Bayes Classifier method and Information Gain feature selection. In addition, this study aims to assess the effect of applying IG feature selection on the performance of the resulting model. In this study, reviews are divided into two categories, namely positive and negative based on lexicon-based labeling. Furthermore, data weighting, feature selection, and data division are carried out with a proportion of 80% train data and 20% test data before model building. There are two models, namely a model without feature selection (NBC model) and a model with feature selection (NBC-IG model). The evaluation results showed that the NBC model with 1106 features performed well, with 82.91% accuracy, 83.96% precision, and 90.23% recall. Meanwhile, the NBC-IG model with 536 features showed higher performance, with 85.09% accuracy, 85.79% precision, and 92.09% recall. The application of IG feature selection with the IG value limit parameter > 0.01 in the NBC model successfully reduced the number of features by 570, and improved model performance with an increase in accuracy by 2.18%, precision by 1.83%, and recall by 1.86%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24036/ujsds/vol2-iss1/147"
    },
    {
        "id": 9986,
        "title": "LSTM Encoder Decoder Based Text Highlight Abstraction Method Using Summaries Extracted by PageRank",
        "authors": "Turan Goktug Altundogan, Mehmet Karakose",
        "published": "2023-2-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/it57431.2023.10078652"
    },
    {
        "id": 9987,
        "title": "Google Android, Google Shopping and the Digital Markets Act: Three Sides of the Same Countermovement",
        "authors": "Justin Lindeboom",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4544985"
    },
    {
        "id": 9988,
        "title": "IMPROVEMENT OF NAIVE BAYES ALGORITHM IN SENTIMENT ANALYSIS OF SHOPEE APPLICATION REVIEWS ON GOOGLE PLAY STORE",
        "authors": "Khoerotul Melina Elistiana,  Bagus Adhi Kusuma, Pungkas Subarkah, Hasri Akbar Awal Rozaq",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "Reviews of the shopee application on the google play store are included in useful information if processed properly. Old or new users can analyze app reviews to get information that can be used to evaluate services. The activity of analyzing application reviews is not enough just to see the number of stars, it is necessary to see the entire contents of the review comments to be able to know the intent of the review. A sentiment analysis system is a system used to automatically analyze a review to obtain information including sentiment information that is part of an online review. The data is classified using Naive Bayes. A total of 1,000 shopee app user reviews were collected to form the sample dataset.  The purpose of this study is to determine the sentiment analysis of shopee application reviews in the Google Play Store using the Naive Bayes algorithm. The stages of this research include, data collection, labeling, pre-processing, sentiment classification, and evaluation. In the pre-processing stage there are 6 stages, namely Cleaning, Case folding, Word Normalizer, Tokenizing, Stopword Removal and Stemming. TF-IDF (Term Frequency - Inverse Document Frequency) method is used for word weighting. The data will be grouped into two categories, namely negative and positive. The data will then be evaluated using accuracy parameter testing. The test results show an accuracy value of 81%, this result shows that shopee application reviews tend to be negative.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.6.1486"
    },
    {
        "id": 9989,
        "title": "Pagerank Algorithms and Multi-Particle Environments Using Pettingzoo: Network Simulation and Validation",
        "authors": "Yi Li",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "This study introduces and investigates two novel algorithms, namely Topic-Specific Crawling PageRank and Motif-Based PageRank, along with their corresponding application scenarios. The former algorithm focuses on targeted web crawling, refining the collection of web pages relevant to specific topics. The latter algorithm addresses higher-order relationships in citation networks, enhancing insights into researcher influence. These algorithms are evaluated within a Multi-Particle Environment, showcasing their capability to simulate necessary scenarios and data for PageRank algorithms. However, the environment's realism is limited due to its use of virtual data. The environment offers controllability through the PettingZoo resource library, providing an efficient experimentation platform. While the Multi-Particle Environment displays potential and advantages, its deviation from real-world data should be carefully considered. The experimental methodology involves constructing a network of agents and their message interactions within a simulated environment. The resulting network undergoes the PageRank algorithm, and the resulting ranking aligns with the expected outcome, confirming the Multi-Particle Environment's compatibility with the algorithm. These experiments furnish empirical evidence for the Multi-Particle Environment's adaptability to algorithmic simulations and real-world scenarios. This research contributes to a deeper comprehension of algorithm behavior in diverse and dynamic settings, paving the way for further advancements in the field",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/zsfnjk16"
    },
    {
        "id": 9990,
        "title": "Beer-Dancing Peanuts Explained",
        "authors": "Allison Gasparini",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physics.16.121"
    },
    {
        "id": 9991,
        "title": "Open reproducible scientometric research with Alexandria3k",
        "authors": "Diomidis Spinellis",
        "published": "2023-11-30",
        "citations": 1,
        "abstract": "Considerable scientific work involves locating, analyzing, systematizing, and synthesizing other publications, often with the help of online scientific publication databases and search engines. However, use of online sources suffers from a lack of repeatability and transparency, as well as from technical restrictions. Alexandria3k is a Python software package and an associated command-line tool that can populate embedded relational databases with slices from the complete set of several open publication metadata sets. These can then be employed for reproducible processing and analysis through versatile and performant queries. We demonstrate the software’s utility by visualizing the evolution of publications in diverse scientific fields and relationships among them, by outlining scientometric facts associated with COVID-19 research, and by replicating commonly-used bibliometric measures and findings regarding scientific productivity, impact, and disruption.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0294946"
    },
    {
        "id": 9992,
        "title": "The general tensor regular splitting iterative method for multilinear PageRank problem",
        "authors": "Shuting Tang, Xiuqin Deng, Rui Zhan",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>The paper presents an iterative scheme called the general tensor regular splitting iterative (GTRS) method for solving the multilinear PageRank problem, which is based on a (weak) regular splitting technique and further accelerates the iterative process by introducing a parameter. The method yields familiar iterative schemes through the use of specific splitting strategies, including fixed-point, inner-outer, Jacobi, Gauss-Seidel and successive overrelaxation methods. The paper analyzes the convergence of these solvers in detail. Numerical results are provided to demonstrate the effectiveness of the proposed method in solving the multilinear PageRank problem.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024071"
    },
    {
        "id": 9993,
        "title": "Regional Remote Sensing of Lake Water Transparency Based on Google Earth Engine: Performance of Empirical Algorithm and Machine Learning",
        "authors": "Weizhong Zeng, Ke Xu, Sihang Cheng, Lei Zhao, Kun Yang",
        "published": "2023-3-21",
        "citations": 2,
        "abstract": "Secchi depth (SD) is a valuable and feasible water quality indicator of lake eutrophication. The establishment of an automated system with efficient image processing and an algorithm suitable for the inversion of transparency in lake-rich regions could provide sufficient temporal and spatial information for lake management. These are especially critical for lake-rich regions where in situ monitoring data are scarce. This study demonstrated the implementation of an atmospheric correction algorithm (ACOLITE algorithm) in conjunction with the Google Earth Engine platform to generate remote-sensing reflectance products of specific points efficiently. The study also evaluated the performance of an algorithm for inverting lake SDs in Yunnan Plateau lakes, which is one of the five lake districts in China, since there is a lack of in situ data for most of the lakes in the region. The in situ data from four lakes with large SD ranges and imagery from Landsat Operational Land Imager were used to train and evaluate the performance of two algorithms: an empirical algorithm (stepwise regression) and machine learning (support vector machines and multi-layer perception). The results revealed that the retrieval accuracy of models with bands and band ratio combinations could be substantially improved compared with models with a single band or band combinations. A negative correlation was also observed between the temporal match between observations and the model accuracy. This study found that the MLP model with sufficient training data was more suitable for transparency estimation of lakes belonging to the dataset; the SVM model was more suitable for transparency prediction outside the training set, regardless of the adequacy of the training data. This study provides a reference for monitoring lakes within the Yunnan region using remote sensing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13064007"
    },
    {
        "id": 9994,
        "title": "Google Classroom dan Google Form Sebagai Media Penunjang Pembelajaran Pada SMPIT Al Jawahir",
        "authors": "Sudirman Sudirman",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "E-learning sering disebut sebagai pembelajaran online, yaitu pembelajaran berbasis teknologi informasi dan komunikasi seperti komputer dan handphone. Lokasi pelayanan yang dipilih adalah SMPIT Al Jawahir yang terletak di Jl Aman No. 60, Desa Muliorejo, Kecamatan Sunggal, Kabupaten Deli Serdang, Provinsi Sumatera Utara. Tahapan pengabdian ini meliputi empat tahap yaitu: a.) tahap observasi, b.) tahap persiapan materi, c.) tahap pelaksanaan, dan d.) tahap evaluasi dan penyusunan laporan kegiatan. Hasil dari kegiatan ini berupa penerapan penggunaan Google Classroom dan Google form sebagai media penunjang pembelajaran, dimana kegiatan yang dilakukan dalam pelaksanaannya adalah sebagai berikut: 1. Memberikan pengenalan kepada guru SMPIT Al Jawahir tentang Mengoptimalkan Pemanfaatan Google Classroom dan Google form sebagai Media Penunjang Pembelajaran di SMPIT Al Jawahir. 2. Meningkatkan pengetahuan dan keterampilan guru mengenai pembuatan, penggunaan, dan optimalisasi penggunaan Google Classroom dan Google Forms sebagai media penunjang pembelajaran melalui pemberian pelatihan berupa workshop. 3. Mendemonstrasikan penggunaan Google Classroom dan Google form sebagai media pendukung pembelajaran yang telah dibuat dari hasil pelatihan. Kesimpulan dari hasil Pelaksanaan Sosialisasi dan Implementasi Google Classroom dan Google form sebagai Media Penunjang Pembelajaran di SMPIT Al Jawahir adalah sebagai berikut: 1. Guru mendapatkan pengetahuan baru tentang teknologi internet khususnya teknologi dalam bidang pendidikan mengenai e-learning . 2. Guru mendapatkan pembelajaran baru yang dapat dilakukan dimana saja dan kapan saja.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29103/jmm.v2i1.10398"
    },
    {
        "id": 9995,
        "title": "‘Polygenic risk scores’ for autism, explained",
        "authors": "Giorgia Guglielmi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53053/dwvi9883"
    },
    {
        "id": 9996,
        "title": "The Nanohertz Gravitational-Wave Detection Explained",
        "authors": " Anonymous",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physics.16.116"
    },
    {
        "id": 9997,
        "title": "A parallel PageRank algorithm for undirected graph",
        "authors": "Qi Zhang, Rongxia Tang, Zhengan Yao, Zan-Bo Zhang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.amc.2023.128276"
    },
    {
        "id": 9998,
        "title": "Decisional capacity and informed consent, explained",
        "authors": "Emmet Fraizer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53053/zzui5905"
    },
    {
        "id": 9999,
        "title": "Pride: Prioritizing Documentation Effort Based on a PageRank-Like Algorithm and Simple Filtering Rules",
        "authors": "Weifeng Pan, Hua Ming, Dae-Kyoo Kim, Zijiang Yang",
        "published": "2023-3-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tse.2022.3171469"
    },
    {
        "id": 10000,
        "title": "PCMeans: community detection using local PageRank, clustering, and K-means",
        "authors": "Wafa Louafi, Faiza Titouna",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-023-01109-5"
    },
    {
        "id": 10001,
        "title": "A Scientific Paper Recommendation Framework Based on Multi-Topic Communities and Modified PageRank",
        "authors": "Agung Hadhiatma, Azhari Azhari, Yohanes Suyanto",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3251189"
    },
    {
        "id": 10002,
        "title": "P = NP Mathematically Explained",
        "authors": "India Soale",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4385878"
    },
    {
        "id": 10003,
        "title": "The Mystery of “Strange” Metals Explained",
        "authors": "Katherine Wright",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physics.16.148"
    },
    {
        "id": 10004,
        "title": "Network Capacity Bound for Personalized PageRank in Multimodal Networks",
        "authors": "Mieczysław A. Kłopotek, Sławomir T. Wierzchoń, Robert A. Kłopotek",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "In a former paper [1] the concept of Bipartite PageRank was introduced and a theorem on the limit of authority flowing between nodes for personalized PageRank has been generalized. In this paper we want to extend those results to multimodal networks. In particular we deal with a hypergraph type that may be used for describing multimodal network where a hyperlink connects nodes from each of the modalities. We introduce a generalisation of PageRank for such graphs and define the respective random walk model that can be used for computations. We state and prove theorems on the limit of outflow of authority for cases where individual modalities have identical and distinct damping factors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/fi-222151"
    },
    {
        "id": 10005,
        "title": "The review analysis of zoom meeting and Google meeting user by using the KNN algorithm",
        "authors": "Muhammad Rezki, Kartika Handayani, Badariatul Lailiah, Rabiatus Sa’adah, Octa Pratama Putra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0128330"
    },
    {
        "id": 10006,
        "title": "Brief Announcement: CausalEC: A Causally Consistent Data Storage Algorithm based on Cross-Object Erasure Coding",
        "authors": "Viveck R. Cadambe, Shihang Lyu",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583668.3594603"
    },
    {
        "id": 10007,
        "title": "Prof. Nevzat Tarhan explained 'Time Management' to university students",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "President of Üsküdar University Prof. Nevzat Tarhan gave important advice to the participants under the title of \"Time Management\".",
        "keywords": "",
        "link": "http://dx.doi.org/10.32739/uha.id.42506"
    },
    {
        "id": 10008,
        "title": "Spatiotemporally Mapping Non-Grain Production of Winter Wheat Using a Developed Auto-Generating Sample Algorithm on Google Earth Engine",
        "authors": "Meng Zhang, Peijun Sun, Zhangli Sun",
        "published": "2024-2-11",
        "citations": 0,
        "abstract": "Spatiotemporally mapping winter wheat is imperative for informing and shaping global food security policies. Traditional mapping methods heavily rely on sufficient and reliable samples obtained through labor-intensive fieldwork and manual sample collection. However, these methods are time-consuming, costly, and lack timely and continuous data collection. To address these challenges and fully leverage remote sensing big data and cloud computing platforms like Google Earth Engine (GEE), this paper developed an algorithm for Auto-Generating Winter Wheat Samples for mapping (AGWWS). The AGWWS utilizes historical samples to determine the optimal migration threshold by measuring Spectral Angle Distance (SAD), Euclidean Distance (ED), and Near-Infrared band Difference Index (NIRDI). This facilitates the auto-generation of winter wheat sample sets for the years 2000, 2005, 2010, 2015, and 2021. Approximately two-thirds of the samples were allocated for training, with the remaining one-third used for validating the mapping method, employing the One-Class Support Vector Machine (OCSVM). The Huang–Huai–Hai (HHH) Plain, a major winter wheat production region, was selected to perform the algorithm and subsequent analysis on. Different combinations of the hyper-parameters, gamma and nu, of the OCSVM based on the Gaussian Radial Basis Function Kernel were tested for each year. Following correlation analysis between the winter wheat area derived from the generated maps and the national statistical dataset at the city level, the map with the highest corresponding R2 was chosen as the AGWWS map for each year (0.77, 0.77, 0.80, 0.86, and 0.87 for 2000, 2005, 2010, 2015, and 2021, respectively). The AGWWS maps ultimately achieved an average Overall Accuracy of 81.65%. The study then explores the Non-Grain Production of Winter Wheat (NGPOWW) by analyzing winter wheat change maps from 2000–2005, 2005–2010, 2005–2010, and 2015–2021 in the HHH Plain. Despite an overall increase in the total planted area of winter wheat, the NGPOWW phenomena has led to concerning winter wheat planting marginalization. Compensatory winter wheat areas are notably situated in mountainous and suburban cultivated lands with low qualities. Consequently, despite the apparent expansion in planted areas, winter wheat production is anticipated to be adversely affected. The findings highlight the necessity for improved cultivated land protection policies monitoring the land quality of the compensation and setting strict quota limits on occupations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs16040659"
    },
    {
        "id": 10009,
        "title": "The application of PageRank model in urban epidemic prevention and control",
        "authors": "Rouzhi Wang",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672203"
    },
    {
        "id": 10010,
        "title": "Reputation and Pagerank on the Ethereum Blockchain: Technical Report",
        "authors": "Scott K. Imig,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "Motivated by the need for a credibly neutral reputation mechanism on the blockchain, we study Pagerank and other properties of two Ethereum addresses, considering one address as trustworthy and the other as problematic. We show that an unmodified Pagerank algorithm does not distinguish these cases, while asserting that Pagerank is nonetheless an important starting point for such a mechanism. We give several directions for extending or modifying the mechanism to cover such cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijbta.2023.1.2.89-94"
    },
    {
        "id": 10011,
        "title": "Real-Time PageRank on Dynamic Graphs",
        "authors": "Scott Sallinen, Juntong Luo, Matei Ripeanu",
        "published": "2023-8-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3588195.3593004"
    },
    {
        "id": 10012,
        "title": "CPPE-5: Medical Personal Protective Equipment Dataset",
        "authors": "Rishit Dagli, Ali Mustufa Shaikh",
        "published": "2023-3-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01748-7"
    },
    {
        "id": 10013,
        "title": "The Role of Google Classroom and Google Meeting on Learning Effectiveness",
        "authors": "Dheera Kapur",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "This study discusses the role of google classroom and google meeting on learning effectiveness. The purpose of writing this article is to find out the role of Google Classroom and Google Meeting on learning effectiveness, within the scope of technology education. The method of writing articles is quantitative descriptive. The population in this study amounted to 173 people with a research sample of 50 respondents. The sampling technique used is accidental sampling. The tests carried out are t-tests, f-tests and determination coefficient tests.  The results of this study include: 1) Google classroom contributes to partial learning effectiveness; 2) Google meetings contribute to the effectiveness of learning partially; and 3) Google classroom and google meeting contribute to the effectiveness of learning simultaneously. Apart from these 2 exogenous variables that affect endogenous variables of learning effectiveness, there are still other factors including the implementation of learning, communicative processes, student responses and learning outcomes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38035/sijet.v1i1.13"
    },
    {
        "id": 10014,
        "title": "3D Social Research: Analysis of Social Interaction Using Computer Vision",
        "authors": "Yoav Goldstein, Nicolas M. Legewie, Doron Shiffer-Sebba",
        "published": "2023-8",
        "citations": 0,
        "abstract": " Video data offer important insights into social processes because they enable direct observation of real-life social interaction. Though such data have become abundant and increasingly accessible, they pose challenges to scalability and measurement. Computer vision (CV), i.e., software-based automated analysis of visual material, can help address these challenges, but existing CV tools are not sufficiently tailored to analyze social interactions. We describe our novel approach, “3D social research” (3DSR), which uses CV and 3D camera footage to study kinesics and proxemics, two core elements of social interaction. Using eight videos of a scripted interaction and five real-life street scene videos, we demonstrate how 3DSR expands sociologists’ analytical toolkit by facilitating a range of scalable and precise measurements. We specifically emphasize 3DSR's potential for analyzing physical distance, movement in space, and movement rate – important aspects of kinesics and proxemics in interactions. We also assess data reliability when using 3DSR. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00491241221147495"
    },
    {
        "id": 10015,
        "title": "Combining Observational and Experimental Datasets Using Shrinkage Estimators",
        "authors": "Evan T.R. Rosenman, Guillaume Basse, Art B. Owen, Mike Baiocchi",
        "published": "2023-12-1",
        "citations": 6,
        "abstract": "Abstract\nWe consider the problem of combining data from observational and experimental sources to draw causal conclusions. To derive combined estimators with desirable properties, we extend results from the Stein shrinkage literature. Our contributions are threefold. First, we propose a generic procedure for deriving shrinkage estimators in this setting, making use of a generalized unbiased risk estimate. Second, we develop two new estimators, prove finite sample conditions under which they have lower risk than an estimator using only experimental data, and show that each achieves a notion of asymptotic optimality. Third, we draw connections between our approach and results in sensitivity analysis, including proposing a method for evaluating the feasibility of our estimators.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/biom.13827"
    },
    {
        "id": 10016,
        "title": "PageRank centrality with non-local random walk-based teleportation",
        "authors": "David Bowater, Emmanuel Stefanakis",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "Abstract\nPageRank is a popular measure of centrality that is often applied to rank nodes in real-world networks. However, in many cases, the notion of teleportation is counterintuitive because it implies that whatever is moving around the network will jump or ‘teleport’ directly from one node to any other, without considering how far apart the nodes are. To overcome this issue, we propose here a general measure of PageRank centrality whereby the teleportation probabilities depend, in some way, on the distance separating the nodes. We accomplish this by drawing upon recent advances in non-local random walks, which allow the proposed measure to be tailored for various real-world networks and applications. To illustrate the flexibility of the proposed measure and to demonstrate how it differs from PageRank centrality, we present and discuss experimental results for a selection of real-world spatial and social networks, including an air transportation network, a collaboration network and an urban street network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/comnet/cnad024"
    },
    {
        "id": 10017,
        "title": "Reinforcement Learning Explained via Reinforcement Learning: Towards Explainable Policies through Predictive Explanation",
        "authors": "Léo Saulières, Martin Cooper, Florence Bannay",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011619600003393"
    },
    {
        "id": 10018,
        "title": "Pengaplikasian Google Docs Dan Google Slides Dalam Membantu Mengerjakan Tugas Siswa Di SMPN 44 Samarinda",
        "authors": "Anindita Septiarini",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Kegiatan pelayanan masyarakat ini bertujuan untuk memberikan pengenalan dan pemahaman mengenai penggunaan Google Docs dan Google Slides kepada siswa-siswa SMPN 44 Palaran Samarinda. Hal ini dilakukan untuk mendukung pemahaman siswa terhadap materi yang diajarkan di SMPN 44 Palaran Samarinda. Aplikasi Google Docs dan Google Slides sangat cocok bagi siswa yang ingin bekerja sama secara langsung dalam satu berkas. Dalam praktiknya, pengetahuan dan penggunaan aplikasi Google Docs dan Google Slides di SMPN 44 Palaran Samarinda masih kurang. Oleh karena itu, melalui kegiatan ini dilakukan sosialisasi dan pelatihan penggunaan Google Docs dan Google Slides untuk memberikan pengetahuan kepada siswa bahwa bekerja sama dalam satu berkas menggunakan Google Docs atau Google Slides tidaklah sesulit yang dibayangkan, serta memberikan edukasi tentang pentingnya bekerja sama dalam satu berkas. Selain itu, kegiatan ini juga bertujuan untuk memberikan informasi mengenai manfaat Google Docs dan Google Slides bagi pemula.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53622/intekmas.v1i1.192"
    },
    {
        "id": 10019,
        "title": "The DSA’s Scope Briefly Explained",
        "authors": "Martin Husovec",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4365029"
    },
    {
        "id": 10020,
        "title": "Multi-hop Attention-based Graph Pooling: A Personalized PageRank Perspective",
        "authors": "Parsa Haddadian, Roya Booryaee, Rooholah Abedian, Ali Moeini",
        "published": "2024-5-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dchpc60845.2024.10454077"
    },
    {
        "id": 10021,
        "title": "Extraction of long time series wetland information based on Google Earth Engine and random forest algorithm for a plateau lake basin – A case study of Dianchi Lake, Yunnan Province, China",
        "authors": "Fei Zhao, Siwen Feng, Fei Xie, Sijin Zhu, Sujin Zhang",
        "published": "2023-2",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ecolind.2022.109813"
    },
    {
        "id": 10022,
        "title": "Efficient Segmentation Algorithm for Estimation of Revised Reservoir Capacities in Google Earth Engine",
        "authors": "Rahul Kumar Jaiswal, Gunja Dhruw, Sukant Jain, Ravi V. Galkate, Anil Kumar Lohani, Akhilesh Verma",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11269-023-03511-2"
    },
    {
        "id": 10023,
        "title": "Everything Evolves in Personalized PageRank",
        "authors": "Zihao Li, Dongqi Fu, Jingrui He",
        "published": "2023-4-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3543507.3583474"
    },
    {
        "id": 10024,
        "title": "The Black-Scholes Magic Trick, Explained!",
        "authors": "David Orrell",
        "published": "2023-7",
        "citations": 1,
        "abstract": "        While it is really a predictive formula, which estimates option prices based on a probabilistic price distribution, its trick is to present itself as a prescriptive formula (which somehow defines the correct option price � like a mentalist who predicts the future by making it happen. By using it as a calculating device, investors only seem to confirm its predictions. What kind of higher-level voodoo is this?         ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54946/wilm.11153"
    },
    {
        "id": 10025,
        "title": "Double Slit Experiment with Detectors Explained",
        "authors": "Bhargava Kotur",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4753757"
    },
    {
        "id": 10026,
        "title": "Examining Online Reviews for Restaurants: The Example of Google Maps",
        "authors": "Pelin KOÇ, Nur Neşe ŞAHİN",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "Çevrimiçi yorumlar, tüketicilerin yaşamlarında birçok alanda etkili olmaktadır. Çevrimiçi yorumların önemli oranda etkili olduğu alanlardan biri de tüketicilerin restoran seçimleridir. Restoranlar hakkında çevrimiçi yorum ve yıldız derecelendirmesi yapmaya imkân tanıyan platformlar, çağımızın restoran seçimlerinde başvurulan en önemli bilgi kaynağı haline gelmiştir. Çevrimiçi kaynaklardan elde edilen bu bilgiler, tüketicilerin tercihlerini şekillendirmek açısından ciddi öneme sahiptir. Yapılan çalışmada; Ege bölgesinde yer alan Turizm İşletmesi Belgeli Tesisler içerisinde “lokanta” kategorisinde bulunan 1. sınıf restoranlara ait Google Haritalar üzerinden yapılmış çevrimiçi yorumlar içerik analizi ile incelenmiştir. Erişilen 22 restoran için hem metin geri bildirimlerine hem de yıldız derecelendirmesine sahip 2633 adet yorumun analizi yapılmıştır. Çevrimiçi yorumlar; “yemek”, “hizmet”, “atmosfer”, “fiyat”, “konum ve imkânlar” olmak üzere beş kategoride değerlendirilmiştir. Çevrimiçi yorumlarda en fazla değerlendirmenin ''atmosfer'' kategorisi için yapıldığı görülmüştür. Atmosferi takiben en fazla değerlendirmeye sahip kategoriler yemek, hizmet, fiyat ve konum&imkânlar kategorisi olmuştur. Ayrıca incelenen yorumlar, olumlu ve olumsuz olmak üzere iki temel kategoride de ayrıca analiz edilmiştir. Araştırma kapsamında yer alan restoranlar için olumlu çevrimiçi yorumların fazla, olumsuz çevrimiçi yorumların da olumlulara göre daha az olduğu tespit edilmiştir. Buradan yola çıkarak; tüketici tercihlerinde oldukça etkili olduğu bilinen çevrimiçi yorumların restoranlar tarafından tamamen olumlu yorumlara çevrilmesinin restoranların tercih edilme düzeylerini arttırma konusunda etkili olacağı öngörülmektedir. Mevcut araştırmanın restoran yöneticilerine yol gösterme açısından önemli olduğu düşünülmektedir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30625/ijctr.1382067"
    },
    {
        "id": 10027,
        "title": "Google Meet and Google Classroom on Learning History: Review from Students Perspective",
        "authors": "Ayuhel Letrik Marian,  Umasih,  Sarkadi",
        "published": "2023-5-19",
        "citations": 1,
        "abstract": "Changes in the learning process require teachers to be more creative and innovative in delivering learning. The effectiveness of online learning needs to be considered, by utilizing various platforms, including using Google Classroom and Google Meet in history learning. This study aims to analyze the students' perspectives are related to the effectiveness of the platforms used during distance learning. The method used in this research is descriptive with a quantitative approach. Respondents in this study were 39 active students, eleventh grade. Data was collected using an online questionnaire via Google Form. The results of this study indicate that as many as 81.3% of students stated that they were motivated to take part in learning because it did not require a lot of quota, and the features used on the platform were very easy to operate and very attractive. Meanwhile, 18.7% of respondents stated that they were not interested in the platforms used in online learning and needed an alternative platform. From this it appears that in general these two platforms are one of the right choices to use, which is not only appropriate for the suitability of the material, or with the characteristics of students, but also the right platform because it does not require too much of a large quota load but is sufficient in online usage that does not burdensome students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23887/jere.v7i2.44337"
    },
    {
        "id": 10028,
        "title": "Optimizing Hindi Paragraph Summarization through PageRank Method",
        "authors": "Sheshang Degadwala, Dhairya Vyas, Khush Nilaykumar Patel, Mukesh Soni, Pavitar Parkash Singh, Ramya Maranan",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212107"
    },
    {
        "id": 10029,
        "title": "Öğretim Görevlilerinin Öğrencilerin Dil Öğreniminde Google Çeviri Kullanımına İlişkin Algıları",
        "authors": "Seçkin CAN",
        "published": "2023-2-25",
        "citations": 0,
        "abstract": "Online machine translation has become one of the most commonly used applications among university students, and google translate (GT) is the most popular among them due to the availability of mobile devices with the internet. This mixed-method study investigated university prep school instructors' attitudes and perceptions of GT use regarding its effectiveness, ethicality, frequency, and students' purposes of using it. An online questionnaire was administered to 46 instructors, and semi-structured interview sessions were held with 11 instructors. Results indicated that nearly all of the participant instructors' students frequently use GT. Another important finding was that many students use GT in reading and writing classes. Results also revealed that students tend to use GT far more beyond a dictionary function, and this overuse dramatically decreases instructors' perception of the effectiveness and ethicality of GT. Although instructors are worried about its usage for longer segments and adverse effects on student learning, they do not prefer banning or limiting its usage in language classes due to its simplicity and practicality. Therefore, there is a need to have a working policy to avoid the harmful effects of GT and use them effectively in language classes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29110/soylemdergi.1186593"
    },
    {
        "id": 10030,
        "title": "Evaluation with Google Earth Engine Data Mining and WebGIS Application of Parameters Causing Change in Agricultural Lands",
        "authors": "Hakan AKÇIN, Rüveyda TERCAN KÖSE",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Tarım arazilerinin, değişen yapısının ve arazi yönetimi için sürdürülebilir modellerin geliştirilebilmesi amacıyla, zamansal olarak değişime neden olan parametrelerin belirlenmesi ve değerlendirilerek kullanılması gerekmektedir. Uzaktan algılama (UA) ve Coğrafi Bilgi Sistemi (CBS)’nin katkısıyla tarım arazileri için uygun modeller geliştirilebilmektedir. Bu çalışmada; tarım alanlarındaki değişimler, Orta Karadeniz bölümünde bulunan Çorum ilinin Merkez ilçesi sınırları içerisinde örnek bir alan seçilerek, Google Earth Engine platformu üzerinden uzaktan algılanmış verilerin veri madenciliği işlemleri ve webCBS uygulamaları için ilgili kodlar yazılarak elde edilen analizler incelenmiştir. Terra Climate uygulamasıyla aylık iklim ve iklimsel su dengesi verileriyle 2020 yılı için aylık iklim değişimi incelenirken, Sentinel-2 verileriyle de arazi sınıflandırması yapılarak bant kombinasyonları ile bitkilerin yoğunlukları, bitki sağlığı tespit edilmiştir. Bitkilerin değişimlerini belirlemek için 2021 yılına ait yedi farklı indeks değeri hesaplanmış, tarım arazilerindeki bitki örtüsü, nem ve su içerikli değişimler değerlendirilmiştir. Elde edilen sonuçlar incelendiğinde; örnek alandaki tarım arazilerinde arazi ısı değişiminde en yüksek sıcaklığın 2021 Eylül ayında, en düşük sıcaklığın ise Şubat ayında gerçekleştiği, tarım arazilerindeki bitki örtüsünün 2021 Nisan, Mayıs, Haziran aylarında orta derece sağlıklı bitki yoğunluğuna sahip iken 2021 Ekim, Kasım, Aralık aylarında sağlıksız ve zayıf bitki yoğunluğuna sahip olduğu tespit edilmiştir. İklim verilerinin incelenmesinden, yağış değerlerinin bölgenin iklim özellikleri de göz önüne alındığında yaz aylarında oldukça düşüş gösterdiği, kış aylarında da yükseldiği görülmüştür. Meteoroloji Genel Müdürlüğü 2021 yılı iklim raporuna göre 2020 yılı Türkiye geneli yer yüzeyi sıcaklık ortalaması 14.9°C iken, çalışma alanında bu sıcaklığın 19.01°C olarak ortalama değerin üzerinde seyrettiği belirlenmiştir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21597/jist.1192622"
    },
    {
        "id": 10031,
        "title": "RELATIONSHIP BETWEEN GOOGLE SEARCH VOLUME AND FLOOD EVENTS IN INDONESIA: A GOOGLE TRENDS ANALYSIS",
        "authors": " RESTI KINANTHI,  Mochammad Iqbal",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "The increasing number of floods every year brings a wide impact; the average loss caused by floods every year reaches 4.64T (Rp). Information about floods is very important to improve the preparedness of people living in disaster-prone areas. If information can be provided when people have a high interest in learning, it can have a profound effect on increasing public knowledge. To carry out effective risk communication in flood disasters, knowledge about flood disaster patterns is needed, as well as knowledge about community behavior in seeking information. One of the people's behavior in searching for information can be seen from the Google Trends analysis. The purposes of this study are to analyse the relationship between public interest in finding information through google trends with the keyword \"flood\" with flood events in Indonesia for 10 years. This research is a quantitative descriptive study by processing data obtained from Google Trends and BNPB flood event data using the Spearman Rank Correlation statistical test with SPSS software. The results showed that Google Trends with the keyword \"Flood\" and the pattern of flood events had a strong positive relationship with a correlation coefficient of 0.64, this indicates that the increase in the incidence of disasters causes an increase in public interest in seeking information about flood disasters. Risk communication that was carried out before the disaster occurred was not yet optimal in reaching the community. Risk communication needs to be carried out before the months that are predicted to be the peak of flood events. Risk communication is carried out to form the preparedness of the Indonesian people so that the risk of flood disasters can be reduced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38073/wasilatuna.v6i02.1014"
    },
    {
        "id": 10032,
        "title": "ФОРМУВАННЯ РОЗКЛАДУ ЗАНЯТЬ НАВЧАЛЬНОГО ЗАКЛАДУ  ЗА ДОПОМОГОЮ GOOGLE CALENDAR ТА GOOGLE SHEETS",
        "authors": "Дмитро Карпин, Анна Карпин, Ігор Столярчук, Роман Лешко, Віктор Британ",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52058/2786-6025-2024-3(31)-878-888"
    },
    {
        "id": 10033,
        "title": "Google Colab for Teaching CS and ML",
        "authors": "Katlyn Edwards, Corrie Scalisi, Julianne DeMars-Smith, Key Lee",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3626253.3635432"
    },
    {
        "id": 10034,
        "title": "Indirect translation explained",
        "authors": "Kaisa Koskinen",
        "published": "2023-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0907676x.2023.2221378"
    },
    {
        "id": 10035,
        "title": "UPAYA MENINGKATKAN KOMPETENSI GURU DALAM PEMBELAJARAN DARING MENGGUNAKAN GOOGLE CLASSROOM DAN GOOGLE FORMULIR MELALUI BIMLAT",
        "authors": "ANWAR ZARKASI",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "This research is a school action research, which consists of 2 cycles and each cycle consists of 4 stages, namely: the planning stage of the action program, the implementation of the action program, program observation, and reflection. This research was conducted by making direct observations of the activities of all teachers, as well as monitoring teachers in online learning at MAN Banjarbaru City. Then document the results of these observations. In the pre-cycle the researcher observed how much teacher competency was in online learning using Google Classroom and Google Forms and the results were very low, with an average score of only 1 or 16.66% of the maximum target score of 6. The research was continued to cycle I and the authors started holding teacher training to improve teacher competence in online learning using google classroom and google forms. The results show that there is an increase in the average score of cycle I to 2.6 or 43.33% of the maximum target score of 6. This means that there is an increase of 26.67% from the pre-cycle score. Furthermore, in cycle II the score increased again to 5.6 or 93.33% of the maximum target score of 6, which means there was a 50% increase from the score in cycle I. Based on the results of this study it was concluded that bimlat can improve teachers' abilities to use Google Classroom learning media and Google Forms at MAN Banjarbaru City.\r\nABSTRAKPenelitian ini merupakan penelitian tindakan sekolah, yang terdiri dari 2 siklus dan masing- masing siklus terdiri dari 4 tahap yaitu: tahap perencanaan program tindakan, pelaksanaan program tindakan, pengamatan program, dan refleksi. Penelitian ini dilakukan dengan mengadakan pengamatan langsung terhadap aktivitas semua guru, disamping juga memantau guru dalam pembelajaran daring di MAN Kota Banjarbaru. Kemudian mendokumentasikan hasil pengamatan tersebut.Pada pra siklus peneliti mengamati seberapa besar kompetensi guru dalam pembelajaran daring menggunakan google classroom dan google formulir dan hasilnya sangat rendah yakni dengan skor rata-rata cuma 1 atau 16,66% dari target skor maksimal yakni 6. Penelitian dilanjutkan ke siklus I dan penulis mulai mengadakan bimlat guru untuk memperbaiki kompetensi guru dalam pembelajaran daring menggunakan google classroom dan google formulir. Hasilnya memperlihatkan ada peningkatan skor rata-rata siklus I hingga mencapai 2,6 atau 43,33% dari target skor maksimal yakni 6, Hal ini berarti ada kenaikan 26,67% dari skor pra siklus. Selanjutnya pada siklus II skor meningkat lagi sampai 5,6 atau 93,33% dari target skor maksimal yakni 6, yang berarti ada kenaikan 50% dari skor siklus I. Berdasarkan hasil penelitian ini disimpulkan bahwa bimlat dapat meningkatkan kemampuan guru menggunakan media pembelajaran Google Classroom dan Google Formulir di MAN Kota Banjarbaru.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51878/manajerial.v3i1.2132"
    },
    {
        "id": 10036,
        "title": "THE COMPARISON OF GOOGLE BARD AND CHATGPT USE IN FINANCIAL MARKETS",
        "authors": "Samet GÜRSOY, Ethem KILIÇ",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "The main purpose of this study is to investigate the advantages and disadvantages of using ChatGPT and Google Bard in finance. As a method, academic studies and researches done so far were examined. In this direction, the advantages and disadvantages of both methods were tried to be presented in tables. As a result of the study, it was observed that special abilities can be attributed to both artificial intelligence systems, and when compared, it was found that the net advantage would be better understood over time. Because artificial intelligence systems are fed by the feedback of users. However, it has been observed that while ChatGPT works effectively in data analysis and rapid decision making, it may have limitations when it comes to freedom from emotion and bias. Google Bard, on the other hand, has been stated to be effective in risk management and portfolio optimization with its advanced forecasting and analysis capabilities. However, it is common opinion that the use of up-to-date and accurate data is important in both systems and that the factors will affect the performance of the methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38004/sobad.1343515"
    },
    {
        "id": 10037,
        "title": "Accelerating Personalized PageRank Vector Computation",
        "authors": "Zhen Chen, Xingzhi Guo, Baojian Zhou, Deqing Yang, Steven Skiena",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3580305.3599251"
    },
    {
        "id": 10038,
        "title": "Teaching Digital Archives Management Using Google Sites, Google Drive, and Gmail",
        "authors": "Elvina Herawati, Saib Suwilo, Herman Mawengkang, Aghni Syahmrani",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "Study plans, study modules, practice questions and exams from teachers, results of student exercises and exams, photos and videos of teaching activities, and other teaching files for each subject are teaching data that can be used to obtain quality education. However, some of the data is not documented by Partners in a systematic and comprehensive manner. If the data is physically collected, it will require a repository for the data, so it will take time to organize the warehouse, search for files, and provide files to teachers or students who need the files. To keep teaching data collected without using physical storage warehouses, digital archiving can be used. Google Sites, Google Drive, and Gmail can be used to build digital archives. The USU Mathematics Master’s Program team plans to build a site through Google Sites to archive digital files and to display digital archives that are stored on Google Drive and which can be submitted via Gmail online. In addition, the Team also provides training for Partners to build and develop sites on Google Sites and perform digital archive management on Google Drive and integrate Google Sites and Google Drive with Gmail.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32734/abdimastalenta.v8i2.10444"
    },
    {
        "id": 10039,
        "title": "Innovación educativa en España. Un análisis con Google Trends - [Educational innovation in Spain. An analysis with Google Trends]",
        "authors": "Mabel Pisá Bó, Patricia Jara Calaforra Faubel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26754/cinaic.2023.0043"
    },
    {
        "id": 10040,
        "title": "Marktgrenzen und Marktmacht in digitalen Ökosystemen – Anmerkung zum Urteil des EuG v. 14.9.2022, Rs. T-604/18 (Google und Alphabet/Kommission [Google Android])",
        "authors": "Ranjana Andrea Achleitner",
        "published": "2023",
        "citations": 1,
        "abstract": "Das EuG hat in der Rs. Google Android die von der Kommission verhängte Milliardenstrafe gegen Google weitgehend bestätigt. Google hat demnach den Herstellern von Android-Mobilgeräten und den Betreibern von Mobilfunknetzen rechtswidrig Beschränkungen gem. Art. 102 AEUV auferlegt, um die beherrschende Stellung seiner Suchmaschine zu stärken. Das Urteil erlaubt wertvolle Schlüsse in Bezug auf die Definition der relevanten Märkte in der Plattformökonomie und bringt gleichermaßen methodologische Fragen mit sich, die im folgenden Beitrag diskutiert werden. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5771/0531-2485-2023-1-100"
    },
    {
        "id": 10041,
        "title": "Bası Yarası Bakımına İlişkin Google Videoları Önerilmeli mi?",
        "authors": "Aytül COŞAR ERTEM, Uğur ERTEM",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Bu çalışmada bası yarası bakımında Google videolarının kalitesini ve güvenilirliğini değerlendirmeyi amaçladık. 12 Ekim 2023'de Google videolar kısmında \"bası yarası bakımı\", \"yatak yarası bakımı\", \"basınç ülseri bakımı\", ve \"basınç yaralanması bakımı\" anahtar kelimelerini aradık. Her bir anahtar kelime ile arama sonucu ilk çıkan 25 video değerlendirildi. Videoların kalitesini ve güvenilirliğini değerlendirmek için Modifiye DISCERN (Mdiscern) ve Küresel Kalite Skoru (GQS) kullanıldı. Taranan 100 videodan 49'u (%49) istatistiksel analize dahil edildi. İstatistiksel analiz sonuçlarına göre videoların %42.86’sının orta kalitede ve %55.10’unun yüksek güvenilirliğe sahip olduğunu saptadık. Video yükleme kaynağı açısından bakıldığında kalitesi ve güvenilirliği yüksek videoların çoğunun sağlık profesyonelleri tarafından yüklendiği belirlendi (p=0.001). Mevcut çalışma sonuçlarına göre, Google'da yer alan bası yarası bakımı ile ilgili videoların çoğunun orta kalitede olduğu ve videoların yarısına yakınının düşük güvenilirliğe sahip olduğu tespit edilmiştir. Gelecekte sağlık profesyonellerinin video paylaşım platformlarında (YouTube, Google, Tiktok vb.) içerik üretmeleri, video kalitesinin ve güvenilirliğinin artmasında etkili olacaktır. Ayrıca hastalara sağlıkla ilgili bilgi kaynağı olarak Google videolar kısmındaki içeriklerin önerilmesinin belli seçici özelliklere göre ve hekimin değerlendirmesine göre uygun olabileceğini düşünüyoruz.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32708/uutfd.1380462"
    },
    {
        "id": 10042,
        "title": "Effective Computation of a Feedback Arc Set Using PageRank",
        "authors": "Vasileios Geladaris, Panagiotis Lionakis, Ioannis G. Tollis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7155/jgaa.00641"
    },
    {
        "id": 10043,
        "title": "PageRank vs. ANP: A Comparative Analysis for Prioritizing Maintenance Activities in Industrial Water Distribution Systems",
        "authors": "Giulia Marcon, Silvia Carpitella, Antonella Certa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.12.068"
    },
    {
        "id": 10044,
        "title": "A Comparative Analysis of Retrievability and PageRank Measures",
        "authors": "Aman Sinha, Priyanshu Raj Mall, Dwaipayan Roy, Kripabandhu Ghosh",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3632754.3632760"
    },
    {
        "id": 10045,
        "title": "PELATIHAN DAN PENYULUHAN OPTIMALISASI PEMASARAN PRODUK UMKM MENGGUNAKAN GOOGLE ADS",
        "authors": "Erislan Erislan",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Salah satu tantangan pemasaran di era digital, dimana UMKM dihadapkan pada perilaku konsumen digital, konsumen era ini merupakan konsumen yang ketika membutuhkan suatu produk baik barang atau jasa, mereka tidak lagi mencarinya ke pasar-pasar maupun pusat perbelanjaan lainnya,  namun mereka mencarinya di internet, menggunakan peralatan teknologi yang bisa di akses dimana saja dan kapan saja. Hal ini tentunya, memaksa tidak hanya perusahaan besar ataupun bisnis terkenal untuk ikut memperkenalkan dan menjuaal produknya di internet namun UMKM pun harus beradaptasi pada situasi dan tantangan ini, di tengah kemajuan zaman pada era digital. Usaha Mikro, Kecil, dan Menengah, atau UMKM, juga tidak luput terdampak oleh perubahan zaman saat ini. UMKM dihadapkan oleh berbagai tantangan yang mengharuskannya untuk terus beradaptasi agar tetap bertahan dan mempunyai daya saing yang kuat. Pergeseran perilaku konsumen dari offline ke online akan memaksa UMKM menggunakan tools-tools pemasaran digital baik itu dalam upaya brand awareness, Tindakan pembelian maupun loyalitas pelanggan. Begitu halnya dengan UMKM di Kabupaten bandung khususnya pada industri Restoran. Dimana daerah ini merupakan salah satu jalur wisata strategis yang ada di Provinsi Jawa Barat dan paling dekat dengan Kota Bandung, tentunya juga memiliki kendala SDM dalam hal promosi, digital, khususnya dalam hal menggunakan tools Google Ads. Terkait hal tersebut, maka perlu dilaksanakan kegiatan Pengabdian Bagi Masyarakat untuk memberikan penyuluhan mengenai pemasaran digital dan tools-toolsnya serta pelatihan mengenai promosi menggunakan google ads dengan tujuan mempromosikan produk secara berkala. Berdasarkan pada analisis situasi ini permasalahan mitra terfokus pada masalah penggunaan Google Ads untuk optimalisasi pemasaran pada UMKM “SAUNG INJUK RESTO” yang meliputi pemahaman taget audiens dari Google Ads dan cara penggunaan aplikasi Google Ads.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62085/jms.v2i1.90"
    },
    {
        "id": 10046,
        "title": "Giant ape's extinction explained",
        "authors": "James Woodford",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0262-4079(24)00052-6"
    },
    {
        "id": 10047,
        "title": "Tata Kelola Keilmuan Berbasis Google Scholar",
        "authors": "Ismail Suardi Wekke",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21428/3d6944ed.dbeb49f3"
    },
    {
        "id": 10048,
        "title": "Sentiment analysis review flip app users on Google play using Naïve Bayes algorithm and support vector machine with smote technique",
        "authors": " Hermanto, Taufik Asra, Antonius Yadi Kuntoro, Riza Fahlapi, Lasman Effendi, Ferry Syukmana",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0143623"
    },
    {
        "id": 10049,
        "title": "Understanding Masculinity: Explained by Lebanese Private School Adolescents",
        "authors": "Alex Ziade",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4350710"
    },
    {
        "id": 10050,
        "title": "Tracking Online Interest in Artificial Intelligence in Ophthalmology Using Google Trends",
        "authors": "Abhimanyu S. Ahuja, Ehsan Rahimy, Jayanth Sridhar",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/08820538.2023.2204919"
    },
    {
        "id": 10051,
        "title": "Analysis and Application of Knowledge Points in English Network Course Teaching by Using PageRank",
        "authors": "Lianmei Deng N.A.",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijnvo.2023.10058074"
    },
    {
        "id": 10052,
        "title": "PENERAPAN MODEL PEMBELAJARAN INKUIRI DENGAN MENGGUNAKAN   PERPADUAN APLIKASI GOOGLE CLASSROOM DENGAN GOOGLE MEET UNTUK MENINGKATKAN HASIL BELAJAR MATERI   PAJAK  PENGHASILAN PASAL  21",
        "authors": "Murniyati Nurdin",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "Dunia dikejutkan dengan mewabahnya virus corona yang berasal dari Cina tepatnya di kota Wuhan. Pada bulan Oktober 2019 virus corona meluluh lantakkan Cina, kemudian dalam sekejap sudah merebak ke seluruh penjuru dunia. COVID-19 (Corona Virus Disease 2019) oleh organisasi kesehatan dunia (WHO) dinyatakan sebagai pendemi internasional. Pembelajaran yang awalnya dilakukan secara tatap muka kini harus dilakukan secara daring.Pendekatan inkuiri merupakan metode pembelajaran yang berupaya menanamkan dasar-dasar berfikir ilmiah pada diri siswa, sehingga dalam proses pembelajaran ini siswa lebih banyak belajar sendiri, mengembangkan kreativitas dalam memecahkan masalah. menerapkan pendekatan pembelajaran inkuiri dengan materi PPh pasal 21 siswa berada dirumah mengerjakan tugas dengan mencari sendiri jawaban dimasa pandemi covid-19 ini mengerjakan dirumah menjawab persoalan dan tugas yang diberikan dengan menggunakan daring melalui aplikasi Google Classroom dengan Google Meet untuk meningkatkan hasil belajar siswa di era Pandemi ini. Penelitian ini merupakan penelitian tindakan kelas (Classroom Action Research) dengan empat kegiatan yaitu perencanaan tindakan, pelaksanaan, observasi,  dan  refleksi.  Alasan  memilih  PTK karena  dapat  meningkatkan kinerja guru sehingga menjadi   profesional. Teknik   pengumpulan data dilakukan dengan memberikan tes kepada siswa dan dengan observasi pada aktivitas guru dan siswa yang dilakukan oleh seorang observer. Berdasarkan hasil penelitan   peningkatan ketuntasan hasil belajar materi PPh pasal 21 dari 64 % pada siklus I mengalami peningkatan menjadi 88 % pada siklus II. Aktivitas guru berdasarkan data observasi dari 66 % pada siklus I mengalami peningkatan menjadi 73 % pada siklus II. Aktivitas siswa dari 84 % pada siklus I mengalami peningkatan menjadi 90 % pada siklus II. dari data kenaikan ketuntasan hasil belajar sebesar 88 % .Dari  hasil penelitian ini adalah Penerapan Pendekatan Pembelajaran Inkuiri dengan Menggunakan Perpaduan Aplikasi Google Classroom dengan Google Meet mengalami peningkatkan Hasil Belajar Materi Pajak Penghasilan Pasal 21 kelas XI  Akuntansi dan Keuangan Lembaga 1 di SMK Negeri 1 Tarakan.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35334/borneo_humaniora.v6i1.3606"
    },
    {
        "id": 10053,
        "title": "PENGARUH PENGGUNAAN MEDIA PEMBELAJARAN GOOGLE CLASSROOM, GOOGLE MEET DAN MOTIVASI BELAJAR SISWA SMAN 3 MOJOKERTO",
        "authors": "ZAINAL ABIDIN, HARTONO HARTONO, SOEGITO SOEGITO",
        "published": "2023-4-8",
        "citations": 0,
        "abstract": "Online learning options are a must, because online learning really helps students to improve learning outcomes and learning motivation. The research aims to determine the learning outcomes and scientific attitudes of students who are taught using Google Classroom and Google Meet learning media. The population in this study were students of class X IPS SMA Negeri 3 Mojokerto in the academic year 2020/2021. Sampling was carried out using pretest and posttest techniques, the results of data analysis showed that there was an increase in learning outcomes using google classroom and google meet for ips majors as many as 15 students, after getting pretest and posttest treatment. Students have better scores when the treatment has been carried out compared to before the treatment was carried out, so it can be concluded that Learning outcomes of students taught using learning motivation media were higher than students taught using google classroom and google meet media. That the influence of learning media with Google classroom and goolge meet as 80% relaxation techniques is effective for students of SMA 3 Mojokerto majoring in IPS in physics learning material on Newton's Law\nABSTRAKPilihan pembelajaran secara Online adalah sebuah keharusan, sebab pembelajaran Online sangat membantu peserta didik untuk meningkatkan hasil belajar dan motivasi belajar. Penelitian ini bertujuan agar mengetahui hasil belajar serta sikap ilmiah peserta didik yang diajarkan menggunakan media Pembelajaran google Classroom dan Google Meet. Populasi dalam penelitian ini adalah siswa/Siswi kelas X IPS SMA Negeri 3 Mojokerto tahun pelajaran 2020/2021. Pengambilan sampel dilakukan menggunakan teknik Pretes dan Post test, hasil analisis data menunjukkan ada kenaikan hasil pembelajaran menggunakan google classroom dan google meet terhadap siswa jurusan ips sebanyak 15 siswa, setelah mendapatkan perlakuan pretest dan posttest. Siswa memiliki nilai lebih baik saat sudah dilakukan perlakuan dibandingkan dengan sebelum dilakukan perlakuan, jadi dapat disimpulkan bahwa Hasil Belajar peserta didik yang diajarkan menggunakan media motivasi belajar lebih tinggi dibandingkan dengan peserta didik yang diajarkan dengan media google classroom dan google meet. Bahwa pengaruh media pembelajaran dengan Google classroom dan goolge meet sebagai teknik relaksasi 80%, efektif untuk siswa sman 3 mojokerto jurusan ips dalam pembelajaran Fisika materi Hukum Newton",
        "keywords": "",
        "link": "http://dx.doi.org/10.51878/edutech.v3i1.2071"
    },
    {
        "id": 10054,
        "title": "Recursive reordering and elimination method for efficient computation of PageRank problems",
        "authors": "Zhao-Li Shen, Yu-Tong Liu, Bruno Carpentieri, Chun Wen, Jian-Jun Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>The PageRank model is widely utilized for analyzing a variety of scientific issues beyond its original application in modeling web search engines. In recent years, considerable research effort has focused on developing high-performance iterative methods to solve this model, particularly when the dimension is exceedingly large. However, due to the ever-increasing extent and size of data networks in various applications, the computational requirements of the PageRank model continue to grow. This has led to the development of new techniques that aim to reduce the computational complexity required for the solution. In this paper, we present a recursive 5-type lumping algorithm combined with a two-stage elimination strategy that leverage characteristics about the nonzero structure of the underlying network and the nonzero values of the PageRank coefficient matrix. This method reduces the initial PageRank problem to the solution of a remarkably smaller and sparser linear system. As a result, it leads to significant cost reductions for computing PageRank solutions, particularly in scenarios involving large and/or multiple damping factors. Numerical experiments conducted on over 50 real-world networks demonstrate that the proposed methods can effectively exploit characteristics of PageRank problems for efficient computations.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.20231282"
    },
    {
        "id": 10055,
        "title": "Estudio de competencias durante el COVID19 a través del uso de Google Classroom",
        "authors": "Rosa Padilla Ballesteros",
        "published": "2023-2-13",
        "citations": 1,
        "abstract": "Se investigó el uso del modelo pedagógico Google Classroom en el fortalecimiento de las competencias del perfil de egreso del normalista con el Plan 2018. El autor presentó los resultados del estudio teórico practico, con enfoque cualitativo y paradigma interpretativo, su objetivo describir la actividad de la plataforma en el fortalecimiento de las competencias genéricas, profesionales y disciplinares en el curso optativo Seminario de Apreciación Literaria en ocho alumnos normalistas del cuarto semestre de la especialidad de español en educación secundaria mediante el estudio instrumental de caso durante el ciclo escolar 2020-2021. Se aplicaron 8 entrevistas con 10 preguntas, para validar el resultado se emplearon las técnicas de análisis de los documentos en el tablón, las guías de observación y el diario de campo. Las categorías resultantes refieren al normalista y el desarrollo de competencias del Plan 2018, el aprovechamiento de Meet como estrategia de conectividad y su perspectiva emergente del aprendizaje, los normalistas y el trabajo en el aula invertida y la evaluación del aprendizaje en el aula de Google Classroom. Se ostenta en un nivel de codificación abierta, se muestran resultados con datos empíricos que recuperan la voz de los normalistas a través de sus narraciones y vivencias cotidianas. Se rescatan los procesos emergentes y la exploración de significados del modelo Google Classroom, la primera argumentación se orienta en la apropiación de las competencias y uso del modelo debido a que el normalista se apropia del uso de Google Classroom resultado personal y su interés por la asignatura.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56712/latam.v4i1.381"
    },
    {
        "id": 10056,
        "title": "ANALISIS SENTIMEN DATA ULASAN PENGGUNA APLIKASI GOOGLE KELAS PADA GOOGLE PLAY STORE MENGGUNAKAN ALGORITMA NAÏVE BAYES",
        "authors": "Dalilah Nurwahidah, Gifthera Dwilestari, Nisa Dienwati Nuris, Riri Narasati",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "Dalam era digital yang semakin berkembang, aplikasi Google Kelas telah menjadi salah satu platform utama untuk pembelajaran jarak jauh di Indonesia. Namun, pemahaman tentang sentimen pengguna terhadap aplikasi ini menjadi krusial dalam meningkatkan kualitas layanan Pendidikan online. Oleh karena itu, tujuan dari penelitian ini adalah untuk menganalisis sentimen dari data ulasan pengguna Aplikasi Google Kelas di Indonesia yang tersedia di Google Play Store.Data yang digunakan dalam penelitian ini akan diperoleh dari ulasan pengguna Aplikasi Google Kelas yang telah dipublikasikan di Google Play Store. Data tersebut mencakup beragam aspek, seperti penilaian pengguna, komentar dan saran yang akan digunakan untuk analisis sentimen.Penelitian ini akan mengikuti beberapa tahapan. Tahap awal adalah pengumpulan data dari ulasan pengguna. Selanjutnya, data akan dibersihkan dan diproses untuk analisis sentiment. Metode Naïve Bayes digunakan untuk mengklasifikasikan sentimen ulasan menjadi positif, negatif atau netral. Analisis sentimen melibatkan pemahaman lebih mendalam tentang persepsi pengguna terhadap aplikasi Google Kelas. Proses penelitian ini melibatkan pengolahan data, pelatihan model Naïve Bayes, evaluasi model dan analisis hasil. Data ulasan diproses untuk menghasilkan fitur- fitur yang relevan, dan kemudian model Naïve Bayes dilatih menggunakan data tersebut. Evaluasi model memastikan keakuratan analisis sentiment.Dengan menyelesaikan penelitian ini, diharapkan dapat memahami lebih baik bagaimana penguna di Indonesia merasakan aplikasi Google Kelas. Berdasarkan hasil penelitian yang telah dilakukan, hasil analisis sentimen pengguna aplikasi google kelas menghasilkan akurasi 82%, presisi 82%, recall 82% dan F-1 Score 81%. Dapat disimpulkan bahwa klasifikasi algoritma naïve bayes bisa digunakan untuk analisis sentimen aplikasi Google Kelas.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36040/jati.v7i6.8245"
    },
    {
        "id": 10057,
        "title": "Avrupa Birliği Genel Mahkemesi’nin Google Shopping Kararının Bir İncelemesi (An Analysis of the Google Shopping Decision of the General Court of the European Union)",
        "authors": "Sahin Ardiyok, Baris Yuksel, Selcukhan Unekbas",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4320595"
    },
    {
        "id": 10058,
        "title": "A Paradox Explained: Why a Super Selective β1-blocker Works in Acute Heart Failure",
        "authors": "Thomas Feuerstein",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33548/scientia885"
    },
    {
        "id": 10059,
        "title": "Fintech Explained – How Technology Is Transforming Financial Services",
        "authors": "Michael Robert King",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4633330"
    },
    {
        "id": 10060,
        "title": "Analysis and application of knowledge points in English network course teaching by using PageRank",
        "authors": "Lianmei Deng",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijnvo.2023.133875"
    },
    {
        "id": 10061,
        "title": "How cellular transport can be explained with a flip book",
        "authors": "Christina Elsner",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "All cells, from bacteria to humans, need to be able to transport substances from their inside to the outside and vice-versa. To understand how this transport works, scientists often had to remove transporters from their natural environment to study them, which may significantly alter their behavior. What if a “cellular” flip book was created to better mimic a transporter’s motions?",
        "keywords": "",
        "link": "http://dx.doi.org/10.25250/thescbr.brk712"
    },
    {
        "id": 10062,
        "title": "Zebra: When Temporal Graph Neural Networks Meet Temporal Personalized PageRank",
        "authors": "Yiming Li, Yanyan Shen, Lei Chen, Mingxuan Yuan",
        "published": "2023-2",
        "citations": 2,
        "abstract": "\n            Temporal graph neural networks (T-GNNs) are state-of-the-art methods for learning representations over dynamic graphs. Despite the superior performance, T-GNNs still suffer from high computational complexity caused by the tedious recursive temporal message passing scheme, which hinders their applicability to large dynamic graphs. To address the problem, we build the theoretical connection between the temporal message passing scheme adopted by T-GNNs and the temporal random walk process on dynamic graphs. Our theoretical analysis indicates that it would be possible to select a few influential temporal neighbors to compute a target node's representation without compromising the predictive performance. Based on this finding, we propose to utilize T-PPR, a parameterized metric for estimating the influence score of nodes on evolving graphs. We further develop an efficient single-scan algorithm to answer the top-\n            k\n            T-PPR query with rigorous approximation guarantees. Finally, we present Zebra, a scalable framework that accelerates the computation of T-GNN by directly aggregating the features of the most prominent temporal neighbors returned by the top-\n            k\n            T-PPR query. Extensive experiments have validated that Zebra can be up to two orders of magnitude faster than the state-of-the-art T-GNNs while attaining better performance.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.14778/3583140.3583150"
    },
    {
        "id": 10063,
        "title": "Seahorse's power move is explained",
        "authors": "Corryn Wetzel",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/s0262-4079(23)00707-8"
    },
    {
        "id": 10064,
        "title": "The IPCC Shared Socioeconomic Pathways (SSPs): Explained, Critiqued, Replaced",
        "authors": "Ivo Welch",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4681042"
    },
    {
        "id": 10065,
        "title": "‘Oumuamua enigma explained — and more of this week’s best science graphics",
        "authors": "",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/d41586-023-00912-6"
    },
    {
        "id": 10066,
        "title": "The IPCC Shared Socioeconomic Pathways (SSPs): Explained, Evaluated, Replaced",
        "authors": "Ivo Welch",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4746788"
    },
    {
        "id": 10067,
        "title": "Axiomatic characterization of PageRank",
        "authors": "Tomasz Wąs, Oskar Skibski",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.artint.2023.103900"
    },
    {
        "id": 10068,
        "title": "Enumerating class relations weights to assess their importance in a graph representation model for detecting key classes using PageRank",
        "authors": "Ciprian-Bogdan Chirila, Ioana Sora",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icstcc59206.2023.10308446"
    },
    {
        "id": 10069,
        "title": "Buscadores alternativos a Google con IA generativa: análisis de You.com, Perplexity AI y Bing Chat [Alternative search engines to Google with generative AI: analysis of You.com, Perplexity AI and Bing Chat]",
        "authors": "Lluís Codina",
        "published": "2023",
        "citations": 1,
        "abstract": "Análisis comparativo de tres buscadores alternativos a Google con inteligencia artificial generativa: You.com, Perplexity AI y Bing Chat. Presentación de las características generales de los tres tipos de búsqueda actuales en internet: recuperación de información, sistemas de respuestas, y búsqueda generativa. Análisis funcional y de la interfaz de los tres sistemas seleccionados. Recomendaciones generales de su uso en entornos académicos.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3145/infonomy.23.002"
    },
    {
        "id": 10070,
        "title": "Google Translate, ChatGPT or Google Bard AI: A Study toward Non-English Department College Students’ Preference and Translation Comparison",
        "authors": "Niswatin Nurul Hidayati, Dewi Hidayatun Nihayah",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "The landscape of translation tools has evolved significantly, with an increasing reliance on artificial intelligence (AI) systems for various tasks. This study investigated the changing preferences among college students, especially those majoring outside of English departments, regarding the translation of abstracts from international journal articles. Besides, the authors also compared the translation results of Google Translate, ChatGPT and Google Bard AI. This research used qualitative research. The research results showed that the students prefer using AI such as ChatGPT or Google Bard AI. Moreover, whether the users used Google Translate, ChatGPT or Google Bard AI, the translation results showed that they were included in SL emphasis category.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35905/inspiring.v7i1.8821"
    },
    {
        "id": 10071,
        "title": "COMPARISON OF SPHERICAL TRIGONOMETRY METHOD, JEAN MEEUS ALGORITHM AND GOOGLE QIBLA FINDER IN DETERMINING OF THE QIBLA DIRECTION OF ISLAMIC HOSPITAL",
        "authors": "Firda Yunita Sari, Achmad Fachril Yusuf Ababil, Urwatun Nafis, Nita Ardelia, Rofina Muti'atun Khasanah, Nurissaidah Ulinnuha, Abdulloh Hamid",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Accuracy in facing the Qibla is an essential part of performing prayers. This vital value is evident when many mosques are built in public places. This article is qualitative with field data sources, namely coordinate points at the Jemursari Islamic Hospital mosque, Surabaya Islamic Hospital, and Al-Irsyad Hospital Surabaya. Once collected, the data was analyzed using three methods for calculating Qibla direction, namely Spherical Trigonometry, Jean Meeus, and Google Qibla Finder. This article found that the three methods obtained the same results at the Jemursari Islamic Hospital at 294°3'5\", at the Surabaya Islamic Hospital at 294° 3'6\", and at the Al-Irsyad Surabaya Hospital at 294°3'5 \". However, there is a difference between calculations and field measurements of 2°–7°, including within the Qibla deviation tolerance. It can be concluded that these three methods can accurately determine the Qibla direction in various locations. However, re-checking is required if the measurements exceed the tolerance limits.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21580/al-hilal.2023.5.2.17192"
    },
    {
        "id": 10072,
        "title": "Google Trends™ and Quality of Information Analyses of Google™ Searches Pertaining to Concussion",
        "authors": "Mehul Mehra, Pierce A. Brody, Simran Mehrotra, Om Sakhalkar, Todd Maugans",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1089/neur.2022.0084"
    },
    {
        "id": 10073,
        "title": "Extracting and translating a large video using Google cloud speech to text and translate API without uploading at Google cloud",
        "authors": "Sai Vamsi Varada, Sagar Pande",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0162802"
    },
    {
        "id": 10074,
        "title": "A flexible PageRank-based graph embedding framework closely related to spectral eigenvector embeddings",
        "authors": "Disha Shur, Yufan Huang, David F. Gleich",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41468-023-00129-6"
    },
    {
        "id": 10075,
        "title": "PROMOTION OF COMMERCIAL COMPANIES IN REGIONAL GOOGLE SEARCH",
        "authors": "Taras Mukha,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30525/978-9934-26-356-9-28"
    },
    {
        "id": 10076,
        "title": "Demonstrating Large Language Models on Robots",
        "authors": " Google DeepMind",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15607/rss.2023.xix.024"
    },
    {
        "id": 10077,
        "title": "Unexpected Rapid Corrosion in Mooring Chains Explained",
        "authors": "D. G. Bennet, P. Roffey",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "Abstract\nHigh rates of corrosion had led to severe material loss in a low-alloy medium carbon steel Tether Chain from an offshore mooring system after only 5 years in service. The material losses were caused by extensive corrosion pitting and wear damage from adjacent links. Substantial levels of biomass were detected in the seabed soil and seawater at depths below 20 meters. The corrosion products on the chain link surfaces also tested positive for slime forming microorganisms indicating mature biofilm formation with inclusion of microenvironments which enabled proliferation of diverse aerobic, facultative and anaerobic heterotrophic populations. Those identified by molecular microbiological methods employed included Acid-Producing, Iron-Oxidising, Sulphate-Reducing and Sulphur-Reducing populations. The findings from the analysis confirmed a mechanism of Microbiologically Induced Corrosion (MIC), with wear rates further exacerbated by the action of rubbing wear continually exposing fresh steel surfaces which corroded in the bacteria rich environment. The repetitive, cyclical nature of the combination of rubbing and corrosion resulted in unexpected, accelerated corrosion rates.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4043/34734-ms"
    },
    {
        "id": 10078,
        "title": "Sense explained",
        "authors": "Nripesh Trivedi",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "It is often wondered what is the way of doing something. In simpler words, what is the sense of doing something. This paper explains that. It gives a simple but accurate definition of sense that we can use everywhere.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18535/ijsrm/v12i03.ec02"
    },
    {
        "id": 10079,
        "title": "Node importance evaluation in multi-platform avionics architecture based on TOPSIS and PageRank",
        "authors": "Chang Liu, Jinyan Wang, Rui Xia",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": "AbstractWith the development of avionics industry, it is difficult for traditional combat equipment node evaluation method to meet our requirements under complex combat system. This paper presents a method of node importance evaluation which is suitable for modern avionics field and can be used for reference in other combat fields. In order to make better use of the different features of the node itself and the different connections between nodes, we use TOPSIS algorithm to model the characteristics of the node itself, and PageRank to measure the interdependence of all nodes. Therefore, a novel node contribution evaluation algorithm based on TOPSIS and PageRank is proposed in this paper. In addition, after the evaluation of node contribution, we found that there was also a functional relationship between the operational information entropy in the whole graph and the contribution of these nodes. On this basis, information entropy evaluation algorithm of the overall combat map is further proposed. After a lot of experiments, the reliability of our algorithm is evaluated on the indexes of the node's destruction-resistant performance and information transfer efficiency. Compared with the traditional universal algorithm, our proposed algorithm shows more interpretable and robust results in the field of avionics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13634-023-00979-3"
    },
    {
        "id": 10080,
        "title": "Google Assistant Assisted Language Learning (GAALL): ESL Learners’ Perception and Problem towards AI-powered Google Assistant-Assisted English Language Learning",
        "authors": "Moulieswaran N, Prasantha Kumar N S",
        "published": "2023-4-5",
        "citations": 2,
        "abstract": "The New-fangled strategy called Artificial Intelligence (AI) Assisted Language Learning (AI-ALL) incorporates Google Assistant (GA) to support the learning activities of learners. At present, it is considered Google Assistant Assisted Language Learning (GAALL). For many years, academicians have been exploring ways to use AI for tasks that are related to education. The major objectives of this study are to emphasize 1) The ESL learners' perceptions of using AI-powered Google Assistant for learning the English language; 2). The ESL learners’ problems are concerned with utilizing AI-powered Google Assistant to support language learning, especially in English. A survey instrument was employed to the data, including primary research objects, from (n = 141) engineering stream undergraduates. The data was gathered using a questionnaire with 5 points Likert scale. According to the survey, the vast majority of students, especially individuals who were learning English, had a positive opinion of AI-driven GA. The major problem is the lack of quality in GA on smartphones. However, it is envisaged that AI-powered GA in language learning, also known as GAALL, would be deployed as one of the instructional media that might help learners to learn English efficiently as a Second Language. This study suggests that further research studies in this field could be conducted to test the efficacy of AI in ESL contexts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11114/smc.v11i4.5977"
    },
    {
        "id": 10081,
        "title": "Divas, captains, ghosts, ants and bumble-bees: collaborator attitudes explained",
        "authors": "Olga Lehmann",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/d41586-024-00808-z"
    },
    {
        "id": 10082,
        "title": "Pengaruh Pembelajaran Daring Dengan Menggunakan Aplikasi Google Classroom Dan Google Meet Terhadap Minat Dan Hasil Belajar Matematika Mahasiswa",
        "authors": "Nika Fetria Trisnawati,  Supriadi, Sasmita Warfandu",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "Penelitian ini bertujuan untuk mengetahui pengaruh pembelajaran daring dengan mengguanakan aplikasi Google classroom dan Google Meet terhadap minat dan hasil belajar matematika mahasiswa. Jenis penelitian ini adalah penelitian Kuantitafif dengan desain one group pretest-posttest yang menggunakan Teknik pengumpulan data berupa observasi, tes hasil belajar, dan angket minat belajar. Sampel yang digunakan dalam penelitian ini adalah mahasiswa Program Studi Matematika semester II Universitas Munhammadiyah Sorong berjumlah 17 mahasiswa. Hasil penelitian ini menunjukkan bahwa pembelajaran daring dengan menggunakan aplikasi Google Classroom dan Google Meet dapat meningkatkan hasil belajar mahasiswa hal ini dapat dilihat dari perolehan nilai rata-rata  sebesar 71.35 sedangkan sebelum menggunakan aplikasi Google Classroom dan Google Meet nilai rata-rata mahasiswa sebesar 31. 24. Hal ini sejalan dengan respons yang diberikan mahasiswa mengenai minat belajar yang dimiliki. sebesar 43% merespons sangat setuju merasa senang terhadap pembelajaran yang berlangsung menggunakan aplikasi Google Classroom dan Google Meet. 39% merespons sangat setuju memperhatikan pembelajaran selama menggunakan aplikasi Google Classroom dan Google Meet. 50% merespons sangat setuju berpatisipasi dalam pembelajaran menggunakan aplikasi Google Classroom dan Google Meet. Dengan demkian dapat disimpulkan bahwa pembelajaran daring dengan menggunakan aplikasi Google Classroom dan Google Meet berpengaruh terhadap minat dan hasil belajar matematika mahasiswa semester II Prodi Matematika Universitas Muhammadiyah Sorong. Selain itu selama pembelajaran yang menggunakan aplikasi Google Classroom dan Google Meet juga mengalami beberapa kendala seperti keterbatasan kuota internet dan ketidakstabilan jaringan internet mengakibtkan beberapa mahasiswa tidak dapat mengikuti pembelajaran secara keseluruhan. Kata Kunci: Google Classsroom Dan Google Meet, Minat dan Hasil Belajar",
        "keywords": "",
        "link": "http://dx.doi.org/10.30605/proximal.v6i2.2929"
    },
    {
        "id": 10083,
        "title": "MULTİMODAL LOGO OLARAK GOOGLE DOODLES TASARIMLARINDA YAZAR VE ŞAİRLERİN BETİMLENMESİ",
        "authors": "Açelya B. GÖNÜLLÜ",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Çok uluslu bir Amerikan teknoloji şirketi ve dünya genelinde popüler bir internet arama motoru olan Google, 1998 yılında Burning Man Festivali'ni kutlamak üzere logosu üzerinde küçük bir değişiklik yaparak dinamik logo türünü uygulamaya başlamıştır. Multimodal bir yapı içinde kurgulanan bu dinamik logo, Google Doodles olarak adlandırılır. Doodles tasarımları her zaman yayınlanmamakta; önemli olaylar, keşifler veya kişileri kutlayan günlerde kullanılmaktadır. Böylece zaman faktörü, kullanıcıda merak ve beklenti duygusu yaratmaktadır. Bu çalışmada, 2009-2018 yılları arasında yayınlanmış olan, toplam sekiz yazar ve şairin doğum günlerini kutlayan doodle tasarımları incelenmiştir. Bu tasarımlarda, yazar ve şairlerin hangi tekniklerle ve nasıl betimlendiğini araştırmak amaçlanmıştır. Çalışmada veri toplama yöntemi olarak genel tarama modeli kullanılmış, doodle’lar teknik kiplerine göre sınıflandırılmış ve daha sonra göstergebilimsel yöntem ile içerik analizi yapılmıştır. Elde edilen bulgulara göre, yazar ve şairleri betimleme yöntemi olarak en çok eserden sahne ile iki boyutlu illüstrasyon tekniklerinin kullanıldığı görülmüştür. Eserden sahne tekniği kullanımının, yazar ve şairlerin popüler eserleri üzerinden gerçekleştirildiği sonucuna ulaşılmıştır. Bunun yanı sıra bu edebi eser betimlemelerinde, portre ve animasyon teknikleri kullanılmış olsa da bu tekniklerin diğerlerine kıyasla daha az tercih edildiği gözlemlenmiştir. Araştırmada yer verilen iki şair doodle tasarımında animasyon tekniğinin kullanılmış olması ise dikkat çekicidir. Bu tekniğin kullanılması sayesinde, şiir sanatının doğasına özgü zaman olgusunun başarılı bir şekilde yansıtılmış olduğu düşünülmektedir.\r\n\r\nAnahtar Kelimeler: Dinamik logo, Google Doodles, Göstergebilim, İllüstrasyon, Logo tasarımı, Multimodal, Şair, Yazar.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7456/tojdac.1322464"
    },
    {
        "id": 10084,
        "title": "“Library and Information Science” Explained and Embodied in 5 Minutes",
        "authors": "Jenna Hartel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4545057"
    },
    {
        "id": 10085,
        "title": "Einstein's Relativity is Explained Using a Simple Model",
        "authors": "Tony Yang, Guoliang FU",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4350121"
    },
    {
        "id": 10086,
        "title": "LLAS TECNOLOGÍAS EN LA EDUCACIÓN Y LOS DESAFÍOS DEL USO DE GOOGLE CLASSROOM EN LA ENSEÑANZA DE CIENCIAS",
        "authors": "Alexandra Moreno Pinho, Kleide de Andrade Ribeiro",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Este artigo apresenta uma análise dos desafios encontrados no uso do Google Classroom para o ensino de ciências. A pesquisa faz parte de uma dissertação de mestrado em andamento intitulada “Ferramentas Digitais na Educação - O Uso do Google Classroom para o Ensino de Ciências: Um Estudo de Caso”. O estudo visa aprofundar a compreensão do ensino de ciências através do uso do Google Classroom, com base em uma experiência realizada com estudantes do 8º ano em uma escola pública localizada em Feira de Santana, Bahia. Este trabalho se baseou na pesquisa bibliográfica como referência metodológica. Diante da constatação de que as ferramentas digitais estão provocando mudanças substanciais na sociedade, com impactos significativos na educação e na cultura escolar, desafiando paradigmas estabelecidos nas formas de ensinar e aprender, nosso estudo buscou identificar os desafios mais comuns relacionados ao uso do Google Classroom. Os resultados apontam para desafios que transcendem o ensino de ciências e se estendem a outras disciplinas, independentemente do contexto pandêmico. Esses desafios abrangem questões estruturais, desafios tecnológicos; falta de formação adequada dos professores; e restrições de acesso por parte dos estudantes. O conhecimento desses desafios compartilhados por outros educadores tem o potencial de contribuir positivamente para o sucesso na implementação de propostas de ensino, ao permitir a prevenção e enfrentamento dessas questões de forma mais eficaz.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51891/rease.v9i11.11952"
    },
    {
        "id": 10087,
        "title": "Google Business Profile or How to Create Your Identity on Google. Steps and Requirements",
        "authors": "Adrian Şerban Comănescu,  ",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61801/ouaess.2022.2.105"
    },
    {
        "id": 10088,
        "title": "Application of Google Earth in the Teaching of Integrated Physical Geography",
        "authors": "雨 曾",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/ae.2023.13121513"
    },
    {
        "id": 10089,
        "title": "Towards a Critical-PBLL utilizing ChatGPT and Google Bard within college English education",
        "authors": "Mi-Kyong Kim",
        "published": "2023-1-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15738/kjell.23..202309.741"
    },
    {
        "id": 10090,
        "title": "Detecting shortcut learning for fair medical AI using shortcut testing",
        "authors": "Alexander Brown, Nenad Tomasev, Jan Freyberg, Yuan Liu, Alan Karthikesalingam, Jessica Schrouff",
        "published": "2023-7-18",
        "citations": 5,
        "abstract": "AbstractMachine learning (ML) holds great promise for improving healthcare, but it is critical to ensure that its use will not propagate or amplify health disparities. An important step is to characterize the (un)fairness of ML models—their tendency to perform differently across subgroups of the population—and to understand its underlying mechanisms. One potential driver of algorithmic unfairness, shortcut learning, arises when ML models base predictions on improper correlations in the training data. Diagnosing this phenomenon is difficult as sensitive attributes may be causally linked with disease. Using multitask learning, we propose a method to directly test for the presence of shortcut learning in clinical ML systems and demonstrate its application to clinical tasks in radiology and dermatology. Finally, our approach reveals instances when shortcutting is not responsible for unfairness, highlighting the need for a holistic approach to fairness mitigation in medical AI.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41467-023-39902-7"
    },
    {
        "id": 10091,
        "title": "A chilli’s wrinkles and a cherry’s dimples explained",
        "authors": "",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/d41586-023-00132-y"
    },
    {
        "id": 10092,
        "title": "Pelatihan Penerapan Metode Statistika dan Integrasi Google Workspace untuk Visualisasi Data dengan Platform Google Data Studio di SMA Negeri 17 Jakarta",
        "authors": "Idriwal Mayusda, Elfira Febriani, Dedy Sugiarto, Ratna Mira Yojana",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "Kegiatan belajar mengajar di sekolah bertujuan tidak hanya untuk memberikan ilmu kepada peserta didik, namun juga untuk membuka pola pikir mereka sehingga mereka mampu memberikan makna terhadap ilmu yang mereka terima. SMA Negeri 17 Jakarta merupakan salah satu sekolah negeri terbaik di provinsi DKI Jakarta. Peningkatan kualitas pendidikan menjadi salah satu fokus SMA Negeri 17, hal ini dibuktikan dengan transformasi platform pembelajaran digital pasca terjadinya pandemi covid-19. Bertujuan mendukung pengembangan pendidikan di SMA Negeri 17, maka Jurusan Teknik Industri Universitas Trisakti melaksanakan kegiatan Pengabdian kepada Masyarakat (PkM) yang mengusung tema Pelatihan Penerapan Metode Statistika dan Integrasi Google Workplace dalam Evaluasi Pendidikan dan Pengajaran. Kegiatan PKM dilakukan dengan pelatihan mengenai platform Google Workspace dengan tools Google Data Studio yang merupakan aplikasi pengolahan data statistik tidak berbayar milik platform Google. Platform ini dapat dimanfaat oleh para pengajar di SMA Negeri 17 untuk berbagai kegiatan pendidikan, baik untuk proses mengajar maupun peningkatan manajemen sekolah. Hasil pelatihan menunjukkan bahwa pengetahuan dan keterampilan para guru meningkat 96,67% dari sebelumnya 14,67%. Kegiatan ini diharapkan dapat meningkatkan pengetahuan dan kemampuan para guru dalam menggunakan platform Google Workspace for Education untuk analisis statistika dalam bentuk visualisasi data dengan menggunakan tools Google Data Studio.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36277/abdimasuniversal.v5i2.304"
    },
    {
        "id": 10093,
        "title": "Artistic Machine AI and the Possibility of Sijo Rhythm ― Focusing on ChatGPT and Google Bard",
        "authors": "Nam-kyu Kim",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35610/keosls.2023.07.59.7"
    },
    {
        "id": 10094,
        "title": "Pendampingan Pemanfaatan Google Clasroom Dan Google Form Untuk Guru Sdn Sumberarum 2 Wates Blitar",
        "authors": "Rohmatus Syafi'ah, Nourma Oktaviarini, Ria Fajrin Rizqy Ana",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "Pembelajaran online telah diterapkan sejak covid-19 hingga saat ini. Faktanya guru belum maksimal dalam memanfaatkan media pembelajaran online. Hasil wawancara yang dilakukan di SDN Sumberarum 2 Wates Blitar menunjukkan dalam pembelajaran online selama pandemic 85% guru hanya memanfaatkan whatssap saja. Sisanya memanfaatkan media lain seperti google classroom, google meet, dan lainnya. Oleh karena itu, kegiatan pengabdian ini bertujuan untuk memberikan pendampingan kepada guru di SD tersebut dalam memanfaatkan media pembelajaran online selain whatssap yaitu google classroom dan google form. Pendampingan ini meliputi dua tahapan yaitu: 1) pemaparan materi terkait aplikasi google classroom dan google form dan 2) pendampingan praktik menggunakan aplikasi tersebut dalam pembelajaran. Kegiatan ini diikuti oleh 12 guru SDN 2 Sumberarurm Wates Blitar. Dalam kegiatan pendampingan ini 85% peserta terampil dalam memanfaatkan google classroom dan google form dan 70% peserta akan memanfaatkan media google classroom dan google form dalam pembelajaran pada masa new normal dengan metode blended learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59395/altifani.v3i6.495"
    },
    {
        "id": 10095,
        "title": "Smoking: an avoidable health disaster explained",
        "authors": "Richard Hodson",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/d41586-023-01837-w"
    },
    {
        "id": 10096,
        "title": "Online Platform Utilization in Face-to-face Classes    - Focus on Padlet and Google Docs -",
        "authors": "Mi-Ran Youm",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18704/kjjll.2023.03.96.25"
    },
    {
        "id": 10097,
        "title": "SARS-CoV-2 sneezing explained",
        "authors": "Mitch Leslie",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "Viral protein prods nerve cells, may be treatment target",
        "keywords": "",
        "link": "http://dx.doi.org/10.1126/science.ado2398"
    },
    {
        "id": 10098,
        "title": "Severe non-diabetic hypoglycemia unawareness, explained by a large fibrous tumor",
        "authors": "Shamma Alshamsi, Karim Meeran",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1530/endoabs.94.p75"
    },
    {
        "id": 10099,
        "title": "DG COMP’s Google AdTech Investigation",
        "authors": "Christian Bergqvist",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4574812"
    },
    {
        "id": 10100,
        "title": "Simple hierarchical PageRank graph neural networks",
        "authors": "Fei Yang, Huyin Zhang, Shiming Tao, Xiying Fan",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05666-6"
    },
    {
        "id": 10101,
        "title": "Clawback explained",
        "authors": "Victoria Michell",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41404-023-2074-y"
    },
    {
        "id": 10102,
        "title": "Student’s Response to the Google Classroom Application in Learning English of Junior High School Students",
        "authors": "Vinna Anggreani, Vidya Mandarani",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "The purpose of this study was to determine student responses to the use of the google classroom application in online learning of English subjects for class VIII-C SMPN 1 Prambon. Therefore, to support the smooth process of learning activities during the pandemic, teachers are emphasized to be more creative and innovative so that learning activities remain effective even though they are carried out online. As part of supporting the teaching and learning process, teachers use online learning application media. The online learning application media currently used by teachers at SMPN 1 Prambon is the Google Classroom application media. By using the google classroom application media, teachers can share materials and assignments for students while students can access materials and assignments that have been shared by the teacher and can be done in the application provided by the teacher. In this study used descriptive qualitative research methods by conducting direct interviews. The research location is at SMPN 1 Prambon. The results of student responses to the use of the Google Classroom application in online English learning have positive and negative responses. There are benefits that are felt by students, namely saving time, being easy and practical in carrying out learning process activities and being considered effective in the current pandemic conditions. In learning English, students are more interested in paying attention to the material provided in the form of learning videos. While for the negative response, learning English using the Google Classroom application is not fun and enough to make students feel bored because students often face obstacles, namely related to poor signal constraints and limited quotas, applications that sometimes have errors and must be updated, limited cellphone storage space makes students have difficulty in downloading the material provided, lack of communication between teachers and students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21070/ijemd.v21i.716"
    },
    {
        "id": 10103,
        "title": "A Comparison of DeepL Translate and Google Translate Considering Their English-Turkish and Turkish-English Translation Performances",
        "authors": "İsmail YAMAN",
        "published": "2023-2-25",
        "citations": 0,
        "abstract": "Günümüzde gelişen teknolojiden etkilenmeyen bir alandan bahsetmek neredeyse olanaksızdır. Çeviribilim alanı da teknolojik gelişmelerden kayda değer oranda etkilenmiştir. Bu etkiyi farklı açılardan olumlu ya da olumsuz olarak değerlendirmek mümkündür. Bir taraftan güncel makine çevirisi sistemleri tarafından sunulan kolaylık faktörü cezbedici bir unsur olarak değerlendirilebilirken diğer taraftan bu gelişmelerin çevirmenlik mesleği açısından ciddi bir tehdit teşkil edebileceği çıkarımında bulunulabilir. Makine çevirisi yazılımlarının bugünkü durumunu genel olarak incelediğimizde yapay zeka destekli nöral sistemlerin hafife alınamayacak derecede iyi sonuçlar verebildiğini gösteren çalışmalar mevcuttur. Bu çalışma yapay zeka destekli nöral ağlar kullanan DeepL Translate ve Google Translate çeviri sistemlerinin teknik özelliklerini ve güncel performanslarını karşılaştırmalı olarak ele almayı amaçlamaktadır. Karşılaştırma İngilizce-Türkçe ve Türkçe-İngilizce dilleri arasında her iki yazılıma da verilen aynı çeviri görevleri üzerinden yapılmıştır. Sağlıklı sonuç elde edebilmek için çeviri görevlerinde farklı metin türleri kullanılmıştır. Ortaya çıkan çeviriler standart bir dereceli puanlama anahtarı çerçevesinde üç farklı uzmanın kanısı alınarak değerlendirilmiştir. Söz konusu iki makine çevirisi yazılımının karşılaştırmalı çeviri performansı üzerinden elde edilen bulgular ışığında makine çevirisinin ilgili alanda ve sektörde gelecekti muhtemel rolü üzerine değerlendirmeler ortaya konmuştur.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29110/soylemdergi.1187172"
    },
    {
        "id": 10104,
        "title": "Gestión del trabajo colaborativo de diseño en ingeniería basada en procesos y usando Google Drive - [Collaborative design work management in engineering based on processes andusing Google Drive]",
        "authors": "Alejandro Santos Martínez-Sala, Juan Carlos Sánchez Aarnoutse",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26754/cinaic.2023.0139"
    }
]