[
    {
        "id": 6801,
        "title": "Stopping Early Hypothesis",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_305132"
    },
    {
        "id": 6802,
        "title": "Stopping-Early Hypothesis",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-19650-3_305133"
    },
    {
        "id": 6803,
        "title": "Surpassing early stopping: A novel correlation-based stopping criterion for neural networks",
        "authors": "Tamás Miseta, Attila Fodor, Ágnes Vathy-Fogarassy",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.127028"
    },
    {
        "id": 6804,
        "title": "No evidence that stopping antibiotics early encourages antibiotic resistance, say experts",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1211/pj.2017.20203279"
    },
    {
        "id": 6805,
        "title": "Early stopping criterion for LDPC",
        "authors": "Janak Sodha",
        "published": "2017-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cirsyssim.2017.8023197"
    },
    {
        "id": 6806,
        "title": "Α-Egan: Α-Energy Distance Gan with an Early Stopping Rule",
        "authors": "Junlong Zhao, Fangting Ji, Xin Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4327713"
    },
    {
        "id": 6807,
        "title": "Early rise and persistent inhibition of electromyography during failed stopping",
        "authors": "Mitchell Fisher, Hoa Trinh, Jessica O’Neill, Ian Greenhouse",
        "published": "No Date",
        "citations": 1,
        "abstract": "ABSTRACTReactively canceling movements is a vital feature of the motor system to ensure safety. This behavior can be studied in the laboratory using the stop signal task. There remains ambiguity about whether a “point-of-no-return” exists, after which a response cannot be aborted. A separate question concerns whether motor system inhibition associated with attempted stopping persists when stopping is unsuccessful. We address these two questions using electromyography (EMG) in two stop signal task experiments. Experiment 1 (n = 24) involved simple right and left index finger responses in separate task blocks. Experiment 2 (n = 28) involved a response choice between the right index and pinky fingers. To evaluate the approximate point-of-no-return, we measured EMG in responding fingers during the 100 ms preceding the stop signal and observed significantly greater EMG amplitudes during failed than successful stop trials in both experiments. Thus, EMG differentiated failed from successful stopping prior to the stop signal, regardless of whether there was a response choice. To address whether motor inhibition persists after failed stopping, we assessed EMG peak-to-offset durations and slopes (i.e., the rate of EMG decline) for go, failed stop, and successful stop (partial response EMG) trials. EMG peak-to-offset was shorter and steeper in failed stop trials compared to go and successful stop partial response EMG trials, suggesting motor inhibition persists even when failing to stop. These findings indicate EMG is sensitive to a point at which participants can no longer successfully stop an ongoing movement and suggest the peak-to-offset time of response-related EMG activity during failed stopping reflects stopping-related inhibition.",
        "link": "http://dx.doi.org/10.1101/2023.01.09.523332"
    },
    {
        "id": 6808,
        "title": "Deep Learning Early Stopping for Non-degenerate Ghost Imaging",
        "authors": "Chane Moodley, Bereneice Sephton, Valeria Rodríguez-Fajardo, Andrew Forbes",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nQuantum ghost imaging offers many advantages over classical imaging, including the ability to probe an object with one wavelength and record the image with another (non-degenerate ghost imaging), but suffers from slow image reconstruction due to sparsity and probabilistic arrival positions of photons. Here, we propose a two-step deep learning approach to establish an optimal early stopping point based on object recognition, even for sparsely filled images. In step one we enhance the reconstructed image after every measurement by a deep convolutional auto encoder, followed by step two in which a classifier is used to recognise the image. We test this approach on a non degenerate ghost imaging setup while varying physical parameters such as the mask type and resolution. We achieved a 5-fold decrease in image acquisition time at a recognition confidence of 75%. The significant reduction in experimental running time is an important step towards real-time ghost imaging, as well as object recognition with few photons, e.g., in the detection of light sensitive structures.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-244100/v1"
    },
    {
        "id": 6809,
        "title": "On stopping rules and the sex ratio at birth",
        "authors": "Victor Grech, William H. James, Josef Lauri",
        "published": "2018-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.earlhumdev.2018.09.005"
    },
    {
        "id": 6810,
        "title": "Sequence Imputation using Machine Learning with Early Stopping Mechanism",
        "authors": "Apoorva Rawat, Arun Solanki",
        "published": "2020-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/compe49325.2020.9200099"
    },
    {
        "id": 6811,
        "title": "Early Stopping Criterion for Recursive Least Squares Training of Behavioural Models",
        "authors": "Meabh Loughman, Sinead Barton, Ronan Farrell, John Dooley",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAs the physical makeup of cellular base-stations evolve into systems with multiple parallel transmission paths the effort involved in modelling these complex systems increases considerably. One task in particular which contributes to signal distortion on each signal path, is the power amplifier. In power amplifier modelling, Recursive Least Squares has been used in the past to train Volterra models with memory terms, however instability can occur when training the model weights. This manuscript provides a computationally efficient technique to detect the onset of instability and subsequently to inform the decision when to stop adaptive training of dynamic nonlinear behavioural models and avoid the onset of instability. This technique is experimentally validated using four different signal modulation schemes.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-452849/v1"
    },
    {
        "id": 6812,
        "title": "Correction to: Posterior alternatives with informative early stopping",
        "authors": "Nancy Flournoy, Sergey Tarima",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00362-023-01450-z"
    },
    {
        "id": 6813,
        "title": "Stopping Trials Early: Responsibility and Risks",
        "authors": "William McGuire, Henry L. Halliday",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1159/000514990"
    },
    {
        "id": 6814,
        "title": "Speeding Up Unsupervised Learning Through Early Stopping",
        "authors": "Andris Docaj, Yu Zhuang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386405"
    },
    {
        "id": 6815,
        "title": "An Early-Stopping Mechanism for DSCF Decoding of Polar Codes",
        "authors": "Ilshat Sagitov, Pascal Giard",
        "published": "2020-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sips50750.2020.9195213"
    },
    {
        "id": 6816,
        "title": "Hardware friendly early stopping structure for polar code",
        "authors": "Cemaleddin Simsek, Cenk Albayrak, Kadir Turk",
        "published": "2017-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu.2017.7960600"
    },
    {
        "id": 6817,
        "title": "Posterior alternatives with informative early stopping",
        "authors": "Nancy Flournoy, Sergey Tarima",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00362-023-01429-w"
    },
    {
        "id": 6818,
        "title": "Stopping at the Toll Gate",
        "authors": "",
        "published": "2017-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9789048531004-010"
    },
    {
        "id": 6819,
        "title": "Early Stopping of BP Polar Decoding Based on Parity-Check Sums",
        "authors": "Alireza Hasani, Lukasz Lopacinski, Eckhard Grass",
        "published": "2022-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/vtc2022-spring54318.2022.9860517"
    },
    {
        "id": 6820,
        "title": "Utilization of Encoding, Early Stopping, Hyper Parameter Tuning, and Machine Learning Models for Bank Fraud Detection",
        "authors": "Md Aminul Islam, Saumik Chowdhury, Anindya Nag, Nahi Mumtaj",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p><em><strong>Abstract</strong></em><strong>—</strong>An effective fraud detection system must protect millions of clients for a secure banking system, which can be achieved using machine learning and AI. In this article, we have applied four supervised machine learning models: k-nearest neighbors (KNN), random forest (RF), decision tree, and logistic regression (LR) algorithm to detect bank fraud for a synthetic dataset having 1,00,000 rows and 32 columns. Adequate preprocessing, decoding, rigorous feature engineering, validation, performance evaluation, and explanation have allowed the readers to understand the whole study. Though the algorithms' accuracy is similar, logistic regression shows a higher accuracy of 0.98921 for label encoding, which is not prescribed. Still, a significant AUC of 95% has been achieved in XGBoost and LGBM. Further application of this study can be done in real-life cases of banks, insurance, and finance institutions.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24319243"
    },
    {
        "id": 6821,
        "title": "Early stopping criteria for adaptive training of dynamic nonlinear behavioural models",
        "authors": "Meabh Loughman, Ronan Farrell, John Dooley",
        "published": "2019-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/issc.2019.8904923"
    },
    {
        "id": 6822,
        "title": "Utilization of Encoding, Early Stopping, Hyper Parameter Tuning, and Machine Learning Models for Bank Fraud Detection",
        "authors": "Md Aminul Islam, Saumik Chowdhury, Anindya Nag, Nahi Mumtaj",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p><em><strong>Abstract</strong></em><strong>—</strong>An effective fraud detection system must protect millions of clients for a secure banking system, which can be achieved using machine learning and AI. In this article, we have applied four supervised machine learning models: k-nearest neighbors (KNN), random forest (RF), decision tree, and logistic regression (LR) algorithm to detect bank fraud for a synthetic dataset having 1,00,000 rows and 32 columns. Adequate preprocessing, decoding, rigorous feature engineering, validation, performance evaluation, and explanation have allowed the readers to understand the whole study. Though the algorithms' accuracy is similar, logistic regression shows a higher accuracy of 0.98921 for label encoding, which is not prescribed. Still, a significant AUC of 95% has been achieved in XGBoost and LGBM. Further application of this study can be done in real-life cases of banks, insurance, and finance institutions.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24319243.v1"
    },
    {
        "id": 6823,
        "title": "Stopping by Woods in Mashpee Territory: Belonging in William Apess's Indian Nullification",
        "authors": "Lloyd Alimboyao Sy",
        "published": "2023",
        "citations": 0,
        "abstract": " Abstract: This essay analyzes how William Apess's Indian Nullification (1835) articulates a form of belonging that emphasizes inclusivity and communality (affiliative belonging) against settler colonialism's insistence that belonging is anchored in possession and property (proprietary belonging). It draws on recent critical appraisals of Indigenous kinship and community that emphasize the commingling of Native and white practices, but it centers tangible environmental markers—specifically the cutting and carting away of wood as presented in Apess's text—as the loci for a more general argument over how people should live with each other. I draw much from Apess's depiction of the Mashpee Meeting-house, a religious structure made of wood whose retrieval by the Mashpee concurrently pushes to establish their conception of communal belonging with nature and with each other. The Mashpee form of belonging is also incarnate in two other ways in Indian Nullification : in Apess's discussion of his adoption into the Mashpee tribe and in the very structure of the book. By contrasting how the Mashpee treat the management of wood and wooden creations with settler colonial impositions, Apess conceptualizes how Indigenous peoples could create communities and express an alternative idea of belonging in the antebellum United States.",
        "link": "http://dx.doi.org/10.1353/eal.2023.a909703"
    },
    {
        "id": 6824,
        "title": "Fewer Questions, More Answers: Truncated Early Stopping for Proxy Means Testing",
        "authors": "Tim Ohlenburg, Juul Pinxten, Daniel Fricke, Fabio Caccioli",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4296951"
    },
    {
        "id": 6825,
        "title": "Stopping Trials Early Due to Harm",
        "authors": "Thomas Cook, Olive D. Buhule",
        "published": "2022-4-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1056/evidctw2100026"
    },
    {
        "id": 6826,
        "title": "A Recursive Early-Stopping Phase King Protocol",
        "authors": "Christoph Lenzen, Sahar Sheikholeslami",
        "published": "2022-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3519270.3538425"
    },
    {
        "id": 6827,
        "title": "Towards a two-stage model of action-stopping: Attentional capture explains motor inhibition during early stop-signal processing",
        "authors": "Joshua R. Tatz, Cheol Soh, Jan R. Wessel",
        "published": "No Date",
        "citations": 6,
        "abstract": "SummaryThe ability to stop an already initiated action is paramount to adaptive behavior. Most scientific debate in the field of human action-stopping currently focuses on two interrelated questions. First: Which mental and neural processes underpin the implementation of inhibitory control, and which reflect the attentional detection of salient stop-signals instead? Second: Why do physiological signatures of inhibition occur at two different latencies after stop-signals (for visual signals, either before or after ∼150ms)? Here, we address both questions via two pre-registered experiments that combined transcranial magnetic stimulation, electromyography, and multi-variate pattern analysis of whole-scalp electroencephalography. Using a stop-signal task that also contained a second type of salient signal that did not require stopping, we found that both signals induced equal amounts of early-latency inhibitory activity, whereas only later signatures (after 175ms) distinguished the two. These findings resolve ongoing debates in the literature and strongly suggest a two-step model of action-stopping.",
        "link": "http://dx.doi.org/10.1101/2021.02.26.433098"
    },
    {
        "id": 6828,
        "title": "Early Stopping Criteria for Levenberg-Marquardt Based Neural Network Training Optimization",
        "authors": "Azizah Suliman, Batyrkhan Omarov",
        "published": "2018-12-9",
        "citations": 2,
        "abstract": "In this research we train a direct distributed neural network using Levenberg-Marquardt algorithm. In order to prevent overtraining, we proposed correctly recognized image percentage based on early stop condition and conduct the experiments with different stop thresholds for image classification problem. Experiment results show that the best early stop condition is 93% and other increase in stop threshold can lead to decrease in the quality of the neural network. The correct choice of early stop condition can prevent overtraining which led to the training of a neural network with considerable number of hidden neurons.  ",
        "link": "http://dx.doi.org/10.14419/ijet.v7i4.36.25382"
    },
    {
        "id": 6829,
        "title": "Early stopping for statistical inverse problems via truncated SVD estimation",
        "authors": "Gilles Blanchard, Marc Hoffmann, Markus Reiß",
        "published": "2018-1-1",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/18-ejs1482"
    },
    {
        "id": 6830,
        "title": "A generic battery-cycling optimization framework with learned sampling and early stopping strategies",
        "authors": "Changyu Deng, Andrew Kim, Wei Lu",
        "published": "2022-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patter.2022.100531"
    },
    {
        "id": 6831,
        "title": "Early stopping in clinical PET studies: how to reduce expense and exposure",
        "authors": "Jonas Svensson, Martin Schain, Gitte M. Knudsen, Todd Ogden, Pontus Plavén-Sigray",
        "published": "No Date",
        "citations": 2,
        "abstract": "Clinical positron emission tomography (PET) research is costly and entails exposing participants to radioactivity. Researchers should therefore aim to include just the number of subjects needed to fulfill the purpose of the study. In this tutorial we show how to applysequential Bayes Factor testingin order to stop the recruitment of subjects in a clinical PET study as soon as enough data have been collected to make a conclusion. By using simulations, we demonstrate that it is possible to stop a study early, while keeping the number of erroneous conclusions low. We then apply sequential Bayes Factor testing to a real PET data set and show that it is possible to obtain support in favor of an effect while simultaneously reducing the sample size with 30%. Using this procedure allows researchers to reduce expense and radioactivity exposure for a range of effect sizes relevant for PET research.",
        "link": "http://dx.doi.org/10.1101/2020.09.13.20192856"
    },
    {
        "id": 6832,
        "title": "Alleviating Over-Fitting in Attribute Reduction: An Early Stopping Strategy",
        "authors": "Keyu Liu, Jingjing Song, Wendong Zhang, Xibei Yang",
        "published": "2018-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwapr.2018.8521316"
    },
    {
        "id": 6833,
        "title": "A Fault Trend Predictive System for Early Warning of Non-Stopping Manufacturing Processes Based on Scalogram",
        "authors": "SHI FENG, John P.T. Mo",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4205027"
    },
    {
        "id": 6834,
        "title": "Simplified Early Stopping Criterion for Polar Codes",
        "authors": "Jianming Cui, Jun Li, Yanfei Dong, Xiaojun Zhang, Qingtian Zeng",
        "published": "2018-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icspcc.2018.8567778"
    },
    {
        "id": 6835,
        "title": "Explainable Early Stopping for Action Unit Recognition",
        "authors": "Ciprian Corneanu, Meysam Madadi, Sergio Escalera, Aleix Martinez",
        "published": "2020-11",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/fg47880.2020.00080"
    },
    {
        "id": 6836,
        "title": "Joshua Stopping the Sun in the Gesù",
        "authors": "Evonne Levy",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1163/9789004677654_009"
    },
    {
        "id": 6837,
        "title": "Dynamic Meta-Learning Acquisition Function Method for Bayesian Optimization with Early Stopping Criteria for Hyperparameter Optimization",
        "authors": "Farshad Seifi, Seyed Taghi Akhavan Niaki",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4205030"
    },
    {
        "id": 6838,
        "title": "Mu2e stopping target monitor data flow",
        "authors": "Pawel Plesniak",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1988463"
    },
    {
        "id": 6839,
        "title": "Most powerful test sequences with early stopping options",
        "authors": "Sergey Tarima, Nancy Flournoy",
        "published": "2022-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00184-021-00839-w"
    },
    {
        "id": 6840,
        "title": "Abstract O-43: EARLY STOPPING OF RANDOMIZED CONTROLLED TRIALS IN PEDIATRIC CRITICAL CARE",
        "authors": "M. Duffett, G. Xu, D. Cook",
        "published": "2018-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1097/01.pcc.0000537385.92332.23"
    },
    {
        "id": 6841,
        "title": "A Generic Battery Cycling Optimization Framework with Learned Sampling and Early Stopping Strategies",
        "authors": "Changyu Deng, Wei Lu",
        "published": "2022-10-9",
        "citations": 0,
        "abstract": "  \tBattery optimization is a challenging task due to the large amount of cost and time required to evaluate different configurations in experiment or simulation. It is especially costly to optimize cycling performance since cycling the batteries is costly and time-consuming. In this project, we report an optimization framework with learned sampling and early stopping strategies, designed to optimize battery parameters in an efficient way to reduce total cycling time. It consists of a pruner and a sampler. The pruner stops unpromising cycling batteries to save the budget for further exploration. The sampler can predict the next promising configurations based on query history. The framework can deal with categorical, discrete and continuous parameters, and can run in an asynchronously parallel way to allow multiple simultaneous cycling cells. We demonstrated the performance by a parameter fitting problem for a calendar aging model. Comparisons with current methods are made to demonstrate the effectiveness of our method to reduce cycling time. Our framework can foster battery optimization in simulations and experiments.    ",
        "link": "http://dx.doi.org/10.1149/ma2022-02642334mtgabs"
    },
    {
        "id": 6842,
        "title": "Binomial early stopping times",
        "authors": "Nick Mulgan",
        "published": "2021-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/07474946.2021.2010409"
    },
    {
        "id": 6843,
        "title": "Early Stopping Based on Unlabeled Samples in Text Classification",
        "authors": "HongSeok Choi, Dongha Choi, Hyunju Lee",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.acl-long.52"
    },
    {
        "id": 6844,
        "title": "Fully corrective gradient boosting with squared hinge: Fast learning rates and early stopping",
        "authors": "Jinshan Zeng, Min Zhang, Shao-Bo Lin",
        "published": "2022-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2021.12.016"
    },
    {
        "id": 6845,
        "title": "Performance Analysis and Early Stopping Criterion for PA-BICM-ID Over Frequency-Selective Rayleigh Fading Channel",
        "authors": "Maciej Krasicki",
        "published": "2018-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csndsp.2018.8471753"
    },
    {
        "id": 6846,
        "title": "Progressive Forest: An Early Stopping Criteria For Building Ensembles",
        "authors": "Nayma Cepero Pérez, Mailyn Moreno Espino, Eduardo F. Morales, Milton García Borroto",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.13053/cys-27-1-4224"
    },
    {
        "id": 6847,
        "title": "Transmission Early-Stopping Scheme for Anti-Jamming Over Delay-Sensitive IoT Applications",
        "authors": "Rami D. Halloush",
        "published": "2019-10",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/jiot.2019.2911683"
    },
    {
        "id": 6848,
        "title": "Fewer Questions, More Answers: Truncated Early Stopping for Proxy Means Testing",
        "authors": "Tim Julian, Juul Pinxten, Daniel Fricke, Fabio Caccioli",
        "published": "2022-12-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1596/1813-9450-10255"
    },
    {
        "id": 6849,
        "title": "What’s Stopping Them?",
        "authors": "Nicholas Carnes",
        "published": "2018-9-11",
        "citations": 0,
        "abstract": "This chapter aims to shed light on the gates that keep workers out of office in the United States. Elections themselves appear to be the root cause. The analysis focuses on the two features of elections that seem to be behind the micro-level inequalities documented in Chapter 3, namely, the high and rising burdens associated with campaigning and the insular world of candidate recruitment. The practical anxieties that keep individual workers from running appear to stem from the very nature of elections in a representative democracy. The encouragement gaps that workers experience seem to arise from the basic logic of the candidate recruitment process, the fundamental challenges that lead many recruiters to simply look for new recruits within their own mostly white-collar personal networks.",
        "link": "http://dx.doi.org/10.23943/princeton/9780691182001.003.0004"
    },
    {
        "id": 6850,
        "title": "An Agreement Under Early Stopping and Fault Diagnosis Protocol in a Cloud Computing Environment",
        "authors": "Mao-Lun Chiang, Chin-Ling Chen, Hui-Ching Hsieh",
        "published": "2018",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2018.2859351"
    },
    {
        "id": 6851,
        "title": "There is no stopping covid-19 without stopping racism",
        "authors": "Abraar Karan, Ingrid Katz",
        "published": "2020-6-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1136/bmj.m2244"
    },
    {
        "id": 6852,
        "title": "Hardware optimization for belief propagation polar code decoder with early stopping criteria using high-speed parallel-prefix ling adder",
        "authors": "Cemaleddin Simsek, Kadir Turk",
        "published": "2017-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tsp.2017.8075964"
    },
    {
        "id": 6853,
        "title": "Efficient Reinforced Feature Selection via Early Stopping Traverse Strategy",
        "authors": "Kunpeng Liu, Pengfei Wang, Dongjie Wang, Wan Du, Dapeng Oliver Wu, Yanjie Fu",
        "published": "2021-12",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdm51629.2021.00051"
    },
    {
        "id": 6854,
        "title": "Early stopping in seamless phase I/<scp>II</scp> clinical trials",
        "authors": "Noor M. Khan, M. Iftakhar Alam",
        "published": "2021-3",
        "citations": 0,
        "abstract": "AbstractIn recent years, seamless phase I/II clinical trials have drawn much attention, as they consider both toxicity and efficacy endpoints in finding an optimal dose (OD). Engaging an appropriate number of patients in a trial is a challenging task. This paper attempts a dynamic stopping rule to save resources in phase I/II trials. That is, the stopping rule aims to save patients from unnecessary toxic or subtherapeutic doses. We allow a trial to stop early when widths of the confidence intervals for the dose‐response parameters become narrower or when the sample size is equal to a predefined size, whichever comes first. The simulation study of dose‐response scenarios in various settings demonstrates that the proposed stopping rule can engage an appropriate number of patients. Therefore, we suggest its use in clinical trials.",
        "link": "http://dx.doi.org/10.1002/pst.2084"
    },
    {
        "id": 6855,
        "title": "Early stopping of a randomised trial for efficacy: a medical, ethical and regulatory challenge",
        "authors": "Arthur Darmon, Gregory Ducrocq",
        "published": "2021-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1136/heartjnl-2021-318941"
    },
    {
        "id": 6856,
        "title": "More Negative FRN From Stopping Searches Too Late Than Too Early: An ERP Study",
        "authors": "Mei Gao, Xiaolan Yang, Linanzi Zhang, Qingguo Ma",
        "published": "2021-9-6",
        "citations": 1,
        "abstract": "It is widely known that the feedback from a decision outcome may evoke emotions like regret, which results from a comparison between the gain the decision-maker has made and the gain he/she might make. Less is known about how search behavior is linked to feedback in a sequential search task such as searching for jobs, employees, prices, investments, disinvestments, or other items. What are the neural responses once subjects decide to stop searching and receive the feedback that they stopped too early or too late compared with the optimal stopping time? In an experimental setting of a search task, we found that the feedback-related negativity (FRN) induced by the feedback from stopping too late was more negative than stopping too early, suggesting that subjects might experience stronger regret when stopping too late. Subjects preferred to stop searching earlier if the last feedback was that they stopped too late, and vice versa, although they did not always benefit more from such adjustment. This might reflect general patterns of human learning behavior, which also manifests in many other decisions. Gender differences and risk attitudes were also considered in the study.",
        "link": "http://dx.doi.org/10.3389/fnins.2021.705000"
    },
    {
        "id": 6857,
        "title": "‘Wiping Noses and Stopping Children from Killing Each Other’: Contesting an Only Quality Agenda",
        "authors": "Elise Hunkin",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-31627-3_5"
    },
    {
        "id": 6858,
        "title": "Generalized Early Stopping in Evolutionary Direct Policy Search",
        "authors": "Etor Arza, Léni K. Le Goff, Emma Hart",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "\n            Lengthy evaluation times are common in many optimization problems such as direct policy search tasks, especially when they involve conducting evaluations in the physical world, e.g. in robotics applications. Often when evaluating solution over a fixed time period it becomes clear that the objective value will not increase with additional computation time (for example when a two wheeled robot continuously spins on the spot). In such cases, it makes sense to stop the evaluation early to save computation time. However, most approaches to stop the evaluation are problem specific and need to be specifically designed for the task at hand. Therefore, we propose an early stopping method for direct policy search. The proposed method only looks at the objective value at each time step and requires no problem specific knowledge. We test the introduced stopping criterion in five direct policy search environments drawn from games, robotics and classic control domains, and show that it can save up to\n            \n\\(75\\%\\)\n\n            of the computation time. We also compare it with problem specific stopping criteria and show that it performs comparably, while being more generally applicable.\n          ",
        "link": "http://dx.doi.org/10.1145/3653024"
    },
    {
        "id": 6859,
        "title": "Early stopping by correlating online indicators in neural networks",
        "authors": "Manuel Vilares Ferro, Yerai Doval Mosquera, Francisco J. Ribadas Pena, Víctor M. Darriba Bilbao",
        "published": "2023-2",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.035"
    },
    {
        "id": 6860,
        "title": "Peaks Fusion assisted Early-stopping Strategy for Overhead Imagery Segmentation with Noisy Labels",
        "authors": "Chenying Liu, Conrad M Albrecht, Yi Wang, Xiao Xiang Zhu",
        "published": "2022-12-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata55660.2022.10020164"
    },
    {
        "id": 6861,
        "title": "Stopping Suspension in Early Childhood: Suggestions and Strategies",
        "authors": "Courtney E. O’Grady, Erin M. Jackle, Michaelene M. Ostrosky",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1177/10962506211068069"
    },
    {
        "id": 6862,
        "title": "Duality for Multiple Stopping",
        "authors": "Denis Belomestny, John Schoenmakers",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1057/978-1-137-03351-2_10"
    },
    {
        "id": 6863,
        "title": "Duality for Optimal Stopping",
        "authors": "Denis Belomestny, John Schoenmakers",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1057/978-1-137-03351-2_9"
    },
    {
        "id": 6864,
        "title": "Early Stopping of Non-productive Performance Testing Experiments Using Measurement Mutations",
        "authors": "Milad Abdullah, Lubomír Bulej, Tomáš Bureš, Vojtěch Horký, Petr Tůma",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/seaa60479.2023.00022"
    },
    {
        "id": 6865,
        "title": "Deep learning early stopping for non-degenerate ghost imaging",
        "authors": "Chané Moodley, Bereneice Sephton, Valeria Rodríguez-Fajardo, Andrew Forbes",
        "published": "2021-4-20",
        "citations": 17,
        "abstract": "AbstractQuantum ghost imaging offers many advantages over classical imaging, including the ability to probe an object with one wavelength and record the image with another (non-degenerate ghost imaging), but suffers from slow image reconstruction due to sparsity and probabilistic arrival positions of photons. Here, we propose a two-step deep learning approach to establish an optimal early stopping point based on object recognition, even for sparsely filled images. In step one we enhance the reconstructed image after every measurement by a deep convolutional auto-encoder, followed by step two in which a classifier is used to recognise the image. We test this approach on a non-degenerate ghost imaging setup while varying physical parameters such as the mask type and resolution. We achieved a fivefold decrease in image acquisition time at a recognition confidence of $$75\\%$$\n\n75\n%\n\n. The significant reduction in experimental running time is an important step towards real-time ghost imaging, as well as object recognition with few photons, e.g., in the detection of light sensitive structures.",
        "link": "http://dx.doi.org/10.1038/s41598-021-88197-5"
    },
    {
        "id": 6866,
        "title": "PADDLES: Phase-Amplitude Spectrum Disentangled Early Stopping for Learning with Noisy Labels",
        "authors": "Huaxi Huang, Hui Kang, Sheng Liu, Olivier Salvado, Thierry Rakotoarivelo, Dadong Wang, Tongliang Liu",
        "published": "2023-10-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01533"
    },
    {
        "id": 6867,
        "title": "stopping, adj.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/3491710441"
    },
    {
        "id": 6868,
        "title": "stopping, n.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/4597115648"
    },
    {
        "id": 6869,
        "title": "Action stopping",
        "authors": "Jan Wessel",
        "published": "No Date",
        "citations": 0,
        "abstract": "Imagine yourself carrying out an everyday behavior that you have performed hundreds or even thousands of times, like standing at a traffic light, getting ready to cross the street. Now imagine your usually appropriate behavior – walking on green – is suddenly rendered highly dangerous by unusual circumstances, like a car speeding towards the crosswalk that is not slowing down. In scenarios like these, humans can rely upon a remarkable ability to stop their actions, even after their initiation. Underlying this ability to stop such prepotent actions is inhibitory control. Once an already-initiated movement is recognized as not (or no longer) appropriate, inhibitory control processes can intercept and stop the action. This chapter provides an introductory overview on the purported neural mechanisms underlying inhibitory motor control during action-stopping in the human brain and discusses the current state of basic knowledge in the field.",
        "link": "http://dx.doi.org/10.31234/osf.io/9j63e"
    },
    {
        "id": 6870,
        "title": "Adaptive two-stage optimal designs for phase II clinical studies that allow early futility stopping",
        "authors": "Guogen Shan, Hua Zhang, Tao Jiang",
        "published": "2019-4-3",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/07474946.2019.1611307"
    },
    {
        "id": 6871,
        "title": "Stopping the Clock On Retirement: Target Wealth Stopping Time Problems",
        "authors": "James W Shearer, Harvey J. Stein",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3400400"
    },
    {
        "id": 6872,
        "title": "Assessment of Early Stopping through Statistical Health Prognostic Models for Empirical RUL Estimation in Wind Turbine Main Bearing Failure Monitoring",
        "authors": "Jürgen Herp, Niels L. Pedersen, Esmaeil S. Nadimi",
        "published": "2019-12-23",
        "citations": 9,
        "abstract": "Details about a fault’s progression, including the remaining-useful-lifetime (RUL), are key features in monitoring, industrial operation and maintenance (O&M) planning. In order to avoid increases in O&M costs through subjective human involvement and over-conservative control strategies, this work presents models to estimate the RUL for wind turbine main bearing failures. The prediction of the RUL is estimated from a likelihood function based on concepts from prognostics and health management, and survival analysis. The RUL is estimated by training the model on run-to-failure wind turbines, extracting a parametrization of a probability density function. In order to ensure analytical moments, a Weibull distribution is assumed. Alongside the RUL model, the fault’s progression is abstracted as discrete states following the bearing stages from damage detection, through overtemperature warnings, to over overtemperature alarms and failure, and are integrated in a separate assessment model. Assuming a naïve O&M plan (wind turbines are run as close to failure as possible without regards for infrastructure or supply chain constrains), 67 non run-to-failure wind turbines are assessed with respect to their early stopping, revealing the potential RUL lost. These are turbines that have been stopped by the operator prior to their failure. On average it was found that wind turbines are stopped 13 days prior to their failure, accumulating 786 days of potentially lost operations across the 67 wind turbines.",
        "link": "http://dx.doi.org/10.3390/en13010083"
    },
    {
        "id": 6873,
        "title": "What is stopping Early Career Psychiatrists (ECPs) from doing research in Sri Lanka?",
        "authors": "Yasodha Maheshi Rohanachandra, Dulangi Maneksha Amarasinghe Dahanayake, Miyuru Chandradasa",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ajp.2023.103466"
    },
    {
        "id": 6874,
        "title": "Efficient DP-FL: Efficient Differential Privacy Federated Learning Based on Early Stopping Mechanism",
        "authors": "Sanxiu Jiao, Lecai Cai, Jintao Meng, Yue Zhao, Kui Cheng",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32604/csse.2023.040194"
    },
    {
        "id": 6875,
        "title": "Stopping School Shootings: A Different Approach",
        "authors": "Mark Harrington",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23880/ijfsc-16000161"
    },
    {
        "id": 6876,
        "title": "Early Stopping Criterion Combining Probability Density Function with Validation Error for Improving the Generalization Capability of the Backpropagation Neural Network",
        "authors": "Wei WANG, Xue-feng YAN",
        "published": "2018-3-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12783/dtetr/amme2017/19507"
    },
    {
        "id": 6877,
        "title": "Early Decision and Stopping in Synchronous Consensus: A Predicate-Based Guided Tour",
        "authors": "Armando Castañeda, Yoram Moses, Michel Raynal, Matthieu Roy",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-59647-1_16"
    },
    {
        "id": 6878,
        "title": "A New Early Stopping Method for P300 Spellers",
        "authors": "Luigi Bianchi, Chiara Liti, Veronica Piccialli",
        "published": "2019-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tnsre.2019.2924080"
    },
    {
        "id": 6879,
        "title": "Primal Approximation Methods for Optimal Stopping",
        "authors": "Denis Belomestny, John Schoenmakers",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1057/978-1-137-03351-2_6"
    },
    {
        "id": 6880,
        "title": "earth-stopping, n.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/7333964861"
    },
    {
        "id": 6881,
        "title": "blood-stopping, n.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/4656593000"
    },
    {
        "id": 6882,
        "title": "Effect of early stopping on error performance of iterative MIMO equalization: An experience in reality",
        "authors": "Mampei Kasai, Hidekazu Murata, Toshiro Nakahira, Koichi Ishihara, Takatsune Moriyama",
        "published": "2020-10-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1587/comex.2020xbl0089"
    },
    {
        "id": 6883,
        "title": "A Correntropy Based Artificial Neural Network using Early Stopping for Daily Peak Load Forecasting",
        "authors": "Naoki Sato, Yoshikazu Fukuyama, Tatsuya Iizaka, Tetsuro Matsui",
        "published": "2020-9-23",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/sice48898.2020.9240336"
    },
    {
        "id": 6884,
        "title": "no-stopping, adj.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/7792405747"
    },
    {
        "id": 6885,
        "title": "earth-stopping, adj.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/1041902371"
    },
    {
        "id": 6886,
        "title": "Early Stopping Effectiveness for YOLOv4",
        "authors": "Afif Rana Muhammad, Hamzah Prasetio Utomo, Priyanto Hidayatullah, Nurjannah Syakrani",
        "published": "2022-4-26",
        "citations": 4,
        "abstract": "Background: YOLOv4 is one of the fastest algorithms for object detection. Its methods, i.e., bag of freebies and bag of specials, can prevent overfitting, but this can be combined with early stopping as it could also prevent overfitting.\nObjective: This study aims to identify the effectiveness of early stopping in preventing overfitting in the YOLOv4 training process.\nMethods: Four datasets were grouped based on the training data size and object class, These datasets were tested in the experiment, which was carried out using three patience hyperparameters: 2, 3, and 5. To assess the consistency, it was repeated eight times.\nResults: The experimental results show that early stopping is triggered more frequently in training with data below 2,000 images. Of the three patience hyperparameters used, patience 2 and 3 were able to halve the training duration without sacrificing accuracy. Patience 5 rarely triggers early stopping. There is no pattern of correlation between the number of object classes and early stopping.\nConclusion: Early stopping is useful only in training with data below 2,000 images. Patience with a value of 2 or 3 are recommended.\nKeywords: Early Stopping, Overfitting, Training data, YOLOv4",
        "link": "http://dx.doi.org/10.20473/jisebi.8.1.11-20"
    },
    {
        "id": 6887,
        "title": "Dual Monte Carlo Algorithms for Optimal Stopping",
        "authors": "Denis Belomestny, John Schoenmakers",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1057/978-1-137-03351-2_12"
    },
    {
        "id": 6888,
        "title": "Calculation of Stopping Power and Stopping time for Protons in Human Tissues",
        "authors": "Kadhim RO, Ali NS",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47275/0032-745x-164"
    },
    {
        "id": 6889,
        "title": "On the Impact of Early Stopping in Multiple Kernel Learning",
        "authors": "Ivano Lauriola",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63128-4_16"
    },
    {
        "id": 6890,
        "title": "heart-stopping, adj.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/7331419162"
    },
    {
        "id": 6891,
        "title": "Stopping Rules",
        "authors": " ",
        "published": "2020-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/mazlkc"
    },
    {
        "id": 6892,
        "title": "long-stopping, n.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/2862689872"
    },
    {
        "id": 6893,
        "title": "blood-stopping, adj.",
        "authors": "",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/oed/1010758562"
    },
    {
        "id": 6894,
        "title": "Stopping the Refugee Boats",
        "authors": "David Scott FitzGerald",
        "published": "2019-5-2",
        "citations": 0,
        "abstract": "Australia has unusually effective controls to deter asylum seekers as a result of its remote geography, regional hegemony, and relatively weak legal constraints. In the 1970s the government’s options were self-limited by foreign policy interests that favored asylum seekers fleeing the fallen ally of South Vietnam. By the 2000s, it had shifted toward a harsh policy built on buffers in Indonesia and Papua New Guinea, the “excisions” of particular Australian territories to restrict asylum seekers’ rights there, aggressive interceptions of visa-less travelers at sea, and offshore processing of maritime asylum seekers in other countries’ territories where most have been determined to be refugees by the UNHCR definition. The only current modest limitations on Canberra’s remote controls derive from reliance on other governments to do the work of buffering and caging and scrutiny by civil society.",
        "link": "http://dx.doi.org/10.1093/oso/9780190874155.003.0010"
    },
    {
        "id": 6895,
        "title": "Stopping: Getting Loaded",
        "authors": "Anne Balay",
        "published": "2018-9-24",
        "citations": 0,
        "abstract": "The places where truckers deliver their loads and get new ones are isolated and often dangerous. Since truckers are just moving through, they sometimes escape these dangers, but sometimes they are unable to. The experiences of queer, trans, and black truckers differ, but all have heightened vulnerability.",
        "link": "http://dx.doi.org/10.5149/northcarolina/9781469647098.003.0004"
    },
    {
        "id": 6896,
        "title": "Semi-empirical parameters for electronic stopping force model. Relative differences between experimental data and various stopping models (this model, SRIM2013, DPASS)",
        "authors": "Sascha Lüdeke, Arto Javanainen",
        "published": "2021-12-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17011/jyx/dataset/78898"
    },
    {
        "id": 6897,
        "title": "An Empirical Investigation of Early Stopping Optimizations in Proximal Policy Optimization",
        "authors": "Rousslan Fernand Julien Dossa, Shengyi Huang, Santiago Ontanon, Takashi Matsubara",
        "published": "2021",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2021.3106662"
    },
    {
        "id": 6898,
        "title": "Stopping Stupid Is Your Job",
        "authors": "",
        "published": "2020-12-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119623946.part1"
    },
    {
        "id": 6899,
        "title": "ZeroLess-DARTS: Improved Differentiable Architecture Search with Refined Search Operation and Early Stopping",
        "authors": "Najmeh Fayyazifar, Selam Ahderom, Najmeh Samadiani, Andrew Maiorana, Girish Dwivedi",
        "published": "2023-2-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3587716.3587725"
    },
    {
        "id": 6900,
        "title": "Stopping the spies:",
        "authors": "",
        "published": "2018-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18772/12018062156.15"
    }
]