[
    {
        "id": 25905,
        "title": "Sentiment Analysis on Social Media",
        "authors": "Jyoti Yadav",
        "published": "2023-1-9",
        "citations": 2,
        "abstract": "Sentiment analysis is a technique that uses machine learning, natural language processing, and computational linguistics to understand people's feelings and opinions on social media. With the growth of social media users, there is an abundance of information shared in various forms including text, photos, audio and video. Sentiment analysis divides this information into positive, negative or neutral sentiment and has been divided into three levels: sentence, document and features. There are two main methods of sentiment analysis: machine learning and lexicon-based approaches. Sentiment analysis has applications in understanding public perception of eco-friendly transformation and air quality, predicting box office success, and analyzing public sentiment during global events such as pandemics. However, there are challenges in developing accurate sentiment analysis models for all languages.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/yf9x04"
    },
    {
        "id": 25906,
        "title": "Automated Disaster Monitoring From Social Media Posts Using AI-Based Location Intelligence and Sentiment Analysis",
        "authors": "Fahim K. Sufi, Ibrahim Khalil",
        "published": "2024",
        "citations": 34,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcss.2022.3157142"
    },
    {
        "id": 25907,
        "title": "GSAC: A Gujarati Sentiment Analysis Corpus from Twitter",
        "authors": "Monil Gokani, Radhika Mamidi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.12"
    },
    {
        "id": 25908,
        "title": "Emotion and Sentiment Guided Paraphrasing",
        "authors": "Justin Xie, Ameeta Agrawal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.7"
    },
    {
        "id": 25909,
        "title": "Improving Dutch Vaccine Hesitancy Monitoring via Multi-Label Data Augmentation with GPT-3.5",
        "authors": "Jens Van Nooten, Walter Daelemans",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.23"
    },
    {
        "id": 25910,
        "title": "Discourse Mode Categorization of Bengali Social Media Health Text",
        "authors": "Salim Sazzed",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.6"
    },
    {
        "id": 25911,
        "title": "The social media sentiment analysis framework: deep learning for sentiment analysis on social media",
        "authors": "Prasanna Kumar Rangarjan, Bharathi mohan Gurusamy, Gayathri Muthurasu, Rithani Mohan, Gundala Pallavi, Sulochana Vijayakumar, Ali Altalbe",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "Researching public opinion can help us learn important facts. People may quickly and easily express their thoughts and feelings on any subject using social media, which creates a deluge of unorganized data. Sentiment analysis on social media platforms like Twitter and Facebook has developed into a potent tool for gathering insights into users' perspectives. However, difficulties in interpreting natural language limit the effectiveness and precision of sentiment analysis. This research focuses on developing a social media sentiment analysis (SMSA) framework, incorporating a custom-built emotion thesaurus to enhance the precision of sentiment analysis. It delves into the efficacy of various deep learning algorithms, under different parameter calibrations, for sentiment extraction from social media. The study distinguishes itself by its unique approach towards sentiment dictionary creation and its application to deep learning models. It contributes new insights into sentiment analysis, particularly in social media contexts, showcasing notable advancements over previous methodologies. The results demonstrate improved accuracy and deeper understanding of social media sentiment, opening avenues for future research and applications in diverse fields.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v14i3.pp3394-3405"
    },
    {
        "id": 25912,
        "title": "Sentiment and Emotion Classification in Low-resource Settings",
        "authors": "Jeremy Barnes",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.26"
    },
    {
        "id": 25913,
        "title": "Social Media Sentiment Analysis Classification Leveraging Hybrid Deep Learning Methods",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/icias.1615"
    },
    {
        "id": 25914,
        "title": "Decision Support System for Corporate Reputation Based Social Media Listening Using a Cross-Source Sentiment Analysis Engine",
        "authors": "R. Loke, S. Pathak",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012136400003541"
    },
    {
        "id": 25915,
        "title": "A Dataset for Explainable Sentiment Analysis in the German Automotive Industry",
        "authors": "Andrea Zielinski, Calvin Spolwind, Henning Kroll, Anna Grimm",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.13"
    },
    {
        "id": 25916,
        "title": "PESTO: A Post-User Fusion Network for Rumour Detection on Social Media",
        "authors": "Erxue Min, Sophia Ananiadou",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.1"
    },
    {
        "id": 25917,
        "title": "Sentimental Matters - Predicting Literary Quality by Sentiment Analysis and Stylometric Features",
        "authors": "Yuri Bizzoni, Pascale Moreira, Mads Rosendahl Thomsen, Kristoffer Nielbo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.2"
    },
    {
        "id": 25918,
        "title": "Sentiment Analysis for Detecting Scammer on Social Media: A Review",
        "authors": "",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Nowadays, social media become a part of human daily routine. It is a common routine for people to share their activities, feelings and information using social media. They feel it is easy to connect using social media. This trend has become a daily routine for many people. This situation attracts scammers to find their victims on social media. Sentiment analysis is one method that can prevent scammers' activities by analysing text contents such as social media posts, reviews and comments. A few techniques can be considered for developing sentiment analysis. The data, environment and situation are elements that developers should study before deciding the techniques to be used for developing sentiment analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55057/ijbtm.2023.5.3.57"
    },
    {
        "id": 25919,
        "title": "Modelling Political Aggression on Social Media Platforms",
        "authors": "Akash Rawat, Nazia Nafis, Dnyaneshwar Bhadane, Diptesh Kanojia, Rudra Murthy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.43"
    },
    {
        "id": 25920,
        "title": "Emotional sentiment analysis of social media content for mental health safety",
        "authors": "Ferdaous Benrouba, Rachid Boudour",
        "published": "2023-1-2",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-022-01000-9"
    },
    {
        "id": 25921,
        "title": "How to Control Sentiment in Text Generation: A Survey of the State-of-the-Art in Sentiment-Control Techniques",
        "authors": "Michela Lorandi, Anya Belz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.30"
    },
    {
        "id": 25922,
        "title": "Social Media Sentiment Analysis on Waqf and Education",
        "authors": "Raditya Sukmana, Aam Slamet Rusydiana",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "This research aims to measure public sentiment towards waqf education by using primary data derived from Twitter tweets. Sentiment measurement utilizes a Python Library software called VADER (Valence Aware Dictionary and Sentiment Reasoner) to classify the sentiment in each tweet analyzed. The results revealed that India was the location with the highest tweet activity around waqf education, reaching a total of 656 tweets. The highest peak of tweet activity occurred in 2020, with 170 tweets during the study period. In terms of sentiment polarity, the majority of tweets showed positive sentiment (48.3%), followed by neutral sentiment (27.0%), and negative sentiment (24.8%). The importance of these findings lies in the in-depth understanding of how people respond to and perceive waqf education. This sentiment analysis can provide valuable insights for decision makers and relevant stakeholders in developing and improving waqf education practices in the future",
        "keywords": "",
        "link": "http://dx.doi.org/10.58968/imr.v2i2.325"
    },
    {
        "id": 25923,
        "title": "AI Driven Sentiment Analysis for Social Media Data",
        "authors": "Ankit Kumar, Bharat Bhushan",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425434"
    },
    {
        "id": 25924,
        "title": "Sentiment Analysis on Social Media Tweets Using Machine Learning",
        "authors": "",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49873"
    },
    {
        "id": 25925,
        "title": "A Study on Social Media Responses on Road Infrastructure using  Sentiment Analysis",
        "authors": "",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33168/jliss.2023.0201"
    },
    {
        "id": 25926,
        "title": "Adapting Emotion Detection to Analyze Influence Campaigns on Social Media",
        "authors": "Ankita Bhaumik, Andy Bernhardt, Gregorios Katsios, Ning Sa, Tomek Strzalkowski",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.38"
    },
    {
        "id": 25927,
        "title": "Falsehood on social media in Egypt: Rumour detection and sentiment analysis of users’ comments",
        "authors": "Bassant Mourad Fahmi",
        "published": "2023-11-11",
        "citations": 0,
        "abstract": "The dissemination of rumours and fabricated information via social media has the potential to adversely impact social cohesiveness and contribute to political polarization, which may lead to political divisions by casting doubt on the effectiveness of government and politicians. In light of the global economic crisis caused by the Russian–Ukrainian War, this study aims to identify economic rumours that were circulating in Egyptian society via social media. Machine learning was employed as a means of analysing the sentiment of user comments on various posts, thus providing an effective method for debunking fake news. In order to identify the most salient features of misleading information, the study qualitatively assessed the visual and linguistic elements of the postings. A total of 10,031 comments were analysed after being categorized into main groups. The study’s results revealed key features pertaining to the sentiments expressed in the comments as well as identifying common textual traits of rumours and specific visual sentiments depicted in accompanying photos. This research sheds light on the importance of identifying and debunking rumours and fabricated information in order to mitigate their potentially negative effects on social cohesiveness and political polarization. Additionally, it highlights the utility of employing machine learning as a tool for analysing sentiment in user-generated content on social media platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1386/jammr_00069_1"
    },
    {
        "id": 25928,
        "title": "Combining Active Learning and Task Adaptation with BERT for Cost-Effective Annotation of Social Media Datasets",
        "authors": "Jens Lemmens, Walter Daelemans",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.22"
    },
    {
        "id": 25929,
        "title": "Analyzing Public Sentiment Towards the Covid-19 Pandemic: A Twitter-Based Sentiment Analysis and Machine Learning Approach",
        "authors": "Andreas Kanavos, Nikos Antonopoulos, Alaa Mohasseb, Phivos Mylonas",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smap59435.2023.10255176"
    },
    {
        "id": 25930,
        "title": "Sentiment Analysis of Social Media Text Based on Deep Learning",
        "authors": "Ludan Cao",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmnwc60182.2023.10435901"
    },
    {
        "id": 25931,
        "title": "Social Media Sentiment Analysis for Solar Eclipse with Text Mining",
        "authors": "Adem Korkmaz, Selma Bulut",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26650/acin.1207100"
    },
    {
        "id": 25932,
        "title": "User Sentiment Analysis Methods for Elderly Social Media Networks",
        "authors": "Shuaizhi Shen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "For the analysis of user sentiment in social media networks for the elderly population, emotional sentences are first extracted to classify movie reviews. Afterwards, social network data of the elderly population based on user search behavior is analyzed. The movie reviews of elderly social media users are analyzed for rating prediction. The research results indicate that the accuracy of sentiment classification results is in descending order of Dirichlet, maximum entropy, and support vector machine. The highest classification accuracy of the three algorithms is 87.1%, 86.9%, and 86.5%, respectively. The classification accuracy of the first level classifiers of Dirichlet, maximum entropy, and support vector machine are 90.7%, 88.7%, and 87.4%, respectively. The classification accuracy of the second level classifier is 86.7%, 83.7%, and 80.4%, respectively. The predictive analysis results of the research method are superior to those generated by using Slope One. The method proposed in the study can promote emotional analysis of film review texts, improving the analysis accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12694/scpe.v24i4.2479"
    },
    {
        "id": 25933,
        "title": "Social Media Sentiment Analysis",
        "authors": "Dhruv Kudalkar",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Abstract: In today's digital landscape, understanding and harnessing customer sentiment expressed across social media platforms is essential for the success of businesses, especially in the aviation and retail industries. This article delves into the profound significance of sentiment analysis in shaping strategic decisions and enhancing customer engagement in this digital age. Sentiment analysis emerges as a potent instrument for extracting invaluable insights from the vast reservoir of unstructured data that pervades social media platforms. We begin a thorough investigation of several social media sentiment analysis approaches in the context of this study. Both supervised and unsupervised procedures are included in our trip. In order to ensure a thorough knowledge of the applicability and subtleties of supervised approaches like Long Short-Term Memory (LSTM), which require labeled data for classification, we closely examine them. With SentiWordNet, we simultaneously explore the unsupervised domain, focusing on lexical sentiment analysis to sharpen the understanding of sentiment represented in the text. We provide a novel hybrid strategy that combines linear support vector machines (SVM) with latent semantic analysis (LSA). This combination delivers sentiment analysis that is more comprehensive and nuanced and is especially suited to the changing requirements of companies working in the digital era",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.56290"
    },
    {
        "id": 25934,
        "title": "Decoding Emotions: Harnessing the Power of Python for Sentiment Analysis in Social Media",
        "authors": "Mohammed RIZVI",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Social media usage is increasing tremendously, and it has become a necessity. A person needs to be able to use social media in order to compete in this ever-developing world of technology’s large number of people use social media, some for-entertainment purposes for educational purposes, Some for political, and others for economic purposes. To accommodate this tremendous amount of information that is being disseminated in social media to reflect the views of all these individuals. And all those views (information) have different sentiments echoed in them. To gain some data from the list of information, we need to analyze the feelings of the posts on social media. Sentiment analysis is a powerful tool that utilizes machine learning and natural language processing (NLP) to detect the sentiment - whether it be positive, negative, or neutral - in text. Two primary methods for conducting sentiment analysis are rule-based and automated. Convolutional neural networks (CNNs) and deep learning have been found successful in uncovering meaningful sentiments from texts, allowing for accurate classification of views expressed through written data. By breaking down each step thoughtfully with new ideas, active sentences instead of passive ones, stronger verbs for increased intensity, and synonyms to replace words that could be better used elsewhere, this makes up a successful rewrite of the original text.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55549/epess.1381979"
    },
    {
        "id": 25935,
        "title": "Spark-based Big Data Sentiment Analysis of Social Media Comments",
        "authors": "K. Subha, N. Bharathi",
        "published": "2023-11-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370518"
    },
    {
        "id": 25936,
        "title": "Emotion Analysis of Tweets Banning Education in Afghanistan",
        "authors": "Mohammad Ali Hussiny, Lilja Øvrelid",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.24"
    },
    {
        "id": 25937,
        "title": "Social Media Sentiment Analysis Using BERT During COVID-19",
        "authors": "Utkarsh Mishra, Abhishek Singh, Tulika Narang, Vineet kansal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4387787"
    },
    {
        "id": 25938,
        "title": "Sentiment Analysis for Hateful Content on Social Media",
        "authors": "Deeshant Bhattacharjee, Avishek Paul, Deepak Kumar",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10275876"
    },
    {
        "id": 25939,
        "title": "The Paradox of Multilingual Emotion Detection",
        "authors": "Luna De Bruyne",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.40"
    },
    {
        "id": 25940,
        "title": "Sentiment Analysis and Twitter Social Media Visualization Regarding the Omnibus Law Draft",
        "authors": "Fadli Emsa Zamani",
        "published": "2023-3-31",
        "citations": 2,
        "abstract": "This study will classify Twitter users' positive and negative opinions about the omnibus method using a frequency-inverse document frequency algorithm and a multi-layer perceptron method. The sentiment analysis process involves several stages, including B. Collecting and preprocessing data, calculating term weights using inverse term frequencies and document frequencies, and classifying data using multi-layer perceptrons. Additionally, the study visually represents Twitter's sentiment analysis results on the omnibus method. These visualizations include word cloud, top accounts, tweet frequency, hashtags, and sentiment. Three scenarios were considered to perform the classification experiments. Scenario 1 used 700 training data, scenario 2 used 800, and Scenario 3 used 900 training data. The findings show that the Term Frequency Inverse Document Frequency algorithm and the multi-layer perceptron method are adequate for sentiment analysis, with Scenario 3 yielding the highest accuracy rate of 88%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.60005/coreid.v1i1.4"
    },
    {
        "id": 25941,
        "title": "ChatGPT for Suicide Risk Assessment on Social Media: Quantitative Evaluation of Model Performance, Potentials and Limitations",
        "authors": "Hamideh Ghanadian, Isar Nejadgholi, Hussein Al Osman",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.16"
    },
    {
        "id": 25942,
        "title": "Social Media Monitoring Of Airbnb Reviews Using AI: A Sentiment Analysis Approach For Immigrant Perspectives In The UK",
        "authors": "Rebecca Balasundaram, Gayathri Karthick, Prashant Bikram Shah, Durga V. Nagarajan, Arivazhagan. R, Pradeep Earnest, Surjadeep Dutta",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "This paper presents a novel approach for monitoring social media content related to Airbnb reviews, explicitly focusing on the sentiments expressed by immigrants in the United Kingdom. The proposed system, a Quick Search System, leverages machine learning techniques to perform sentiment analysis on many Airbnb reviews. The system aims to provide timely and insightful information about the experiences and sentiments of immigrants in the UK, as reflected in their Airbnb reviews. By employing state-of-the-art machine learning algorithms, the system enables efficient and accurate sentiment classification, allowing for the identification of key themes and sentiments expressed by immigrant users. The study demonstrates the potential of this approach in gaining a deeper understanding of immigrant perspectives within the context of peer-to-peer accommodation, and its implications for social media monitoring and customer satisfaction management.This present study has conducted a critical analysis utilizing efficient feature extraction techniques, including N-grams and TF-IDF, to optimize identifying positive, neutral, and negative feedback. Furthermore, five different models were utilized, and the training and testing processes were accompanied by parameter tuning. Ultimately, the study concluded that the Random Forest (RF) classifier performed exceptionally well, achieving a 95% accuracy rate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59670/ml.v21is7.8919"
    },
    {
        "id": 25943,
        "title": "Uncovering Media Bias in Eviction Reporting: A Comprehensive Analysis Utilising Sentiment Analysis Framework and Social Media Data",
        "authors": "Ronny Mabokela Koena, Mpho Primus, Linda Mahlobo",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55492/dhasa.v5i1.5019"
    },
    {
        "id": 25944,
        "title": "Sentiment Analysis of Social Media Posts for Destinations",
        "authors": "Mustafa ÇEVRİMKAYA",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "Küresel dünyada turizm endüstrisine katılım gün geçtikçe artış göstermektedir. Endüstri içerisindeki en önemli olgulardan biri ise destinasyonlardır. Destinasyonun bir marka haline gelmesi veya destinasyon imajının ne kadar iyi olduğu turizmden pay alması ile paralellik gösterebilmektedir. Bu kapsamda devreye turizme katılan turistler girmekte ve turistlerin destinasyonlar hakkındaki düşünceleri destinasyonların geleceğini şekillendirebilmektedir. Destinasyonların geleceğinin olumlu açıdan şekillenebilmesi için deneyimlerini ve duygularını paylaşan turistlerin düşüncelerine değer vermek önemlidir. Turistler, kendilerini daha rahat hissettikleri için bu düşüncelerini genellikle sosyal medya üzerinden paylaşmayı uygun görmektedir. Bu çalışmada turistlerin bu paylaşımlarının incelebilmesi için duygu analizinden faydalanılmıştır. Paylaşılan tweet sayısının çok, verilerin manuel analiz edilmesinin ise zor olması duygu analizinin tercih edilmesinin en önemli nedenlerindendir. Zira duygu analizi verilerin otomatik analiz edilebilmesinde tercih edilen en önemli tekniklerden biridir. Bu sebeple bu çalışmanın amacı turistler tarafından paylaşılan tweetlerde zaman ve duyguların nasıl bir rol oynadığının belirlenmesidir. Çalışma bu yönüyle literatürdeki önemli bir boşluğu doldurmaktadır. Ayrıca çalışma, negatif duyguların, pozitife çevrilmesi veya pozitif duyguların daha da geliştirilmesi için öneriler sunduğundan dolayı destinasyon paydaşları için önemli olduğu düşünülmektedir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35674/kent.1316264"
    },
    {
        "id": 25945,
        "title": "Machine Learning for Sentiment Analysis Utilizing Social Media",
        "authors": "M. Arumugam, Snegaa S R, C. Jayanthi",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212135"
    },
    {
        "id": 25946,
        "title": "Social media-based demographic and sentiment analysis for disaster responses",
        "authors": "Seungil Yum",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "This study explores disaster responses across the United States for Winter Storm Jaxon in 2018 by utilizing demographic and sentiment analysis for Twitter®. This study finds that people show highly fluctuated responses across the study periods and highest natural sentiment, followed by positive sentiment and negative sentiment. Also, some sociodemographic and Twitter variables, such as gender and long text, are strongly related to human sentiment, whereas other sociodemographic and Twitter variables, such as age and the higher number of retweets, are not associated with it. The results show that governments and disaster experts should consider a multitude of sociodemographic and Twitter variables to understand human responses and sentiment during natural disaster events.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5055/jem.0781"
    },
    {
        "id": 25947,
        "title": "Sentiment analysis in media monitoring: areas of application and employers' request",
        "authors": "A.Yu. KAZAKOVA,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31249/rsoc/2023.02.06"
    },
    {
        "id": 25948,
        "title": "Performance Analysis of Sentiment Fusion Network for Social Media Services",
        "authors": "Arun Kumar, Vrinda Sachdeva, Ashish Kumar",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsai59793.2023.10421251"
    },
    {
        "id": 25949,
        "title": "Sentiment Analysis of Related Public Opinion Smart City Pasuruan Regency on Media Social Using Svm Algorithm",
        "authors": "Sony Nuhmana",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "Development in Pasuruan Regency is developed in a sustainable process, thus impacting daily community service activities. With interaction, the community feels what is done in the service process. With Smart City, these services are transformed into a more modern and computer-based form. Along with the development of social media. People often provide comments or opinions through social media, including Facebook.  Facebook is a social networking and microblogging service that makes it easier for users to read and send text-based messages. People's opinions are important information about their responses to district government programs, so they are important to record and analyze. The research conducted is an analysis of public opinion using the Support Vector Machine method. The most efficient method for text classification is the Support Vector Machine (SVM). SVM classification accuracy is 92.6%",
        "keywords": "",
        "link": "http://dx.doi.org/10.55324/josr.v2i4.702"
    },
    {
        "id": 25950,
        "title": "Toxicity and Sentiment Analysis About Digital Bounty on Social Media",
        "authors": "Fazjar Sekti Aji, Ade Iriani,  Hendry",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icast57874.2023.10359318"
    },
    {
        "id": 25951,
        "title": "Evaluating random sampling bias in sentiment analysis of social media data",
        "authors": "Xuanting Xiong",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "In this age marked by a wealth of information, the relevance of social networks has increased in a manner that is analogous to an exponential growth curve. Notably, the content that is shared on these platforms has the potential to act as a reflection of the emotional states that people are now experiencing. The importance of emotions is brought to light in the research presented here, which makes use of a technique based on a review of the relevant literature to analyze the problem of random sample bias and the effects that it has on sentiment analysis. It is possible to draw the conclusion, on the basis of the findings of the research, that the problem of random sample propensity is not a sporadic or insignificant one. In addition, the findings of the study indicate the presence of multiple types of prejudice. Because of the potential repercussions that could result from doing a distorted sentiment analysis, it is really necessary to keep your method focused.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/25/20240895"
    },
    {
        "id": 25952,
        "title": "Sentiment analysis for social media using SVM classifier of machine learning",
        "authors": "Qingyu Huang",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "The communitys perspectives and comments are a valuable resource for businesses and other organizations. In the past, businesses used inefficient procedures. Now that social media is the new trend, it enables an unprecedented level of analysis and evaluation. This enables unprecedented analysis and evaluation of various factors. This enables unprecedented analysis and evaluation of a wide range of topics and components in different contexts and settings. Throughout business history, these strategies have been expected. This field of study is called sentiment analysis. SVM was used to analyze sentiment for this research project. One of these duties required an SVM(SVM). Support vector machines, or SVM, is a popular supervised machine learning algorithm for determining text polarity. SVM abbreviates support vector machines. Precision, recall, and F-measure are used to evaluate SVM using two datasets of pre-classified tweets. Tables and graphs are used to communicate research findings. This research classifies tweets about US-Airlines and performs sentiment analysis with an accuracy of 91.8 percent, precision of 91.3 percent, and recall of 82.3 percent, as well as the F1 of 86.9 percent.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/20230354"
    },
    {
        "id": 25953,
        "title": "Analyzing Public Sentiment Towards Islamic Finance Through Social Media: Using Sentiment Analysis on Twitter Data",
        "authors": "Ayoub Razouk, Hamza Melliani, Jallal Mohamed El Adnani, Moulay El Mehdi Falloul",
        "published": "2023-12-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ria.370610"
    },
    {
        "id": 25954,
        "title": "Social Media Sentiment Analysis to Understand Agricultural Market Trends and Consumer Preferences",
        "authors": "January Rizki",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "Social media has become a very important communication platform in the daily life of modern society. People use these platforms to share their experiences, opinions, and preferences regarding various topics, including agricultural and food products. This research aims to conduct social media sentiment analysis to understand agricultural market trends and consumer preferences. This research is a literature review that adopts a qualitative method approach, which means it will analyse and interpret data by relying on information and text from various sources. The study results show that social media sentiment analysis is an invaluable tool for agricultural industry players in understanding market trends and consumer preferences. Using natural language processing and machine learning techniques, this analysis enables real-time monitoring of consumer opinions and feelings regarding agricultural products and agriculture-related issues.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/jmp.v12i2.12970"
    },
    {
        "id": 25955,
        "title": "Analyzing Social Media Data Using Sentiment Mining and Bigram Analysis for the Recommendation of YouTube Videos",
        "authors": "Ken McGarry",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "In this work we combine sentiment analysis with graph theory to analyze user posts, likes/dislikes on a variety of social media to provide recommendations for YouTube videos. We focus on the topic of climate change/global warming, which has caused much alarm and controversy over recent years. Our intention is to recommend informative YouTube videos to those seeking a balanced viewpoint of this area and the key arguments/issues. To this end we analyze Twitter data; Reddit comments and posts; user comments, view statistics and likes/dislikes of YouTube videos. The combination of sentiment analysis with raw statistics and linking users with their posts gives deeper insights into their needs and quest for quality information. Sentiment analysis provides the insights into user likes and dislikes, graph theory provides the linkage patterns and relationships between users, posts, and sentiment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14070408"
    },
    {
        "id": 25956,
        "title": "Public Perception of ChatGPT on Reddit Social Media Platform: Topic Modeling and Sentiment Analysis Study",
        "authors": "Mojtaba Talafidaryani, Sérgio Moro",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4716839"
    },
    {
        "id": 25957,
        "title": "Sentiment Analysis on Mixed-Language Social Media Post",
        "authors": "Faridah Hani Mohamed Salleh, Nor Zakiah Gorment, Muhammad Hazim Mohd Ridza",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoco59262.2023.10397971"
    },
    {
        "id": 25958,
        "title": "Sentiment Analysis of Social Media Data on COVID-19",
        "authors": "Adwita Arora, Krish Chopra, Divya Chaudhary, Ian Gorton, Bijendra Kumar",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "The COVID-19 pandemic has forced people to resort to social media to express their thoughts and opinions, which could be analysed further. In this paper, we aim to analyse the impact of the COVID-19 pandemic on social media users by Sentiment analysis of data collected from popular social media platforms, Twitter and Reddit. The textual data is preprocessed and is made fit for proper sentiment analysis using two unsupervised methods, VADER and TextBlob. Special care is taken to translate tweets or comments not in the English language to ensure their proper classification. We perform a comprehensive analysis of the emotions of the users specific to the COVID pandemic along with a time-based analysis of the trends, and a comparison of the performance of both the tools used. Geographical distribution of the sentiments is also done to see how they vary across regional boundaries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130802"
    },
    {
        "id": 25959,
        "title": "The Future of Meat: Sentiment Analysis of Food Tweets",
        "authors": "Matiss Rikters, Maija Kāle",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.socialnlp-1.5"
    },
    {
        "id": 25960,
        "title": "Queer Stigma on Social Media: A Sentiment Analysis of YouTube Video Comments",
        "authors": "Vikas Dogra -, Simran Sachdeva -",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "This paper is based on a sentiment analysis conducted on comments of YouTube videos about the Supreme Court of India’s verdict of October 17, 2023 concerning the legalisation of same-sex marriage. The paper attempts to analyse the prevalence of anti-queer sentiments in online comments and understand them in context of the social stigma surrounding the queer community in India. First, the prevalence of anti-queer sentiments, pro-queer sentiments and neutral sentiments are quantified.  Second, the different themes significant to a particular sentiment are identified. Finally, the relevance of anti-queer sentiments in propagation of messages stigmatising the queer community is discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i06.10315"
    },
    {
        "id": 25961,
        "title": "Novel Approach for Multimodal Sentiment Analysis in online Social Media Platform",
        "authors": "Priyanka Verma, Abhishek Singh, Tulika Narang, Manish Gaur",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4387785"
    },
    {
        "id": 25962,
        "title": "Sentiment prediction model in social media data using beluga dodger optimization-based ensemble classifier",
        "authors": "Priya Vinod, S. Sheeja",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-023-01111-x"
    },
    {
        "id": 25963,
        "title": "Sentiment Analysis on Social Media of Public Views Towards Vaccination",
        "authors": "Bayan Abu Shawar, Majdi Sawalha, Tarik Al Emsy, Nuha Hamada, Ribal Attoun, Anas Al-Momani",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/snams60348.2023.10375467"
    },
    {
        "id": 25964,
        "title": "Instruction Tuning for Few-Shot Aspect-Based Sentiment Analysis",
        "authors": "Siddharth Varia, Shuai Wang, Kishaloy Halder, Robert Vacareanu, Miguel Ballesteros, Yassine Benajiba, Neha Anna John, Rishita Anubhai, Smaranda Muresan, Dan Roth",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.3"
    },
    {
        "id": 25965,
        "title": "Sentiment Analysis Framework of Social Media Text by Feature Extraction and Machine Learning Model",
        "authors": "Kajal Mathur,  , Paresh Jain, Sunita Gupta, Puneet Mathur",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i29.1537"
    },
    {
        "id": 25966,
        "title": "Bimodal sentiment analysis in social media: a one-shot learning approach",
        "authors": "Zahra Pakdaman, Abbas Koochari, Arash Sharifi",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18748-1"
    },
    {
        "id": 25967,
        "title": "Sentiment Analysis on Multimodal Transportation during the COVID-19 Using Social Media Data",
        "authors": "Xu Chen, Zihe Wang, Xuan Di",
        "published": "2023-2-10",
        "citations": 5,
        "abstract": "This paper aims to leverage Twitter data to understand travel mode choices during the pandemic. Tweets related to different travel modes in New York City (NYC) are fetched from Twitter in the two most recent years (January 2020–January 2022). Building on these data, we develop travel mode classifiers, adapted from natural language processing (NLP) models, to determine whether individual tweets are related to some travel mode (subway, bus, bike, taxi/Uber, and private vehicle). Sentiment analysis is performed to understand people’s attitudinal changes about mode choices during the pandemic. Results show that a majority of people had a positive attitude toward buses, bikes, and private vehicles, which is consistent with the phenomenon of many commuters shifting away from subways to buses, bikes and private vehicles during the pandemic. We analyze negative tweets related to travel modes and find that people were worried about those who did not wear masks on subways and buses. Based on users’ demographic information, we conduct regression analysis to analyze what factors affected people’s attitude toward public transit. We find that the attitude of users in the service industry was more easily affected by MTA subway service during the pandemic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14020113"
    },
    {
        "id": 25968,
        "title": "Information Security in Social Media Sites: Sentiment Analysis of Email",
        "authors": "Adewale Adesoji Emmanuel, Tatsuya Yamazaki",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csit61576.2023.10324038"
    },
    {
        "id": 25969,
        "title": "Retrieving Users’ Opinions on Social Media with Multimodal Aspect-Based Sentiment Analysis",
        "authors": "Miriam Anschütz, Tobias Eder, Georg Groh",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc56153.2023.00008"
    },
    {
        "id": 25970,
        "title": "Sentiment-Driven Cryptocurrency Price Prediction: A Machine Learning Approach Utilizing Historical Data and Social Media Sentiment Analysis",
        "authors": "Saachin Bhatt, Mustansar Ghazanfar, Mohammad Hossein Amirhosseini",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "This research explores the impact of social media sentiments on predicting Bitcoin prices using machine learning models, integrating on-chain data, and applying a Multi Modal Fusion Model. Historical crypto market, on-chain, and Twitter data from 2014 to 2022 were used to train models including K-Nearest Neighbors, Logistic Regression, Gaussian Naive Bayes, Support Vector Machine, Extreme Gradient Boosting, and Multi Modal Fusion. Performance was compared with and without Twitter sentiment data which was analysed using the Twitter-roBERTa and VADAR models. Inclusion of sentiment data enhanced model performance, with Twitter-roBERTa-based models achieving an average accuracy score of 0.81. The best performing model was an optimised Multi Modal Fusion model using Twitter-roBERTa, with an accuracy score of 0.90. This research underscores the value of integrating social media sentiment analysis and onchain data in financial forecasting, providing a robust tool for informed decision-making in cryptocurrency trading.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/mlaij.2023.10301"
    },
    {
        "id": 25971,
        "title": "Emotions in Spoken Language - Do we need acoustics?",
        "authors": "Nadine Probol, Margot Mieskes",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.8"
    },
    {
        "id": 25972,
        "title": "Research on Text Sentiment Analysis Model and Its Application for Mental Health Based on Social Media Data",
        "authors": "",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53469/jerp.2023.05(08).19"
    },
    {
        "id": 25973,
        "title": "A Survey on NLP-Based Print and Social Media Sentiment Analysis",
        "authors": "Govinda Patil, Vivek Chaplot",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10456002"
    },
    {
        "id": 25974,
        "title": "Resale HDB Price Prediction Considering Covid-19 through Sentiment Analysis",
        "authors": "Srinaath Anbu Durai",
        "published": "2023-5-5",
        "citations": 2,
        "abstract": "Twitter sentiment has been used as a predictor to predict price values or trends in both the stock market and housing market. The pioneering works in this stream of research drew upon works in behavioural economics to show that sentiment or emotions impact economic decisions. Latest works in this stream focus on the algorithm used as opposed to the data used. A literature review of works in this stream through the lens of data used shows that there is a paucity of work that considers the impact of sentiments caused due to an external factor on either the stock or the housing market. This is despite an abundance of works in behavioural economics that show that sentiment or emotions caused due to an external factor impact economic decisions. To address this gap, this research studies the impact of Twitter sentiment pertaining to the Covid-19 pandemic on resale Housing Development Board (HDB) apartment prices in Singapore. It leverages SNSCRAPE to collect tweets pertaining to Covid-19 for sentiment analysis, lexicon-based tool, VADER, is used for sentiment analysis, Granger Causality is used to examine the relationship between Covid-19 cases and the sentiment score, and neural networks are leveraged as prediction models. Twitter sentiment pertaining to Covid-19 as a predictor of HDB price in Singapore is studied in comparison with the traditional predictors of housing prices i.e., the structural and neighbourhood characteristics. The results indicate that using Twitter sentiment pertaining to Covid-19 leads to better prediction than using only the traditional predictors and performs better as a predictor compared to two of the traditional predictors. Hence, Twitter sentiment pertaining to an external factor should be considered as important as traditional predictors. In a micro sense, this paper demonstrates the use of sentiment analysis of Twitter data in urban economics. In a macro sense, the paper demonstrates the extent to which social media is able to capture the behavioral economic cues of a population.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34190/ecsm.10.1.1020"
    },
    {
        "id": 25975,
        "title": "A Novel Social Media-Based Adaptable Approach for Sentiment Analysis Data",
        "authors": "M. Jeyakarthic, A. Leoraj",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceeict56924.2023.10156976"
    },
    {
        "id": 25976,
        "title": "EXPLORING SENTIMENT ANALYSIS RESEARCH: A SOCIAL MEDIA DATA PERSPECTIVE",
        "authors": "Zahra Dahish, Shah J Miah",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "Sentiment analysis has been rapidly employed for business decision support. New data mining researchers are yet to have an adequate understanding of the various applications of sentiment analysis while utilising social media data. As a result, it is critical to define the data mining and text analytics research trend holistically using existing literature. The study explores sentiment analysis research for its application in transforming social media data and identifies relevant research aspects through a comprehensive bibliometric review of 523 research articles published in the Scopus database (between 2018 and 2022) to discern the content and thematic analysis. Findings suggested that key purposes of the sentiment analysis are mainly related to innovation, transparency, and efficiency. Our review also highlights the distinctiveness of sentiment analysis for synthesising social media information to investigate various features, including the knowledge-domain map that detects author collaboration networks in the past.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/ijsc.2023.14101"
    },
    {
        "id": 25977,
        "title": "Sentiment Analysis and Classifying Hashtags in Social Media Using Data Mining Techniques",
        "authors": "",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18576/isl/120921"
    },
    {
        "id": 25978,
        "title": "Retracted: Sentiment Analysis of Statements on Social Media and Electronic Media Using Machine and Deep Learning Classifiers",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9846879"
    },
    {
        "id": 25979,
        "title": "Social media discourse and voting decisions influence: sentiment analysis in tweets during an electoral period",
        "authors": "Paulo Rita, Nuno António, Ana Patrícia Afonso",
        "published": "2023-3-7",
        "citations": 8,
        "abstract": "AbstractIn a time where social media is fundamental for any political campaign and to share a message with an electoral audience, this study searches for a conclusion of the actual persuasion capacity of social media in the electors when they need to decide whom to vote for as their next government. For this, it compares the sentiment that Social Media users demonstrated during an electoral period with the actual results of those elections. For this analysis, it was used, as a case study, tweets mentioning the two major English parties, Conservative and Labor, their respective candidates for the position of prime minister, and terms that identified their political campaign during the electoral period of the General Elections of the United Kingdom that occurred on December 12, 2019. Data were collected using R. The treatment and analysis were done with R and RapidMiner. Results show that tweets’ sentiment is not a reliable election results predictor. Additionally, results also show that it is impossible to state that social media impacts voting decisions. At least not from the polarity of the sentiment of opinions on social media.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-023-01048-1"
    },
    {
        "id": 25980,
        "title": "Generative Pretrained Transformers for Emotion Detection in a Code-Switching Setting",
        "authors": "Andrew Nedilko",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.61"
    },
    {
        "id": 25981,
        "title": "SentiMatch: Sentiment Analysis of Multi-modal Social Media Posts",
        "authors": "Abhishek Yadav, Nisarg Jain, Lakshay Sharma, Preety Singh",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116315"
    },
    {
        "id": 25982,
        "title": "Negativity spreads faster: A large-scale multilingual twitter analysis on the role of sentiment in political communication",
        "authors": "Dimosthenis Antypas, Alun Preece, Jose Camacho-Collados",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.osnem.2023.100242"
    },
    {
        "id": 25983,
        "title": "Towards echo chamber assessment by employing aspect-based sentiment analysis and GDM consensus metrics",
        "authors": "Miriam Amendola, Danilo Cavaliere, Carmen De Maio, Giuseppe Fenza, Vincenzo Loia",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.osnem.2024.100276"
    },
    {
        "id": 25984,
        "title": "Performance analysis of semantic veracity enhance (SVE) classifier for fake news detection and demystifying the online user behaviour in social media using sentiment analysis",
        "authors": "Monikka Reshmi Sethurajan, K. Natarajan",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-024-01199-9"
    },
    {
        "id": 25985,
        "title": "ChatGPT and GPTZero in Research and Social Media: A Sentiment-and Topic-based Analysis",
        "authors": "Maximilian Heumann, Tobias Kraschewski, Michael  H. Breitner",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4467646"
    },
    {
        "id": 25986,
        "title": "Transgender Community Sentiment Analysis from Social Media Data: a Natural Language Processing Approach",
        "authors": "Yuqiao Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.13-10-2023.2341032"
    },
    {
        "id": 25987,
        "title": "Not Just Iconic: Emoji Interpretation is Shaped by Use",
        "authors": "Brianna O’Boyle, Gabriel Doyle",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.39"
    },
    {
        "id": 25988,
        "title": "Sentiment Analysis on Twitter Social Media Regarding Depression Disorder Using the Naive Bayes Method",
        "authors": "Nur Lickha Lavenia, Reisa Permatasari",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "Depression disorder is a serious issue in mental health that affects many individuals worldwide. This research analyzes the sentiments related to depression disorder on Twitter using the Naïve Bayes method. Depression-related tweet data was collected through snscrape and processed to eliminate irrelevant information. Three Naïve Bayes methods, namely Multinomial, Gaussian, and Bernoulli, were compared to classify positive, negative, or neutral sentiments in each tweet. The results of the study indicate that Multinomial Naïve Bayes exhibited the best performance with an accuracy rate of 90.13%, followed by Gaussian Naïve Bayes (88.38%), and Bernoulli Naïve Bayes (85.37%).",
        "keywords": "",
        "link": "http://dx.doi.org/10.60005/coreid.v1i2.14"
    },
    {
        "id": 25989,
        "title": "Forecasting Stock Market Alternations Using Social Media Sentiment Analysis and Deep Neural Networks",
        "authors": "Christina Saravanos, Andreas Kanavos",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iisa59645.2023.10345902"
    },
    {
        "id": 25990,
        "title": "Analysis of Travel Agent Online Marketing Strategies on Social Media Content Using Sentiment Analysis and Social Network Analysis",
        "authors": "Ana Diyanti Khoirul Isya', Bambang Suratno, Abdullah Azzam",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "The growth and development of the internet users have given Indonesia an opportunity to develop internet-based services, such as online travel agents (OTA). Along with this OTA development, conventional travel agents were declining. Many conventional travel agents have decided to switch to online travel agents. The emergence of new OTAs has also made OTAs competition more challenging. Thus, a lesson learned from the market leader OTA is expected to help new OTAs surviving the competition. This research uses the sentiment analysis method to understand consumers' perceptions towards OTA and uses the social network analysis method to recognize actors who play significant roles in the travel agent business network. Lastly, the marketing strategies of the major and well-known OTAs perceived by online consumers was analyzed. Using the data collected from three major OTAs social media network (i.e., Traveloka, Tiket, and Booking), it was found that the general impression of consumers towards OTA is a positive sentiment. Furthermore, each key actor for each OTAs can be recognized. Lastly, marketing strategies can be proposed, namely by providing the complete product offerings, provide competitive price, creating special promos for consumers, promotion to be carried out on all social media using Bahasa Indonesia, and make the products offered available throughout Indonesia and can be used by everyone, especially travelers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51519/journalisi.v5i4.630"
    },
    {
        "id": 25991,
        "title": "NCUEE-NLP at WASSA 2023 Shared Task 1: Empathy and Emotion Prediction Using Sentiment-Enhanced RoBERTa Transformers",
        "authors": "Tzu-Mi Lin, Jung-Ying Chang, Lung-Hao Lee",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.49"
    },
    {
        "id": 25992,
        "title": "Social Media and Equilibrium Sentiment",
        "authors": "Mads Bibow Busborg Nielsen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4391665"
    },
    {
        "id": 25993,
        "title": "Social Media-Based Sentiment Analysis: Electric Vehicle Usage in Indonesia",
        "authors": "Helmi Salsabila, Roni Habibi, Nisa Hanum Harani",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "This research analyzes the sentiment regarding the use of electric vehicles in Indonesia through social media, utilizing over 10,000 data points from Twitter. The results indicate a variation of positive, negative, and neutral sentiments towards electric vehicles on social media. Female users play a significant role in expressing their views and actively participating in discussions related to electric vehicles. The locations with the highest user activity discussing electric vehicles are Indonesia, DKI Jakarta, Makassar, Tangerang, and Karawang. The peak activity was observed in September 2019, suggesting a significant interest in electric vehicles. The SVM algorithm achieved an accuracy of 88% for positive and neutral sentiments, but performed relatively lower for negative sentiments. This research lacks data on the gender and age of the respondents. Future studies should address these shortcomings to gain a deeper understanding of public perceptions regarding electric vehicles in Indonesia.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i3.3250"
    },
    {
        "id": 25994,
        "title": "A New Approach for Carrying Out Sentiment Analysis of Social Media Comments Using Natural Language Processing",
        "authors": "Mritunjay Ranjan, Sanjay Tiwari, Arif Md Sattar, Nisha S. Tatkar",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059181"
    },
    {
        "id": 25995,
        "title": "Fluency Matters! Controllable Style Transfer with Syntax Guidance",
        "authors": "Ji-Eun Han, Kyung-Ah Sohn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.15"
    },
    {
        "id": 25996,
        "title": "UNIDECOR: A Unified Deception Corpus for Cross-Corpus Deception Detection",
        "authors": "Aswathy Velutharambath, Roman Klinger",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.5"
    },
    {
        "id": 25997,
        "title": "Sentiment analysis of multi social media using machine and deep learning models: a review",
        "authors": "Vasanthi P, Madhu Viswanatham V",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18981-8"
    },
    {
        "id": 25998,
        "title": "Sentiment Analysis on User Feedback of a Social Media Platform",
        "authors": "Aaryan Singh, Harsh Srivastava, Mohd. Aman, Gaurav Dubey",
        "published": "2023-3-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscds56580.2023.10105082"
    },
    {
        "id": 25999,
        "title": "Aspect Based Sentiment Analysis Using Recurrent Neural Networks (RNN) on Social Media Twitter",
        "authors": "Muhammad Afryan Saputra, Erwin Budi Setiawan",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icodsa58501.2023.10276768"
    },
    {
        "id": 26000,
        "title": "Sentiment Analysis of Social Media Comments in Mauritius",
        "authors": "Nuzhah Gooda Sahib, Marie Angele Justine Marianne, Baby Gobin-Rahimbux",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc57344.2023.10099291"
    },
    {
        "id": 26001,
        "title": "First Six Months of War from Ukrainian topic and sentiment analysis",
        "authors": "Clara Maathuis, Iddo Kerkhof",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "Through technological advancements as well as due to societal trends and developments, social media became an active part and a catalysator of the ongoing conflicts and wars carried out in the physical environment. A direct example on this behalf are the cyber/information operations currently conducted in conjunction with the ongoing Russian-Ukrainian war. Due to such operations packaged in social media manipulation mechanisms like disinformation and misinformation using techniques such as controversies, fake news, and deep fakes, a high degree of confusion and uncertainty surrounds the events happened and users’ behaviour and beliefs. These operations also impact the civilians directly affected in the battlefield or their dear and known ones. To tackle this issue, currently limited scientific and objective effort is dedicated in this direction due to, e.g., data, strategic, and emotional implications. It is then the aim of this research to capture the main topics discussed and the feeling expressed by Ukrainian Telegram users on the ongoing Russian-Ukrainian war in 2022 using a Data Science approach by building a series of Machine Learning models based on multi-channel data collected in the first six of months of war. Accordingly, this research directly aims to contribute to efforts on understanding real discourses and dynamics involved in the ongoing conflict through direct resources, producing and sustaining social media security awareness, and building resilience to social media manipulation campaigns using AI.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34190/ecsm.10.1.1147"
    },
    {
        "id": 26002,
        "title": "Assessing Energy Communities’ Awareness on Social Media with a Content and Sentiment Analysis",
        "authors": "Myriam Caratù, Valerio Brescia, Ilaria Pigliautile, Paolo Biancone",
        "published": "2023-4-21",
        "citations": 5,
        "abstract": "The development of energy communities has the potential to support the energy transition owing to the direct engagement of people who have the chance to become “prosumers” of energy. In properly explaining the benefits that this phenomenon can give to the population, a key set of channels is represented by social media, which can hit the target of citizens who have the budget to join the energy communities and can also “nurture” younger generations. In this view, the present work analyzes the performance of the topic “energy communities” on the main social media in order to understand people’s awareness of its benefits and to assess the societal awareness of this topic in terms of engagement and positive sentiment. The analysis conducted first concerned the definitions and conceptualization of energy communities of academics and practitioners, completed through a content analysis; we then focused on the fallout of these themes on social media and on its engagement (to understand if it was capable of generating a positive attitude). The social media analysis took place through a platform that uses artificial intelligence to analyze communication channels. The results show that there is still poor engagement with the energy community theme in social media, and a more structured communication strategy should be implemented with the collaboration between social media and practitioners/academics. Despite previous studies not analyzing how social media recall the topics of academics and practitioners related to energy communities, this is an important aspect to consider in order to conceive integrated marketing communication for promoting energy communities to citizens, as here demonstrated and proposed for the very first time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15086976"
    },
    {
        "id": 26003,
        "title": "IDENTIFYING PANDEMIC ERA CONSUMER TRENDS: SENTIMENT ANALYSIS OF SOCIAL MEDIA POSTS",
        "authors": "Hafize Nurgül DURMUŞ ŞENYAPAR",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "The COVID-19 pandemic has significantly impacted consumer purchasing habits and lifestyles. This study analyzes 1,500 posts from Instagram, YouTube, and Facebook and found a transition towards online shopping and digital service engagement, focusing on convenience and safety. Positive sentiments were prevalent, indicating consumer acceptance and adaptation to new norms. Health and safety concerns were heightened, focusing on sanitizers, masks, and health supplements. Financial strategies were reevaluated, leading to increased budget-consciousness and a preference for essential goods over luxury items. Travel and leisure restrictions led to a preference for local and at-home alternatives, such as staycations and local tourism. Remote work and online education also emerged, suggesting a longer-term transformation in work and learning environments. Consumer commitment to sustainability and ethical consumption increased, with support for local businesses and eco-friendly products. This study offers insights into the evolving consumer psyche and foresight into lasting consumer behavior changes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30794/pausbed.1399760"
    },
    {
        "id": 26004,
        "title": "A Comprehensive Evaluation and Comparative Analysis of Data Mining Techniques for Sentiment Analysis in Social Media",
        "authors": " Sakhawia Kaleem Farogh",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "Sentiment analysis, also known as opinion mining, has emerged as a pivotal field in the realm of social media. With the exponential growth of user-generated content on various platforms, understanding and extracting sentiments have become essential for businesses and organizations. In this research paper, we embark on a meticulous journey, delving into a comprehensive evaluation and comparative analysis of various data mining techniques employed for sentiment analysis in social media. The primary objective of this study is to provide practitioners and researchers with valuable insights into the strengths, limitations, and performance metrics of these techniques. By conducting an extensive evaluation, we aim to shed light on the effectiveness of different data mining approaches in capturing sentiments accurately and efficiently. Furthermore, we explore the challenges and limitations associated with sentiment analysis in social media, addressing the intricacies involved in analysing the vast and dynamic landscape of user-generated content",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-11609"
    },
    {
        "id": 26005,
        "title": "Sentiment Analysis of Social Media Comments Using Machine Learning Algorithms",
        "authors": "Laman Taghiyeva, Narmin Hasanova, Masuda Omarova, Samir Rustamov",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pci60110.2023.10325944"
    },
    {
        "id": 26006,
        "title": "Sentiment Analysis System for Image and Text Based Social Media Data",
        "authors": "Hu Baoyue, Humaira Ashraf, Nz Jhanjhi, Sahil Verma",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/khi-htc60760.2024.10482213"
    },
    {
        "id": 26007,
        "title": "COMMENT ANALYZER FOR SENTIMENT ANALYSIS IN SOCIAL MEDIA AND E-COMMERCE PLATFORMS",
        "authors": "Ruchita Kumari, Soni Singh, Harish Shukla",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "This research paper introduces a Comment Analyzer designed for sentiment analysis in the dynamic environments of social media and e-commerce platforms. The project focuses on harnessing natural language processing (NLP) and machine learning techniques to analyze and interpret sentiments expressed in user comments on social media and e-commerce platforms. The Comment Analyzer aims to enhance user experience, improve customer relations, and facilitate data-driven decision-making processes in the realms of social media and e-commerce.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55524/csistw.2024.12.1.15"
    },
    {
        "id": 26008,
        "title": "A Dataset of Hotel Reviews for Aspect-Based Sentiment Analysis and Topic Modeling",
        "authors": "Christiana Andreou, Nicolas Tsapatsoulis, Vasiliki Anastasopoulou",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smap59435.2023.10255219"
    },
    {
        "id": 26009,
        "title": "Hierarchical Fusion Network with Enhanced Knowledge and Contrastive Learning for Multimodal Aspect-Based Sentiment Analysis on Social Media",
        "authors": "Xiaoran Hu, Masayuki Yamamura",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "Aspect-based sentiment analysis (ABSA) is a task of fine-grained sentiment analysis that aims to determine the sentiment of a given target. With the increased prevalence of smart devices and social media, diverse data modalities have become more abundant. This fuels interest in multimodal ABSA (MABSA). However, most existing methods for MABSA prioritize analyzing the relationship between aspect–text and aspect–image, overlooking the semantic gap between text and image representations. Moreover, they neglect the rich information in external knowledge, e.g., image captions. To address these limitations, in this paper, we propose a novel hierarchical framework for MABSA, known as HF-EKCL, which also offers perspectives on sensor development within the context of sentiment analysis. Specifically, we generate captions for images to supplement the textual and visual features. The multi-head cross-attention mechanism and graph attention neural network are utilized to capture the interactions between modalities. This enables the construction of multi-level aspect fusion features that incorporate element-level and structure-level information. Furthermore, for this paper, we integrated modality-based and label-based contrastive learning methods into our framework, making the model learn shared features that are relevant to the sentiment of corresponding words in multimodal data. The results, based on two Twitter datasets, demonstrate the effectiveness of our proposed model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23177330"
    },
    {
        "id": 26010,
        "title": "Tracking mosquito-borne diseases via social media: a machine learning approach to topic modelling and sentiment analysis",
        "authors": "Song-Quan Ong, Hamdan Ahmad",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Mosquito-borne diseases (MBDs) are a major threat worldwide, and public consultation on these diseases is critical to disease control decision-making. However, traditional public surveys are time-consuming and labor-intensive and do not allow for timely decision-making. Recent studies have explored text analytic approaches to elicit public comments from social media for public health. Therefore, this study aims to demonstrate a text analytics pipeline to identify the MBD topics that were discussed on Twitter and significantly influenced public opinion. A total of 25,000 tweets were retrieved from Twitter, topics were modelled using LDA and sentiment polarities were calculated using the VADER model. After data cleaning, we obtained a total of 6,243 tweets, which we were able to process with the feature selection algorithms. Boruta was used as a feature selection algorithm to determine the importance of topics to public opinion. The result was validated using multinomial logistic regression (MLR) performance and expert judgement. Important issues such as breeding sites, mosquito control, impact/funding, time of year, other diseases with similar symptoms, mosquito-human interaction and biomarkers for diagnosis were identified by both LDA and experts. The MLR result shows that the topics selected by LASSO perform significantly better than the other algorithms, and the experts further justify the topics in the discussion.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj.17045"
    },
    {
        "id": 26011,
        "title": "The evolution of studies on social media sentiment in the stock market: Insights from bibliometric analysis",
        "authors": "Kingstone Nyakurukwa, Yudhvir Seetharam",
        "published": "2023-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sciaf.2023.e01596"
    },
    {
        "id": 26012,
        "title": "The Application of Sentiment Analysis on Customers Responses in Social Media  (Case Study: Indihome and First Media Internet Service Provider)",
        "authors": "Feliks Prasepta Sejahtera Surbakti, Andi Arifta Ginting",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "The development of technology in industry 4.0 era leads to a digitalization process which is marked by the emergence of the internet as one of the important enablers. Indihome and Firstmedia are the most popular Internet Service Providers) ISPs in Indonesia in providing internet services. These two companies certainly have competition in winning the hearts of customers. One of the important factors in this business competition is customer response in the form of reviews which are usually done through social media tools such as Twitter. For this reason, it is important to study how the customer responds in the form of a given sentiment. Sentiment analysis can be a way to study customer responses to products and services. Sentiment Analysis is a method that is part of Big Data in Data Science which is useful for assessing sentiment in the form of positive or negative sentiments. The data collected was 1000 tweets for each ISP which will be processed with the help of Rstudio. The processing results obtained 177 positive tweets, 489 neutral, and 334 negative tweets for indihome while firstmedia obtained 620 positive tweets, 222 neutral tweets, and 158 negative tweets. The result is firstmedia ISPs get a better positive response and the number of complaints is less than indihome. Internet service providers (ISPs) can improve product and service quality by creating a single database system and also implementing the service design blueprint.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25170/metris.v23i02.4150"
    },
    {
        "id": 26013,
        "title": "Exploration of Contrastive Learning Strategies toward more Robust Stance Detection",
        "authors": "Udhaya Kumar Rajendran, Amine Trabelsi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.37"
    },
    {
        "id": 26014,
        "title": "Sentiment Analysis of Hashtag Activism on Social Media Twitter",
        "authors": "Sidharta Sidharta, Yaya Heryadi, Lukas Lukas, Wayan Suparta, Yulyani Arifin",
        "published": "2023-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccosite57641.2023.10127833"
    },
    {
        "id": 26015,
        "title": "Social Media Sentiment Analysis for Local Water Company Customers Using a Support Vector Machine Algorithm",
        "authors": " Prastiani, Hanif Fakhrurroja, Faqih Hamami",
        "published": "2023-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciss59129.2023.10291991"
    },
    {
        "id": 26016,
        "title": "Improving Sentiment Analysis in Social Media by Handling Lengthened Words",
        "authors": "Ashima Kukkar, Rajni Mohana, Aman Sharma, Anand Nayyar, Mohd. Asif Shah",
        "published": "2023",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3238366"
    },
    {
        "id": 26017,
        "title": "ChatGPT and the Social Media Echo: A Sentiment Analysis",
        "authors": "Ram Krishna Mishra, Rushit Palesha, Rahul Sumbly, Chandra Mani Sharma",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mosicom59118.2023.10458761"
    },
    {
        "id": 26018,
        "title": "Understanding Environmental Posts: Sentiment and Emotion Analysis of Social Media Data",
        "authors": "Daniyar Amangeldi, Aida Usmanova, Pakizar Shamoi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3371585"
    },
    {
        "id": 26019,
        "title": "Generalized Study on Sentiment Analysis on Social Media Using Machine Learning Techniques",
        "authors": "Mohamed Bodea",
        "published": "2023",
        "citations": 0,
        "abstract": "This paper discusses the increasing interest in using machine learning techniques to analyze human-written texts due to their widespread availability. Natural Language Processing (NLP) is essential for extracting accurate knowledge from these texts, but it faces challenges due to the vast amount of information and complex relationships among words. The proposed study introduces a novel feature selection technique using sentiment-based word vectors and knowledge about word influence on classifiers. An artificial neural network trained with reinforcement learning is employed to assess the impact of removing each word from the training dataset, using word embeddings for representation. This method predicts word ranks efficiently without complex statistical computations, even for new words in the corpus. The evaluation of the proposed method demonstrates its high accuracy (94.61%) in predicting word ranks not included in the training set. Additionally, feature selection based on these ranks enhances the performance of various classifiers, including Support Vector Machine (SVM), Naïve Bayes (NB), Random Forest (RF), Convolutional Neural Network (CNN), Long-Short-Term Memory (LSTM), and Gated Recurrent Unit (GRU). Among these classifiers, the GRU classifier achieves the highest accuracy (95.54%), surpassing other classifiers and state-of-the-art methods in literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62226/ijarst20231127"
    },
    {
        "id": 26020,
        "title": "Sentiment Analysis using Deep Learning based Emotion Extraction from Social Media Texts",
        "authors": "S.S. Suganya, B. Narmadha, Mukeshkumar S, Mugeesha C",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370200"
    },
    {
        "id": 26021,
        "title": "Sentiment Analysis of Social Media: Techniques, Applications, and Reliability",
        "authors": "Peter J. Ryan, Richard B. Watson",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3584871.3584911"
    },
    {
        "id": 26022,
        "title": "Machine Learning-Based Sentiment Analysis for the Social Media Platforms",
        "authors": "Prerna Upadhyay, Shahin Saifi, Ritu Rani, Arun Sharma, Poonam Bansal",
        "published": "2023-3-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10112120"
    },
    {
        "id": 26023,
        "title": "Comparison of Transformer Based and Traditional Models on Sentiment Analysis on Social Media Datasets",
        "authors": "Arif Ridho Lubis, Yulia Fatmi, Deden Witarsyah",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2ie60547.2023.10331232"
    },
    {
        "id": 26024,
        "title": "Deep Learning Techniques for Sentiment Analysis on Social Media Text",
        "authors": "Y. Ashrita, S. Abhiram, V. Hemanth, A. Srinivas, Punna Rao Vemula",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10398065"
    },
    {
        "id": 26025,
        "title": "Transformer-based Prediction of Emotional Reactions to Online Social Network Posts",
        "authors": "Irene Benedetto, Moreno La Quatra, Luca Cagliero, Luca Vassio, Martino Trevisan",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.31"
    },
    {
        "id": 26026,
        "title": "Context-Based Persuasion Analysis of Sentiment Polarity Disambiguation in Social Media Text Streams",
        "authors": "Tajinder singh, Madhu Kumari, Daya Sagar Gupta",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00354-023-00238-x"
    },
    {
        "id": 26027,
        "title": "Deep learning-based sentiment analysis for social media: A focus on multimodal and aspect-based approaches",
        "authors": "Bowen Feng",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "Commonly referred to as opinion mining, sentiment analysis harnesses the power of deep learning systems to discern human emotions and subjective sentiments towards a wide array of subjects. As such, it has become an integral tool in identifying and distinguishing sentences that harbor emotional biases or trends. By systematically examining sentiment-tinged data, researchers can unearth pivotal insights that not only reflect current perspectives but also predict future behaviors and trends. This process involves intricate computational models that analyze and interpret the emotional undertones embedded within a body of text. Whether these undertones are positive, negative, or neutral, sentiment analysis allows us to delve into the subtle nuances of human communication. This ability to \"understand\" and quantify sentiment is particularly vital in our modern digital age, where opinions and reviews shared through social media and online platforms can greatly influence public sentiment and consumer behavior. By extending beyond the literal meanings of words and phrases, sentiment analysis can provide a more comprehensive understanding of how people truly feel. It is instrumental in fields as diverse as marketing, politics, social science, and even artificial intelligence development, given its potential to gauge public opinion and predict societal trends. This paper aims to consolidate relevant research within the field of sentiment analysis conducted in recent years. Furthermore, it seeks to prognosticate the future trajectories and impacts of this rapidly evolving domain. Emphasis is placed on the role of deep learning and its transformational effects on the approach and capabilities of sentiment analysis, anticipating how its further advancement will continue to refine this intricate process of emotion recognition and interpretation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/33/20230224"
    },
    {
        "id": 26028,
        "title": "Sentiment analysis system using conventional neural network in social media",
        "authors": "Hayder Mahmood Waseen, Narjis Mezaal Shati",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0163863"
    },
    {
        "id": 26029,
        "title": "Understanding Emotion Valence is a Joint Deep Learning Task",
        "authors": "Gabriel Roccabruna, Seyed Mahed Mousavi, Giuseppe Riccardi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.9"
    },
    {
        "id": 26030,
        "title": "Sentiment analysis of Arabic social media texts: A machine learning approach to deciphering customer perceptions",
        "authors": "Ohud Alsemaree, Atm S. Alam, Sukhpal Gill, Steve Uhlig",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e27863"
    },
    {
        "id": 26031,
        "title": "Analysis Sentiment of Nestle Bear Brand during the Covid-19 Pandemic on Social Media Twitter",
        "authors": "Fauzan Kamil, Arga Hananto",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Position and brand image are important and crucial in marketing strategy. Brand position and image form strong associations with targeted consumers used to differentiate a brand from its competitors. Companies must understand good marketing strategies to improve their brand position in society based on consumer perspective. During the Covid-19 pandemic, especially in 2021, there was a unique phenomenon, whereby the demand for Bear Brand Milk was greater than the market leader, namely Ultra milk, while Ultra milk was even cheaper than the Bear Brand milk. This phenomenon is discussed on social media, especially Twitter regarding opinions from consumers in purchasing the products. This study aims to determine whether online text reviews can provide an overview of the position and brand image of Bear Brand Milk using LIWC (Linguistic Inquiry and Word Count) sentiment analysis and PCA (Principal Component Analysis). Based on our analysis, we can conclude that LIWC can provide an overview regarding the brand image and brand positioning of Bear Brand milk and Ultra milk. Brand image is obtained from variables that describe psychological variables when using or imagining the brands. Brand Position through PCA analysis describes the difference in gain between the dominant variables in the two brands.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52851/cakrawala.v6i1.166"
    },
    {
        "id": 26032,
        "title": "Domain Transfer for Empathy, Distress, and Personality Prediction",
        "authors": "Fabio Gruschka, Allison Lahnala, Charles Welch, Lucie Flek",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.50"
    },
    {
        "id": 26033,
        "title": "Can ChatGPT Understand Causal Language in Science Claims?",
        "authors": "Yuheun Kim, Lu Guo, Bei Yu, Yingya Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.33"
    },
    {
        "id": 26034,
        "title": "Sentiment Analysis Using NLP &amp; Deep Learning on Social Media Tweets",
        "authors": "Mansi Akhade, Bandana Mahapatra, Abhishekh Bhatt",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idicaiei58380.2023.10406572"
    },
    {
        "id": 26035,
        "title": "Bipolar Sentiment Analysis of Japanese Social Media Posts: A Semantic Similarity Based Approach",
        "authors": "M. Fahim Ferdous Khan, Nanami Oi, Ken Sakamura",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/is3c57901.2023.00060"
    },
    {
        "id": 26036,
        "title": "A Review on Social Media and Deep Neural Networks for Sentiment Analysis in Emergency Management",
        "authors": "Shubhrata Kanungo, Suresh Jain",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10456350"
    },
    {
        "id": 26037,
        "title": "Aspect-Level Sentiment Analysis on Social Media Using Gated Recurrent Unit (GRU)",
        "authors": "Ghani Kamil, Erwin Budi Setiawan",
        "published": "2023-3-30",
        "citations": 1,
        "abstract": "Twitter is one of the popular social media for sharing opinions, one of which is about movie reviews. There are many opinions related to movie reviews on Twitter social media so the assessment of a movie can vary. Therefore, aspect-level sentiment analysis is needed to classify movie reviews to provide optimal results. This research was conducted by building a system using the Gated Recurrent Unit (GRU) method to perform sentiment analysis at the aspect level on movie reviews taken from Twitter. The aspects used in this research are plot, acting, and director. This research also conducted experiments by combining three techniques, which are feature extraction using TF-IDF, feature expansion with GloVe, and the application of SMOTE to improve model accuracy. The results show that each test scenario can improve the accuracy and F1-Score values of each aspect. The final value of each aspect is the accuracy value for the plot aspect is 70.40%(+7.62%) and F1-Score is 70.35%(+9.70%), the accuracy value is 93.75%(+6.28%) and F1-Score is 93.70%(+65.19%) for the acting aspect, and the accuracy value is 90.44%(+4.60%) and F1-Score is 90.17%(+122.80%) for the director aspect.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bits.v4i4.3105"
    },
    {
        "id": 26038,
        "title": "Social Media Text Sentiment Analysis: Exploration Of Machine Learning Methods",
        "authors": "Fan Xing, Humaira Ashraf, Uswa Ihsan, Navid Ali Khan, Rajesh Bahuguna",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/khi-htc60760.2024.10481912"
    },
    {
        "id": 26039,
        "title": "Utterance Emotion Dynamics in Children’s Poems: Emotional Changes Across Age",
        "authors": "Daniela Teodorescu, Alona Fyshe, Saif Mohammad",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.35"
    },
    {
        "id": 26040,
        "title": "Enhancing Film Discovery through Social Media Traces Using Sentiment Analysis and Machine Learning Combined Approach",
        "authors": "Aicha Boubekeur, Fouzia Benchikha, Naila Marir",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lt60077.2024.10468985"
    },
    {
        "id": 26041,
        "title": "Challenges and strategies for sentiment analysis of irony and humor in social media based on machine learning",
        "authors": "Zijun Li",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "Sentiment analysis of irony and humor in social media poses a formidable challenge owing to the complexity and context-dependency of such expressions. This report offers a comprehensive overview of diverse machine learning techniques utilized in the analysis of irony and humor, encompassing traditional machine learning algorithms and deep learning approaches. Moreover, this review scrutinizes the challenges and future prospects for the sentiment analysis of irony and humor in social media. Future research pathways involve cross-lingual and cross-cultural analysis, multimodal information integration, autonomous identification of novel patterns, adversarial training, and augmenting the explainability and interpretability of sentiment analysis models. The report highlights the importance of these challenges and potential directions, unveiling their impact on this advancing field of research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/22/20231224"
    },
    {
        "id": 26042,
        "title": "Customer Experience Analysis Skincare Products Through Social Media Data Using Topic Modeling and Sentiment Analysis",
        "authors": "Muhammad Habibi, Kartikadyota Kusumaningtyas",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Currently, skin care products (skincare) are popular among the public. Both men and women are interested in buying skin care products. Moreover, there are many brands of skin care products that are divided into several types of facial and body care, such as moisturizers, toners, cleansers, and masks. Therefore, many consumers take the time to find information, for example, in terms of price, quality, and brand for decision-making. A lot of useful information is in the form of Twitter messages known as tweets which are sent from people who use skin care products because Twitter is one of the online social media where users can share their opinions and experiences. However, consumers still have to spend a lot of time searching, reading, and understanding the comprehensive collection of tweets before buying skin care products.The purpose of this study is to analyze customer experience, analyzing automated tweets about skin care products. Tweets about skin care products will be subjected to a topic modeling process to find out what topics are being discussed. In addition, the topics that have been obtained will be subject to sentiment analysis in the form of positive and negative messages for skin care products. Consumers who are app users don’t waste time reading and analyzing large amounts of data manually and they can decide to buy skin care products more easily.The results of this study obtained 14 topics of discussion related to skincare. Meanwhile, the sentiment analysis results of 14 topics resulted in more positive sentiment class tweets overall. It related the category topic that has the number of tweets to the importance of skincare. In addition, categories related to ingredients for skincare products from nature, namely fruits and spices, are the topics that have the second highest number of tweets. The results of the analysis of tweets related to user experience on Twitter, it was found that users prefer skincare products that use ingredients from nature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31328/jsae.v6i1.4169"
    },
    {
        "id": 26043,
        "title": "Unraveling energy justice in NYC urban buildings through social media sentiment analysis and transformer deep learning",
        "authors": "Mehdi Ashayeri, Narjes Abbasabadi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.enbuild.2024.113914"
    },
    {
        "id": 26044,
        "title": "An Ensemble Classification of Mental Health in Malaysia related to the Covid-19 Pandemic using Social Media Sentiment Analysis",
        "authors": "",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3837/tiis.2024.02.006"
    },
    {
        "id": 26045,
        "title": "Monitoring Dynamics of Emotional Sentiment in Social Network Commentaries",
        "authors": "Ismail Hossain, Sai Puppala, Md Jahangir Alam, Sajedul Talukder",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3625007.3627730"
    },
    {
        "id": 26046,
        "title": "Transformer-based cynical expression detection in a corpus of Spanish YouTube reviews",
        "authors": "Samuel Gonzalez-Lopez, Steven Bethard",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.18"
    },
    {
        "id": 26047,
        "title": "Transfer Learning for Code-Mixed Data: Do Pretraining Languages Matter?",
        "authors": "Kushal Tatariya, Heather Lent, Miryam De Lhoneux",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.32"
    },
    {
        "id": 26048,
        "title": "Czech-ing the News: Article Trustworthiness Dataset for Czech",
        "authors": "Matyas Bohacek, Michal Bravansky, Filip Trhlík, Vaclav Moravec",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.10"
    },
    {
        "id": 26049,
        "title": "Dynamic Analysis Pipeline in Real Time Monitoring Scenario",
        "authors": "Andreas Neumeier",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smap59435.2023.10255189"
    },
    {
        "id": 26050,
        "title": "A Case Study of Chinese Sentiment Analysis of Social Media Reviews Based on LSTM",
        "authors": "Lukai Wang, Lei Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "Network public opinion analysis is obtained through a combination of natural language processing (NLP) and public opinion supervision, and is crucial for monitoring public mood and trends. Therefore, network public opinion analysis can identify and solve potential and budding social problems. This study aims to realize an analysis of Chinese sentiment in social media reviews using a long short-term memory network (LSTM) model. A dataset was obtained from Sina Weibo using a web crawler and cleaned using Pandas. First, Chinese comments regarding the legal sentencing in of Tangshan attack and Jiang Ge Case were segmented and vectorized. Thereafter, a binary LSTM model was trained and tested. Finally, sentiment analysis results were obtained by analyzing the comments with the LSTM model. The accuracy of the proposed model has reached approximately 92%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/shsconf/202315704012"
    },
    {
        "id": 26051,
        "title": "HMRFLR: A Hybrid Model for Sentiment Analysis of Social Media Surveillance on Airlines",
        "authors": "Neelam Singh, Manisha Upreti",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11277-023-10592-0"
    },
    {
        "id": 26052,
        "title": "O045 Sentiment analysis of radical prostatectomy from social media: investigating patient experience",
        "authors": "A Harsh, V Nguyen, S Ourselin, P Dasgupta, A Granados",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "Abstract\n\nIntroduction\nProstate cancer is the most common cancer amongst men and is treated via radical prostatectomy. Patient sentiment towards radical prostatectomy provides opportunities to highlight areas of improvement based on the patients experience under treatment. Using social media to gauge patient sentiment towards surgery is largely unexplored. To address this deficiency, we investigated sentiment analysis on tweets related to radical prostatectomies derived from Twitter.\n\n\nMethods\nSearch terms including Prostate Removed, Prostatectomy, My Prostatectomy and After Prostatectomy were each inputted into a query to derive tweets automatically from Twitter. Using the Natural Language Toolkit, we performed sentiment analysis of tweets for categorisation [positive, negative or neutral] while highlighting the most prevalent words used in each sentiment category.\n\n\nResults\nA total of 13160 tweets were extracted. The largest negative sentiment category (52.7%) was derived using the search term Prostate Removed which generated most patient-specific data, including words used by relatives (dad, husband). However, the resulting tweets did not only originate specifically from patients but also included posts from professionals.\n\n\nConclusion\nThis is the first work investigating patients experiences towards surgery from social media. We highlight the need for better technology to filter data from patients while tweets written by patient relatives should not be disregarded as they too provide insight into patient experience. Understanding patient experiences from data collected from social media may provide insight into improvements of surgery while empowering patients. We envisage future research providing robust technology to understand surgery from patient opinions at local or global scales.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bjs/znad101.045"
    },
    {
        "id": 26053,
        "title": "Analyzing Subjectivity Using a Transformer-Based Regressor Trained on Naïve Speakers’ Judgements",
        "authors": "Elena Savinova, Fermin Moscoso Del Prado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.27"
    },
    {
        "id": 26054,
        "title": "Unsupervised Domain Adaptation using Lexical Transformations and Label Injection for Twitter Data",
        "authors": "Akshat Gupta, Xiaomo Liu, Sameena Shah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.17"
    },
    {
        "id": 26055,
        "title": "Enhancing Sentiment Analysis on Social Media with Novel Preprocessing Techniques",
        "authors": "Khouloud Safi Eljil, Farid Nait-Abdesselam, Essia Hamouda, Mohamed Hamdi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.6.1206-1213"
    },
    {
        "id": 26056,
        "title": "BanglaNLP at BLP-2023 Task 2: Benchmarking different Transformer Models for Sentiment Analysis of Bangla Social Media Posts",
        "authors": "Saumajit Saha, Albert Nanda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.banglalp-1.34"
    },
    {
        "id": 26057,
        "title": "Social Media, Topic Modeling and Sentiment Analysis in Municipal Decision Support",
        "authors": "Miloš Švaňa",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15439/2023f1479"
    },
    {
        "id": 26058,
        "title": "Analysis of Differences in User Groups and Post Sentiment of COVID-19 Vaccine Hesitators in Chinese Social-Media Platforms",
        "authors": "Jingfang Liu, Shuangjinhua Lu, Huiqin Zheng",
        "published": "2023-4-23",
        "citations": 0,
        "abstract": "(1) Background: The COVID-19 epidemic is still global and no specific drug has been developed for COVID-19. Vaccination can both prevent infection and limit the spread of the epidemic. Eliminating hesitation to the COVID-19 vaccine and achieving early herd immunity is a common goal for all countries. However, efforts in this area have not been significant and there is still a long way to go to eliminate vaccine hesitancy. (2) Objective: This study aimed to uncover differences in the characteristics and sentiments of COVID-19 vaccine hesitators on Chinese social-media platforms and to achieve a classification of vaccine-hesitant groups. (3) Methods: COVID-19-vaccine-hesitation posts and user characteristics were collected on the Sina Microblog platform for posting times spanning one year, and posts were identified for hesitation types. Logistic regression was used to conduct user-group analysis. The differences in user characteristics between the various types of COVID-19 vaccine posts were analysed according to four user characteristics: gender, address type, degree of personal-information disclosure, and whether they followed health topics. Sentiment analysis was conducted using sentiment analysis tools to calculate the sentiment scores and sentiment polarity of various COVID-19 vaccine posts, and the K–W test was used to uncover the sentiment differences between various types of COVID-19-vaccine-hesitation posts. (4) Results: There are differences in the types of COVID-19-vaccine-hesitation posts posted by users with different characteristics, and different types of COVID-19-vaccine-hesitation posts differ in terms of sentiment. Differences in user attributes and user behaviors are found across the different COVID-19-vaccine-hesitation types. Ultimately, two COVID-19-vaccine-hesitant user groups were identified: Body-related and Non-bodily-related. Users who posted body-related vaccine-hesitation posts are more often female, disclose more personal information and follow health topics on social-media platforms. Users who posted non-bodily-related posts are more often male, disclose less personal information, and do not follow health topics. The average sentiment score for all COVID-19-vaccine-hesitant-type posts is less than 0.45, with negative-sentiment posts outweighing positive- and neutral-sentiment posts in each type, among which the “Individual rights” type is the most negative. (5) Conclusions: This paper complements the application of user groups in the field of vaccine hesitation, and the results of the analysis of group characteristics and post sentiment can help to provide an in-depth and comprehensive analysis of the concerns and needs of COVID-19 vaccine hesitators. This will help public-health agencies to implement more targeted strategies to eliminate vaccine hesitancy and improve their work related to the COVID-19 vaccine, with far-reaching implications for COVID-19-vaccine promotion and vaccination.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11091207"
    },
    {
        "id": 26059,
        "title": "Yenilenebilir Enerji Türleri Üzerine Bir Sosyal Medya Duygu Analizi",
        "authors": "Hafize Nurgül DURMUŞ ŞENYAPAR",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "This study conducts a sentiment analysis of public opinions on various energy sources, including hydro, solar, wind, and nuclear, using data from social media platforms like Facebook, Instagram, Quora, and Reddit. A dataset of 3,269 mentions and examining interactions, shares, and likes offers an extensive view of the current discourse on these energy forms. The methodology combines quantitative sentiment analysis with qualitative content examination to uncover underlying themes. The findings reveal strong positive sentiment towards renewable energy, mainly hydro and solar power, often described as “clean,” “sustainable,” and “efficient.” Hydro energy is highly regarded due to its minimal environmental impact, while solar energy is praised for combating climate change and technological advancements. Wind energy faces criticism for visual and noise pollution concerns and potential effects on wildlife, while nuclear power generates negative sentiments primarily due to safety and waste management issues. These results have important implications for shaping effective marketing strategies within the renewable energy industry.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18069/firatsbed.1403552"
    },
    {
        "id": 26060,
        "title": "Sentiment Analysis Classification for Text in Social Media: Application to Tunisian Dialect",
        "authors": "Asma BelHadj Braiek, Zouhour Neji Ben Salem",
        "published": "2023-3-11",
        "citations": 0,
        "abstract": "Social networks are the most used means to express oneself freely and give one's opinion about a subject, an event, or an object. These networks present rich content that could be subject today to sentiment analysis interest in many fields such as politics, social sciences, marketing, and economics. However, social networkusers express themselves using their dialect. Thus, to help decision-makers in the analysis of users' opinions, it is necessary to proceed to the sentimental analysis of this dialect. The paper subject deals with a hybrid model combining a lexicon-based approach with a modified and adapted version of a sentiment rule-based engine named VADER. The hybrid model is tested and evaluated using the Tunisian Arabic Dialect, it showed good performance reaching 85% classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/ijci.2023.120223"
    },
    {
        "id": 26061,
        "title": "Efficient Sentiment Analysis: A Resource-Aware Evaluation of Feature Extraction Techniques, Ensembling, and Deep Learning Models",
        "authors": "Mahammed Kamruzzaman, Gene Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.socialnlp-1.2"
    },
    {
        "id": 26062,
        "title": "Aspect-based Sentiment Analysis on Social Media Using Convolutional Neural Network (CNN) Method",
        "authors": "Ananta Ihza Ramadhan, Erwin Budi Setiawan",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Social media are a platform for people to express their opinions on various topics, one of which is Twitter. Movie reviews are a frequently found topic on Twitter that contains a person's opinion of a movie that has been watched. But since opinions are subjective, it is difficult to determine an accurate assessment of a movie. In addition, the diverse aspects of a movie make it difficult to judge whether a review is positive or negative. Referring to that problem, a method is needed to perform sentiment analysis of the problem. In this study, sentiment analysis of movie reviews was carried out based on aspects of plot, acting, and director. This research also performs classification using a CNN model and combines several techniques, namely TF-IDF feature extraction, FastText feature expansion, and SMOTE to calculate the accuracy value and F1-Score. The final results obtained in this study are in the aspect of the plot getting an accuracy of 73.81% (+12,22%) and F1-score 73.72% (+15,93%), the acting aspect obtaining an accuracy value of 89.30% (+0,54%) and F1-score 89.26% (+50,80%), and in the aspect of the director having an accuracy of 87.37% (+0,28%) and F1-score 87.35% (+84,39%). Based on these results, each application of techniques such as TF-IDF, FastText, and SMOTE can increase the accuracy value and F1-Score of the model built.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bits.v4i4.3103"
    },
    {
        "id": 26063,
        "title": "Target-Oriented Data Annotation for Emotion and Sentiment Analysis in Tourism Related Social Media Data",
        "authors": "Alireza Alaei, Ying Wang, Vinh Bui, Bela Stantic",
        "published": "2023-4-19",
        "citations": 1,
        "abstract": "Social media have been a valuable data source for studying people’s opinions, intentions, and behaviours. Such a data source incorporating advanced big data analysis methods, such as machine-operated emotion and sentiment analysis, will open unprecedented opportunities for innovative data-driven destination monitoring and management. However, a big challenge any machine-operated text analysis method faces is the ambiguity of the natural languages, which may cause an expression to have different meanings in different contexts. In this work, we address the ambiguity challenge by proposing a context-aware dictionary-based target-oriented emotion and sentiment analysis method that incorporates inputs from both humans and machines to introduce an alternative approach to measuring emotions and sentiment in limited tourism-related data. The study makes a methodological contribution by creating a target dictionary specifically for tourism sentiment analysis. To demonstrate the performance of the proposed method, a case of target-oriented emotion and sentiment analysis of posts from Twitter for the Gold Coast of Australia as a tourist destination was considered. The results suggest that Twitter data cover a broad range of destination attributes and can be a valuable source for comprehensive monitoring of tourist experiences at a destination.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/fi15040150"
    },
    {
        "id": 26064,
        "title": "Sentiment Analysis of Social Media Reviews using Machine Learning and Word Embedding Techniques",
        "authors": "B N Lavanya, P Deepa Shenoy, K R Venugopal",
        "published": "2023-8-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indiscon58499.2023.10270129"
    },
    {
        "id": 26065,
        "title": "Hate Speech Patterns in Social Media: A Methodological Framework and Fat Stigma Investigation Incorporating Sentiment Analysis, Topic Modelling and Discourse Analysis",
        "authors": "Vajisha Udayangi Wanniarachchi, Chris Scogings, Teo Susnjak, Anuradha Mathrani",
        "published": "2023-2-8",
        "citations": 1,
        "abstract": "Social media offers users an online platform to freely express themselves; however, when users post opinionated and offensive comments that target certain individuals or communities, this could instigate animosity towards them. Widespread condemnation of obesity (fatness) has led to much fat stigmatizing content being posted online. A methodological framework that uses a novel mixed-method approach for unearthing hate speech patterns from large text-based corpora gathered from social media is proposed. We explain the use of computer-mediated quantitative methods comprising natural language processing techniques such as sentiment analysis, emotion analysis and topic modelling, along with qualitative discourse analysis. Next, we have applied the framework to a corpus of texts on gendered and weight-based data that have been extracted from Twitter and Reddit. This assisted in the detection of different emotions being expressed, the composition of word frequency patterns and the broader fat-based themes underpinning the hateful content posted online. The framework has provided a synthesis of quantitative and qualitative methods that draw on social science and data mining techniques to build real-world knowledge in hate speech detection. Current information systems research is limited in its use of mixed analytic approaches for studying hate speech in social media. Our study therefore contributes to future research by establishing a roadmap for conducting mixed-method analyses for better comprehension and understanding of hate speech patterns.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3127/ajis.v27i0.3929"
    },
    {
        "id": 26066,
        "title": "Comparative Analysis of Machine Learning Algorithms for Arabic Sentiment Analysis on Imbalanced Social Media Data",
        "authors": "Basheer Almuhaya, Bishal Saha, Manbir Kaur, Mahmood A. Bazel, Rehab Mohammed",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetsis61505.2024.10459389"
    },
    {
        "id": 26067,
        "title": "Examining Bias in Opinion Summarisation through the Perspective of Opinion Diversity",
        "authors": "Nannan Huang, Lin Tian, Haytham Fayek, Xiuzhen Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.14"
    },
    {
        "id": 26068,
        "title": "Exploring Sentiment Analysis in Social Media: A Natural Language Processing Case Study",
        "authors": "Et al. Manish Rana",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "Social media plays an integral role in our daily lives, influencing and reflecting global perspectives through the consumption and creation of content. Platforms like YouTube are incredibly active, with a constant influx of video uploads, views, and comments. While the YouTube app allows us to browse videos and comments, it offers only a limited glimpse into the interests and trends of others. Analysing this vast data pool, encompassing diverse language styles, presents a significant challenge. This article delves into the YouTube Data API and its application in Python for accessing raw data. The process involves data cleaning using advanced Natural Language Processing (NLP) techniques, harnessing Python-based machine learning to explore social media interactions, and automating the extraction of trends and influential factors. The journey towards trend analysis is meticulously detailed, featuring examples that leverage a variety of open-source Python tools.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.9782"
    },
    {
        "id": 26069,
        "title": "Sentiment Analysis Using the Vader Model for Assessing Company Services Based on Posts on Social Media",
        "authors": "Mërgim H. Hoti, Jaumin Ajdari",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nThe provision of services by companies in specific domains requires continuous commitment and a constructive approach to meet customer requirements, however, it is often challenging to determine the level of customer satisfaction without their feedback. Therefore, this paper attempts to provide a solution to this problem by using comments from social networks and evaluating their sentiment using the VADER model.\nIn order to accomplish the aim of our research, a lexicon has been built with more than 9500 adjectives and verbs from the Albanian language based on VADER which is just in the initial form and the sentiments are evaluated as positive, neutral, or negative. The lexicon was constructed for the Albanian language and two companies of the Republic of Kosovo were researched as case studies.\nFurthermore, the sentiment estimation, using the VADER model, in case of our datasets, we obtained a high accuracy, approximately between 89% and 95%. This level of accuracy has been primarily attributed to the application of all preprocessing steps within the dataset, which significantly enhances the model’s performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/seeur-2023-0043"
    },
    {
        "id": 26070,
        "title": "Sentiment Analysis of Negative Comments on Social Media Using Long Short-Term Memory (LSTM) Method With TensorFlow Framework",
        "authors": " Iwan Giri Waluyo,  Juwono",
        "published": "2023-7-30",
        "citations": 1,
        "abstract": "There are still many unidentified negative comments on social media that have a negative impact on others' mental and physical well-being. Therefore, sentiment analysis is needed to filter and identify such types of comments, especially on social media. This research aims to analyze and classify unidentified negative comments spread across social media. Sentiment analysis and comment classification are performed using 7773 comments in the Indonesian language. The comments are then visualized using an embedding projector, which gives satisfactory results in classifying words in the comments, where words with negative or positive sentiments are clustered closely together. The model employed in this study is the Long Short Term Memory (LSTM) model, which achieved an accuracy rate of 77.70% and a validation accuracy of 85.20%. The trained model is then used for testing purposes, employing directly collected comments from social media, which give satisfactory results",
        "keywords": "",
        "link": "http://dx.doi.org/10.55927/ijis.v2i7.4990"
    },
    {
        "id": 26071,
        "title": "SENTIMENT ANALYSIS PUBLIC OPINION OF CFW (CITAYAM FASHION WEEK) ON SOCIAL MEDIA TWITTER USING NAÏVE BAYES CLASSIFIER",
        "authors": "Angga Aditya Permana, Permana Perdana Putra",
        "published": "2023-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31000/jika.v7i1.7410"
    },
    {
        "id": 26072,
        "title": "Sentiment Analysis of Russian-Language Social Media Posts Discussing the 2022 Russian Invasion of Ukraine",
        "authors": "Matthew C. Dean, Ben Porter",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": " The current study sought to identify the sentiment of Russian-language social media posts about the war in Ukraine and to contrast sentiment between two popular social media platforms in Russia: VK and Telegram. Overall, 1,393,245 posts were gathered from social media platforms from February 2022 to September 2022 using keywords associated with the conflict. Using the sentiment analysis program Valence Aware Dictionary for sEntiment Reasoning (VADER), we completed an analysis of 15,000 randomly selected, translated Russian-language posts related to the war. Overall, findings show that sentiment was initially positive in the early stages of the invasion before becoming more neutral by the end of the study period. On VK, sentiment followed a similar positive-to-negative trend over the study period. Alternatively, on Telegram, sentiment was neutral throughout the study period. Findings show an initial difference in sentiment toward the war that existed among Russian-language speakers on the two sites before lessening over time. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/0095327x241235987"
    },
    {
        "id": 26073,
        "title": "Perceptions of hospital care for persons with dementia during the COVID-19 pandemic: a social media sentiment analysis",
        "authors": "Alixe Ménard, Tracey O’Sullivan, Michael Mulvey, Christopher Belanger, Sarah Fraser",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "Abstract\n\nBackground and Objectives\nThe COVID-19 pandemic led to many hospital service disruptions and strict visitor restrictions that impacted care of older adult populations. This study investigates perceptions of hospital care for persons with dementia during the COVID-19 pandemic as shared on Reddit's social media platform.\n\n\nResearch Design and Methods\nThis study combined an opinion mining framework with linguistic processing to conduct a sentiment analysis of word clusters and care-based content in a sample of 1205 posts shared between February 2020 and March 2023 in Reddit’s English-language corpus. Data were classified based on reoccurring contiguous sequences of two words from our text sample.\n\n\nResults\nHospital dementia care discourse on Reddit advanced four negative sentiment themes: (1) fear of poor medication management, hydration, and hygiene, (2) loss of patient advocacy, (3) precipitation of advance directive discussions, and (4) delayed discharge and loss of nursing home bed. One positive sentiment theme also emerged: gratitude towards hospital staff.\n\n\nDiscussion and Implications\nNegative sentiment Reddit posts constituted a larger share of the posts than positive posts regarding hospital care for persons with dementia. People who posted about their experiences shared their concerns about hospital care deficiencies and the importance of including informal caregivers in hospital settings, particularly in the context of a pandemic. Implications exist for dementia training, improved quality of care, advance care planning and transitions in care policies.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/geront/gnad155"
    },
    {
        "id": 26074,
        "title": "Sentiment Analysis on Social Media Against Public Policy Using Multinomial Naive Bayes",
        "authors": "Wildan Budiawan Zulfikar, Aldy Rialdy Atmadja, Satrya Fajri Pratama",
        "published": "2023-1-16",
        "citations": 3,
        "abstract": "Purpose:  The purpose of this study is to analyze text documents from Twitter about public policies in handling COVID-19 that are currently or have been determined. The text documents are classified into positive and negative sentiments by using Multinomial Naive Bayes.Methods:  In this research, CRISP-DM is used as a method for conducting sentiment analysis, starting from the business understanding process, data understanding, data preparation, modeling, and evaluation. Multinomial Naive Bayes has been applied in building classification based on text documents. The results of this study made a model that can be used in classifying texts with maximum accuracy.Result:  The results of this research are focused on the model or pattern generated by the Multinomial Naive Bayes Algorithm. The classification results of social media users' tweets against the new normal policy obtained good results with an accuracy value of 90.25%. After classifying the tweets of social media users regarding the new normal policy, the results show that more than 70% agreed and supported the new normal policy.Novelty:  This study resulted in how classification can be done with Multinomial Naive Bayes and this algorithm can work well in recognizing text sentiments that generate positive or negative opinions regarding public policies handling COVID-19. So, the research provided conclusions about the views of people around the world on new normal public policy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15294/sji.v10i1.39952"
    },
    {
        "id": 26075,
        "title": "You Are What You Read: Inferring Personality From Consumed Textual Content",
        "authors": "Adam Sutton, Almog Simchon, Matthew Edwards, Stephan Lewandowsky",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.4"
    },
    {
        "id": 26076,
        "title": "ChatGPT is fun, but it is not funny! Humor is still challenging Large Language Models",
        "authors": "Sophie Jentzsch, Kristian Kersting",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.29"
    },
    {
        "id": 26077,
        "title": "Towards Detecting Harmful Agendas in News Articles",
        "authors": "Melanie Subbiah, Amrita Bhattacharjee, Yilun Hua, Tharindu Kumarage, Huan Liu, Kathleen McKeown",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.11"
    },
    {
        "id": 26078,
        "title": "Integrating color cues to improve multimodal sentiment analysis in social media",
        "authors": "Jieyu An, Wan Mohd Nazmee Wan Zainon",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106874"
    },
    {
        "id": 26079,
        "title": "Sadness and Anxiety Language in Reddit Messages Before and After Quitting a Job",
        "authors": "Molly Ireland, Micah Iserman, Kiki Adams",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.41"
    },
    {
        "id": 26080,
        "title": "PrecogIIITH@WASSA2023: Emotion Detection for Urdu-English Code-mixed Text",
        "authors": "Bhaskara Hanuma Vedula, Prashant Kodali, Manish Shrivastava, Ponnurangam Kumaraguru",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.58"
    },
    {
        "id": 26081,
        "title": "Semisupervised Hierarchical Subspace Learning Model for Multimodal Social Media Sentiment Analysis",
        "authors": "Xue Han, Honlin Cheng, Jike Ding, Suqin Yan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tce.2024.3350696"
    },
    {
        "id": 26082,
        "title": "Sentiment analysis and counselling for COVID-19 pandemic based on social media",
        "authors": "Ha Young Lee, Ok Ran Jeong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwgs.2023.129327"
    },
    {
        "id": 26083,
        "title": "Sentiment Analysis of Social Media Platform Reviews Using the Naïve Bayes Classifier Algorithm",
        "authors": "Sudin Saepudin, Selviani Widiastuti, Carti Irawan",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "The Covid-19 pandemic has caused significant changes in people's lifestyles which are further strengthened by the rapid development of technology. This has resulted in increased use of the internet and accelerated dissemination of information through social media platforms. Not only for self-expression, social media can also be a means of communication, information, education, and even used as a marketing tool. Several social media platforms have recently been popular and widely used, the number of users is increasing from year to year, and each user can provide a rating review of the application. To find out public opinion on social media platforms, sentiment analysis will be carried out on several social media platform applications on the Google Play Store, namely Twitter, Instagram and Tiktok which will later be used as material for evaluating these applications. In this study, the dataset was taken based on ratings from user reviews on the Google Play Store using the NBC (Naïve Bayes Classifier) method with the Python programming language. Based on testing of 1000 comment review data from each application, it was found that the majority gave positive sentiment (Twitter 57.2%, Instagram 74.1%, Tiktok 83.9%), and negative sentiment (Twitter 42.8%, Instagram 25.9%, Tiktok 16.1%) with an accuracy rate of 85.6% for the Twitter application, 83.6% for the Instagram application, and 84.8% for the Tiktok application.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32736/sisfokom.v12i2.1650"
    },
    {
        "id": 26084,
        "title": "Public Perception of Islamic Higher Education Institutions on Twitter in Indonesia: A Social Media Sentiment Analysis",
        "authors": "Rofingatun Nikmah, Erwin Rasyid",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "With the advent of social media, particularly Twitter, public opinion has become a dynamic and influential force. This study explores the public's perception of Islamic higher education institutions on Twitter, employing sentiment analysis to decipher the nuances of public sentiment. A comprehensive quantitative research methodology employing sentiment analysis was applied to a dataset of 11,809 tweets collected from 2018 to 2022, all focused on perceptions of Islamic higher education. The preprocessing phase involved cleaning, case folding, punctuation, number removal, stopword elimination, and tokenization. Sentiment analysis techniques were utilized to categorize tweets into positive, negative, or neutral sentiments. The analysis revealed a prevalent positive sentiment, constituting 73.16% of the dataset, 21.37% exhibited negative sentiment, and 5.47% reflected neutral sentiment. Visualizations, including word clouds, highlighted key topics shaping public perception. Words like \"university,\" \"religion,\" and \"student\" emerged prominently, influencing sentiment across categories. These results underscore a positive public perception of Islamic higher education, indicating the effectiveness of social media in shaping favorable opinions. The research emphasizes the significance of social media, specifically Twitter, as a platform for fostering positive perceptions of Islamic higher education. Strategic communication, proactive content dissemination, and responsive engagement are essential for enhancing institutional image. Future research directions, including advanced methodologies like topic modeling and word association techniques, promise a deeper understanding of public sentiment nuances, guiding educational institutions and policymakers toward effective social media engagement strategies",
        "keywords": "",
        "link": "http://dx.doi.org/10.12928/channel.v11i2.158"
    },
    {
        "id": 26085,
        "title": "Clustering Algorithms in Sentiment Analysis Techniques in Social Media – A Rapid Literature Review",
        "authors": "Vasile Daniel Pavaloaia",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150314"
    },
    {
        "id": 26086,
        "title": "Sentiment Analysis of Post-Covid Patients on Social Media by Predictive Modeling",
        "authors": "Et al. S. Roja",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "Social media has become a powerful platform for individuals to express their thoughts, experiences, and emotions. With the advent of the COVID-19 pandemic, social media has witnessed a surge in posts related to the virus and its aftermath. In India, a country severely hit by the pandemic, there is a prevalence of post-COVID patients sharing their experiences on social media. These posts provide valuable insights into the physical and emotional challenges faced by individuals after recovering from COVID-19. This paper aims to explore the prevalence of post-COVID patients on social media in India, the signs and symptoms experienced by these individuals, the correlations between post-COVID sentiment and patient characteristics, and the development of a predictive model for sentiment analysis. The prevalence of post-COVID patients on social media in India is evident through the increased number of posts related to COVID-19 and its aftermath. The surge in COVID-19 tweets was followed by an increased number of posts expressing personal experiences with the virus, indicating a significant presence of post-COVID patients on social media. These posts provide a valuable resource for understanding the challenges faced by individuals after recovering from COVID-19. Post-COVID patients often experience a range of signs and symptoms that can have a significant impact on their physical and mental well-being. Fatigue, shortness of breath, brain fog, chest pain, headache, and other symptoms have been reported as potential long-term effects of COVID-19. Additionally, patients with post-COVID-19 depressive symptoms share psychopathological symptoms, indicating the presence of mental health challenges. These signs and symptoms highlight the need for a comprehensive understanding of the post-COVID experience and the emotional toll it can take on individuals. Predictive modeling plays a crucial role in analyzing sentiment expressed by post-COVID patients on social media. Predictive modeling is a mathematical process that aims to predict future events or outcomes by analyzing relevant historical data. By developing a predictive model for sentiment analysis, researchers can gain valuable insights into the emotional experiences of post-COVID patients and potentially identify patterns or trends. This modeling approach allows for a systematic analysis of the vast amount of data available on social media platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i10.8954"
    },
    {
        "id": 26087,
        "title": "Mental Health Sentiment Analysis on Social Media TikTok with the Naïve Bayes Algorithm",
        "authors": "Yuyun Yusnida Lase, Arif Ridho Lubis, Fauziah Elyza, Sekar Arini Syafli",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2ie60547.2023.10331126"
    },
    {
        "id": 26088,
        "title": "Multidimensional sentiment analysis method on social media data: comparison of emotions during and after the COVID-19 pandemic",
        "authors": "Bülent Doğan, Yavuz Selim Balcioglu, Meral Elçi",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "PurposeThis study aims to elucidate the dynamics of social media discourse during global health events, specifically investigating how users across different platforms perceive, react to and engage with information concerning such crises.Design/methodology/approachA mixed-method approach was employed, combining both quantitative and qualitative data collection. Initially, thematic analysis was applied to a data set of social media posts across four major platforms over a 12-month period. This was followed by sentiment analysis to discern the predominant emotions embedded within these communications. Statistical tools were used to validate findings, ensuring robustness in the results.FindingsThe results showcased discernible thematic and emotional disparities across platforms. While some platforms leaned toward factual information dissemination, others were rife with user sentiments, anecdotes and personal experiences. Overall, a global sense of concern was evident, but the ways in which this concern manifested varied significantly between platforms.Research limitations/implicationsThe primary limitation is the potential non-representativeness of the sample, as only four major social media platforms were considered. Future studies might expand the scope to include emerging platforms or non-English language platforms. Additionally, the rapidly evolving nature of social media discourse implies that findings might be time-bound, necessitating periodic follow-up studies.Practical implicationsUnderstanding the nature of discourse on various platforms can guide health organizations, policymakers and communicators in tailoring their messages. Recognizing where factual information is required, versus where sentiment and personal stories resonate, can enhance the efficacy of public health communication strategies.Social implicationsThe study underscores the societal reliance on social media for information during crises. Recognizing the different ways in which communities engage with, and are influenced by, platform-specific discourse can help in fostering a more informed and empathetic society, better equipped to handle global challenges.Originality/valueThis research is among the first to offer a comprehensive, cross-platform analysis of social media discourse during a global health event. By comparing user engagement across platforms, it provides unique insights into the multifaceted nature of public sentiment and information dissemination during crises.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/k-09-2023-1808"
    },
    {
        "id": 26089,
        "title": "Vote Bank Forecast Based on Social Media Sentiment Analysis",
        "authors": "Zubair Zaland, Sibghat Ullah Bazai, Muhammad Imran Ghafoor, Saira Akram, Muhammad Waseem, Muhammad Qaseem",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosst60641.2023.10414249"
    },
    {
        "id": 26090,
        "title": "Context-Dependent Embedding Utterance Representations for Emotion Recognition in Conversations",
        "authors": "Patrícia Pereira, Helena Moniz, Isabel Dias, Joao Paulo Carvalho",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.21"
    },
    {
        "id": 26091,
        "title": "Sentiment analysis and counselling for COVID-19 pandemic based on social media",
        "authors": "Ha Young Lee, Ok Ran Jeong",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwgs.2023.10054493"
    },
    {
        "id": 26092,
        "title": "Exploring the Impact of Informal Language on Sentiment Analysis Models for Social Media Text Using Convolutional Neural Networks",
        "authors": "Aadil Gani Ganie, Samad Dadvandipour",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "The present study sought to investigate the influence of informal language on the effectiveness of sentiment analysis models when applied to social media text. A Convolutional Neural Network (CNN) approach was employed, and the model was developed and trained on three distinct datasets: a sarcasm corpus, a sentiment corpus, and an emoticon corpus. The experimental design involved keeping the model architecture constant and training it on 80% of the data, followed by evaluating its performance on the remaining 20%. The results revealed that the model achieved a high accuracy of 96.47% on the sarcasm corpus, with class 1 exhibiting the lowest accuracy. The sentiment corpus yielded an accuracy of 95.28% for the model. The integration of the sarcasm and sentiment datasets resulted in a slight improvement in accuracy to 95.1%. The inclusion of the emoticon corpus had a marginal positive effect, resulting in an accuracy of 95.37%. These findings suggest that the use of informal language has minimal impact on the performance of sentiment analysis models applied to social media text. Furthermore, the incorporation of emoticon data may lead to a modest improvement in accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35925/j.multi.2023.1.17"
    },
    {
        "id": 26093,
        "title": "Exploring the Effectiveness of BERT for Sentiment Analysis on Large-Scale Social Media Data",
        "authors": "Thulasi Bikku, Jyothi Jarugula, Lavanya Kongala, Navya Deepthi Tummala, Naga Vardhani Donthiboina",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/conit59222.2023.10205600"
    },
    {
        "id": 26094,
        "title": "Sentimental Analysis of Social Media Data for Mental Health Monitoring",
        "authors": "Ashish Raj Shekhar, Tanya Gupta",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425161"
    },
    {
        "id": 26095,
        "title": "Hybrid Deep Neural Networks for Improved Sentiment Analysis in Social Media",
        "authors": "Sabah Auda Abdul Ameer, Raed Khalid, Ali H. O. Al Mansor, Pardeep Singh",
        "published": "2023-5-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsccc58608.2023.10176880"
    },
    {
        "id": 26096,
        "title": "Review Paper: Social Media Sentiment Analysis Using Twitter Dataset",
        "authors": "Raman Kumar, Tushar Anand, Vishal Vyas, Sushant Kumar, Swati Kashyap",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "The expansion of social media platforms, particularly Twitter, has transformed them into vast databases of user-generated content expressing a wide range of thoughts and emotions. This review delves into the field of conceptual analysis applied to Twitter datasets, focusing on machine learning. This article provides an overview of methods, techniques, and operational models for sentiment analysis using machine learning in the specific context of Twitter. Introducing the evolution of machine learning applied to the Twitter dataset, starting by exploring the main concepts of sentiment analysis. A variety of supervised and unsupervised learning methods are reviewed, from traditional methods to recent developments including deep learning models. This article discusses the key features and issues associated with this process, considering abbreviations, nuances of user-generated messages, and quality of Twitter content. This research includes a discussion of structure, lexical theory, and the role of pre-learning word embeddings in improving the performance of learning models. Focus on transforming the structure into specific ideas and connecting the data of the points to achieve higher classification. Practical uses of sentiment analysis, including but not limited to understanding public sentiment on Twitter, tracking product sentiment, and finding trends, are a good fit. The review also addresses ethical considerations and issues related to bias in the perspective of analyzing patterns studied in Twitter data. The article concludes by presenting the current state, open challenges and future directions in the Twitter space using machine learning. Combining insights from existing literature, this review provides useful material for researchers, practitioners, and enthusiasts exploring the complexities of adapting to the Twitter environment and analyzing sentiment in power. The widespread reach of social media platforms like Twitter gives them the advantage of rich, original user-generated content that reflects different perspectives and opinions. This  in-depth review article aims to explore the dynamic areas of sentiment analysis applied to Twitter datasets, with particular emphasis on the application of different types of machine learning. The narrative turns the complexity of sentiment analysis on its head by delving into the nuances of Twitter's dynamic content and the evolution of machine learning. This article begins with a detailed review of the fundamentals of sentiment analysis and examines the evolution of machine learning techniques adapted to the Twitter dataset. Panoramic research covers many methods, from classical supervised and unsupervised models to deep learning models. The article will take a closer look at the specific challenges encountered in analysing short texts, user-generated messages, and modifying messages on Twitter.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem27294"
    },
    {
        "id": 26097,
        "title": "Sentiment Analysis in social media: Handling Noisy Data and Detecting Sarcasm Using a Deep Learning Approach",
        "authors": "Arif Ridho Lubis, Yulia Fatmi, Deden Witarsyah",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eecsi59885.2023.10295681"
    },
    {
        "id": 26098,
        "title": "Sentiment Analysis of the Consumer Review Text Based on BERT-BiLSTM in a Social Media Environment",
        "authors": "Xueli Zhou",
        "published": "2023-7-11",
        "citations": 0,
        "abstract": "In this paper, a BERT-BiLSTM-based consumer review text sentiment analysis method in the e-commerce big data field is proposed. First, the unlabeled text is trained using the BERT training model for the language introduced in the deep learning, and then the pre-training model of the text data is delivered by the learning textual features and data to extract deeper vectors. Second, the BiLSTM model is applied to simultaneously obtain contextual information so as to illustrate optimal textual features. Finally, a corresponding sentiment analysis model relative to the consumer review text is constructed by combining the BERT model with BiLSTM to better merge the context for classifying sentiment and improving the final feature vector accuracy for the sentiment classification results. Simulated by experiments, the method proposed in this paper was compared with another three methods using the same data set. The results obtained indicate that the proposed method has the highest precision, recall, and F1-Measure, and the values reach 92.64%, 90.32%, and 91.46%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijitsa.325618"
    },
    {
        "id": 26099,
        "title": "Code-Mixed Sentiment Analysis using Transformer for Twitter Social Media Data",
        "authors": "Laksmita Widya Astuti, Yunita Sari, Suprapto -",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0141053"
    },
    {
        "id": 26100,
        "title": "Identifying Slurs and Lexical Hate Speech via Light-Weight Dimension Projection in Embedding Space",
        "authors": "Sanne Hoeken, Sina Zarrieß, Ozge Alacam",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wassa-1.25"
    },
    {
        "id": 26101,
        "title": "An efficient multimodal sentiment analysis in social media using hybrid optimal multi-scale residual attention network",
        "authors": "Bairavel Subbaiah, Kanipriya Murugesan, Prabakeran Saravanan, Krishnamurthy Marudhamuthu",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "AbstractSentiment analysis is a key component of many social media analysis projects. Additionally, prior research has concentrated on a single modality in particular, such as text descriptions for visual information. In contrast to standard image databases, social images frequently connect to one another, making sentiment analysis challenging. The majority of methods now in use consider different images individually, rendering them useless for interrelated images. We proposed a hybrid Arithmetic Optimization Algorithm- Hunger Games Search (AOA-HGS)-optimized Ensemble Multi-scale Residual Attention Network (EMRA-Net) technique in this paper to explore the modal correlations including texts, audio, social links, and video for more effective multimodal sentiment analysis. The hybrid AOA-HGS technique learns complementary and comprehensive features. The EMRA-Net uses two segments, including Ensemble Attention CNN (EA-CNN) and Three-scale Residual Attention Convolutional Neural Network (TRA-CNN), to analyze the multimodal sentiments. The loss of spatial domain image texture features can be reduced by adding the Wavelet transform to TRA-CNN. The feature-level fusion technique known as EA-CNN is used to combine visual, audio, and textual information. The proposed method performs significantly better than the existing multimodel sentimental analysis techniques of HALCB, HDF, and MMLatch when evaluated using the Multimodal Emotion Lines Dataset (MELD) and EmoryNLP datasets. Also, even though the size of the training set varies, the proposed method outperformed other techniques in terms of recall, accuracy, F score, and precision and takes less time to compute in both datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10462-023-10645-7"
    },
    {
        "id": 26102,
        "title": "Restaurant Recommendations with Implicit User Behavior via Image Classification and Sentiment Analysis from Social Media",
        "authors": "Wei Chung Yap, Kelvin Kai Jie Sing, Ching Pang Goh",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdxa61007.2024.10470702"
    },
    {
        "id": 26103,
        "title": "Design of Sentiment Analysis Framework of Digital Media Short Text Based on Multi-pattern Sentiment Lexicon",
        "authors": "Shuqin Lin",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "Along the continuous advancement of the network and the rise of digital media, the amount of data produced by the exponential explosion. And how to use these data to provide personalized services for users is one of the current research focuses. To address the issue of insufficient coverage in the current sentiment lexicon and the difficulty of constructing sentiment lexicon in specific fields, this study proposes a multi-modal emotional thesaurus. Semi-supervised learning is used to solve the problem of insufficient coverage of emotional thesaurus, and a semi-supervised classification algorithm is realized by using a large number of unlabeled sample data combined with a small number of labeled sample data. Optimized learning is used to solve the problem of difficult construction of emotional thesaurus in specific fields, the corresponding specific emotional thesaurus is constructed by adaptive adjustment of emotional word score, and finally the improved emotional thesaurus is used to build a digital media short text sentiment analysis framework. For testing, the NLPCC dataset was used in this study, Experiments show that the framework constructed in this study requires 87 iterations, a Recall value of 0.912, a F1 value of 0.753, and an average accuracy of 83.39%, all of which are better than the sentiment analysis framework without the use of multi-pattern sentiment lexicon. In the simulation experiment, the recognition accuracy reached 85.88%, which was 16.85%, 11.57% and 6.72% higher than the test scenarios using a single emotion thesaurus selected in this study. The above results show that the digital media short-text sentiment analysis framework built in this research based on multi-pattern sentiment lexicon can carry out short-text sentiment analysis more accurately and efficiently, so as to accurately analyze users’ needs and provide customized services precisely.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12694/scpe.v24i3.2371"
    },
    {
        "id": 26104,
        "title": "Sentiment Analysis of the Indonesia Presidential Election 2024 with Ensemble Learning for Reducing Disinformation on Social Media",
        "authors": "Jihan Nabilah Hakim, Yuliant Sibaroni, Sri Suryani Prasetiyowati",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoict58202.2023.10262584"
    }
]