[
    {
        "id": 12705,
        "title": "An Analysis on the Implementation of Deep Learning in Wireless Networks",
        "authors": "Jennifer S. Raj, S. Shobana",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331706"
    },
    {
        "id": 12706,
        "title": "Implement deep neuron networks on VPipe parallel system: a ResNet variant implementation",
        "authors": "Xinrong Zhu",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671359"
    },
    {
        "id": 12707,
        "title": "Implementation of Power Grid Fault Diagnosis and Prediction Platform Based on Deep Learning Algorithms",
        "authors": "Jianhui Wu",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cicn59264.2023.10402185"
    },
    {
        "id": 12708,
        "title": "Design and Implementation of an Educational Information Management System Using Deep Learning and Wireless Communication",
        "authors": "Cai Wangang",
        "published": "2023-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11036-023-02171-1"
    },
    {
        "id": 12709,
        "title": "Implementation of a Deep Learning Modulation Classifier in GNU Radio",
        "authors": "Oleg A. Guminskii, Artem N. Tuchkevich, Sergey V. Mishyanov, Dmitriy M. Yurakov",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ncs60404.2023.10397526"
    },
    {
        "id": 12710,
        "title": "FE² Computations With Deep Neural Networks: Algorithmic Structure, Data Generation, and Implementation",
        "authors": "Hamidreza Eivazi, Jendrik-Alexander Tr&ouml;ger, Stefan Wittek, Stefan Hartmann, Andreas Rausch",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4485434"
    },
    {
        "id": 12711,
        "title": "Inter-Layer Hybrid Quantization Scheme for Hardware Friendly Implementation of Embedded Deep Neural Networks",
        "authors": "Najmeh Nazari, Mostafa E. Salehi",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583781.3590316"
    },
    {
        "id": 12712,
        "title": "A Real-time P-SFA hardware implementation of Deep Neural Networks using FPGA",
        "authors": "Nour Elshahawy, Sandy A. Wasif, Maggie Mashaly, Eman Azab",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.micpro.2024.105037"
    },
    {
        "id": 12713,
        "title": "Implementation of Deep Neural Networks for performance prediction and optimization of a porous volumetric solar receiver considering mechanical safety",
        "authors": "Sonika Sharma, Prabal Talukdar",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.applthermaleng.2023.121096"
    },
    {
        "id": 12714,
        "title": "Implementation of Convolutional Neural Networks deep learning approach to Classify Melanoma Skin Cancer",
        "authors": "Adnan Afroz, Razia Zia, Shaheena Noor, Andres Ortiz Garcia, Sarman Shams, Shoaib Mughal",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcwot57803.2023.10064671"
    },
    {
        "id": 12715,
        "title": "Hybrid Deep Learning Implementation for Crop Yield Prediction",
        "authors": "Halit ÇETİNER",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "Agriculture producers should be supported technologically in order to continue production in a way that meets the worldwide food supply and demand. Automatic realization of crop yield estimation calculation is a desired need of farmers. Automatic yield estimation also facilitates the work of agricultural producers with different goals such as imports and exports. To achieve the stated objectives, deep learning models have been developed that estimated yield using parameters such as the amount of water per hectare, the average amount of sunlight received by the hectare, the amount of fertilization per hectare, the number of pesticides used per hectare, and the area of cultivation. With the hybrid model created by combining the strengths of the LSTM and CNN models developed within the scope of this article, the success rate of data prediction has increased with fine adjustments. Success rates of 89.71 R2, 0.0035 MSE, 0.0248 RMSE, 0.0461 MAE, and 10.10 MAPE have been achieved with the Proposed hybrid model. This model is competitive with similar studies with the stated values.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35414/akufemubid.1116187"
    },
    {
        "id": 12716,
        "title": "Design and implementation of an 8-bit approximate Wallace Tree Multiplier for energy efficient deep neural networks",
        "authors": "B. Venu, T.R. Kadiyam, V. Koundinya, S.S. Yellampalli, R. Vaddi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1458"
    },
    {
        "id": 12717,
        "title": "FE2 Computations with Deep Neural Networks: Algorithmic Structure, Data Generation, and Implementation",
        "authors": "Hamidreza Eivazi, Jendrik-Alexander Tröger, Stefan Wittek, Stefan Hartmann, Andreas Rausch",
        "published": "2023-8-16",
        "citations": 1,
        "abstract": "Multiscale FE2 computations enable the consideration of the micro-mechanical material structure in macroscopical simulations. However, these computations are very time-consuming because of numerous evaluations of a representative volume element, which represents the microstructure. In contrast, neural networks as machine learning methods are very fast to evaluate once they are trained. Even the DNN-FE2 approach is currently a known procedure, where deep neural networks (DNNs) are applied as a surrogate model of the representative volume element. In this contribution, however, a clear description of the algorithmic FE2 structure and the particular integration of deep neural networks are explained in detail. This comprises a suitable training strategy, where particular knowledge of the material behavior is considered to reduce the required amount of training data, a study of the amount of training data required for reliable FE2 simulations with special focus on the errors compared to conventional FE2 simulations, and the implementation aspect to gain considerable speed-up. As it is known, the Sobolev training and automatic differentiation increase data efficiency, prediction accuracy and speed-up in comparison to using two different neural networks for stress and tangent matrix prediction. To gain a significant speed-up of the FE2 computations, an efficient implementation of the trained neural network in a finite element code is provided. This is achieved by drawing on state-of-the-art high-performance computing libraries and just-in-time compilation yielding a maximum speed-up of a factor of more than 5000 compared to a reference FE2 computation. Moreover, the deep neural network surrogate model is able to overcome load-step size limitations of the RVE computations in step-size controlled computations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/mca28040091"
    },
    {
        "id": 12718,
        "title": "Retraction: “Implementation of deep neural networks for classifying electroencephalogram signal using fractional S‐transform for epileptic seizure detection”",
        "authors": "",
        "published": "2024-3",
        "citations": 0,
        "abstract": "Retraction: Ashokkumar SR, Anupallavi S, Premkumar M, Jeevanantham V. Implementation of deep neural networks for classifying electroencephalogram signal using fractional S‐transform for epileptic seizure detection. Int J Imaging Syst Technol. 2021;31:895–908. https://doi.org/10.1002/ima.22565The above article, published online on 02 March 2021 in Wiley Online Library (wileyonlinelibrary.com), has been retracted by agreement between the journal Editor‐in‐Chief Dr. Mohamed Seghier, and Wiley Periodicals, LLC. The retraction has been agreed due to major overlap between this article and the following article: Liu G, Zhou W, Geng M. Automatic Seizure Detection Based on S‐Transform and Deep Convolutional Neural Network. Int. J. Neural Syst. 2020;30:1950024. https://doi.org/10.1142/S0129065719500242. Following a complaint from a third party, an investigation by the editorial office and Wiley concluded that Figures 5 and 10 were duplicated from the previously‐published article and that the degree of overlap between the articles' topics, preprocessing methods, and proposed AI tools constitutes plagiarism. The authors responded to an inquiry by the publisher, but did not provide original data. The authors were notified about the retraction but did not respond.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ima.23048"
    },
    {
        "id": 12719,
        "title": "Coherent correlator design analysis for the implementation of deep learning networks",
        "authors": "Phil Birch, Habiba Akter, Rupert Young, Chris Chatwin",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Optical signal processing can reduce the electrical power consumption required over that required by graphically processing units. There remain a number of challenges to overcome. Noise is potentially much larger in optical systems than in their electronic counterparts, and some of the operations, such as a bias addition, are not easy to implement in free space processors. This paper analyzes a proposed design that utilizes a camera and lightweight electronic processing to perform the convolutional layers. Simulations are performed to compare the expected performance against an ideal system that cannot be physically realized and a proposed architecture. The impact of speckle noise in the system is analyzed and methods to reduce this are proposed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/josaa.504956"
    },
    {
        "id": 12720,
        "title": "Real Time Implementation of Robust Sound based Respiratory Disease Classification using Spectrogram and Deep Convolutional Neural Networks",
        "authors": "Revathi A., Sasikala Devi N., Arunprasanth D., Raju N.",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "Respiratory diseases become burden to affect health of the people and five lung related diseases namely COPD, Asthma, Tuberculosis, Lower respiratory tract infection and Lung cancer are leading causes of death worldwide. X-ray or CT scan images of lungs of patients are analysed for prediction of any lung related respiratory diseases clinically. Respiratory sounds also can be analysed to diagnose the respiratory illness prevailing among humans. Sound based respiratory disease classification against healthy subjects is done by extracting spectrogram from the respiratory sound signal and Convolutional neural network (CNN) templates are created by applying the extracted features on the layered CNN architecture. Test sound is classified to be associated with respiratory disease or healthy subjects by applying the testing procedure on the test feature frames of spectrogram. Evaluation of the respiratory disease binary classification is performed by considering 80% and 20% of the extracted spectrogram features for training and testing. An automated system is developed to classify the respiratory diseases namely upper respiratory tract infection (URTI), pneumonia, bronchitis, bronchiectasis, and coronary obstructive pulmonary disease (COPD) against healthy subjects from breathing & wheezing sounds. Decision level fusion of spectrogram, Melspectrogram and Gammatone gram features with CNN for modelling & classification is done and the system has deliberated the accuracy of 98%. Combination of Gammatone gram and CNN has provided very good results for binary classification of pulmonary diseases against healthy subjects. This system is realized in real time by using Raspberry Pi hardware and this system provides the validation error of 14%. This automated system would be useful for COVID testing using breathing sounds if respiratory sound database with breathing sound recordings from COVID patients would be available.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46300/91011.2023.17.6"
    },
    {
        "id": 12721,
        "title": "Implementation of A Deep Learning Framework for Intelligent Intrusion Detection in Internet of Things Networks",
        "authors": "S. Jeyapriyanga, C.N. Ravi, R. Rathiya, K. Kalaivani, Rama Devi C, Kallakunta Ravi Kumar",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220736"
    },
    {
        "id": 12722,
        "title": "Deep W-Networks: Solving Multi-Objective Optimisation Problems with Deep Reinforcement Learning",
        "authors": "Jernej Hribar, Luke Hackett, Ivana Dusparic",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011610300003393"
    },
    {
        "id": 12723,
        "title": "Implementation of deep neural networks learning on unmanned aerial vehicle based remote-sensing",
        "authors": "Shouket Abdulrahman Ahmed, Hazry Desa, Abadal-Salam T. Hussain, Taha A. Taha",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Due to efficient and adaptable data collecting, unmanned aerial vehicle (UAV) has been a popular topic in computer vision (CV) and remote sensing (RS) in recent years. Inspiring by the recent success of deep learning (DL), several enhanced object identification and tracking methods have been broadly applied to a variety of UAV-related applications, including environmental monitoring, precision agriculture, and traffic management. In this research, we present efficient neural network (ENet), a unique deep neural network architecture designed exclusively for jobs demanding low latency operation. ENet is up to quicker, takes fewer floating-point operations per second (FLOPs), has fewer parameters, and offers accuracy comparable to or superior to that of previous models. We have tested it on the street and cityscapes reports on comparisons with current state-of-the-art approaches and the tradeoffs between a network's processing speed and accuracy. We give measurements of the proposed architecture's performance on embedded devices and offer software enhancements that might make ENet even quicker.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijai.v13.i1.pp941-947"
    },
    {
        "id": 12724,
        "title": "Directly-trained Spiking Neural Networks for Deep Reinforcement Learning: Energy efficient implementation of event-based obstacle avoidance on a neuromorphic accelerator",
        "authors": "Luca Zanatta, Alfio Di Mauro, Francesco Barchi, Andrea Bartolini, Luca Benini, Andrea Acquaviva",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126885"
    },
    {
        "id": 12725,
        "title": "Implementation of Field-Programmable Gate Array Platform for Object Classification Tasks Using Spike-Based Backpropagated Deep Convolutional Spiking Neural Networks",
        "authors": "Vijay Kakani, Xingyou Li, Xuenan Cui, Heetak Kim, Byung-Soo Kim, Hakil Kim",
        "published": "2023-6-30",
        "citations": 2,
        "abstract": "This paper investigates the performance of deep convolutional spiking neural networks (DCSNNs) trained using spike-based backpropagation techniques. Specifically, the study examined temporal spike sequence learning via backpropagation (TSSL-BP) and surrogate gradient descent via backpropagation (SGD-BP) as effective techniques for training DCSNNs on the field programmable gate array (FPGA) platform for object classification tasks. The primary objective of this experimental study was twofold: (i) to determine the most effective backpropagation technique, TSSL-BP or SGD-BP, for deeper spiking neural networks (SNNs) with convolution filters across various datasets; and (ii) to assess the feasibility of deploying DCSNNs trained using backpropagation techniques on low-power FPGA for inference, considering potential configuration adjustments and power requirements. The aforementioned objectives will assist in informing researchers and companies in this field regarding the limitations and unique perspectives of deploying DCSNNs on low-power FPGA devices. The study contributions have three main aspects: (i) the design of a low-power FPGA board featuring a deployable DCSNN chip suitable for object classification tasks; (ii) the inference of TSSL-BP and SGD-BP models with novel network architectures on the FPGA board for object classification tasks; and (iii) a comparative evaluation of the selected spike-based backpropagation techniques and the object classification performance of DCSNNs across multiple metrics using both public (MNIST, CIFAR10, KITTI) and private (INHA_ADAS, INHA_KLP) datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/mi14071353"
    },
    {
        "id": 12726,
        "title": "Efficient Repetition Coding for Deep Learning Towards Implementation Using Emerging Non-Volatile Memory with Write-Errors",
        "authors": "Ninnart Fuengfusin, Hakaru Tamukoh, Yuichiro Tanaka, Osamu Nomura, Takashi Morie",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191433"
    },
    {
        "id": 12727,
        "title": "Design and Implementation of Land Area Calculation for Maps Using Mask Region Based Convolutional Neural Networks Deep Neural Network",
        "authors": "Akram A. Pathan, Nagaraj V. Dharwadkar",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1054661822040095"
    },
    {
        "id": 12728,
        "title": "Approximation of classifiers by deep perceptron networks",
        "authors": "Věra Kůrková, Marcello Sanguineti",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.004"
    },
    {
        "id": 12729,
        "title": "Make Deep Networks Shallow Again",
        "authors": "Bernhard Bermeitinger, Tomas Hrycej, Siegfried Handschuh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012203800003598"
    },
    {
        "id": 12730,
        "title": "Deep Surveillance System",
        "authors": "",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "This study has been undertaken to investigate and implement multiple detection systems into a single surveillance system and check whether the input videos may comprise and capture a variety of realistic anomalies or not. In this paper, we propose to learn various anomalies by exploiting both normal and anomalous videos and implemented it to new model. Real time object detection is a vast, vibrant and sophisticated area of computer vision aimed towards object identification and recognition. Object detection detects the semantic objects of a class objects using Open source Computer Vision, which is a library of programming functions mainly trained towards real time computer vision in digital images and videos. The main aim behind this real time object detection is to help the peoples to overcome their difficulty. Real time object detection finds its uses in the areas like tracking objects, video surveillance, pedestrian detection, people counting, self-driving cars, face detection, tracking in sports and many more. This is achieved using Convolution, Probabilistic Neural Networks, etc. which are a representative tool of Deep learning. This project acts as an aiding tool for peoples who wants to take care of everything inside, outside, and around their house just for their full security expectations. Surveillance is a must for small houses to large-scale industries as they fulfil our safety aspects because theft and burglary have always been a problem. By combining this Surveillance idea to IoT and some Machine Learning stuff this will be a major product. The proposed project is a single autonomous surveillance system, based on analysis and detection technology. The proposed system is capable of monitoring all actions at once and alerts the concerned officials immediately and precisely.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jsndc.03.01.04"
    },
    {
        "id": 12731,
        "title": "Deep MCANC: A deep learning approach to multi-channel active noise control",
        "authors": "Hao Zhang, DeLiang Wang",
        "published": "2023-1",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.029"
    },
    {
        "id": 12732,
        "title": "Adversarial Attacks on Deep Neural Networks using Generative Perturbation Networks",
        "authors": "Sudharman K. Jayaweera",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10201189"
    },
    {
        "id": 12733,
        "title": "Applications of Deep Learning and Deep Reinforcement Learning in 6G Networks",
        "authors": "Tri-Hai Nguyen, Heejae Park, Kihyun Seol, Seonghyeon So, Laihyuk Park",
        "published": "2023-7-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icufn57995.2023.10200390"
    },
    {
        "id": 12734,
        "title": "Exploring the Frontier of Deep Neural Networks: Progress, Challenges, and Future Directions",
        "authors": "",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "This research paper provides an overview of the development and current state of neural network technology. The paper begins with a historical overview of the field, followed by a discussion of the theoretical foundations of neural networks. The types of neural networks and their various applications are then explored, along with the techniques used to train and optimize these networks. The paper goes on to examine recent advancements in deep neural networks and the challenges and limitations that still face this rapidly developing field. Finally, the paper concludes with a discussion of the potential future directions and impact of neural network technology. This comprehensive overview of the field of neural networks will be of interest to researchers, practitioners, and anyone interested in the development and application of artificial intelligence.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/jeee.02.03.01"
    },
    {
        "id": 12735,
        "title": "Condition Monitoring of Wind Turbines With Implementation of Interactive Spatio–Temporal Deep Learning Networks",
        "authors": "Qiucheng Lyu, Jiayang Liu, Yuwei He, Xiaosun Wang, Shijing Wu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tim.2023.3284924"
    },
    {
        "id": 12736,
        "title": "Enhanced deep unrolling networks for snapshot compressive hyperspectral imaging",
        "authors": "Xinran Qin, Yuhui Quan, Hui Ji",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106250"
    },
    {
        "id": 12737,
        "title": "Optimized Deep Networks Structure to Improve the Accuracy of estimator algorithm in Deep Networks learning",
        "authors": "Hamideh Rezaei Nezhad, Farshid Keynia, Amir Sabagh Molahosseini",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24200/sci.2023.62337.7782"
    },
    {
        "id": 12738,
        "title": "Efficient trajectory optimization and resource allocation in UAV 5G networks using dueling-Deep-Q-Networks",
        "authors": "Jinyong Xu",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03488-1"
    },
    {
        "id": 12739,
        "title": "Real time waste classification using deep learning and AV: Deep learning and implementation in the frontend",
        "authors": "Akshat Shrivastava",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "To combat climate change, accurate waste disposal is essential at the point of disposal. Strong greenhouse gases like methane are released into the atmosphere when items that might be recycled or composted are instead dumped in landfills. Current efforts to lessen the disposal of incorrect garbage are often costly, incorrect, and lengthy. In this project, we offer NoWa, an intuitive smartphone app that instantly categorises waste into recyclable or compost for consumers. NoWa uses highly efficient deep learning algorithms, using modern deep learning techniques and models. We have tested several convolution neural network topologies for garbage detection and classification. On the test set, our best model, a multi-layer deep learning residual convoluted neural network, has an accuracy of more than 95%- a number higher than what has ever been achieved in such models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsrhs.v12i2.4208"
    },
    {
        "id": 12740,
        "title": "Contrast sensitivity function in deep networks",
        "authors": "Arash Akbarinia, Yaniv Morgenstern, Karl R. Gegenfurtner",
        "published": "2023-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.04.032"
    },
    {
        "id": 12741,
        "title": "Implementation of an Object Detection System using Convolutional Neural Networks",
        "authors": "P. Divakar, V. Pavani",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0769"
    },
    {
        "id": 12742,
        "title": "Deep Q-Networks for Imbalanced Multi-Class Malware Classification",
        "authors": "Antonio Maci, Giuseppe Urbano, Antonio Coscia",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012303800003648"
    },
    {
        "id": 12743,
        "title": "Prediction of Antimicrobial Peptides Using Deep Neural Networks",
        "authors": "Ümmü Söylemez, Malik Yousef, Burcu Bakir-Gungor",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011690000003414"
    },
    {
        "id": 12744,
        "title": "Retracted: Software Security Testing through Coverage in Deep Neural Networks",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9827176"
    },
    {
        "id": 12745,
        "title": "Sub-optimal Deep Pipelined Implementation of MIMO Sphere Detector on FPGA",
        "authors": "Minh Thuong Nguyen, Xuan Nam Tran, Vu Duc Ngo, Quang-Kien Trinh, Duc Thang Nguyen, Tien Anh Vu",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "Sphere detector (SD) is an effective signal detection approach for the wireless multiple-input multiple-output (MIMO) system since it can achieve near-optimal performance while reducing significant computational complexity. In this work, we proposed a novel SD architecture that is suitable for implementation on the hardware accelerator. We first perform a statistical analysis to examine the distribution of valid paths in the SD search tree. Using the analysis result, we then proposed an enhanced hybrid SD (EHSD) architecture that achieves quasi-ML performance and high throughput with a reasonable cost in hardware. The fine-grained pipeline designs of 4 × 4 and 8 × 8 MIMO system with 16-QAM modulation delivers throughput of 7.04 Gbps and 14.08 Gbps on the Xilinx Virtex Ultrascale+ FPGA, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eetinis.v10i1.2630"
    },
    {
        "id": 12746,
        "title": "A singular Riemannian geometry approach to Deep Neural Networks I. Theoretical foundations",
        "authors": "Alessandro Benfenati, Alessio Marta",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.022"
    },
    {
        "id": 12747,
        "title": "Creating Deep Convolutional Neural Networks for Image Classification",
        "authors": "Nabeel Siddiqui",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "\n            This lesson provides a beginner-friendly introduction to convolutional neural networks (CNNs) for image classification. The tutorial provides a conceptual understanding of how neural networks work by using Google's Teachable Machine to train a model on paintings from the ArtUK database. This lesson also demonstrates how to use Javascript to embed the model in a live website.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.46430/phen0108"
    },
    {
        "id": 12748,
        "title": "The deep arbitrary polynomial chaos neural network or how Deep Artificial Neural Networks could benefit from data-driven homogeneous chaos theory",
        "authors": "Sergey Oladyshkin, Timothy Praditia, Ilja Kroeker, Farid Mohammadi, Wolfgang Nowak, Sebastian Otte",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.06.036"
    },
    {
        "id": 12749,
        "title": "Railway Switch Classification Using Deep Neural Networks",
        "authors": "Andrei-Robert Alexandrescu, Alexandru Manole, Laura Dioșan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011611600003417"
    },
    {
        "id": 12750,
        "title": "Prostate Cancer Detection, Segmentation, and Classification using Deep Neural Networks",
        "authors": "Yahia Bouslimi, Takwa Gader, Afef Echi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011795100003411"
    },
    {
        "id": 12751,
        "title": "Deep learning based prediction of traffic peaks in mobile networks",
        "authors": "Shuyang Li, Enrico Magli, Gianluca Francini, Giorgio Ghinamo",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.110167"
    },
    {
        "id": 12752,
        "title": "Design and implementation for a UAV-based streaming media system",
        "authors": "Zhichao Liu, Yi Jiang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2024.103443"
    },
    {
        "id": 12753,
        "title": "Langevin Algorithms for Markovian Neural Networks and Deep Stochastic Control",
        "authors": "Pierre Bras, Gilles Pagès",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191937"
    },
    {
        "id": 12754,
        "title": "An adaptive embedding procedure for time series forecasting with deep neural networks",
        "authors": "Federico Succetti, Antonello Rosato, Massimo Panella",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.051"
    },
    {
        "id": 12755,
        "title": "Implementation of Digital Signal Processor for Pulse Doppler Radar",
        "authors": "Parisa Parhizgar, Parsa Parhizgar, Naser Parhizgar, Zahra Dehghani",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "This paper presents the design and implementation of a digital signal processor (DSP) board, utilizing a TMS320C50 family DSP chip, for pulse-Doppler radar systems. Pulse-Doppler radar systems often encounter challenges such as strong clutter, noise, and jamming in dealing with echoes. To overcome these challenges, advanced digital signal processing techniques are employed. The main objective of this paper is to introduce a cost-effective signal processing solution that significantly enhances the performance of the radar system and brings it up to speed with modern radar technologies. The hardware described in this work can also be effectively utilized for implementing various types of signal processing algorithms. Additionally, as a secondary objective, the paper presents the digital realization of a radar detector. Traditionally, this detector was constructed using an analog Doppler filter bank. However, in this work, it is digitally implemented using N digital filters in place of the analog bank. By utilizing the designed DSP board and implementing the radar detector digitally, this paper demonstrates the potential for improved performance and efficiency in pulse-Doppler radar systems. The advancements made in this work contribute to the development of cost-effective and technologically advanced radar systems. The research results are presented for four different wind conditions, showcasing the effectiveness of the proposed approach. Furthermore, the paper suggests an algorithm that combines parametric and non-parametric techniques and provides a detailed explanation of its implementation. Finally, using the non-parametric technique, the probability of detection curves (PD) are simulated with respect to the signal-to-clutter ratio (SCR) for each wind condition, and the simulation results are depicted and compared. The achievements of this paper include the proposal of an efficient approach for clutter suppression in ground surveillance pulse Doppler radar, the comparison of different clutter suppression algorithms, and the development of an algorithm that combines parametric and non-parametric techniques. The simulation results provide valuable insights into the performance of the proposed algorithms under different wind conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37256/cnc.1220233689"
    },
    {
        "id": 12756,
        "title": "Feature flow regularization: Improving structured sparsity in deep neural networks",
        "authors": "Yue Wu, Yuan Lan, Luchan Zhang, Yang Xiang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.02.013"
    },
    {
        "id": 12757,
        "title": "FlexPooling with Simple Auxiliary Classifiers in Deep Networks",
        "authors": "Muhammad Ali, Omar Alsuwaidi, Salman Khan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011894400003417"
    },
    {
        "id": 12758,
        "title": "NNSplit-SØREN: Supporting the model implementation of large neural networks in a programmable data plane",
        "authors": "David Chunhu Li, Muhamad Rizka Maulana, Li-Der Chou",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2022.109537"
    },
    {
        "id": 12759,
        "title": "Deep Inversion Method for Attacking Lifelong Learning Neural Networks",
        "authors": "Boyuan Du, Yuanlong Yu, Huaping Liu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191626"
    },
    {
        "id": 12760,
        "title": "CEMDQN: Cognitive-inspired Episodic Memory in Deep Q-networks",
        "authors": "Satyam Srivastava, Heena Rathore, Kamlesh Tiwari",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10192032"
    },
    {
        "id": 12761,
        "title": "Deep Neural Networks for Cooperative Lidar Localization in Vehicular Networks",
        "authors": "Luca Barbieri, Mattia Brambilla, Monica Nicoli",
        "published": "2023-5-28",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10278689"
    },
    {
        "id": 12762,
        "title": "Trading Strategy Validation Using Forwardtesting with Deep Neural Networks",
        "authors": "Ivan Letteri, Giuseppe Della Penna, Giovanni De Gasperis, Abeer Dyoub",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011715300003494"
    },
    {
        "id": 12763,
        "title": "Deep graph reconstruction for multi-view clustering",
        "authors": "Mingyu Zhao, Weidong Yang, Feiping Nie",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.001"
    },
    {
        "id": 12764,
        "title": "Fracture forecasting with deep neural networks",
        "authors": "Maura Shapiro",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "DyFraNet is a physics-inspired simulation for investigating how fractures begin and evolve in materials under stress.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/10.0017829"
    },
    {
        "id": 12765,
        "title": "Zero-Knowledge Attack for Replicating Protected Deep Neural Networks",
        "authors": "Itay Mosafi, Eli David, Nathan S. Netanyahu",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191239"
    },
    {
        "id": 12766,
        "title": "Data Analytics of Network Intrusion Based on Deep Neural Networks with Weights Initialized by Stacked Autoencoders and Deep Belief Networks",
        "authors": "Lidong Wang, Reed L. Mosher, Patti Duett, Terril C. Falls",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc57344.2023.10099108"
    },
    {
        "id": 12767,
        "title": "Multi-Adaptive Optimization for multi-task learning with deep neural networks",
        "authors": "Álvaro S. Hervella, José Rouco, Jorge Novo, Marcos Ortega",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.038"
    },
    {
        "id": 12768,
        "title": "Design and implementation of an advanced MQTT broker for distributed pub/sub scenarios",
        "authors": "Edoardo Longo, Alessandro E.C. Redondi",
        "published": "2023-4",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109601"
    },
    {
        "id": 12769,
        "title": "8K Ultra HD TV broadcast system: challenge, architecture and implementation",
        "authors": "Jiang Bi, Lidong Wang, Ge Guo",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2023.06.001"
    },
    {
        "id": 12770,
        "title": "A singular Riemannian geometry approach to deep neural networks II. Reconstruction of 1-D equivalence classes",
        "authors": "Alessandro Benfenati, Alessio Marta",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.11.026"
    },
    {
        "id": 12771,
        "title": "Indoor tracking using auxiliary particle filter and deep learning in wireless sensor networks",
        "authors": "Hassan Razavi, Hamidreza Amindavar, Hassan Aghaeinia",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2024.103441"
    },
    {
        "id": 12772,
        "title": "Evaluating Learning Potential with Internal States in Deep Neural Networks",
        "authors": "Shogo Takasaki, Shuichi Enokida",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012298500003660"
    },
    {
        "id": 12773,
        "title": "Deep active learning for misinformation detection using geometric deep learning",
        "authors": "Giorgio Barnabò, Federico Siciliano, Carlos Castillo, Stefano Leonardi, Preslav Nakov, Giovanni Da San Martino, Fabrizio Silvestri",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.osnem.2023.100244"
    },
    {
        "id": 12774,
        "title": "Retracted: Security Warning Model of Chinese Corporate Bond Defaults Based on Deep Neural Networks",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9841381"
    },
    {
        "id": 12775,
        "title": "DeepMetricCorr: Fast flow correlation for data center networks with deep metric learning",
        "authors": "Zunyi Liu, Dian Shen, Jiaang Bao, Fang Dong, Jiong You",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109904"
    },
    {
        "id": 12776,
        "title": "Retracted: Deep Reinforcement Learning-Based Algorithm for VNF-SC Deployment",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9895616"
    },
    {
        "id": 12777,
        "title": "Multi-Objective Deep Q-Networks for Domestic Hot Water Systems Control",
        "authors": "Mohamed-Harith Ibrahim, Stéphane Lecoeuche, Jacques Boonaert, Mireille Batton-Hubert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011647400003393"
    },
    {
        "id": 12778,
        "title": "An Deep Convolutional Neural Networks are used to Detect Cyberbullying on Social Networks.",
        "authors": "B.S. Rawat",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353375"
    },
    {
        "id": 12779,
        "title": "Implementation of Opportunistic and Scheduled Routing Algorithms for DTN based Vehicular Networks",
        "authors": "Adil Kucherbayev, Refik Caglar Kizilirmak",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lanman58293.2023.10189811"
    },
    {
        "id": 12780,
        "title": "Recursive Implementation of Voting Networks",
        "authors": "Behrooz Parhami",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc60891.2024.10427785"
    },
    {
        "id": 12781,
        "title": "SIM+: A comprehensive implementation-agnostic information model assisting AI-driven optimization for beyond 5G networks",
        "authors": "Lina Magoula, Nikolas Koursioumpas, Theodora Panagea, Nancy Alonistioti, Chaima Ghribi, Joshua Shakya",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2024.110190"
    },
    {
        "id": 12782,
        "title": "Retracted: Evaluation Method and Implementation of Vocal Music Teaching Performance under a Wireless Communication Environment",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9781246"
    },
    {
        "id": 12783,
        "title": "A Hybrid Deep Learning Framework to Predict Alzheimer’s Disease Progression Using Generative Adversarial Networks and Deep Convolutional Neural Networks",
        "authors": "Rajarshi SinhaRoy, Anupam Sen",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13369-023-07973-9"
    },
    {
        "id": 12784,
        "title": "Retracted: Bio-Optimization of Deep Learning Network Architectures",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9864694"
    },
    {
        "id": 12785,
        "title": "Metaheuristics optimization-based ensemble of deep neural networks for Mpox disease detection",
        "authors": "Sohaib Asif, Ming Zhao, Fengxiao Tang, Yusen Zhu, Baokang Zhao",
        "published": "2023-10",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.035"
    },
    {
        "id": 12786,
        "title": "Daily 5 Implementation to Improve ELL Students’ Performances",
        "authors": "Phu Vu, Lan Vu",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4148/2470-6353.1364"
    },
    {
        "id": 12787,
        "title": "Retracted: Data File Security Strategy and Implementation Based on Fuzzy Control Algorithm",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9796439"
    },
    {
        "id": 12788,
        "title": "Implementation of deep neural networks and statistical methods to predict the resilient modulus of soils",
        "authors": "Rodrigo Polo-Mendoza, Jose Duque, David Mašín, Emilio Turbay, Carlos Acosta",
        "published": "2023-12-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/10298436.2023.2257852"
    },
    {
        "id": 12789,
        "title": "Deep reinforcement learning for next-generation IoT networks",
        "authors": "Sahil Garg, Jia Hu, Giancarlo Fortino, Laurence T. Yang, Mohsen Guizani, Xianjun Deng, Danda B. Rawat",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109760"
    },
    {
        "id": 12790,
        "title": "Deep Imputation-Prediction Networks for Health Risk Prediction using Electronic Health Records",
        "authors": "Yuxi Liu, Zhenhao Zhang, Shaowen Qin",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191793"
    },
    {
        "id": 12791,
        "title": "Simple Implementation of Terrain Classification Models via Fully Convolutional Neural Networks",
        "authors": "Assiya Sarinova, Leila Rzayeva, Noyan Tendikov, Ibraheem Shayea",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wincom59760.2023.10323012"
    },
    {
        "id": 12792,
        "title": "Retracted: Effect Measurement for Human Motion Rehabilitation Training Using Improved Deep Reinforcement Learning and IoT Networks",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9842458"
    },
    {
        "id": 12793,
        "title": "Retracted: Application of Deep Learning Algorithm in Web Page Advertising Design Style",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9870738"
    },
    {
        "id": 12794,
        "title": "Understanding the role of pathways in a deep neural network",
        "authors": "Lei Lyu, Chen Pang, Jihua Wang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106095"
    },
    {
        "id": 12795,
        "title": "Retracted: Urban Traffic Flow Prediction with Deep Neural Network",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9856728"
    },
    {
        "id": 12796,
        "title": "Accuracy of a Deep Learning Method for Heart Sound Analysis is Unrealistic",
        "authors": "Arash Gharehbaghi, Elaheh Partovi",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.12.006"
    },
    {
        "id": 12797,
        "title": "Forward propagation dropout in deep neural networks using Jensen–Shannon and random forest feature importance ranking",
        "authors": "Mohsen Heidari, Mohammad Hossein Moattar, Hamidreza Ghaffari",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.044"
    },
    {
        "id": 12798,
        "title": "Retracted: DDoS Attack Detection by Hybrid Deep Learning Methodologies",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9810961"
    },
    {
        "id": 12799,
        "title": "Towards Ultra-Deep Exploration in the Moon: Modeling and Implementation of a Mole-Type Burrowing System",
        "authors": "Zihao Yuan, Haifeng Zhao",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "\nABSTRACT\nEffective scientific exploration of extraterrestrial locations requires reaching subsurface destinations and obtaining geology samples of high scientific value. One of the most widely used techniques for geological sampling is drilling, but there is still a need for investigation to achieve greater depth and efficiency. This paper proposes a mole-type autonomous burrowing robotic system for drilling, steering, and accessing scientific samples from the deep subsurface of the Moon. The paper describes the robotic locomotion and operational loads of the self-burrowing robot. The self-burrowing robot with dual-screw configuration is designed and a mathematical model is developed to simulate its excavating capacities. Finally, the paper discusses the robot's performance and compares it with conventional drilling methods using the specific energy method.\n\n\nINTRODUCTION\nThe core of near-earth exploration missions, such as those to the Moon, Mars, or asteroids, is extraterrestrial subsurface drilling and sampling (Gorevan et al., 2003). The primary tools for gaining insights into the evolutionary history of the solar system are subsurface exploration equipment, such as coring machines or robots. To achieve scientific objectives, it is necessary to reach the subsurface destination and obtain geological samples of high scientific value (Glass et al., 2020). Typically, the lunar subsurface within about 10 meters in depth consists of igneous regolith and disturbed materials from fine granular particles to chunky rocks along the depth direction (Slyuta, 2014). Drilling is one of most widely used techniques in geological sampling for sand or soil. These have been implemented in extraterrestrial exploration, in missions such as Luna, Apollo and Chang’e (Prissel & Prissel, 2021).\nTowards the deep exploration and samples collection in subsurface, there are proposed the conceptual designs or prototypes. This recent research focused on the new technical system to achieve deeper and more efficient soil movement (Lopez-Arreguin & Montenegro, 2020), which imitates locomotion mechanisms of animals and insects such as crawling, swimming, and burrowing in granular mediums. Among these developed bio-inspired robot, typical prototypes, the inchworm robots, such as IDDS (Gorevan et al., 2000) and IBR (Zhang et al., 2018), operate sequentially combining the actions of anchoring and drilling. The wood wasp robots (Cerkvenik et al., 2019) mimic a reciprocating motion of two halves saw-toothed bits to shear and stick into the soil.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.56952/arma-2023-0174"
    },
    {
        "id": 12800,
        "title": "Research and implementation of deep network-based breast tumor classification",
        "authors": "Liu Haotian, Wu Shuai",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsi58851.2023.10303888"
    },
    {
        "id": 12801,
        "title": "DeepPatch: A Patching-Based Method for Repairing Deep Neural Networks",
        "authors": "Hao Bu, Meng Sun",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/deeptest59248.2023.00011"
    },
    {
        "id": 12802,
        "title": "Who are the evil backstage manipulators: Boosting graph attention networks against deep fraudsters",
        "authors": "Xinxin Hu, Hongchang Chen, Shuxin Liu, Haocong Jiang, Kai Wang, Yahui Wang",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109698"
    },
    {
        "id": 12803,
        "title": "EvoPruneDeepTL: An evolutionary pruning model for transfer learning based deep neural networks",
        "authors": "Javier Poyatos, Daniel Molina, Aritz D. Martinez, Javier Del Ser, Francisco Herrera",
        "published": "2023-1",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.011"
    },
    {
        "id": 12804,
        "title": "An online cost minimization of the slice broker based on deep reinforcement learning",
        "authors": "Ali Gohar, Gianfranco Nencioni",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2024.110198"
    },
    {
        "id": 12805,
        "title": "Proposed algorithm for smart grid DDoS detection based on deep learning",
        "authors": "Sayawu Yakubu Diaba, Mohammed Elmusrati",
        "published": "2023-2",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.12.011"
    },
    {
        "id": 12806,
        "title": "Neuron-based Pruning of Deep Neural Networks with Better Generalization using Kronecker Factored Curvature Approximation",
        "authors": "Abdolghani Ebrahimi, Diego Klabjan",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191525"
    },
    {
        "id": 12807,
        "title": "Sensor Implementation For Saltwater Ingress Detection In Deep Sea Actuators",
        "authors": "Markus Hiller, Sebastian Imle, Markus Glaser",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rams51492.2024.10457740"
    },
    {
        "id": 12808,
        "title": "Image flare removal using Deep Convolutional Generative Adversarial Networks",
        "authors": "Ishan Prakash,  Aryan, S. Indu, Mini Sreejeth",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10116874"
    },
    {
        "id": 12809,
        "title": "The Deep Learning Generative Adversarial Random Neural Network in data marketplaces: The digital creative",
        "authors": "Will Serrano",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.028"
    },
    {
        "id": 12810,
        "title": "A hybrid deep learning model for detecting DDoS flooding attacks in SIP-based systems",
        "authors": "Osama S. Younes",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.110146"
    },
    {
        "id": 12811,
        "title": "Low dimensional approximation and generalization of multivariate functions on smooth manifolds using deep ReLU neural networks",
        "authors": "Demetrio Labate, Ji Shi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106223"
    },
    {
        "id": 12812,
        "title": "Retracted: Design of the Music Intelligent Management System Based on a Deep CNN",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9791723"
    },
    {
        "id": 12813,
        "title": "Joint spectrum sensing and D2D communications in Cognitive Radio Networks using clustering and deep learning strategies under SSDF attacks",
        "authors": "Anal Paul, Kwonhue Choi",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2023.103116"
    },
    {
        "id": 12814,
        "title": "Retracted: Implementation of Language Appropriateness in Intercultural Communication Based on Distributed Control System",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9817096"
    },
    {
        "id": 12815,
        "title": "Multi-agent deep reinforcement learning for user association and resource allocation in integrated terrestrial and non-terrestrial networks",
        "authors": "Denise Joanitah Birabwa, Daniel Ramotsoela, Neco Ventura",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109827"
    },
    {
        "id": 12816,
        "title": "Deep Q-learning multiple networks based dynamic spectrum access with energy harvesting for green cognitive radio network",
        "authors": "Bao Peng, Zhi Yao, Xin Liu, Guofu Zhou",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109630"
    },
    {
        "id": 12817,
        "title": "EEG-based Drowsiness and Alertness Recognition Using Feature Fusion and Deep Residual Networks",
        "authors": "Wei Lu, Wenjian Liu",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvidl58838.2023.10167244"
    },
    {
        "id": 12818,
        "title": "Adaptive Learning Rate for Unsupervised Learning of Deep Neural Networks",
        "authors": "Vladimir Golovko, Egor Mikhno, Aliaksandr Kroschanka, Marta Chodyka, Piotr Lichograj",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191642"
    },
    {
        "id": 12819,
        "title": "Identification of the spatiotemporal activity patterns of cultured neuronal networks using deep convolutional neural networks (CNNs)",
        "authors": "Kaito Ogomori, Suguru N. Kudoh",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bmeicon60347.2023.10321992"
    },
    {
        "id": 12820,
        "title": "UAV based device to device communication for 5G/6G networks using optimized deep learning models",
        "authors": "Yixin Luo, Gui Fu",
        "published": "2023-11-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03578-0"
    },
    {
        "id": 12821,
        "title": "Intelligent prediction method for power generation based on deep learning and cloud computing in big data networks",
        "authors": "Zhaolong Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijin.2023.08.004"
    },
    {
        "id": 12822,
        "title": "Enhancing the Robustness of Deep Neural Networks using Deep Neural Rejection",
        "authors": "Lourdu Mahimai Doss P, M Gunasekaran",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10199625"
    },
    {
        "id": 12823,
        "title": "A Deep Analysis of Brain Tumor Detection from MR Images Using Deep Learning Networks",
        "authors": "Md Ishtyaq Mahmud, Muntasir Mamun, Ahmed Abdelgawad",
        "published": "2023-3-23",
        "citations": 31,
        "abstract": "Creating machines that behave and work in a way similar to humans is the objective of artificial intelligence (AI). In addition to pattern recognition, planning, and problem-solving, computer activities with artificial intelligence include other activities. A group of algorithms called “deep learning” is used in machine learning. With the aid of magnetic resonance imaging (MRI), deep learning is utilized to create models for the detection and categorization of brain tumors. This allows for the quick and simple identification of brain tumors. Brain disorders are mostly the result of aberrant brain cell proliferation, which can harm the structure of the brain and ultimately result in malignant brain cancer. The early identification of brain tumors and the subsequent appropriate treatment may lower the death rate. In this study, we suggest a convolutional neural network (CNN) architecture for the efficient identification of brain tumors using MR images. This paper also discusses various models such as ResNet-50, VGG16, and Inception V3 and conducts a comparison between the proposed architecture and these models. To analyze the performance of the models, we considered different metrics such as the accuracy, recall, loss, and area under the curve (AUC). As a result of analyzing different models with our proposed model using these metrics, we concluded that the proposed model performed better than the others. Using a dataset of 3264 MR images, we found that the CNN model had an accuracy of 93.3%, an AUC of 98.43%, a recall of 91.19%, and a loss of 0.25. We may infer that the proposed model is reliable for the early detection of a variety of brain tumors after comparing it to the other models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16040176"
    },
    {
        "id": 12824,
        "title": "Implementation of Server-Based Intrusion Detection Software Framework in Bluetooth Networks",
        "authors": "Youjun Fred Han",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc60084.2023.10349977"
    },
    {
        "id": 12825,
        "title": "Retracted: Design and Implementation of Cloud Computing Network Security Virtual Computing and Defense Technology",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9826393"
    },
    {
        "id": 12826,
        "title": "Backdoor Attack on Deep Neural Networks in Perception Domain",
        "authors": "Xiaoxing Mo, Leo Yu Zhang, Nan Sun, Wei Luo, Shang Gao",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191661"
    },
    {
        "id": 12827,
        "title": "Retracted: Research on Music Classification Technology Based on Deep Learning",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9897056"
    },
    {
        "id": 12828,
        "title": "Strengthening Network Slicing for Industrial Internet with Deep Reinforcement Learning",
        "authors": "Yawen Tan, Jiadai Wang, Jiajia Liu",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2023.06.009"
    },
    {
        "id": 12829,
        "title": "Harnessing Deep Neural Networks for Micro-Blog Sentiment Analysis: A Novel Approach",
        "authors": "A. Syed Ismail, S. Nikkath Bushra",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370470"
    },
    {
        "id": 12830,
        "title": "Enhancing Secrecy in UAV RSMA Networks: Deep Unfolding Meets Deep Reinforcement Learning",
        "authors": "Abuzar B. M. Adam, Mohammed A. M. Elhassan",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccci58712.2023.10290852"
    },
    {
        "id": 12831,
        "title": "Design and Implementation of Side Channel Attack Based on Deep Learning LSTM",
        "authors": "Amjed Abbas Ahmed, Mohammad Kamrul Hasan",
        "published": "2023-9-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tensymp55890.2023.10223652"
    },
    {
        "id": 12832,
        "title": "Layer adaptive node selection in Bayesian neural networks: Statistical guarantees and implementation details",
        "authors": "Sanket Jantre, Shrijita Bhattacharya, Tapabrata Maiti",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.029"
    },
    {
        "id": 12833,
        "title": "Application Based on Open Flow Using Deep Radial Basis to Enhance Mobile IP Networks",
        "authors": "S. Natesan, C. Sivakumar",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370650"
    },
    {
        "id": 12834,
        "title": "Bipolar Population Threshold Encoding for Audio Recognition with Deep Spiking Neural Networks",
        "authors": "Xiaocui Lin, Jiangrong Shen, Jun Wen, Huajin Tang",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191235"
    },
    {
        "id": 12835,
        "title": "Retracted: College English Online Teaching Model Based on Deep Learning",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9803632"
    },
    {
        "id": 12836,
        "title": "Improving malicious email detection through novel designated deep-learning architectures utilizing entire email",
        "authors": "Trivikram Muralidharan, Nir Nissim",
        "published": "2023-1",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.09.002"
    },
    {
        "id": 12837,
        "title": "Deep reinforcement learning based trajectory optimization for UAV-enabled IoT with SWIPT",
        "authors": "Yuwen Yang, Xin Liu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2024.103488"
    },
    {
        "id": 12838,
        "title": "Parameterized deep reinforcement learning with hybrid action space for energy efficient data center networks",
        "authors": "Ting Wang, Xi Fan, Kai Cheng, Xiao Du, Haibin Cai, Yang Wang",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109989"
    },
    {
        "id": 12839,
        "title": "Retracted: Unsupervised Anomaly Detection Based on Deep Autoencoding and Clustering",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9842183"
    },
    {
        "id": 12840,
        "title": "Retracted: Analysis of English Education Quality Evaluation and Internationalization Integration Based on Deep Learning",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9767482"
    },
    {
        "id": 12841,
        "title": "Energy and spectrum efficient cell switch-off with channel and power allocation in ultra-dense networks: A deep reinforcement learning approach",
        "authors": "Zahra Rezaei, Behrouz Shahgholi Ghahfarokhi",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109912"
    },
    {
        "id": 12842,
        "title": "Distributed Deep Learning Based Framework to Optimize Real-Time Offloading in Mobile Edge Computing Networks",
        "authors": "Mourita Mozib",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr23603125305"
    },
    {
        "id": 12843,
        "title": "Relationship between auditory and semantic entrainment using Deep Neural Networks (DNN)",
        "authors": "Jay Kejriwal, Štefan Beňuš",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1947"
    },
    {
        "id": 12844,
        "title": "How Quality Affects Deep Neural Networks in Fine-Grained Image Classification",
        "authors": "Joseph Smith, Zheming Zuo, Jonathan Stonehouse, Boguslaw Obara",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012359200003660"
    },
    {
        "id": 12845,
        "title": "Retracted: Ocean Observation Data Prediction for Argo Data Quality Control Using Deep Bidirectional LSTM Network",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9812428"
    },
    {
        "id": 12846,
        "title": "Application of Deep Quantum Neural Networks to Finance",
        "authors": "Takayuki Sakuma",
        "published": "2024-5",
        "citations": 0,
        "abstract": "        The recent development of quantum computing gives us an opportunity to explore its potential applications to many fields, with the field of finance being no exception. In this paper, we apply the deep quantum neural network proposed by Beer et al. (2020) and discuss such potential in the context of simple experiments, such as learning implied volatilities and option prices. Furthermore, Greeks, such as delta and gamma, which are important measures in risk management, can be computed analytically with the neural network, and our numerical experiments show that the deep quantum neural network is a promising technique for solving such numerical problems arising in finance.        ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54946/wilm.12042"
    },
    {
        "id": 12847,
        "title": "Gait Recognition using Deep Residual Networks and Conditional Generative Adversarial Networks",
        "authors": "Entesar B. Talal, Zakariya A. Oraibi, Ali Wali",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/compsac57700.2023.00178"
    },
    {
        "id": 12848,
        "title": "Retracted: Deep Learning-Based Text Sentiment Analysis in Chinese International Promotion",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9756394"
    },
    {
        "id": 12849,
        "title": "Retracted: Evaluation of Japanese Teaching Quality Based on Deep Neural Network",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9834239"
    },
    {
        "id": 12850,
        "title": "QBDD: Quantum-resistant blockchain-assisted deep data deduplication protocol for vehicular crowdsensing system",
        "authors": "Junhao Li, Qiang Nong, Ziyu Liu",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2024.110393"
    },
    {
        "id": 12851,
        "title": "Deep feature screening: Feature selection for ultra high-dimensional data via deep neural networks",
        "authors": "Kexuan Li, Fangfang Wang, Lingli Yang, Ruiqi Liu",
        "published": "2023-6",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.03.047"
    },
    {
        "id": 12852,
        "title": "Retracted: Implementation of English “Online and Offline” Hybrid Teaching Recommendation Platform Based on Reinforcement Learning",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9865607"
    },
    {
        "id": 12853,
        "title": "Retracted: Design and Implementation of Intelligent Teaching System Based on Artificial Intelligence and Computer Technology",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9854971"
    },
    {
        "id": 12854,
        "title": "Retracted: A Deep Learning-Based Model for Analyzing Social Public Issues",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9849263"
    },
    {
        "id": 12855,
        "title": "Harnessing Continual Learning in Deep Neural Networks for Improved Lung Cancer Diagnosis",
        "authors": "Monita Wahengbam, M. Sriram, Tonjam Gunendra Singh",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscna58489.2023.10370416"
    },
    {
        "id": 12856,
        "title": "Retracted: Multilayer Graph-Based Deep Learning Approach for Stock Price Prediction",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9829185"
    },
    {
        "id": 12857,
        "title": "Retracted: A Deep Learning-Based Assisted Teaching System for Oral English",
        "authors": "",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9821752"
    },
    {
        "id": 12858,
        "title": "More refined superbag: Distantly supervised relation extraction with deep clustering",
        "authors": "Suizhu Yang, Yanxia Liu, Yuantong Jiang, Zhiqiang Liu",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.008"
    },
    {
        "id": 12859,
        "title": "An efficient differential analysis method based on deep learning",
        "authors": "Ying Huang, Lang Li, Ying Guo, Yu Ou, Xiantong Huang",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109622"
    },
    {
        "id": 12860,
        "title": "Securing IoT Networks: RPL Attack Detection with Deep Learning GRU Networks",
        "authors": "Raveendranadh Bokka, Tamilselvan Sadasivam",
        "published": "2023-4-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/23497157/ijres-v10i2p103"
    },
    {
        "id": 12861,
        "title": "DWSSA: Alleviating over-smoothness for deep Graph Neural Networks",
        "authors": "Qirong Zhang, Jin Li, Qingqing Ye, Yuxi Lin, Xinlong Chen, Yang-Geng Fu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106228"
    },
    {
        "id": 12862,
        "title": "Marconi-Rosenblatt Framework for Intelligent Networks (MR-iNet Gym): For Rapid Design and Implementation of Distributed Multi-agent Reinforcement Learning Solutions for Wireless Networks",
        "authors": "Collin Farquhar, Swatantra Kafle, Kian Hamedani, Anu Jagannath, Jithin Jagannath",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2022.109489"
    },
    {
        "id": 12863,
        "title": "Retracted: Network Intelligent Education System Based on the Deep Learning Algorithm",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9827401"
    },
    {
        "id": 12864,
        "title": "Retracted: Standardized Evaluation Method of Pronunciation Teaching Based on Deep Learning",
        "authors": "",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9870806"
    },
    {
        "id": 12865,
        "title": "Deep Q-Networks Assisted Pre-connect Handover Management for 5G Networks",
        "authors": "Yao Wei, Chung-Horng Lung, Samuel Ajila, Ricardo Paredes Cabrera",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-spring57618.2023.10199527"
    },
    {
        "id": 12866,
        "title": "Retracted: Component-Based Software Testing Method Based on Deep Adversarial Network",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9864593"
    },
    {
        "id": 12867,
        "title": "Image-based time series forecasting: A deep convolutional neural network approach",
        "authors": "Artemios-Anargyros Semenoglou, Evangelos Spiliotis, Vassilios Assimakopoulos",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.10.006"
    },
    {
        "id": 12868,
        "title": "Multi-speciation using a tunable laser and deep neural networks",
        "authors": "Mohamed Sy, Mhanna Mhanna, Aamir Farooq",
        "published": "2023",
        "citations": 0,
        "abstract": "Selective and simultaneous multi-speciation during high-temperature fuel pyrolysis was achieved with a single 3.3 µm DFB-ICL. The approach is based on wavelength tuning and deep denoising autoencoders (DDAEs) to distinguish the broadband absorbance spectra of evolving species during fuel pyrolysis in a shock tube.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/cleo_at.2023.aw4i.2"
    },
    {
        "id": 12869,
        "title": "Deep Learning and Neural Networks: Decision-Making Implications",
        "authors": "Hamed Taherdoost",
        "published": "2023-9-8",
        "citations": 4,
        "abstract": "Deep learning techniques have found applications across diverse fields, enhancing the efficiency and effectiveness of decision-making processes. The integration of these techniques underscores the significance of interdisciplinary research. In particular, decisions often rely on the output’s projected value or probability from neural networks, considering different values of the relevant output factor. This interdisciplinary review examines the impact of deep learning on decision-making systems, analyzing 25 relevant papers published between 2017 and 2022. The review highlights improved accuracy but emphasizes the need for addressing issues like interpretability, generalizability, and integration to build reliable decision support systems. Future research directions include transparency, explainability, and real-world validation, underscoring the importance of interdisciplinary collaboration for successful implementation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sym15091723"
    },
    {
        "id": 12870,
        "title": "Multi-agent deep reinforcement learning based resource management in SWIPT enabled cellular networks with H2H/M2M co-existence",
        "authors": "Xuehua Li, Xing Wei, Shuo Chen, Lixin Sun",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2023.103256"
    },
    {
        "id": 12871,
        "title": "Classification of Towels in a Robotic Workcell Using Deep Neural Networks",
        "authors": "Jens Rossen, Patrick Terp, Norbert Krüger, Laus Bigum, Tudor Morar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012297500003660"
    },
    {
        "id": 12872,
        "title": "Implementation of a deep learning model for vertebral segmentation in CT data",
        "authors": "Lenka Blažkova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13164/eeict.2023.41"
    },
    {
        "id": 12873,
        "title": "Design and Implementation of Automatic Music Composition System Based on Deep Learning",
        "authors": "Fei Wang",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "Recently, there has been a notable increase in interest surrounding the utilization of Deep Learning Approaches for AMCS in recent times. However, current methods often lack coherence and authenticity in the generated music. This study proposes a new approach that utilizes RNNs to bridge the gap between traditional compositional methods and modern deep learning techniques. The goal is to produce expressive and coherent musical pieces. Our methodology involves designing and implementing a customized RNN architecture that can effectively capture the complex temporal dependencies present in musical sequences. We experiment with different types of including LSTM networks, RNNs, and GRUs, to overcome challenges such as vanishing gradients and better model longer-term dependencies in music. To train the neural network efficiently and improve model convergence, various deep learning optimizers are utilized in our system. Specifically, we use SGD optimizer to improve the hyper parameters of LSTM and GRUs. The data for training is converted into MIDI format and analyzed, with music lines being identified through a similarity matrix technique. The MIDI data is then prepared for use in the LSTM and GRUs networks. The resulting music is assessed using both objective measures, such as mean squared error, and subjective approaches. This research adds to the advancements in automatic music composition by demonstrating the capability of RNNs in capturing and producing complex musical arrangements.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1301"
    },
    {
        "id": 12874,
        "title": "Text sentiment analysis using deep convolutional networks",
        "authors": "Klevis Lika, Evis Plaku",
        "published": "2023-9-18",
        "citations": 1,
        "abstract": "The ability to process language is a difficult task. A computer system that can extract meaningful information from raw text data is considered to be equipped with intelligent behaviour. Sentiment analysis is a form of information extraction of growing research and commercial interest, especially because of the exponential increase of data in recent years. This paper presents a machine learning approach built upon Neural Networks that equips a computer system with the ability to learn how to detect sentiment in a given text and to correctly classify previously unencountered text with respect to predefined sentiment categories. The developed approach does not rely on any hard-coded parameters. Rather, a model is learned through a training procedure performed on raw data alone with the objective of searching to identify patterns and discovering feature predictors that allow the algorithm to classify text into positive, negative, or neutral sentiments, while additionally focusing on nuances such as humorous or sarcastic text. Experimental validation shows promising results. The learning algorithm is fed with high-volume textual data extracted from the Twitter social media platform. The trained model is then tested on a separate dataset, previously unknown by the model. The classification algorithm is able to predict the sentiment associated with a given text with high accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59380/crj.v1i1.2725"
    },
    {
        "id": 12875,
        "title": "FPGA Hardware Acceleration Research and Implementation of Deep Learning Algorithms",
        "authors": "Yuxuan Hu",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "The convolutional neural network model is an important algorithm for deep learning, and YOLOv3-tiny based on this model has excellent object detection ability. However, the computational power required by the model is still large, and it is difficult to realize the application in the embedded field. This paper proposes a hardware acceleration method for YOLOv3-tiny and implements it on FPGA platform. Firstly, the fixed-point quantitative processing was carried out for the network, and an appropriate fixed-point strategy was designed with the data accuracy as the index. Secondly, the parallel computing design and pipeline optimization principle were carried out, and the FIFO structure was introduced to shorten the running time. Finally, the experiment was carried out on the Xilinx PYNQ-Z2 platform, and the data were compared with the previous related work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v5i3.14040"
    },
    {
        "id": 12876,
        "title": "Deep network expression recognition with transfer learning in UAV-enabled B5G/6G networks",
        "authors": "Jin Lu, Bo Wu, Xiaoting Wan, Meifen Chen",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03484-5"
    },
    {
        "id": 12877,
        "title": "Retracted: Design of Deep Learning Network Model for Personalized Music Emotional Recommendation",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9760271"
    },
    {
        "id": 12878,
        "title": "Automatic flood detection by leveraging deep convolutional neural networks",
        "authors": "Delwende Pierre Wilfried, Nikita Rai, Kanika Singla",
        "published": "2023-2-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iemecon56962.2023.10092315"
    },
    {
        "id": 12879,
        "title": "Retracted: Face Security Authentication System Based on Deep Learning and Homomorphic Encryption",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9859610"
    },
    {
        "id": 12880,
        "title": "QCA-Net: Quantum-based Channel Attention for Deep Neural Networks",
        "authors": "Juntao Zhang, Peng Cheng, Zehan Li, Hao Wu, Wenbo An, Jun Zhou",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191662"
    },
    {
        "id": 12881,
        "title": "Retracted: Visual Feature Evaluation of Shenyang Greenway Landscape Based on Deep Learning",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9793153"
    },
    {
        "id": 12882,
        "title": "A Novel Approach to Diabetes Risk Assessment Using Advanced Deep Neural Networks and LSTM Networks",
        "authors": "Vivek Balaji. K, R. Sugumar",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276333"
    },
    {
        "id": 12883,
        "title": "Deep Kernel Principal Component Analysis for multi-level feature learning",
        "authors": "Francesco Tonin, Qinghua Tao, Panagiotis Patrinos, Johan A.K. Suykens",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.045"
    },
    {
        "id": 12884,
        "title": "Deep reinforcement learning based adaptive threshold multi-tasks offloading approach in MEC",
        "authors": "Liting Mu, Bin Ge, Chenxing Xia, Cai Wu",
        "published": "2023-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109803"
    },
    {
        "id": 12885,
        "title": "Dy-MAC: Implementation of dynamic MAC stack for IEEE 802.15.4e-TSCH",
        "authors": "Deeksha P. Rao, Shrutkirthi S. Godkhindi, Abhigna V. Kumar, T.V. Prabhakar",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2023.103268"
    },
    {
        "id": 12886,
        "title": "Deep Separable Hypercomplex Networks",
        "authors": "Nazmul Shahadat, Anthony S. Maida",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "Deep hypercomplex-inspired convolutional neural networks (CNNs) have recently enhanced feature extraction for image classification by allowing weight sharing across input channels. This makes it possible to improve the representation acquisition abilities of the networks. Hypercomplex-inspired networks, however, still incur higher computational costs than standard CNNs. This paper reduces this cost by decomposing a quaternion 2D convolutional module into two consecutive separable vectormap modules. In addition, we use 4 and 5D parameterized hypercomplex multiplication-based fully connected layers. Incorporating both yields our proposed hypercomplex CNN, a novel architecture that can be assembled to construct deep separable hypercomplex networks (SHNNs) for image classification. We conduct experiments on CIFAR, SVHN, and Tiny ImageNet datasets and achieve better performance using fewer trainable parameters and FLOPS. Our proposed model achieves almost 2% higher performance for CIFAR and SVHN datasets and more than 3% for the ImageNet-Tiny dataset and takes 84%, 35%, and 51% fewer parameters than the ResNets, quaternion, and vectormap networks, respectively. Also, we achieve state-of-the-art performance on CIFAR benchmarks in hypercomplex space.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32473/flairs.36.133540"
    },
    {
        "id": 12887,
        "title": "Research and Implementation of Image Defogging Based on Deep Learning",
        "authors": "Ao Li, Zhongsheng Wang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccnea60107.2023.00026"
    },
    {
        "id": 12888,
        "title": "Implementation of AI Deep Learning Algorithm for Multi-Modal Sentiment Analysis",
        "authors": "Jiazhen Wang",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/auteee60196.2023.10408494"
    },
    {
        "id": 12889,
        "title": "Implementation of neural style transfer to mitigate domain discrepancy in the deep learning salt interpretation",
        "authors": "F. Jiang, K. Osypov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310539"
    },
    {
        "id": 12890,
        "title": "Deep reinforcement learning in NOMA-assisted UAV networks for path selection and resource offloading",
        "authors": "Xincheng Yang, Danyang Qin, Jiping Liu, Yue Li, Yong Zhu, Lin Ma",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.adhoc.2023.103285"
    },
    {
        "id": 12891,
        "title": "Automated Detection of Driver Fatigue Using Deep Neural Networks in Vehicles",
        "authors": "Mr M. Arun Kumar, Mr. D. Kannikhan Choudry, Mr. R. Rajesh Kanna",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.423.38499"
    },
    {
        "id": 12892,
        "title": "Violence Detection Using Deep Learning",
        "authors": "",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "Due to the increased risk of exposure to violent and harmful content brought about by the spread of online video content, robust systems for automatic detection and filtering have to be developed. This research suggests a novel method for deep learning-based violent content detection in videos. Our model examines both temporal and spatial characteristics in video frames by utilizing the power of recurrent neural networks (RNNs) and convolutional neural networks (CNNs).The suggested system uses a two-stream architecture, where one stream is used for temporal information using bidirectional LSTM (Long Short-Term Memory) networks to capture sequential dependencies, and the other stream is devoted to spatial analysis using 3D CNNs for frame-level understanding [1]. To ensure strong generalization, the model is additionally trained on a varied dataset that includes both violent and nonviolent content. Transfer learning is used with pre- trained deep learning models on large-scale datasets to improve the model's performance [5]. Comprehensive tests show how well the suggested method works to reliably identify violent content in videos of different genres and settings. The system demonstratesits potential for incorporation into online video platforms to give viewers a safer and more secure experience by achieving state-of-the-art outcomes in terms of precision, recall, and F1 score [4]. The suggested deep learning-based approach supports further initiatives to lessen the negative impacts of violent content in digital media and promote a safe and healthy online community [1]. Using Deep Learning to Address the Problem of Violent Video Detection: A Bright Future for Security and Safety. The proliferation of violent content is a key concern posed by the ever-increasing abundance of online video content. This puts personal safety, public safety, and platforms' capacity to properly filter information at risk. Presenting deep learning, a potent technique that presents a viable way to automatically identify violent content in videos [2]. To sum up, deep learning presents a potent and exciting way to address the pressing problem of violent video content. We can create a more secure online environment for everyone by utilizing this technology properly and resolving the issues it raises [5]. Further investigation into cross-modality learning and real-time detection shows promise for even higher efficiency and accuracy",
        "keywords": "",
        "link": "http://dx.doi.org/10.30534/ijns/2024/101312024"
    },
    {
        "id": 12893,
        "title": "Extending device noise measurement capacity for OFDM-based PLC systems: Design, implementation, and on-field validation",
        "authors": "Aymen Omri, Javier Hernandez Fernandez, Roberto Di Pietro",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.110038"
    },
    {
        "id": 12894,
        "title": "Deep learning method to optimize the quality of services in UAV-aided 5G/6G networks",
        "authors": "Yuelei Qian, Guangchun Liu, Hongbin Shi",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03562-8"
    },
    {
        "id": 12895,
        "title": "Handwritten OCR for word in Indic Language using Deep Networks",
        "authors": "Manish Kumar Gupta, Surya Vikram, Siddharth Dhawan, Ajai Kumar",
        "published": "2023-3-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/spin57001.2023.10117106"
    },
    {
        "id": 12896,
        "title": "Distributed deep reinforcement learning based on bi-objective framework for multi-robot formation",
        "authors": "Jinming Li, Qingshan Liu, Guoyi Chi",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.11.063"
    },
    {
        "id": 12897,
        "title": "Efficient breast cancer detection via cascade deep learning network",
        "authors": "Bita Asadi, Qurban Memon",
        "published": "2023",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijin.2023.02.001"
    },
    {
        "id": 12898,
        "title": "Retracted: An Evaluation Method of English Teaching Ability Based on Deep Learning",
        "authors": "",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9857935"
    },
    {
        "id": 12899,
        "title": "Implementability improvement of deep reinforcement learning based congestion control in cellular network",
        "authors": "Haidlir Achmad Naqvi, Muhammad Hafizhuddin Hilman, Bayu Anggorojati",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comnet.2023.109874"
    },
    {
        "id": 12900,
        "title": "Retracted: Computational English Online Teaching Monitoring System Based on Deep Learning Algorithm",
        "authors": "",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9865069"
    },
    {
        "id": 12901,
        "title": "Adaptive Fault Diagnosis Model for High-Speed Railway Turnout Using Deep Convolutional Neural Networks",
        "authors": "Xiaoyu Jiang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsn.2023.10058289"
    },
    {
        "id": 12902,
        "title": "Battery state of charge prediction using deep neural networks and long\n\t\t\t\t\t\tshort term memory networks",
        "authors": "Andrew Chacko, Talha Kamran, Nemesh Weerawarna, Xili Duan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17118/11143/20839"
    },
    {
        "id": 12903,
        "title": "A deep connectome learning network using graph convolution for connectome-disease association study",
        "authors": "Yanwu Yang, Chenfei Ye, Ting Ma",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.04.025"
    },
    {
        "id": 12904,
        "title": "Dynamic sparse coding-based value estimation network for deep reinforcement learning",
        "authors": "Haoli Zhao, Zhenni Li, Wensheng Su, Shengli Xie",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.09.013"
    }
]