[
    {
        "id": 19971,
        "title": "Facial Expression Recognition System for Stress Detection with Deep Learning",
        "authors": "José Almeida, Fátima Rodrigues",
        "published": "2021",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010474202560263"
    },
    {
        "id": 19972,
        "title": "An Approach for Facial Recognition Using Deep Learning",
        "authors": "Jagadeesh Gopal",
        "published": "2020-2-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12sp3/20201247"
    },
    {
        "id": 19973,
        "title": "Deep Facial Diagnosis: Deep Transfer Learning from Face Recognition to Facial Diagnosis",
        "authors": "",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48047/ijfans/v11/i12/213"
    },
    {
        "id": 19974,
        "title": "Deep Learning-Based Emotion Recognition through Facial Expressions",
        "authors": "Sarunya Kanjanawattana, Piyapong Kittichaiwatthana, Komsan Srivisut, Panchalee Praneetpholkrang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "Nowadays, humans can communicate easily with others by recognizing speech and text characters, particularly facial expressions. In human communication, it is critical to comprehend their emotion or implicit expression. Indeed, facial expression recognition is vital for analyzing the emotions of conversation partners, which can contribute to a series of matters, including mental health consulting. This technique enables psychiatrists to select appropriate questions based on their patients’ current emotional state. The purpose of this study was to develop a deep learningbased model for detecting and recognizing emotions on human faces. We divided the experiment into two parts: Faster R-CNN and mini-Xception architecture. We concentrated on four distinct emotional states: angry, sad, happy, and neutral. Both models implemented using the Faster R-CNN and the mini-Xception architectures were compared during the evaluation process. The findings indicate that the mini-Xception architecture model produced a better result than the Faster R-CNN. This study will be expanded in the future to include the detection of complex emotions such as sadness.",
        "link": "http://dx.doi.org/10.18178/joig.11.2.140-145"
    },
    {
        "id": 19975,
        "title": "DEEP LEARNING FOR MODELING HUMAN OBJECT RECOGNITION AND FACIAL PERCEPTION",
        "authors": "Floren Hügernuffke",
        "published": "No Date",
        "citations": 0,
        "abstract": "Deep learning has revolutionized the field of artificial intelligence, enabling machines to learn from large datasets and perform complex tasks such as object recognition and facial perception. In recent years, there has been significant progress in developing deep learning models for these tasks. This paper discusses the potential of deep learning in object recognition and facial perception, two critical areas of computer vision. The first part of the paper focuses on deep learning for object recognition, discussing the development of models that can detect and classify objects in images and videos. The second part of the paper focuses on deep learning for facial perception, discussing the development of models that can detect and analyze facial expressions, emotions, and features. The paper also discusses the challenges and limitations of deep learning models, including their dependence on large datasets and the need for interpretability. Finally, we explore the potential applications of deep learning in fields such as healthcare, security, and entertainment.",
        "link": "http://dx.doi.org/10.31234/osf.io/jfge3"
    },
    {
        "id": 19976,
        "title": "An Intelligent Decision Framework For Facial Expression Recognition Based On Deep Learning",
        "authors": "Xianzhang Pan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFacial expression recognition is very important for computer interacting with human. In this paper, the intelligent decision framework based on deep learning is proposed to improve the accuracy of facial expression recognition, which employs three channels to extract different complementary deep features. Each channel has the combination of different convolution layers and MaxPool layers and alleviating the gradient disappearance problem by residual network to obtain the possible expression. Finally, the results of three channels are employed to obtain the final facial expression by the intelligent decision function. Experiments on the public datasets of Fer2013 and Afew5.0 show the effective results.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2415620/v1"
    },
    {
        "id": 19977,
        "title": "Peer Review #1 of \"A feature boosted deep learning method for automatic facial expression recognition (v0.2)\"",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1216v0.2/reviews/1"
    },
    {
        "id": 19978,
        "title": "Facial recognition and applications",
        "authors": "Shajulin Benedict",
        "published": "2022-10-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/978-0-7503-4024-3ch10"
    },
    {
        "id": 19979,
        "title": "Peer Review #2 of \"A feature boosted deep learning method for automatic facial expression recognition (v0.1)\"",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1216v0.1/reviews/2"
    },
    {
        "id": 19980,
        "title": "Deep Facial Recognition using Tensorflow",
        "authors": "Chris A. Mattmann, Zhao Zhang",
        "published": "2019-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dls49591.2019.00011"
    },
    {
        "id": 19981,
        "title": "Peer Review #2 of \"A feature boosted deep learning method for automatic facial expression recognition (v0.2)\"",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1216v0.2/reviews/2"
    },
    {
        "id": 19982,
        "title": "Peer Review #1 of \"A feature boosted deep learning method for automatic facial expression recognition (v0.1)\"",
        "authors": "",
        "published": "2023-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1216v0.1/reviews/1"
    },
    {
        "id": 19983,
        "title": "DEEP LEARNING APPROACH FOR FACIAL EXPRESSION RECOGNITION",
        "authors": "",
        "published": "2020-7-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/jcr.07.14.108"
    },
    {
        "id": 19984,
        "title": "Facial Emotion Recognition using Deep Learning: Advancements, Challenges, and Future Directions",
        "authors": "Navneet Kaur, Kanwarpreet Kaur",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe study of facial emotion recognition (FER) holds significant importance within the realm of academic research, since it has wide-ranging ramifications across multiple areas such as mental health assessment and human-computer interaction. This work introduces a novel methodology for FER that integrates Gabor filter-based feature extraction with a deep Convolutional Neural Network (CNN). The utilisation of Gabor filters enables extraction of prominent textural characteristics from facial images, whilst CNNs acquire informative representations to achieve precise emotion classification. The proposed methodology is assessed using the FER2013 dataset and compared with pre-existing methodologies. The findings illustrate the efficacy of our methodology in accurately identifying facial expressions of emotions, emphasising its potential for practical implementation in the fields of mental health research and emotion-sensitive systems. The method demonstrates improved accuracy and resilience by combining Gabor filters and CNNs, showing potential for enhancing mental health evaluation and enabling adaptive human-computer interaction. This study makes a valuable contribution to the fields of health, mental health, and adaptation by advancing the creation of emotion-aware technologies that are designed to address the unique emotional requirements of individuals.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3244446/v1"
    },
    {
        "id": 19985,
        "title": "Texture Feature Descriptors for Analyzing Facial Patterns in Facial Expression Recognition System",
        "authors": "Sanoar Hossain, Vijayan Asari",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003393658-5"
    },
    {
        "id": 19986,
        "title": "Using Deep Learning for Facial Recognition: Implementing a Convolutional Siamese Neural Network in a Facial Recognition System for Cattle",
        "authors": "David McDaid, Kevin Meehan",
        "published": "2022-11-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartnets55823.2022.9994007"
    },
    {
        "id": 19987,
        "title": "Application of Deep Learning in Facial Recognition",
        "authors": "Jimit Gandhi, Aditya Jeswani, Fenil Doshi, Parth Doshi, Ramchandra S. Mangrulkar",
        "published": "2021-7-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003133681-13"
    },
    {
        "id": 19988,
        "title": "A Brief Review of Deep Learning for Facial Expression Recognition",
        "authors": "Stotle Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4318896"
    },
    {
        "id": 19989,
        "title": "Deep Rank Learning for Facial Attractiveness",
        "authors": "Yanbing Liao, Weihong Deng",
        "published": "2017-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/acpr.2017.89"
    },
    {
        "id": 19990,
        "title": "Facial Emotion Recognition using Deep Learning",
        "authors": "Shubhanjay Pandey, Sonakshi Handoo,  Yogesh",
        "published": "2022-3-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mecon53876.2022.9752189"
    },
    {
        "id": 19991,
        "title": "Accurate Facial Parts Localization and Deep Learning for 3D Facial Expression Recognition",
        "authors": "Asim Jan, Huaxiong Ding, Hongying Meng, Liming Chen, Huibin Li",
        "published": "2018-5",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/fg.2018.00075"
    },
    {
        "id": 19992,
        "title": "Deep learning-based facial expression recognition",
        "authors": "Hadi Parayil Nisamudeen, Li Zhang",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789811269264_0032"
    },
    {
        "id": 19993,
        "title": "Occluded Facial Recognition for Surviellance Using Deep Learning",
        "authors": "Hameed Moqbel, Murali Parameswaran",
        "published": "2022-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icvr55215.2022.9848162"
    },
    {
        "id": 19994,
        "title": "A SURVEY ON FACIAL EXPRESSION RECOGNITION USING DEEP LEARNING TECHNIQUES",
        "authors": "",
        "published": "2020-7-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/jcr.07.14.251"
    },
    {
        "id": 19995,
        "title": "Simplifying Facial Animation using Deep Learning based Phoneme Recognition",
        "authors": "Vladimir Ivanov, Parag Havaldar",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3587421.3595464"
    },
    {
        "id": 19996,
        "title": "Open-set Pets Facial Recognition Using Deep Learning and Statistical Learning",
        "authors": "Zhizhi Zhang, Zihan Ji",
        "published": "2022-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdis55630.2022.00050"
    },
    {
        "id": 19997,
        "title": "Gender recognition from facial images using multichannel deep learning framework",
        "authors": "R. Ramya, A. Anandh, K. Muthulakshmi, S. Venkatesh",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-85209-8.00009-2"
    },
    {
        "id": 19998,
        "title": "Deep Learning Models for Facial Expression Recognition",
        "authors": "Atul Sajjanhar, ZhaoQi Wu, Quan Wen",
        "published": "2018-12",
        "citations": 28,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dicta.2018.8615843"
    },
    {
        "id": 19999,
        "title": "Facial Emotion Recognition in Verbal Communication Based on Deep Learning",
        "authors": "Mohammed F. Alsharekh",
        "published": "2022-8-16",
        "citations": 11,
        "abstract": "Facial emotion recognition from facial images is considered a challenging task due to the unpredictable nature of human facial expressions. The current literature on emotion classification has achieved high performance over deep learning (DL)-based models. However, the issue of performance degradation occurs in these models due to the poor selection of layers in the convolutional neural network (CNN) model. To address this issue, we propose an efficient DL technique using a CNN model to classify emotions from facial images. The proposed algorithm is an improved network architecture of its kind developed to process aggregated expressions produced by the Viola–Jones (VJ) face detector. The internal architecture of the proposed model was finalised after performing a set of experiments to determine the optimal model. The results of this work were generated through subjective and objective performance. An analysis of the results presented herein establishes the reliability of each type of emotion, along with its intensity and classification. The proposed model is benchmarked against state-of-the-art techniques and evaluated on the FER-2013, CK+, and KDEF datasets. The utility of these findings lies in their application by law-enforcing bodies in smart cities.",
        "link": "http://dx.doi.org/10.3390/s22166105"
    },
    {
        "id": 20000,
        "title": "Database Development and Recognition of Facial Expression using Deep Learning",
        "authors": "M. M. Bapat, C. H. Patil, S. M. Mali",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFacial expressions reflect human emotions and an individual's intentions.  To detect facial expressions\nby human beings is a very easy task whereas it’s a very difficult task using computers. They perform a vigorous part in everyday life. It is a non-verbal mode that may include feelings, opinions, and thoughts without speaking. Deep neural networks, Convolutional Neural Networks, Neural networks, Artificial Intelligence, Fuzzy Logic, and Machine Learning are the different technologies used to detect facial expressions. To detect facial expressions, static images, video, webcam data, or real-time images can be used. This research paper focused on developing the SMM Facial Expression dataset and proposes a convolutional neural network model to identify facial expressions. The proposed method was tested on two different benchmarked datasets namely FER2013 and CK+ for facial expression detection. We have explored the proposed model on CK+ and achieved 93.94% accuracy and 67.18 % for FER2013 respectively. To analyze and test the accuracy of the proposed model, we have implemented it on the SMM Facial Expression dataset and achieved 96.60% of accuracy.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2477808/v1"
    },
    {
        "id": 20001,
        "title": "An Optimized Machine Learning and Deep Learning Framework for Facial and Masked Facial Recognition",
        "authors": "Putthiporn Thanathamathee, Siriporn Sawangarreerak, Prateep Kongkla, Dinna Nina Mohd Nizam",
        "published": "2023-7-12",
        "citations": 2,
        "abstract": "In this study, we aimed to find an optimized approach to improving facial and masked facial recognition using machine learning and deep learning techniques. Prior studies only used a single machine learning model for classification and did not report optimal parameter values. In contrast, we utilized a grid search with hyperparameter tuning and nested cross-validation to achieve better results during the verification phase. We performed experiments on a large dataset of facial images with and without masks. Our findings showed that the SVM model with hyperparameter tuning had the highest accuracy compared to other models, achieving a recognition accuracy of 0.99912. The precision values for recognition without masks and with masks were 0.99925 and 0.98417, respectively. We tested our approach in real-life scenarios and found that it accurately identified masked individuals through facial recognition. Furthermore, our study stands out from others as it incorporates hyperparameter tuning and nested cross-validation during the verification phase to enhance the model's performance, generalization, and robustness while optimizing data utilization. Our optimized approach has potential implications for improving security systems in various domains, including public safety and healthcare.",
        "link": "http://dx.doi.org/10.28991/esj-2023-07-04-010"
    },
    {
        "id": 20002,
        "title": "Saliency map and deep learning based efficient facial emotion recognition technique for facial images",
        "authors": "Naveen Kumari, Rekha Bhatia",
        "published": "2023-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-023-16220-0"
    },
    {
        "id": 20003,
        "title": "Facial Recognition based on Deep Learning",
        "authors": " Aanchal, Rahul Nijhawan, Silky Goel",
        "published": "2021-12-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca52323.2021.9676010"
    },
    {
        "id": 20004,
        "title": "Facial recognition using deep learning",
        "authors": "Abdulrazak Yahya Saleh, Kirthanaa A/P Jiva Rattinami",
        "published": "2018-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26555/jifo.v12i2.a12742"
    },
    {
        "id": 20005,
        "title": "Deep Learning Based Facial Emotion Recognition System",
        "authors": "Mehmet Akif Ozdemir, Berkay Elagoz, Aysegul Alaybeyoglu Soy, Aydin Akan",
        "published": "2020-11-19",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tiptekno50054.2020.9299256"
    },
    {
        "id": 20006,
        "title": "Deep Learning Methods for Facial Expression Recognition",
        "authors": "Chowdhury Mohammad Masum Refat, Norsinnira Zainul Azlan",
        "published": "2019-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icom47790.2019.8952056"
    },
    {
        "id": 20007,
        "title": "Multi angle optimal pattern-based deep learning for automatic facial expression recognition",
        "authors": "Deepak Kumar Jain, Zhang Zhang, Kaiqi Huang",
        "published": "2020-11",
        "citations": 63,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2017.06.025"
    },
    {
        "id": 20008,
        "title": "Multi-Threshold Deep Metric Learning for Facial Expression Recognition",
        "authors": "Wenwu Yang, Jinyi Yu, Tuo Chen, Zhenguang Liu, Xun Wang, Jianbing Shen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4425223"
    },
    {
        "id": 20009,
        "title": "Emotion Prediction for Recognition of Facial Expressions using Deep Learning",
        "authors": "Bhoomika S S",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mysurucon59703.2023.10396864"
    },
    {
        "id": 20010,
        "title": "A novel deep learning model to improve the recognition of students’ facial expressions in online learning environments",
        "authors": "",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "With the fast development of artificial intelligence and emerging technologies, automatic recognition of students’ facial expressions has received increased attention. Facial expressions are a kind of external manifestation of emotional states. It is important for teachers to assess students’ emotional states and adjust teaching activities accordingly. However, existing methods for automatic facial expression recognition have the limitations of low accuracy of recognition and poor feature extraction. To address the problem, this study proposed a novel deep learning model called DenseNetX-CBAM to improve facial expression recognition by utilizing a variant of densely connected convolutional networks (DenseNet) to reduce unnecessary parameters and strengthen the reuse of expression features between networks; moreover, convolutional block attention module (CBAM) was integrated to allow the networks to focus on important special regions and important channels when representing features. The proposed model was tested using 217 video clips of 33 students in an online course. The results demonstrated promising effects of the method in improving the accuracy of facial expression recognition, which can help teachers to accurately recognize students’ emotions and provide real-time adjustment in online learning environments.",
        "link": "http://dx.doi.org/10.34105/j.kmel.2024.16.006"
    },
    {
        "id": 20011,
        "title": "Discriminative Deep Feature Learning for Facial Emotion Recognition",
        "authors": "Dinh Viet Sang, Le Tran Bao Cuong, Pham Thai Ha",
        "published": "2018-4",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mapr.2018.8337514"
    },
    {
        "id": 20012,
        "title": "Pre-trained Deep Learning Models for Facial Emotions Recognition",
        "authors": "Atanas Atanassov, Dimitar Pilev",
        "published": "2020-10-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icai50593.2020.9311334"
    },
    {
        "id": 20013,
        "title": "Facial Emotion Recognition using Deep Learning Approach",
        "authors": "Sowmiya R, Sivakamasundari G, Archana V",
        "published": "2022-12-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icacrs55517.2022.10029092"
    },
    {
        "id": 20014,
        "title": "Facial Emotion Recognition Using Conventional Machine Learning and Deep Learning Methods: Current Achievements, Analysis and Remaining Challenges",
        "authors": "Amjad Rehman Khan",
        "published": "2022-5-25",
        "citations": 37,
        "abstract": "Facial emotion recognition (FER) is an emerging and significant research area in the pattern recognition domain. In daily life, the role of non-verbal communication is significant, and in overall communication, its involvement is around 55% to 93%. Facial emotion analysis is efficiently used in surveillance videos, expression analysis, gesture recognition, smart homes, computer games, depression treatment, patient monitoring, anxiety, detecting lies, psychoanalysis, paralinguistic communication, detecting operator fatigue and robotics. In this paper, we present a detailed review on FER. The literature is collected from different reputable research published during the current decade. This review is based on conventional machine learning (ML) and various deep learning (DL) approaches. Further, different FER datasets for evaluation metrics that are publicly available are discussed and compared with benchmark results. This paper provides a holistic review of FER using traditional ML and DL methods to highlight the future gap in this domain for new researchers. Finally, this review work is a guidebook and very helpful for young researchers in the FER area, providing a general understating and basic knowledge of the current state-of-the-art methods, and to experienced researchers looking for productive directions for future work.",
        "link": "http://dx.doi.org/10.3390/info13060268"
    },
    {
        "id": 20015,
        "title": "Current Challenges of Facial Recognition using Deep Learning",
        "authors": "Kebir Marwa, Ouni Kais",
        "published": "2022-5-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssd54932.2022.9955857"
    },
    {
        "id": 20016,
        "title": "Deep Learning Approach For Facial Age Recognition",
        "authors": "Amgad Muneer, Rao Faizan Ali, Abdo Ali Al-Sharai",
        "published": "2021-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icic53490.2021.9692943"
    },
    {
        "id": 20017,
        "title": "A Compact Deep Learning Model for Robust Facial Expression Recognition",
        "authors": "Chieh-Ming Kuo, Shang-Hong Lai, Michel Sarkis",
        "published": "2018-6",
        "citations": 105,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvprw.2018.00286"
    },
    {
        "id": 20018,
        "title": "Facial Emotional Expression Recognition Using Hybrid Deep Learning Algorithm",
        "authors": "Phasook Phattarasooksirot, Adna Sento",
        "published": "2022-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbir54589.2022.9786421"
    },
    {
        "id": 20019,
        "title": "Deep Learning-Based Facial Emotion Recognition for Driver Healthcare",
        "authors": "Goutam Kumar Sahoo, Santos Kumar Das, Poonam Singh",
        "published": "2022-5-24",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ncc55593.2022.9806751"
    },
    {
        "id": 20020,
        "title": "A Review of Deep Learning Methods in Automatic Facial Micro Expression Recognition",
        "authors": "Lalasa M, Jyothi Thomas",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4097301"
    },
    {
        "id": 20021,
        "title": "Facial Expression Recognition via Deep Learning",
        "authors": "Abir Fathallah, Lotfi Abdi, Ali Douik",
        "published": "2017-10",
        "citations": 49,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aiccsa.2017.124"
    },
    {
        "id": 20022,
        "title": "Multi-Modal Emotion Recognition From Speech and Facial Expression Based on Deep Learning",
        "authors": "Linqin Cai, Jiangong Dong, Min Wei",
        "published": "2020-11-6",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac51589.2020.9327178"
    },
    {
        "id": 20023,
        "title": "Emotion Recognition with Music using Facial Feature Extraction and Deep Learning",
        "authors": "Ananya Dhar, Bilal N Shaikh Mohammad",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3560840"
    },
    {
        "id": 20024,
        "title": "Intel and ZTE develop deep learning benchmark for facial recognition",
        "authors": "",
        "published": "2017-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s0969-4765(17)30025-5"
    },
    {
        "id": 20025,
        "title": "Dynamic Facial Expression Recognition Based on Deep Learning",
        "authors": "Liwei Deng, Qian Wang, Ding Yuan",
        "published": "2019-8",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccse.2019.8845493"
    },
    {
        "id": 20026,
        "title": "Research on facial recognition system based on deep learning",
        "authors": "Yiming Yao",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "This essay explores the integration of deep learning techniques in facial recognition, delving into the advancements, challenges, and prospects in future of this transformative technology. Deep learning, a subset of artificial intelligence, has revolutionized facial recognition by enabling automatic feature learning and robust representations from raw facial data. This paper examines the key components of deep learning in facial recognition, including feature extraction, facial alignment, and face recognition. It highlights the advantages of using deep learning over traditional methods by analysing related research. It also addresses the challenges deep learning faces in facial recognition, such as data bias, privacy concerns, and adversarial attacks. The essay also explores the promising future of deep learning in facial recognition, with ongoing research aiming to improve robustness, fairness, and privacy preservation.",
        "link": "http://dx.doi.org/10.54254/2755-2721/34/20230332"
    },
    {
        "id": 20027,
        "title": "Classification of prefeature extracted images with deep convolutional neural network in facial emotion recognition of vehicle driver",
        "authors": "Ganesan Kaliyaperumal, Manikandan N.S.",
        "published": "2021-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/pbpc042e_ch10"
    },
    {
        "id": 20028,
        "title": "Facial Attractiveness Classification using Deep Learning",
        "authors": "Ricky Anderson, Aryo Pradipta Gema,  Suharjito, Sani M. Isa",
        "published": "2018-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/inapr.2018.8627004"
    },
    {
        "id": 20029,
        "title": "Deep Learning Framework for Facial Emotion Recognition using CNN Architectures",
        "authors": "Rohan Appasaheb Borgalli, Sunil Surve",
        "published": "2022-3-16",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icears53579.2022.9751735"
    },
    {
        "id": 20030,
        "title": "Research on Facial Expression Recognition Based on Deep Learning",
        "authors": "Xiaofang Jin, Ying Xu",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eitce47263.2019.9095140"
    },
    {
        "id": 20031,
        "title": "Occlusion-aware facial expression recognition: A deep learning approach",
        "authors": "Palanichamy Naveen",
        "published": "2023-9-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-023-17013-1"
    },
    {
        "id": 20032,
        "title": "Real Time Facial Expression Recognition using Deep Learning",
        "authors": "Isha Talegaonkar, Kalyani Joshi, Shreya Valunj, Rucha Kohok, Anagha Kulkarni",
        "published": "No Date",
        "citations": 25,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3421486"
    },
    {
        "id": 20033,
        "title": "Enhancing Facial Expression Recognition System in Online Learning Context Using Efficient Deep Learning Model",
        "authors": "Mohammed Aly, Abdullatif Ghallab, Islam S. Fathi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3325407"
    },
    {
        "id": 20034,
        "title": "Evaluating Impact of Race in Facial Recognition across Machine Learning and Deep Learning Algorithms",
        "authors": "James Coe, Mustafa Atay",
        "published": "2021-9-10",
        "citations": 9,
        "abstract": "The research aims to evaluate the impact of race in facial recognition across two types of algorithms. We give a general insight into facial recognition and discuss four problems related to facial recognition. We review our system design, development, and architectures and give an in-depth evaluation plan for each type of algorithm, dataset, and a look into the software and its architecture. We thoroughly explain the results and findings of our experimentation and provide analysis for the machine learning algorithms and deep learning algorithms. Concluding the investigation, we compare the results of two kinds of algorithms and compare their accuracy, metrics, miss rates, and performances to observe which algorithms mitigate racial bias the most. We evaluate racial bias across five machine learning algorithms and three deep learning algorithms using racially imbalanced and balanced datasets. We evaluate and compare the accuracy and miss rates between all tested algorithms and report that SVC is the superior machine learning algorithm and VGG16 is the best deep learning algorithm based on our experimental study. Our findings conclude the algorithm that mitigates the bias the most is VGG16, and all our deep learning algorithms outperformed their machine learning counterparts.",
        "link": "http://dx.doi.org/10.3390/computers10090113"
    },
    {
        "id": 20035,
        "title": "Enhancing Facial Emotion Recognition through Deep Learning and Image Pre-processing",
        "authors": "Ekta Singh, Parma Nand",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cisct57197.2023.10351308"
    },
    {
        "id": 20036,
        "title": "Deep Facial Diagnosis: Deep Transfer Learning From Face Recognition to Facial Diagnosis",
        "authors": "Bo Jin, Leandro Cruz, Nuno Gonçalves",
        "published": "2020",
        "citations": 134,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2020.3005687"
    },
    {
        "id": 20037,
        "title": "Research on Facial Expression Recognition Based on Deep Learning Method",
        "authors": "Shihan Fu",
        "published": "2022-10-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccasit55263.2022.9987082"
    },
    {
        "id": 20038,
        "title": "Facial Expression Recognition Using Visual Saliency and Deep Learning",
        "authors": "Viraj Mavani, Shanmuganathan Raman, Krishna P. Miyapuram",
        "published": "2017-10",
        "citations": 46,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccvw.2017.327"
    },
    {
        "id": 20039,
        "title": "Deep Learning for Illumination Invariant Facial Expression Recognition",
        "authors": "Ariel Ruiz-Garcia, Vasile Palade, Mark Elshaw, Ibrahim Almakky",
        "published": "2018-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489123"
    },
    {
        "id": 20040,
        "title": "Adaptive Deep Metric Learning for Identity-Aware Facial Expression Recognition",
        "authors": "Xiaofeng Liu, B. V. K. Vijaya Kumar, Jane You, Ping Jia",
        "published": "2017-7",
        "citations": 139,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvprw.2017.79"
    },
    {
        "id": 20041,
        "title": "Recognition of Facial Attributes Using Multi-Task Learning of Deep Networks",
        "authors": "Changhun Hyun, Hyeyoung Park",
        "published": "2017-2-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3055635.3056618"
    },
    {
        "id": 20042,
        "title": "Occluded-based Facial Recognition under mask using Deep learning method",
        "authors": "Haoyu Wang, Guanhua Wei, Haoning Xu, Chong Zhang",
        "published": "2022-5-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvidliccea56201.2022.9825461"
    },
    {
        "id": 20043,
        "title": "Facial Emotions Recognition Using Deep Learning Technology",
        "authors": "Abhinav Chaubey",
        "published": "2021-9-30",
        "citations": 0,
        "abstract": "Abstract: Artificial Intelligent give us capability to detect emotions of human being. Due variation of individual expression it is difficult to find precisely. With AI we can mimics a human's capability like recognising someone with a restricted facial feature. this . paper, of mine indentify the face emotions by detecting areas of face like eyes, nose, lips, and forehead. By implementing two repressing methods like histogram and data augmentation we propos to extract characteristics of facial emotion. Here in this paper two dimensional architecture is used. First is used for inputting greyscale of face image where as second is for accepting histograms. the final process calculate the result on the bases of KNN and SVM classifiers. The results indicates that proposed algorithm detect six fundamental facial emotions , Happiness, Anger, Fear and surprise. Précised result are expected by using trained model data set. Keywords: SVM, KNN, FER, DNN, VGG16, HOG, HSOG.",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.38100"
    },
    {
        "id": 20044,
        "title": "Masked Facial Recognition System using Multi-Branch Deep Learning Models and Splatted Dataset.",
        "authors": "Mahmoud Fahim, Mohamed Abdel-Nasser, Moataz Abdelwahab, Adel B. Abdel-Rahman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn the last decade, face recognition (FR) has gained more importance in applications like security, access control, …etc. The FR performance gets closer to the human performance. But the spread of Covid-19 disease returns it some steps behind. The fear of covid-19 dangerousness forced people to wear medical masks. Wearing a mask increased the difficulty by losing half of the data behind the mask. In this paper, we propose a small identification system containing two parts. The first part, the detection part, takes the image from a video frame or image, and it detects the face/s using MTCNN detection. The second part, the decision part, used the output face/s from the first part and splits the face into lower and upper partitions. The lower partition enters the masked/unmasked CNN model. The upper partition is input to identify the person CNN model. We describe three proposed models with an accuracy of 93%, 99.88%, and 100%. Our strategy for dealing with the dataset is to divide the dataset into small datasets, each containing only fifty classes at most. So that several models are trained on small datasets, and each model is trained on small datasets different from those used for training in the other model, instead of training one model on the primary dataset. This strategy helped to increase accuracy and reduce error, execution time, and training time than required to train a single model on the main dataset.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3449031/v1"
    },
    {
        "id": 20045,
        "title": "Enhancing Facial Expression Recognition through Ensemble Deep Learning",
        "authors": "Tinuk Agustin, Moch. Hari Purwidiantoro, Mochammad Luthfi Rahmadi",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoris60118.2023.10352183"
    },
    {
        "id": 20046,
        "title": "Research on Multi Pose Facial Feature Recognition Based on Deep Learning",
        "authors": "Zhiling Ren, Xingen Xue",
        "published": "2020-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmcce51767.2020.00313"
    },
    {
        "id": 20047,
        "title": "Facial Emotion Recognition using Deep Learning (FERDL)",
        "authors": "Hafiz Arslan Ramzan, Ahmed Sohaib, Sadia Ramzan, Tehmina Kalsum, Muhammad Aqeel, Mohsin Majeed",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/inmic60434.2023.10466203"
    },
    {
        "id": 20048,
        "title": "Performance Analysis of Facial Expression Recognition Algorithms Based on Machine Learning and Deep Learning",
        "authors": "Lijie Qin, Nengkun Tao, Siyi Zheng, Xiarui Zheng",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00038"
    },
    {
        "id": 20049,
        "title": "Hand-Crafted Feature Guided Deep Learning for Facial Expression Recognition",
        "authors": "Guohang Zeng, Jiancan Zhou, Xi Jia, Weicheng Xie, Linlin Shen",
        "published": "2018-5",
        "citations": 33,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/fg.2018.00068"
    },
    {
        "id": 20050,
        "title": "A Compact Deep Learning Model for Robust Facial Expression Recognition",
        "authors": "",
        "published": "2019-8-30",
        "citations": 1,
        "abstract": "In this paper we are proposing a compact CNN model for facial expression recognition. Expression recognition on the low quality images are much more challenging and interesting due to the presence of low-intensity expressions. These low intensity expressions are difficult to distinguish with insufficient image resolution. Data collection for FER is expensive and time-consuming. Researches indicates the fact that downloaded images from the Internet is very useful to model and train expression recognition problem. We use extra datasets to improve the training of facial expression recognition, each representing specific data source. Moreover, to prevent subjective annotation, each dataset is labeled with different approaches to ensure annotation qualities. Recognizing the precise and exact expression from a variety of expressions of different people is a huge problem. To solve this problem, we proposed an Emotion Detection Model to extract emotions from the given input image. This work mainly focuses on the psychological approach of color circle-emotion relation[1] to find the accurate emotion from the input image. Initially the whole image is preprocessed and pixel by pixel data is studied. And the combinations of the circles based on combined data will result in a new color. This resulted color will be directly correlated to a particular emotion. Based on the psychological aspects the output will be of reasonable accuracy. The major application of our work is to predict a person’s emotion based on his face images or video frames This can even be applied for evaluating the public opinion relating to a particular movie, form the video reaction posts on social Medias. One of the diverse applications of our system is to understand the students learning from their emotions. Human beings shows their emotional states and intentions through facial expressions.. Facial expressions are powerful and natural methods that emphasize the emotional status of humans .The approach used in this work successfully exploits temporal information and it improves the accuracies on the public benchmarking databases. The basic facial expressions are happiness, fear, anger, disgust sadness, and surprise[2]. Contempt was subsequently added as one of the basic emotions. Having sufficient well labeled training data with variations of the populations and environments is important for the design of a deep expression recognition system .Behaviors, poses, facial expressions, actions and speech are considered as channels, which convey human emotions. Lot of research works are going on in this field to explore the correlation between the above mentioned channels and emotions. This paper highlights on the development of a system which automatically recognizes the",
        "link": "http://dx.doi.org/10.35940/ijeat.f8724.088619"
    },
    {
        "id": 20051,
        "title": "Multimodal Biometrics Recognition from Facial Video via Deep Learning",
        "authors": "Sayan Maity, Mohamed Abdel-Mottaleb, Shihab S. As",
        "published": "2017-1-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5121/csit.2017.70107"
    },
    {
        "id": 20052,
        "title": "Deep Convolutional Neural Networks with Curriculum Learning for Facial Expression Recognition",
        "authors": "Xiaoqian Liu, Fengyu Zhou, Dongdong Shen, Shuqian Wang",
        "published": "2019-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccdc.2019.8832982"
    },
    {
        "id": 20053,
        "title": "A Review of Local, Holistic and Deep Learning Approaches in Facial Expressions Recognition",
        "authors": "Kennedy Chengeta, Serestina Viriri",
        "published": "2019-3",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictas.2019.8703521"
    },
    {
        "id": 20054,
        "title": "Facial emotion recognition using deep learning: review and insights",
        "authors": "Wafa Mellouk, Wahida Handouzi",
        "published": "2020",
        "citations": 130,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2020.07.101"
    },
    {
        "id": 20055,
        "title": "Real Time Facial Expression Recognition System Based on Deep Learning",
        "authors": "",
        "published": "2019-11-2",
        "citations": 6,
        "abstract": "The automatic detection of facial expressions is an active research topic, since its wide fields of applications in human-computer interaction, games, security or education. However, the latest studies have been made in controlled laboratory environments, which is not according to real world scenarios. For that reason, a real time Facial Expression Recognition System (FERS) is proposed in this paper, in which a deep learning approach is applied to enhance the detection of six basic emotions: happiness, sadness, anger, disgust, fear and surprise in a real-time video streaming. This system is composed of three main components: face detection, face preparation and face expression classification. The results of proposed FERS achieve a 65% of accuracy, trained over 35558 face images..",
        "link": "http://dx.doi.org/10.35940/ijrte.b1591.0982s1119"
    },
    {
        "id": 20056,
        "title": "Facial Emotion Recognition Using Ensemble Learning",
        "authors": "GuanQun Xu, Wei Qi Yan",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "Facial emotion recognition (FER) is the task of identifying human emotions from facial expressions. The purpose of this book chapter is to improve accuracy of facial emotion recognition using integrated learning of lightweight networks without increasing the complexity or depth of the network. Compared to single lightweight models, it made a significant improvement. For a solution, the authors proposed an ensemble of mini-Xception models, where each expert is trained for a specific emotion and lets confidence score for the vote. Therefore, the expert model will transform the original multiclass task into binary tasks. The authors target the model to differentiate between a specific emotion and all others, facilitating the learning process. The principal innovation lies in our confidence-based voting mechanism, in which the experts “vote” based on their confidence scores rather than binary decisions.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1738-9.ch007"
    },
    {
        "id": 20057,
        "title": "A Review on Facial Emotion Recognition Using Machine and Deep Learning Algorithm",
        "authors": "",
        "published": "2020-5-30",
        "citations": 0,
        "abstract": "Facial emotions are the changes in facial expressions about a person’s inner excited tempers, objectives, or social exchanges which are scrutinized with the aid of computer structures that attempt to subsequently inspect and identify the facial feature and movement variations from visual data. Facial emotion recognition (FER) is a noteworthy area in the arena of computer vision and artificial intelligence due to its significant commercial and academic potential. FER has become a widespread concept of deep learning and offers more fields for application in our day-to-day life. Facial expression recognition (FER) has gathered widespread consideration recently as facial expressions are thought of as the fastest medium for communicating any of any sort of information. Recognizing facial expressions provides an improved understanding of a person’s thoughts or views. With the latest improvement in computer vision and machine learning, it is plausible to identify emotions from images. Analyzing them with the presently emerging deep learning methods enhance the accuracy rate tremendously as compared to the traditional contemporary systems. This paper emphases the review of a few of the machine learning, deep learning, and transfer learning techniques used by several researchers that flagged the means to advance the classification accurateness of the FEM.",
        "link": "http://dx.doi.org/10.35291/2454-9150.2020.0353"
    },
    {
        "id": 20058,
        "title": "Real Time Facial Gesture Recognition using Deep Learning",
        "authors": "Abaikesh Sharma",
        "published": "2021-6-10",
        "citations": 0,
        "abstract": "The human faces have vibrant frequency of characteristics, which makes it difficult to analyze the facial expression. Automated real time emotions recognition with the help of facial expressions is a work in computer vision. This environment is an important and interesting tool between the humans and computers. In this investigation an environment is created which is capable of analyzing the person’s emotions using the real time facial gestures with the help of Deep Neural Network. It can detect the facial expression from any image either real or animated after facial extraction (muscle position, eye expression and lips position). This system is setup to classify images of human faces into seven discrete emotion categories using Convolutional Neural Networks (CNNs). This type of environment is important for social interaction.",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.34900"
    },
    {
        "id": 20059,
        "title": "Facial Action Unit Recognition Using Data Mining Integrated Deep Learning",
        "authors": "Omer M. Soysal, Shahrzad Shirzad, Kazim Sekeroglu",
        "published": "2017-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/csci.2017.74"
    },
    {
        "id": 20060,
        "title": "A Survey of Deep Learning-based Facial Expression Recognition Research",
        "authors": "Chengxu Liang, Jianshe Dong",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Facial expression is one of the ways to convey emotional expression. Deep learning is used to analyze facial expression to understand people's true feelings, and human-computer interaction is integrated into it. However, in the natural real environment and various interference (such as lighting, age and ethnicity), facial expression recognition will face many challenges. In recent years, with the development of artificial intelligence, scholars have studied more and more facial expression recognition in the case of interference, which not only promotes the theoretical research, but also makes it popularized in the application. Facial expression recognition is to identify facial expressions to carry out emotion analysis, and emotion analysis can be analyzed with the help of facial expressions, speech, text, video and other signals. Therefore, facial expression recognition can be regarded as a research direction of emotion analysis. This paper focuses on the perspective of facial expression recognition to summarize. In the process of facial expression recognition, researchers usually try to combine multiple modal information such as voice, text, picture and video for analysis. Due to the differences between single-modal data set and multi-modal data set, this paper will analyze static facial expression recognition, dynamic facial expression recognition and multi-modal fusion. This research has a wide range of applications, such as: smart elderly care, medical research, detection of fatigue driving and other fields.",
        "link": "http://dx.doi.org/10.54097/fcis.v5i2.12445"
    },
    {
        "id": 20061,
        "title": "Facial Expression Recognition Based on Arousal-Valence Emotion Model and Deep Learning Method",
        "authors": "Yong Yang, Yue Sun",
        "published": "2017-12",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icctec.2017.00022"
    },
    {
        "id": 20062,
        "title": "Real-Time Deep-Learning-Based System for Facial Recognition",
        "authors": "Wesley Passos, Igor Quintanilha, Gabriel Araujo",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14209/sbrt.2018.321"
    },
    {
        "id": 20063,
        "title": "Facial expression recognition using deep learning",
        "authors": "Harisu Abdullahi Shehu, Md. Haidar Sharif, Sahin Uyaver",
        "published": "2021",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0042221"
    },
    {
        "id": 20064,
        "title": "Deep Emotions Recognition from Facial Expressions using Deep Learning",
        "authors": "Iram Shahzadi, Mr. Muhammad Fuzail, Dr. Naeem Aslam",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "Deep emotion recognition has a wide range of applications, including human-robot communication, business, movies, services hotels, and even politics. Despite the use of various supervised and unsupervised methods in many different fields, there is still a lack of accurate analysis. Therefore, we have taken on this challenge as our research problem. We have proposed a mechanism for efficient and fine-grained classification of human deep emotions that can be applied to many other problems in daily life. This study aims to explore the best-suited algorithm along with optimal parameters to provide a solution for an efficient emotion detection machine learning system. In this study, we aimed to recognize emotions from facial expressions using deep learning techniques and the JAFFE dataset. The performance of three different models, a CNN (Convolutional Neural Network), an ANN (Artificial Neural Network), and an SVM (Support Vector Machine) were evaluated using precision, recall, F1-score, and accuracy as the evaluation metrics. The results of the experiments show that all three models performed well in recognizing emotions from facial expressions. The CNN model achieved a precision of 0.653, recall of 0.561, F1-score of 0.567, and accuracy of 0.62. The ANN model achieved a precision of 0.623, recall of 0.542, F1-score of 0.542, and accuracy of 0.59. The SVM model achieved a precision of 0.643, recall of 0.559, F1-score of 0.545, and accuracy of 0.6. Overall, the results of the study indicate that deep learning techniques can be effectively used for recognizing emotions from facial expressions using the JAFFE dataset.",
        "link": "http://dx.doi.org/10.21015/vtse.v11i2.1501"
    },
    {
        "id": 20065,
        "title": "Facial Paralysis Recognition Using Face Mesh-Based Learning",
        "authors": "Zeerak Baig, Dustin van der Haar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011682900003411"
    },
    {
        "id": 20066,
        "title": "The Customized Visual Geometry Group Deep Learning Architecture for Facial Emotion Recognition",
        "authors": "Jung Hwan Kim, Alwin Poulose, Dong Seog Han",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4087604"
    },
    {
        "id": 20067,
        "title": "Deep Learning for Facial Informatics",
        "authors": "",
        "published": "2020-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/books978-3-03936-965-2"
    },
    {
        "id": 20068,
        "title": "Cross-Domain Knowledge Transfer for Incremental Deep Learning in Facial Expression Recognition",
        "authors": "Nehemia Sugianto, Dian Tjondronegoro",
        "published": "2019-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ritapp.2019.8932731"
    },
    {
        "id": 20069,
        "title": "Real Time Baby Facial Expression Recognition Using Deep Learning and IoT Edge Computing",
        "authors": "Ramendra Pathak, Yaduvir Singh",
        "published": "2020-10-14",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccs49678.2020.9277428"
    },
    {
        "id": 20070,
        "title": "Deep Learning based Facial Emotion Recognition",
        "authors": "Swayam Badhe, Sangita Chaudhari",
        "published": "2022",
        "citations": 0,
        "abstract": "Human Facial expression is the mirror of human emotions playing very significant role in nonverbal communication. In many applications like human machine interface, medical diagnosis, AI based games, market research etc. needs facial expression recognition. Although it is very easy task for humans, its bit challenging for machines to detect and recognize correct emotions from series of human facial expressions. Since decade, many researchers have tried different image processing, machine learning and deep learning-based approaches to correctly identify human emotions. Some of them could able to identify emotions but with more complexity. WE have proposed CNN model with 4 convolution layer and 2 FC layers which is giving good accuracy over the existing models with less complexity. It is performing better for all classes except fear and disgust.",
        "link": "http://dx.doi.org/10.1051/itmconf/20224403058"
    }
]