[
    {
        "id": 12471,
        "title": "Fundamentals of Object Detection",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-1"
    },
    {
        "id": 12472,
        "title": "Object Detection in Degraded Vision",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-7"
    },
    {
        "id": 12473,
        "title": "Imaging Modalities for Object Detection",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-3"
    },
    {
        "id": 12474,
        "title": "Real-Time Benchmark Datasets for Object Detection",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-4"
    },
    {
        "id": 12475,
        "title": "FPGA based Deep Learning Models for Object Detection and Recognition Comparison of Object Detection Comparison of object detection models using FPGA",
        "authors": "S.P. Kaarmukilan, Soumyajit Poddar, Amal Thomas K",
        "published": "2020-3",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccmc48092.2020.iccmc-00088"
    },
    {
        "id": 12476,
        "title": "Deep Learning in Object Detection",
        "authors": "Yanwei Pang, Jiale Cao",
        "published": "2019",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-5152-4_2"
    },
    {
        "id": 12477,
        "title": "LEARNING OBJECT MODEL FOR MOVING FOREGROUND OBJECT DETECTION  USING REGRESSION METHOD",
        "authors": "",
        "published": "2017-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23883/ijrter.conf.20170331.041.oehos"
    },
    {
        "id": 12478,
        "title": "Construction process monitoring using artificial intelligence object detection",
        "authors": "Hana Begić",
        "published": "2021-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5592/co/zt.2021.01"
    },
    {
        "id": 12479,
        "title": "Hands-on Practical for Object Detection Approaches in Degraded Vision",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-8"
    },
    {
        "id": 12480,
        "title": "R-FCN Object Detection Ensemble based on Object Resolution and Image Quality",
        "authors": "Christoffer Bøgelund Rasmussen, Kamal Nasrollahi, Thomas B. Moeslund",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006511301100120"
    },
    {
        "id": 12481,
        "title": "Pothole Detection under Diverse Conditions using Object Detection Models",
        "authors": "Syed Hassan, Dympna O’Sullivan, Susan Mckeever",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010463701280136"
    },
    {
        "id": 12482,
        "title": "Traditional Object Detector Ensemble for Enhancing Object Detection (Using Corner Detectors)",
        "authors": "Sudhir Mundhra",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4425823"
    },
    {
        "id": 12483,
        "title": "Computer Vision and Object Detection",
        "authors": "Vangos Pterneas",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-8070-6_12"
    },
    {
        "id": 12484,
        "title": "Object Detection Frameworks and Services in Computer Vision",
        "authors": "Sachi Choudhary, Rashmi Sharma, Gargeya Sharma",
        "published": "2022-9-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003206736-2"
    },
    {
        "id": 12485,
        "title": "Simultaneous Object Detection and Semantic Segmentation",
        "authors": "Niels Salscheider",
        "published": "2020",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009142905550561"
    },
    {
        "id": 12486,
        "title": "Moving Object Detection and Deepsort Fusion for Dynamic Object Tracking",
        "authors": "fang dou, Mei Tu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFor the problem of space dynamic target tracking with occlusion, this paper proposes an online tracking method based on the combination between the five-frame difference and Deepsort (Simple Online and Realtime Tracking with a Deep Association Metric), which is to achieve the identification first and then tracking of the dynamic target. First of all, according to three-frame difference, the five-frame difference is improved, and through the integration with ViBe (Visual Background Extraction), the accuracy and anti-interference ability are enhanced; Secondly, the YOLOv5s (You Look Only Once) is improved using preprocessing of DWT (Discrete Wavelet Transformation) and injecting GAM (Global Attention Module), which is considered as the detector for Deepsort to solve the missing in occlusion, and the real-time and accuracy can be strengthened; Lastly, simulation results show that the proposed space dynamic target tracking can keep stable to track all dynamic targets under the background interference and occlusion, the tracking precision is improved to 93.88%. Furthermore, there is a combination with the physical depth camera D435i, experiments on target dynamics show the effectiveness and superiority of the proposed recognition and tracking algorithm in the face of strong light and occlusion.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3926726/v1"
    },
    {
        "id": 12487,
        "title": "Detection of acne by deep learning object detection",
        "authors": "Amandip Sangha, Mohammad Rizvi",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractImportanceState-of-the art performance is achieved with a deep learning object detection model for acne detection. There is little current research on object detection in dermatology and acne in particular. As such, this work is early in this field and achieves state of the art performance.ObjectiveTrain an object detection model on a publicly available data set of acne photos.Design, Setting, and ParticipantsA deep learning model is trained with cross validation on a data set of facial acne photos.Main Outcomes and MeasuresObject detection models for detecting acne for single-class (acne) and multi-class (four severity levels). We train and evaluate the models using standard metrics such as mean average precision (mAP). Then we manually evaluate the model predictions on the test set, and calculate accuracy in terms of precision, recall, F1, true and false positive and negative detections.ResultsWe achieve state-of-the art mean average precision mAP@0.5 value of 37.97 for the single class acne detection task, and 26.50 for the 4-class acne detection task. Moreover, our manual evaluation shows that the single class detection model performs well on the validation set, achieving true positive 93.59 %, precision 96.45 % and recall 94.73 %.Conclusions and RelevanceWe are able to train a high-accuracy acne detection model using only a small publicly available data set of facial acne. Transfer learning on the pre-trained deep learning model yields good accuracy and high degree of transferability to patient submitted photographs. We also note that the training of standard architecture object detection models has given significantly better accuracy than more intricate and bespoke neural network architectures in the existing research literature.Key PointsQuestionCan deep learning-based acne detection models trained on a small data set of publicly available photos of patients with acne achieve high prediction accuracy?FindingsWe find that it is possible to train a reasonably good object detection model on a small, annotated data set of acne photos using standard deep learning architectures.MeaningDeep learning-based object detection models for acne detection can be a useful decision support tools for dermatologists treating acne patients in a digital clinical practice. It can prove a particularly useful tool for monitoring the time evolution of the acne disease state over prolonged time during follow-ups, as the model predictions give a quantifiable and comparable output for photographs over time. This is particularly helpful in teledermatological consultations, as a prediction model can be integrated in the patient-doctor remote communication.",
        "link": "http://dx.doi.org/10.1101/2021.12.05.21267310"
    },
    {
        "id": 12488,
        "title": "Towards General Purpose Object Detection: Deep Dense Grid Based Object Detection",
        "authors": "Solomon Negussie Tesema, El-Bay Bourennane",
        "published": "2020-11-17",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iit50501.2020.9299036"
    },
    {
        "id": 12489,
        "title": "Complementary Object Detection: Improving Reliability of Object Candidates Using Redundant Detection Approaches",
        "authors": "Waldemar Boschmann, Fateme Bakhshande, Dirk Söffker",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3850/978-981-18-8071-1_p261-cd"
    },
    {
        "id": 12490,
        "title": "Object Detection for Autonomous Driving",
        "authors": "Wen-Hui Chen",
        "published": "2019",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12792/icisip2019.002"
    },
    {
        "id": 12491,
        "title": "Traffic Density and On-road Moving Object Detection Management, Using Video Processing",
        "authors": "Ankit Shrivastava, S. Poonkuntran",
        "published": "2022-9-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003206736-5"
    },
    {
        "id": 12492,
        "title": "Recent Advances in Video Captioning with Object Detection",
        "authors": "Nasib Ullah, Partha Pratim Mohanta",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003393658-1"
    },
    {
        "id": 12493,
        "title": "Bidirectional Interactive Head Structure: Handling Object Imbalance in Object Detection",
        "authors": "Enhui Chai, Li Chen, Xingxing Hao",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4231480"
    },
    {
        "id": 12494,
        "title": "Development of UAV for fire detection and for Object Detection and Tracking of Flying Object",
        "authors": "Sutthiphong Srigrarom, Photchara Ratsamee",
        "published": "2019-6-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2019-3138"
    },
    {
        "id": 12495,
        "title": "An Unique &amp; Accurate Object Detection based on Density Maps on Spectral Analysis Object using Sobel and Robert Edge Detection Algorithm",
        "authors": "",
        "published": "2021-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/aj10.5/009"
    },
    {
        "id": 12496,
        "title": "Attentive Layer Separation for Object Classification and Object Localization in Object Detection",
        "authors": "Jung Uk Kim, Yong Man Ro",
        "published": "2019-9",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip.2019.8803439"
    },
    {
        "id": 12497,
        "title": "Object Detection and Classification on Heterogeneous Datasets",
        "authors": "Tobias Brosch, Ahmed Elshaarany",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007251903070312"
    },
    {
        "id": 12498,
        "title": "Towards Effective Microalgae Object Detection Solutions to IEEE UV 2022 “Vision Meets Alage” Object Detection Challenge",
        "authors": "Yunchen Zhang, Wei Zeng, Fan Yang",
        "published": "2022-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/uv56588.2022.10185487"
    },
    {
        "id": 12499,
        "title": "Object Detection and Count of Objects in Image using Tensor Flow Object Detection API",
        "authors": "B N Krishna Sai, T. Sasikala",
        "published": "2019-11",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icssit46314.2019.8987942"
    },
    {
        "id": 12500,
        "title": "Real Time Object Detection Using YoloReal Time Object Detection Using Yolo",
        "authors": "Ankith I",
        "published": "2021-11-30",
        "citations": 3,
        "abstract": "Abstract: Object detection is related to computer vision and involves identifying the kinds of objects that have been detected. It is challenging to detect and classify objects. Recent advances in deep learning have allowed it to detect objects more accurately. In the past, there were several methods or tools used: R-CNN, Fast-RCNN, Faster-RCNN, YOLO, SSD, etc. This research focuses on \"You Only Look Once\" (YOLO) as a type of Convolutional Neural Network. Results will be accurate and timely when tested. So, we analysed YOLOv3's work by using Yolo3-tiny to detect both image and video objects. Keywords: YOLO, Intersection over Union (IOU), Anchor box, Non-Max Suppression, YOLO application, limitation.",
        "link": "http://dx.doi.org/10.22214/ijraset.2021.39044"
    },
    {
        "id": 12501,
        "title": "Artifacts Impact on Different Object Visualization",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036-5"
    },
    {
        "id": 12502,
        "title": "Obepa: Object-Embedding Predictive Alignment for Semi-Supervised Object Detection",
        "authors": "Zunran Wang, Zhonghua Li, Zhijian Chen, Zhao Cao",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4637492"
    },
    {
        "id": 12503,
        "title": "Real-Time Object Detection using an Ensemble of One Stage and Two Stage Object Detection Models with Dynamic Fine-tuning using Kullback-Leibler Divergence",
        "authors": "Lenard Nkalubo, Rose Nakibuule, Nixson Okila",
        "published": "No Date",
        "citations": 0,
        "abstract": "Real-time object detection is a very challenging task, as it requires\nboth high accuracy and high speed. One-stage object detectors such as\nYOLO models are very fast but they are also less accurate than two-stage\nobject detectors such as Faster R-CNN. However, Faster R-CNN is not as\nfast as the YOLO models. In this study, we propose an ensemble approach\nto real-time object detection that combines the strengths of YOLOv5 and\nFaster R-CNN. We first use YOLOv5 to quickly generate a set of object\nproposals. We then use Faster R-CNN to refine these proposals and\nproduce more accurate object detection results. To further improve the\naccuracy of our object detection results, we propose a cascade\nrefinement network that uses dynamic fine-tuning. The cascade refinement\nnetwork uses Kullback-Leibler divergence to dynamically adjust the\nweights of the Faster R-CNN model based on the confidence scores of the\nYOLOv5 object proposals. We evaluated our proposed approach on the novel\ndataset collected in Uganda with other State-of-the-art approaches which\ninclude RetinaNet, Cascade R-CNN, Single-Shot MultiBox Detector (SSD),\nand Region-based Convolutional Neural Network (R-CNN). Experimental\nresults revealed that the proposed ensemble model outperformed both base\nmodels with an average precision of 0.96, which is significantly higher\nthan the average precision of 0.91 for YOLOv5 and 0.90 for Faster R-CNN.\nThe ensemble model was also able to achieve real-time inference speeds,\nprocessing frames at a rate of 25 frames per second, the same speed\nachieved by YOLOv5, faster than the speed of 15 frames per second by\nFaster R-CNN. The results also revealed that the proposed ensemble model\nis comparable to other state-of-the-art object detection models. Our\nproposed approach can be used to improve the accuracy and speed of\nreal-time object detection in a variety of applications.",
        "link": "http://dx.doi.org/10.22541/au.168788163.30701797/v1"
    },
    {
        "id": 12504,
        "title": "Mnist Redesign for Object Detection",
        "authors": "Jinxin Wei, Zhe Hou",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Inspired by my another paper[3], neural network can detect location and size,so it can do object detection task. I redesign the mnist dataset, to produce different location and different size. Through test on new mnist dataset, the rectangle of number is all right both on absolute function and relu function. The classification accuracy is 97%-98%, the accuracy of location of rectangle is 99%-100%. It is easy for location task than for classification task. It is easy to distinguish black and white for one object, but RGB picture is harder to distinguish. Because the role of neural network is like a function. The location task can achieved by neural network as long as the problem can be expressed by a function. The task can be done as long as there is enough data and enough network complexity. The whole task is suit to study object detection.When we use lidar, the picture we got is like the gray picture listed before, we just to classify and locate the way we can drive through, so one object should be classified and located, the accuracy is high.</p><p></p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.18480410.v2"
    },
    {
        "id": 12505,
        "title": "Object Detection in Images: A Survey",
        "authors": "Sabyasachi Moitra, Sambhunath Biswas",
        "published": "2023-4-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/sr23330184650"
    },
    {
        "id": 12506,
        "title": "Motion Vector Extrapolation for Video Object Detection",
        "authors": "Julian True",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Despite the continued successes of computationally efficient deep neural network architectures for video object detection, performance continually arrives at the great trilemma of speed versus accuracy versus computational resources (pick two). Current attempts to exploit temporal information in video data to overcome this trilemma are bottlenecked by the state-of-the-art in object detection models. This work presents Motion Vector Extrapolation (MOVEX), a technique which performs video object detection through the use of off-the-shelf object detectors alongside existing optical flow based motion estimation techniques in parallel. This work demonstrates that this approach significantly reduces the baseline latency of any given object detector without sacrificing accuracy performance. Further latency reductions, up to 24× lower than the original latency, can be achieved with minimal accuracy loss. MOVEX enables low latency video object detection on common CPU based systems, thus allowing for high performance video object detection beyond the domain of GPU computing.</p>",
        "link": "http://dx.doi.org/10.32920/25266754.v1"
    },
    {
        "id": 12507,
        "title": "Mnist Redesign for Object Detection",
        "authors": "Jinxin Wei, Zhe Hou",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Inspired by my another paper[3], neural network can detect location and size,so it can do object detection task. I redesign the mnist dataset, to produce different location and different size. Through test on new mnist dataset, the rectangle of number is all right both on absolute function and relu function. The classification accuracy is 97%-98%, the accuracy of location of rectangle is 99%-100%. It is easy for location task than for classification task. It is easy to distinguish black and white for one object, but RGB picture is harder to distinguish. Because the role of neural network is like a function. The location task can achieved by neural network as long as the problem can be expressed by a function. The task can be done as long as there is enough data and enough network complexity. The whole task is suit to study object detection.When we use lidar, the picture we got is like the gray picture listed before, we just to classify and locate the way we can drive through, so one object should be classified and located, the accuracy is high.</p><p></p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.18480410.v1"
    },
    {
        "id": 12508,
        "title": "Mnist Redesign for Object Detection",
        "authors": "Jinxin Wei, Zhe Hou",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Inspired by my another paper[3], neural network can detect location and size,so it can do object detection task. I redesign the mnist dataset, to produce different location and different size. Through test on new mnist dataset, the rectangle of number is all right both on absolute function and relu function. The classification accuracy is 97%-98%, the accuracy of location of rectangle is 99%-100%. It is easy for location task than for classification task. It is easy to distinguish black and white for one object, but RGB picture is harder to distinguish. Because the role of neural network is like a function. The location task can achieved by neural network as long as the problem can be expressed by a function. The task can be done as long as there is enough data and enough network complexity. The whole task is suit to study object detection.When we use lidar, the picture we got is like the gray picture listed before, we just to classify and locate the way we can drive through, so one object should be classified and located, the accuracy is high.</p><p></p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.18480410"
    },
    {
        "id": 12509,
        "title": "Motion Vector Extrapolation for Video Object Detection",
        "authors": "Julian True",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Despite the continued successes of computationally efficient deep neural network architectures for video object detection, performance continually arrives at the great trilemma of speed versus accuracy versus computational resources (pick two). Current attempts to exploit temporal information in video data to overcome this trilemma are bottlenecked by the state-of-the-art in object detection models. This work presents Motion Vector Extrapolation (MOVEX), a technique which performs video object detection through the use of off-the-shelf object detectors alongside existing optical flow based motion estimation techniques in parallel. This work demonstrates that this approach significantly reduces the baseline latency of any given object detector without sacrificing accuracy performance. Further latency reductions, up to 24× lower than the original latency, can be achieved with minimal accuracy loss. MOVEX enables low latency video object detection on common CPU based systems, thus allowing for high performance video object detection beyond the domain of GPU computing.</p>",
        "link": "http://dx.doi.org/10.32920/25266754"
    },
    {
        "id": 12510,
        "title": "Leveraging Object Proposals for Object-Level Change Detection",
        "authors": "Sugimoto Takuma, Tanaka Kanji, Yamaguchi Kousuke",
        "published": "2018-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ivs.2018.8500475"
    },
    {
        "id": 12511,
        "title": "Recent Trends in 2D Object Detection and Applications in Video Event Recognition",
        "authors": "Prithwish Jana, Partha Pratim Mohanta",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003393658-9"
    },
    {
        "id": 12512,
        "title": "Hierarchical Object Detection applied to Fish Species",
        "authors": "Dr. Aditya Gupta, Espen Stausland Kalhagen, Ørjan Langøy Olsen, Morten Goodwin",
        "published": "2022-6-3",
        "citations": 1,
        "abstract": "Gathering information of aquatic life is often based on timeconsumingmethods utilizing video feeds. It would be beneficialto capture more information cost-effectively from video feeds.Video based object detection has an ability to achieve this.Recent research has shown promising results with the use ofYOLO for object detection of fish. As underwater conditionscan be difficult and thus fish species are hard to discriminate.This study proposes a hierarchical structure-based YOLO Fishalgorithm in both the classification and the dataset to gainvaluable information. With the use of hierarchical classificationand other techniques. YOLO Fish is a state-of-the-art objectdetector on Nordic fish species, with an mAP of 91.8%. Thealgorithm has an inference time of 26.4 ms, fast enough torun on real-time video on the high-end GPU Tesla V100.",
        "link": "http://dx.doi.org/10.5617/nmi.9452"
    },
    {
        "id": 12513,
        "title": "Active Microwave Sensors for Complex Natural Resonance-Based Object Detection",
        "authors": "Boris Y. Kapilevich, Stuart W. Harmer, Nicholas J. Bowring",
        "published": "2017-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b17459-5"
    },
    {
        "id": 12514,
        "title": "Object Detection Performance: A Comparative Study",
        "authors": "Jihad Qaddour",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nObject detection is a critical task in computer vision with applications in many domains. Recent advances in deep learning have led to significant improvements in the performance of object detectors. This paper presents a comparative performance analysis of generic object detectors, with a focus on single-stage and two-stage detectors. The paper first discusses the taxonomy of object detection algorithms, and then presents a detailed performance comparison of single-stage and two-stage detectors. The performance of different detectors was evaluated on two different datasets, Microsoft COCO and PASCAL VOC 2012. The results showed that DetectoRS is a state-of-the-art two-stage object detector, outperforms all other two-stage models. While YOLOv4 and FCOS are the two most accurate single-stage detectors. The comparative results also show that single-stage detectors are generally less accurate than two-stage detectors, but they are typically faster. The paper also includes the strengths and weaknesses of different object detection approaches and identifies promising directions for future research.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3181849/v1"
    },
    {
        "id": 12515,
        "title": "Multi-Object Detection Using YOLOv7 Object Detection Algorithm on Mobile Device",
        "authors": "Patricia Citranegara Kusuma, Benfano Soewito",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "This research discusses the importance of enhancing real-time object detection on mobile devices by introducing a new multi-object detection system that uses the quantified YOLOv7 model. Focusing on the complexities of food item detection, particularly in diverse and intricate contexts, our study uses a dataset that includes five food classes. By investigating the influence of data quantity on the detection model, we demonstrate the superiority of larger datasets in both YOLOv5 and YOLOv7. In addition, our comparison shows that YOLOv7 has better precision, recall, and F1-score values compared to YOLOv5. The crucial methodological contribution lies in the successful quantification of the YOLOv7 model, reducing the model size from 28.6 KB to 14.3 KB and enabling seamless mobile application development. This high-performance mobile application displays a real-time interface response time of 235ms, with precision, recall, and F1-score values of 0.923, 0.9, and 0.911, respectively. Beyond the practical implications for informed dietary choices and improved health outcomes, our study develops object detection techniques theoretically, offering valuable insights that can be applied across various domains and emphasizing the potential impact of our approach on both theory and practice",
        "link": "http://dx.doi.org/10.37385/jaets.v5i1.3207"
    },
    {
        "id": 12516,
        "title": "Enhancement of Centernet Object Detection Algorithm Design",
        "authors": "NI anqing",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4697005"
    },
    {
        "id": 12517,
        "title": "A Novel Approach to Object Detection: Object Search",
        "authors": "Madhav Singh",
        "published": "2023-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icct56969.2023.10076212"
    },
    {
        "id": 12518,
        "title": "Object detection by using Chebyschev filter : Reducing error in object detection using traditional way",
        "authors": "Sunitt Shantanu Digamber Fulari, Harbinder Singh",
        "published": "2021-2-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicv50876.2021.9388422"
    },
    {
        "id": 12519,
        "title": "Text-Guided Salient Object Detection",
        "authors": "Zixian Xu, Luanqi Liu, Yingxun Wang, Xue Wang, Pu Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012284400003807"
    },
    {
        "id": 12520,
        "title": "Object Detection Using Wireless Signals",
        "authors": "Praveen Gorla, Teerapat Sanguankotvhakorn",
        "published": "No Date",
        "citations": 0,
        "abstract": "Wireless signals play major a role not only in establishing communication between the node to node but also for providing information about the other end of the destination node. Wireless signals especially used in radar engineering are used to detect the target eliminating the use of large number sensors. RF wireless signals which are generated from the networking (WiFi routers) devices can be used for remotely detecting the object. And nowadays networking devices installed in the household and the companies are the part of modern communication and by using these devices for the above said would greatly reduce the use of sensors for object sensing. A person away from his home can detect the changes during his absence with the routers that are installed in his home. This study aims at studying different techniques that are used for object detection using wireless signals at different scenarios.",
        "link": "http://dx.doi.org/10.35543/osf.io/ug9xk"
    },
    {
        "id": 12521,
        "title": "Object Classification: An Introduction",
        "authors": "Umberto Michelucci",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-4976-5_6"
    },
    {
        "id": 12522,
        "title": "Video Object Detection Using Densenet-Ssd",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29121/web/v18i5/62"
    },
    {
        "id": 12523,
        "title": "Remote Sensing for Target Object Detection and Identification",
        "authors": "",
        "published": "2020-3-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/books978-3-03928-333-0"
    },
    {
        "id": 12524,
        "title": "2D Geometric Object Shapes Detection and Classification",
        "authors": "Mokhtar M. Hasan, Noor A. Ibraheem, Noor M. Abdulhadi",
        "published": "2022-1-20",
        "citations": 0,
        "abstract": "In computer vision, object detection is a basic process for advanced procedure forms such as object detecting, analyzing, tracking, etc., for further processes, features extraction play a vital part to identify the objects accurately. Most of the existing frameworks may not be able to distinguish the objects appropriately when different objects have a place to a single frame. In this work, an automatic detection and recognition system of two-dimensional geometric shapes have been proposed. Firstly applied Genetic Algorithm (GA) to fill the shape after performing proper segmentation pre-processing method. The proposed framework is able of identifying numerous objects in the input image, determining the sort of the identified object, and labeled the recognized objects. Statistical method has been applied for each shape to extract the objects corners' points by calculating the largest boundary to form the features vector. Ultimately, the identified objects are classified as geometrical shapes such as square, rectangular, triangular, or circular. The proposed method achieved high accuracy around 98.3%, and an average computational time 0.521 sec. as an effective classification technique.",
        "link": "http://dx.doi.org/10.14704/web/v19i1/web19113"
    },
    {
        "id": 12525,
        "title": "Efficient Object Detection and Classification Approach Using an Enhanced Moving Object Detection Algorithm in Motion Videos",
        "authors": "K. Madhan, N. Shanmugapriya",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "Object detection and classification have become prominent research topics in computer vision due to their applications in areas such as visual tracking. Despite advancements, vision-based methods for detecting smaller targets and densely packed objects with high accuracy in complex dynamic environments still encounter challenges. This paper introduces a novel and enhanced approach for hyperbolic shadow detection and object classification based on the Enhanced Moving Object Detection (EMOD) algorithm and an improved manta ray-based convolutional neural network optimized for search. In the preprocessing phase, the video data transforms into a sequence of frames, with polynomial adaptive antialiasing applied to maintain frame size and reduce noise. Additionally, an enhanced boundary area preservation algorithm improves the contrast of noise-free edited image sequences. To achieve high-precision detection of smaller objects, the Grib profile of each detected object is also tracked. Finally, a convolutional neural network method employing an enhanced Manta search optimization is deployed for target detection and classification. Comparative experiments conducted across diverse datasets and benchmark methods demonstrate significantly improved accuracy and expanded capabilities in detection and classification.",
        "link": "http://dx.doi.org/10.51983/ijiss-2024.14.1.3895"
    },
    {
        "id": 12526,
        "title": "An evaluation of deep learning based object detection strategies for threat object detection in baggage security imagery",
        "authors": " Dhiraj, Deepak Kumar Jain",
        "published": "2019-4",
        "citations": 70,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2019.01.014"
    },
    {
        "id": 12527,
        "title": "Fstdd：An Efficient Few-Shot Object Detection Method for Tunnel Damage Detection Via Calibration",
        "authors": "Xinwen Gao, Xiaoying Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4730097"
    },
    {
        "id": 12528,
        "title": "Object Detection System Using K-Means Clustering",
        "authors": "Shreenidhi S,  ",
        "published": "2021-7-16",
        "citations": 0,
        "abstract": "Object Detection is one of the most popular applications in the branch of computer vision. While accuracy has always been the focus, focus has  gradually also shifted to lightweight models. In this  paper we propose a light weight system where object classification is not required but only object detection using clustering methods.",
        "link": "http://dx.doi.org/10.47191/etj/v6i7.05"
    },
    {
        "id": 12529,
        "title": "Human Object Interaction Detection Primed with Context",
        "authors": "Maya Antoun, Daniel Asmar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011612200003417"
    },
    {
        "id": 12530,
        "title": "Implementation of Moving Object Detection Using Sensors",
        "authors": "Ancy. S,  ",
        "published": "2018-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31142/rajar/v4i4.01"
    },
    {
        "id": 12531,
        "title": "Motion Vector Extrapolation for Video Object Detection",
        "authors": "Naimul Khan, Julian True",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Despite the continued successes of computationally efficient deep neural network architectures for video object detection, performance continually arrives at the great trilemma of speed versus accuracy versus computational resources (pick two). Current attempts to exploit temporal information in video data to overcome this trilemma are bottlenecked by the state-of-the-art in object detection models. We present, a technique which performs video object detection through the use of off-the-shelf object detectors alongside existing optical flow based motion estimation techniques in parallel. Through a set of experiments on the benchmark MOT20 dataset, we demonstrate that our approach significantly reduces the baseline latency of any given object detector without sacrificing any accuracy. Further latency reduction, up to 25x lower than the original latency, can be achieved with minimal accuracy loss. MOVEX enables low latency video object detection on common CPU based systems, thus allowing for high performance video object detection beyond the domain of GPU computing. The code is available at <a href=\"https://github.com/juliantrue/movex\" target=\"_blank\">this https URL</a>.</p>",
        "link": "http://dx.doi.org/10.32920/22734374.v1"
    },
    {
        "id": 12532,
        "title": "Weakly-supervised Human-object Interaction Detection",
        "authors": "Masaki Sugimoto, Ryosuke Furuta, Yukinobu Taniguchi",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010196802930300"
    },
    {
        "id": 12533,
        "title": "Efficient Post-Contour Correctness in Object Detection and Segmentation",
        "authors": "Than Le",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this paper, we propose the simple method to\noptimize the datasets noise under the uncertainty applied to\nmany applications in industry. Specifically, we use firstly the\ndeep learning module at transfer learning based on using the\nmask-rcnn to detect the objects and segmentation effectively,\nthen return the contours only. After that we address the shortest\npath for reduce the noise in order to increasing the highspeed in industrial applications. We illustrate adaptive many\napplications web applications such as mobile application where\npower computer is limited a source",
        "link": "http://dx.doi.org/10.36227/techrxiv.11603487"
    },
    {
        "id": 12534,
        "title": "Computer Vision",
        "authors": "Mrinal Kanti Bhowmik",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003432036"
    },
    {
        "id": 12535,
        "title": "WITHDRAWN: Object Extraction and Detection UsingU2-Net and YOLOv7",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe full text of this preprint has been withdrawn by the authors due to author disagreement with the posting of the preprint. Therefore, the authors do not wish this work to be cited as a reference. Questions should be directed to the corresponding author.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3808815/v2"
    },
    {
        "id": 12536,
        "title": "Machine Learning and Object Detection in Soccer",
        "authors": "Maggie Du, Clark Hochgraf",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.58445/rars.132"
    },
    {
        "id": 12537,
        "title": "Object Detection and Instance Segmentation in Construction Sites",
        "authors": "Cong Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4750768"
    },
    {
        "id": 12538,
        "title": "Efficient Post-Contour Correctness in Object Detection and Segmentation",
        "authors": "Than Le",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this paper, we propose the simple method to\noptimize the datasets noise under the uncertainty applied to\nmany applications in industry. Specifically, we use firstly the\ndeep learning module at transfer learning based on using the\nmask-rcnn to detect the objects and segmentation effectively,\nthen return the contours only. After that we address the shortest\npath for reduce the noise in order to increasing the highspeed in industrial applications. We illustrate adaptive many\napplications web applications such as mobile application where\npower computer is limited a source",
        "link": "http://dx.doi.org/10.36227/techrxiv.11603487.v1"
    },
    {
        "id": 12539,
        "title": "Motion Vector Extrapolation for Video Object Detection",
        "authors": "Naimul Khan, Julian True",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Despite the continued successes of computationally efficient deep neural network architectures for video object detection, performance continually arrives at the great trilemma of speed versus accuracy versus computational resources (pick two). Current attempts to exploit temporal information in video data to overcome this trilemma are bottlenecked by the state-of-the-art in object detection models. We present, a technique which performs video object detection through the use of off-the-shelf object detectors alongside existing optical flow based motion estimation techniques in parallel. Through a set of experiments on the benchmark MOT20 dataset, we demonstrate that our approach significantly reduces the baseline latency of any given object detector without sacrificing any accuracy. Further latency reduction, up to 25x lower than the original latency, can be achieved with minimal accuracy loss. MOVEX enables low latency video object detection on common CPU based systems, thus allowing for high performance video object detection beyond the domain of GPU computing. The code is available at <a href=\"https://github.com/juliantrue/movex\" target=\"_blank\">this https URL</a>.</p>",
        "link": "http://dx.doi.org/10.32920/22734374"
    },
    {
        "id": 12540,
        "title": "Object and Instance Detection Within Image Scenes",
        "authors": "Daniel Adenisimi",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThis paper compares state-of-the-art methods in object and instance detection, and examines why YOLO (You Only Look Once) outperforms top detection methods. Different Pascal VOC dataset is used as the benchmark to explore mean average precision(mAP). YOLO is twice as accurate to prior works on real-time detection. The outcome of of merging YOLO with Fast R-CNN is an increased mean average precision (mAP) which results in performance boost. Hence, YOLO is an enhanced model of top detection methods.",
        "link": "http://dx.doi.org/10.1101/2021.07.03.21258850"
    },
    {
        "id": 12541,
        "title": "Object Detection Approach for Robot Grasp Detection",
        "authors": "Hakan Karaoguz, Patric Jensfelt",
        "published": "2019-5",
        "citations": 63,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra.2019.8793751"
    },
    {
        "id": 12542,
        "title": "Object Localization: An Implementation in Python",
        "authors": "Umberto Michelucci",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-4976-5_7"
    },
    {
        "id": 12543,
        "title": "HOKEM: Human and Object Keypoint-Based Extension Module for Human-Object Interaction Detection",
        "authors": "Yoshiki Ito",
        "published": "2023-10-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222203"
    },
    {
        "id": 12544,
        "title": "Active Learning for Deep Object Detection",
        "authors": "Clemens-Alexander Brust, Christoph Käding, Joachim Denzler",
        "published": "2019",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007248600002108"
    },
    {
        "id": 12545,
        "title": "Constant-time Extraction of Statistical Moments for Object Detection Procedures",
        "authors": "Przemysław Klęsk, Aneta Bera",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006550000490059"
    },
    {
        "id": 12546,
        "title": "Distance Measurement for Object Detection for Automotive Applications Using 3D Density‐Based Clustering",
        "authors": "Anupama Patil, Manisha Bhende, Suvarna Patil, P. P. Shevatekar",
        "published": "2022-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119842286.ch13"
    },
    {
        "id": 12547,
        "title": "Real-Time 3D Object Detection and Recognition using a Smartphone",
        "authors": "Jin Chen, Zhigang Zhu",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011060600003209"
    },
    {
        "id": 12548,
        "title": "Active Learning for Deep Object Detection",
        "authors": "Clemens-Alexander Brust, Christoph Käding, Joachim Denzler",
        "published": "2019",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007248601810190"
    },
    {
        "id": 12549,
        "title": "Detection of surreptitious photography based on object detection",
        "authors": "C. Shenwei, C. Lin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/icp.2024.0071"
    },
    {
        "id": 12550,
        "title": "Two-layer Residual Feature Fusion for Object Detection",
        "authors": "Jaeseok Choi, Kyoungmin Lee, Jisoo Jeong, Nojun Kwak",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007306803520359"
    },
    {
        "id": 12551,
        "title": "Object Detection for Autonomous Driving: Motion-aid Feature Calibration Network",
        "authors": "Dongfang Liu, Yaqin Wang, Eric Matson",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009107602320239"
    },
    {
        "id": 12552,
        "title": "A new object detection method for object deviating from center or multi object crowding",
        "authors": "Yubo Liang, Gongming Wang, Wenfa Li, Yuzhe He, Xiaoming Liang",
        "published": "2021-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.displa.2021.102042"
    },
    {
        "id": 12553,
        "title": "Vision Substitution with Object Detection and Vibrotactile Stimulus",
        "authors": "Ricardo Ribani, Mauricio Marengoni",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007577205840590"
    },
    {
        "id": 12554,
        "title": "Data-Efficient Transformer-Based 3D Object Detection",
        "authors": "Aidana Nurakhmetova, Jean Lahoud, Hisham Cholakkal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011673200003417"
    },
    {
        "id": 12555,
        "title": "Unconstrained Salient Object Detection",
        "authors": "Jianming Zhang, Filip Malmberg, Stan Sclaroff",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-04831-0_6"
    },
    {
        "id": 12556,
        "title": "Vision Substitution with Object Detection and Vibrotactile Stimulus",
        "authors": "Ricardo Ribani, Mauricio Marengoni",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007577200002108"
    },
    {
        "id": 12557,
        "title": "Object-Aware Instance Labeling for Weakly Supervised Object Detection",
        "authors": "Satoshi Kosugi, Toshihiko Yamasaki, Kiyoharu Aizawa",
        "published": "2019-10",
        "citations": 40,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2019.00616"
    },
    {
        "id": 12558,
        "title": "Object Detection Techniques Applied to UAV Photogrammetric Survey",
        "authors": " Sandro Parrinello",
        "published": "2022-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3280/oa-845-c233"
    },
    {
        "id": 12559,
        "title": "Deep Learning based Object Detection Methods: A Review",
        "authors": "",
        "published": "2022-3-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.55162/mcet.02.027"
    },
    {
        "id": 12560,
        "title": "New Tool Improves Primary Progressive Aphasia Detection",
        "authors": "",
        "published": "2022-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1044/leader.rib1.27092022.slp-aphasia-detection.14"
    },
    {
        "id": 12561,
        "title": "IEC-YOLOX:A Lightweight Object Detection Algorithm for UAV Target Detection",
        "authors": "Qingzeng Song, Shuo Xu, Yongjiang Xue, Jing Yu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nRecently, unmanned aerial vehicles (UAVs) have been widely used in industries such as transportation and agriculture for capturing scenes. Aerial images taken by UAVs are one of the most widely used scenario for object detection applications. However, since UAV images are captured from high altitude, the target scale of UAV images is inconsistent compared with ordinary images as the background is more complex and the target size is smaller. To address this problem, we proposed a new network model IEC-YOLOX, which is based on YOLOX. The model adds a detection layer to YOLOX-tiny to enable the detection of small targets and utilizes iAFF to fuse features of different scales. The backbone network CSPDarknet is replaced with Extended-ELAN, which reduces the number of parameters by one-fifth. Additionally, a lightweight attention mechanism called CBAM is added to the new backbone network.This paper uses VisDrone 2019 as the experimental data. The result of our YOLOX-tiny network structure's mAP@50 is 35.3$\\%$, and the number of parameters is 4.29M, which is about 4.3$\\%$ higher than the baseline model (YOLOX-tiny) in terms of mAP@50, and the number of parameters has been reduced by 0.74M.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3174559/v1"
    },
    {
        "id": 12562,
        "title": "Multi-level Feature Selection for Oriented Object Detection",
        "authors": "Chen Jiang, Yefan Jiang, Zhangxing Bian, Fan Yang, Siyu Xia",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010213000360043"
    },
    {
        "id": 12563,
        "title": "Cascade Object Detection and Remote Sensing Object Detection Method Based on Trainable Activation Function",
        "authors": "S. N. Shivappriya, M. Jasmine Pemeena Priyadarsini, Andrzej Stateczny, C. Puttamadappa, B. D. Parameshachari",
        "published": "2021-1-8",
        "citations": 65,
        "abstract": "Object detection is an important process in surveillance system to locate objects and it is considered as major application in computer vision. The Convolution Neural Network (CNN) based models have been developed by many researchers for object detection to achieve higher performance. However, existing models have some limitations such as overfitting problem and lower efficiency in small object detection. Object detection in remote sensing hasthe limitations of low efficiency in detecting small object and the existing methods have poor localization. Cascade Object Detection methods have been applied to increase the learning process of the detection model. In this research, the Additive Activation Function (AAF) is applied in a Faster Region based CNN (RCNN) for object detection. The proposed AAF-Faster RCNN method has the advantage of better convergence and clear bounding variance. The Fourier Series and Linear Combination of activation function are used to update the loss function. The Microsoft (MS) COCO datasets and Pascal VOC 2007/2012 are used to evaluate the performance of the AAF-Faster RCNN model. The proposed AAF-Faster RCNN is also analyzed for small object detection in the benchmark dataset. The analysis shows that the proposed AAF-Faster RCNN model has higher efficiency than state-of-art Pay Attention to Them (PAT) model in object detection. To evaluate the performance of AAF-Faster RCNN method of object detection in remote sensing, the NWPU VHR-10 remote sensing data set is used to test the proposed method. The AAF-Faster RCNN model has mean Average Precision (mAP) of 83.1% and existing PAT-SSD512 method has the 81.7%mAP in Pascal VOC 2007 dataset.",
        "link": "http://dx.doi.org/10.3390/rs13020200"
    },
    {
        "id": 12564,
        "title": "Object Oriented Shadow Detection and Removal from Urban High Resolution RSI",
        "authors": "",
        "published": "2017-7-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23883/ijrter.2017.3358.kiquv"
    },
    {
        "id": 12565,
        "title": "Knowledge-Aware Object Detection in Traffic Scenes",
        "authors": "Jean-Francois Nies, Syed Tahseen Raza Rizvi, Mohsin Munir, Ludger Elst, Andreas Dengel",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012378100003636"
    },
    {
        "id": 12566,
        "title": "Moving Object Detection Using an Object Motion Reflection Model of Motion Vectors",
        "authors": "Jisang Yoo, Gyu-cheol Lee",
        "published": "2019-1-2",
        "citations": 8,
        "abstract": "Moving object detection task can be solved by the background subtraction algorithm if the camera is fixed. However, because the background moves, detecting moving objects in a moving car is a difficult problem. There were attempts to detect moving objects using LiDAR or stereo cameras, but when the car moved, the detection rate decreased. We propose a moving object detection algorithm using an object motion reflection model of motion vectors. The proposed method first obtains the disparity map by searching the corresponding region between stereo images. Then, we estimate road by applying v-disparity method to the disparity map. The optical flow is used to acquire the motion vectors of symmetric pixels between adjacent frames where the road has been removed. We designed a probability model of how much the local motion is reflected in the motion vector to determine if the object is moving. We have experimented with the proposed method on two datasets, and confirmed that the proposed method detects moving objects with higher accuracy than other methods.",
        "link": "http://dx.doi.org/10.3390/sym11010034"
    },
    {
        "id": 12567,
        "title": "Crack Detection with Deep Classification Network",
        "authors": "Kaige Zhang, Heng-Da Cheng",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003252948-2"
    },
    {
        "id": 12568,
        "title": "Crack Detection with Generative Adversarial Learning",
        "authors": "Kaige Zhang, Heng-Da Cheng",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003252948-4"
    },
    {
        "id": 12569,
        "title": "Crack Detection with Fully Convolutional Network",
        "authors": "Kaige Zhang, Heng-Da Cheng",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003252948-3"
    },
    {
        "id": 12570,
        "title": "Extended Object Detection: Flexible Object Description System for Detection in Robotic Tasks",
        "authors": "A. D. Moscowsky",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-97004-8_3"
    }
]