[
    {
        "id": 11571,
        "title": "Whether and how semantic similarity impairs short-term memory: A test with a new index of semantic similarity",
        "authors": "Sho Ishiguro, Satoru Saito",
        "published": "No Date",
        "citations": 0,
        "abstract": "Semantic similarity appears to have a facilitative effect on short-term memory (STM), which contrasts with the detrimental effects of phonological and visual similarity on STM. Given that STM theories generally posit detrimental effects of similarity, it is theoretically and empirically important to test the semantic similarity effect. Recently, a review study proposed that semantic similarity per se would have a detrimental effect while semantic association and additional retrieval cues, which are facilitative of STM, would work as confounding factors for the semantic similarity effect. The present study tested this view by minimizing the influence of these possible confounding factors in the experiment and by utilizing a new index of semantic similarity in the analysis. The results of the present study indicated that the semantic similarity indeed had a detrimental effect on immediate serial recall correct-in-position scores. An examination based on two other scoring methods (i.e., item correct and absolute order errors) further suggested that the locus of the detrimental effect of semantic similarity is in order memory. In addition, other semantico-lexical variables (e.g., word length, frequency, and imageability) were also analyzed. Patterns of these variables’ effects on item memory were complementary to the effect of semantic similarity on order memory. From a theoretical point of view, as the detrimental effect of semantic similarity demonstrated by the present study is comparable to phonological and visual similarity effects, this finding implies a store based on semantic information or a general process for various types of information.",
        "link": "http://dx.doi.org/10.31234/osf.io/va5js"
    },
    {
        "id": 11572,
        "title": "Similarity, Semantic",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-17885-1_101192"
    },
    {
        "id": 11573,
        "title": "The Semantic Similarity Effect on Short-Term Memory: Null Effects of Affectively Defined Semantic Similarity",
        "authors": "Sho Ishiguro, Satoru Saito",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5334/joc.349"
    },
    {
        "id": 11574,
        "title": "Semantic Similarity Scales: Using Semantic Similarity Scales to Measure Depression and Worry",
        "authors": "Oscar N. E. Kjell, Katarina Kjell, Danilo Garcia, Sverker Sikström",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-37250-7_4"
    },
    {
        "id": 11575,
        "title": "Combining Semantic Similarity and GO Enrichment for Computation of Functional Similarity",
        "authors": "Wenting Liu, Jianjun Liu, Jagath C. Rajapakse",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractFunctional similarity between genes is widely used in many bioinformatics applications including detecting molecular pathways, finding co-expressed genes, predicting protein-protein interactions, and prioritization of candidate genes. Methods evaluating functional similarity of genes are mostly based on semantic similarity of gene ontology (GO) terms. Though there are hundreds of functional similarity measures available in the literature, none of them considers the enrichment of the GO terms by the querying gene pair. We propose a novel method to incorporate GO enrichment into the existing functional similarity measures. Our experiments show that the inclusion of gene enrichment significantly improves the performance of 44 widely used functional similarity measures, especially in the prediction of sequence homologies, gene expression correlations, and protein-protein interactions.Software availabilityThe software (python code) and all the benchmark datasets evaluation (R script) are available athttps://gitlab.com/liuwt/EnrichFunSim.",
        "link": "http://dx.doi.org/10.1101/155689"
    },
    {
        "id": 11576,
        "title": "Measures to Calculate Semantic Similarity: A Survey",
        "authors": "",
        "published": "2017-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21884/ijmter.2017.4015.e381w"
    },
    {
        "id": 11577,
        "title": "Tools for Semantic Analysis Based on Semantic Similarity",
        "authors": "Marianna Milano",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809633-8.20403-2"
    },
    {
        "id": 11578,
        "title": "Peer Review #1 of \"SEMGROMI—a semantic grouping algorithm to identifying microservices using semantic similarity of user stories (v0.1)\"",
        "authors": "",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1380v0.1/reviews/1"
    },
    {
        "id": 11579,
        "title": "Peer Review #3 of \"SEMGROMI—a semantic grouping algorithm to identifying microservices using semantic similarity of user stories (v0.1)\"",
        "authors": "",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1380v0.1/reviews/3"
    },
    {
        "id": 11580,
        "title": "The Effects of Semantic Similarity and Emotion on False Memory Production",
        "authors": "Yingcheng He",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011290900003444"
    },
    {
        "id": 11581,
        "title": "Supervised Semantic Similarity",
        "authors": "Rita T. Sousa, Sara Silva, Catia Pesquita",
        "published": "No Date",
        "citations": 4,
        "abstract": "AbstractBackgroundSemantic similarity between concepts in knowledge graphs is essential for several bioinformatics applications, including the prediction of protein-protein interactions and the discovery of associations between diseases and genes. Although knowledge graphs describe entities in terms of several perspectives (or semantic aspects), state-of-the-art semantic similarity measures are general-purpose. This can represent a challenge since different use cases for the application of semantic similarity may need different similarity perspectives and ultimately depend on expert knowledge for manual fine-tuning.ResultsWe present a new approach that uses supervised machine learning to tailor aspect-oriented semantic similarity measures to fit a particular view on biological similarity or relatedness. We implement and evaluate it using different combinations of representative semantic similarity measures and machine learning methods with four biological similarity views: protein-protein interaction, protein function similarity, protein sequence similarity and phenotype-based gene similarity.ConclusionsThe results demonstrate that our approach outperforms non-supervised methods, producing semantic similarity models that fit different biological perspectives significantly better than the commonly used manual combinations of semantic aspects.",
        "link": "http://dx.doi.org/10.1101/2021.02.16.431402"
    },
    {
        "id": 11582,
        "title": "CONCORDIA: COmputing semaNtic sentenCes for fRench Clinical Documents sImilArity",
        "authors": "Khadim Dramé, Gorgoumack Sambe, Gayo Diallo",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010687500003058"
    },
    {
        "id": 11583,
        "title": "Peer Review #2 of \"SEMGROMI—a semantic grouping algorithm to identifying microservices using semantic similarity of user stories (v0.1)\"",
        "authors": "C Zeginis",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1380v0.1/reviews/2"
    },
    {
        "id": 11584,
        "title": "Peer Review #2 of \"SEMGROMI—a semantic grouping algorithm to identifying microservices using semantic similarity of user stories (v0.2)\"",
        "authors": "C Zeginis",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.1380v0.2/reviews/2"
    },
    {
        "id": 11585,
        "title": "Enhancing Semantic Text Similarity with Functional Semantic Knowledge (Fop) in Patents",
        "authors": "Hao Teng, Nan Wang, Hongyu Zhao, Yingtong Hu, Haitao Jin",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4385564"
    },
    {
        "id": 11586,
        "title": "Question Similarity Detection in Turkish Using Semantic Textual Similarity Methods",
        "authors": "Eray Yıldız, Yasin Fındık",
        "published": "2019-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu.2019.8806308"
    },
    {
        "id": 11587,
        "title": "30 Years of Research on Semantic Similarity Measurement",
        "authors": "Kabir Sharma",
        "published": "No Date",
        "citations": 0,
        "abstract": "Over the past three decades, researchers have been interested in measuring the semantic similarity between words or concepts in natural language processing. This interest has arisen due to the need for more effective techniques for information retrieval, text classification, and other tasks. The concept of semantic similarity refers to the degree of relatedness between two words or concepts based on their meaning or context. Semantic similarity measurement involves various methods such as knowledge-based, corpus-based, and hybrid methods. In this paper, we review the evolution of semantic similarity measurement over the past 30 years, including the different approaches used and their advantages and limitations. We also discuss the challenges in developing accurate semantic similarity metrics and highlight the emerging trends in this field, such as the use of deep learning techniques to improve the accuracy of semantic similarity measurement. Finally, we conclude by suggesting some directions for future research in this field.",
        "link": "http://dx.doi.org/10.31219/osf.io/qpb6d"
    },
    {
        "id": 11588,
        "title": "Pneumonia Detection with Semantic Similarity Scores",
        "authors": "Rahil Gholamipoor, Nima Rafiee, Markus Kollmann",
        "published": "No Date",
        "citations": 1,
        "abstract": "X-ray images have been widely used for medical diagnoses of cardiothoracic and pulmonary abnormalities due to its noninvasiveness. Advancement in computer-aided diagnostic technologies, such as deep supervised methods, can help radiologists with a reliable early treatment and reduce diagnosis time. Nevertheless, these methods are prone to the small number of labeled samples and are limited to a specific abnormality. In this paper we combined a self-supervised contrastive method with a Mahalanobis distance score to develope an abnormality detection method that uses only healthy images during the training procedure. We were able to outperform previous unsupervised methods for the task of Pneumonia detection. We show that representation learned by the self-supervised method improves the supervised tasks for Pneumonia detection.",
        "link": "http://dx.doi.org/10.1101/2021.10.14.464247"
    },
    {
        "id": 11589,
        "title": "Corrigendum to: Similarity of Sentences With Contradiction Using Semantic Similarity Measures",
        "authors": "M Krishna Siva Prasad, Poonam Sharma",
        "published": "2020-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/comjnl/bxaa129"
    },
    {
        "id": 11590,
        "title": "Semantic Similarity in Cheminformatics",
        "authors": "João D. Ferreira, Francisco M. Couto",
        "published": "2020-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.89032"
    },
    {
        "id": 11591,
        "title": "Semantic Similarity Loss for Neural Source CodeSummarization",
        "authors": "Chia-Yi Su, Collin McMillan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper presents an improved loss function for neural source code summariza-tion. Code summarization is the task of writing natural language descriptions ofsource code. Neural code summarization refers to automated techniques for gen-erating these descriptions using neural networks. Almost all current approachesinvolve neural networks as either standalone models or as part of a pretrainedlarge language models e.g., GPT, Codex, LLaMA. Yet almost all also use acategorical cross-entropy (CCE) loss function for network optimization. Twoproblems with CCE are that 1) it computes loss over each word prediction one-at-a-time, rather than evaluating a whole sentence, and 2) it requires a perfectprediction, leaving no room for partial credit for synonyms. We propose and eval-uate a loss function to alleviate this problem. In essence, we propose to use asemantic similarity metric to calculate loss over the whole output sentence pre-diction per training batch, rather than just loss for each word. We also proposeto combine our loss with traditional CCE for each word, which streamlines thetraining process compared to baselines. We evaluate our approach over severalbaselines and report an improvement in the vast majority of conditions.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3240092/v1"
    },
    {
        "id": 11592,
        "title": "Improving Semantic Similarity of Words by Retrofitting Word Vectors in Sense Level",
        "authors": "Rui Zhang, Peter Schneider-Kamp, Arthur Zimek",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008953001080119"
    },
    {
        "id": 11593,
        "title": "Tracing the Evolution of Approaches to Semantic Similarity Analysis",
        "authors": "Weronika Adrian, Sebastian Skoczeń, Szymon Majkut, Krzysztof Kluza, Antoni Ligęza",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010108401570164"
    },
    {
        "id": 11594,
        "title": "An Approach of Extracting God Class Exploiting Both Structural and Semantic Similarity",
        "authors": "Pritom Akash, Ali Sadiq, Ahmedul Kabir",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007743804270433"
    },
    {
        "id": 11595,
        "title": "Semantic LED Document for calculation for preparing Document Similarity Classification",
        "authors": "Shafiq Hussain",
        "published": "No Date",
        "citations": 0,
        "abstract": "XML documents on the web are often foundwithout DTDs, particularly when these documents havebeen created from legacy HTML. Yet having knowledge ofthe DTD can be valuable in querying and manipulating suchdocuments. Recent work (cf. [1]) has given us a means to(re-)construct a DTD to describe the structure common togiven set of document instances. However, given a collectionof documents with unknown DTDs, it may not beappropriate to construct a single DTD to describe everydocument in the collection. Instead, we would wish topartition the collection into smaller sets of “similar”documents, and then induce a separate DTD for each suchset. It is this partitioning problem that we address in thispaper. Given two XML documents, how can one measurestructural (DTD) similarity between the two? We develop adynamic programming algorithm to find this distance forany pair of documents. We validate our proposed distancemeasure experimentally. Given a collection of documentsderived from multiple DTDs, we can compute pair-wisedistances between documents in the collection, and then usethese distances to cluster the documents",
        "link": "http://dx.doi.org/10.31219/osf.io/apdcb"
    },
    {
        "id": 11596,
        "title": "A Comparative Assessment of Ontology Weighting Methods in Semantic Similarity Search",
        "authors": "Antonio De Nicola, Anna Formica, Michele Missikoff, Elaheh Pourabbas, Francesco Taglino",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007342805060513"
    },
    {
        "id": 11597,
        "title": "Semantic LED Document for calculation for preparing Document Similarity Classification",
        "authors": "Shafiq Hussain",
        "published": "No Date",
        "citations": 0,
        "abstract": "XML documents on the web are often foundwithout DTDs, particularly when these documents havebeen created from legacy HTML. Yet having knowledge ofthe DTD can be valuable in querying and manipulating suchdocuments. Recent work (cf. [1]) has given us a means to(re-)construct a DTD to describe the structure common togiven set of document instances. However, given a collectionof documents with unknown DTDs, it may not beappropriate to construct a single DTD to describe everydocument in the collection. Instead, we would wish topartition the collection into smaller sets of “similar”documents, and then induce a separate DTD for each suchset. It is this partitioning problem that we address in thispaper. Given two XML documents, how can one measurestructural (DTD) similarity between the two? We develop adynamic programming algorithm to find this distance forany pair of documents. We validate our proposed distancemeasure experimentally. Given a collection of documentsderived from multiple DTDs, we can compute pair-wisedistances between documents in the collection, and then usethese distances to cluster the documents.",
        "link": "http://dx.doi.org/10.31219/osf.io/an48p"
    },
    {
        "id": 11598,
        "title": "Semantic Textual Similarity on Contracts: Exploring Multiple Negative Ranking Losses for Sentence Transformers",
        "authors": "Yogendra Sisodia",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Researchers are becoming more interested in extracting useful information from legal documents thanks to the development of large-scale language models in natural language processing (NLP), and deep learning has accelerated the creation of powerful text mining models. Legal fields like contracts benefit greatly from semantic text search since it makes it quick and easy to find related clauses. After collecting sentence embeddings, it is relatively simple to locate sentences with a comparable meaning throughout the entire legal corpus. The author of this research investigated two pre-trained language models for this task: MiniLM and Roberta, and further fine-tuned them on Legal Contracts. The author used Multiple Negative Ranking Loss for the creation of sentence transformers. The fine-tuned language models and sentence transformers showed promising results. </p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23950530.v1"
    },
    {
        "id": 11599,
        "title": "A Spectral Learning Based Model to Evaluate Semantic Textual Similarity",
        "authors": "Akanksha Mehndiratta, Krishna Asawa",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4437092"
    },
    {
        "id": 11600,
        "title": "An interpretable semantic similarity for predicting eye movements in reading: Approach comparison",
        "authors": "Kun Sun",
        "published": "No Date",
        "citations": 2,
        "abstract": "Expectations or predictions about upcoming content play an important role during language comprehension and processing. Semantic similarity as a metric has been used to predict the experimental data on language comprehension and processing. Some approaches have been proposed to compute contextual semantic similarity to predict how words in a context are processed. However, these approaches can be improved. This study uses a massive and naturalistic discourse as stimuli for collecting data on eye-movement in reading. It proposes asimple but effective approach to computing contextual semantic similarity. In order to test the efficiency of the new approach, we compare it to the recently developed cosine method and the Euclidean method. This comparison reveals that our approach can make good predictions about fixation durations on reading and that it outperforms the two aforementioned approaches. To our knowledge, this is the first study to compare a number of approaches on contextual semantic similarity that are used to process naturalistic discourse in the fields of cogni-tion, psycholinguistics and neuroscience. The findings of this study aretherefore of significance to the acquisition of a better understanding ofhow humans process words in a real-world context and how they makepredictions in language comprehension and processing. This study creates an interpretable but more effective approach for computing contextual semantic similarity, which allows further explorations of the data on naturalistic discourse reading, language comprehension and neuroscience.",
        "link": "http://dx.doi.org/10.31234/osf.io/jcp64"
    },
    {
        "id": 11601,
        "title": "Similarity of Sentences With Contradiction Using Semantic Similarity Measures",
        "authors": "M Krishna Siva Prasad, Poonam Sharma",
        "published": "2022-3-14",
        "citations": 0,
        "abstract": "Abstract\nShort text or sentence similarity is crucial in various natural language processing activities. Traditional measures for sentence similarity consider word order, semantic features and role annotations of text to derive the similarity. These measures do not suit short texts or sentences with negation. Hence, this paper proposes an approach to determine the semantic similarity of sentences and also presents an algorithm to handle negation. In sentence similarity, word pair similarity plays a significant role. Hence, this paper also discusses the similarity between word pairs. Existing semantic similarity measures do not handle antonyms accurately. Hence, this paper proposes an algorithm to handle antonyms. This paper also presents an antonym dataset with 111-word pairs and corresponding expert ratings. The existing semantic similarity measures are tested on the dataset. The results of the correlation proved that the expert ratings are in order with the correlation obtained from the semantic similarity measures. The sentence similarity is handled by proposing two algorithms. The first algorithm deals with the typical sentences, and the second algorithm deals with contradiction in the sentences. SICK dataset, which has sentences with negation, is considered for handling the sentence similarity. The algorithm helped in improving the results of sentence similarity.",
        "link": "http://dx.doi.org/10.1093/comjnl/bxaa100"
    },
    {
        "id": 11602,
        "title": "An ontology-based semantic similarity metric to empower  semantic search",
        "authors": "Suraiya Parveen, Ranjit Biswas",
        "published": "2018-9-16",
        "citations": 0,
        "abstract": "Heterogeneity in documents is a challenge for information Retrieval. The keyword search focuses on matching the keywords with web repositories. It does not consider the synonyms or semantically similar words. The heterogeneity of the content makes retrieval inadequate. Semantic search helps to capture more appropriate results using domain ontology. Keyword search is extended with the help of similar concepts of ontology. Similarity between the ontological concepts is recognized to get appropriate search results. Once the semantic similarity among the concepts is known, more relevant documents can be retrieved. In this paper, we propose a metric based on traditional methods, combined with computational techniques to measure the similarity between concepts. The paper gives the concept of DOT (Domain Ontology Tree). It uses conventional definitions of the Tree (Data Structure) for ontology and proposes a method of partitioning to calculate the similarity. The method is based on IS-A hierarchical relationship. We have implemented a prototype system for the support of the proposed method, and also compared it with existing methods, the results are encouraging. ",
        "link": "http://dx.doi.org/10.14419/ijet.v7i4.14153"
    },
    {
        "id": 11603,
        "title": "Semantic Textual Similarity on Contracts: Exploring Multiple Negative Ranking Losses for Sentence Transformers",
        "authors": "Yogendra Sisodia",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Researchers are becoming more interested in extracting useful information from legal documents thanks to the development of large-scale language models in natural language processing (NLP), and deep learning has accelerated the creation of powerful text mining models. Legal fields like contracts benefit greatly from semantic text search since it makes it quick and easy to find related clauses. After collecting sentence embeddings, it is relatively simple to locate sentences with a comparable meaning throughout the entire legal corpus. The author of this research investigated two pre-trained language models for this task: MiniLM and Roberta, and further fine-tuned them on Legal Contracts. The author used Multiple Negative Ranking Loss for the creation of sentence transformers. The fine-tuned language models and sentence transformers showed promising results. </p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.23950530"
    },
    {
        "id": 11604,
        "title": "RTM at SemEval-2017 Task 1: Referential Translation Machines for\n            Predicting Semantic Similarity",
        "authors": "Ergun Biçici",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2030"
    },
    {
        "id": 11605,
        "title": "Siamese Networks for Semantic Pattern Similarity",
        "authors": "Yassine Benajiba, Jin Sun, Yong Zhang, Longquan Jiang, Zhiliang Weng, Or Biran",
        "published": "2019-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icosc.2019.8665512"
    },
    {
        "id": 11606,
        "title": "A novel asymmetric semantic similarity measurement for semantic job matching",
        "authors": "Bo Zhu, Xin Li, Jesus Bobadilla Sancho",
        "published": "2017-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/spac.2017.8304267"
    },
    {
        "id": 11607,
        "title": "Gene Prioritization Using Semantic Similarity",
        "authors": "Erinija Pranckevičienė",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809633-8.20405-6"
    },
    {
        "id": 11608,
        "title": "Quantifying the Significance of Cybersecurity Text through Semantic Similarity and Named Entity Recognition",
        "authors": "Otgonpurev Mendsaikhan, Hirokazu Hasegawa, Yamaguchi Yukiko, Hajime Shimada",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008913003250332"
    },
    {
        "id": 11609,
        "title": "Semantic Similarity and Plagiarism Checker",
        "authors": "Kartik Vyas, Aditya Kumar, Romi Banerjee, Debarati Bhunia Chakraborty",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nToday all educational institutes stress on the importance of continuous evaluation. This directly impacts the number of assessments to be done for various projects, quizzes, assignments, and exams. It becomes a time and resource- intensive task for the instructors to evaluate these submissions with accuracy. Additionally, the instructor also needs to keep a check on whether any student has plagiarized from the web or if there is any case of intrinsic plagiarism among the students. With a huge set of information on the internet, one can easily get away with plagiarism. There are tools available for such requirements, but almost all of them are paid, and moreover, instructors need to run them one by one, which is a difficult task in itself. Thus, we developed a one-stop solution for the entire problem, which, as per our knowledge, is not in place. We have developed a single tool that can measure semantic plagiarism (based on meaning), text entailment, online plagiarism, and real plagiarism as well. In the future, work can be aligned in the direction of semantics of research papers as well to grade answers.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3609650/v1"
    },
    {
        "id": 11610,
        "title": "A Spectral Learning Based Model to Evaluate Semantic Textual Similarity",
        "authors": "Akanksha Mehndiratta, Krishna Asawa",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nSemantic Textual Similarity (STS) is a task in NLP that compares two sentences in a sentence-pair and scores the relationship between them using the degree of semantic equivalence. It has wide applicability in various fields. Consequently, the research around the task is constantly evolving. The demand for new as well as improved methods is endless. Numerous methods have been proposed that largely belong to either unsupervised or supervised learning approaches. The model proposed here is fairly simple and provides a fresh take on this classification problem using spectral learning. The model does not engage a large labeled corpus or lexical database like most STS supervised and unsupervised methods. Although, supervised STS methods achieve an accuracy that outperforms humans in some cases, but are often held back due to a lack of interpretation of the features instrumental in molding the decision-making process. The proposed model on the other hand generates features (latent knowledge) that are easy to ascertain and have a mathematical foundation. Given a sentence pair, the work focuses on finding latent states and variables from each sentence and performs classification by generating a similarity score. The latent variables are a result of projections learned by performing Canonical Correlation Analysis (CCA) amongst the sentence pair. To perform matching and determine the similarity score, Cosine similarity and Word Mover’s Distance (WMD) are employed. The performance of the proposed model does exhibit an improvement over various sophisticated supervised techniques such as LSTM and BiLSTM.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2541181/v1"
    },
    {
        "id": 11611,
        "title": "Evaluation of Semantic Answer Similarity Metrics",
        "authors": "Farida Mustafazade, Peter F. Ebbinghaus",
        "published": "2022-6-25",
        "citations": 0,
        "abstract": "There are several issues with the existing general machine translation or natural language generation evaluation metrics, and question-answering (QA) systems are indifferent in that context. To build robust QA systems, we need the ability to have equivalently robust evaluation systems to verify whether model predictions to questions are similar to ground-truth annotations. The ability to compare similarity based on semantics as opposed to pure string overlap is important to compare models fairly and to indicate more realistic acceptance criteria in real-life applications. We build upon the first to our knowledge paper that uses transformer-based model metrics to assess semantic answer similarity and achieve higher correlations to human judgement in the case of no lexical overlap. We propose cross-encoder augmented bi-encoder and BERTScore models for semantic answer similarity, trained on a new dataset consisting of name pairs of US-American public figures. As far as we are concerned, we provide the first dataset of co-referent name string pairs along with their similarities, which can be used both for training and as a benchmark.",
        "link": "http://dx.doi.org/10.5121/csit.2022.121109"
    },
    {
        "id": 11612,
        "title": "Semantic Similarity Functions and Measures",
        "authors": "Giuseppe Pirrò",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809633-8.20402-0"
    },
    {
        "id": 11613,
        "title": "BIT at SemEval-2017 Task 1: Using Semantic Information Space to\n            Evaluate Semantic Textual Similarity",
        "authors": "Hao Wu, Heyan Huang, Ping Jian, Yuhang Guo, Chao Su",
        "published": "2017",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2007"
    },
    {
        "id": 11614,
        "title": "ResSim at SemEval-2017 Task 1: Multilingual Word Representations\n            for Semantic Textual Similarity",
        "authors": "Johannes Bjerva, Robert Östling",
        "published": "2017",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2021"
    },
    {
        "id": 11615,
        "title": "MITRE at SemEval-2017 Task 1: Simple Semantic Similarity",
        "authors": "John Henderson, Elizabeth Merkhofer, Laura Strickhart, Guido Zarrella",
        "published": "2017",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2027"
    },
    {
        "id": 11616,
        "title": "Lump at SemEval-2017 Task 1: Towards an Interlingua Semantic Similarity",
        "authors": "Cristina España-Bonet, Alberto Barrón-Cedeño",
        "published": "2017",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2019"
    },
    {
        "id": 11617,
        "title": "DistSim - Scalable Distributed in-Memory Semantic Similarity Estimation for RDF Knowledge Graphs",
        "authors": "Carsten Felix Draschner, Jens Lehmann, Hajira Jabeen",
        "published": "2021-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsc50631.2021.00062"
    },
    {
        "id": 11618,
        "title": "HCTI at SemEval-2017 Task 1: Use convolutional neural network to\n            evaluate Semantic Textual Similarity",
        "authors": "Yang Shao",
        "published": "2017",
        "citations": 33,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2016"
    },
    {
        "id": 11619,
        "title": "Semantic Document Classification Based on Strategies of Semantic Similarity Computation and Correlation Analysis",
        "authors": "Shuo Yang, Ran Wei, Hengliang Tan, Jiao Du",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3769520"
    },
    {
        "id": 11620,
        "title": "Semantic Conceptual Relational Similarity Based Web Document Clustering for Efficient Information Retrieval Using Semantic Ontology",
        "authors": "",
        "published": "2021-9-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3837/tiis.2021.09.001"
    },
    {
        "id": 11621,
        "title": "An Enhanced Semantic Similarity based Information Retrieval System in Mesh and EMR",
        "authors": "Aravazhi R, Chidambaram M",
        "published": "2019-9-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v11/20192662"
    },
    {
        "id": 11622,
        "title": "An analysis and comparison of the statistical sensitivity of semantic similarity metrics",
        "authors": "Prashanti Manda, Todd Vision",
        "published": "No Date",
        "citations": 3,
        "abstract": "1AbstractSemantic similarity has been used for comparing genes, proteins, phenotypes, diseases, etc. for various biological applications. The rise of ontology-based data representation in biology has also led to the development of several semantic similarity metrics that use different statistics to estimate similarity.Although semantic similarity has become a crucial computational tool in several applications, there has not been a formal evaluation of the statistical sensitivity of these metrics and their ability to recognize similarity between distantly related biological objects.Here, we present a statistical sensitivity comparison of five semantic similarity metrics (Jaccard, Resnik, Lin, Jiang& Conrath, and Hybrid Relative Specificity Similarity) representing three different kinds of metrics (Edge based, Node based, and Hybrid) and explore key parameter choices that can impact sensitivity. Furthermore, we compare four methods of aggregating individual annotation similarities to estimate similarity between two biological objects - All Pairs, Best Pairs, Best Pairs Symmetric, and Groupwise.To evaluate sensitivity in a controlled fashion, we explore two different models for simulating data with varying levels of similarity and compare to the noise distribution using resampling. Source data are derived from the Phenoscape Knowledgebase of evolutionary phenotypes.Our results indicate that the choice of similarity metric along with different parameter choices can substantially affect sensitivity. Among the five metrics evaluated, we find that Resnik similarity shows the greatest sensitivity to weak semantic similarity. Among the ways to combine pairwise statistics, the Groupwise approach provides the greatest discrimination among values above the sensitivity threshold, while the Best Pairs statistic can be parametrically tuned to provide the highest sensitivity.Our findings serve as a guideline for an appropriate choice and parameterization of semantic similarity metrics, and point to the need for improved reporting of the statistical significance of semantic similarity matches in cases where weak similarity is of interest",
        "link": "http://dx.doi.org/10.1101/327833"
    },
    {
        "id": 11623,
        "title": "An overview of textual semantic similarity measures based on web intelligence",
        "authors": "Jorge Martinez-Gil",
        "published": "No Date",
        "citations": 0,
        "abstract": "Computing the semantic similarity between terms (or short text expressions) that have the same meaning but which are not lexicographically similar is a key challenge in many computer related fields. The problem is that traditional approaches to semantic similarity measurement are not suitable for all situations, for example, many of them often fail to deal with terms not covered by synonym dictionaries or are not able to cope with acronyms, abbreviations, buzzwords, brand names, proper nouns, and so on. In this paper, we present and evaluate a collection of emerging techniques developed to avoid this problem. These techniques use some kinds of web intelligence to determine the degree of similarity between text expressions. These techniques implement a variety of paradigms including the study of co-occurrence, text snippet comparison, frequent pattern finding, or search log analysis. The goal is to substitute the traditional techniques where necessary.",
        "link": "http://dx.doi.org/10.31219/osf.io/ka26r"
    },
    {
        "id": 11624,
        "title": "Semantic Similarity and Sentiment Analysis of Short Texts in Serbian",
        "authors": "Vuk Batanovic",
        "published": "2021-11-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/telfor52709.2021.9653390"
    },
    {
        "id": 11625,
        "title": "<i>simona:</i>a Comprehensive R package for Semantic Similarity Analysis on Bio-Ontologies",
        "authors": "Zuguang Gu",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractBio-ontologies are keys in structuring complex biological information for effective data integration and knowledge representation. In this paper, we presentsimona, a novel R package for semantic similarity analysis on general bio-ontolgies.Simonaimplements infrastructures for ontology analysis by offering efficient data structures, fast ontology traversal methods, and elegant visualizations. Moreover, it provides a robust toolbox supporting over 70 methods for semantic similarity analysis. Withsimona, we conduct a benchmark against current semantic similarity methods. The results demonstrate methods are clustered based on their mathematical methodologies, providing guidance for researchers in the selection of appropriate methods. Additionally, we explore annotation-based versus topology-based methods, revealing that semantic similarities solely based on ontology topology can efficiently reveal semantic similarity structures, facilitating analysis on less-studied organisms and other ontologies.Simonais freely available fromhttps://bioconductor.org/packages/simona/.",
        "link": "http://dx.doi.org/10.1101/2023.12.03.569758"
    },
    {
        "id": 11626,
        "title": "Ensemble Transformer for cross lingual semantic textual similarity",
        "authors": "Poorya Piroozfar, Mohammad Abdous, Behrouz Minaei Bidgoli",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nToday, it is particularly important to recognize the semantic similarity between texts in different languages due to the emergence of new natural language processing models like ChatGPT and Bard. These models can provide more accurate and comprehensive answers to users' questions by identifying semantic similarity between two texts in different languages. Cross-lingual semantic similarity refers to the process of calculating similarity between two pieces of text in different languages. This paper aims to present an improved method for finding similarities between sentences in different languages. Some of the current methods create the same vector space to achieve this, while others use machine translation to translate the text into another language and then determine similarity between the two sentences using monolingual sentence similarity methods. The degree of similarity is expressed as a number between 0 and 5. Over the past few years, the progress in language models based on transformers has paved the way for improvements in detecting text similarity. This article discusses the utilization of ensemble models with transformers to determine the semantic similarity of sentences in Persian and English languages utilizing the Persian-English corpus. According to our findings, this ensemble approach has a correlation rate of 95.28% in detecting the extent of semantic similarity between cross-lingual sentences. These results indicate that our method surpasses previous techniques for discovering similarities between sentences in different languages.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3860915/v1"
    },
    {
        "id": 11627,
        "title": "Semantic Sentence Similarity: Size does not Always Matter",
        "authors": "Danny Merkx, Stefan L. Frank, Mirjam Ernestus",
        "published": "2021-8-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2021-1464"
    },
    {
        "id": 11628,
        "title": "Arabic Semantic Similarity Approaches - Review",
        "authors": "Marwah Alian, Arafat Awajan",
        "published": "2018-11",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/acit.2018.8672665"
    },
    {
        "id": 11629,
        "title": "CoTO: A Novel Approach for Fuzzy Aggregation of Semantic Similarity Measures",
        "authors": "Jorge Martinez-Gil",
        "published": "No Date",
        "citations": 0,
        "abstract": "Semantic similarity measurement aims to determine the likeness between two text expressions that use different lexicographies for representing the same real object or idea. There are a lot of semantic similarity measures for addressing this problem. However, the best results have been achieved when aggregating a number of simple similarity measures. This means that after the various similarity values have been calculated, the overall similarity for a pair of text expressions is computed using an aggregation function of these individual semantic similarity values. This aggregation is often computed by means of statistical functions. In this work, we present CoTO (Consensus or Trade-Off) a solution based on fuzzy logic that is able to outperform these traditional approaches.",
        "link": "http://dx.doi.org/10.31219/osf.io/wkzrh"
    },
    {
        "id": 11630,
        "title": "Examining semantic (dis)similarity in news through news organizations’ ideological similarity, similarity in truthfulness, and public engagement on social media: a network approach",
        "authors": "Yue Li, Robert M Bond",
        "published": "2022-12-21",
        "citations": 2,
        "abstract": "Abstract\nThe rise of homogenization and polarization in the news may inhibit individuals’ understanding of an issue and the functioning of a democratic society. This study applies a network approach to understanding patterns of semantic similarity and divergence across news coverage. Specifically, we focus on how (a) inter-organizational networks based on media ideology, (b) inter-organizational networks based on news truthfulness, and (c) public engagement that news articles received on social media may affect semantic similarity in the news. We use large-scale user logs data on social media platforms (i.e., Facebook and Twitter) and news text data from more than 100 news organizations over 10 months to examine the three potential processes. Our results show that the similarity between news organizations in terms of media ideology and news truthfulness is positively associated with semantic similarity, whereas the public engagement that news articles received on social media is negatively associated with semantic similarity. Our study contributes to theory development in mass communication by shifting to a network paradigm that connects news organizations, news content, and news audiences. We demonstrate how scholars across communication disciplines may collaborate to integrate distinct theories, connect multiple levels, and link otherwise separate dimensions. Methodologically, we demonstrate how synchronizing network science with natural language processing and combining social media log data with text data can help to answer research questions that communication scholars are interested in. The findings’ implications for news polarization are discussed.",
        "link": "http://dx.doi.org/10.1093/hcr/hqac020"
    },
    {
        "id": 11631,
        "title": "Assessing semantic similarity of texts – Methods and algorithms",
        "authors": "Anna Rozeva, Silvia Zerkova",
        "published": "2017",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5014006"
    },
    {
        "id": 11632,
        "title": "A New Sentence Similarity Computing Technique Using Order and Semantic Similarity",
        "authors": "Nityam Agarwal, Poorvi Seth, Merin Meleet",
        "published": "2021-9-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icses52305.2021.9633911"
    },
    {
        "id": 11633,
        "title": "Semantic Similarity Definition",
        "authors": "Francisco M. Couto, Andre Lamurias",
        "published": "2019",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-809633-8.20401-9"
    },
    {
        "id": 11634,
        "title": "Sentences Similarity Based on Deep Structured Semantic Model and Semantic Role Labeling",
        "authors": "Qiaoli Zhou, Zhiwen Jiang, Fengling Yang",
        "published": "2020-12-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ialp51396.2020.9310496"
    },
    {
        "id": 11635,
        "title": "Semantic Similarity Covariance Matrix Shrinkage",
        "authors": "Guillaume Becquin, Saher Esmeir",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.668"
    },
    {
        "id": 11636,
        "title": "Peer Review #2 of \"Effects of perceptual similarity but not semantic association on false recognition in aging (v0.1)\"",
        "authors": "",
        "published": "2017-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.4184v0.1/reviews/2"
    },
    {
        "id": 11637,
        "title": "Peer Review #1 of \"Effects of perceptual similarity but not semantic association on false recognition in aging (v0.1)\"",
        "authors": "",
        "published": "2017-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.4184v0.1/reviews/1"
    },
    {
        "id": 11638,
        "title": "An ensemble method for cross lingual semantic textual similarity",
        "authors": "Poorya Piroozfar, Mohammad Abdous, Behrouz Minaei Bidgoli",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nToday, it is particularly important to recognize the semantic similarity between texts in different languages due to the emergence of new natural language processing models like ChatGPT and Bard. These models can provide more accurate and comprehensive answers to users' questions by identifying semantic similarity between two texts in different languages. Cross-lingual semantic similarity refers to the process of calculating similarity between two pieces of text in different languages. This paper aims to present an improved method for finding similarities between sentences in different languages. Some of the current methods create the same vector space to achieve this, while others use machine translation to translate the text into another language and then determine similarity between the two sentences using monolingual sentence similarity methods. The degree of similarity is expressed as a number between 0 and 5. Over the past few years, the progress in language models based on transformers has paved the way for improvements in detecting text similarity. This article discusses the utilization of ensemble models with transformers to determine the semantic similarity of sentences in Persian and English languages utilizing the Persian-English corpus. According to our findings, this ensemble approach has a correlation rate of 95.28% in detecting the extent of semantic similarity between cross-lingual sentences. These results indicate that our method surpasses previous techniques for discovering similarities between sentences in different languages.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3319440/v1"
    },
    {
        "id": 11639,
        "title": "Peer Review #1 of \"Effects of perceptual similarity but not semantic association on false recognition in aging (v0.2)\"",
        "authors": "",
        "published": "2017-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.4184v0.2/reviews/1"
    },
    {
        "id": 11640,
        "title": "Semantic Similarity-based Automatic Grading System for Computer Programs Evaluation",
        "authors": "",
        "published": "2021-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/sr8.6/050"
    },
    {
        "id": 11641,
        "title": "CrowdGO: machine learning and semantic similarity guided consensus Gene Ontology annotation",
        "authors": "Maarten J.M.F. Reijnders, Robert M. Waterhouse",
        "published": "No Date",
        "citations": 3,
        "abstract": "AbstractBackgroundCharacterising gene function for the ever-increasing number and diversity of species with annotated genomes relies almost entirely on computational prediction methods. These software are also numerous and diverse, each with different strengths and weaknesses as revealed through community benchmarking efforts. Meta-predictors that assess consensus and conflict from individual algorithms should deliver enhanced functional annotations.ResultsTo exploit the benefits of meta-approaches, we developed CrowdGO, an open-source consensus-based Gene Ontology (GO) term meta-predictor that employs machine learning models with GO term semantic similarities and information contents. By re-evaluating each gene-term annotation, a consensus dataset is produced with high-scoring confident annotations and low-scoring rejected annotations. Applying CrowdGO to results from a deep learning-based, a sequence similarity-based, and two protein domain-based methods, delivers consensus annotations with improved precision and recall. Furthermore, using standard evaluation measures CrowdGO performance matches that of the community’s best performing individual methods.ConclusionCrowdGO offers a model-informed approach to leverage strengths of individual predictors and produce comprehensive and accurate gene functional annotations.Availability and ImplementationCrowdGO is implemented in Python3, and is freely available from https://gitlab.com/mreijnders/CrowdGO, with a Snakemake workflow and pre-trained models.",
        "link": "http://dx.doi.org/10.1101/731596"
    },
    {
        "id": 11642,
        "title": "Query Expansion based on Naive Bayes and Semantic Similarity",
        "authors": "Zhiyun Zheng",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23940/ijpe.18.07.p5.14211430"
    },
    {
        "id": 11643,
        "title": "Sequential Sentence Embeddings for Semantic Similarity",
        "authors": "Antonio Carta, Davide Bacciu",
        "published": "2019-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci44817.2019.9002824"
    },
    {
        "id": 11644,
        "title": "Evaluation of Semantic Similarity of Protein Clans using Pathway Analysis",
        "authors": "",
        "published": "2021-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/aj10.6/002"
    },
    {
        "id": 11645,
        "title": "Compensation Disclosure: A Study via Semantic Similarity",
        "authors": "Maclean Gaulin, Xiaoxia Peng",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3971286"
    },
    {
        "id": 11646,
        "title": "SubTST: A Combination of Sub-word Latent Topics and Sentence Transformer for Semantic Similarity Detection",
        "authors": "Binh Dang, Tran-Thai Dang, Le-Minh Nguyen",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010775100003116"
    },
    {
        "id": 11647,
        "title": "Linked Data Semantic Distance with Global Normalization for evaluating Semantic Similarity in a Taxonomy",
        "authors": "Anna Formica, Francesco Taglino",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.61416/ceai.v25i2.8353"
    },
    {
        "id": 11648,
        "title": "HHU at SemEval-2017 Task 2: Fast Hash-Based Embeddings for Semantic\n            Word Similarity Assessment",
        "authors": "Behrang QasemiZadeh, Laura Kallmeyer",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2039"
    },
    {
        "id": 11649,
        "title": "Peer Review #2 of \"Effects of perceptual similarity but not semantic association on false recognition in aging (v0.2)\"",
        "authors": "",
        "published": "2017-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.4184v0.2/reviews/2"
    },
    {
        "id": 11650,
        "title": "Sensorimotor distance: A grounded measure of semantic similarity for 800 million concept pairs",
        "authors": "Cai Wingfield, Louise Connell",
        "published": "No Date",
        "citations": 1,
        "abstract": "Experimental design and computational modelling across the cognitive sciences often rely on measures of semantic similarity between concepts. Traditional measures of semantic similarity are typically derived from distance in taxonomic databases (e.g. WordNet), databases of participant-produced semantic features, or corpus-derived linguistic distributional similarity (e.g. CBOW), all of which are theoretically problematic in their lack of grounding in sensorimotor experience. We present a new measure of sensorimotor distance between concepts, based on multidimensional comparisons of their experiential strength across 11 perceptual and action-effector dimensions in the Lancaster Sensorimotor Norms. We demonstrate that, in modelling human similarity judgements, sensorimotor distance has comparable explanatory power to other measures of semantic similarity, explains variance in human judgements which is missed by other measures, and does so with the advantages of remaining both grounded and computationally efficient. Moreover, sensorimotor distance is equally effective for both concrete and abstract concepts. We further introduce a web-based tool (https://lancaster.ac.uk/psychology/smdistance) for easily calculating and visualising sensorimotor distance between words, featuring coverage of nearly 800 million word-pairs. Supplementary materials are available at https://osf.io/d42q6/.",
        "link": "http://dx.doi.org/10.31234/osf.io/fq53w"
    },
    {
        "id": 11651,
        "title": "A hybrid method for cross lingual semantic textual similarity",
        "authors": "Behrouz Minaei Bidgoli, Mohammad Abdous, Poorya Piroozfar",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nToday, it is particularly important to recognize the semantic similarity between texts in different languages due to the emergence of new natural language processing models like ChatGPT and Bard. These models can provide more accurate and comprehensive answers to users' questions by identifying semantic similarity between two texts in different languages. Cross-lingual semantic similarity refers to the process of calculating similarity between two pieces of text in different languages. This paper aims to present an improved method for finding similarities between sentences in different languages. Some of the current methods create the same vector space to achieve this, while others use machine translation to translate the text into another language and then determine similarity between the two sentences using monolingual sentence similarity methods. The degree of similarity is expressed as a number between 0 and 5. Over the past few years, the progress in language models based on transformers has paved the way for improvements in detecting text similarity. This article discusses the utilization of hybrid models with transformers to determine the semantic similarity of sentences in Persian and English languages utilizing the Persian-English corpus. According to our findings, this hybrid approach has a correlation rate of 95.28% in detecting the extent of semantic similarity between cross-lingual sentences. These results indicate that our method surpasses previous techniques for discovering similarities between sentences in different languages.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3181430/v1"
    },
    {
        "id": 11652,
        "title": "Semantic similarity measurement using historical google search patterns",
        "authors": "Jorge Martinez-Gil, José F. Aldana Montes",
        "published": "No Date",
        "citations": 0,
        "abstract": "Computing the semantic similarity between terms (or short text expressions) that have the same meaning but which are not lexicographically similar is an important challenge in the information integration field. The problem is that techniques for textual semantic similarity measurement often fail to deal with words not covered by synonym dictionaries. In this paper, we try to solve this problem by determining the semantic similarity for terms using the knowledge inherent in the search history logs from the Google search engine. To do this, we have designed and evaluated four algorithmic methods for measuring the semantic similarity between terms using their associated history search patterns. These algorithmic methods are: a) frequent co-occurrence of terms in search patterns, b) computation of the relationship between search patterns, c) outlier coincidence on search patterns, and d) forecasting comparisons. We have shown experimentally that some of these methods correlate well with respect to human judgment when evaluating general purpose benchmark datasets, and significantly outperform existing methods when evaluating datasets containing terms that do not usually appear in dictionaries.",
        "link": "http://dx.doi.org/10.31219/osf.io/t48ch"
    },
    {
        "id": 11653,
        "title": "Similarity is closeness: Using distributional semantic spaces to model similarity in visual and linguistic metaphors",
        "authors": "Marianna Bolognesi, Laura Aina",
        "published": "2019-5-27",
        "citations": 5,
        "abstract": "Abstract\nThe semantic similarity that characterizes two terms aligned in a metaphor is here analysed through a corpus-based distributional semantic space. We compare and contrast two samples of metaphors, representative of visual and linguistic modality of expressions respectively. Popular theories of metaphor claim that metaphors transcend their modality to influence conceptual structures, thus suggesting that different modalities of expression would typically express the same conceptual metaphors. However, we show substantial differences in the degree of similarity captured by the distributional semantic space with regard to the modality of expression (higher similarity for linguistic metaphors than for visual ones). We argue that this is due to two possible variables: Conventionality (linguistic metaphors are typically conventional, while visual are not) and Complexity (visual metaphors have modality-specific inner complexities that penalize the degree of similarity between metaphor terms captured by a language-based model). Finally, we compare the similarity scores of our original formulations with those obtained from different possible verbalizations of the same metaphors (acquired by replacing the metaphor terms with their semantic neighbours). We show that while this operation does not affect the average similarity between metaphor terms for visual metaphors, the similarity changes significantly in linguistic metaphors. These results are discussed here.",
        "link": "http://dx.doi.org/10.1515/cllt-2016-0061"
    },
    {
        "id": 11654,
        "title": "MNet-Sim: A Multi-layered Semantic Similarity Network to Evaluate Sentence Similarity",
        "authors": "Manuela Nayantara Jeyaraj, Dharshana Kasthurirathna",
        "published": "2021-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22315381/ijett-v69i7p225"
    },
    {
        "id": 11655,
        "title": "Team dina at SemEval-2022 Task 8: Pre-trained Language Models as Baselines for Semantic Similarity",
        "authors": "Dina Pisarevskaya, Arkaitz Zubiaga",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.semeval-1.169"
    },
    {
        "id": 11656,
        "title": "Multilingual Semantic Textual Similarity using Multilingual Word Representations",
        "authors": "Mahtab Ahmed, Chahna Dixit, Robert E. Mercer, Atif Khan, Muhammad Rifayat Samee, Felipe Urra",
        "published": "2020-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsc.2020.00040"
    },
    {
        "id": 11657,
        "title": "Semantic Network Based Approach to Compute Term Semantic Similarity",
        "authors": "Tianshe Yang, Shuai Wu, Junhua Feng, Na Fu, Menghan Tian",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eitce47263.2019.9094995"
    },
    {
        "id": 11658,
        "title": "Using semantic perimeters with ontologies to evaluate the semantic similarity of scientific papers",
        "authors": "Samia Iltache, Catherine Comparot, Malik Si Mohammed, Pierre-Jean Charrel",
        "published": "2018-9-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31449/inf.v42i3.1559"
    },
    {
        "id": 11659,
        "title": "Semantic Image Captioning using Cosine Similarity Ranking with Semantic Search",
        "authors": "Kirti Jain, Shrey Gandhi, Shivam Singhal, Suryansh Rajput",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3607947.3607987"
    },
    {
        "id": 11660,
        "title": "SimBow at SemEval-2017 Task 3: Soft-Cosine Semantic Similarity\n            between Questions for Community Question Answering",
        "authors": "Delphine Charlet, Geraldine Damnati",
        "published": "2017",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2051"
    },
    {
        "id": 11661,
        "title": "SiameseBERT: A Bert-Based Siamese Network Enhanced with a Soft Attention Mechanism for Arabic Semantic Textual Similarity",
        "authors": "Rakia Saidi, Fethi Jarray, Mohammed Alsuhaibani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011624800003393"
    },
    {
        "id": 11662,
        "title": "Improving Correlation with Human Judgments by Integrating Semantic\n            Similarity with Second–Order Vectors",
        "authors": "Bridget McInnes, Ted Pedersen",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-2313"
    },
    {
        "id": 11663,
        "title": "Czech News Dataset for Semantic Textual Similarity",
        "authors": "Jakub Sido, Michal Seják, Ondřej Pražák, Miloslav Konopík, Václav Moravec",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nThis paper describes a novel dataset consisting of sentences with two different semantic similarity annotations; with and without surrounding context. The data originate from the journalistic domain in the Czech language. The final dataset contains 138,556 human annotations divided into train and test sets. In total, 485 journalism students participated in the creation process. To increase the reliability of the test set, we compute the final annotations as an average of 9 individual annotation scores. We evaluate the dataset quality by measuring inter and intra-annotator agreements. Besides agreement numbers, we provide detailed statistics of the collected dataset. We conclude our paper with a baseline experiment of building a system for predicting the semantic similarity of sentences. Due to the massive number of training annotations (116,956), the model significantly outperforms an average annotator (0.92 versus 0.86 of Pearson's correlation coefficient).",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2130964/v1"
    },
    {
        "id": 11664,
        "title": "“How Was the Match?”: Semantic Similarity between Electronic Media Commentary and Work Domain Analysis Key Phrases",
        "authors": "Gustavo Silva, Ricardo Ribeiro, Rui Lopes",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010691100003059"
    },
    {
        "id": 11665,
        "title": "The Internal Structure of Semantic Relations: Effects of Relational Similarity and Typicality",
        "authors": "Vencislav Popov, Margarita Pavlova, Penka Hristova",
        "published": "No Date",
        "citations": 0,
        "abstract": "We examined whether the processing of semantic relations shows typicality effects similar to those found for the processing of entity concepts. Participants performed four relational processing tasks with the same set of word-pair stimuli: relational exemplar generation; similarity ranking; analogical verification; and a paired-associate learning task. In the similarity ranking task, we gathered separate rankings for relational, role and semantic similarity between word pairs. We found significant correlations at the item level among relational generation frequencies, analogical verification RTs/accuracy and relational luring in associative memory. Relational similarity predicted exemplar generation frequencies, analogical verification RTs/accuracy, and relational luring in associative memory. Role similarity predicted exemplar generation frequency, and analogical verification RTs, but not relational luring. Semantic similarity did not predict any of the tasks, after controlling for the other two factors. Contrary to current theories which posit that semantic similarity is more important for retrieving relevant analogues, and that analogical mapping is based on role-filler bindings, relational similarity was the strongest predictor across all tasks. These results suggest that just like entity concepts, semantic relations have an internal structure that gives rise to typicality effects across a variety of tasks, which could provide constraints for testing competing theories of relational representation.",
        "link": "http://dx.doi.org/10.31234/osf.io/fqd4b"
    },
    {
        "id": 11666,
        "title": "Semantic Similarity Entity Disambiguation for Short Text",
        "authors": "Yuhao Rao",
        "published": "2021-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iscid52796.2021.00089"
    },
    {
        "id": 11667,
        "title": "Identifying the relevant page numbers that referred by the back-of-book index using syntactic similarity and semantic similarity",
        "authors": "Sherly Christina, Enny Dwi Oktaviyani",
        "published": "2017-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iac.2017.8280569"
    },
    {
        "id": 11668,
        "title": "SemEval-2017 Task 2: Multilingual and Cross-lingual Semantic Word Similarity",
        "authors": "Jose Camacho-Collados, Mohammad Taher Pilehvar, Nigel Collier, Roberto Navigli",
        "published": "2017",
        "citations": 43,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2002"
    },
    {
        "id": 11669,
        "title": "Short Text Semantic Similarity Measurement Approach Based on Semantic Network",
        "authors": "Naamah Hussien Hameed, Adel M. Alimi, Ahmed T. Sadiq",
        "published": "2022-12-5",
        "citations": 0,
        "abstract": "Estimating the semantic similarity between short texts plays an increasingly prominent role in many fields related to text mining and natural language processing applications, especially with the large increase in the volume of textual data that is produced daily. Traditional approaches for calculating the degree of similarity between two texts, based on the words they share, do not perform well with short texts because two similar texts may be written in different terms by employing synonyms. As a result, short texts should be semantically compared. In this paper, a semantic similarity measurement method between texts is presented which combines knowledge-based and corpus-based semantic information to build a semantic network that represents the relationship between the compared texts and extracts the degree of similarity between them. Representing a text as a semantic network is the best knowledge representation that comes close to the human mind's understanding of the texts, where the semantic network reflects the sentence's semantic, syntactical, and structural knowledge. The network representation is a visual representation of knowledge objects, their qualities, and their relationships. WordNet lexical database has been used as a knowledge-based source while the GloVe pre-trained word embedding vectors have been used as a corpus-based source. The proposed method was tested using three different datasets, DSCS, SICK, and MOHLER datasets. A good result has been obtained in terms of RMSE and MAE.",
        "link": "http://dx.doi.org/10.21123/bsj.2022.7255"
    },
    {
        "id": 11670,
        "title": "UMDeep at SemEval-2017 Task 1: End-to-End Shared Weight LSTM Model\n            for Semantic Textual Similarity",
        "authors": "Joe Barrow, Denis Peskov",
        "published": "2017",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/s17-2026"
    }
]