[
    {
        "id": 8401,
        "title": "An Exploratory Study on the Characteristics of Short-Form Advertising Using LDA(Latent Dirichlet Allocation) Topic Modeling",
        "authors": "Hye-Ra Oh, Yunjae Cheong",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.16914/ar.2022.135.51"
    },
    {
        "id": 8402,
        "title": "Analysis of US Airline Stock Performance using Latent Dirichlet Allocation (LDA)",
        "authors": "Amina Issoufou Anaroua, Hari Adhikari, Youngran Choi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nFrom changes in the interest rate to the hijacking of a commercial aircraft, there are many events that may result in a fluctuation in airline stock performance. Theimpact of US airlines’ stock performance was measured following aviation related news announcements on differing topics. The data accounted for aviation news of airlines, airports, regulations, safety, accidents, manufacturers, MRO, incidents, aviation training, general aviation, and others from Aviation Voice. A natural language processing, Latent Dirichlet Allocation (LDA), was utilized to investigate and search for patterns that can explain the movements of US airline stocks. First, the aviation related data was mined through text mining and topic modeling. Second, the LDA model approach was employed to help identify and capture certain topics mentioned in aviation voice news releases. Finally, the links between stock returns and the topics identified were investigated. The findings show that financial performance varies significantly across topics. Topics related to technology, fuel, and training positively affect the US airline stocks in the short and long terms moving average, while defense and travel cost-relatedtopics only affect the medium-term run.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3084031/v1"
    },
    {
        "id": 8403,
        "title": "Analysis of the Trends in Biochemical Research Using Latent Dirichlet Allocation (LDA)",
        "authors": " Kang,  Kim,  Kang",
        "published": "2019-6-18",
        "citations": 27,
        "abstract": "Biochemistry has been broadly defined as “chemistry of molecules included or related to living systems”, but is becoming increasingly hard to be distinguished from other related fields. Targets of its studies evolve rapidly; some newly emerge, disappear, combine, or resurface themselves with a fresh viewpoint. Methodologies for biochemistry have been extremely diversified, thanks particularly to those adopted from molecular biology, synthetic chemistry, and biophysics. Therefore, this paper adopts topic modeling, a text mining technique, to identify the research topics in the field of biochemistry over the past twenty years and quantitatively analyze the changes in its trends. The results of the topic modeling analysis obtained through this study will provide a helpful tool for researchers, journal editors, publishers, and funding agencies to understand the connections among the diverse sub-fields in biochemical research and even see how the research topics branch out and integrate with other fields.",
        "link": "http://dx.doi.org/10.3390/pr7060379"
    },
    {
        "id": 8404,
        "title": "Machine Learning and Finance: A Review Using Latent Dirichlet Allocation Technique (LDA)",
        "authors": "Ahmed Sameer El Khatib",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3730256"
    },
    {
        "id": 8405,
        "title": "A Big-Data Analysis of Presidential Issue Ownership of two Prestigious Korean Newspapers : Focusing on LDA(latent Dirichlet allocation) Topic Modeling",
        "authors": "Seung Jeong Park, Jino John, Seon Woo Kim, Sung Tae Kim",
        "published": "2017-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.15617/psc.2017.10.31.3.25"
    },
    {
        "id": 8406,
        "title": "Pemodelan Topik Berita pada Portal Berita Online Berbahasa Indonesia Menggunakan Latent Dirichlet Allocation (LDA)",
        "authors": "",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32409/jikstik.20.2.2719"
    },
    {
        "id": 8407,
        "title": "Estimating News Coverage Patterns using Latent Dirichlet Allocation (LDA)",
        "authors": "Naeem Ahmed Mahoto",
        "published": "2018-6-27",
        "citations": 0,
        "abstract": "The growing rate of unstructured textual data has made an open challenge for the knowledge discovery, which aims extracting desired information from large collection of data. This study presents a system to derive news coverage patterns with the help of probabilistic model – Latent Dirichlet Allocation. Pattern is an arrangement of words within collected data that more likely appear together in certain context. The news coverage patterns have been computed as number function of news articles comprising of such patterns. A prototype, as a proof, has been developed to estimate the news coverage patterns for a newspaper – The Dawn. Analyzing the news coverage patterns from different aspects has been carried out using multidimensional data model. Further, the extracted news coverage patterns are illustrated by visual graphs to yield in-depth understanding of the topics, which have been covered in the news. The results also assist in identification of schema related to newspaper and journalists’ articles.",
        "link": "http://dx.doi.org/10.30537/sjet.v1i1.142"
    },
    {
        "id": 8408,
        "title": "Implementasi Latent Dirichlet Allocation (LDA) untuk Klasterisasi Cerita Berbahasa Bali",
        "authors": "Ngurah Agus Sanjaya ER",
        "published": "2021-2-4",
        "citations": 0,
        "abstract": "<p class=\"Abstrak\">Cerita-cerita berbahasa Bali memiliki topik yang beragam namun memuat nilai kearifan lokal yang perlu untuk dilestarikan. Jika cerita-cerita tersebut dapat dikelompokkan berdasarkan topik, tentu akan sangat memudahkan bagi para pembacanya dalam memilih bacaan yang diinginkan. <em>Latent Dirichlet Allocation</em> (<em>LDA</em>) mengasumsikan bahwa suatu dokumen dibangun dari perpaduan topik-topik tersembunyi. Dengan menerapkan <em>LDA</em> pada kumpulan dokumen, maka dapat diketahui distribusi topik-topik tersembunyi pada kumpulan dokumen secara umum maupun masing-masing dokumen. Pada penelitian ini, distribusi topik yang ditemukan oleh LDA pada  kumpulan cerita berbahasa Bali digunakan untuk melakukan pengelompokkan cerita secara otomatis. Tahapan penelitian meliputi digitalisasi cerita, tokenisasi, <em>case-folding</em>, <em>stemming</em>, pencarian topik dengan <em>LDA</em>, representasi dokumen dan klasterisasi hirarki secara <em>agglomerative</em>. Pengujian dilakukan menggunakan 100 buah data cerita berbahasa Bali yang didapat dari situs daring maupun Dinas Kebudayaan Provinsi Bali untuk menghitung akurasi hasil klasterisasi. Evaluasi dilakukan juga untuk melihat pengaruh jumlah kata dan ukuran kesamaan yang digunakan terhadap akurasi. Akurasi hasil klasterisasi tertinggi yang didapatkan adalah 62% pada saat jumlah kata yang digunakan sebagai representasi dokumen berjumlah 3000 kata. Selain itu, didapatkan suatu kesimpulan bahwa akurasi klasterisasi juga sangat dipengaruhi oleh ukuran kesamaan yang digunakan ketika melakukan penggabungan dokumen serta jumlah kata sebagai representasi dokumen.</p><p class=\"Abstrak\"> </p><p class=\"Abstrak\"><em><strong>Abstract</strong></em></p><p class=\"Abstrak\"><em>Balinese folklores have diverse topics but contain local wisdom that needs to be preserved. Grouping the stories based on the topics can certainly help readers to choose their readings accordingly. Latent Dirichlet Allocation (LDA) assumes that a document is built from a combination of hidden topics. By applying LDA to a collection of documents (corpus), the global distribution of hidden topics in the corpus as well as the distribution of each individual document in the corpus can be identified. In this research, the individual distribution of topics in Balinese folklores is used to group stories based on common topics. The research stages include story digitization, tokenization, case-folding, stemming, topic search with LDA, document representation and agglomerative hierarchical clustering. Performance evaluation was carried out using 100 Balinese folklores data obtained from online sites and the Bali Provincial Cultural Office to calculate the accuracy of the clustering results. Evaluation is also carried out to see the effect of the number of words and the similarity measure used on accuracy. The highest accuracy obtained is 62% when the number of words used as the representation of a document is 3000 words. In addition, it can be concluded that accuracy is also greatly influenced by the similarity measure used when merging the documents and the number of words for document representation.</em></p>",
        "link": "http://dx.doi.org/10.25126/jtiik.0813556"
    },
    {
        "id": 8409,
        "title": "Exploring Satisfaction Level of Customers in Restaurants by Using Latent Dirichlet Allocation(LDA) Algorithm",
        "authors": "Sona Karmakar, N Sivakumar, Anitha S Pillai",
        "published": "2023-4-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icict57646.2023.10134169"
    },
    {
        "id": 8410,
        "title": "Deteksi Topik Tentang Tokoh Publik Politik Menggunakan Latent Dirichlet Allocation (LDA)",
        "authors": "Faizun Nuril Hikmah, Setio Basuki, Yufis Azhar",
        "published": "2020-3-5",
        "citations": 2,
        "abstract": "Twitter merupakan salah satu Social Networking yang memperbolehkan pengguna untuk mengirim dan membaca sebanyak 140 karakter. Berdasarkan survey sekitar 500 juta tweet tiap harinya yang dikirim melalui twitter. Data-data tersebut dapat berupa opini-opini publik mengenai politik, tokoh publik, makanan, dan lain sebagainya. Data tersebut akan diolah dengan teknik Topic Detection untuk menghasilkan suatu topik yang sedang marak dibicarakan masyarakat tentang tokoh publik politik. Permasalahan dalam penulisan ini yaitu, bagaimana mengekstraksi suatu tweet tentang tokoh publik politik dari pengguna Twitter. Data tweet yang diambil tentang tokoh publik politik diantaranya yaitu mengenai Joko Widodo, Basuki Tjahaja Purnama (Ahok), Anies Baswedan, Sandiaga Uno, dan Habib Rizieq Shihab. Dengan adanya data atau tweet tentang tokoh publik politik dapat diolah menggunakan metode Agglomerative untuk mengcluster tiap data yang akan digunakan sebagai topik acuan, LDA (Latent Dirichlet Allocation) yang akan berfungsi sebagai pemodelan topik dari tweet-tweet yang telah tercluster, serta TF-IDF untuk mengetahui tweet mana saja yang mengandung kata-kata dalam LDA yang akan dijadikan sebagai topik acuan. Sehingga akan menghasilkan deteksi topik yang relevan berdasarkan tweet mengenai tokoh publik politik.",
        "link": "http://dx.doi.org/10.22219/repositor.v2i4.52"
    },
    {
        "id": 8411,
        "title": "Extracting Promising Topics on Smart Manufacturing Based on Latent Dirichlet Allocation (LDA)",
        "authors": "Young Seog Yoon, Junhee Lee, Kwangroh Park",
        "published": "2019-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictc46691.2019.8939701"
    },
    {
        "id": 8412,
        "title": "Soil Study of Coastal Hyperspectral Data using K-means and LDA (Latent Dirichlet Allocation)",
        "authors": "Dharambhai Shah, Pooja Shah",
        "published": "2020-11-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca49313.2020.9297494"
    },
    {
        "id": 8413,
        "title": "Latent Dirichlet Allocation for Double Clustering (LDA-DC): Discovering patients phenotypes and cell populations within a single Bayesian framework",
        "authors": "Elie-Julien El Hachem, Nataliya Sokolovska, Hedi Soula",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground: Current clinical routines rely more and more on ``omics'' data such as flow cytometry data from host and sometimes microbiota. Cohorts variability in addition to patients' heterogeneity make any underlying structure of these high-dimensional difficult to understand. In order to patients stratification and diagnostics, there is an acute need to develop novel statistical machine learning methods that are robust with respect to the data heterogeneity, efficient from the computational viewpoint, and can be understood by human experts Results: We propose a novel approach to stratify cell-based observations within a single probabilistic framework, i.e., to extract meaningful phenotype from both patients and cells simultaneously. We define this problem as a double clustering problem that we tackle with the proposed approach. Our method is a practical extension of the Latent Dirichlet Allocation and is used for this Double Clustering task (LDA-DC). We first validate the method on artificial datasets, then we apply our method to two real problems of patients stratification from cytometry and microbiota data. We observe that the LDA-DC returns clusters of patients and simultaneously clusters of cells related to patients’ conditions.We also construct a graphical representation of the results which can be easily understood and a great help for human experts.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1693183/v1"
    },
    {
        "id": 8414,
        "title": "Analisis Topik Informasi Publik Media Sosial di Surabaya Menggunakan Pemodelan Latent Dirichlet Allocation (LDA)",
        "authors": "Kusnanta Bramantya Putra, Renny Pradina Kusumawardani",
        "published": "2017-9-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12962/j23373539.v6i2.23205"
    },
    {
        "id": 8415,
        "title": "Pemodelan Topik Keluhan Masyarakat Pasca Pandemi Menggunakan Metode Latent Dirichlet Allocation (LDA)",
        "authors": "Ika Lailia Nur Rohmatun Nazila, Dina Tri Utari",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "Transparansi informasi publik dan reformasi birokrasi yang dicanangkan oleh pemerintah untuk mewujudkan clean goverment dan  good goverment dapat diimplementasikan dengan melibatkan partisipasi masyarakat. Pengaduan, kritik, dan saran  dari masyarakat kepada pemerintah terkait pelayanan publik yang tidak standar, menyimpang atau tidak teratur perlu diperhatikan untuk evaluasi di masa depan.  Seiring perkembangan teknologi, aspirasi masyarakat dapat tersampaikan melalui alat pengaduan publik yang telah dikembangkan oleh pemerintah pusat dan pemerintah daerah. Kabupaten Sleman sendiri telah memiliki sistem Lapor Sleman yang sejalan dengan Smart Regency. Ilmu matematika berperan penting dalam pemecahan masalah terkait dengan pemodelan topik yang sering dilaporkan masyarakat pada masa pasca pandemi. Oleh karena itu, tujuan penelitian ini untuk mengidentifikasi topik pengaduan masyarakat dengan algoritma Latent Dirichlet Allocation (LDA). LDA adalah suatu metode untuk pemodelan topik berdasarkan konsep probabilistik yang mencari kemiripan dalam sebuah dokumen yang kemudian dikelompokkan menjadi beberapa topik. Data yang digunakan pada penelitian ini merupakan data sekunder dari Kominfo Sleman. Tahapan penelitian diawali dengan pengambilan data, dilanjutkan dengan prepocessing data. Terdapat beberapa tahap prepocessing diantaranya case folding, remove punctuation, stopword removal, tokenizing, dan stemming. Tahap terakhir adalah topic modelling dengan algoritma LDA. Hasil analisis menunjukkan bahwa pemodelan LDA dengan 3 topik yang memiliki nilai coherence terbesar. Hasil pemodelan memberikan gambaran bahwa topik yang paling sering muncul dalam laporan pengaduan masyarakat terhadap pemerintah Sleman adalah pelayanan, jalan rusak, vaksin, dan terkait informasi yang dibutuhkan masyarakat.",
        "link": "http://dx.doi.org/10.21831/pspmm.v7i1.300"
    },
    {
        "id": 8416,
        "title": "The Use of Sentiment Analysis and Latent Dirichlet  Allocation Topic-Modeling (LDA) on Web Novel  Content Quality Factor",
        "authors": "",
        "published": "2022-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33168/jsms.2022.0211"
    },
    {
        "id": 8417,
        "title": "Latent Dirichlet Allocation (LDA) for Anomaly Detection in Avionics Networks",
        "authors": "Adam Thornton, Brandon Meiners, Donald Poole",
        "published": "2020-10-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dasc50938.2020.9256582"
    },
    {
        "id": 8418,
        "title": "Latent Dirichlet Allocation (LDA) Approximation Analysis of Financial-Related Text Messages",
        "authors": "JANKOVA ZUZANA",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24818/18423264/57.1.23.17"
    },
    {
        "id": 8419,
        "title": "LDA filter: A Latent Dirichlet Allocation preprocess method for Weka",
        "authors": "P. Celard, A. Seara Vieira, E. L. Iglesias, L. Borrajo",
        "published": "2020-11-9",
        "citations": 8,
        "abstract": "This work presents an alternative method to represent documents based on LDA (Latent Dirichlet Allocation) and how it affects to classification algorithms, in comparison to common text representation. LDA assumes that each document deals with a set of predefined topics, which are distributions over an entire vocabulary. Our main objective is to use the probability of a document belonging to each topic to implement a new text representation model. This proposed technique is deployed as an extension of the Weka software as a new filter. To demonstrate its performance, the created filter is tested with different classifiers such as a Support Vector Machine (SVM), k-Nearest Neighbors (k-NN), and Naive Bayes in different documental corpora (OHSUMED, Reuters-21578, 20Newsgroup, Yahoo! Answers, YELP Polarity, and TREC Genomics 2015). Then, it is compared with the Bag of Words (BoW) representation technique. Results suggest that the application of our proposed filter achieves similar accuracy as BoW but greatly improves classification processing times.",
        "link": "http://dx.doi.org/10.1371/journal.pone.0241701"
    },
    {
        "id": 8420,
        "title": "Latent Dirichlet Allocation (LDA) topic models for Space Syntax studies on spatial experience",
        "authors": "Ju Hyun Lee, Michael J. Ostwald",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "AbstractSpatial experience has been extensively researched in various fields, with Space Syntax being one of the most widely used methodologies. Multiple Space Syntax techniques have been developed and used to quantitively examine the relationship between spatial configuration and human experience. However, due to the heterogeneity of syntactic measures and experiential issues in the built environment, a systematic review of socio-spatial topics has yet to be developed for Space Syntax research. In response to this knowledge gap, this article employs an ‘intelligent’ method to classify and systematically review topics in Space Syntax studies on spatial experience. Specifically, after identifying 66 articles using the ‘Preferred Reporting Items for Systematic reviews and Meta-Analyses’ (PRISMA) framework, this research develops generative probabilistic topic models to classify the articles using the Latent Dirichlet Allocation (LDA) method. As a result, this research automatically generates three architectural topics from the collected literature data (A1. Wayfinding behaviour, A2. Interactive accessibility, and A3. Healthcare design) and three urban topics (U1. Pedestrian movement, U2. Park accessibility, and U3. Cognitive city). Thereafter it qualitatively examines the implications of the data and its LDA classification. This article concludes with an examination of the limitations of both the methods and the results. Along with demonstrating a methodological innovation (combining PRISMA with LDA), this research identifies critical socio-spatial concepts and examines the complexity of Space Syntax applications. In this way, this research contributes to future Space Syntax research that empirically investigates the relationships between syntactic and experiential variables in architectural and urban spaces. The findings support a detailed discussion about research gaps in the literature and future research directions.",
        "link": "http://dx.doi.org/10.1186/s40410-023-00223-3"
    },
    {
        "id": 8421,
        "title": "A framework of Urdu topic modeling using latent dirichlet allocation (LDA)",
        "authors": "Khadija Shakeel, Ghulam Rasool Tahir, Irsha Tehseen, Mubashir Ali",
        "published": "2018-1",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccwc.2018.8301655"
    },
    {
        "id": 8422,
        "title": "Penerapan Text Mining Pada Sistem Penyeleksian Judul Skripsi Menggunakan Algoritma Latent Dirichlet Allocation(LDA)",
        "authors": "Rakhmat Kurniawan R, Ilka Zufria",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "Dalam proses pengajuan judul proposal skripsi, banyak mahasiswa yang judulnya ditolak dikarenakan adanya kesamaan judul atau tema penelitian yang telah dilakukan sebelumnya. Proses ini dilakukan secara manual dimana judul skripsi direkapitulasi dengan menggunakan aplikasi Microsoft Excel, sehingga membuka peluang kekeliruan dalam pemeriksaan yang disebabkan oleh tim penyeleksi memeriksa judul secara manual baris per baris. Selanjutnya dirasa perlu melakukan penelitian untuk mengatasi masalah tersebut. Dengan harapan memudahkan pengelola program studi dalam menentukan judul skripsi yang potensial dan berkualitas pada mahasiswa. Selanjutnya mempercepat proses penentuan judul skripsi mahasiswa dan tentunya juga akan mempercepat proses penyelesaian studi mahasiswa strata 1. Maka dirancanglah sebuah sistem yang mampu merekomendasi kelayakan judul skripsi yang diajukan melalui teknologi text mining menggunakan algoritma LDA. Algoritma LDA mampu untuk mendeteksi topik yang ada pada suatu koleksi dokumen beserta besarnya kemunculan topik tersebut.",
        "link": "http://dx.doi.org/10.33022/ijcs.v11i3.3120"
    },
    {
        "id": 8423,
        "title": "Aspect Based Sentiment Analysis in E-Commerce User Reviews Using Latent Dirichlet Allocation (LDA) and Sentiment Lexicon",
        "authors": "Eko Wahyudi, Retno Kusumaningrum",
        "published": "2019-10",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicos48119.2019.8982522"
    },
    {
        "id": 8424,
        "title": "An analysis of Disaster Risk Suggestions using Latent Dirichlet Allocation and Hierarchical Dirichlet Process (Nonparametric LDA)",
        "authors": "Ken D. Gorro, Glicerio A. Baguia, Moustafa F. Ali",
        "published": "2021-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3512576.3512608"
    },
    {
        "id": 8425,
        "title": "Urban Crisis Detection Technique: A Spatial and Data Driven Approach Based on Latent Dirichlet Allocation (LDA) Topic Modeling",
        "authors": "Yan Wang, John E. Taylor",
        "published": "2018-3-29",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1061/9780784481271.025"
    },
    {
        "id": 8426,
        "title": "Topic Modelling using Latent Dirichlet Allocation (LDA) and Analysis of Students Sentiments",
        "authors": "Ontiretse Ishmael, Etain Kiely, Cormac Quigley, Donal McGinty",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/jcsse58229.2023.10201965"
    },
    {
        "id": 8427,
        "title": "Latent Dirichlet Allocation (LDA) for Sentiment Analysis Toward Tourism Review in Indonesia",
        "authors": "IR Putri, R Kusumaningrum",
        "published": "2017-1",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1742-6596/801/1/012073"
    },
    {
        "id": 8428,
        "title": "Analyzing ESG News Articles and Research Papers through LDA (Latent Dirichlet Allocation)",
        "authors": "Shi Bowen, Yunkyung Min",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47116/apjcri.2023.08.07"
    },
    {
        "id": 8429,
        "title": "Application of Latent Dirichlet Allocation (LDA) for clustering financial tweets",
        "authors": "Sifi Fatima-Zahrae, Sabbar Wafae, El Mzabi Amal",
        "published": "2021",
        "citations": 0,
        "abstract": "Sentiment classification is one of the hottest research areas among the Natural Language Processing (NLP) topics. While it aims to detect sentiment polarity and classification of the given opinion, requires a large number of aspect extractions. However, extracting aspect takes human effort and long time. To reduce this, Latent Dirichlet Allocation (LDA) method have come out recently to deal with this issue.In this paper, an efficient preprocessing method for sentiment classification is presented and will be used for analyzing user’s comments on Twitter social network. For this purpose, different text preprocessing techniques have been used on the dataset to achieve an acceptable standard text. Latent Dirichlet Allocation has been applied on the obtained data after this fast and accurate preprocessing phase. The implementation of different sentiment analysis methods and the results of these implementations have been compared and evaluated. The experimental results show that the combined uses of the preprocessing method of this paper and Latent Dirichlet Allocation have an acceptable results compared to other basic methods.",
        "link": "http://dx.doi.org/10.1051/e3sconf/202129701071"
    },
    {
        "id": 8430,
        "title": "Latent Dirichlet allocation (LDA) for topic modeling of the CFPB consumer complaints",
        "authors": "Kaveh Bastani, Hamed Namavari, Jeffrey Shaffer",
        "published": "2019-8",
        "citations": 127,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2019.03.001"
    },
    {
        "id": 8431,
        "title": "Inference of Latent Dirichlet Allocation Topic Model using PMI",
        "authors": "Sohee Nam,  ",
        "published": "2019-12-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37727/jkdas.2019.21.6.2789"
    },
    {
        "id": 8432,
        "title": "Topic Modelling in COVID-19 Vaccination Refusal Cases Using Latent Dirichlet Allocation and Latent Semantic Analysis",
        "authors": "Ulfah Malihatin Sholihah, Yulian Findawati",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.774"
    },
    {
        "id": 8433,
        "title": "Topic Modeling of the Pakistani Economy in English Newspapers via Latent Dirichlet Allocation (LDA)",
        "authors": "Fasih Ahmed, Muhammad Nawaz, Aisha Jadoon",
        "published": "2022-1",
        "citations": 4,
        "abstract": " This research paper explores aspects of the Pakistani economy using the Latent Dirichlet Allocation (LDA) technique. The data based on 3,000 articles were collected from two Pakistani English newspapers, Dawn and The News, (2015–2020), through Lexis Nexis database. The headlines of the news articles relevant to Pakistan’s economy, were taken into account. By employing the data-driven approach of the grounded theory, it is found that changes in policies, security preference, textile industry, the shift of energy, inflation, growth and investment, mega projects, sustainable democracy and poverty control need to be focused to overcome the challenges of Pakistan’s economy. It also reveals that mega projects like the China Pakistan Economic Corridor (CPEC) are called to boost Pakistan’s economy. The results show that smooth trading would help reduce poverty in the country. ",
        "link": "http://dx.doi.org/10.1177/21582440221079931"
    },
    {
        "id": 8434,
        "title": "Multi-Document Summarization Using K-Means and Latent Dirichlet Allocation (LDA) – Significance Sentences",
        "authors": "Shiva Twinandilla, Satriyo Adhy, Bayu Surarso, Retno Kusumaningrum",
        "published": "2018",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2018.08.220"
    },
    {
        "id": 8435,
        "title": "Augmented Latent Dirichlet Allocation (Lda) Topic Model with Gaussian Mixture Topics",
        "authors": "Kedar S. Prabhudesai, Boyla O. Mainsah, Leslie M. Collins, Chandra S. Throckmorton",
        "published": "2018-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp.2018.8462003"
    },
    {
        "id": 8436,
        "title": "Topic Modeling Using Latent Dirichlet Allocation (LDA) and Sentiment Analysis for Marketing Planning Tiket.com",
        "authors": "Berlin Helmi Puspita, Muhammad Muhajir, Hafizhan Aliady",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/assehr.k.201010.004"
    },
    {
        "id": 8437,
        "title": "A Competency Mining Method Based on Latent Dirichlet Allocation (LDA) Model",
        "authors": "Jiying Wu, Guandong Son, Sihui Wang",
        "published": "2020-11-1",
        "citations": 1,
        "abstract": "Abstract\nA text mining approach based on latent Dirichlet allocation (LDA) is proposed to analyze the competency characteristics. First, we briefly introduce the principle and hypothesis of latent Dirichlet allocation (LDA) model. Second, we elaborate the idea of using LDA topic model to extract competency, Then, we use Chinese text materials such as biographies and interviews of Chinese scientific and technological talents as data sources to conduct experiments, and obtain four competency topics including knowledge, attitude, quality and values. The research results preliminarily verify the effectiveness of latent Dirichlet allocation (LDA) model in competency research, but there are still many details to be improved in the future.",
        "link": "http://dx.doi.org/10.1088/1742-6596/1682/1/012059"
    },
    {
        "id": 8438,
        "title": "Topic Modeling on Online News.Portal Using Latent Dirichlet Allocation (LDA)",
        "authors": "Mohammad Rezza Fahlevvi, Azhari SN",
        "published": "2022-10-31",
        "citations": 1,
        "abstract": "The amount of News displayed on online news portals. Often does not indicate the topic being discussed, but the News can be read and analyzed. You can find the main issues and trends in the News being discussed. It would be best if you had a quick and efficient way to find trending topics in the News. One of the methods that can be used to solve this problem is topic modeling. Theme modeling is necessary to allow users to easily and quickly understand modern themes' development. One of the algorithms in topic modeling is the Latent Dirichlet Allocation (LDA). This research stage begins with data collection, preprocessing, n-gram formation, dictionary representation, weighting, topic model validation, topic model formation, and topic modeling results.            Based on the results of the topic evaluation, the. The best value of topic modeling using coherence was related to the number of passes. The number of topics produced 20 keys, five cases with a 0.53 coherence value. It can be said to be relatively stable based on the standard coherence value.",
        "link": "http://dx.doi.org/10.22146/ijccs.74383"
    },
    {
        "id": 8439,
        "title": "Trend Topic Analysis using Latent Dirichlet Allocation (LDA) (Study Case: Denpasar People’s Complaints Online Website)",
        "authors": "Aulia Rizki Destarani, Isnandar Slamet, Sri Subanti",
        "published": "2019-7-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26555/jiteki.v5i1.13088"
    },
    {
        "id": 8440,
        "title": "Analysis of Health Research Topics in Indonesia Using the LDA (Latent Dirichlet Allocation) Topic Modeling Method",
        "authors": "Yoga Sahria,  Dhomas Hatta Fudholi",
        "published": "2020-4-20",
        "citations": 3,
        "abstract": "In this time, the need of research, the development and the implementation of the result of research in health is increasing both from the researchers, the government, the academic even of from the public general. One of the ways to find out the health research trend is by topic modeling. The method that used in this research is topic modeling LDA (Latent Dirichlet Allocation) method. The purpose of this research is to identify how modeling topic method LDA analyze modeling topic to some health research in Indonesia by Sinta Journal and to know how the coherence value in each topic of the model that has been made. Besides, hopefully it can be used as a reference to do heath research in Indonesia based the topic that has been modeled. The development of this research uses Anaconda3 Python Programming Language Tools and utilizes the LDA library that provided to get the topic model. To examine the result of this research the respondent are medical worker, health researcher and academics. The result of this research the topic  modeling that used 94,1% respondent say very good and 5,9% say good.",
        "link": "http://dx.doi.org/10.29207/resti.v4i2.1821"
    },
    {
        "id": 8441,
        "title": "Analyze comments on Twitter about extreme weather based on the Latent Dirichlet Allocation (LDA) approach",
        "authors": "Zilan Cao, Senyao Hu, Zheng Tao",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2655859"
    },
    {
        "id": 8442,
        "title": "Yönetim Bilişim Sistemleri Disiplininde Hazırlanan Lisansüstü Tezlerin Gizli Dirichlet Ayrımı Algoritmasıyla Konu Modellemesi",
        "authors": "Levent ÇALLI, Fatih ÇALLI, Büşra ALMA ÇALLI",
        "published": "2021-10-20",
        "citations": 3,
        "abstract": " Yönetim Bilişim Sistemlerinin etkilendiği branşlar, alanda geliştirilen teoriler ve var olan konu çeşitliliklerinin belirlenmesi bir disiplin olarak tanımlandığı ilk günden bu yana akademik literatürde yoğun olarak tartışılan bir konudur. Bu araştırmada, Türkiye’de hızlı ve dinamik bir gelişim gösteren YBS anabilim dalında 2002-2020 yılları arasında tamamlanan 574 lisansüstü tez özeti metin madenciliği yöntemi olan Gizli Dirichlet Ayrımı algoritmasıyla analiz edilmiştir. Analiz sonucunda tezlerin; e-Ticaret ve Pazarlama, Sistem Geliştirme ve Etkileri, Bilişim Sistemleri’nin Organizasyonlara Etkileri, Veri Madenciliği, İnsan Kaynakları Yönetimi, Organizasyonel Değişim, Alana Özel Çalışmalar I, Alana Özel Çalışmalar II, Güvenlik, Eğitim ve Öğretim, Tahmin ve Karar Destek olmak üzere 11 farklı konu başlığı altında kümelenebileceği öngörülmektedir. Araştırma kapsamında, tahmin sonuçlarının ulusal ve uluslararası literatürle göstermiş olduğu benzerlikler ve farklılıklar tartışılmıştır. Araştırma sonucunda yönetim bilişim sistemleri üzerine çalışma yapmak isteyen araştırmacılara fikir vermek ve yol göstermek hedeflenmiştir.",
        "link": "http://dx.doi.org/10.33206/mjss.894809"
    },
    {
        "id": 8443,
        "title": "Latent dirichlet allocation for double clustering (LDA-DC): discovering patients phenotypes and cell populations within a single Bayesian framework",
        "authors": "Elie-Julien El Hachem, Nataliya Sokolovska, Hedi Soula",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "Abstract\nBackground\nCurrent clinical routines rely more and more on “omics” data such as flow cytometry data from host and microbiota. Cohorts variability in addition to patients’ heterogeneity and huge dimensions make it difficult to understand underlying structure of the data and decipher pathologies. Patients stratification and diagnostics from such complex data are extremely challenging. There is an acute need to develop novel statistical machine learning methods that are robust with respect to the data heterogeneity, efficient from the computational viewpoint, and can be understood by human experts.\n\nResults\nWe propose a novel approach to stratify cell-based observations within a single probabilistic framework, i.e., to extract meaningful phenotypes from both patients and cells data simultaneously. We define this problem as a double clustering problem that we tackle with the proposed approach. Our method is a practical extension of the Latent Dirichlet Allocation and is used for the Double Clustering task (LDA-DC). We first validate the method on artificial datasets, then we apply our method to two real problems of patients stratification based on cytometry and microbiota data. We observe that the LDA-DC returns clusters of patients and also clusters of cells related to patients’ conditions. We also construct a graphical representation of the results that can be easily understood by humans and are, therefore, of a big help for experts involved in pre-clinical research.\n",
        "link": "http://dx.doi.org/10.1186/s12859-023-05177-4"
    },
    {
        "id": 8444,
        "title": "Topic Modelling of Germas Related Content on Instagram Using Latent Dirichlet Allocation (LDA)",
        "authors": "Muhammad Habibi, Adri Priadana, Andika Bayu Saputra, Puji Winar Cahyo",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/ahsr.k.210127.060"
    },
    {
        "id": 8445,
        "title": "A Case-Study on Topic Modeling Approach with Latent Dirichlet Allocation (LDA) Model",
        "authors": "Abisheka Pon,  , C. Deisy, P. Sharmila",
        "published": "2021",
        "citations": 0,
        "abstract": "In natural language processing, subject displaying is a sort of factual information models for identifying the points from an enormous assortment of corpus of records. Subject demonstrating is a sort of text-digging device for revelation of stowed away semantic designs in a text body. In the proposed model high layered text informational index named article.csv is handled to acquire primary themes or as often as possible happening subjects for our text information by giving the catchphrases of every point. In this work, a dataset of abstracts are collected from two different domain journals for tagging journal abstracts. The document models are built using Latent Dirichlet Allocation (LDA).Topics thus extracted can be used to get meaningful insights from the text data. In this paper LDA model is used to gives an extra analytical boost for the model. First the data is preprocessed as text data before giving the data to the model as the predictions. Then topic modeling is performed on the preprocessed data by integrating the framework of LDA topic modeling for more optimal classification of topics in the documents.",
        "link": "http://dx.doi.org/10.52458/978-81-95502-00-4-30"
    },
    {
        "id": 8446,
        "title": "Understanding Influence of Marketing Thought on Practice: An Analysis of Business Journals Using Textual and Latent Dirichlet Allocation (LDA) Analysis",
        "authors": "Abhishek Borah, Xin (Shane) Wang, Jun Hyun (Joseph) Ryoo",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3129115"
    },
    {
        "id": 8447,
        "title": "Application of Latent Dirichlet Allocation (LDA) to Identify Research Topics in Journal Publications",
        "authors": "Puji Rahayu, Alfredo Julian Saputra, Erika Nurmaida, Brian DM Hutasoit, Kraugusteeliana Kraugusteeliana",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icimcis60089.2023.10349072"
    },
    {
        "id": 8448,
        "title": "Machine Learning and Finance",
        "authors": "Ahmed Sameer El Khatib",
        "published": "2021-4-1",
        "citations": 1,
        "abstract": "The aim of this paper is provide a first comprehensive structuring of the literature applying machine learning to finance. We use a probabilistic topic modelling approach to make sense of this diverse body of research spanning across the disciplines of finance, economics, computer sciences, and decision sciences. Through the topic modelling approach, a Latent Dirichlet Allocation Technique (LDA), we can extract the 14 coherent research topics that are the focus of the 6,148 academic articles during the years 1990-2019 analysed. We first describe and structure these topics, and then further show how the topic focus has evolved over the last two decades. Our study thus provides a structured topography for finance researchers seeking to integrate machine learning research approaches in their exploration of finance phenomena. We also showcase the benefits to finance researchers of the method of probabilistic modelling of topics for deep comprehension of a body of literature, especially when that literature has diverse multi-disciplinary actors.",
        "link": "http://dx.doi.org/10.31686/ijier.vol9.iss4.3016"
    },
    {
        "id": 8449,
        "title": "Enriched LDA (ELDA): Combination of latent Dirichlet allocation with word co-occurrence analysis for aspect extraction",
        "authors": "Mohammadreza Shams, Ahmad Baraani-Dastjerdi",
        "published": "2017-9",
        "citations": 53,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2017.02.038"
    },
    {
        "id": 8450,
        "title": "The Influnce Stemmer Truncating and Statistical in Mapping Students Research Trends with Latent Dirichlet Allocation (LDA)",
        "authors": "Isra Andika Bakhri, Ema Utami, Anggit Dwi Hartanto",
        "published": "2022-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitisee57756.2022.10057809"
    },
    {
        "id": 8451,
        "title": "IMPROVING ONLINE MEETING EFFICIENCY USING LATENT DIRICHLET ALLOCATION (LDA) AND SOCIAL NETWORK ANALYSIS (SNA) METHODS",
        "authors": "Megananda Hervita Permata Sari, Utomo Budiyanto",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "The pandemic period can change the habits of a person and organization, where all meetings are not held face-to-face/offline but virtually, so it is not uncommon for meetings to be attended by employees who are not Persons in Charge (PIC) on certain meeting topics. This study aims to identify trends in time, day, and duration of meetings within the Secretariat General of the Ministry of Finance and to cluster meeting matters into several themes so that further identification can be carried out to provide recommendations for units having duties related to the meeting using networking analysis. This study uses the Natural Language Processing (NLP) method with Latent Dirichlet Allocation (LDA) which can conclude the factors that represent topics to produce topic clustering and Social Network Analysis (SNA) modeling using the Degree Centrality method to find out the closest relationship between topics and names. unit based on the highest centrality value and the possibility of a unit attending a meeting that discusses a particular topic. Data used in this reseacrh are meetings held during April 2020 up to April 2022 with 59,891 data records. The modeling results shows clustering result dashboard based on meeting topics and  to produce an analysis of which meeting topics are often discussed and become a concern. The results of the research are expected to be used to provide recommendations to unit leaders to assign meeting dispositions for each PIC to attend the meeting.",
        "link": "http://dx.doi.org/10.52436/1.jutif.2023.4.3.751"
    },
    {
        "id": 8452,
        "title": "Feature Extraction in Topic Modeling Using the Latent Dirichlet Allocation Method in Data Leak Events",
        "authors": "Achmad Ariansyah, Uce Indahyanti",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.3537"
    },
    {
        "id": 8453,
        "title": "ASPECT EXTRACTION IN E-COMMERCE USING LATENT DIRICHLET ALLOCATION (LDA) WITH TERM FREQUENCY-INVERSE DOCUMENT FREQUENCY (TF-IDF)",
        "authors": "Satyawan Agung Nugroho, Fitra A Bachtiar, Randy Cahya Wihandika",
        "published": "2022-1-11",
        "citations": 0,
        "abstract": "Social media is a common thing that people use. Posts or comments found on social media describe someoneâ€™s feelings and opinions so there have to be important topics that can be extracted from social media. In the e-commerce field, topic is an interesting thing to know because it can describes peopleâ€™s opinion towards a product. However, the large number of social media users is currently making the process of finding topics from social media difficult, so computer assistance is needed. One method that can be used is Latent Dirichlet Allocation (LDA). LDA is a good method for extracting topics, but the drawback is that sometimes the topics are incomprehensible. To cover up the drawback, TF-IDF feature selection method is used so that less important words can be skipped so LDA can generate a better topic. The best hyperparameter values â€‹â€‹obtained were 10 iterations, 10 topics, Î± and Î² values consecutively 0,1 and 0,01. The best feature selection percentile value is 90. This value is used to find the threshold that can be used as the lower limit of the TF-IDF value of each word so that the word with greater TF-IDF value can be used as feature.",
        "link": "http://dx.doi.org/10.21107/kursor.v11i2.247"
    },
    {
        "id": 8454,
        "title": "PAN-LDA: A latent Dirichlet allocation based novel feature extraction model for COVID-19 data using machine learning",
        "authors": "Aakansha Gupta, Rahul Katarya",
        "published": "2021-11",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2021.104920"
    },
    {
        "id": 8455,
        "title": "A Latent Dirichlet Allocation (LDA) Semantic Text Analytics Approach to Explore Topical Features in Charity Crowdfunding Campaigns",
        "authors": "Prathamesh Muzumdar, George Kurian, Ganga Prasad Basyal",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "Crowdfunding in the realm of the Social Web has received substantial attention, with prior research examining various aspects of campaigns, including project objectives, durations, and influential project categories for successful fundraising. These factors are crucial for entrepreneurs seeking donor support. However, the terrain of charity crowdfunding within the Social Web remains relatively unexplored, lacking comprehension of the motivations driving donations that often lack concrete reciprocation. Distinct from conventional crowdfunding that offers tangible returns, charity crowdfunding relies on intangible rewards like tax advantages, recognition posts, or advisory roles. Such details are often embedded within campaign narratives, yet, the analysis of textual content in charity crowdfunding is limited. This study introduces an inventive text analytics framework, utilizing Latent Dirichlet Allocation (LDA) to extract latent themes from textual descriptions of charity campaigns. The study has explored four different themes, two each in campaign and incentive descriptions. Campaign description’s themes are focused on child and elderly health mainly the ones who are diagnosed with terminal diseases. Incentive description’s themes are based on tax benefits, certificates, and appreciation posts. These themes, combined with numerical parameters, predict campaign success. The study was successful in using Random Forest Classifier to predict success of the campaign using both thematic and numerical parameters. The study distinguishes thematic categories, particularly medical need-based charity and general causes, based on project and incentive descriptions. In conclusion, this research bridges the gap by showcasing topic modelling utility in uncharted charity crowdfunding domains.",
        "link": "http://dx.doi.org/10.9734/ajeba/2024/v24i11207"
    },
    {
        "id": 8456,
        "title": "Terrorism domain corpus building using Latent Dirichlet Allocation (LDA) and its ontology relationship building using Global Similarity Hierarchy Learning(GSHL)",
        "authors": "Adang Suhendra, Juwita Winadwiastuti, Astie Darmayantie, Nuke Farida",
        "published": "2017-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icts.2017.8265679"
    },
    {
        "id": 8457,
        "title": "Results and Methodological Implications of the Digital Epidemiology of Prescription Drug References Among Twitter Users: Latent Dirichlet Allocation (LDA) Analyses (Preprint)",
        "authors": "Maria A Parker, Danny Valdez, Varun K Rao, Katherine S Eddens, Jon Agley",
        "published": "No Date",
        "citations": 0,
        "abstract": "\nBACKGROUND\nSocial media is an important information source for a growing subset of the population and can likely be leveraged to provide insight into the evolving drug overdose epidemic. Twitter can provide valuable insight into trends, colloquial information available to potential users, and how networks and interactivity might influence what people are exposed to and how they engage in communication around drug use.\n\n\nOBJECTIVE\nThis exploratory study was designed to investigate the ways in which unsupervised machine learning analyses using natural language processing could identify coherent themes for tweets containing substance names.\n\n\nMETHODS\nThis study involved harnessing data from Twitter, including large-scale collection of brand name (N=262,607) and street name (N=204,068) prescription drug–related tweets and use of unsupervised machine learning analyses (ie, natural language processing) of collected data with data visualization to identify pertinent tweet themes. Latent Dirichlet allocation (LDA) with coherence score calculations was performed to compare brand (eg, OxyContin) and street (eg, oxys) name tweets.\n\n\nRESULTS\nWe found people discussed drug use differently depending on whether a brand name or street name was used. Brand name categories often contained political talking points (eg, border, crime, and political handling of ongoing drug mitigation strategies). In contrast, categories containing street names occasionally referenced drug misuse, though multiple social uses for a term (eg, Sonata) muddled topic clarity.\n\n\nCONCLUSIONS\nContent in the brand name corpus reflected discussion about the drug itself and less often reflected personal use. However, content in the street name corpus was notably more diverse and resisted simple LDA categorization. We speculate this may reflect effective use of slang terminology to clandestinely discuss drug-related activity. If so, straightforward analyses of digital drug-related communication may be more difficult than previously assumed. This work has the potential to be used for surveillance and detection of harmful drug use information. It also might be used for appropriate education and dissemination of information to persons engaged in drug use content on Twitter.\n",
        "link": "http://dx.doi.org/10.2196/preprints.48405"
    },
    {
        "id": 8458,
        "title": "En-LDA: An Novel Approach to Automatic Bug Report Assignment with Entropy Optimized Latent Dirichlet Allocation",
        "authors": "Wen Zhang, Yangbo Cui, Taketoshi Yoshida",
        "published": "2017-4-25",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3390/e19050173"
    },
    {
        "id": 8459,
        "title": "Identification of Zonal-Wise Passenger's Issues in Indian Railways Using Latent Dirichlet Allocation (LDA): A Sentiment Analysis Approach On Tweets",
        "authors": "Vijay Singh, Mangey Ram, Bhasker Pant",
        "published": "2018-9-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2174/9781681087139118020015"
    },
    {
        "id": 8460,
        "title": "Analisis Sentimen Berdasarkan Topik Terkait Wabah Covid-19 di Twitter Menggunakan Latent Dirichlet Allocation (LDA) dan Naive Bayes Classifier (NBC)",
        "authors": "Pangky Putra Aziztiya, Muhammad Habibi, Netania Indi Kusumaningtyas",
        "published": "2022-10-27",
        "citations": 0,
        "abstract": "In 2020 WHO determined that the Corona Virus (COVID-19) was a pandemic. The global spread of the COVID-19 outbreak has made Twitter one of the most widely used tools to publish and find information. This study aims to form a modeling of topics related to the COVID-19 outbreak on the Twitter social media platform and analyze positive and negative sentiments in each topic that has been obtained by combining the two Latent Dirichlet Allocation (LDA) and Naïve Bayes Classification (NBC) methods. Beginning with modeling the topic using the Latent Dirichlet Allocation so that the topics that have been obtained will be searched for the sentiment value of each topic using the Naïve Bayes Classifier method. This study succeeded in combining the two methods with a fairly good accuracy of 89%. In topic modeling, 5 ideal topics were obtained and it can be seen that the most discussed topic is booster vaccination. The results of the classification using NBC show that the topic of booster vaccination has more negative sentiments than positive sentiments.",
        "link": "http://dx.doi.org/10.30989/teknomatika.v15i2.1098"
    },
    {
        "id": 8461,
        "title": "The Latent Dirichlet Allocation (LDA) generative model for automating process of rendering judicial decisions",
        "authors": "Petr Pylov, Roman Maitak, Andrey Protodyakonov",
        "published": "2023",
        "citations": 0,
        "abstract": "The Latent Dirichlet Allocation (LDA) generative model is widely used in statistical analysis and machine learning due to its ability to model the probabilities of multidimensional categorical data, such as the frequencies of different categories or the probability distribution across multiple categories. This article explores the potential application of the LDA model for the practical task of topic separation in documents related to judicial proceedings.",
        "link": "http://dx.doi.org/10.1051/e3sconf/202343105005"
    },
    {
        "id": 8462,
        "title": "LATENT DIRICHLET ALLOCATION (LDA) METHOD ANALYSIS ABOUT COVID-19 VACCINE ON TWITTER SOCIAL MEDIA",
        "authors": "Happy Alyzhya Haay, Adi Setiawan",
        "published": "2022-3-21",
        "citations": 0,
        "abstract": "Twitter is one social media that often provides much information for its users, one of which is information regarding the COVID-19 vaccination. This study aimed to explore and find out what topics are often discussed on Twitter social media. One of which is the topic of COVID-19 vaccination using the Latent Dirichlet Allocation (LDA) method and analysis of the frequency of keywords that often appear with this topic. The Tweet data used in this study was taken from Twitter users worldwide in November 2021. In this study, the results of sentiment analysis were obtained from the tweet data taken, which was divided into positive sentiment and negative sentiment, namely \"vaccination\" with 40 words and \"'Covid19\" with 35 words",
        "link": "http://dx.doi.org/10.30598/barekengvol16iss1pp189-196"
    },
    {
        "id": 8463,
        "title": "An Explorative Research Towards the Criteria of Peer Evaluation Among University Students Using Latent Dirichlet Allocation (LDA)",
        "authors": "Minho Kwak, Young-Jin Seo",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46392/kjge.2020.14.6.323"
    },
    {
        "id": 8464,
        "title": "Latent Dirichlet Allocation (LDA) Model and kNN Algorithm to Classify Research Project Selection",
        "authors": "M A Safi’ie, E Utami, H A Fatta",
        "published": "2018-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1757-899x/333/1/012110"
    },
    {
        "id": 8465,
        "title": "Latent Dirichlet Allocation (LDA) for improving the topic modeling of the official bulletin of the spanish state (BOE)",
        "authors": "J.C. Bailón-Elvira, M.J. Cobo, E. Herrera-Viedma, A.G. López-Herrera",
        "published": "2019",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2019.11.277"
    },
    {
        "id": 8466,
        "title": "Detection of Reference Topics and Suggestions using Latent Dirichlet Allocation (LDA)",
        "authors": "Setio Basuki, Yufis Azhar, Agus Eko Minarno, Christian Sri Kusuma Aditya, Fauzi Dwi Setiawan Sumadi, Ardiansah Ilham Ramadhan",
        "published": "2019-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icts.2019.8850993"
    },
    {
        "id": 8467,
        "title": "Analisis Kepercayaan Masyarakat Tentang Kepolisian Indonesia di Twitter Menggunakan Latent Dirichlet Allocation (LDA)",
        "authors": " Bagas Dwi Santosa,  Nurul Fatimah,  Netania Indi Kusumaningtyas,  Ulfi Saidata Aesyi,  Herdiesel Santoso",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Kepolisian Negara Republik Indonesia merupakan instansi yang bertugas untuk menjaga ketertiban dan keamanan masyarakat, menerapkan hukum, memberikan perlindungan, dukungan dan layanan kepada warga negara guna menjaga stabilitas dalam negeri. Namun, ditengah peran dari kepolisian itu sendiri, justru banyak kasus yang menyeret beberapa anggota polisi. Hal tersebut yang membuat masyarakat ramai membicarakannya di sosial media, salah satunya Twitter. Bahkan tagar-tagar yang berkaitan dengan kasus lingkup kepolisian juga sempat trending di Twitter. Dari hal tersebut, maka perlu dilakukan analisis terhadap topik kepercayaan masyarakat terhadap kepolisian. Analisis yang dilakukan menggunakan Latent Dirichlet Allocation (LDA). Hasil dari analisis yang dilakukan yaitu kepercayaan masyarakat terhadap kepolisian berkurang atas banyaknya kasus yang dilakukan anggota polisi saat ini. Analisis yang dilakukan menggunakan Latent Dirichlet Allocation (LDA) mengungkapkan bahwa kepercayaan publik terhadap kepolisian telah terkikis secara signifikan akibat banyaknya kasus yang melibatkan anggota kepolisian. Kesimpulan ini didukung oleh prevalensi tagar terkait kepolisian dan diskusi di platform media sosial seperti Twitter.",
        "link": "http://dx.doi.org/10.30989/ijds.v1i2.1198"
    },
    {
        "id": 8468,
        "title": "Aspect Based Sentiment Analysis: Feature Extraction using Latent Dirichlet Allocation (LDA) and Term Frequency - Inverse Document Frequency (TF-IDF) in Machine Learning (ML)",
        "authors": "Shakirah Mohd Sofi, Ali Selamat",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "The growth and development of social networks, blogs, forums, and e-commerce websites has produced a number of data, notably textual data, which has increased tremendously. Twitter is one of the most popular media social platforms; during the COVID-19 pandemic, people all around the world use social media to share their opinions or concerns about the pandemic that has changed their lives. It revealed a significant rise in tweets on coronavirus, including positive, negative, and neutral tweets about the virus's impact. Sentiment analysis faces challenges: sparse data limits understanding, while topic coherence and interpretability demand improvement for clearer insights. The primary goal of this paper is to improve the accuracy and effectiveness of sentiment analysis during the COVID-19 pandemic through the application of advanced techniques and classifiers. In this article, we experiment with such Support Vector Machines (SVM) and Naive Bayes (NB) on Twitter data for high-accuracy machine learning models. Using Latent Dirichlet Allocation (LDA)for feature extraction, we aim to capture comprehensive aspects and topics for sentiment analysis. Additionally, we explore Count Vectorizer and Term Frequency - Inverse Document Frequency (TF-IDF) as word embedding techniques. The main objectives are to extract topics, understand public concerns about Covid-19, and compare classifier performance in Aspect-Based Sentiment Analysis on Covid-19 tweets. This paper introduces advanced sentiment analysis techniques, such as LDA, Count Vectorizer, and SVM, enhancing nuanced sentiment analysis during the COVID-19 pandemic with notable 85% accuracy in SVM classification.",
        "link": "http://dx.doi.org/10.53840/myjict8-2-102"
    },
    {
        "id": 8469,
        "title": "Latent DIRICHLET allocation (LDA) based information modelling on BLOCKCHAIN technology: a review of trends and research patterns used in integration",
        "authors": "Chetan Sharma, Shamneesh Sharma,  Sakshi",
        "published": "2022-10",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-022-13500-z"
    },
    {
        "id": 8470,
        "title": "Topic modeling of weather and climate condition on twitter using latent dirichlet allocation (LDA)",
        "authors": "Ahmad Fathan Hidayatullah, Silfa Kurnia Aditya,  Karimah, Syifa Tri Gardini",
        "published": "2019-3-11",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1757-899x/482/1/012033"
    },
    {
        "id": 8471,
        "title": "ANALISIS DAN PENERAPAN TOPIC MODELING PADA JUDUL TUGAS AKHIR MAHASISWA MENGGUNAKAN METODE LATENT DIRICHLET ALLOCATION (LDA)",
        "authors": "Titiana Titiana, Dwi Hosanna Bangkalang",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "Tugas akhir menjadi syarat kelulusan bagi mahasiswa program studi Sistem Informasi, Fakultas Teknologi Informasi, Universitas Kristen Satya Wacana. Penentuan judul tugas akhir di program studi, biasanya ditentukan sesuai konsentrasi. Namun, saat penentuan judul masih terdapat mahasiswa yang kebingungan karena tidak mempunyai referensi yang valid terkait gambaran judul di konsentrasi program studi. Sehingga, mahasiswa sering memasukan data kosong pada judul tugas akhir saat melakukan pendaftaran. Selain itu, program studi juga belum mempunyai informasi terkait pengelompokan judul tugas akhir mahasiswa. Oleh karena itu dibutuhkan topic modeling untuk mengetahui minat judul tugas akhir sebagai referensi mahasiswa dalam penentuan judul. Topic modeling dibuat menggunakan metode Latent Dirichlet Allocation (LDA) kemudian dibuat pengklasteran serta dilakukan evaluasi model menggunakan hyperparameter tuning dan coherence score sebagai alat ukur performa model. Tahapan penelitian meliputi studi literatur dan wawancara, pengumpulan dan analisis data, data pre-processing, pembuatan model, dan evaluasi. Diperoleh hasil bahwa mayoritas mahasiswa Sistem Informasi mengambil judul bertema Tata Kelola. Model yang dibuat memperoleh 4 cluster yaitu terkait Technology Acceptance Model, Framework Cobit, dan Arsitektur Enterprise.  Setelah dilakukan hyperparameter tuning didapat coherence score sebesar 0,617789 dari yang sebelumnya 0,53448. Tujuan penelitian ini adalah memodelkan topik tugas akhir mahasiswa sebagai informasi cluster pengambilan judul tugas akhir dari peneliti mahasiswa terdahulu. Sehingga bermanfaat sebagai referensi pengambilan judul tugas akhir untuk mahasiswa sebagai dasar pengetahuan minat judul tugas akhir dan untuk memberikan pengetahuan dan kontribusi bagi program studi sebagai landasan penyesuaian judul tugas akhir mahasiswa, konsentrasi serta pengembangan kurikulum.",
        "link": "http://dx.doi.org/10.29100/jipi.v8i4.4254"
    },
    {
        "id": 8472,
        "title": "Latent Dirichlet Allocation",
        "authors": "Hang Li",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-3917-6_20"
    },
    {
        "id": 8473,
        "title": "Latent Dirichlet Allocation",
        "authors": "",
        "published": "2022-12-22",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009218245.012"
    },
    {
        "id": 8474,
        "title": "Can reviews predict reviewers’ numerical ratings? The underlying mechanisms of customers’ decisions to rate products using Latent Dirichlet Allocation (LDA)",
        "authors": "Atieh Poushneh, Reza Rajabi",
        "published": "2022-3-1",
        "citations": 9,
        "abstract": "\nPurpose\nTwo valuable pieces of information – reviews and their corresponding numerical ratings – are accessible to potential customers before they make a purchasing decision. An extensive body of marketing literature has scrutinized the influence of customers’ reviews by linking such aspects as the volume and valance of reviews with product sales and customers’ purchase intention. The aim of this study, for which dual coding theory was used, was to understand the relationship between reviews and their corresponding numerical ratings.\n\n\nDesign/methodology/approach\nThe authors used the latent Dirichlet allocation technique to categorize customers’ reviews. The present findings contribute to the literature by showing the underlying mechanisms that customers use to interpret reviews and associate them with numerical ratings.\n\n\nFindings\nThe gradient boosted decision tree model demonstrates that non-abstract-dominant reviews (reviews mainly consist of tangible objects, actions, events or affective words) are significant predictors of their corresponding numerical ratings. However, abstract-dominant reviews (i.e. those consisting primarily of intangible objects, events or actions) cannot predict their associated numerical ratings.\n\n\nOriginality/value\nThe present findings contribute to the literature by showing the underlying mechanisms that customers use to interpret reviews and associate them with numerical ratings.\n",
        "link": "http://dx.doi.org/10.1108/jcm-09-2020-4114"
    },
    {
        "id": 8475,
        "title": "Research topic analysis of the European Sport Management Quarterly: Topic modeling with Latent Dirichlet Allocation(LDA)",
        "authors": "Mihwa Choi, Hyungil Kwon, Juhae Baeck, Do Young Pyun",
        "published": "2019-12-31",
        "citations": 0,
        "abstract": "Purpose The purpose of this study was to analyze the research topics of the articles which were published through European Sport Management Quarterly(ESMQ) from 2009 to 2018. The prior topic analysis studies of the ESMQ classified topics based on the key words using NASPE-NASSM SMPS categories. Therefore they couldn't fully reflect the content of the articles. Methods The topic modeling of the current study was conducted with the Latent Dirichlet Allocation(LDA) which generates topics based on the word usage in the article. A total of 265 articles were converted from 'pdf' format to 'txt' ANSI format for topic modeling analysis. The whole topic modeling process was done using R program and the model was set to generate 10 topics from the article. Results The 3 sport management experts were hired to label the name of the topics and the name of the topics are as follow : (1) Impact of mega sport event, (2) Cause-related marketing, (3) Factors affecting the results of the competition, (4) Managing sport organization, (5) European sport leagues, (6) Strategic management, (7) Sport economics, (8) Sport in communities, (9) Sport consumers, (10) Elite sports. It is not quite possible to compare the results of the current topic modeling results with the previous ones because of the methodological differences. However, even though the standards are different, Sport marketing topic showed the largest growth among the 10 topics extracted. Conclusions This study used the LDA probabilistic algorithm to analyze research topics, which made the analyses more objective and wholistic. However, the insights of the researchers were still needed to interpret and labeling the topics.",
        "link": "http://dx.doi.org/10.24985/kjss.2019.30.4.775"
    },
    {
        "id": 8476,
        "title": "Topic Categorization on Social Network Using Latent Dirichlet Allocation",
        "authors": "Ramyadharshni S.S., Pabitha Dr.P.",
        "published": "2018-4-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.9756/bijsesc.8390"
    },
    {
        "id": 8477,
        "title": "Latent Dirichlet Allocation (LDA) Based on Automated Bug Severity Prediction Model",
        "authors": "Ritu Bibyan, Sameer Anand, Ajay Jaiswal",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-6289-8_31"
    },
    {
        "id": 8478,
        "title": "Topic Modeling of Online Media News Titles during COVID-19 Emergency Response in Indonesia Using the Latent Dirichlet Allocation (LDA) Algorithm",
        "authors": "M Didik R Wahyudi, Agung Fatwanto, Usfita Kiftiyani, M. Galih Wonoseto",
        "published": "2021-8-31",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.35671/telematika.v14i2.1225"
    },
    {
        "id": 8479,
        "title": "Latent Dirichlet Allocation Mixture Models for Nucleotide Sequence Analysis",
        "authors": "Bixuan Wang, Stephen M. Mount",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractStrings of nucleotides that carry biological information are typically described using sequence motifs that can be represented by weight matrices or consensus sequences. However, many biological signals in DNA or RNA are recognized by multiple factors in temporal sequence, consist of a mixture of sometimes dissimilar alternative motifs, or may be described better by base composition. Here we apply the Latent Dirichlet Allocation (LDA) mixture model to nucleotide sequences, using k-mers as features, in three related approaches. First, positions in aligned sequences are used as samples. Alternatively, whole sequences are used as samples, either with positional k-mers or with bulk k-mers occurring throughout the sequence. LDA readily identifies motifs, including such elusive cases as the intron branch site. LDA can also identify subtypes of sequence, such as splice site subtypes enriched in long vs. short introns, and can reliably distinguish such properties as reading frame or species of origin. Our results show that LDA is a useful model for describing heterogeneous signals, for assigning individual sequences to subtypes, and for identifying and characterizing sequences that do not fit recognized subtypes. Because LDA topic models are interpretable, they also aid the discovery of new motifs, even those present in a small fraction of samples, allowing a user to hypothesize potential regulatory factors. In summary, LDA can identify and characterize signals in nucleotide sequences and is useful for identifying candidate regulatory factors involved in complex biological processes.",
        "link": "http://dx.doi.org/10.1101/2023.12.10.571018"
    },
    {
        "id": 8480,
        "title": "A model of policing strategy choice",
        "authors": "Marcio Pereira Basilio, Gabrielle Souza Brum, Valdecy Pereira",
        "published": "2020-2-24",
        "citations": 15,
        "abstract": "\nPurpose\nThe purpose of this paper is to develop a method for the discovery of knowledge in emergency response databases based on police incident reports, generating information that identifies local criminal demands that allow the selection of the appropriate policing strategies portfolio to solve the problem.\n\n\nDesign/methodology/approach\nThe developed model uses a methodology for the discovery of knowledge involving text mining techniques using Latent Dirichlet Allocation (LDA) integrated with the ELECTRE I multicriteria method.\n\n\nFindings\nThe developed method allowed the identification of the most common criminal demands that occurred from January 1 to December 31, 2016, in the policing areas studied. One of the crimes does not occur homogeneously in a particular locality. In this study, it was initially observed that 40 per cent of the crimes identified in the Integrated Public Safety Area 5, or AISP-5, (historical city center of RJ) had no correlation with AISP-19 (Copacabana - RJ), and 33 per cent of crimes crimes in AISP-19 were not identified in AISP-5. This finding guided the second part of the method that sought to identify which portfolio of policing strategies would be most appropriate for the identified demands. In this sense, using the ELECTRE I method, eight different scenarios were constructed where it can be identified that for each specific criminal demand set there is a set of policing strategies to be applied.\n\n\nResearch limitations/implications\nThe collected data represent the social dynamics of neighbourhoods in the central and southern zones of the city of Rio de Janeiro during the specific period from January 2013 to December 2016. This limitation implies that the results cannot be generalised to areas with different characteristics.\n\n\nPractical implications\nThe developed methodology contributes in a complementary way to the identification of criminal practices and their characteristics based on reports of police occurrences stored in emergency response databases. The knowledge generated through the identification of criminal demands allows law enforcement decision makers to evaluate and choose among the available policing strategies, which best suit the reality they study, and produce the reduction of criminal indices.\n\n\nSocial implications\nIt is possible to infer that by choosing appropriate strategies to combat local crime, the proposed model will increase the population’s sense of safety through an effective reduction in crime.\n\n\nOriginality/value\nThe originality of the study lies in the integration of text mining techniques, LDA and the ELECTRE I method for detecting crime in a given location based on crime reports stored in emergency response databases, enabling identification and choice, from customized policing strategies to particular criminal demands.\n",
        "link": "http://dx.doi.org/10.1108/jm2-10-2018-0166"
    },
    {
        "id": 8481,
        "title": "Understanding Influence of Marketing Thought on Practice: an Analysis of Business Journals Using Textual and Latent Dirichlet Allocation (LDA) Analysis",
        "authors": "Abhishek Borah, Xin Wang, Jun Hyun Ryoo",
        "published": "2018-12",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s40547-018-0089-z"
    },
    {
        "id": 8482,
        "title": "DEVELOPING AN INTEGRATED MODEL BY EMPLOYING LATENT DIRICHLET ALLOCATION (LDA) TO DETECT AND EXTERMINATE SOCIAL SPAM CAMPAIGN LINKED TO PHONE NUMBERS BASED APPROACH",
        "authors": "Hardik Chaudhary, Vipul Goyal",
        "published": "2020-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37648/ijrst.v10i01.008"
    },
    {
        "id": 8483,
        "title": "Results and Methodological Implications of the Digital Epidemiology of Prescription Drug References Among Twitter Users: Latent Dirichlet Allocation (LDA) Analyses",
        "authors": "Maria A Parker, Danny Valdez, Varun K Rao, Katherine S Eddens, Jon Agley",
        "published": "2023-7-28",
        "citations": 2,
        "abstract": "\nBackground\nSocial media is an important information source for a growing subset of the population and can likely be leveraged to provide insight into the evolving drug overdose epidemic. Twitter can provide valuable insight into trends, colloquial information available to potential users, and how networks and interactivity might influence what people are exposed to and how they engage in communication around drug use.\n\n\nObjective\nThis exploratory study was designed to investigate the ways in which unsupervised machine learning analyses using natural language processing could identify coherent themes for tweets containing substance names.\n\n\nMethods\nThis study involved harnessing data from Twitter, including large-scale collection of brand name (N=262,607) and street name (N=204,068) prescription drug–related tweets and use of unsupervised machine learning analyses (ie, natural language processing) of collected data with data visualization to identify pertinent tweet themes. Latent Dirichlet allocation (LDA) with coherence score calculations was performed to compare brand (eg, OxyContin) and street (eg, oxys) name tweets.\n\n\nResults\nWe found people discussed drug use differently depending on whether a brand name or street name was used. Brand name categories often contained political talking points (eg, border, crime, and political handling of ongoing drug mitigation strategies). In contrast, categories containing street names occasionally referenced drug misuse, though multiple social uses for a term (eg, Sonata) muddled topic clarity.\n\n\nConclusions\nContent in the brand name corpus reflected discussion about the drug itself and less often reflected personal use. However, content in the street name corpus was notably more diverse and resisted simple LDA categorization. We speculate this may reflect effective use of slang terminology to clandestinely discuss drug-related activity. If so, straightforward analyses of digital drug-related communication may be more difficult than previously assumed. This work has the potential to be used for surveillance and detection of harmful drug use information. It also might be used for appropriate education and dissemination of information to persons engaged in drug use content on Twitter.\n",
        "link": "http://dx.doi.org/10.2196/48405"
    },
    {
        "id": 8484,
        "title": "Detecting Outliers in CI/CD Pipeline Logs Using Latent Dirichlet Allocation",
        "authors": "Daniel Atzberger, Tim Cech, Willy Scheibel, Rico Richter, Jürgen Döllner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011858500003464"
    },
    {
        "id": 8485,
        "title": "PEMODELAN TOPIK PADA KELUHAN PELANGGAN MENGGUNAKAN ALGORITMA LATENT DIRICHLET ALLOCATION  DALAM MEDIA SOSIAL TWITTER",
        "authors": "Diandra Zakeshia Tiara Kannitha, Mustafid Mustafid, Puspita Kartikasari",
        "published": "2022-8-28",
        "citations": 0,
        "abstract": "Large scale social restrictions (PSBB) is a policy issued by the Government of Indonesia as one of the efforts to reduce the spread of the Covid-19 virus. The impact of the policy is that it requires people to conduct activities online . This makes the internet users in Indonesia in the year 2020 up to 73.7%. Each provider must be able to determine strategies in order to maintain the quality of service and customer loyalty. Good reputation for the company is also important, so customers want to use internet services through their company. One of them is by listening to the complaints of the customers towards the company. In this research, modeling the topic of customer complaints carried out using the Latent Dirichlet Allocation Algorithm. The Latent Dirichlet Allocation Algorithm was chosen because the method has good performance. The topic modelling process is carried out using the gibbs sampling estimation. The topic that is often complained to First Media is that internet was turns off while working, while for IndiHome is that the internet often turns off and disconnect. Based on the results of the interpretation, 70% for First Media and 81,81% for IndiHome that these topics had been in accordance with what is complained by customers through their tweets. From the topic that have been known, it can be used as an evaluation for their company in order to maintain service quality and customer loyalty",
        "link": "http://dx.doi.org/10.14710/j.gauss.v11i2.35474"
    },
    {
        "id": 8486,
        "title": "Latent Dirichlet Allocation Based Acoustic Data Selection for Automatic Speech Recognition",
        "authors": "Mortaza Doulaty, Thomas Hain",
        "published": "2019-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2019-1797"
    },
    {
        "id": 8487,
        "title": "Latent Dirichlet Allocation in Predicting Clinical Trial Terminations",
        "authors": "Simon Geletta, Lendie Follett, Marcia R Laugerman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground: This study used natural language processing (NLP) and machine learning (ML) techniques to identify reliable patterns from within research narrative documents to distinguish studies that complete successfully, from the ones that terminate. Recent research findings have reported that at least ten percent of all studies that are funded by major research funding agencies terminate without yielding useful results. Since it is well-known that scientific studies that receive funding from major funding agencies are carefully planned, and rigorously vetted through the peer-review process, it was somewhat daunting to us that study-terminations are this prevalent. Moreover, our review of the literature about study terminations suggested that the reasons for study terminations are not well understood. We therefore aimed to address that knowledge gap, by seeking to identify the factors that contribute to study failures.Method: We used data from the clinicialTrials.gov repository, from which we extracted both structured data (study characteristics), and unstructured data (the narrative description of the studies). We applied natural language processing techniques to the unstructured data to quantify the risk of termination by identifying distinctive topics that are more frequently associated with trials that are terminated and trials that are completed. We used the Latent Dirichlet Allocation (LDA) technique to derive 25 “topics” with corresponding sets of probabilities, which we then used to predict study-termination by utilizing random forest modeling. We fit two distinct models – one using only structured data as predictors and another model with both structured data and the 25 text topics derived from the unstructured data.Results: In this paper, we demonstrate the interpretive and predictive value of LDA as it relates to predicting clinical trial failure. The results also demonstrate that the combined modeling approach yields robust predictive probabilities in terms of both sensitivity and specificity, relative to a model that utilizes the structured data alone.Conclusions: Our study demonstrated that the use of topic modeling using LDA significantly raises the utility of unstructured data in better predicating the completion vs. termination of studies. This study sets the direction for future research to evaluate the viability of the designs of health studies.",
        "link": "http://dx.doi.org/10.21203/rs.2.12904/v3"
    },
    {
        "id": 8488,
        "title": "Latent Dirichlet Allocation in Predicting Clinical Trial Terminations",
        "authors": "Simon Geletta, Lendie Follett, Marcia R Laugerman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis study used natural language processing (NLP) and machine learning (ML) techniques to identify reliable patterns from within research narrative documents to distinguish studies that complete successfully, from the ones that terminate. Recent research findings have reported that at least ten percent of all studies that are funded by major research funding agencies terminate without yielding useful results. Since it is well-known that scientific studies that receive funding from major funding agencies are carefully planned, and rigorously vetted through the peer-review process, it was somewhat daunting to us that study-terminations are this prevalent. Moreover, our review of the literature about study terminations suggested that the reasons for study terminations are not well understood. We therefore aimed to address that knowledge gap, by seeking to identify the factors that contribute to study failures.Method: We used data from the clinicialTrials.gov repository, from which we extracted both structured data (study characteristics), and unstructured data (the narrative description of the studies). We applied natural language processing techniques to the unstructured data to quantify the risk of termination by identifying distinctive topics that are more frequently associated with trials that are terminated and trials that are completed. We used the Latent Dirichlet Allocation (LDA) technique to derive 25 “topics” with corresponding sets of probabilities, which we then used to predict study-termination by utilizing random forest modeling. We fit two distinct models – one using only structured data as predictors and another model with both structured data and the 25 text topics derived from the unstructured data.Results: In this paper, we demonstrate the interpretive and predictive value of LDA as it relates to predicting clinical trial failure. The results also demonstrate that the combined modeling approach yields robust predictive probabilities in terms of both sensitivity and specificity, relative to a model that utilizes the structured data alone.Conclusions: Our study demonstrated that the use of topic modeling using LDA significantly raises the utility of unstructured data in better predicating the completion vs. termination of studies. This study sets the direction for future research to evaluate the viability of the designs of health studies.",
        "link": "http://dx.doi.org/10.21203/rs.2.12904/v4"
    },
    {
        "id": 8489,
        "title": "Latent Dirichlet Allocation in Predicting Clinical Trial Terminations",
        "authors": "Simon Geletta, Lendie Follett, Marcia R Laugerman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground : This study used natural language processing (NLP) and machine learning (ML) techniques to identify reliable patterns from within research narrative documents to distinguish studies that complete successfully, from the ones that terminate. Recent research findings have reported that at least ten percent of all studies that are funded by major research funding agencies terminate without yielding useful results. Since it is well-known that scientific studies that receive funding from major funding agencies are carefully planned, and rigorously vetted through the peer-review process, it was somewhat daunting to us that study-terminations are this prevalent. Moreover, our review of the literature about study terminations suggested that the reasons for study terminations are not well understood. We therefore aimed to address that knowledge gap, by seeking to identify the factors that contribute to study failures.\n\nMethod : We used data from the clinicialTrials.gov repository, from which we extracted both structured data (study characteristics), and unstructured data (the narrative description of the studies). We applied natural language processing techniques to the unstructured data to quantify the risk of termination by identifying distinctive topics that are more frequently associated with trials that are terminated and trials that are completed. We used the Latent Dirichlet Allocation (LDA) technique to derived 25 “topics” with corresponding sets of probabilities, which we then used to predict study-termination by utilizing random forest modeling. We fit two distinct models – one using only structured data as predictors and another model with both structured data and the 25 text topics derived from the unstructured data.\n\nResults : In this paper, we demonstrate the interpretive and predictive value of LDA as it relates to predicting clinical trial failure. The results also demonstrate that the combined modeling approach yields robust predictive probabilities in terms of both sensitivity and specificity, relative to a model that utilizes the structured data alone.\n\nConclusions : Our study demonstrated that the use of topic modeling using LDA significantly raises the utility of unstructured data in better predicating the completion vs. termination of studies.",
        "link": "http://dx.doi.org/10.21203/rs.2.12904/v2"
    },
    {
        "id": 8490,
        "title": "Latent Dirichlet Allocation in Predicting Clinical Trial Failures",
        "authors": "Simon Geletta, Lendie Follett, Marcia R Laugerman",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nBackground : This study used natural language processing (NLP) and machine learning (ML) techniques to identify reliable patterns from within research narrative documents to distinguish studies that complete successfully, from the ones that terminate. Recent research findings have reported that at least ten percent of all studies that are funded by major research funding agencies terminate without yielding useful results. Since it is well-known that scientific studies that receive funding from major funding agencies are carefully planned, and rigorously vetted through the peer-review process, it was somewhat daunting to us that study-terminations are this prevalent. Moreover, our review of the literature about study terminations suggested that the reasons for study terminations are not well understood. We therefore aimed to address that knowledge gap, by seeking to identify the factors that contribute to study failures.\nMethod : We used data from the clinicialTrials.gov repository, from which we extracted both structured data (study characteristics), and unstructured data (the narrative description of the studies). We applied natural language processing techniques to the unstructured data to quantify the risk of termination by identifying distinctive topics that are more frequently associated with trials that are terminated and trials that are completed. We used the Latent Dirichlet Allocation (LDA) technique to derived 25 “topics” with corresponding sets of probabilities, which we then used to predict study-termination by utilizing random forest modeling. We fit two distinct models – one using only structured data as predictors and another model with both structured data and the 25 text topics derived from the unstructured data.\nResults : In this paper, we demonstrate the interpretive and predictive value of LDA as it relates to predicting clinical trial failure. The results also demonstrate that the combined modeling approach yields robust predictive probabilities in terms of both sensitivity and specificity, relative to a model that utilizes the structured data alone.\nConclusions : Our study demonstrated that the use of topic modeling using LDA significantly raises the utility of unstructured data in better predicating the completion vs. termination of studies.",
        "link": "http://dx.doi.org/10.21203/rs.2.12904/v1"
    },
    {
        "id": 8491,
        "title": "Speeding up calibration of latent Dirichlet allocation model to improve topic analysis in software engineering",
        "authors": "Jorge Arturo Lopez",
        "published": "No Date",
        "citations": 0,
        "abstract": "Extraction of topics from large text corpuses helps improve Software Engineering (SE) processes. Latent Dirichlet Allocation (LDA) represents one of the algorithmic  tools to understand, search, exploit, and summarize a large corpus of data (documents), and it is often used to perform such analysis. However, calibration of the models is computationally expensive, especially if iterating over a large number of topics. Our goal is to create a simple formula allowing analysts to estimate the number of topics, so that the top X topics include the desired proportion of documents under study. We derived the formula from the empirical analysis of three SE-related text corpuses. We believe that practitioners can use our formula to expedite LDA analysis. The formula is also of interest to theoreticians, as it suggests that different SE text corpuses have similar underlying properties.",
        "link": "http://dx.doi.org/10.32920/ryerson.14665455.v1"
    },
    {
        "id": 8492,
        "title": "Understanding vaccine hesitancy with application of Latent Dirichlet Allocation to Reddit Corpora",
        "authors": "Samuel Duraivel, Lavanya R",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nThis research paper explores the underlying factors that contribute toward vaccine hesitancy, resistance, and refusal. Using Latent Dirichlet Allocation (LDA), an unsupervised generative-probabilistic model, we generated latent topics from user generated Reddit corpora on reasons for Vaccine hesitancy. Although we hoped to explore the grounds for vaccine hesitancy across the globe, our findings suggest that the corpus used for analysis had been generated by users living predominantly in the United States.Observation of the topics generated by the LDA model led to the discovery of the following latent factors: (i) fear of risks and side effects, (ii) lack of trust in policymakers, (iii) related to religious belief, (iv) related to mass surveillance theories, (v) perception of vaccination as a precedence to totalitarianism, (vi) racial background pertaining to retrospective events of racial injustice, such as selective sterilization, (vii) depopulation agenda fueled by theories affiliated to Global warming and extinction rebellion, (viii) and perception of vaccination as a campaign to quell immigrant population growth, fueled by reports of coerced sterilization of immigrants in the ICE detention.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-616664/v1"
    },
    {
        "id": 8493,
        "title": "Speeding up calibration of latent Dirichlet allocation model to improve topic analysis in software engineering",
        "authors": "Jorge Arturo Lopez",
        "published": "No Date",
        "citations": 0,
        "abstract": "Extraction of topics from large text corpuses helps improve Software Engineering (SE) processes. Latent Dirichlet Allocation (LDA) represents one of the algorithmic  tools to understand, search, exploit, and summarize a large corpus of data (documents), and it is often used to perform such analysis. However, calibration of the models is computationally expensive, especially if iterating over a large number of topics. Our goal is to create a simple formula allowing analysts to estimate the number of topics, so that the top X topics include the desired proportion of documents under study. We derived the formula from the empirical analysis of three SE-related text corpuses. We believe that practitioners can use our formula to expedite LDA analysis. The formula is also of interest to theoreticians, as it suggests that different SE text corpuses have similar underlying properties.",
        "link": "http://dx.doi.org/10.32920/ryerson.14665455"
    },
    {
        "id": 8494,
        "title": "Exploring Customer comments using Latent Dirichlet Allocation",
        "authors": "Rashmi Batra, Dhanya Pramod",
        "published": "2021-12-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/punecon52575.2021.9686484"
    },
    {
        "id": 8495,
        "title": "The Prediction of Long-Term Survival of Artificial Intelligence Patents Based on Deep-Learning and Latent Dirichlet Allocation Modeling",
        "authors": "Taehyun Ha, Jae-Min Lee, Chang-Hoan Lee, Byoung-Youl Coh",
        "published": "2021-3-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37793/itpr.28.1.2"
    },
    {
        "id": 8496,
        "title": "Elucidation of qualitative patient-reported outcome (PRO) data using latent dirichlet allocation (LDA) in patients (pts) undergoing radical cystectomy.",
        "authors": "Thomas Michael Atkinson, Bruce D. Rapkin, Elizabeth Schofield, Bernard H. Bochner, Yuelin Li",
        "published": "2019-5-20",
        "citations": 0,
        "abstract": " e18245  Background: As PROs become commonplace in clinical trials and routine care, we must identify efficient analytic methods to better understand and ultimately integrate this information into clinical decision-making. While PROs are often captured via qualitative methods to provide context and pt voice to traditional objective and/or quantitative assessments, the current analytic standard is resource intensive and impractical for timely delivery of this information to clinicians and trialists. To address this problem, we propose the use of LDA, a natural language processing technique that automates the distillation of vast amounts of free-text data into underlying topics. Methods: As part of a prospective longitudinal trial of pts ( N = 200; M age = 63.8; 20% female; 46%) undergoing radical cystectomy (52% stage T2-T4) and urinary diversion (49% continent) for bladder cancer (ClinicalTrials.gov identifier NCT00745355), pts completed 30 minute interviews at baseline and 6-months post-surgery where they were asked to characterize their quality of life with respect to goals or milestones they would like to reach, problems they would like to solve, situations they would like to prevent, things they would like to remain the same, and commitments they would be willing to let go. LDA was used to extract latent topics and themes, stratified by time. Results: LDA extracted 7 latent topics and showed shifting patient priorities. At baseline, pt primary concerns were related to surgery and recovery. Six months post-surgery, pt goals transitioned toward themes related to concerns about cancer recurrence, regaining a sense of normalcy, return to work, enjoyment of life and increased appreciation of friends and family. Conclusions: LDA was used as an automated tool to illustrate a shift in pt goals and concerns as they transition into survivorship. This novel data analytic technique offers the possibility of significantly reducing the resources required to summarize qualitative PRO data. As such, this information may now be more readily available for immediate inclusion in the decision-making process as part of routine care and clinical trials. Clinical trial information: NCT00745355. ",
        "link": "http://dx.doi.org/10.1200/jco.2019.37.15_suppl.e18245"
    },
    {
        "id": 8497,
        "title": "Latent Dirichlet Allocation and POS Tags Based Method for External Plagiarism Detection",
        "authors": "Ali Daud, Jamal Ahmad Khan, Jamal Abdul Nasir, Rabeeh Ayaz Abbasi, Naif Radi Aljohani, Jalal S Alowibdi",
        "published": "2019",
        "citations": 1,
        "abstract": "In this article we present a new semantic and syntactic-based method for external plagiarism detection. In the proposed approach, latent dirichlet allocation (LDA) and parts of speech (POS) tags are used together to detect plagiarism between the sample and a number of source documents. The basic hypothesis is that considering semantic and syntactic information between two text documents may improve the performance of the plagiarism detection task. Our method is based on two steps, naming, which is a pre-processing where we detect the topics from the sentences in documents using the LDA and convert each sentence in POS tags array; then a post processing step where the suspicious cases are verified purely on the basis of semantic rules. For two types of external plagiarism (copy and random obfuscation), we empirically compare our approach to the state-of-the-art N-gram based and stop-word N-gram based methods and observe significant improvements.",
        "link": "http://dx.doi.org/10.4018/978-1-5225-8057-7.ch015"
    },
    {
        "id": 8498,
        "title": "Accuracy of Unit Under Test Identification Using Latent Semantic Analysis and Latent Dirichlet Allocation",
        "authors": "Matej Madeja, Jaroslav Poruban",
        "published": "2019-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/informatics47936.2019.9119262"
    },
    {
        "id": 8499,
        "title": "Unveiling Latent Topics in Robotic Process Automation - an Approach Based on Latent Dirichlet Allocation Smart Review",
        "authors": "Petr Průcha, Peter Madzík, Lukáš Falát, Hajo  A. Reijers",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4691815"
    },
    {
        "id": 8500,
        "title": "Analysis of research trends using Latent Dirichlet Allocation for geologic subdisciplines in South Korea",
        "authors": "Taeyong Kim, Minjune Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "\n        &lt;p&gt;Since the mid-twentieth century, geology in South Korea has considerably advanced as a scientific discipline. Over the past few decades, geology has interacted with physical or engineering viewpoints. So, modern geology needs to be interpreted with an interdisciplinary perspective. This study aimed to classify geology&amp;#8217;s academic subdisciplines in Korean and analyze&amp;#160;the evolutionary trend of each subdiscipline in South Korea for 54 years from 1964 through 2018. In preprocessing, we collected 13,266 titles from 10 of Korean geological journals and deleted the words that do not require. After that, we classified geologic subdisciplines by Latent Dirichlet Allocation (LDA), a good tool to find topics in text data. According to the result of this study, the optimal number of subdisciplines in LDA was nine (mineralogy, petrology, sedimentology, economic geology, geotechnical engineering, engineering geology, environmental geology, geophysics, seismology). We then calculated the annual proportion from each subdiscipline to investigate evolutionary trends using polynomial regression. Results showed that mineralogy, petrology, sedimentology, and economic geology proportions increased in 1980. Geotechnical engineering and engineering geology proportions increased in 1990. Environmental geology, geophysics, and seismology proportions increased in 1995. The results of this study fill an important gap in understanding the research trends of geologic subdisciplines in South Korea, showing their emergence, growth and diminution.&lt;/p&gt;\n        ",
        "link": "http://dx.doi.org/10.5194/egusphere-egu2020-21204"
    }
]