[
    {
        "id": 6401,
        "title": "INNOVATIVE APPROACH FOR TEACHING THE RECEIVER OPERATING CHARACTERISTIC (ROC) CURVE",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48009/3_iis_2023_109"
    },
    {
        "id": 6402,
        "title": "Introduction to Receiver Operating Characteristic (ROC) Curves",
        "authors": "Stefan Tigges",
        "published": "2021-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.53347/rid-94498"
    },
    {
        "id": 6403,
        "title": "The receiver operating characteristic (ROC) curve",
        "authors": "Shengping Yang, Gilbert Berdine",
        "published": "2017-5-5",
        "citations": 128,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12746/swrccc.v5i19.391"
    },
    {
        "id": 6404,
        "title": "The walking man approach to interpreting the receiver operating characteristic curve and area under the receiver operating characteristic curve",
        "authors": "Michael A. Kohn, Thomas B. Newman",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jclinepi.2023.07.020"
    },
    {
        "id": 6405,
        "title": "RECEIVER OPERATING CHARACTERISTIC (ROC) ANALYSIS",
        "authors": "Elizabeth Anne Krupinski",
        "published": "2017-7-14",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14786/flr.v5i2.250"
    },
    {
        "id": 6406,
        "title": "Using Receiver Operating Characteristic (ROC) Analysis to Evaluate Information -Based Decision-Making",
        "authors": "Nan Hu",
        "published": "2018",
        "citations": 0,
        "abstract": "Business operators and stakeholders often need to make decisions such as choosing between A and B, or between yes and no, and these decisions are often made by using a classification tool or a set of decision rules. Decision tools usually include scoring systems, predictive models, and quantitative test modalities. In this chapter, we introduce the receiver operating characteristic (ROC) curves and demonstrate, through an example of bank decision on granting loans to customers, how ROC curves can be used to evaluate decision making for information based decision making. In addition, an extension to time-dependent ROC analysis is introduced in this chapter. We conclude this chapter by illustrating the application of ROC analysis in information based decision making and providing the future trends of this topic. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-2255-3.ch192"
    },
    {
        "id": 6407,
        "title": "Bayesian model for the receiver operating characteristic curve using the skew normal distribution",
        "authors": "Eun Jin Jang, Dal Ho Kim",
        "published": "2021-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7465/jkdi.2021.32.1.15"
    },
    {
        "id": 6408,
        "title": "Use of Receiver Operating Characteristic (ROC) Curve Analysis for Tyrer-Cuzick and Gail in Breast Cancer Screening in Jiangxi Province, China",
        "authors": "Le Zhang, Zhigang Jie, Shengxi Xu, Liqun Zhang, Xiangqu Guo",
        "published": "2018-8-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12659/msm.910108"
    },
    {
        "id": 6409,
        "title": "Receiver Operating Characteristic (ROC) Analysis of Image Search-and-Localize Tasks",
        "authors": "Yulei Jiang",
        "published": "2020-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.acra.2019.12.020"
    },
    {
        "id": 6410,
        "title": "Receiver Operating Characteristic Curve for Complex Survey Data",
        "authors": "Tamy H. M. Tsujimoto, Jianwen Cai",
        "published": "2026",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5705/ss.202022.0290"
    },
    {
        "id": 6411,
        "title": "Empirical Likelihood Application to Receiver Operating Characteristic Curve Analysis",
        "authors": "Albert Vexler, Jihnhee Yu",
        "published": "2018-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351001526-8"
    },
    {
        "id": 6412,
        "title": "The Utility of Receiver Operating Characteristic Curve in Educational Assessment: Performance Prediction",
        "authors": "Hyunsuk Han",
        "published": "2022-4-30",
        "citations": 5,
        "abstract": "When examinees are classified into groups based on scores from educational assessment, two indices are widely used to gauge the psychometric quality of the classifications: accuracy and consistency. The two indices take correct classifications into consideration while overlooking incorrect ones, where unbalanced class distribution threatens the validity of results from the accuracy and consistency indices. The single values produced from the two indices also fail to address the inconsistent accuracy of the classifier across different cut score locations. The current study proposed the concept of classification quality, which utilizes the receiver operating characteristics (ROC) graph to comprehensively evaluate the performance of classifiers. The ROC graph illustrates the tradeoff between benefits (true positive rate) and costs (false positive rate) in classification. In this article, a simulation study was conducted to demonstrate how to generate and interpret ROC graphs in educational assessment and the benefits of using ROC graphs to interpret classification quality. The results show that ROC graphs provide an efficient approach to (a) visualize the fluctuating performance of scoring classifiers, (b) address the unbalanced class distribution issue inherent in the accuracy and consistency indices, and (c) produce more accurate estimation of the classification results.",
        "link": "http://dx.doi.org/10.3390/math10091493"
    },
    {
        "id": 6413,
        "title": "Fundamentals of Receiver Operating Characteristic Curve Analyses",
        "authors": "Albert Vexler, Alan D. Hutson, Xiwei Chen",
        "published": "2017-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b20224-8"
    },
    {
        "id": 6414,
        "title": "Modernising Receiver Operating Characteristic (ROC) Curves",
        "authors": "Leslie R. Pendrill, Jeanette Melin, Anne Stavelin, Gunnar Nordin",
        "published": "2023-5-13",
        "citations": 2,
        "abstract": "The justification for making a measurement can be sought in asking what decisions are based on measurement, such as in assessing the compliance of a quality characteristic of an entity in relation to a specification limit, SL. The relative performance of testing devices and classification algorithms used in assessing compliance is often evaluated using the venerable and ever popular receiver operating characteristic (ROC). However, the ROC tool has potentially all the limitations of classic test theory (CTT) such as the non-linearity, effects of ordinality and confounding task difficulty and instrument ability. These limitations, inherent and often unacknowledged when using the ROC tool, are tackled here for the first time with a modernised approach combining measurement system analysis (MSA) and item response theory (IRT), using data from pregnancy testing as an example. The new method of assessing device ability from separate Rasch IRT regressions for each axis of ROC curves is found to perform significantly better, with correlation coefficients with traditional area-under-curve metrics of at least 0.92 which exceeds that of linearised ROC plots, such as Linacre’s, and is recommended to replace other approaches for device assessment. The resulting improved measurement quality of each ROC curve achieved with this original approach should enable more reliable decision-making in conformity assessment in many scenarios, including machine learning, where its use as a metric for assessing classification algorithms has become almost indispensable.",
        "link": "http://dx.doi.org/10.3390/a16050253"
    },
    {
        "id": 6415,
        "title": "Receiver Operating Characteristic (ROC) Analysis",
        "authors": "J.F. Mas",
        "published": "2018",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-60801-3_30"
    },
    {
        "id": 6416,
        "title": "Matrix variate receiver operating characteristic curve for binary classification",
        "authors": "G. Siva",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/02331888.2024.2320912"
    },
    {
        "id": 6417,
        "title": "Diagnostic Value of IL-4, IL-10 and IL-12 in Detection of Hepatic Hydatid Cyst Using Receiver Operating Characteristic Curve",
        "authors": "Qasim Al-Mayah, Ahmed Obeid, Fatima Abood",
        "published": "2018-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22207/jpam.12.2.24"
    },
    {
        "id": 6418,
        "title": "A Brief Review of Receiver Operating Characteristic Curve Analyses",
        "authors": "Albert Vexler, Alan D. Hutson",
        "published": "2018-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/b21899-7"
    },
    {
        "id": 6419,
        "title": "Deep Learning Evaluation Using Receiver Operating Curve (ROC) for Footprint Biometric Authentication",
        "authors": "Sairul Izwan Safie, Rusmawarni Ramli, Zulhaimi Mohamad",
        "published": "2022-9-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsima55652.2022.9929060"
    },
    {
        "id": 6420,
        "title": "An Evaluation of Receiver Operating Curve (ROC) For ABCG5/G8 Transporters Serum as Diagnostic Test in Patient with Hepatobiliary Diseases",
        "authors": "",
        "published": "2020-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/ijpr/2020.12.01.333"
    },
    {
        "id": 6421,
        "title": "An Employing Receiver Operating Characteristic (ROC), Probability Sensitivity and Specificity to Determine Significant Influencers",
        "authors": "Azzah Hazem Zaki",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "Estimates may be susceptible to uncertainty in the sensitivity and specificity of the test when determining the existence of a challenge. Bayesian inference is a logical method of propagating these uncertainties, whereas hierarchical modelling captures the variation of these parameters across experiments. These two techniques are employed in conjunction with Bayesian inference. Statistic adjustments cannot compensate for selection bias in a sample without making significant assumptions; however, multilevel regression and poststratification can at least account for known differences between models. Finding essential drivers in regression modelling through the use of Bayesian sensitivity-specificity and the receiver-employing feature is recommended in this paper, and findings that are easily interpretable are obtained as a result. The results of numerical evaluations of various methodologies indicate that this approach may help implement the principles of statistical modelling and assessment, thereby aiding scientists and executives in the process of making meaningful decisions.",
        "link": "http://dx.doi.org/10.9756/iajss/v10i1/iajss1003"
    },
    {
        "id": 6422,
        "title": "Sojourn-time-corrected receiver operating characteristic curve (ROC) for prostate specific antigen (PSA) test in population-based prostate cancer screening",
        "authors": "Hsiao-Hsuan Jen, Wei-Jung Chang, Chen-Yang Hsu, Amy Ming-Fang Yen, Anssi Auvinen, Tony Hsiu-Hsi Chen, Sam Li-Sheng Chen",
        "published": "2020-11-26",
        "citations": 1,
        "abstract": "AbstractEvaluating the performance of serum prostate-specific antigen (PSA) test in population-based screening with receiver operating characteristics (ROC) curve often neglects the time dimension. Asymptomatic cases with negative PSA test would have been missed if sojourn time is not taken into account to allow for cases surfacing into the clinical phase. Data included 20,796 men with PSA test at the first screening round was used from population-based Finnish prostate cancer screening trial during 1996–1999. Cancers detected at the first screen, together with interval cancers ascertained during 4-year follow-up were expediently used to estimate sensitivity and specificity. A sojourn-time-corrected model was applied to estimating the possible false negative cases for those with PSA < 4 ng/ml for correcting the ROC curve. The estimated sensitivity estimate was reduced from 94.4% without correction to 68.8% with correction but the estimated specificity was identical (89.4% vs. 89.2%) at cutoff of 3 ng/ml. The corrected area under curve (AUC) [77.0% (74.9–79.1%)] of the PSA test was significantly lower than the uncorrected AUC [95.9% (95.3–96.6%)]. The failure of considering the time since last negative screen due to incomplete ascertainment for asymptomatic cancer led to the overestimation of PSA test performance that further affects the cut-off value of PSA tests for population-based prostate cancer screening.",
        "link": "http://dx.doi.org/10.1038/s41598-020-77668-w"
    },
    {
        "id": 6423,
        "title": "Application of Receiver Operating Characteristic (ROC) Curve to Determine the Diagnostic Ability of A Validated Ten - Item Questionnaire (SS - 10) In Estimating the Prevalence of Sensitive Skin in Hong Kong Population",
        "authors": "Kam Tim Michael Chan, Amy Ho Nam Cheung",
        "published": "2019-7-10",
        "citations": 0,
        "abstract": "Sensitive skin is a complex skin condition with patients presented mainly subjective neurological symptoms. Prevalence of sensitive skin across populations vary from 13% in Chinese cities to a three-fold higher in American and European countries. Our study aims to develop a cutoff value using the Receiver Operating Characteristics curve in clinical sample in Hong Kong and examine the prevalence of sensitive skin in a community sample across five districts of Hong Kong. Method: The first group of participants consisted of a total of 1,111 new clinic attendees in a local clinic in Kowloon area of Hong Kong. The second group of data was collected from 500 community samples across 5 areas of Hong Kong, with the geographic characteristics ranging from highly to less populated. Participants filled in a questionnaire which contained their demographic information as well as the 10-item version of Sensitive Skin Scale (SS-10). For the clinical sample, a dermatologist diagnosed all the participants for sensitive skin and identified 84 cases (7.56%) of true sensitive skin. Results and conclusion: The Area Under the Curve (AUC) of 0.866 of the ROC curve suggested a good diagnostic ability of SS-10 in population of Hong Kong. A cutoff value of 25.5 with a sensitivity of 91.7% and specificity of 75.5% gave rise to 11.4% of prevalence of sensitive skin in the community sample, which is coherent with that in Mainland China. The study may have significant clinical implications for SS-10 to be a standardized and cost-effective screening tool in Asian populations.",
        "link": "http://dx.doi.org/10.23958/ijirms/vol04-i07/691"
    },
    {
        "id": 6424,
        "title": "Supplemental Material for The Receiver Operating Characteristic Area Under the Curve (or Mean Ridit) as an Effect Size",
        "authors": "",
        "published": "2023-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1037/met0000601.supp"
    },
    {
        "id": 6425,
        "title": "Receiver Operating Curve (ROC) analysis for fluorosis using simple blood parameter neutrophil lymphocyte ratio",
        "authors": "S. Gupta, A. N. Poddar, C. Kumar, S. Pervez",
        "published": "2022-10-15",
        "citations": 1,
        "abstract": "The study aims to assess the preclinical stage of fluorosis i.e. Non skeletal fluorosis in human populations using a simple blood parameter, Neutrophil Lymphocyte Ratio as a predictive tool and includes different fluorosis categories (Dental, Skeletal & Non skeletal) surveyed out in the endemic villages and compared with the control population of non endemic area. Study Populations belonging to endemic villages Kowataal, Fulsar, Mahuapaani, Korbi and Amatikra within the block Podi uproda, distt. Korba situated in Chhattisgarh state of central India were cross sectionally studied. Segregation was done on the basis of Suspect (non-symptomatic) and Confirmed (Dental and Skeletal) cases of fluorosis and neutrophil to lymphocyte ratio calculated. A total 180 individuals were included in the study, out of which 67.33 % were confirmed cases of fluorosis. A significant decline in neutrophil to lymphocyte ratio was observed upon chronic fluoride ingestion. In the Receiver Operating Characteristic curve analysis of obtained NL ratios, the overall cut off value for fluorosis was obtained as ≤ 2.379 in the selected endemic region irrespective of symptoms of fluorosis i.e. dental or skeletal. The results concluding that The NL ratio can be used as a simple parameter for preclinical identification of fluorosis in fluoride exposed populations. However, urine and blood fluoride analyses of the subjects are also needed for further confirmation.",
        "link": "http://dx.doi.org/10.51470/bca.2022.22.2.3969"
    },
    {
        "id": 6426,
        "title": "Receiver Operating Characteristic (ROC) Analysis on the Wheel Impact Load Detector System of Metro-North Railroad",
        "authors": "Monique Stewart, Hamed Pouryousef, Brian Marquis, Som P. Singh, Demet Cakdi",
        "published": "2018-4-18",
        "citations": 0,
        "abstract": "The Federal Railroad Administration (FRA) has partnered with Metro-North Railroad (MNR), Long Island Rail Road (LIRR) and New York & Atlantic Railway (NYA) to enhance operational safety through the implementation of wayside detection systems.\nCurrently, MNR has a four-track Wheel Impact Load Detector (WILD) system that has been operating since 2010 near the Grand Central Terminal. This paper discusses a Receiver Operating Characteristic (ROC) analysis of this existing WILD system in conjunction with the wheel maintenance practices since 2010.\nCurrently MNR’s operating procedures require a car with wheel(s) exhibiting a vertical peak load/mean load ratio, called dynamic ratio (DR), ≥3.0 to be shopped for repair. The analysis, using a 30-day repair window after detection, shows that 84% of the cars shopped for wheel(s) with DR≥3.0 required valid maintenance repairs.\nThe minimum number of total false records (false positive + false negative records, combined) were observed within the DR range of 2.7–2.8 when considering wheel flat defects only. An analysis of the false negative records inclusive of both flat and shell spots, showed that the minimum number of false records dropped slightly to a DR range of 2.6–2.7. The reported ROC analysis shows that MNR’s current DR≥3.0 to trigger inspection and maintenance actions is reasonable.",
        "link": "http://dx.doi.org/10.1115/jrc2018-6202"
    },
    {
        "id": 6427,
        "title": "Receiver operating characteristic (ROC) curves: review of methods with applications in diagnostic medicine",
        "authors": "Nancy A Obuchowski, Jennifer A Bullen",
        "published": "2018-3-29",
        "citations": 246,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1361-6560/aab4b1"
    },
    {
        "id": 6428,
        "title": "Evaluation of fault detection techniques using receiver operating characteristic curve",
        "authors": "Thiago Cabral de Souza, Paulo Victor Padrão Lopes, Wladimir Pinheiro, Yago Pessanha Corrêa, Alexandre Carvalho Leite",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26678/abcm.diname2019.din2019-0064"
    },
    {
        "id": 6429,
        "title": "Research of Harmonics in Power System Signal using Gaussian’s Distribution Overlapping by Receiver Operating Characteristics (Roc) Curve",
        "authors": "",
        "published": "2019-9-17",
        "citations": 0,
        "abstract": "Harmonic analysis of the power system signal is a proliferating research in the field of electronics technology. Whenever, we analyze odd and ever harmonics are present in the signal, imperative operation is needed to transform from the time domain to the frequency domain. Hence, all the researchers are utilizing the Fourier Transform technique is very effective for the analysis of odd and even harmonics in the frequency domain. In the past two decades, Wavelet Transform is a wonderful technique to analyze the harmonics both frequency and time domain as well. The analysis of harmonic and its probability distribution are most important for the purpose to predict the harmonic effects in the present situation. We treated all the harmonics and its corresponding frequency distribution are considered as a zero mean unit variance. The overlapping these distributions (small, medium, large) are analyzed with help of statistical data processing technique. It is one of the most important basic plots in the decision theory and it provides the constructive decision about the overlapping of a frequency distribution in power system signal. The curvature as a plot of sensitivity and specificity underlying the harmonics are present and not present distributive (Gaussian). The above determined values are lying in the interval probability [0, 1] and it is depends only the nature of the dataset. In this paper, we explained with help of MATLAB and level of understand the basic concept of ROC is demonstrated. The dataset is drawn from the example of odd and even harmonics are generated and the probability distribution as input to our MATLAB program.",
        "link": "http://dx.doi.org/10.35940/ijrte.b1018.0882s819"
    },
    {
        "id": 6430,
        "title": "The receiver operating characteristic area under the curve (or mean\n                        ridit) as an effect size.",
        "authors": "Michael Smithson",
        "published": "2023-7-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1037/met0000601"
    },
    {
        "id": 6431,
        "title": "On the Binormal Predictive Receiver Operating Characteristic Curve for the Joint Assessment of Positive and Negative Predictive Values",
        "authors": "Gareth Hughes",
        "published": "2020-5-26",
        "citations": 4,
        "abstract": "The predictive receiver operating characteristic (PROC) curve is a diagrammatic format with application in the statistical evaluation of probabilistic disease forecasts. The PROC curve differs from the more well-known receiver operating characteristic (ROC) curve in that it provides a basis for evaluation using metrics defined conditionally on the outcome of the forecast rather than metrics defined conditionally on the actual disease status. Starting from the binormal ROC curve formulation, an overview of some previously published binormal PROC curves is presented in order to place the PROC curve in the context of other methods used in statistical evaluation of probabilistic disease forecasts based on the analysis of predictive values; in particular, the index of separation (PSEP) and the leaf plot. An information theoretic perspective on evaluation is also outlined. Five straightforward recommendations are made with a view to aiding understanding and interpretation of the sometimes-complex patterns generated by PROC curve analysis. The PROC curve and related analyses augment the perspective provided by traditional ROC curve analysis. Here, the binormal ROC model provides the exemplar for investigation of the PROC curve, but potential application extends to analysis based on other distributional models as well as to empirical analysis.",
        "link": "http://dx.doi.org/10.3390/e22060593"
    },
    {
        "id": 6432,
        "title": "Charles Edgar Metz, Ph.D. (1942–2012): pioneer in receiver operating characteristic (ROC) analysis",
        "authors": "Junji Shiraishi, Kunio Doi",
        "published": "2019-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12194-018-0483-0"
    },
    {
        "id": 6433,
        "title": "Comprehensive Analysis of Receiver Operating Characteristic (ROC) Curves for Hyperspectral Anomaly Detection",
        "authors": "Chein-I Chang",
        "published": "2022",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tgrs.2022.3211786"
    },
    {
        "id": 6434,
        "title": "Evaluating the Effectiveness of Early Warning Indicators: An Application of Receiver Operating Characteristic Curve Approach to Panel Data",
        "authors": "Yusuf Yildirim, Anirban Sanyal",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4041666"
    },
    {
        "id": 6435,
        "title": "Receiver Operating Characteristic Curve of Total Serum IgE in Allergic Patients",
        "authors": "Haitham Bader Fathi",
        "published": "2017-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.33899/mjn.2017.160056"
    },
    {
        "id": 6436,
        "title": "Receiver operating characteristic curve: overview and practical use for clinicians",
        "authors": "Francis Sahngun Nahm",
        "published": "2022-2-1",
        "citations": 252,
        "abstract": "Using diagnostic testing to determine the presence or absence of a disease is essential in clinical practice. In many cases, test results are obtained as continuous values and require a process of conversion and interpretation and into a dichotomous form to determine the presence of a disease. The primary method used for this process is the receiver operating characteristic (ROC) curve. The ROC curve is used to assess the overall diagnostic performance of a test and to compare the performance of two or more diagnostic tests. It is also used to select an optimal cut-off value for determining the presence or absence of a disease. Although clinicians who do not have expertise in statistics do not need to understand both the complex mathematical equation and the analytic process of ROC curves, understanding the core concepts of the ROC curve analysis is a prerequisite for the proper use and interpretation of the ROC curve. This review describes the basic concepts for the correct use and interpretation of the ROC curve, including parametric/nonparametric ROC curves, the meaning of the area under the ROC curve (AUC), the partial AUC, methods for selecting the best cut-off value, and the statistical software to use for ROC curve analyses.",
        "link": "http://dx.doi.org/10.4097/kja.21209"
    },
    {
        "id": 6437,
        "title": "Bifractal receiver operating characteristic curves: a formula for generating receiver operating characteristic curves in credit-scoring contexts",
        "authors": "Błażej Kochański",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21314/jrmv.2020.231"
    },
    {
        "id": 6438,
        "title": "Receiver operating characteristic (ROC) movies, universal ROC (UROC) curves, and coefficient of predictive ability (CPA)",
        "authors": "Tilmann Gneiting, Eva-Maria Walz",
        "published": "2022-8",
        "citations": 5,
        "abstract": "AbstractThroughout science and technology, receiver operating characteristic (ROC) curves and associated area under the curve ($$\\mathrm{AUC}$$AUC) measures constitute powerful tools for assessing the predictive abilities of features, markers and tests in binary classification problems. Despite its immense popularity, ROC analysis has been subject to a fundamental restriction, in that it applies to dichotomous (yes or no) outcomes only. Here we introduce ROC movies and universal ROC (UROC) curves that apply to just any linearly ordered outcome, along with an associated coefficient of predictive ability ($${\\mathrm{CPA}}$$CPA) measure.$${\\mathrm{CPA}}$$CPAequals the area under the UROC curve, and admits appealing interpretations in terms of probabilities and rank based covariances. For binary outcomes$${\\mathrm{CPA}}$$CPAequals$$\\mathrm{AUC}$$AUC, and for pairwise distinct outcomes$${\\mathrm{CPA}}$$CPArelates linearly to Spearman’s coefficient, in the same way that the C index relates linearly to Kendall’s coefficient. ROC movies, UROC curves, and$${\\mathrm{CPA}}$$CPAnest and generalize the tools of classical ROC analysis, and are bound to supersede them in a wealth of applications. Their usage is illustrated in data examples from biomedicine and meteorology, where rank based measures yield new insights in the WeatherBench comparison of the predictive performance of convolutional neural networks and physical-numerical models for weather prediction.",
        "link": "http://dx.doi.org/10.1007/s10994-021-06114-3"
    },
    {
        "id": 6439,
        "title": "Using Receiver Operating Characteristic (ROC) Analysis to Evaluate Information-Based Decision-Making",
        "authors": "Nan Hu",
        "published": "2019",
        "citations": 2,
        "abstract": "Business operators and stakeholders often need to make decisions such as choosing between A and B, or between yes and no, and these decisions are often made by using a classification tool or a set of decision rules. Decision tools usually include scoring systems, predictive models, and quantitative test modalities. In this chapter, the authors introduce the receiver operating characteristic (ROC) curves and demonstrate, through an example of bank decision on granting loans to customers, how ROC curves can be used to evaluate decision making for information-based decision making. In addition, an extension to time-dependent ROC analysis is introduced in this chapter. The authors conclude this chapter by illustrating the application of ROC analysis in information-based decision making and providing the future trends of this topic. ",
        "link": "http://dx.doi.org/10.4018/978-1-5225-7362-3.ch057"
    },
    {
        "id": 6440,
        "title": "Importance of receiver operating characteristic curve and decision curve analysis methods in clinical studies",
        "authors": "Ali Cankut Tatliparmak, Sarper Yilmaz, Rohat Ak",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ajem.2023.06.018"
    },
    {
        "id": 6441,
        "title": "Receiver operating characteristic curve analysis in diagnostic accuracy studies: A guide to interpreting the area under the curve value",
        "authors": "ŞerefKerem Corbacioglu, Gökhan Aksel",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4103/tjem.tjem_182_23"
    },
    {
        "id": 6442,
        "title": "Improper Multivariate Receiver Operating Characteristic (iMROC) Curve",
        "authors": "S Balaswamy, R V. Vardhan, G Sameera",
        "published": "2020-2-20",
        "citations": 0,
        "abstract": "In a multivariate setup, the classification techniques have its significance in identifying the exact status of the individual/observer along with accuracy of the test. One such classification technique is the Multivariate Receiver Operating Characteristic (MROC) Curve. This technique is well known to explain the extent of correct classification with the curve above the random classifier (guessing line) when it satisfies all of its properties especially the property of increasing likelihood ratio function. However, there are circumstances where the curve violates the above property. Such a curve is termed as improper curve. This paper demonstrates the methodology of improperness of the MROC Curve and ways of measuring it. The methodology is explained using real data sets.",
        "link": "http://dx.doi.org/10.19139/soic-2310-5070-555"
    },
    {
        "id": 6443,
        "title": "Determination of Sexual Dimorphism of the Human Sacrum Based on Receiver Operating Characteristic Curve Analysis of Morphometric Parameters",
        "authors": "Sandeep Saluja, Sarika R Tigga, Sushant S Das, Avinash Thakur",
        "published": "2023-5-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7759/cureus.38629"
    },
    {
        "id": 6444,
        "title": "Receiver operating characteristic curve analysis may be helpful to study the prognostic value of miR-155 in B cell non-hodgkin lymphoma",
        "authors": "Long Su",
        "published": "2017-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4274/tjh.2017.0297"
    },
    {
        "id": 6445,
        "title": "Drawing Guidelines for Receiver Operating Characteristic Curve in Preparation of Manuscripts",
        "authors": "Jeehyoung Kim, Il Chan Hwang",
        "published": "2020",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3346/jkms.2020.35.e171"
    },
    {
        "id": 6446,
        "title": "Application of the Bland–Altman and Receiver Operating Characteristic (ROC) Approaches to Study Isotope Effects in Gas Chromatography–Mass Spectrometry Analysis of Human Plasma, Serum and Urine Samples",
        "authors": "Dimitrios Tsikas",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "The Bland–Altman approach is one of the most widely used mathematical approaches for method comparison and analytical agreement. This work describes, for the first time, the application of Bland–Altman to study 14N/15N and 1H/2H (D) chromatographic isotope effects of endogenous analytes of the L-arginine/nitric oxide pathway in human plasma, serum and urine samples in GC-MS. The investigated analytes included arginine, asymmetric dimethylarginine, dimethylamine, nitrite, nitrate and creatinine. There was a close correlation between the percentage difference of the retention times of the isotopologs of the Bland–Altman approach and the area under the curve (AUC) values of the receiver operating characteristic (ROC) approach (r = 0.8619, p = 0.0047). The results of the study suggest that the chromatographic isotope effects in GC-MS result from differences in the interaction strengths of H/D isotopes in the derivatives with the hydrophobic stationary phase of the GC column. D atoms attenuate the interaction of the skeleton of the molecules with the lipophilic GC stationary phase. Differences in isotope effects in plasma or serum and urine in GC-MS are suggested to be due to a kind of matrix effect, and this remains to be investigated in forthcoming studies using Bland–Altman and ROC approaches.",
        "link": "http://dx.doi.org/10.3390/molecules29020365"
    },
    {
        "id": 6447,
        "title": "operating characteristic curve",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5040/9781501365072.11227"
    },
    {
        "id": 6448,
        "title": "On the use of receiver operating characteristic curve analysis to determine the most appropriate p value significance threshold",
        "authors": "Farrokh Habibzadeh",
        "published": "2024-1-4",
        "citations": 0,
        "abstract": "Abstract\nBackground\np value is the most common statistic reported in scientific research articles. Choosing the conventional threshold of 0.05 commonly used for the p value in research articles, is unfounded. Many researchers have tried to provide a reasonable threshold for the p value; some proposed a lower threshold, eg, 0.005. However, none of the proposals has gained universal acceptance. Using the analogy between the diagnostic tests with continuous results and statistical inference tests of hypothesis, I wish to present a method to calculate the most appropriate p value significance threshold using the receiver operating characteristic curve (ROC) analysis.\n\nResults\nAs with diagnostic tests where the most appropriate cut-off values are different depending on the situation, there is no unique cut-off for the p significance threshold. Unlike the previous proposals, which mostly suggest lowering the threshold to a fixed value (eg, from 0.05 to 0.005), the most appropriate p significance threshold proposed here, in most instances, is much less than the conventional cut-off of 0.05 and varies from study to study and from statistical test to test, even within a single study. The proposed method provides the minimum weighted sum of type I and type II errors.\n\nConclusions\nGiven the perplexity involved in using the frequentist statistics in a correct way (dealing with different p significance thresholds, even in a single study), it seems that the p value is no longer a proper statistic to be used in our research; it should be replaced by alternative methods, eg, Bayesian methods.\n",
        "link": "http://dx.doi.org/10.1186/s12967-023-04827-8"
    },
    {
        "id": 6449,
        "title": "A method to measure predictive ability of an injury risk curve using an observation-adjusted area under the receiver operating characteristic curve",
        "authors": "A.M. Baker, F.C. Hsu, F.S. Gayzik",
        "published": "2018-4",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jbiomech.2018.02.018"
    },
    {
        "id": 6450,
        "title": "Optimal Cycle Thresholds for Coronavirus Disease 2019 (COVID-19) Screening—Receiver Operating Characteristic (ROC)-Based Methods Highlight Between-Study Differences",
        "authors": "Gerrit Hirschfeld, Michael von Glischinski, Christian Thiele",
        "published": "2021-8-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/cid/ciaa1883"
    },
    {
        "id": 6451,
        "title": "Cut-off points between pain intensities of the postoperative pain using receiver operating characteristic (ROC) curves",
        "authors": "Sooyoung Cho, Youn Jin Kim, Minjin Lee, Jae Hee Woo, Hyun Jung Lee",
        "published": "2021-12",
        "citations": 13,
        "abstract": "Abstract\nBackground\nPain assessment and management are important in postoperative circumstances as overdosing of opioids can induce respiratory depression and critical consequences. We aimed this study to check the reliability of commonly used pain scales in a postoperative setting among Korean adults. We also intended to determine cut-off points of pain scores between mild and moderate pain and between moderate and severe pain by which can help to decide to use pain medication.\n\nMethods\nA total of 180 adult patients undergoing elective non-cardiac surgery were included. Postoperative pain intensity was rated with a visual analog scale (VAS), numeric rating scale (NRS), faces pain scale revised (FPS-R), and verbal rating scale (VRS). The VRS rated pain according to four grades: none, mild, moderate, and severe. Pain assessments were performed twice: when the patients were alert enough to communicate after arrival at the postoperative care unit (PACU) and 30 min after arrival at the PACU. The levels of agreement among the scores were evaluated using intraclass correlation coefficients (ICCs). The cut-off points were determined by receiver operating characteristic curves.\n\nResults\nThe ICCs among the VAS, NRS, and FPS-R were consistently high (0.839–0.945). The pain categories were as follow: mild ≦ 5.3 / moderate 5.4 ~ 7.1 /severe ≧ 7.2 in VAS, mild ≦ 5 / moderate 6 ~ 7 / severe ≧ 8 in NRS, mild ≦ 4 / moderate 6 / severe 8 and 10 in FPS-R. The cut-off points for analgesics request were VAS ≧ 5.5, NRS ≧ 6, FPS-R ≧ 6, and VRS ≧ 2 (moderate or severe pain).\n\nConclusions\nDuring the immediate postoperative period, VAS, NRS, and FPS-R were well correlated. The boundary between mild and moderate pain was around five on 10-point scales, and it corresponded to the cut-off point of analgesic request. Healthcare providers should consider VRS and other patient-specific signs to avoid undertreatment of pain or overdosing of pain medication.\n",
        "link": "http://dx.doi.org/10.1186/s12871-021-01245-5"
    },
    {
        "id": 6452,
        "title": "Applying Receiver-Operating-Characteristic (ROC) to bulk ore sorting using XRF",
        "authors": "Genzhuang Li, Bern Klein, Chunbao Sun, Jue Kou",
        "published": "2020-1",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.mineng.2019.106117"
    },
    {
        "id": 6453,
        "title": "Multifator dimensionality reduction method based on area under receiver operating characteristic curve",
        "authors": "Soyeon Park, Wonkuk Kim",
        "published": "2017-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/mas-170399"
    },
    {
        "id": 6454,
        "title": "CHAPTER 32: Identifying Optimal Action Thresholds for Disease Predictors by Receiver Operating Characteristic Curve Analysis",
        "authors": "",
        "published": "2017-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1094/9780890544426.032"
    },
    {
        "id": 6455,
        "title": "RECEIVER OPERATING CHARACTERISTIC CURVE ANALYSIS IN DIAGNOSTIC RESEARCH: A REVIEW",
        "authors": "Kalesh M Karun, Amitha Puranik",
        "published": "2022-6-7",
        "citations": 0,
        "abstract": "Optimal dose selection in clinical trials is problematic when efficacious and toxic concentrations are close. A receiver operating characteristic curve is a graphical technique used to identify the optimal cut-off point for a continuous variable. Implementation of ROC analysis is currently possible using various statistical software packages. However, the process is straightforward in the EZR package of R software. This present study aims to provide a tutorial using a simple example and a detailed description of the procedure in EZR software. The information provided can help the researchers perform the analysis independently.",
        "link": "http://dx.doi.org/10.7897/2277-4343.130374"
    },
    {
        "id": 6456,
        "title": "The Youden Index in the Generalized Receiver Operating Characteristic Curve Context",
        "authors": "Pablo Martínez-Camblor, Juan Carlos Pardo-Fernández",
        "published": "2019-6-26",
        "citations": 76,
        "abstract": "Abstract\nThe receiver operating characteristic (ROC) curve and their associated summary indices, such as the Youden index, are statistical tools commonly used to analyze the discrimination ability of a (bio)marker to distinguish between two populations. This paper presents the concept of Youden index in the context of the generalized ROC (gROC) curve for non-monotone relationships. The interval estimation of the Youden index and the associated cutoff points in a parametric (binormal) and a non-parametric setting is considered. Monte Carlo simulations and a real-world application illustrate the proposed methodology.",
        "link": "http://dx.doi.org/10.1515/ijb-2018-0060"
    },
    {
        "id": 6457,
        "title": "Optimal two‐phase sampling for estimating the area under the receiver operating characteristic curve",
        "authors": "Yougui Wu",
        "published": "2021-2-20",
        "citations": 2,
        "abstract": "Statistical methods are well developed for estimating the area under the receiver operating characteristic curve (AUC) based on a random sample where the gold standard is available for every subject in the sample, or a two‐phase sample where the gold standard is ascertained only at the second phase for a subset of subjects sampled using fixed sampling probabilities. However, the methods based on a two‐phase sample do not attempt to optimize the sampling probabilities to minimize the variance of AUC estimator. In this paper, we consider the optimal two‐phase sampling design for evaluating the performance of an ordinal test in classifying disease status. We derived the analytic variance formula for the AUC estimator and used it to obtain the optimal sampling probabilities. The efficiency of the two‐phase sampling under the optimal sampling probabilities (OA) is evaluated by a simulation study, which indicates that two‐phase sampling under OA achieves a substantial amount of variance reduction with an over‐sample of subjects with low and high ordinal levels, compared with two‐phase sampling under proportional allocation (PA). Furthermore, in comparison with an one‐phase random sampling, two‐phase sampling under OA or PA have a clear advantage in reducing the variance of AUC estimator when the variance of diagnostic test results in the disease population is small relative to its counterpart in nondisease population. Finally, we applied the optimal two‐phase sampling design to a real‐world example to evaluate the performance of a questionnaire score in screening for childhood asthma.",
        "link": "http://dx.doi.org/10.1002/sim.8819"
    },
    {
        "id": 6458,
        "title": "The area under the generalized receiver-operating characteristic curve",
        "authors": "Pablo Martínez-Camblor, Sonia Pérez-Fernández, Susana Díaz-Coto",
        "published": "2022-6-1",
        "citations": 9,
        "abstract": "Abstract\nThe receiver operating-characteristic (ROC) curve is a well-known graphical tool routinely used for evaluating the discriminatory ability of continuous markers, referring to a binary characteristic. The area under the curve (AUC) has been proposed as a summarized accuracy index. Higher values of the marker are usually associated with higher probabilities of having the characteristic under study. However, there are other situations where both, higher and lower marker scores, are associated with a positive result. The generalized ROC (gROC) curve has been proposed as a proper extension of the ROC curve to fit these situations. Of course, the corresponding area under the gROC curve, gAUC, has also been introduced as a global measure of the classification capacity. In this paper, we study in deep the gAUC properties. The weak convergence of its empirical estimator is provided while deriving an explicit and useful expression for the asymptotic variance. We also obtain the expression for the asymptotic covariance of related gAUCs and propose a non-parametric procedure to compare them. The finite-samples behavior is studied through Monte Carlo simulations under different scenarios, presenting a real-world problem in order to illustrate its practical application. The R code functions implementing the procedures are provided as Supplementary Material.",
        "link": "http://dx.doi.org/10.1515/ijb-2020-0091"
    },
    {
        "id": 6459,
        "title": "Receiver operating characteristic (ROC) curves: equivalences, beta model, and minimum distance estimation",
        "authors": "Tilmann Gneiting, Peter Vogel",
        "published": "2022-6",
        "citations": 9,
        "abstract": "AbstractReceiver operating characteristic (ROC) curves are used ubiquitously to evaluate scores, features, covariates or markers as potential predictors in binary problems. We characterize ROC curves from a probabilistic perspective and establish an equivalence between ROC curves and cumulative distribution functions (CDFs). These results support a subtle shift of paradigms in the statistical modelling of ROC curves, which we view as curve fitting. We propose the flexible two-parameter beta family for fitting CDFs to empirical ROC curves and derive the large sample distribution of minimum distance estimators in general parametric settings. In a range of empirical examples the beta family fits better than the classical binormal model, particularly under the vital constraint of the fitted curve being concave.",
        "link": "http://dx.doi.org/10.1007/s10994-021-06115-2"
    },
    {
        "id": 6460,
        "title": "Receiver Operating Characteristic",
        "authors": "Pang-Ning Tan",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-8265-9_569"
    },
    {
        "id": 6461,
        "title": "Identifying threshold values of an open source software using Receiver Operating Characteristics curve (ROC)",
        "authors": "Ruchika Malhotra, Ankita Bansal",
        "published": "2017-1-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/02522667.2015.1135592"
    },
    {
        "id": 6462,
        "title": "Supplementary material 1 from: Hosni EM, Al-Khalaf AA, Nasser MG, ElShahed SM, Alashaal SA (2024) Locusta migratoria (L.) (Orthoptera) in a warming world: unravelling the ecological consequences of climate change using GIS. Biodiversity Data Journal 12: e115845. https://doi.org/10.3897/BDJ.12.e115845",
        "authors": "Eslam Hosni, Areej Al-Khalaf, Mohamed Nasser, Sara ElShahed, Sara Alashaal",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3897/bdj.12.e115845.suppl1"
    },
    {
        "id": 6463,
        "title": "Evaluation of Anthropometric Parameters of Central Obesity among Professional Drivers,  A Receiver Operating Characteristic (ROC) Analysis",
        "authors": "Muhammad Asif, Muhammad Aslam, Saima Altaf, Abdul Majid, Saima Atif",
        "published": "2020-8-1",
        "citations": 0,
        "abstract": "Different anthropometric parameters have been proposed for assessing central obesity. The diagnostic performance of these anthropometric parameters and their ability to correctly measure central obesity for the professional community, like drivers, is questionable and needs to be assessed. The study aimed to examine the diagnostic performance of anthropometric parameters as indicators of central obesity in drivers as measured by waist circumference (WC) and to determine the best cut-off values for these parameters that would identify obese drivers. Anthropometric measurements from a cross-sectional sample of 197 professional drivers were taken under standard protocol. Receiver operating characteristics (ROC) analysis was used to examine the diagnostic performance and to determine the optimal cut-off point of each anthropometric parameter to identify centrally obese drivers. It was found that WC had a significant positive correlation with all other obesity indicators. The ROC curve analysis indicated that all the parameters analyzed had a good performance, but the waist-to-height ratio (WHtR) had a more predictive value of the area under the curve (AUC). Optimal cut-offs to identify central obesity in drivers were 0.55, 2.06, 0.95, and 25.44 for WHtR, conicity index, waist-to-hip ratio, and body mass index, respectively. These cut-off points for different indicators can be used to detect central obesity for drivers. ",
        "link": "http://dx.doi.org/10.21109/kesmas.v15i3.3218"
    },
    {
        "id": 6464,
        "title": "Correction to: Cut-off points between pain intensities of the postoperative pain using receiver operating characteristic (ROC) curves",
        "authors": "Sooyoung Cho, Youn Jin Kim, Minjin Lee, Jae Hee Woo, Hyun Jung Lee",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1186/s12871-021-01410-w"
    },
    {
        "id": 6465,
        "title": "Effect of non-linearity of a predictor on the shape and magnitude of its receiver-operating-characteristic curve in predicting a binary outcome",
        "authors": "Kwok M. Ho",
        "published": "2017-8-31",
        "citations": 7,
        "abstract": "AbstractArea under a receiver-operating-characteristic (AUROC) curve is widely used in medicine to summarize the ability of a continuous predictive marker to predict a binary outcome. This study illustrated how a U-shaped or inverted U-shaped continuous predictor would affect the shape and magnitude of its AUROC curve in predicting a binary outcome by comparing the ROC curves of the worst first 24-hour arterial pH values of 9549 consecutive critically ill patients in predicting hospital mortality before and after centering the predictor by its mean or median. A simulation dataset with an inverted U-shaped predictor was used to assess how this would affect the shape and magnitude of the AUROC curve. An asymmetrical U-shaped relationship between pH and hospital mortality, resulting in an inverse-sigmoidal ROC curve, was observed. The AUROC substantially increased after centering the predictor by its mean (0.611 vs 0.722, difference = 0.111, 95% confidence interval [CI] 0.087–0.135), and was further improved after centering by its median (0.611 vs 0.745, difference = 0.133, 95%CI 0.110–0.157). A sigmoidal-shaped ROC curve was observed for an inverted U-shaped predictor. In summary, a non-linear predictor can result in a biphasic-shaped ROC curve; and centering the predictor can reduce its bias towards null predictive ability.",
        "link": "http://dx.doi.org/10.1038/s41598-017-10408-9"
    },
    {
        "id": 6466,
        "title": "Interpreting area under the receiver operating characteristic curve",
        "authors": "Anne A H de Hond, Ewout W Steyerberg, Ben van Calster",
        "published": "2022-12",
        "citations": 65,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/s2589-7500(22)00188-1"
    },
    {
        "id": 6467,
        "title": "Receiver Operating Characteristic (ROC) Area Under the Curve (AUC): A Diagnostic Measure for Evaluating the Accuracy of Predictors of Education Outcomes",
        "authors": "Alex J. Bowers, Xiaoliang Zhou",
        "published": "2019-1-2",
        "citations": 88,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/10824669.2018.1523734"
    },
    {
        "id": 6468,
        "title": "REVIEW AND LIMITATIONS OF METHODS FOR CONSTRUCTING A RECEIVER OPERATING CHARACTERISTIC CURVE IN A CASE-CONTROL DESIGN",
        "authors": "Yalda Zarnegarnia, Shari Messinger",
        "published": "2019-9-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17654/ts057010047"
    },
    {
        "id": 6469,
        "title": "Multi-instance learning by maximizing the area under receiver operating characteristic curve",
        "authors": "I. Edhem Sakarya, O. Erhun Kundakcioglu",
        "published": "2023-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10898-022-01219-y"
    },
    {
        "id": 6470,
        "title": "ROCnReg: An R Package for Receiver Operating Characteristic Curve Inference With and Without Covariates",
        "authors": "María,Xosé Rodríguez-Álvarez, Vanda Inácio",
        "published": "2021",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32614/rj-2021-066"
    },
    {
        "id": 6471,
        "title": "Smooth time-dependent receiver operating characteristic curve estimators",
        "authors": "Pablo Martínez-Camblor, Juan Carlos Pardo-Fernández",
        "published": "2018-3",
        "citations": 18,
        "abstract": " The receiver operating characteristic curve is a popular graphical method often used to study the diagnostic capacity of continuous (bio)markers. When the considered outcome is a time-dependent variable, two main extensions have been proposed: the cumulative/dynamic receiver operating characteristic curve and the incident/dynamic receiver operating characteristic curve. In both cases, the main problem for developing appropriate estimators is the estimation of the joint distribution of the variables time-to-event and marker. As usual, different approximations lead to different estimators. In this article, the authors explore the use of a bivariate kernel density estimator which accounts for censored observations in the sample and produces smooth estimators of the time-dependent receiver operating characteristic curves. The performance of the resulting cumulative/dynamic and incident/dynamic receiver operating characteristic curves is studied by means of Monte Carlo simulations. Additionally, the influence of the choice of the required smoothing parameters is explored. Finally, two real-applications are considered. An R package is also provided as a complement to this article. ",
        "link": "http://dx.doi.org/10.1177/0962280217740786"
    },
    {
        "id": 6472,
        "title": "True verification probabilities should not be used in estimating the area under receiver operating characteristic curve",
        "authors": "Yougui Wu",
        "published": "2020-11-30",
        "citations": 1,
        "abstract": "In medical research, a two‐phase study is often used for the estimation of the area under the receiver operating characteristic curve (AUC) of a diagnostic test. However, such a design introduces verification bias. One of the methods to correct verification bias is inverse probability weighting (IPW). Since the probability a subject is selected into phase 2 of the study for disease verification is known, both true and estimated verification probabilities can be used to form an IPW estimator for AUC. In this article, we derive explicit variance formula for both IPW AUC estimators and show that the IPW AUC estimator using the true values of verification probabilities even when they are known are less efficient than its counterpart using the estimated values. Our simulation results show that the efficiency loss can be substantial especially when the variance of test result in disease population is small relative to its counterpart in nondiseased population.",
        "link": "http://dx.doi.org/10.1002/sim.8700"
    },
    {
        "id": 6473,
        "title": "Prediction of Abnormal Body Fat Percentage by Anthropometrics Parameters Using Receiver Operating Characteristic Curve",
        "authors": "Erika Severeyn, Sara Wong, Hector Herrera, Alexandra La Cruz, Jesus Velasquez, Monica Huerta",
        "published": "2020-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/andescon50619.2020.9272149"
    },
    {
        "id": 6474,
        "title": "SP43. Preoperative Lab Values Are Predictive of Postoperative Outcomes in Cranioplasty: A Receiver Operating Characteristic Curve Approach",
        "authors": "Anitesh Bajaj, Rushmin Khazanchi, Arun K. Gosain",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1097/01.gox.0000938516.95148.c6"
    },
    {
        "id": 6475,
        "title": "Smoothed time‐dependent receiver operating characteristic curve for right censored survival data",
        "authors": "Kassu Mehari Beyene, Anouar El Ghouch",
        "published": "2020-10-30",
        "citations": 7,
        "abstract": "The prediction reliability is of primary concern in many clinical studies when the objective is to develop new predictive models or improve existing risk scores. In fact, before using a model in any clinical decision making, it is very important to check its ability to discriminate between subjects who are at risk of, for example, developing certain disease in a near future from those who will not. To that end, the time‐dependent receiver operating characteristic (ROC) curve is the most commonly used method in practice. Several approaches have been proposed in the literature to estimate the ROC nonparametrically in the context of survival data. But, except one recent approach, all the existing methods provide a nonsmooth ROC estimator whereas, by definition, the ROC curve is smooth. In this article we propose and study a new nonparametric smooth ROC estimator based on a weighted kernel smoother. More precisely, our approach relies on a well‐known kernel method used to estimate cumulative distribution functions of random variables with bounded supports. We derived some asymptotic properties for the proposed estimator. As bandwidth is the main parameter to be set, we present and study different methods to appropriately select one. A simulation study is conducted, under different scenarios, to prove the consistency of the proposed method and to compare its finite sample performance with a competitor. The results show that the proposed method performs better and appear to be quite robust to bandwidth choice. As for inference purposes, our results also reveal the good performances of a proposed nonparametric bootstrap procedure. Furthermore, we illustrate the method using a real data example.",
        "link": "http://dx.doi.org/10.1002/sim.8671"
    },
    {
        "id": 6476,
        "title": "Analysis of Insulin Receiver Operating Characteristic Curve for Impaired Glucose Tolerance and Impaired Fasting Glucose Diagnosis",
        "authors": "Erika Severeyn, Sara Wong, Jesus Velasquez, Hector Herrera, Gilberto Perpinan, Monica Huerta",
        "published": "2019-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/etcm48019.2019.9014901"
    },
    {
        "id": 6477,
        "title": "Receiver Operating Characteristic Analysis",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100396"
    },
    {
        "id": 6478,
        "title": "The length of the receiver operating characteristic curve and the two cutoff Youden index within a robust framework for discovery, evaluation, and cutoff estimation in biomarker studies involving improper receiver operating characteristic curves",
        "authors": "Leonidas E. Bantis, John V. Tsimikas, Gregory R. Chambers, Michela Capello, Samir Hanash, Ziding Feng",
        "published": "2021-3-30",
        "citations": 9,
        "abstract": "AbstractDuring the early stage of biomarker discovery, high throughput technologies allow for simultaneous input of thousands of biomarkers that attempt to discriminate between healthy and diseased subjects. In such cases, proper ranking of biomarkers is highly important. Common measures, such as the area under the receiver operating characteristic (ROC) curve (AUC), as well as affordable sensitivity and specificity levels, are often taken into consideration. Strictly speaking, such measures are appropriate under a stochastic ordering assumption, which implies, without loss of generality, that higher measurements are more indicative for the disease. Such an assumption is not always plausible and may lead to rejection of extremely useful biomarkers at this early discovery stage. We explore the length of a smooth ROC curve as a measure for biomarker ranking, which is not subject to directionality. We show that the length corresponds to a  divergence, is identical to the corresponding length of the optimal (likelihood ratio) ROC curve, and is an appropriate measure for ranking biomarkers. We explore the relationship between the length measure and the AUC of the optimal ROC curve. We then provide a complete framework for the evaluation of a biomarker in terms of sensitivity and specificity through a proposed ROC analogue for use in improper settings. In the absence of any clinical insight regarding the appropriate cutoffs, we estimate the sensitivity and specificity under a two‐cutoff extension of the Youden index and we further take into account the implied costs. We apply our approaches on two biomarker studies that relate to pancreatic and esophageal cancer.",
        "link": "http://dx.doi.org/10.1002/sim.8869"
    },
    {
        "id": 6479,
        "title": "Empirical likelihood inference for area under the receiver operating characteristic curve using ranked set samples",
        "authors": "Chul Moon, Xinlei Wang, Johan Lim",
        "published": "2022-11",
        "citations": 0,
        "abstract": "AbstractThe area under a receiver operating characteristic curve (AUC) is a useful tool to assess the performance of continuous‐scale diagnostic tests on binary classification. In this article, we propose an empirical likelihood (EL) method to construct confidence intervals for the AUC from data collected by ranked set sampling (RSS). The proposed EL‐based method enables inferences without assumptions required in existing nonparametric methods and takes advantage of the sampling efficiency of RSS. We show that for both balanced and unbalanced RSS, the EL‐based point estimate is the Mann–Whitney statistic, and confidence intervals can be obtained from a scaled chi‐square distribution. Simulation studies and two case studies on diabetes and chronic kidney disease data suggest that using the proposed method and RSS enables more efficient inference on the AUC.",
        "link": "http://dx.doi.org/10.1002/pst.2230"
    },
    {
        "id": 6480,
        "title": "Receiver operating characteristic curve analysis of clinical signs for screening of convergence insufficiency in young adults",
        "authors": "Byeong-Yeon Moon, Sang-Yeob Kim, Dong-Sik Yu",
        "published": "2020-1-24",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1371/journal.pone.0228313"
    },
    {
        "id": 6481,
        "title": "Direct estimation of the area under the receiver operating characteristic curve with verification biased data",
        "authors": "Yan Hai, Gengsheng Qin",
        "published": "2020-12-30",
        "citations": 2,
        "abstract": "In medical diagnostic studies, verification of the true disease status might be partially missing based on results of diagnostic tests and other characteristics of subjects. Because estimates of area under the ROC curve (AUC) based on partially validated subjects are usually biased, it is usually necessary to estimate AUC from a bias‐corrected ROC curve. In this article, various direct estimation methods of the AUC based on hybrid imputation [full imputations and mean score imputation (MSI)], inverse probability weighting, and the semiparametric efficient (SPE) approach are proposed and compared in the presence of verification bias when the test result is continuous under the assumption that the true disease status, if missing, is missing at random. Simulation results show that the proposed estimators are accurate for the biased sampling if the disease and verification models are correctly specified. The SPE and MSI based estimators perform well even under the misspecified disease/verification models. Numerical studies are performed to compare the finite sample performance of the proposed approaches with existing methods. A real dataset of neonatal hearing screening study is analyzed.",
        "link": "http://dx.doi.org/10.1002/sim.8753"
    },
    {
        "id": 6482,
        "title": "Minimum distance estimation of the Lehmann receiver operating characteristic curve",
        "authors": "Alicja Jokiel-Rokita, Rafał Topolnicki",
        "published": "2021-5-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/02331888.2021.1960528"
    },
    {
        "id": 6483,
        "title": "The clinical meaning of the area under a receiver operating characteristic curve for the evaluation of the performance of disease markers",
        "authors": "Stefano Parodi, Damiano Verda, Francesca Bagnasco, Marco Muselli",
        "published": "2022-10-17",
        "citations": 3,
        "abstract": "OBJECTIVES: The area under a receiver operating characteristic (ROC) curve (AUC) is a popular measure of pure diagnostic accuracy that is independent from the proportion of diseased subjects in the analysed sample. However, its actual usefulness in the clinical context has been questioned, because it does not seem to be directly related to the actual performance of a diagnostic marker in identifying diseased and non-diseased subjects in real clinical settings. This study evaluates the relationship between the AUC and the proportion of correct classifications (global diagnostic accuracy, GDA) in relation to the shape of the corresponding ROC curves.METHODS: We demonstrate that AUC represents an upward-biased measure of GDA at an optimal accuracy cut-off for balanced groups. The magnitude of bias depends on the shape of the ROC plot and on the proportion of diseased and non-diseased subjects. In proper curves, the bias is independent from the diseased/non-diseased ratio and can be easily estimated and removed. Moreover, a comparison between 2 partial AUCs can be replaced by a more powerful test for the corresponding whole AUCs.RESULTS: Applications to 3 real datasets are provided: a marker for a hormone deficit in children, 2 tumour markers for malignant mesothelioma, and 2 gene expression profiles in ovarian cancer patients.CONCLUSIONS: The AUC is a measure of accuracy with potential clinical relevance for the evaluation of disease markers. The clinical meaning of ROC parameters should always be evaluated with an analysis of the shape of the corresponding ROC curve.",
        "link": "http://dx.doi.org/10.4178/epih.e2022088"
    },
    {
        "id": 6484,
        "title": "The correlation between nutrition and frailty and the receiver operating characteristic curve of different nutritional indexes for frailty",
        "authors": "Hong Liang, Xiaoping Li, Xiaoye Lin, Yanmin Ju, Jiyan Leng",
        "published": "2021-12",
        "citations": 16,
        "abstract": "Abstract\nBackground\nFrailty is a kind of geriatric syndrome, which is very common in the elderly. Patients with malnutrition are at higher risk of frailty. This study explored the correlation between nutrition and frailty and compared the receiver operating characteristic curve of different nutritional indexes for frailty.\n\nMethods\nThis cross-sectional study included 179 inpatients aged ≥65 years old. Frailty was measured using Fried Frailty Phenotype, handgrip strength was measured using JAMAR@Plus and the 4.57 m usual gait speed was measured using a stopwatch. Comprehensive nutritional assessment refers to the application of Mini Nutritional Assessment (MNA) to assess the nutritional status of patients.\n\nResults\nCompared with the non-frailty group, the upper arm circumference, calf circumference, hemoglobin, albumin, prealbumin, cholesterol and low density lipoprotein in the frailty group were lower (P < 0.05). Comprehensive nutritional assessment, whether as a categorical variable or a continuous variable, was significantly correlated with frailty (P < 0.05). Model1 showed that the risk of frailty in malnourished patients was 3.381 times higher than that in well nourished patients (P = 0.036). Model2 showed that the risk of frailty decreased by 13.8% for every 1 point increase in MNA score (P = 0.009). The area under the curves of albumin, prealbumin and hemoglobin was larger (AUC > 0.65), AUC was 0.718, 0.693 and 0.743, respectively.\n\nConclusions\nOur results suggest that malnutrition is closely related to frailty. As for single nutritional indexes, albumin, prealbumin and hemoglobin were found to be associated with frailty. Further cohort studies are needed to verify their ability to screen for frailty.\n",
        "link": "http://dx.doi.org/10.1186/s12877-021-02580-5"
    },
    {
        "id": 6485,
        "title": "Joint hypothesis testing of the area under the receiver operating characteristic curve and the Youden index",
        "authors": "Jingjing Yin, Fedelis Mutiso, Lili Tian",
        "published": "2021-5",
        "citations": 19,
        "abstract": "AbstractIn the receiver operating characteristic (ROC) analysis, the area under the ROC curve (AUC) serves as an overall measure of diagnostic accuracy. Another popular ROC index is the Youden index (J), which corresponds to the maximum sum of sensitivity and specificity minus one. Since the AUC and J describe different aspects of diagnostic performance, we propose to test if a biomarker beats the pre‐specified targeting values of AUC0 and J0 simultaneously with H0 : AUC ≤ AUC0 or J ≤ J0 against Ha : AUC > AUC0 and J > J0. This is a multivariate order restrictive hypothesis with a non‐convex space in Ha, and traditional likelihood ratio‐based tests cannot apply. The intersection–union test (IUT) and the joint test are proposed for such test. While the IUT test independently tests for the AUC and the Youden index, the joint test is constructed based on the joint confidence region. Findings from the simulation suggest both tests yield similar power estimates. We also illustrated the tests using a real data example and the results of both tests are consistent. In conclusion, testing jointly on AUC and J gives more reliable results than using a single index, and the IUT is easy to apply and have similar power as the joint test.",
        "link": "http://dx.doi.org/10.1002/pst.2099"
    },
    {
        "id": 6486,
        "title": "Determination of the Receiver Operating Characteristics (ROC) Curve of the Logistic Regression Model Accuracy Using Some Breast Measurements in the Presence of Multicollinearity",
        "authors": "Uchenna P. Ogoke,  ",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "This study was aimed at determining the Receiver Operating Characteristics Curve of the Logistic Regression Model accuracy using some breast measurements in the presence of Multicollinearity to detect the presence or absence of tumorous cell of cancer patients. A secondary data from the Breast Cancer Wisconsin (Diagnostic) was used for analysis. The data was cleaned for outliers, recoded numerically and tested for multicollinearity. The ROC curve for the logistic regression model also revealed a high sensitivity and high specificity of the presence of tumorous cells in the patients with a percentage of 95% which is extremely high indicating that the logistic regression model is good in predicting better diagnosis of tumor cell of cancer patients accurately when combined with ROC.",
        "link": "http://dx.doi.org/10.54117/ijph.v3i1.11"
    },
    {
        "id": 6487,
        "title": "Evaluation of anthropometric parameters of central obesity in Pakistani children aged 5–12 years, using receiver operating characteristic (ROC) analysis",
        "authors": "Muhammad Asif, Muhammad Aslam, Saima Altaf",
        "published": "2018-9-25",
        "citations": 17,
        "abstract": "Abstract\n\nBackground\nDifferent anthropometric parameters have been proposed for assessing central obesity in children, but the ability of these anthropometric parameters to correctly measure central obesity in Pakistani children is questionable and needs to be assessed. The aims of this investigation were to examine the diagnostic performance of anthropometric parameters as indicators of central obesity in Pakistani children as measured by waist circumference (WC) and to determine the sex-specific best cut-off values for these parameters that would identify obese children.\n\n\nMethods\nAnthropometric measurements – height, weight, WC, waist-to-hip ratio (WHR), waist-to-height ratio (WHtR), conicity index (CI) and neck circumference (NC) – from a cross-sectional sample of 5964 Pakistani children aged 5–12 years were analyzed. Receiver operating characteristics (ROC) analysis was used to examine the diagnostic performance and to determine the optimal cut-off point of each anthropometric parameter for identifying centrally obese children.\n\n\nResults\nIt was found that WC had a significantly positive correlation with all studied anthropometric parameters. The ROC curve analysis indicated that all the parameters analyzed had good performance but WHtR had the highest value of the area under the curve (AUC). Optimal cut-off points associated with central obesity for boys and girls were, respectively, 0.47 and 0.48 for WHtR, 1.20 and 1.23 for CI, 0.96 and 0.96 for WHR and 26.36 and 26.54 cm for NC.\n\n\nConclusions\nThe sex-specific cut-off points for WHtR, CI, WHR and NC can be used to detect central obesity in Pakistani children.\n",
        "link": "http://dx.doi.org/10.1515/jpem-2018-0193"
    },
    {
        "id": 6488,
        "title": "Critical thresholds of Ion Concentration in Plasma for Hypocalcemia prediction in dairy cows using receiver operating characteristic (ROC) analysis",
        "authors": "Xinhuan Xiao, Chuchu Xu, Shi Xu, Cheng Xia, Gang Wang, Yunlong Bai, Ling Wu, Jiasan Zheng",
        "published": "2017-7-7",
        "citations": 0,
        "abstract": "Postpartum hypocalcemia is an important nutrient metabolic disease which occurs frequently in dairy cows. Parameters for early risk prediction of hypocalcemia have not been investigated previously in dairy cows on farms in China. To predict the occurrence of hypocalcemia and obtain the critical thresholds of various parameters related to the prevalence and risk of hypocalcemia in dairy cows. 61 Holstein Friesian cows from one farm were randomly selected and monitored using a plasma calcium(Ca) concentration of 2.0 mmol/L as the cutoff point of hypocalcemia. The risk prediction thresholds for hypocalcemia were determined by receiver operating characteristic (ROC) analysis using prenatal plasma Ca concentration and other electrolyte concentrations. The results showed that the plasma thresholds were more than 2.12 mmol/L for Ca before calving, with 98.7% sensitivity and 88.5% specificity, and more than 1.90 mmol/L for phosphorus (P), with 98.7% sensitivity and 65.4% specificity, respectively. Furthermore, there was a prominent positive correlation between the plasma concentration of Ca and that of P or magnesium (Mg) before calving in dairy cows. Levels of Ca and P in the plasma of dairy cows before calving are useful parameters for risk prediction of postpartum hypocalcemia incidents in dairy cows.",
        "link": "http://dx.doi.org/10.18805/ijar.v0iof.8476"
    },
    {
        "id": 6489,
        "title": "RECEIVER OPERATING CHARACTERISTIC OPTIMIZATION BASED ON CONVEX HULL AND EVOLUTIONARY ALGORITHMS",
        "authors": "Baidyanath Ram",
        "published": "No Date",
        "citations": 0,
        "abstract": "Classification is basically a Multi-objective problem. The efficiency of classification vastly depends on performance of a classifier which can be evaluated on the basis of Receiver Operating Characteristic (ROC) graph, Area under Curve (AUC), and selection of different threshold values are generally used as a tool. In machine learning, generally, 2-D classifiers are available that deal with bi-objective problems where overlapping of class may occur i.e. sensitivity and specificity may overlap. Recently, multi-class classification in which classes are mutually exclusive is in research trends along with the evolutionary algorithm. The application of ROC graph is extended to evaluate multi-dimensional classification as it is cost sensitive learning. The goal of this paper is to gather recent achievements in the field at one place to analyze the classifier performance for multi-dimensional classification problems using convex hull and evolutionary algorithms. In this paper, we tried to cover all the existing recent advance techniques in maximization of ROC and proposed a convex hull and evolutionary algorithm based new model for ROC maximization.",
        "link": "http://dx.doi.org/10.31219/osf.io/nt65m"
    },
    {
        "id": 6490,
        "title": "Column generation-based prototype learning for optimizing area under the receiver operating characteristic curve",
        "authors": "Erhan C. Ozcan, Berk Görgülü, Mustafa G. Baydogan",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ejor.2023.11.016"
    },
    {
        "id": 6491,
        "title": "A covariate‐specific time‐dependent receiver operating characteristic curve for correlated survival data",
        "authors": "Alessandra Meddis, Paul Blanche, François C Bidard, Aurélien Latouche",
        "published": "2020-8-30",
        "citations": 1,
        "abstract": "Several studies for the clinical validity of circulating tumor cells (CTCs) in metastatic breast cancer were conducted showing that it is a prognostic biomarker of overall survival. In this work, we consider an individual patient data meta‐analysis for nonmetastatic breast cancer to assess the discrimination of CTCs regarding the risk of death. Data are collected in several centers and present correlated failure times for subjects of the same center. However, although the covariate‐specific time‐dependent receiver operating characteristic (ROC) curve has been widely used for assessing the performance of a biomarker, there is no methodology yet that can handle this specific setting with clustered censored failure times. We propose an estimator for the covariate‐specific time‐dependent ROC curves and area under the ROC curve when clustered failure times are detected. We discuss the assumptions under which the estimators are consistent and their interpretations. We assume a shared frailty model for modeling the effect of the covariates and the biomarker on the outcome in order to account for the cluster effect. A simulation study was conducted and it shows negligible bias for the proposed estimator and a nonparametric one based on inverse probability censoring weighting, while a semiparametric estimator, ignoring the clustering, is markedly biased. Finally, in our application to breast cancer data, the estimation of the covariate‐specific area under the curves illustrates that the CTCs discriminate better patients with inflammatory tumor than patients with noninflammatory tumor, with respect to their risk of death.",
        "link": "http://dx.doi.org/10.1002/sim.8550"
    },
    {
        "id": 6492,
        "title": "More efficient estimators of the area under the receiver operating characteristic curve in paired ranked set sampling",
        "authors": "Mohamed S Abdallah",
        "published": "2023-6",
        "citations": 0,
        "abstract": " Receiver operating characteristic is a beneficial technique for evaluating the performance of a binary classification. The area under the curve of the receiver operating characteristic is an effective index of the accuracy of the classification process. While nonparametric point estimation has been well-studied under the ranked set sampling, it has received little attention under ranked set sampling variations. In order to set out to fill this gap, this article deals with the problem of estimating the area under the curve of the receiver operating characteristic based on paired ranked set sampling. New estimators of the area under the curve of the receiver operating characteristic based on paired ranked set sampling are proposed. Using the information supported by the concomitant variable, the additional area under the curve of the receiver operating characteristic estimators based on ranked set sampling as well as paired ranked set sampling are also introduced. It is shown either theoretically or numerically that the proposed estimators are consistent under the perfectness situation. It emerges that the concomitant-based estimators are shown to be superior to their competitors provided that the perfect assumption is not sharply violated. In contrast, kernel-based estimators are significantly superior relative to their rivals regardless of the quality of ranking. Finally, the application of the proposed procedures is also demonstrated by using empirical datasets in the context of medicine. ",
        "link": "http://dx.doi.org/10.1177/09622802231167434"
    },
    {
        "id": 6493,
        "title": "Evaluating the Effectiveness of Early Warning Indicators: An Application of Receiver Operating Characteristic Curve Approach to Panel Data",
        "authors": "Yusuf Yıldırım, Anirban Sanyal",
        "published": "2022-12-14",
        "citations": 1,
        "abstract": "Early warning indicators (EWIs) of banking crises should ideally be judged on how well they function in relation to the choice issue faced by macroprudential policymakers. However, the effectiveness of EWIs depends upon the strength of the predicting power, stability, and timeliness of the signal. Using a balanced panel of 6 countries’ experience with banking and currency crises in recent times, this paper evaluates the effectiveness of EWIs using Receiver Operating Characteristics. Following the drivers of the banking crisis and currency crisis, the paper evaluates the effectiveness of aggregate credit growth, sectoral deployment of credit along and other macroeconomic indicators generally used as EWI. The paper observes that credit disbursements to non-financial sectors and the central government provides stable signals about systemic risks. Further debt service ratio, interbank rates and total reserves are also found to be useful in predicting these crises. Lastly, the effective EWIs are combined using shrinkage regression methods to evaluate the improvement of signal strength of the combination of EWIs. The predictive power of the combination of EWIs provides better signal strength in predicting the macroprudential crisis.",
        "link": "http://dx.doi.org/10.47743/saeb-2022-0025"
    },
    {
        "id": 6494,
        "title": "Optimization of Binary Classification Based on Receiver Operating Characteristic Area Under the Curve for Supervised Machine Learning",
        "authors": "Ani Dijah Rahajoe,  Agussalim, Retno Mumpuni, Mohammad Idhom, Akhmad Fauzi, Faikul Umam, Ni Ketut Sari",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itis59651.2023.10420319"
    },
    {
        "id": 6495,
        "title": "Comprehensive evaluation of the risk of lactational mastitis in Chinese women: combined logistic regression analysis with receiver operating characteristic curve",
        "authors": "Yongshuo Yin, Zhiyong Yu, Min Zhao, Yuemei Wang, Xiao Guan",
        "published": "2020-3-27",
        "citations": 9,
        "abstract": "Abstract\nObjective: To identify the potential risk factors for acute mastitis during lactation comprehensively. Subsequently, to evaluate logistic regression model in predicting the risk of lactational mastitis in Chinese women by applying receiver operating characteristic (ROC) curve.\nMethods: A case–control study among Chinese women enrolled 652 patients with mastitis and 581 healthy women with breastfeeding experience as control. The retrospective information was obtained by questionnaires that included medical history of pregnancy, delivery, puerperium and breastfeeding behaviors. Univariate analysis and multivariate logistic regression model were performed to investigate the relationship between these factors and the occurrence of lactational mastitis. Using ROC curve to evaluate the prognostic value of these selected indicators in the risk of acute mastitis.\nResults: The multivariate logistic regression analysis showed that the primiparity (P &lt; 0.001), mastitis in previous breastfeeding (P &lt; 0.001), nipple’s heteroplasia (P &lt; 0.001), cracked nipple (P &lt; 0.001), breast trauma by external force (P = 0.002), lateral position (P = 0.007), breast pump (P = 0.039), nipple sucking (P = 0.007), sleep with sucking (P = 0.007), and tongue-tie (P = 0.013) were risk variables independently and significantly related with mastitis. While vaginal delivery (P = 0.015), clean nipple before breastfeeding (P = 0.015), first contact with child within 1 h (P = 0.027) were protective factors. The ROC analysis demonstrated that the area under the curve of model 2 was 0.8122 (95%CI = 0.7885–0.8360), which stated that the model presented a high sensitivity and specificity.\nConclusion: By means of collecting and summarizing the risk factors associated with the occurrence of breast mastitis in Chinese women, we established risk discriminant model to identify and warn the individuals susceptible to acute mastitis early, which will allow practitioners to provide appropriate management advice and effective individual care.",
        "link": "http://dx.doi.org/10.1042/bsr20190919"
    },
    {
        "id": 6496,
        "title": "Estimating the area under a receiver operating characteristic curve using partially ordered sets",
        "authors": "Ehsan Zamanzade, Xinlei Wang",
        "published": "2021-5-14",
        "citations": 2,
        "abstract": "Abstract\nRanked set sampling (RSS), known as a cost-effective sampling technique, requires that the ranker gives a complete ranking of the units in each set. Frey (2012) proposed a modification of RSS based on partially ordered sets, referred to as RSS-t in this paper, to allow the ranker to declare ties as much as he/she wishes. We consider the problem of estimating the area under a receiver operating characteristics (ROC) curve using RSS-t samples. The area under the ROC curve (AUC) is commonly used as a measure for the effectiveness of diagnostic markers. We develop six nonparametric estimators of the AUC with/without utilizing tie information based on different approaches. We then compare the estimators using a Monte Carlo simulation and an empirical study with real data from the National Health and Nutrition Examination Survey. The results show that utilizing tie information increases the efficiency of estimating the AUC. Suggestions about when to choose which estimator are also made available to practitioners.",
        "link": "http://dx.doi.org/10.1515/ijb-2019-0127"
    },
    {
        "id": 6497,
        "title": "Diagnostic Accuracy of Chest Computed Tomography Scans for Suspected Patients With COVID-19: Receiver Operating Characteristic Curve Analysis (Preprint)",
        "authors": "Lianpin Wu, Qike Jin, Jie Chen, Jiawei He, David M Brett-Major, Jianghu James Dong",
        "published": "No Date",
        "citations": 0,
        "abstract": "\nBACKGROUND\nComputed tomography (CT) scans are increasingly available in clinical care globally. They enable a rapid and detailed assessment of tissue and organ involvement in disease processes that are relevant to diagnosis and management, particularly in the context of the COVID-19 pandemic.\n\n\nOBJECTIVE\nThe aim of this paper is to identify differences in the CT scan findings of patients who were COVID-19 positive (confirmed via nucleic acid testing) to patients who were confirmed COVID-19 negative.\n\n\nMETHODS\nA retrospective cohort study was proposed to compare patient clinical characteristics and CT scan findings in suspected COVID-19 cases. A multivariable logistic model with LASSO (least absolute shrinkage and selection operator) selection for variables was used to identify the good predictors from all available predictors. The area under the curve (AUC) with 95% CI was calculated for each of the selected predictors and the combined selected key predictors based on receiver operating characteristic curve analysis.\n\n\nRESULTS\nA total of 94 (56%) patients were confirmed positive for COVID-19 from the suspected 167 patients. We found that elderly people were more likely to be infected with COVID-19. Among the 94 confirmed positive patients, 2 (2%) patients were admitted to an intensive care unit. No patients died during the study period. We found that the presence, distribution, and location of CT lesions were associated with the presence of COVID-19. White blood cell count, cough, and a travel history to Wuhan were also the top predictors for COVID-19. The overall AUC of these selected predictors is 0.97 (95% CI 0.93-1.00).\n\n\nCONCLUSIONS\nTaken together with nucleic acid testing, we found that CT scans can allow for the rapid diagnosis of COVID-19. This study suggests that chest CT scans should be more broadly adopted along with nucleic acid testing in the initial assessment of suspected COVID-19 cases, especially for patients with nonspecific symptoms.\n",
        "link": "http://dx.doi.org/10.2196/preprints.19424"
    },
    {
        "id": 6498,
        "title": "Parametric estimates for the receiver operating characteristic curve generalization for non-monotone relationships",
        "authors": "Pablo Martínez-Camblor, Juan C Pardo-Fernández",
        "published": "2019-7",
        "citations": 14,
        "abstract": " Diagnostic procedures are based on establishing certain conditions and then checking if those conditions are satisfied by a given individual. When the diagnostic procedure is based on a continuous marker, this is equivalent to fix a region or classification subset and then check if the observed value of the marker belongs to that region. Receiver operating characteristic curve is a valuable and popular tool to study and compare the diagnostic ability of a given marker. Besides, the area under the receiver operating characteristic curve is frequently used as an index of the global discrimination ability. This paper revises and widens the scope of the receiver operating characteristic curve definition by setting the classification subsets in which the final decision is based in the spotlight of the analysis. We revise the definition of the receiver operating characteristic curve in terms of particular classes of classification subsets and then focus on a receiver operating characteristic curve generalization for situations in which both low and high values of the marker are associated with more probability of having the studied characteristic. Parametric and non-parametric estimators of the receiver operating characteristic curve generalization are investigated. Monte Carlo studies and real data examples illustrate their practical performance. ",
        "link": "http://dx.doi.org/10.1177/0962280217747009"
    },
    {
        "id": 6499,
        "title": "Balanced Hybrid Nutrient Density Score Compared to Nutri-Score and Health Star Rating Using Receiver Operating Characteristic Curve Analyses",
        "authors": "Adam Drewnowski, Tanhia D. Gonzalez, Colin D. Rehm",
        "published": "2022-5-2",
        "citations": 5,
        "abstract": "BackgroundNutrient profiling (NP) models that are used to assess the nutrient density of foods can be based on a combination of key nutrients and desirable food groups.ObjectiveTo compare the diagnostic accuracy of a new balanced hybrid nutrient density score (bHNDS) to Nutri-Score and Health Star Rating (HSR) front-of-pack systems using receiver operating characteristic (ROC) curve analyses. The diet-level bHNDS was first validated against Healthy Eating Index (HEI-2015) using data from the 2017–18 National Health and Nutrition Examination Survey (2017–18 NHANES). Food-level bHNDS values were then compared to both the Nutri-Score and HSR using ROC curve analyses.ResultsThe bHNDS was based on 6 nutrients to encourage (protein, fiber, calcium, iron, potassium, and vitamin D); 5 food groups to encourage (whole grains, nuts and seeds, dairy, vegetables, and fruit), and 3 nutrients (saturated fat, added sugar, and sodium) to limit. The algorithm balanced components to encourage against those to limit. Diet-level bHNDS values correlated well with HEI-2015 (r = 0.67; p &lt; 0.001). Food-level correlations with both Nutri-Score (r = 0.60) and with HSR (r = 0.58) were significant (both p &lt; 0.001). ROC estimates of the Area Under the Curve (AUC) showed high agreement between bHNDS values and optimal Nutri-Score and HSR ratings (&gt;0.90 in most cases). ROC analysis identified those bHNDS cut-off points that were predictive of A-grade Nutri-Score or 5-star HSR. Those cut-off points were highly category-specific.ConclusionThe new bHNDS model showed high agreement with two front-of-pack labeling systems. Cross-model comparisons based on ROC curve analyses are the first step toward harmonization of proliferating NP methods that aim to “diagnose” high nutrient-density foods.",
        "link": "http://dx.doi.org/10.3389/fnut.2022.867096"
    },
    {
        "id": 6500,
        "title": "General bounds on the area under the receiver operating characteristic curve and other performance measures when only a single sensitivity and specificity point is known",
        "authors": "Roger M. Stein",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21314/jrmv.2022.019"
    }
]