[
    {
        "id": 23305,
        "title": "CotNet target tracking algorithm based on attention mechanism and context-awareness",
        "authors": "Xinping Pan, Zhen Wang, Xiaolin Shi, Junjie Li",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2691214"
    },
    {
        "id": 23306,
        "title": "BiCapsHate: Attention to the Linguistic Context of Hate via Bidirectional Capsules and Hatebase",
        "authors": "Ashraf Kamal, Tarique Anwar, Vineet Kumar Sejwal, Mohd Fazil",
        "published": "2024-4",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcss.2023.3236527"
    },
    {
        "id": 23307,
        "title": "Bidirectional Masked Self-attention and N-gram Span Attention for Constituency Parsing",
        "authors": "Soohyeong Kim, Whanhee Cho, Minji Kim, Yong Choi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.25"
    },
    {
        "id": 23308,
        "title": "Cross Project Software Attack Location Method Based on Context Awareness",
        "authors": "Guangdong Shen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012285000003807"
    },
    {
        "id": 23309,
        "title": "Lightweight Video Frame Interpolation Based on Bidirectional Attention Module",
        "authors": "Yige Li, Han Yang",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscc58397.2023.10217927"
    },
    {
        "id": 23310,
        "title": "FRCNN-AA-CIF: An automatic detection model of colon polyps based on attention awareness and context information fusion",
        "authors": "Ruolin Gong, SiJie He, Tiantian Tian, Jian Chen, Yuewen Hao, Chen Qiao",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.106787"
    },
    {
        "id": 23311,
        "title": "Assessment of bidirectional transformer encoder model and attention based bidirectional LSTM language models for fake news detection",
        "authors": "Anshika Choudhary, Anuja Arora",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jretconser.2023.103545"
    },
    {
        "id": 23312,
        "title": "Predicting Stock Price by Bidirectional-Lstm with Dual Attention  Network",
        "authors": "",
        "published": "2024-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33168/jsms.2024.0430"
    },
    {
        "id": 23313,
        "title": "Brati: Bidirectional Recurrent Attention for Time Series Imputation",
        "authors": "Armando Collado-Villaverde, Pablo Muñoz, María  D. R. Moreno",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4331197"
    },
    {
        "id": 23314,
        "title": "Edge Computing in Context Awareness: A Comprehensive Study",
        "authors": "V. Mahalakshmi, B. Karthikeyan",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2024062017"
    },
    {
        "id": 23315,
        "title": "Bidirectional GRU dengan Attention Mechanism pada Analisis Sentimen PLN Mobile",
        "authors": "Moh. Ainur Rohman, Suhartono Suhartono, Totok Chamidy",
        "published": "2023-5-26",
        "citations": 1,
        "abstract": "PLN Mobile adalah aplikasi ponsel customer self-service yang terintegrasi dengan Aplikasi Pengaduan dan Keluhan Pelanggan (APKT) dan Aplikasi Pelayanan Pelanggan Terpusat (AP2T). Mulai awal tahun 2021 sampai sekarang PLN menggencarkan sosialisasi PLN Mobile pada masyarakat sehingga jumlah ulasan PLN Mobile pada google playstore meningkat drastis. Untuk mengetahui kepuasan pelanggan tidak bisa hanya dengan melihat dan menganalisis dari kolom ulasan PLN Mobile di google playstore, hal ini dikarenakan data ulasan berbentuk tidak terstruktur. Untuk mengatasi masalah ini dibutuhkan teknik khusus yaitu analisis sentimen. Penelitian ini bertujuan untuk mengusulkan arsitektur analisis sentimen untuk mengatasi ketidakmampuan algoritma deep learning seperti LSTM dan GRU dalam menangkap informasi penting. Arsitektur yang diusulkan yaitu mengkombinasikan Bidirectional GRU (BiGRU) dengan attention mechanism menggunakan word2vec sebagai word embedding. Attention mechanism digunakan untuk menangkap kata yang penting sehingga arsitektur tersebut dapat memahami informasi yang penting. Kemudian, arsitektur yang diusulkan dilakukan perbandingan dengan metode CNN, CNN-GRU, CNN-LSTM, CNN-BiGRU, CNN-BiLSTM dengan menggunakan data ulasan PLN Mobile. Hasil eksperimen menunjukkan bahwa arsitektur analisis sentimen yang diusulkan memiliki akurasi dan f1-score yang lebih tinggi.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33633/tc.v22i2.7876"
    },
    {
        "id": 23316,
        "title": "Multi-domain Network Intrusion Detection Based on Attention-based Bidirectional LSTM",
        "authors": "Xiaoning Wang",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itnec56291.2023.10081953"
    },
    {
        "id": 23317,
        "title": "Nonsalient shapes capture attention automatically and without awareness after perceptual learning",
        "authors": "Yulong Ding",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1489-0"
    },
    {
        "id": 23318,
        "title": "Bidirectional Multi-Stack RNNs with Attention for Machine Translation",
        "authors": "Zhiren Chen, Ziyu Qiu, Nuo Chen",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oncon60463.2023.10430889"
    },
    {
        "id": 23319,
        "title": "Teacher’s awareness of intercultural pragmatics in adult EALD classrooms: an exploratory study in the multicultural context of Australia",
        "authors": "Chinh Duc Nguyen, Anh T. Ton-Nu",
        "published": "2024-1-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09658416.2023.2236015"
    },
    {
        "id": 23320,
        "title": "Situational Awareness in the Context of Automated Driving - Adapting the Situational Awareness Global Assessment Technique",
        "authors": "Sarah Schwindt, Paula Von Graevenitz, Bettina Abendroth",
        "published": "2023",
        "citations": 0,
        "abstract": "Automated vehicles offer the opportunity to disengage from the driving task, though in SAE Level 3 vehicles a Take-Over Request (TOR) can occur at any time. In this case, the driver must quickly assess the situation and completely take over the driving task. In order for the driver to be able to do this safely, the rapid development of sufficient situational awareness is of particular importance. To investigate how this can be supported, it is necessary to find a sufficiently accurate method for measuring situational awareness in the context of automated driving. The Situation Awareness Global Assessment Technique (SAGAT) provides an objective, direct method for measuring all three levels of situation awareness. However, in previous applications of the method, the relevance of the information measured by the SAGAT method was not taken into account. The aim of this paper is therefore to first identify suitable SAGAT questions by means of a literature review and then to assess the relevance of the information asked for the safe takeover of vehicle control by an online questionnaire (n = 78). Subsequently, a study in a driving simulator (n = 32) will test whether a weighted evaluation of the SAGAT questions according to the classification by the online questionnaire can further optimize the method for measuring situation awareness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1003802"
    },
    {
        "id": 23321,
        "title": "An Algorithm for Point Cloud Object Classification Combining Bidirectional Attention Mechanism and Edge Convolution",
        "authors": "Zhiheng Geng",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435614"
    },
    {
        "id": 23322,
        "title": "Bidirectional LSTM and Self-Attention Mechanisms based Multi-Label Sentiment Analysis",
        "authors": "Aruna A.R",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijsse.2025.10059046"
    },
    {
        "id": 23323,
        "title": "Modeling Studies of the Mechanism of Context-Dependent Bidirectional Movements of Kinesin-14 Motors",
        "authors": "Ping Xie",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "Kinesin-14s, a subfamily of the large superfamily of kinesin motor proteins, function mainly in spindle assembly and maintenance during mitosis and meiosis. KlpA from Aspergillus nidulans and GiKIN14a from Giardia intestinalis are two types of kinesin-14s. Available experimental results puzzlingly showed that while KlpA moves preferentially toward the minus end in microtubule-gliding setups and inside parallel microtubule overlaps, it moves preferentially toward the plus end on single microtubules. More puzzlingly, the insertion of an extra polypeptide linker in the central region of the neck stalk switches the motility direction of KlpA on single microtubules to the minus end. Prior experimental results showed that GiKIN14a moves preferentially toward the minus end on single microtubules in either tailless or full-length forms. The tail not only greatly enhances the processivity but also accelerates the ATPase rate and velocity of GiKIN14a. The insertion of an extra polypeptide linker in the central region of the neck stalk reduces the ATPase rate of GiKIN14a. However, the underlying mechanism of these puzzling dynamical features for KlpA and GiKIN14a is unclear. Here, to understand this mechanism, the dynamics of KlpA and GiKIN14a were studied theoretically on the basis of the proposed model, incorporating potential changes between the kinesin head and microtubule, as well as the potential between the tail and microtubule. The theoretical results quantitatively explain the available experimental results and provide predicted results. It was found that the elasticity of the neck stalk determines the directionality of KlpA on single microtubules and affects the ATPase rate and velocity of GiKIN14a on single microtubules.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/molecules29081792"
    },
    {
        "id": 23324,
        "title": "Can sexually salient stimuli direct attention outside of conscious awareness?",
        "authors": "Reshanne Reeder",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24072/pci.rr.100572"
    },
    {
        "id": 23325,
        "title": "Augmenting context with power information for green context-awareness in smart environments",
        "authors": "Umar Mahmud, Shariq Hussain",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "The increase in the use of smart devices has led to the realization of the Internet of Everything (IoE). The heart of an IoE environment is a Context-Aware System that facilitates service discovery, delivery, and adaptation based on context classification. The context has been defined in a domain-dependent way, traditionally. The classical models of context have been focused on rich context and lack Cost of Context (CoC) that can be used for decision support. The authors present a philosophy-inspired mathematical model of context that includes confidence in activity classification of context, the actions performed, and the power information. Since a single recurring activity can lead to distinct actions performed at different times, it is better to record the actions. The power information includes the power consumed in the complete context processing and is a quality attribute of the context. Power consumption is a useful metric as CoC and is suitable for power-constrained context awareness. To demonstrate the effectiveness of the proposed work, example contexts are described, and the context model is presented mathematically in this study. The context is aggregated with power information, and actions and confidence on the classification outcome lead to the concept of situational context. The results show that the context gathered through sensor data and deduced through remote services can be made more rich with CoC parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fcomp.2024.1365500"
    },
    {
        "id": 23326,
        "title": "Sentiment Analysis of Online Hotel Reviews Employing Bidirectional GRU with Attention Mechanism",
        "authors": "Maddu Morries Mathew, Preethi Nanjundan, Shahid Bashir",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/esic60604.2024.10481617"
    },
    {
        "id": 23327,
        "title": "Retracted: Rumor Detection with Bidirectional Graph Attention Networks",
        "authors": "Security and Communication Networks",
        "published": "2024-1-9",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9768194"
    },
    {
        "id": 23328,
        "title": "Non-Local Context-Aware Attention for Object Detection in Remote Sensing Images",
        "authors": "Yassin Terraf, El Mercha, Mohammed Erradi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012363700003660"
    },
    {
        "id": 23329,
        "title": "Attention-based bidirectional-long short-term memory for abnormal human activity detection",
        "authors": "Manoj Kumar, Anoop Kumar Patel, Mantosh Biswas, S. Shitharth",
        "published": "2023-9-2",
        "citations": 3,
        "abstract": "AbstractAbnormal human behavior must be monitored and controlled in today’s technology-driven era, since it may cause damage to society in the form of assault or web-based violence, such as direct harm to a person or the propagation of hate crimes through the internet. Several authors have attempted to address this issue, but no one has yet come up with a solution that is both practical and workable. Recently, deep learning models have become popular as a means of handling massive amounts of data but their potential to categorize the aberrant human activity remains unexplored. Using a convolutional neural network (CNN), a bidirectional long short-term memory (Bi-LSTM), and an attention mechanism to pay attention to the unique spatiotemporal characteristics of raw video streams, a deep-learning approach has been implemented in the proposed framework to detect anomalous human activity. After analyzing the video, our suggested architecture can reliably assign an abnormal human behavior to its designated category. Analytic findings comparing the suggested architecture to state-of-the-art algorithms reveal an accuracy of 98.9%, 96.04%, and 61.04% using the UCF11, UCF50, and subUCF crime datasets, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-41231-0"
    },
    {
        "id": 23330,
        "title": "Remote Sensing Image Registration with Bidirectional Generative Adversarial and Cross-Attention",
        "authors": "Tian Zekun, Chen Ying, Sun Wei, Gao Han",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciibms60103.2023.10347610"
    },
    {
        "id": 23331,
        "title": "An efficient gene expression data classification using optimized bidirectional long short-term memory with self attention mechanism",
        "authors": "S. Jacophine Susmi",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18387-6"
    },
    {
        "id": 23332,
        "title": "MAC Protocol Based IoT Network Intrusion Detection Using Improved Efficient Shuffle Bidirectional COOT Channel Attention Network",
        "authors": "Nanavath Kiran Singh Nayak, Budhaditya Bhattacharyya",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3299031"
    },
    {
        "id": 23333,
        "title": "Improving flight delays prediction by developing attention-based bidirectional LSTM network",
        "authors": "Maged Mamdouh, Mostafa Ezzat, Hesham Hefny",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.121747"
    },
    {
        "id": 23334,
        "title": "Insulator Defect Detection Method upon Fused Attention Mechanism and Bidirectional Feature Fusion",
        "authors": "Yiming Chen",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nInsulators are important components for achieving electrical insulation and mechanical support, but they are prone to various defects in harsh operating environments, which can damage their mechanical strength and insulation performance. This article proposes the Shuffle YOLOv7 model based on the YOLOv7 algorithm for insulator defect detection, aiming to solve the weakness of low precision in traditional object detection algorithms when facing complex backgrounds and small-sized defects. To address the issue of low attention to flashover faults in traditional algorithms, the ShuffleAttention fusion attention mechanism is supplied to concentrate on both intra-channel and inter-channel deep features, and the original PANet structure is replaced with a pyramid which has a bidirectional feature fusion structure to enhance the network’s feature extraction ability. The Focal-EIOU LOSS optimization method focuses on high-quality prior boxes to improve model accuracy, and the effectiveness of the optimization method is verified through ablation experiments. These results of the experiment show that the proposed algorithm achieves varying degrees of performance improvement in terms of precision, recall, average precision, and overall loss compared to mainstream object detection algorithms in detecting insulator damage and flashover.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2632/1/012013"
    },
    {
        "id": 23335,
        "title": "Bidirectional Gated Recurrent Unit with Glove Embedding and Attention Mechanism for Movie Review Classification",
        "authors": "M Greeshma, Philomina Simon",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2024.03.242"
    },
    {
        "id": 23336,
        "title": "Interpreting Decision of Self-Attention Network’s in the Context of Image Recognition by Efficiently Utilizing Attention Scores",
        "authors": "S.M. Haider Ali Shuvo",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eict61409.2023.10427964"
    },
    {
        "id": 23337,
        "title": "Attention mechanism based bidirectional LSTM model for broadband power amplifier linearization",
        "authors": "Rina Su, Jiacheng Wang, Gaoming Xu, Taijun Liu",
        "published": "2023-7",
        "citations": 1,
        "abstract": "AbstractIn this letter, a novel digital predistortion (DPD) model for broadband power amplifier (PA) linearization is proposed, namely Attention Mechanism based Bidirectional Long Short‐term Memory Network (AM‐BiLSTM) model. In order to verify the linearization performance of the AM‐BiLSTM model in digital predistortion process, a 100 MHz bandwidth 5G new radio (5G NR) signal is employed to test a sub‐6G PA operating at 2.6‐GHz. The experimental results show that the adjacent channel power ratio (ACPR) of the PA with AM‐BiLSTM model can be improved by 24 dB which is 6 dB and 3 dB better than the generalized memory polynomial (GMP) model and the Chebyshev polynomials LSTM (CP‐LSTM) model in ref [1], repspectively. Therefore, the proposed AM‐BiLSTM model is very effective for the DPD linearization of broadband PAs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ell2.12869"
    },
    {
        "id": 23338,
        "title": "Examining the Role of Sustained Attention on Reading Outcomes Within a Context of Childhood Adversity",
        "authors": "Charles Alvarado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2012869"
    },
    {
        "id": 23339,
        "title": "An Anomaly Detection Approach Based on Bidirectional Temporal Convolutional Network and Multi-Head Attention Mechanism",
        "authors": "Rui Wang, Jiayao Li",
        "published": "2024-3-22",
        "citations": 0,
        "abstract": "Anomaly detection aims at detecting the data instances that deviate from the majority of data, and it is widely used in various fields for its ability to ensure the quality of the overall data. However, traditional anomaly detection methods face the problems such as low efficiency due to high data complexity and lack of data labels. At the same time, most methods only learn the forward features of time-series data, while lacking attention to the reverse features. For these disadvantages, this paper designs an anomaly detection approach called BiTCN-MHA based on the bidirectional temporal convolutional network (BiTCN) and multi-head attention (MHA) mechanism, which learns the features of anomalous data by capturing the forward and reverse temporal features in the time-series data, as well as solves the problems of feature information overload and neuron “death” by using MHA mechanism and ELU activation function, respectively, thereby quickly and accurately detecting anomalous data. Extensive experiments on six public datasets show that compared with eight state-of-the-arts, the proposed BiTCN-MHA method can improve the precision, recall, AUC and F1-Score by about 6.10%, 10.16%, 4.06% and 8.50%, respectively, especially having better detection performance on small time-series data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5755/j01.itc.53.1.34254"
    },
    {
        "id": 23340,
        "title": "AB-LSTM: Attention Bidirectional Long Short-Term Memory for Multivariate Time-Series Forecasting",
        "authors": "Xiaofeng Zhou, Andri Pranolo, Yingchi Mao",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2e357697.2023.10262559"
    },
    {
        "id": 23341,
        "title": "Bidirectional Transformer with Sparse Attention for Gastrointestinal Disease Recognition",
        "authors": "Xuewei Cao, Hanlun Guan",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbaie59714.2023.10281350"
    },
    {
        "id": 23342,
        "title": "Relation extraction in Chinese using attention-based bidirectional long short-term memory networks",
        "authors": "Yanzi Zhang",
        "published": "2023-8-17",
        "citations": 1,
        "abstract": "Relation extraction is an important topic in information extraction, as it is used to create large-scale knowledge graphs for a variety of downstream applications. Its goal is to find and extract semantic links between entity pairs in natural language sentences. Deep learning has substantially advanced neural relation extraction, allowing for the autonomous learning of semantic features. We offer an effective Chinese relation extraction model that uses bidirectional LSTM (Bi-LSTM) and an attention mechanism to extract crucial semantic information from phrases without relying on domain knowledge from lexical resources or language systems in this study. The attention mechanism included into the Bi-LSTM network allows for automatic focus on key words. Two benchmark datasets were used to create and test our models: Chinese SanWen and FinRE. The experimental results show that the SanWen dataset model outperforms the FinRE dataset model, with area under the receiver operating characteristic curve values of 0.70 and 0.50, respectively. The models trained on the SanWen and FinRE datasets achieve values of 0.44 and 0.19, respectively, for the area under the precision-recall curve. In addition, the results of repeated modeling experiments indicated that our proposed method was robust and reproducible.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1509"
    },
    {
        "id": 23343,
        "title": "Deep Context Model (DCM): dual context-attention aware model for recognizing the heterogeneous human activities using smartphone sensors",
        "authors": "Prabhat Kumar, S. Suresh",
        "published": "2024-3-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12530-024-09570-z"
    },
    {
        "id": 23344,
        "title": "Enhance the computational edge devices with lightweight attention and transferrable awareness",
        "authors": "J. Petchhan, S. -F. Su",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.3165"
    },
    {
        "id": 23345,
        "title": "Research on Stock Prediction Based on Bidirectional Long Short Term Memory Neural Network Model Based on Attention Mechanism Optimization",
        "authors": "Zhaorui Li",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "The complexity and volatility of financial markets place higher demands on the accuracy of stock forecasts. This paper uses Ping An Daily Market Data as the source of experimental data for empirical analysis, and innovatively combines BiLSTM with attention mechanism for stock price prediction in the experimental process. Introduce an attention mechanism, AM, to reinforce important features by reassigning the weight of each data; Bidirectional LSTM can learn sequential and reverse time series data information to ensure adequate data utilization. After establishing BP (backpropagation), LSTM and CNN-LSTM models for comparison, it is found that the proposed AM-BiLSTM model has high accuracy, good feasibility and versatility.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hbem.v10i.8112"
    },
    {
        "id": 23346,
        "title": "AttG-BDGNets: Attention-Guided Bidirectional Dynamic Graph IndRNN for Non-Intrusive Load Monitoring",
        "authors": "Zuoxin Wang, Xiaohu Zhao",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "Most current non-intrusive load monitoring methods focus on traditional load characteristic analysis and algorithm optimization, lack knowledge of users’ electricity consumption behavior habits, and have poor accuracy. We propose a novel attention-guided bidirectional dynamic graph IndRNN approach. The method first extends sequence or multidimensional data to a topological graph structure. It effectively utilizes the global context by following an adaptive graph topology derived from each set of data content. Then, the bidirectional Graph IndRNN network (Graph IndRNN) encodes the aggregated signals into different graph nodes, which use node information transfer and aggregation based on the entropy measure, power attribute characteristics, and the time-related structural characteristics of the corresponding device signals. The function dynamically incorporates local and global contextual interactions from positive and negative directions to learn the neighboring node information for non-intrusive load decomposition. In addition, using the sequential attention mechanism as a guide while eliminating redundant information facilitates flexible reasoning and establishes good vertex relationships. Finally, we conducted experimental evaluations on multiple open source data, proving that the method has good robustness and accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14070383"
    },
    {
        "id": 23347,
        "title": "An Enhanced Bidirectional Transformer Model with Temporal-Aware Self-Attention for Short-Term Load Forecasting",
        "authors": "Yang Xuan, Chengxin Pang, Haimeng Yu, Xinhua Zeng, Yongbo Chen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3373801"
    },
    {
        "id": 23348,
        "title": "Residual Life Prediction of Rolling Bearings Based on a CEEMDAN Algorithm Fused with CNN–Attention-Based Bidirectional LSTM Modeling",
        "authors": "Xinggang Zhang, Jianzhong Yang, Ximing Yang",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "This paper presents a methodology for predicting the remaining usability of rolling bearings. The method combines a fully adaptive ensemble empirical modal decomposition of noise (CEEMDAN), convolutional neural network (CNN), and attention bidirectional long short-term memory network (ABiLSTM). Firstly, a finite number of intrinsic mode functions (IMFs) are obtained from breaking down the initial vibration signals using CEEMDAN. The IMFs are further screened by combining the correlation criterion and the craggy criterion. Then, time-frequency domain features, which are extracted from the screened IMFs, are reconstructed into a feature set. The SPT is recognized through some features, like the root mean square (RMS), variance, and kurtosis. Secondly, the deterioration character of rolling bearings was extracted using CNN and used to train the ABiLSTM network. Based on the output of the ABiLSTM network, it forecasts how long rolling bearings will last during use. Finally, the XJTU-SY rolling bearing dataset validated the validity of the suggested rolling bearing remaining life prediction method. We compare our algorithm with other algorithms, such as GRU, LSTM, and CNN–BiLSTM, in which the accuracy of MAE, MSE, RMSE, MAPE, and R2_score is significantly improved. Thus, the results of the validation experiments demonstrate that our proposed algorithm has excellent prediction accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/pr12010008"
    },
    {
        "id": 23349,
        "title": "Bidirectional spatial–temporal traffic data imputation via graph attention recurrent neural network",
        "authors": "Guojiang Shen, Wenfeng Zhou, Wenyi Zhang, Nali Liu, Zhi Liu, Xiangjie Kong",
        "published": "2023-4",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.02.017"
    },
    {
        "id": 23350,
        "title": "Bridging the Gap: Enhancing Storm Surge Prediction and Decision Support with Bidirectional Attention-Based LSTM",
        "authors": "Vai-Kei Ian, Rita Tse, Su-Kit Tang, Giovanni Pau",
        "published": "2023-6-27",
        "citations": 6,
        "abstract": "Accurate storm surge forecasting is vital for saving lives and avoiding economic and infrastructural damage. Failure to accurately predict storm surge can have catastrophic repercussions. Advances in machine learning models show the ability to improve accuracy of storm surge prediction by leveraging vast amounts of historical and realtime data such as weather and tide patterns. This paper proposes a bidirectional attention-based LSTM storm surge architecture (BALSSA) to improve prediction accuracy. Training and evaluation utilized extensive meteorological and tide level data from 77 typhoon incidents in Hong Kong and Macao between 2017 and 2022. The proposed methodology is able to model complex non-linearities between large amounts of data from different sources and identify complex relationships between variables that are typically not captured by traditional physical methods. BALSSA effectively resolves the problem of long-term dependencies in storm surge prediction by the incorporation of an attention mechanism. It enables selective emphasis on significant features and boosts the prediction accuracy. Evaluation has been conducted using real-world datasets from Macao to validate our storm surge prediction model. Results show that accuracy and robustness of predictions were significantly improved by the incorporation of attention mechanisms in our models. BALSSA captures temporal dynamics effectively, providing highly accurate storm surge forecasts (MAE: 0.0126, RMSE: 0.0003) up to 72 h in advance. These findings have practical significance for disaster risk reduction strategies, saving lives through timely evacuation and early warnings. Experiments comparing BALSSA variations with other machine learning algorithms consistently validate BALSSA’s superior predictive performance. It offers an additional risk management tool for civil-protection agencies and governments, as well as an ideal solution for enhancing storm surge prediction accuracy, benefiting coastal communities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/atmos14071082"
    },
    {
        "id": 23351,
        "title": "Retracted: English-Chinese Machine Translation Model Based on Bidirectional Neural Network with Attention Mechanism",
        "authors": "Journal of Sensors",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9873845"
    },
    {
        "id": 23352,
        "title": "CTBANet: Convolution transformers and bidirectional attention for medical image segmentation",
        "authors": "Sha Luo, Li Pan, Yuanming Jian, Yunjiao Lu, Sisi Luo",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aej.2024.01.018"
    },
    {
        "id": 23353,
        "title": "A Bidirectional LSTM Log Detection Model Based on Attention Mechanism",
        "authors": "Ruyu Li, Yuhan Fu, Chao Li, Xi Luo",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icftic59930.2023.10455900"
    },
    {
        "id": 23354,
        "title": "Conceptualizing Students’ Language Awareness across Educational Levels in the Context of Plurilingual Education: Within- and Cross-Case Findings from Grades 1, 7 and 11",
        "authors": "Petra Daryai-Hansen, Natascha Drachmann, Line Krogager Andersen",
        "published": "2024-1-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09658416.2023.2300268"
    },
    {
        "id": 23355,
        "title": "A Focused Approach to Mindful Attention Awareness and Emotion Regulation: Vipassana Meditation",
        "authors": "Santwana Mani, Prabhat Kumar Mishra",
        "published": "2023-2-9",
        "citations": 0,
        "abstract": "The purpose of this study is to investigate the relationship between mindful attention\r\nawareness and emotion regulation as well as the effect of vipassana meditation on\r\nthese two constructs. The Mindfulness Attention Awareness Scale (MAAS-15) and\r\nDifficulties in Emotion Regulation (DERS-36) are used for data collection. Out of 248\r\nparticipants, 123 are Vipassana Meditators, who practised Vipassana Meditation at\r\nleast five times per week for the previous two years and had attended at least one 10-\r\nday Vipassana Meditation Course from any Vipassana Centre, and 125 are nonmeditators,\r\nwho did not practise any meditation at all. The obtained data analysis was\r\ndone on SPSS-25 and found to have a significant relationship between mindful attention\r\nawareness and emotional regulation. The results also revealed that there is a significant\r\ndifference in the samples’ mindful awareness and emotional regulation. The results of\r\nthe study help to complement and understand clearly, as well as present a unique\r\ncontribution to the current body of information on Vipassana Meditation and its highly\r\nbeneficial impact.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56011/mind-mri-114-20229"
    },
    {
        "id": 23356,
        "title": "BGAT: Aspect-based sentiment analysis based on bidirectional GRU and graph attention network",
        "authors": "Xinyu Zhang, Long Yu, Shengwei Tian",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "In today’s social media and various frequently used lifestyle applications, the phenomenon that people express their sentiment via comments or instant barrage is common. People not only show their joys and sorrows in the process of expression but also present their opinions to one thing in many aspects which include. Nowadays, aspect-based sentiment analysis has become a mature and wildly-used technology. There are many public datasets considered as a benchmark to test model performance, such as Laptop2014, Restaurant2014, Twitter, etc. In our work, we also use these public datasets as the test criteria. Current mainstream models generally use the methods of stacking multi-RNNs layers or combining neural networks and BERT or other pre-trained models. On account of the importance displayed by the dependence between aspect words and sentiment words, we investigate a novel model (BGAT) blending bidirectional gated recurrent unit (BiGRU) and relational graph attention network (RGAT) to learn dependencies information. Extensive experiments have been conducted on five datasets, the results demonstrate the great capability of our model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-213020"
    },
    {
        "id": 23357,
        "title": "Research on Machine Reading Comprehension Model Based on Bidirectional Attention",
        "authors": "Chenglin Jiang, Ning Ma, Fucheng Wan",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263287"
    },
    {
        "id": 23358,
        "title": "Bidirectional longitudinal associations between attention deficit hyperactivity disorder and physical health in a large cohort dataset",
        "authors": "C. Reed, D. Golm, S. Cortese, V. Brandt",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.nsa.2023.102722"
    },
    {
        "id": 23359,
        "title": "The Role of Critical Thinking in Exploring of Intercultural Awareness in an EFL Context",
        "authors": "Dr. Abdelazeem Othman Mohmmad Ali,  ",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "This study investigates the Integrating Critical Thinking into Exploration of Intercultural Awareness in an EFL Context. The study aims to find out the role of critical thinking skill in improving university students’ intercultural awareness competencies. The population of the study represented in English language teaching staff in Sudanese universities as well as students. The study sample is represented in a randomly chosen group of (240) English language teachers and students. Data will be processed via Statistical Packages of Social Sciences (SPSS). The study makes use of descriptive analytical method. The study has arrived to a number of findings, the most important which are the integration of critical thinking skill is significant in English language context as a foreign language along with an insignificant and limited capacity of the textbooks to develop students’ critical thinking. The study recommends involving EFL learners in critical thinking skills to enhance their intercultural.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijsshr/v6-i1-10"
    },
    {
        "id": 23360,
        "title": "Integration of context awareness in Internet of Agricultural Things",
        "authors": "Nadeem Javaid",
        "published": "2023-4",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.icte.2021.09.004"
    },
    {
        "id": 23361,
        "title": "Reviewing the Significance of Attention and Awareness for Developing Learner-Centric Taxonomy",
        "authors": "Rohini Ravi, Manali Karmakar",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "Attention and awareness are complexly interconnected and are conceived to be the two crucial cognitive components for a holistic learning experience. However, this paper claims that teaching and learning instructional materials, educational taxonomies, and evaluation strategies have not given due importance to cultivating these two cognitive components for effective learning. To substantiate its claim, this paper aims to offer a review of a range of educational taxonomies to foreground how two of the most crucial cognitive components integrally connected to critical thinking abilities are not discussed. The paper argues that a study of this kind will enable us to identify the gaps hindering the goal of achieving the concept of critical pedagogy. The paper will also offer an in-depth review of literature from the domains of cognitive science, neuroanatomical science, and language education to assert the significance of attention and awareness. The paper's originality lies in its ability to propose an eclectic learner-centric taxonomy that could be adopted for achieving the goals of critical pedagogy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33423/jhetp.v23i14.6388"
    },
    {
        "id": 23362,
        "title": "Short-term load forecasting with bidirectional LSTM-attention based on the sparrow search optimisation algorithm",
        "authors": "Jiahao Wen, Zhijian Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcse.2023.129154"
    },
    {
        "id": 23363,
        "title": "Retracted: Research on the Construction of a Bidirectional Neural Network Machine Translation Model Fused with Attention Mechanism",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9782682"
    },
    {
        "id": 23364,
        "title": "BiLSTCAN: A Novel SRS-Based Bidirectional Long Short-Term Capsule Attention Network for Dynamic User Preference and Next-Item Recommendation",
        "authors": "Nikorn Kannikaklang, Wachirawut Thamviset, Sartra Wongthanavasu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3351283"
    },
    {
        "id": 23365,
        "title": "Bidirectional feature pyramid attention-based temporal convolutional network model for motor imagery electroencephalogram classification",
        "authors": "Xinghe Xie, Liyan Chen, Shujia Qin, Fusheng Zha, Xinggang Fan",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "IntroductionAs an interactive method gaining popularity, brain-computer interfaces (BCIs) aim to facilitate communication between the brain and external devices. Among the various research topics in BCIs, the classification of motor imagery using electroencephalography (EEG) signals has the potential to greatly improve the quality of life for people with disabilities.MethodsThis technology assists them in controlling computers or other devices like prosthetic limbs, wheelchairs, and drones. However, the current performance of EEG signal decoding is not sufficient for real-world applications based on Motor Imagery EEG (MI-EEG). To address this issue, this study proposes an attention-based bidirectional feature pyramid temporal convolutional network model for the classification task of MI-EEG. The model incorporates a multi-head self-attention mechanism to weigh significant features in the MI-EEG signals. It also utilizes a temporal convolution network (TCN) to separate high-level temporal features. The signals are enhanced using the sliding-window technique, and channel and time-domain information of the MI-EEG signals is extracted through convolution.ResultsAdditionally, a bidirectional feature pyramid structure is employed to implement attention mechanisms across different scales and multiple frequency bands of the MI-EEG signals. The performance of our model is evaluated on the BCI Competition IV-2a dataset and the BCI Competition IV-2b dataset, and the results showed that our model outperformed the state-of-the-art baseline model, with an accuracy of 87.5 and 86.3% for the subject-dependent, respectively.DiscussionIn conclusion, the BFATCNet model offers a novel approach for EEG-based motor imagery classification in BCIs, effectively capturing relevant features through attention mechanisms and temporal convolutional networks. Its superior performance on the BCI Competition IV-2a and IV-2b datasets highlights its potential for real-world applications. However, its performance on other datasets may vary, necessitating further research on data augmentation techniques and integration with multiple modalities to enhance interpretability and generalization. Additionally, reducing computational complexity for real-time applications is an important area for future work.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fnbot.2024.1343249"
    },
    {
        "id": 23366,
        "title": "Forecasting Ionospheric foF2 Using Bidirectional LSTM and Attention Mechanism",
        "authors": "Jun Tang, Dengpan Yang, Mingfei Ding",
        "published": "2023-11",
        "citations": 0,
        "abstract": "AbstractThe critical frequency of ionospheric F2 layer (foF2) is an important ionospheric characteristic parameter. In this paper, a deep learning model based on Bidirectional long short‐term memory (BiLSTM) and attention mechanism is implemented for predicting the foF2 parameter. The inputs of models are the foF2 of globally available ionospheric ionosonde stations, geographic longitude and latitude, world time (UT), geomagnetic activity index, and solar activity index from 2015 to 2017. The superiority of the model is analyzed from different latitudes, seasons, and geomagnetic conditions. The results show that the prediction performance of the Bidirectional long short‐term memory model based on attention mechanism (BiLSTM‐Attention) is better than other models. The performance of the prediction model is optimal at high latitudes. The root mean square error (RMSE) and correlation coefficient (R) of the BiLSTM‐Attention model are 0.539 MHZ and 0.908 MHz at high latitudes, respectively. In terms of RMSE, it is 25.243%, 18.209%, and 11.203% lower than those of the international reference ionosphere (IRI), LSTM, and BiLSTM models, respectively. The prediction results of the four seasons show that the models are more applicable in winter. Compared with the IRI model, the RMSE of the BiLSTM‐Attention model in spring, summer, autumn, and winter is reduced by 24.344%, 21.181%, 25.058%, and 30.948%, respectively. The prediction effect of the BiLSTM‐Attention model is improved in the magnetic quiet period, the magnetic moderate period and the magnetic storm period. Also, the improvement effect is more obvious in the magnetostatic day, and the RMSE is reduced by 27.462% compared with the IRI model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2023sw003508"
    },
    {
        "id": 23367,
        "title": "An Integrated Usage of Bidirectional LSTM and Computer-based Cognitive Attention to Categorize Speech Stutters",
        "authors": "Krishna Basak, Vineet Sharma, Sarangh Ramesh Kv, Nilamadhab Mishra",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icais56108.2023.10073818"
    },
    {
        "id": 23368,
        "title": "A short text clustering study integrating context-awareness and contrast learning",
        "authors": "Qiaonan Zhang, Yuan Liu",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00112"
    },
    {
        "id": 23369,
        "title": "Probing Brain Context-Sensitivity with Masked-Attention Generation",
        "authors": "Alexandre Pasquiou, Yair Lakretz, Bertrand Thirion, Christophe Pallier",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1443-0"
    },
    {
        "id": 23370,
        "title": "Bidirectional Long-Short-Term Memory with Attention Mechanism for Emotion Analysis in Textual Content",
        "authors": "Batyrkhan Omarov, Zhandos Zhumanov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140615"
    },
    {
        "id": 23371,
        "title": "ACBiGRU-DAO: Attention Convolutional Bidirectional Gated Recurrent Unit-based Dynamic Arithmetic Optimization for Air Quality Prediction",
        "authors": "Vinoth Panneerselvam, Revathi Thiagarajan",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-023-28028-4"
    },
    {
        "id": 23372,
        "title": "Urban Traffic Flow Data Imputation Based on Graph Attention Bidirectional Gated Recurrent Neural Network",
        "authors": "Xueying Qi, Weijian HU, Baoshan Li",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipcv57033.2023.00026"
    },
    {
        "id": 23373,
        "title": "Learning Salient Features for Speech Emotion Recognition using Attention-based Residual Bidirectional LSTM with Federated Learning",
        "authors": "Dilsheen Kaur, Anuradha Misra, O.P. Vyas",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaect60202.2024.10469176"
    },
    {
        "id": 23374,
        "title": "Facial emotion recognition on video using deep attention based bidirectional LSTM with equilibrium optimizer",
        "authors": "Ramachandran Vedantham, Edara Sreenivasa Reddy",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14491-1"
    },
    {
        "id": 23375,
        "title": "AB-GRU: An attention-based bidirectional GRU model for multimodal sentiment fusion and analysis",
        "authors": "Jun Wu, Xinli Zheng, Jiangpeng Wang, Junwei Wu, Ji Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "<abstract><p>Multimodal sentiment analysis is an important area of artificial intelligence. It integrates multiple modalities such as text, audio, video and image into a compact multimodal representation and obtains sentiment information from them. In this paper, we improve two modules, i.e., feature extraction and feature fusion, to enhance multimodal sentiment analysis and finally propose an attention-based two-layer bidirectional GRU (AB-GRU, gated recurrent unit) multimodal sentiment analysis method. For the feature extraction module, we use a two-layer bidirectional GRU network and connect two layers of attention mechanisms to enhance the extraction of important information. The feature fusion part uses low-rank multimodal fusion, which can reduce the multimodal data dimensionality and improve the computational rate and accuracy. The experimental results demonstrate that the AB-GRU model can achieve 80.9% accuracy on the CMU-MOSI dataset, which exceeds the same model type by at least 2.5%. The AB-GRU model also possesses a strong generalization capability and solid robustness.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2023822"
    },
    {
        "id": 23376,
        "title": "Customer sentiment recognition in conversation based on bidirectional LSTM and self-attention mechanism",
        "authors": "Zhengwei Huang, Huayuan Liu, Chen Duan, Jintao Min",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "In the E-commerce environment, conversations between customers and businesses contain lots of useful information about customer sentiment. By mining that information, customer sentiment can be validly identified, which is helpful in accurately identifying customer needs and improving customer satisfaction. For conversational sentiment analysis, most existing approaches take contextual information into account. On this basis, we focus on the degree of association between utterances, which can more effectively capture overall and useful sentiment information in conversation. For this purpose, we propose a hybrid model to recognize customer sentiment in conversation. The model obtains utterance vectors with sentiment information through Sentiment Knowledge Enhanced Pre-training (SKEP), then uses the bidirectional long short-term memory network (BiLSTM) to generate contextual semantic information, and further obtains customer sentiment information by applying the self-attention mechanism to focus on the degree of association between utterances. The experimental results on the JD Dialog dataset show that our model can more accurately recognize customer sentiment than other baseline models in customer service conversation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-224183"
    },
    {
        "id": 23377,
        "title": "A Short Text Sentiment Analysis Model Combined with Attention Mechanism of Bidirectional Affective Words",
        "authors": "Yong Xu, Xiaoyu Li, Hengna Wang, Hao Chang",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "Short text sentiment in social media platforms has important research value. Due to the convolution kernel parameter sharing and pooling operation, convolutional neural network training speed is fast, and the effect is also good. However, most work such as max-pooling, average-pooling, more or less discard some of the secondary features, which makes the final expression of emotion possibly biased. So, in this paper, the attention mechanism applies to the pooling layer of CNN, and a Convolutional Neural Network based on double sentiment word attention pooling (DSA-CNN) is proposed. Each feature has its weight to be calculated. We also note that in the attention mechanism of text classification, the attention query vector is usually randomly initialized during network training, rather than using an existing vector--the semantic information of the previous moment, as in machine translation. Therefore, we use the emotion dictionary and emotion corpus to train bidirectional affective word vectors, so that the emotion-related features can interact with them in the attention. The experiment shows that DSA-CNN has achieved better performance than the classical classification model in a dataset of Weibo nCoV Data, NLPCC 2014, and yf_dianping. The accuracy of the model is 2.18% higher than that of the second-best model. Besides, the convergence rate of DSA-CNN is also significantly improved. The highest accuracy was achieved only in the third epochs, while CNN using the max-pooling needed 14 epochs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jceim.v11i1.9474"
    },
    {
        "id": 23378,
        "title": "Bidirectional self-Attention Gated Recurrent Unit for Health Index Prediction of Rolling Bearings",
        "authors": "Jingwei Li, Sai Li, Zhixia Ding, Aiai Zheng, Xuan Ye",
        "published": "2023-7-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10241055"
    },
    {
        "id": 23379,
        "title": "BiTCN-CA: malicious code detection method based on bidirectional temporal convolution network and channel attention",
        "authors": "Sicong Li, Jian Wang, Xiangke Guo",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3012109"
    },
    {
        "id": 23380,
        "title": "Gated bidirectional pyramid context network for infrared maritime target detection",
        "authors": "Guangrui Lv, Lili Dong, Junke Liang, Wenhai Xu",
        "published": "2023-6-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2680520"
    },
    {
        "id": 23381,
        "title": "Infusing Context and Knowledge Awareness in Multi-turn Dialog Understanding",
        "authors": "Ting-Wei Wu, Biing-Hwang Juang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.19"
    },
    {
        "id": 23382,
        "title": "Object detection in aerial remote sensing images using bidirectional enhancement FPN and attention module with data augmentation",
        "authors": "Peng Yang, Dashuai Yu, Guowei Yang",
        "published": "2023-10-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16973-8"
    },
    {
        "id": 23383,
        "title": "Assessing the Risk of Extreme Storm Surges from Tropical Cyclones under Climate Change Using Bidirectional Attention-Based LSTM for Improved Prediction",
        "authors": "Vai-Kei Ian, Su-Kit Tang, Giovanni Pau",
        "published": "2023-11-28",
        "citations": 1,
        "abstract": "Accurate prediction of storm surges is crucial for mitigating the impact of extreme weather events. This paper introduces the Bidirectional Attention-based Long Short-Term Memory (LSTM) Storm Surge Architecture, BALSSA, addressing limitations in traditional physical models. By leveraging machine learning techniques and extensive historical and real-time data, BALSSA significantly enhances prediction accuracy. Utilizing a bidirectional attention-based LSTM framework, it captures complex, non-linear relationships and long-term dependencies, improving the accuracy of storm surge predictions. The enhanced model, D-BALSSA, further amplifies predictive capability through a doubled bidirectional attention-based structure. Training and evaluation involve a comprehensive dataset from over 70 typhoon incidents in Macao between 2017 and 2022. The results showcase the outstanding performance of BALSSA, delivering highly accurate storm surge forecasts with a lead time of up to 72 h. Notably, the model exhibits a low Mean Absolute Error (MAE) of 0.0287 m and Root Mean Squared Error (RMSE) of 0.0357 m, crucial indicators measuring the accuracy of storm surge predictions in water level anomalies. These metrics comprehensively evaluate the model’s accuracy within the specified timeframe, enabling timely evacuation and early warnings for effective disaster mitigation. An adaptive system, integrating real-time alerts, tropical cyclone (TC) chaser, and prospective visualizations of meteorological and tidal measurements, enhances BALSSA’s capabilities for improved storm surge prediction. Positioned as a comprehensive tool for risk management, BALSSA supports decision makers, civil protection agencies, and governments involved in disaster preparedness and response. By leveraging advanced machine learning techniques and extensive data, BALSSA enables precise and timely predictions, empowering coastal communities to proactively prepare and respond to extreme weather events. This enhanced accuracy strengthens the resilience of coastal communities and protects lives and infrastructure from the escalating threats of climate change.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/atmos14121749"
    },
    {
        "id": 23384,
        "title": "Multimodal Abstractive Summarization using bidirectional encoder representations from transformers with attention mechanism",
        "authors": "Dakshata Argade, Vaishali Khairnar, Deepali Vora, Shruti Patil, Ketan Kotecha, Sultan Alfarhood",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e26162"
    },
    {
        "id": 23385,
        "title": "Sentiment classification using bidirectional LSTM-SNP model and attention mechanism",
        "authors": "Yanping Huang, Qian Liu, Hong Peng, Jun Wang, Qian Yang, David Orellana-Martín",
        "published": "2023-7",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119730"
    },
    {
        "id": 23386,
        "title": "Concealed Carry, Agency, and Attention in a Technocratic Context",
        "authors": "Luis G. Vera",
        "published": "2023-10-24",
        "citations": 0,
        "abstract": "Standard discussions about guns as technologies focus on whether guns influence free choices or mediate sociocultural dynamics related to race, class, or gender. This article resituates these questions in a broader context by approaching guns from the perspective of Pope Francis’s critique of the “technocratic paradigm” as a general sociocultural force in its own right. Specifically, the article examines how concealed-carry armed citizenship participates in or resists the technocratic construal of the world as raw material to be freely manipulated for the utility and security of an unsituated autonomous subject. While armed citizenship clearly participates in the technocratic paradigm in its consistent depiction of potential assailants as irrational outsiders to be controlled through technical force, it also appears to resist that paradigm in its active search for meaningful skilled agency and in its potentially world-disclosing practice of “situational awareness.” Closer reflection reveals that in both latter cases concealed carry is caught in a cycle of failed resistance. Its search for skilled agency is thwarted by a myth of unsituated responsibility that undercuts the sociocultural conditions for such agency. Meanwhile, situational awareness fails to disclose the world (and resist distorting influences) because it anticipates for actions one cannot regularly practice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55476/001c.89312"
    },
    {
        "id": 23387,
        "title": "Speech-Text Based Multi-Modal Training with Bidirectional Attention for Improved Speech Recognition",
        "authors": "Yuhang Yang, Haihua Xu, Hao Huang, Eng Siong Chng, Sheng Li",
        "published": "2023-6-4",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10096726"
    },
    {
        "id": 23388,
        "title": "Intrusion Detection Based on Bidirectional Long Short-Term Memory with Attention Mechanism",
        "authors": "Yongjie Yang, Shanshan Tu, Raja Hashim Ali, Hisham Alasmary, Muhammad Waqas, Muhammad Nouman Amjad",
        "published": "2023",
        "citations": 36,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.031907"
    },
    {
        "id": 23389,
        "title": "Shared genetics and bidirectional causal relationships between type 2 diabetes and attention-deficit/hyperactivity disorder",
        "authors": "Ancha Baranova, Vikas Chandhoke, Hongbao Cao, Fuquan Zhang",
        "published": "2023-3",
        "citations": 10,
        "abstract": "BackgroundType 2 diabetes (T2D) is a chronic metabolic disorder with high comorbidity with mental disorders. The genetic links between attention-deficit/hyperactivity disorder (ADHD) and T2D have yet to be elucidated.AimsWe aim to assess shared genetics and potential associations between ADHD and T2D.MethodsWe performed genetic correlation, two-sample Mendelian randomisation and polygenic overlap analyses between ADHD and T2D. The genome-wide association study (GWAS) summary results of T2D (80 154 cases and 853 816 controls), ADHD2019 (20 183 cases and 35 191 controls from the 2019 GWAS ADHD dataset) and ADHD2022 (38 691 cases and 275 986 controls from the 2022 GWAS ADHD dataset) were used for the analyses. The T2D dataset was obtained from the DIAGRAM Consortium. The ADHD datasets were obtained from the Psychiatric Genomics Consortium. We compared genome-wide association signals to reveal shared genetic variation between T2D and ADHD using the larger ADHD2022 dataset. Moreover, molecular pathways were constructed based on large-scale literature data to understand the connection between ADHD and T2D.ResultsT2D has positive genetic correlations with ADHD2019 (rg=0.33) and ADHD2022 (rg=0.31). Genetic liability to ADHD2019 was associated with an increased risk for T2D (odds ratio (OR): 1.30, p<0.001), while genetic liability to ADHD2022 had a suggestive causal effect on T2D (OR: 1.30, p=0.086). Genetic liability to T2D was associated with a higher risk for ADHD2019 (OR: 1.05, p=0.001) and ADHD2022 (OR: 1.03, p<0.001). The polygenic overlap analysis showed that most causal variants of T2D are shared with ADHD2022. T2D and ADHD2022 have three overlapping loci. Molecular pathway analysis suggests that ADHD and T2D could promote the risk of each other through inflammatory pathways.ConclusionsOur study demonstrates substantial shared genetics and bidirectional causal associations between ADHD and T2D.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/gpsych-2022-100996"
    },
    {
        "id": 23390,
        "title": "Unfolding language awareness in a plurilingual context: A study of metalinguistic, practical, and critical language awareness",
        "authors": "Line Krogager Andersen",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractAs part of a larger project investigating language awareness in plurilingual settings across educational levels through a multiple case study, this article zooms in on students’ language awareness as it unfolds in a classroom in a Danish upper secondary school, in the context of a compulsory, plurilingual general language awareness course. Considering language awareness as a sociocognitive phenomenon that may meaningfully be observed through students’ engagement with language in the classroom, qualitative data were collected through observation, interviews, and collections of student work, and analyzed using an abductive form of qualitative content analysis. The initial deductive analysis is based on a theoretical model of language awareness; additional, inductive analyses lead to more nuanced descriptions of students’ metalinguistic, practical, and critical language awareness. Finally, a contextualized analysis of one example is given to illustrate the collaborative unfolding of language awareness in this context, leading to the conclusion that the different forms of language awareness studied are often interlinked and that they should be viewed as such both in research and teaching practice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/modl.12912"
    },
    {
        "id": 23391,
        "title": "Scene text recognition with context-aware autonomous bidirectional iterative models",
        "authors": "Xiaoqing Zhao, Miaomiao Xu, Yanbing Li, Hao Huang, Wushour Silamu",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": " This research focuses on Scene Text Recognition (STR), a crucial component in various applications of artificial intelligence such as image retrieval, office automation, and intelligent traffic systems. Recent studies have shown that semantic-aware approaches significantly improve the performance of STR tasks, with context-aware STR methods becoming mainstream. Among these, the fusion of visual and language models has shown remarkable effectiveness. We propose a novel method (PABINet) that incorporates three key components: a Visual-Language Decoder, a Language Model, and a Fusion Model. First, during training, the Visual-Language Decoder masks the original labels in the Transformer decoder using permutation masks, with each mask being unique. This enhances word memorization and learning through contextual semantic information, resulting in robust semantic knowledge. During the inference stage, the Visual-Language Decoder employs autonomous Autoregressive model (AR) inference to generate results. Subsequently, the Language Model scrutinizes and corrects the output of the Visual-Language Encoder using a cloze mask approach, achieving context-aware, autonomous, bidirectional inference. Finally, the Fusion Model concatenates and refines the outputs of both models through iterative layers.Experimental results demonstrate that our PABINet performs exceptionally well when handling various quality images. When trained with synthetic data, PABINet achieves a new STR benchmark (average accuracy of 92.41%), and when trained with real data, it establishes new state-of-the-art results (average accuracy of 96.28%).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-237135"
    },
    {
        "id": 23392,
        "title": "The Phenomenon of Legal Awareness: Historical and Philosophical Reception in the Context of Educational Problems",
        "authors": "Oleg Yur'evich Akimov",
        "published": "2023-2",
        "citations": 0,
        "abstract": "\n The study of the legal awareness in the educational space presumes its exposition as a universal phenomenon. This phenomenon combines two mutually agreed aspects. One aspect includes the theory of the legal awareness, that is determined with the philosophical reception of such concepts as the natural right and the positive right. The another aspect  concerns the practical forms, that help to realize the legal awareness in the educational space by means of the creation of  the special educational environment. The theoretical analysis of the phenomenon of the legal awareness  shows  the complexity of this problem, that connects  legal and social sides of the phenomenon. The mutual integration of this directions is possible only on the theoretical level and basis on the grounds of the idealist philosophy by Kant, Hegel, Ilijin. The another possibility of such exposition  gives the materialist philosophy primarily the marxism. This state can be explained with the antinomy of the phenomenon of the legal awareness. This antinomy allows the situations, when the special features of the phenomenon do not correspond with each other, but its unity keeps safer. This unity keeps safer  by means of the theory of the reflection, that accentuates the material external world. The another way of the realization of this unity is connected with the idealist philosophy, that considers the legal awareness as  the special structure- third option that corresponds with the human personality as the potency and the educational environment only realizes this third option. The modern theories of forming of educational environment in the educational space, created by V. V. Rubzov, V. A. Jasvin, V.I. Svobodchikov, V. I. Panov  integrate this two approaches and emphasize the dialogical features of educational environment and do not reduce it to the ideal or material grounds.\n\t",
        "keywords": "",
        "link": "http://dx.doi.org/10.7256/2454-0676.2023.2.43429"
    },
    {
        "id": 23393,
        "title": "Short-term Wind Power Probabilistic Forecasting Based on Attention Mechanism and Bidirectional LSTM",
        "authors": "Naixiao Wang, Xinlei Cai, Zhuofan Xu, Yufeng Guo, Tingxiang Zhang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/segre58867.2023.00036"
    },
    {
        "id": 23394,
        "title": "Prediction method of business process remaining time based on attention bidirectional recurrent neural network",
        "authors": "Ali Fakhri Mahdi Al-Jumaily, Abdulmajeed Al-Jumaily, Saba Jasim Al-Jumaili",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "<p align=\"justify\">Most of the existing deep learning-based business process remaining time prediction methods use traditional long-short-term memory recurrent neural networks to build prediction models. Due to the limited modeling ability of traditional long-short-term memory recurrent neural networks for sequence data, and existing methods there is still much room for improvement in the prediction effect. Aiming at the shortcomings of existing methods, this paper proposes a business process remaining time prediction method based on attention bidirectional recurrent neural network. The method uses a bidirectional recurrent neural network to model the process instance data and introduces an attention mechanism to automatically learn the weights of different events in the process instance. In addition, in order to further improve the learning effect, an iterative learning strategy is designed based on the idea of transfer learning, which builds remaining time prediction models for process instances of different lengths, which improves the pertinence of the model. The experimental results show that the proposed method has obvious advantages compared with traditional methods.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v6i1.639"
    },
    {
        "id": 23395,
        "title": "Smart EV Charging With Context-Awareness: Enhancing Resource Utilization via Deep Reinforcement Learning",
        "authors": "Muddsair Sharif, Huseyin Seker",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3351360"
    },
    {
        "id": 23396,
        "title": "Erratum: Path Prediction for Fishing Boats Using Attention-Based Bidirectional Gated Recurrent Unit",
        "authors": "Sang-Lok Yoo, Kyounghoon Lee, Won-Kyung Baek, Kwang-Il Kim",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12601-024-00135-4"
    },
    {
        "id": 23397,
        "title": "EFL teachers’ awareness of dyslexia",
        "authors": "Musa Nushi, Mitra Eshraghi",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "Abstract\nDyslexia is one of the most common learning disabilities among\n                    students, and teachers are often the very first to notice dyslexic students. It\n                    is therefore imperative that teachers be well-prepared to intervene\n                    appropriately and effectively once they encounter dyslexic students. The current\n                    study investigates teachers’ knowledge about the disorder in an English as a\n                    foreign language (EFL) context. Employing a questionnaire designed by Soriano et al. (2016), the study\n                    evaluates the awareness of dyslexia among 84 Iranian English teachers working in\n                    language institutes. The findings revealed that the majority of the teachers\n                    lacked adequate knowledge of the disorder but that they wished to learn more\n                    about this learning disability. Furthermore, the teachers’ awareness of the\n                    disorder was found to be independent of their demographic characteristics such\n                    as gender, previously completed programs, years of teaching experience, and\n                    experience with dyslexic students. The findings of this research can be\n                    informative for teacher educators, curriculum designers, and materials\n                    developers as there seems to be a need for revisions in teacher training\n                    curricula, instructional policies, and materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1075/aila.22004.mus"
    },
    {
        "id": 23398,
        "title": "Islamic Banking Customer Engagement and Awareness: Exploring an African Context",
        "authors": "Riyad Moosa",
        "published": "2023-1-31",
        "citations": 1,
        "abstract": "The Islamic banking industry is a niche market within the South African banking industry. Information is needed on the profile of customers and their level of awareness concerning activities at Islamic banks. Thus, the objectives of this study are to identify the banking engagements and level of CSR awareness among customers of Islamic banks in South Africa. The study used non-probability sampling to collect data via a questionnaire from 163 respondents throughout South Africa, which was analysed using descriptive statistics. The results indicate that respondents sought out Islamic banking for themselves; they also had a long-standing relationship with the Islamic bank and mainly used saving, current, and investment accounts. The findings also showed that respondents needed to be made aware of the CSR activities undertaken by the Islamic banks, and they could have engaged in CSR activities more regularly. Thus, those in management at Islamic banks are encouraged to engage in proactively making their Sharia-compliant offerings and CSR activities visible.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15575/ijik.v13i1.23604"
    },
    {
        "id": 23399,
        "title": "Short-term wind power forecasting by bidirectional attention mechanism LSTM and its probability interval prediction by sliding-window KDE",
        "authors": "Xin Liu, Peijuan Li, Baochun Xu",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Deterministic point wind power forecasting (DP-WPF) and its probability interval prediction (PIP) are indispensable to short-term peak alleviation and frequency regulation in power systems with large-scale wind power injection. To improve short-term DP-WPF by long short-term memory (LSTM), a horizontal/vertical bidirectional feature attention (BFA) based LSTM model is proposed. More specifically, the BFA-LSTM model has three parts: first, multivariate time series are fed into LSTM to extract long-short-term temporal features; second, the LSTM outputs are processed horizontally as well as vertically for retrieving step-wise/multistep-wise temporal features, respectively, namely, in the bidirectional attention sense; third, both the horizontal and vertical attention weights are adaptively adjusted according to the feature importance in DP-WPF. Cases comparison shows that the suggested modeling is stably superior to most common counterparts. To address PIP by kernel density estimation (KDE), sliding-window KDE is leveraged for probability analysis. More precisely, probability density functions (PDF) and probability intervals are estimated with sliding-window samples, which are non-parametric operations and involve finitely many local samples. Superior performances of PIP by sliding-window KDE at different confidence levels indicate that the sliding-window PDF approach is highly effective in contrast to those with all samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0164374"
    },
    {
        "id": 23400,
        "title": "Hybrid attention-based temporal convolutional bidirectional LSTM approach for wind speed interval prediction",
        "authors": "Bala Saibabu Bommidi, Vishalteja Kosana, Kiran Teeparthi, Santhosh Madasthu",
        "published": "2023-1-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-022-24641-x"
    },
    {
        "id": 23401,
        "title": "Rice leaf disease detection based on bidirectional feature attention pyramid network with YOLO v5 model",
        "authors": "V Senthil Kumar, M Jaganathan, A Viswanathan, M Umamaheswari, J Vignesh",
        "published": "2023-6-1",
        "citations": 7,
        "abstract": "Abstract\nTo ensure higher quality, capacity, and production of rice, it is vital to diagnose rice leaf disease in its early stage in order to decrease the usage of pesticides in agriculture which in turn avoids environmental damage. Hence, this article presents a Multi-scale YOLO v5 detection network to detect and classify the rice crop disease in its early stage. The experiment is initially started by pre-processing the rice leaf images obtained from the RLD dataset, after which data set labels are created, which are then divided into train and test sets. DenseNet-201 is used as the backbone network and depth-aware instance segmentation is used to segment the different regions of rice leaf. Moreover, the proposed Bidirectional Feature Attention Pyramid Network (Bi-FAPN) is used for extracting the features from the segmented image and also enhances the detection of diseases with different scales. Furthermore, the feature maps are identified in the detection head, where the anchor boxes are then applied to the output feature maps to produce the final output vectors by the YOLO v5 network. The subset of channels or filters is pruned from different layers of deep neural network models through the principled pruning approach without affecting the full framework performance. The experiments are conducted with RLD dataset with different existing networks to verify the generalization ability of the proposed model. The effectiveness of the network is evaluated based on various parameters in terms of average precision, accuracy, average recall, IoU, inference time, and F1 score, which are achieved at 82.8, 94.87, 75.81, 0.71, 0.017, and 92.45 respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2515-7620/acdece"
    },
    {
        "id": 23402,
        "title": "Improving YOLOv8 with Scattering Transform and Attention for Maritime Awareness",
        "authors": "Borja Carrillo-Perez, Angel Bueno Rodriguez, Sarah Barnes, Maurice Stephan",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ispa58351.2023.10279352"
    },
    {
        "id": 23403,
        "title": "Attention-based bidirectional long short-term memory for urban traffic prediction using multivariate data",
        "authors": "Mingyang Yang, Qianqian Wang, Lili Yang, Zhejun Huang",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011449"
    },
    {
        "id": 23404,
        "title": "Examining the Role of Sustained Attention on Reading Outcomes Within a Context of Childhood Adversity",
        "authors": "Charles Alvarado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/2012869"
    },
    {
        "id": 23405,
        "title": "ACEANet: Ambiguous Context Enhanced Attention Network for skin lesion segmentation",
        "authors": "Yun Jiang, Hao Qiao",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "Skin lesion segmentation from dermatoscopic images is essential for the diagnosis of skin cancer. However, it is still a challenging task due to the ambiguity of the skin lesions, the irregular shape of the lesions and the presence of various interfering factors. In this paper, we propose a novel Ambiguous Context Enhanced Attention Network (ACEANet) based on the classical encoder-decoder architecture, which is able to accurately and reliably segment a variety of lesions with efficiency. Specifically, a novel Ambiguous Context Enhanced Attention module is embedded in the skip connection to augment the ambiguous boundary information. A Dilated Gated Fusion block is employed in the end of the encoding phase, which effectively reduces the loss of spatial location information due to continuous downsampling. In addition, we propose a novel Cascading Global Context Attention to fuse feature information generated by the encoder with features generated by the decoder of the corresponding layer. In order to verify the effectiveness and advantages of the proposed network, we have performed comparative experiments on ISIC2018 dataset and PH2 dataset. Experiments results demonstrate that the proposed model has superior segmentation performance for skin lesions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/ida-230298"
    },
    {
        "id": 23406,
        "title": "Context-aware code generation with synchronous bidirectional decoder",
        "authors": "Xiangyu Zhang, Yu Zhou, Guang Yang, Tingting Han, Taolue Chen",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jss.2024.112066"
    },
    {
        "id": 23407,
        "title": "Photovoltaic power prediction based on sliced bidirectional long short term memory and attention mechanism",
        "authors": "Wengang Chen, Hongying He, Jianguo Liu, Jinbiao Yang, Ke Zhang, Diansheng Luo",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "Solar photovoltaic power generation has the characteristics of intermittence and randomness, which makes it a challenge to accurately predict solar power generation power, and it is difficult to achieve the desired effect. Therefore, by fully considering the relationship between power generation data and climate factors, a new prediction method is proposed based on sliced bidirectional long short term memory and the attention mechanism. The prediction results show that the presented model has higher accuracy than the common prediction models multi-layer perceptron, convolution neural network, long short term memory and bidirectional long short term memory. The presented sliced bidirectional cyclic network has high prediction accuracy by low root mean square error and mean absolute error of 1.999 and 1.159 respectively. The time cost is only 24.32% of that of long short term memory network and 13.76% of that of bidirectional long short term memory network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fenrg.2023.1123558"
    },
    {
        "id": 23408,
        "title": "Detection of SQL Injection and Cross-Site Scripting Based on Multi-Model CNN Combined with Bidirectional GRU and Multi-Head Self-Attention",
        "authors": "Wei-Chun Hsiao, Chih-Hung Wang",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci59363.2023.10210155"
    },
    {
        "id": 23409,
        "title": "A hybrid prediction model of improved bidirectional long short-term memory network for cooling load based on PCANet and attention mechanism",
        "authors": "Xiuying Yan, Xingxing Ji, Qinglong Meng, Hang Sun, Yu Lei",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2024.130388"
    },
    {
        "id": 23410,
        "title": "Bi-LSTM-AMSM: Bidirectional Long Short-term Memory Network and Attention Mechanism with Semantic Mining for E-commerce Web Page Recommendation",
        "authors": "Yuxia Yuan, Yachao Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwet.2023.10060981"
    },
    {
        "id": 23411,
        "title": "Multi-attention bidirectional contrastive learning method for unpaired image-to-image translation",
        "authors": "Benchen Yang, Xuzhao Liu, Yize Li, Haibo Jin, Yetian Qu",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "Unpaired image-to-image translation (I2IT) involves establishing an effective mapping between the source and target domains to enable cross-domain image transformation. Previous contrastive learning methods inadequately accounted for the variations in features between two domains and the interrelatedness of elements within the features. Consequently, this can result in challenges encompassing model instability and the blurring of image edge features. To this end, we propose a multi-attention bidirectional contrastive learning method for unpaired I2IT, referred to as MabCUT. We design separate embedding blocks for each domain based on depthwise separable convolutions and train them simultaneously from both the source and target domains. Then we utilize a pixel-level multi-attention extractor to query images from embedding blocks in order to select feature blocks with crucial information, thus preserving essential features from the source domain. To enhance the feature representation capability of the model, we incorporate depthwise separable convolutions for the generator. We conducted comprehensive evaluations using three datasets, demonstrating that our approach enhances the quality of unpaired I2IT while avoiding the issue of mode collapse-related image blurring.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0301580"
    },
    {
        "id": 23412,
        "title": "Developing A New Model for Context-Awareness in Ambient Intelligence",
        "authors": "Abdelkader Berraouna",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Ontologies are a powerful way to model context, thanks to their expressiveness, ability to share knowledge, support for logical inference, and extensibility. While there are many generic ontology that capture and represent general context concepts, such as the SOCAM and CoOL projects, they are not tailored specifically for ambient intelligence and smart homes. This research aims to develop a specific ontology for these domains, building on existing generic ontologies and incorporating logical inference capabilities to assist people with reduced mobility and the elderly in carrying out their daily activities without constant assistance from others.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18844/gjcs.v13i2.9196"
    },
    {
        "id": 23413,
        "title": "VioNets: efficient multi-modal fusion method based on bidirectional gate recurrent unit and cross-attention graph convolutional network for video violence detection",
        "authors": "Wuyan Liang, Xiaolong Xu, Xiao Fu",
        "published": "2023-4-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jei.32.2.023031"
    },
    {
        "id": 23414,
        "title": "Team situational awareness in the context of hospital emergency: A concept analysis",
        "authors": "Modi Al-Moteri",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ienj.2023.101284"
    },
    {
        "id": 23415,
        "title": "Bidirectional Multi-scale Deformable Attention for Video Super-Resolution",
        "authors": "Zhenghua Zhou, Boxiang Xue, Hai Wang, Jianwei Zhao",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16072-8"
    },
    {
        "id": 23416,
        "title": "Deep Convolutional Attention based Bidirectional Recurrent Neural Network for Measuring Correlated Colour Temperature from RGB images",
        "authors": "Sanket Satish Mane, Ajit Kumar Santra",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "Information on the connected colour temperature, which affects the image due to the surrounding illumination, is critical, particularly for natural lighting and capturing images. Several methods are introduced to detect colour temperature precisely; however, the majority of them are difficult to use or may generate internal noise. To address these issues, this research developed a hybrid deep model that properly measures temperature from RGB images while reducing noise. The proposed study includes image collection, pre-processing, feature extraction and CCT evaluation. The input RGB pictures are initially generated in the CIE 1931 colour space. After that, the raw input samples are pre-processed to improve picture quality by performing image cropping and scaling, denoising by hybrid median-wiener filtering and contrast enhancement via Rectified Gamma-based Quadrant Dynamic Clipped Histogram Equalisation (RG_QuaDy_CHE). The colour and texture features are eliminated during pre-processing to obtain the relevant CCT-based information. The Local Intensity Grouping Order Pattern (LIGOP) operator extracts the texture properties. In contrast, the colour properties are extracted using the RGB colour space’s mean, standard deviation, skewness, energy, smoothness and variance. Finally, using the collected features, the CCT values from the submitted images are estimated using a unique Deep Convolutional Attention-based Bidirectional Recurrent Neural Network (DCA_BRNNet) model. The Coati Optimisation Algorithm (COA) is used to improve the performance of a recommended classifier by modifying its parameters. In the Result section, the suggested model is compared to various current techniques, obtaining an MAE value of 529K and an RMSE value of 587K, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i8s.7205"
    },
    {
        "id": 23417,
        "title": "The basic characteristics of east Asian tourism culture and the impact of bidirectional interaction in the communication process on attention deficit patients",
        "authors": "Xianglan Hu, Yunbao Xu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "BackgroundAttention deficit is a common psychological and behavioural disorder in childhood, characterized by difficulty concentrating attention, emotional impulses, and excessive activity. East Asia is a region with multiple ethnic groups, religions, and uneven economic, political, and social development. There are certain homogeneity or heterogeneity in East Asian tourism culture, as well as diversity and differences. To improve patient symptoms and enhance their intellectual level, the basic characteristics of tourism culture and the impact of two-way interaction on patients were studied.Subjects and Methods78 children with attention deficit admitted to our hospital were selected as the subjects and randomly divided into a control group and an observation group. Both groups of patients were treated with sustained-release tablets of methylphenidate hydrochloride, and the experimental group received behavioural intervention through East Asian tourism. The treatment lasts for 15 weeks and travels once a week.ResultsThe study used SPSS23.0 statistical software for data analysis. The analysis results showed that before the intervention, there was no statistically significant difference in the scores of each dimension of the CRT scale between the two groups of patients (P>0.05). After the intervention, the scores of each dimension of the CRT scale in the observation group were higher than those in the control group, and the differences between the groups were statistically significant (P<0.05).ConclusionsThe combination of East Asian tourism behaviour intervention and medication therapy for attention deficit patients can help improve their cognitive function and psychological behaviour.AcknowledgementHunan New Liberal Arts Research and Reform Practice Project, No. (2021)94-51; Key topics of Hunan Provincial Department of Education, No.22A0519.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1092852923003826"
    },
    {
        "id": 23418,
        "title": "Application of Sparse Attention Mechanism and Bidirectional GRU Neural Networks in Knowledge Tracing",
        "authors": "Junjie Wu, Guozhong Wang, Yan Wang",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csecs60003.2023.10428652"
    },
    {
        "id": 23419,
        "title": "BiLGAT: Bidirectional lattice graph attention network for chinese short text classification",
        "authors": "Penghao Lyu, Guozheng Rao, Li Zhang, Qing Cong",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-04700-7"
    },
    {
        "id": 23420,
        "title": "Effectiveness of Emergency Mental Health Promotive Gadget Addiction in Adolescents Using a Mindfulness Attention Awareness Educational Approach",
        "authors": " Nove Lestari",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Gadgets among teenagers are a must because sophisticated features can use communication facilities, in the form of messages, entertainment facilities in the form of music, playing games, internet facilities, so gadget technology changes the atmosphere of solitude to become more lively and lively. After counseling, it is hoped that participants will know and apply the management of prevention and handling of mental health emergencies addicted to gadgets. The method used in counseling is the lecture method conducted online or question and answer discussion. The media used in counseling are PPT, leaflets, educational videos, SOP video tutorials for mindfulness exercises and applications to support activities online or online. Based on age, the majority (52.4%) of respondents were 17 years old, the characteristics of the sexes were obtained by the majority (66.7%) of respondents who were female.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30994/sjik.v12i1.1023"
    },
    {
        "id": 23421,
        "title": "Attention-guiding Takeover Requests for Situation Awareness in Semi-autonomous Driving",
        "authors": "Qingxin Chen, Jialong Li, Kenji Tei",
        "published": "2023-3-13",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3568294.3580118"
    },
    {
        "id": 23422,
        "title": "Male attention allocation depends on social context",
        "authors": "Shelby D. Burridge, Ingo Schlupp, Amber M. Makowicz",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.beproc.2023.104878"
    },
    {
        "id": 23423,
        "title": "Awareness of the relative quality of spatial working memory representations",
        "authors": "Alison Y. Li, Thomas C. Sprague",
        "published": "2023-7",
        "citations": 0,
        "abstract": "AbstractWorking memory (WM) is the ability to maintain and manipulate information no longer accessible in the environment. The brain maintains WM representations over delay periods in noisy population-level activation patterns, resulting in variability in WM representations across items and trials. It is established that participants can introspect aspects of the quality of WM representations, and that they can accurately compare which of several WM representations of stimulus features like orientation or color is better on each trial. However, whether this ability to evaluate and compare the quality of multiple WM representations extends to spatial WM tasks remains unknown. Here, we employed a memory-guided saccade task to test recall errors for remembered spatial locations when participants were allowed to choose the most precise representation to report. Participants remembered either one or two spatial locations over a delay and reported one item’s location with a saccade. On trials with two spatial locations, participants reported either the spatial location of a randomly cued item, or the location of the stimulus they remembered best. We found a significant improvement in recall error and increase in response time (RT) when participants reported their best-remembered item compared with trials in which they were randomly cued. These results demonstrate that participants can accurately introspect the relative quality of neural WM representations for spatial position, consistent with previous observations for other stimulus features, and support a model of WM coding involving noisy representations across items and trials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3758/s13414-022-02646-5"
    },
    {
        "id": 23424,
        "title": "Assessing Creative Awareness and Literary Writing Games in the Norwegian Context",
        "authors": "Allen Jones",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "This paper reports on a survey and teaching intervention done with Norwegian students in their first (VG1), second (VG2), and third year (VG3) of high school English (16-19 years old). The goals of the project: 1. To examine Norwegian student/teacher attitudes toward creativity; 2. To design, play-test, and asses creative reading games. The study found students surprisingly open to creativity and games in education, however, there was a general wariness of assessment. As the students progressed through high school, they increasingly saw writing as something one is forced to do, and resisted sharing their writing. Almost all students saw themselves as outside the community of writers. While the novel nature of the games made for initial difficulties, this was also a motivator. The key to effectiveness was pairing theory with practice to give students a clear sense of the pedagogical goal: to develop and experience the use of creativity (divergent thinking). The use of multimodality in games (drawing) was immensely effective for student engagement and collaboration; however, it was less effective in terms of maintaining clear pedagogical goals in the time given. Finally, the most effective approach in terms of engagement was to involve students as game designers. This paper will focus on a presentation of student views on creativity followed by an assessment of the game results in light of these views.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34190/ecgbl.17.1.1385"
    },
    {
        "id": 23425,
        "title": "Looking inside the black box of mindfulness meditation: Investigating attention and awareness during meditation using the mindful awareness task (MAT).",
        "authors": "Yuval Hadash, Liad Ruimi, Amit Bernstein",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/pas0001194"
    },
    {
        "id": 23426,
        "title": "Video Anomaly Detection Based on Spatial Awareness and Attention Fusion Method",
        "authors": "Mengyao Liu, Zhigang Xu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257827"
    },
    {
        "id": 23427,
        "title": "Exploring the Schema of Attention and Search Strategy in Different Levels of Situation Awareness under Fall Hazard Conditions",
        "authors": "Yanfang Luo, JoonOh Seo, Sogand Hasanzadeh, Ali Abbas",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485293.080"
    },
    {
        "id": 23428,
        "title": "Evaluating and Improving Context Attention Distribution on Multi-Turn response generation using Self-Contained Distractions",
        "authors": "Yujie Xing, Jon Atle Gulla",
        "published": "2023-1-28",
        "citations": 0,
        "abstract": "Despite the rapid progress of open-domain generation-based conversational agents, most deployed systems treat dialogue contexts as single-turns, while systems dealing with multi-turn contexts are less studied. There is a lack of a reliable metric for evaluating multi-turn modelling, as well as an effective solution for improving it. In this paper, we focus on an essential component of multi-turn generation-based conversational agents: context attention distribution, i.e. how systems distribute their attention on dialogue’s context. For evaluation of this component, We introduce a novel attention-mechanism-based metric: DAS ratio. To improve performance on this component, we propose an optimization strategy that employs selfcontained distractions. Our experiments on the Ubuntu chatlogs dataset show that models with comparable perplexity can be distinguished by their ability on context attention distribution. Our proposed optimization strategy improves both non-hierarchical and hierarchical models on the proposed metric by about 10% from baselines.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130210"
    },
    {
        "id": 23429,
        "title": "CB-FPN: object detection feature pyramid network based on context information and bidirectional efficient fusion",
        "authors": "Zhibo Liu, Jian Cheng",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-023-01173-9"
    },
    {
        "id": 23430,
        "title": "Attention-based Stacked Bidirectional Long Short-term Memory Model for Word Sense Disambiguation",
        "authors": "Yujia Sun, Jan Platoš",
        "published": "2023-5-18",
        "citations": 1,
        "abstract": "Word sense disambiguation is a basic task in Natural Language Processing which aims to identify the most appropriate sense of ambiguous words in different contexts by applying algorithm models. In this work, we propose a model that uses a stacked bidirectional Long Short-Term Memory neural network and attention mechanism to determine the sense of ambiguous words. First, the stacked bidirectional Long Short-Term Memory is employed for deep embedding-based representation of sentences containing ambiguous words. Then, we utilize the self-attention mechanism to highlight the contextual features of ambiguous words, and then construct the overall semantic representation of sentences. Finally, the sentence semantic representation is applied to the multilayer perception classifier to generate the appropriate category of the ambiguous word sense items. This model is tested on the Semeval-2007 task-17: English lexical samples dataset and using examples of ambiguous words sourced from Oxford, Cambridge, and Collins dictionaries as extra test datasets. The effectiveness of the proposed approach is demonstrated via comparison with existing word sense disambiguation approaches. Our experimental results show that the proposed model outperforms other word sense disambiguation methods in terms of the evaluation metrics (Average Accuracy, Micro F1-Score, Kappa, and Matthews Correlation Coefficient), and exhibits strong interpretability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3594780"
    },
    {
        "id": 23431,
        "title": "Behind-the-Meter Solar Generation Disaggregation Based on Attention Mechanism and Bidirectional Gated Recurrent Unit",
        "authors": "Yutao Xu, Zhukui Tan, Junwei Zhang, Bin Liu, Saiqiu Tang",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Abstract\nWith the rising installed capacity of rooftop PV, there is an urgent need to improve the accuracy of the behind-the-meter solar generation decomposition to realize the local consumption of distributed PV in order to alleviate the grid stability problem caused by the large-scale rooftop PV access. This paper proposes a bidirectional Gated Recurrent Unit neural network based on the Attention mechanism for a behind-the-meter solar generation decomposition model. First, the temporal characteristics of customer net load data are extracted using bidirectional gated recurrent units. Then, the Attention mechanism is introduced to improve the attention to key net load information. Finally, a nonlinear mapping relationship is constructed from net load data to behind-the-meter solar generation. 184 household PV customers in the SGSC dataset are used for the example analysis. The simulation results show that the proposed method does not rely on accurate physical modeling as well as accurate numerical weather forecast data, and has good generalization in scenarios of different climate zones and good adaptability in scenarios of different seasons.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2598/1/012017"
    },
    {
        "id": 23432,
        "title": "A Self-Attention Bidirectional Long Short-Term Memory for Cold Start Movie Recommendation Models",
        "authors": "Manohar M, R Archana Reddy, Laith H. Alzubaidi, Abbas Hameed Abdul Hussein, P. R. Buvaneswari",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390324"
    },
    {
        "id": 23433,
        "title": "Automatic classification of arrhythmias using multi-branch convolutional neural networks based on channel-based attention and bidirectional LSTM",
        "authors": "Fengqing Liu, Huaidong Li, Teng Wu, Hong Lin, Chenyu Lin, Guoqiang Han",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.isatra.2023.02.028"
    },
    {
        "id": 23434,
        "title": "Bi-LSTM-AMSM: bidirectional long short-term memory network and attention mechanism with semantic mining for e-commerce web page recommendation",
        "authors": "Yachao Zhang, Yuxia Yuan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwet.2023.136172"
    },
    {
        "id": 23435,
        "title": "Unsupervised Bidirectional Contrastive Reconstruction and Adaptive Fine-Grained Channel Attention Networks for Image Dehazing",
        "authors": "Hang Sun, Yang Wen, Huijing Feng, Yuelin Zheng, Qi Mei, Dong Ren, Mei Yu",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2024.106314"
    },
    {
        "id": 23436,
        "title": "Speech emotion recognition based on convolutional neural network with attention-based bidirectional long short-term memory network and multi-task learning",
        "authors": "Zhen-Tao Liu, Meng-Ting Han, Bao-Han Wu, Abdul Rehman",
        "published": "2023-1",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apacoust.2022.109178"
    },
    {
        "id": 23437,
        "title": "Critical infrastructure awareness based on IoT context data",
        "authors": "Marc Vila, Maria-Ribera Sancho, Ernest Teniente, Xavier Vilajosana",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iot.2023.100855"
    },
    {
        "id": 23438,
        "title": "IPs-GRUAtt: An attention-based bidirectional gated recurrent unit network for predicting phosphorylation sites of SARS-CoV-2 infection",
        "authors": "Guiyang Zhang, Qiang Tang, Pengmian Feng, Wei Chen",
        "published": "2023-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.omtn.2023.02.027"
    },
    {
        "id": 23439,
        "title": "Effectiveness of Emergency Mental Health Promotive Gadget Addiction in Adolescents Using a Mindfulness Attention Awareness Educational Approach",
        "authors": " Nove Lestari",
        "published": "2023-5-22",
        "citations": 0,
        "abstract": "Gadgets among teenagers are a must because sophisticated features can use communication facilities, in the form of messages, entertainment facilities in the form of music, playing games, internet facilities, so gadget technology changes the atmosphere of solitude to become more lively and lively. After counseling, it is hoped that participants will know and apply the management of prevention and handling of mental health emergencies addicted to gadgets. The method used in counseling is the lecture method conducted online or question and answer discussion. The media used in counseling are PPT, leaflets, educational videos, SOP video tutorials for mindfulness exercises and applications to support activities online or online. Based on age, the majority (52.4%) of respondents were 17 years old, the characteristics of the sexes were obtained by the majority (66.7%) of respondents who were female. Insight was obtained that almost half (47.6%) of respondents considered themselves addicted to gadgets, almost half of respondents (47.6%) used gadgets with a duration of 5-6 hours, almost half of respondents (42.9%) used gadgets 11-12 times/day, almost half of the respondents (38.1%) wake up in the morning and use gadgets ≤ 6 minutes and 6-30 minutes, almost half of the respondents (47.6%) use gadgets for social media purposes and almost all of respondents (81%) experienced gadget addiction based on (SAS-SV).",
        "keywords": "",
        "link": "http://dx.doi.org/10.30994/jqph.v6i2.460"
    },
    {
        "id": 23440,
        "title": "An Integrated Convolutional Neural Network-Bidirectional Long Short-Term Memory-Attention Mechanism Model for Enhanced Highway Traffic Flow Prediction",
        "authors": "Haoyuan Kan, Kan Li, Ziqi Wang",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56578/judm030102"
    },
    {
        "id": 23441,
        "title": "Bearing Fault Diagnosis Based on Parallel Convolutional Neural Network with Attention Mechanism and Bidirectional Gated Recurrent Unit",
        "authors": "Yaqi Zhao, Wei Li, Huiqing Xu, Sihe Lu, Yongcan Zhao",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640912.3640990"
    },
    {
        "id": 23442,
        "title": "Awareness Context and Social Recognition: Reconsidering a Case Study of “Dialogue” between Different Ethnic Persons in Japan",
        "authors": "Ken’ichi Yamaguchi",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "This study incorporates Honneth’s social recognition into awareness context theory by reconsidering a case study of the dialogue between Zainichi Korean and Japanese people in Japan. It revitalizes the theoretical significance of Strauss’ symbolic interactionism in terms of its focus on power dynamics and conflicts between the majority and minorities that differ in the cultural or ethnic background in modern global society. Incorporating critical theory into symbolic interactionism is a method of enhancing its contemporary significance. However, the discrepancy between them remains unresolved. There are some previous studies on Zainichi Koreans’ dialogue and the public sphere. Still, this case uniquely fits the aim of this study. As a result, it proposes both a substantive theory as a social justice inquiry in Japanese society and a modified formal theory of awareness context by adopting the theoretical perspective coined in this study and using abductive reasoning in the reconsideration. The substantive theory proposes a joint action characterized by unending mutual recognition and pragmatist dissent as a pragmatist public sphere between different ethnic persons in Japan. It is a method of grassroots communication that realizes liberal democracy as the form of modern society in Japan, liberating people from the Japanese communitarian mindset of Wa. The formal theory proposes new awareness contexts focusing on information and social recognition, which applies to the majority-minority relationship that differs in cultural or ethnic backgrounds from a theoretical perspective by focusing on conflicts between traditional cultural communities and modern society. Additionally, as an implication of this study, a pluralistic character of symbolic interactionism united by common frameworks of formal theories is proposed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18778/1733-8077.19.3.04"
    },
    {
        "id": 23443,
        "title": "Dynamic Context Awareness of Universal Middleware based for IoT SNMP\nService Platform",
        "authors": "Hae-Jun Lee",
        "published": "2023-5-13",
        "citations": 0,
        "abstract": "This study focused on the Universal Middleware design for the IoT (Internet of Things) service gateway for the implementation module of the convergence platform. Recently, IoT service gateway including convergence platform could be supported on dynamic module system that is required mounting and recognized intelligent status with the remote network protocol. These awareness concepts support the dynamic environment of the cross-platform distributed computing technology is supported by these idea as a Universal Middleware for network substitution. Distribution system commonly used in recent embedded systems include CORBA (Common Object Request Broker Architecture), RMI (Remote Method Invocation), DCE (Distributed Computing Environment) for dynamic service interface, and suggested implementations of a device object context. However, the aforementioned technologies do not support each standardization of application services, communication protocols, and data, but are also limited in supporting inter-system scalability. In particular, in order to configure an IoT service module, the system can be simplified, and an independent service module can be configured as long as it can support the standardization of modules based on hardware and software components. This paper proposed a design method for Universal Middleware that, by providing IoT modules and service gateways with scalability for configuring operating system configuration, may be utilized as an alternative. This design could be a standardized interface provisioning way for hardware and software components as convergence services, and providing a framework for system construction. Universal Middleware Framework could be presented and dynamic environment standardization module of network protocols, various application service modules such as JINI (Apache River), UPnP (Universal Plug &amp; Play), SLP (Service Location Protocol) bundles that provide communication facilities, and persistence data module. In this IoT gateway, management for based Universal Middleware framework support and available for each management operation, application service component could be cross-executed over SNMP (Simple Network Management Protocol) version 1, version 2, and version 3. The way of SNMP extension service modules are conducted cross-support each module and independent system meta-information that could be built life cycle management component through the MIB (Management Information Base) information unit analysis. Therefore, the MIB role of relation with the Dispatcher applied to support multiple concurrent SNMP messages by receiving incoming messages and managing the transfer of PDU (Protocol Data Unit) between the RFC 1906 network in this study. Results of the study revealed utilizing Universal Middleware that dynamic situations of context objects with mechanisms and tools to publish information could be consisted of IoT to standardize module interfaces to external service clients as a convergence between hardware and software platforms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31803/tg-20221221115431"
    },
    {
        "id": 23444,
        "title": "FORMATION OF ENVIRONMENTAL AWARENESS OF STUDENTS  OF HIGHER EDUCATION IN THE CONTEXT OF PRESERVING  THEIR PSYCHOSOMATIC HEALTH",
        "authors": "Наталія Ордатій",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52058/2708-7530-2023-6(36)-360-372"
    },
    {
        "id": 23445,
        "title": "Measuring Mindfulness in Business School Students: A Comparative Analysis of Mindful Attention Awareness Scale and Langer’s Scale",
        "authors": "Mohammed Laeequddin, K. Abdul Waheed, Vinita Sahay",
        "published": "2023-1-30",
        "citations": 3,
        "abstract": "Research studies have established that mindfulness helps in psychological well-being, stress reduction, chronic pain management, behavioral therapy, and other areas including organizational development. Mindfulness often refers to a state of consciousness, but mindfulness can also be understood as a personality trait. State mindfulness is referred as the individual’s capacity to cultivate a particular state of mind during meditative practice. Traits are more permanent facets of personality characteristics that are difficult to change and likely have some basis in genetics. Few scholars have criticized meditative mindfulness as a trend and cautioned that organizations should carefully consider their goals before introducing meditative mindfulness training. This dichotomy has prompted us to review the literature and carry out a comparative analysis of two divergent measurement scales of mindfulness: the Mindful Attention Awareness Scale (MAAS) and Langer’s mindfulness/mindlessness scale. The MAAS is the most widely used mindfulness scale to measure mindfulness, and Langer’s scale measures mindfulness/mindlessness. We developed hypotheses relating Langer’s scale and the MAAS. Further, we studied whether there is any difference in mindfulness/mindlessness among business school students with an undergraduate background in engineering and nonengineering streams. Using a self-administered questionnaire, we measured the mindfulness levels of 221 MBA first- and second-year graduates and tested the hypothesis using partial least squares structural equations modeling (PLS-SEM). We found that Langer’s mindfulness/mindlessness scale was negatively associated with the MAAS. We did not find any effect of gender, education, and professional specializations on mindfulness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bs13020116"
    },
    {
        "id": 23446,
        "title": "Context Awareness by Noise-Pattern Analysis of a Smart Factory",
        "authors": "So-Yeon Lee, Jihoon Park, Dae-Young Kim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.034914"
    },
    {
        "id": 23447,
        "title": "SPIRITUAL BASE OF PESANTREN FOR BUILDING MULTICULTURAL AWARENESS IN INDONESIA CONTEXT",
        "authors": "Saepudin Mashuri, Sauqi Futaqi, Ahmad Sulhan",
        "published": "2024-2-15",
        "citations": 1,
        "abstract": "This study examines the spiritual base of Pesantren, which is essential in building multicultural awareness. In Indonesia, Pesantren is an Islamic religious education institution emphasizing spirituality's importance. Pesantren is also closely related to various social and religious aspects. This study aims to find a spiritual base and its utilization in building multicultural awareness. This research uses a phenomenological qualitative study with data collection through observation, interviews, and documentation. The research was conducted for 1.5 years, from 2018-2019. Observations were made for a week every month. Interviews were conducted with 16 informants at site A and 13 at site B. Data analysis used a constant comparative model. From the results of the study, there are several significant findings: 1) Kiai's view of the spirituality of Islamic boarding schools related to multiculturalism is based on the monotheism of humanity; 2) Pesantrens have spiritual capital that comes from Sufistic teachings (Sufism) and interacts spirally with multiculturalism; 3) multicultural values are born from spiritual values that are grown and summarised in three categories of values, namely fundamental values, personal values , and social values; and 4) spiritual-multicultural interactions that continue to make students more multicultural competent. Multicultural awareness built through intense spirituality can birth \"selfless multiculturalism\"; an authentic multicultural attitude.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22373/jiif.v24i1.17141"
    },
    {
        "id": 23448,
        "title": "CGBA-Net: context-guided bidirectional attention network for surgical instrument segmentation",
        "authors": "Yiming Wang, Yan Hu, Junyong Shen, Xiaoqing Zhang, Heng Li, Zhongxi Qiu, Fangfu Ye, Jiang Liu",
        "published": "2023-5-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11548-023-02906-1"
    },
    {
        "id": 23449,
        "title": "Attention-Enhanced Graph Neural Networks With Global Context for Session-Based Recommendation",
        "authors": "Yingpei Chen, Yan Tang, Yuan Yuan",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3254897"
    },
    {
        "id": 23450,
        "title": "Graph context-attention network via low and high order aggregation",
        "authors": "Haiyun Xu, Shaojie Zhang, Bo Jiang, Jin Tang",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.03.030"
    },
    {
        "id": 23451,
        "title": "Multimodal interface and reliability displays: Effect on attention, mode awareness, and trust in partially automated vehicles",
        "authors": "Noé Monsaingeon, Loïc Caroux, Sabine Langlois, Céline Lemercier",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "The goal of this study is to evaluate the effect of a multimodal interface indicating the limits of automation in order to stimulate an appropriate level of attention and to induce accurate mode awareness and trust in partial driving automation. Participants drove in a driving simulator with partial driving automation and were confronted with surprising situations of suspension of driving automation systems in different contexts. They drove the simulator during three driving sessions, with either a multimodal interface indicating the limits of automation or a visual basic interface. Their driving performance, ocular behavior, and subjective evaluation of trust and workload were evaluated. The results revealed that the multimodal interface stimulates an appropriate level of attention and increases mode awareness and trust in automation, but these effects are context-dependent. The indications of the limits of automation improved the knowledge regarding automation, but this knowledge did not necessarily lead to improved driving performance. Design solutions are discussed to support the improvement of driving performance for take-overs in vehicles equipped with partial driving automation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fpsyg.2023.1107847"
    },
    {
        "id": 23452,
        "title": "Impact of meditation on mindfulness among the young adults: The psychometric assessment of the Mindful Attention Awareness Scale.",
        "authors": "Sumedha Tuteja, Amandeep Dhaliwal",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/hum0000336"
    },
    {
        "id": 23453,
        "title": "Location based Context Awareness with Multipoint Transmission by ELAML Algorithm",
        "authors": "S. Ram Prasath, K. Gokulakrishnan, M. Subramanian, N. Mohan",
        "published": "2023-2-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icais56108.2023.10073864"
    },
    {
        "id": 23454,
        "title": "Pragmatic Awareness in EFL Context: An Assessment on English Literature Students",
        "authors": "Fachria Yamin Marasabessy, Sartika Putri Sailuddi, Indry Widyasti Anwar",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "The purpose of the research was to explore studentsâ€™ pragmatic awareness and their ability in recognizing grammatical and pragmatic problematic scenarios. There were 25 B2 level students of English Literature study program participated in the study. All students were in their forth year of study and have completed Pragmatics course. The participants were asked to read 15 scenarios of judgment task and to decide whether the given scenarios presented pragmatic or grammatical problem or were unproblematic. The result revealed that the participants were better in recognizing pragmatic problems, followed by the identification of unproblematic scenarios and lastly, participantsâ€™ were weakest at recognizing grammatical errors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33387/j.edu.v21i1.5908"
    },
    {
        "id": 23455,
        "title": "THE HISTORIOGRAPHICAL ANALYSIS OF THE FORMATION OF UKRAINIAN NATIONAL AWARENESS IN THE CONTEXT OF DOMESTIC SCIENTIFIC RESEARCH",
        "authors": "M.I. Fesiuk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/2663-6085/2023/62.1.6"
    },
    {
        "id": 23456,
        "title": "Convolutional Neural Network–Bidirectional Gated Recurrent Unit Facial Expression Recognition Method Fused with Attention Mechanism",
        "authors": "Chaolin Tang, Dong Zhang, Qichuan Tian",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "The relationships among different subregions in facial images and their varying contributions to facial expression recognition indicate that using a fixed subregion weighting scheme would result in a substantial loss of valuable information. To address this issue, we propose a facial expression recognition network called BGA-Net, which combines bidirectional gated recurrent units (BiGRUs) with an attention mechanism. Firstly, a convolutional neural network (CNN) is employed to extract feature maps from facial images. Then, a sliding window cropping strategy is applied to divide the feature maps into multiple subregions. The BiGRUs are utilized to capture the dependencies among these subregions. Finally, an attention mechanism is employed to adaptively focus on the most discriminative regions. When evaluated on CK+, FER2013, and JAFFE datasets, our proposed method achieves promising results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132212418"
    },
    {
        "id": 23457,
        "title": "Combining bidirectional long short‐term memory and self‐attention mechanism for code search",
        "authors": "Ben Cao, Jianxun Liu",
        "published": "2023-5",
        "citations": 1,
        "abstract": "SummaryWith the wide application of deep learning in code search, especially the proposed code search model based on attention mechanism, the accuracy of code search has been greatly improved. However, the attention mechanism only captures the attention weight relationship between two words in the code fragment, without considering the contextual semantic relationship that exists between words in the code fragment, which can help improve the accuracy of code search. To address this problem, this paper proposes a model that combining bidirectional long short‐term memory and self‐attention mechanisms for code search (CBLSAM‐CS). The model first captures the contextual semantic relationship of each word in the code fragment by long‐short term memory network, and then uses the self‐attention mechanism to extract deep‐level features of the sequence. In order to verify the effectiveness of the proposed model, the paper has been conducted an experimental comparison with three other baseline models, CODEnn, CARLCS‐CNN, and SAN‐CS, on the basis of a public dataset containing 18 million code fragments. The experimental results show that the proposed model in this paper achieves 92.24% and 93.55% in mean reciprocal rank value and normalized discounted cumulative gain metrics, respectively, which are better than the baseline model. Therefore, it shows that the CBLSAM‐CS model proposed in this paper can effectively improve the accuracy and efficiency of code search.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cpe.7662"
    },
    {
        "id": 23458,
        "title": "Session-based recommendations with sequential context using attention-driven LSTM",
        "authors": "Chhotelal Kumar, Mukesh Kumar",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compeleceng.2024.109138"
    },
    {
        "id": 23459,
        "title": "Global Context Attention for Robust Visual Tracking",
        "authors": "Janghoon Choi",
        "published": "2023-3-1",
        "citations": 1,
        "abstract": "Although there have been recent advances in Siamese-network-based visual tracking methods where they show high performance metrics on numerous large-scale visual tracking benchmarks, persistent challenges regarding the distractor objects with similar appearances to the target object still remain. To address these aforementioned issues, we propose a novel global context attention module for visual tracking, where the proposed module can extract and summarize the holistic global scene information to modulate the target embedding for improved discriminability and robustness. Our global context attention module receives a global feature correlation map to elicit the contextual information from a given scene and generates the channel and spatial attention weights to modulate the target embedding to focus on the relevant feature channels and spatial parts of the target object. Our proposed tracking algorithm is tested on large-scale visual tracking datasets, where we show improved performance compared to the baseline tracking algorithm while achieving competitive performance with real-time speed. Additional ablation experiments also validate the effectiveness of the proposed module, where our tracking algorithm shows improvements in various challenging attributes of visual tracking.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23052695"
    },
    {
        "id": 23460,
        "title": "Actor-Multi-Scale Context Bidirectional Higher Order Interactive Relation Network for Spatial-Temporal Action Localization",
        "authors": "Jun Yu, Yingshuai Zheng, Shulan Ruan, Qi Liu, Zhiyuan Cheng, Jinze Wu",
        "published": "2023-8",
        "citations": 0,
        "abstract": "The key to video action detection lies in the understanding of interaction between persons and background objects in a video. Current methods usually employ object detectors to extract objects directly or use grid features to represent objects in the environment, which underestimate the great potential of multi-scale context information (e.g., objects and scenes of different sizes). How to exactly represent the multi-scale context and make full utilization of it still remains an unresolved challenge for spatial-temporal action localization. In this paper, we propose a novel Actor-Multi-Scale Context Bidirectional Higher Order Interactive Relation Network (AMCRNet) that extracts multi-scale context through multiple pooling layers with different sizes. Specifically, we develop an Interactive Relation Extraction module to model the higher-order relation between the target person and the context (e.g., other persons and objects). Along this line, we further propose a History Feature Bank and Interaction method to achieve better performance by modeling such relation across continuing video clips. Extensive experimental results on AVA2.2 and UCF101-24 demonstrate the superiority and rationality of our proposed AMCRNet.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/186"
    },
    {
        "id": 23461,
        "title": "Design and Implementation of Attention-based CR System in the Context of Big Data",
        "authors": "Zheyi Wang, Yanli Kuang, Lyu Xin",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3378521"
    },
    {
        "id": 23462,
        "title": "Attention-based Stacked Bidirectional LSTM Networks for Radar Working Mode Recognition",
        "authors": "Hasibatu Kejilitu, Fang Ye, Qian Sun, Yuan Tian",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apcap59480.2023.10469824"
    },
    {
        "id": 23463,
        "title": "An Empirical Study on Consumer Awareness of Sustainable Fashion: A Longitudinal Approach",
        "authors": "Dong Shen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18848/2325-1115/cgp/v20i01/19-45"
    },
    {
        "id": 23464,
        "title": "Fusion attention mechanism-based bidirectional long short term memory for carbonate gas well productivity prediction",
        "authors": "Weijun Ni, Hong Xu, Gang Liu, Fei Ma, Chaobo Fan, Cong Xie",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3011562"
    },
    {
        "id": 23465,
        "title": "Placing willed attention in context: a review of attention and free will",
        "authors": "John G. Nadra, George R. Mangun",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "Attention is the ability to focus one's awareness on relevant events and objects while ignoring distracting ones. Laboratory studies of top-down voluntary attention commonly use predictive or instructional cues to direct attention. However, in real world scenarios, voluntary attention is not necessarily externally cued, but may be focused by internal, self-generated processes. The voluntary focusing of attention in the absence of external guidance has been referred to as “willed attention,” a term borrowed from the literature on willed motor actions. In a fashion similar to studies of willed (self-initiated) actions, during willed attention, participants are given the freedom to deploy attention based on their own free choices. Electrophysiological studies have shown that during willed attention, ongoing neural activity biases willed attention decisions on a moment-to-moment basis as reflected in transient patterns of brain electrical activity that predict where participants will later choose to focus their attention. Brain imaging studies have revealed that compared to cued attention, willed attention involves additional frontal cortical structures, which interact with the classic attentional control networks of the human brain to produce a modified network organization for willed attention control. In this introduction to willed attention, we briefly review the fields of voluntary attention and self-initiated motor actions, in order to describe willed attention and its neural correlates as they relate to the broader concepts of attention and volition.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fcogn.2023.1205618"
    },
    {
        "id": 23466,
        "title": "Innovation and Exploration of the Path to Cultivating University Students' Cultural Awareness through New Media in the Context of Cultural Inheritance",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/mediacr.2023.041109"
    },
    {
        "id": 23467,
        "title": "Losing Awareness of Our Surroundings?",
        "authors": "Elizabeth E. Riggs, Silvia Knobloch-Westerwick",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": " Abstract: Narrative messages have demonstrated consistent effects on attitude change, with transportation as one of the most prominent explanations for their effects. However, the transportation process has yet to be fully understood. The present study investigated how attentional changes during audio narrative exposure, operationalized as secondary task reaction times, related to postexposure self-reports of transportation. Results demonstrated, unexpectedly, that faster reaction times were associated with increased transportation. Additionally, the study investigated multitasking propensity as a moderator, finding that low multitaskers exhibited slower reaction times during narrative compared to nonnarrative exposure whereas high multitaskers showed no differences in reaction time for narratives compared to nonnarratives. There were no differences in self-reported transportation for high and low multitaskers. The findings revealed limitations of the transportation self-report measure to capture attention, while highlighting the nuanced relationship between attention and transportation. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1027/1864-1105/a000400"
    },
    {
        "id": 23468,
        "title": "Relationship between Mindful Attention Awareness and Cognitive Flexibility among Pre-Service Teachers: A Regression Analysis",
        "authors": "Birender Kaur,  ",
        "published": "2024",
        "citations": 0,
        "abstract": "The main purpose of this study is to explore the predictive ability of mindful attention awareness towards cognitive flexibility among pre-service teachers. A descriptive survey approach was employed. The purposive sample method is employed to collect data from 100 pre-service teachers pursuing a Bachelor of Education from the public university of Kurukshetra. The Cognitive Flexibility Inventory by Denis and Vander (2010) and the Mindful Attention Awareness scale by Brown and Ryan were used for data collection. Statistical analysis indicated (i) mindful attention awareness is significantly and positively correlated with cognitive flexibility (ii) mindful attention awareness explains 30.6% of the cognitive flexibility among pre-service teachers. Education implications are further discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15804/tner.2024.75.1.17"
    },
    {
        "id": 23469,
        "title": "Basketball action recognition algorithm based on global context awareness",
        "authors": "Lijun He, Jiangtao Luo, Guoliang Xu",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2680903"
    },
    {
        "id": 23470,
        "title": "A Novel Semantic IoT Middleware for Secure Data Management: Blockchain and AI-Driven Context Awareness",
        "authors": "Mahmoud Elkhodr, Samiya Khan, Ergun Gide",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "In the modern digital landscape of the Internet of Things (IoT), data interoperability and heterogeneity present critical challenges, particularly with the increasing complexity of IoT systems and networks. Addressing these challenges, while ensuring data security and user trust, is pivotal. This paper proposes a novel Semantic IoT Middleware (SIM) for healthcare. The architecture of this middleware comprises the following main processes: data generation, semantic annotation, security encryption, and semantic operations. The data generation module facilitates seamless data and event sourcing, while the Semantic Annotation Component assigns structured vocabulary for uniformity. SIM adopts blockchain technology to provide enhanced data security, and its layered approach ensures robust interoperability and intuitive user-centric operations for IoT systems. The security encryption module offers data protection, and the semantic operations module underpins data processing and integration. A distinctive feature of this middleware is its proficiency in service integration, leveraging semantic descriptions augmented by user feedback. Additionally, SIM integrates artificial intelligence (AI) feedback mechanisms to continuously refine and optimise the middleware’s operational efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/fi16010022"
    },
    {
        "id": 23471,
        "title": "Situational Awareness in the Context of Clinical Practice",
        "authors": "Shani Feller, Liviu Feller, Ahmed Bhayat, Gal Feller, Razia Abdool Gafaar Khammissa, Zunaid Ismail Vally",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "In the context of clinical practice, situational awareness refers to conscious awareness (knowledge), which is a mental model of a given clinical situation in terms of its elements and the significance of their interrelation. Situational awareness (SA) facilitates clinical reasoning, diagnostic accuracy, and appropriate goal-directed performance, and it enables clinicians to immediately adapt treatment strategies in response to changes in clinical situational actualities and to modify the course of goal-directed activities accordingly. It also helps clinicians prepare future operational plans and procedures based on the projection of situational developments. SA, therefore, is an important prerequisite for safe clinical procedures. The purpose of this narrative review is to highlight certain cognitive and external (environmental) situational factors that influence the development of situational awareness. Understanding the dynamic, adaptive, and complex interactions between these factors may assist clinicians and managers of healthcare systems in developing methods aimed at facilitating the acquisition of accurate clinical situational awareness and, in turn, may bring about a reduction in the incidence of SA, diagnostic, and operational errors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11233098"
    },
    {
        "id": 23472,
        "title": "Hybrid spatial-channel attention and global-regional context aggregation feature for polyp segmentation",
        "authors": "Yucai Zhou, Lyusheng Li",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3017894"
    },
    {
        "id": 23473,
        "title": "Evaluating Ad Creative and Web Context Alignment with Attention Measurement",
        "authors": "John Hawkins, Graham Burton",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3629264.3629265"
    },
    {
        "id": 23474,
        "title": "CAAP-Net: Context Aware Automatic Polyp Segmentation Network with Mask Attention",
        "authors": "Praveer Saxena, Ashish Kumar Bhandari",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tai.2024.3375832"
    },
    {
        "id": 23475,
        "title": "CaraNet: context axial reverse attention network for segmentation of small medical objects",
        "authors": "Ange Lou, Shuyue Guan, Murray Loew",
        "published": "2023-2-18",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.1.014005"
    },
    {
        "id": 23476,
        "title": "Combining lamotrigine tablets on students with bidirectional emotional disorders in the context of educational psychology in higher education teaching reform",
        "authors": "Wanxiong Zhang, Hai Zhang, Qianzhu Chen",
        "published": "2023-10",
        "citations": 0,
        "abstract": "BackgroundThe potential of comprehensive educational reforms, backed by principles of educational psychology, to positively impact bipolar disorder students is underexplored. Combining such strategies with medical treatment, such as risperidone, might further enhance positive psychological effects. This study hypothesizes that such a synergistic approach can optimize teaching methods and improve the mental health landscape in higher institutions.Subjects and MethodsWe utilized a mixed-methods approach in this non-randomized controlled trial. Study participants included students diagnosed with bipolar disorder across different universities and currently under risperidone treatment. Our research tools included standardized measures such as the Young Mania Rating Scale (YMRS), Hamilton Depression Rating Scale (HDRS), as well as the General Self-Efficacy Scale (GSES). Data were collected and analyzed using SPSS23.0.ResultsA statistically significant improvement was observed in the student participants’ psychological well-being signs, attributed to the educational reform combined with risperidone treatment. These alterations demonstrated substantial improvements in YMRS and HDRS scores, manifesting reduced manic and depressive symptoms. Furthermore, higher GSES scores reflected enhanced self-efficacy.ConclusionsEducational reform that accommodates the unique learning needs of students with bipolar disorder, combined with risperidone treatment, seems to result in significant positive psychological effects. This study underscores the potentially valuable cross-disciplinary approach to addressing mental health issues within higher education institutions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1092852923004303"
    },
    {
        "id": 23477,
        "title": "Exploring Awareness of Labor Market Challenges  in the Context of Automation and Robotization",
        "authors": "Oleg Shovkovyy, Hossein Miri",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "Objectives: This study explores and evaluates the awareness of labor market challenges posed by automation and robotization within the framework of Thailand 4.0 among students and educators in various educational institutions in Thailand. It seeks to identify the sources and quality of information on this topic, investigate the role of educational institutions in imparting knowledge, and determine if universities adequately equip students with future-proof skills to face the demands of the evolving job market. The findings of this research will help identify areas that require improvement and inform policy decisions to address the potential threat of unemployment and unclaimed skills in the future labor market.\nMethodology: This quantitative exploratory research adopts inductive reasoning and leverages statistical analysis through descriptive and inferential techniques, including calculating the Chi-square test of independence and the Spearman correlation test. Two distinct versions of the questionnaire tailored for educators and students, available in Thai to ensure clarity and relevance, were used. Six hundred and fifty-one participants, including students and educators representing 57 diverse educational institutions across Thailand, actively engaged in this data collection effort. Applying statistical techniques to the survey data, including descriptive statistics and inferential tests, yields valuable insights, effectively addressing our research questions.\nMain Results: The research findings shed light on the level of awareness of the perceived labor market challenges associated with automation and robotization. A significant proportion of students (86.7%) were familiar with these challenges. However, only a tiny fraction (11.5%) has acquired this awareness through educational efforts by institutions, emphasizing the need for improvement. Most students inadvertently stumble upon information on these challenges through news and media sources, often considered superficial and needing more guidance for effective career planning. Furthermore, the study reveals a deficiency in university counseling services, leaving many students uncertain about their career prospects in a world influenced by automation and robotization.\nDiscussion: The study exposes concerning insights about the preparedness of educational institutions for the labor market challenges in the era of automation and robotization under Thailand 4.0. A significant proportion of students (40.6%) fear post-graduation unemployment, while a more substantial percentage (72.4%) anticipates their chosen professions becoming obsolete shortly after graduation, demanding urgent intervention. Furthermore, it highlights a lack of clear objectives within these institutions, casting doubts on the adequacy and relevance of current curricula. These findings necessitate a broader discussion on the challenges of automation and robotization in education.\nConclusions: While the study initially suggests that Thai educational institutions may not adequately prepare their students for the challenges of automation and robotization associated with Thailand 4.0, it is essential to recognize that the absence of explicit inclusion of technological disruptions within current curricula does not necessarily indicate failure on their part or a disconnect with the transforming labor market. Instead, it underscores the need for a more comprehensive evaluation. The study emphasizes the crucial role of educational institutions in shaping the future workforce and aligning themselves with the dynamic challenges of automation and robotization. Proactive steps, such as revising curricula, enhancing industry collaboration, and promoting lifelong learning, remain paramount. Neglecting to adapt to these changing conditions carries the risk of leaving a significant portion of the workforce unemployable and hindering Thailand's progress toward achieving its vision under Thailand 4.0.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55766/sjss-2-2023-267144"
    },
    {
        "id": 23478,
        "title": "Identity-Based Access Control in IoT: Enhancing Security through Mutual Cryptographic Authentication and Context Awareness",
        "authors": "Priyanka More, Sachin Sakhare, Parikshit Mahalle",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmnwc60182.2023.10435960"
    },
    {
        "id": 23479,
        "title": "Multi-branch Context Awareness Network for Prostate MRI Segmentation",
        "authors": "Zijiang Sang, Yeqin Shao, Changyan Xu",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\nProstate image segmentation is a precondition for the diagnosis of prostate diseases and subsequent treatment. However, the blurry organ edges and low image contrast make accurate segmentation difficult. In order to overcome the difficulties, this paper proposes an innovative Multi-branch Context Awareness Network (MBCA-Net) for prostate MRI segmentation. MBCA-Net uses the 3D UNet as the backbone network with an encoder-decoder framework. To improve the feature extraction capacity of the network, a multi-branch residual module with different convolution kernels is proposed. To better make use of extracted features and reduce semantic ambiguity, a context awareness module is used to fuse low-level features in the encoder and high-level features in the decoder in a full process manner. To improve the stability of the model during training, a mixed loss function is adopted. Experiments on the public dataset PROMISE12 show that our model’s Dice coefficient is 90.19%. Compared with other advanced techniques, the proposed model has better segmentation results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2562/1/012008"
    },
    {
        "id": 23480,
        "title": "Understanding pro-environmental behavior: the effects of social influence and environmental awareness in Cambodian context",
        "authors": "Bora Ly",
        "published": "2024-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13412-023-00886-x"
    },
    {
        "id": 23481,
        "title": "Deep Reinforcement Learning with Copy-oriented Context Awareness and Weighted Rewards for Abstractive Summarization",
        "authors": "Caidong Tan",
        "published": "2023-3-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3590003.3590019"
    },
    {
        "id": 23482,
        "title": "Fast Context-Awareness Encoder for LiDAR Point Semantic Segmentation",
        "authors": "Tingyu Du, Jingxiu Ni, Dongxing Wang",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "A LiDAR sensor is a valuable tool for environmental perception as it can generate 3D point cloud data with reflectivity and position information by reflecting laser beams. However, it cannot provide the meaning of each point cloud cluster, so many studies focus on identifying semantic information about point clouds. This paper explores point cloud segmentation and presents a lightweight convolutional network called Fast Context-Awareness Encoder (FCAE), which can obtain semantic information about the point cloud cluster at different levels. The surrounding features of points are extracted as local features through the local context awareness network, then combined with global features, which are highly abstracted from the local features, to obtain more accurate semantic segmentation of the discrete points in space. The proposed algorithm has been compared and verified against other semantic KITTI data algorithms and has achieved state-of-the-art performance. Due to its ability to note fine-grained features on the z-axis in space, the algorithm shows higher prediction accuracy for certain types of objects. Moreover, the training and validation time is short, and the algorithm can meet high real-time requirements for 3D perception tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12153228"
    },
    {
        "id": 23483,
        "title": "Context-awareness for information correction and reasoning in evidence theory",
        "authors": "Paweł Kowalski, Anne-Laure Jousselme",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijar.2022.11.009"
    },
    {
        "id": 23484,
        "title": "A lifetime prediction model based on two-path convolution with attention mechanism and bidirectional long short-term memory network",
        "authors": "Xianbin Sun, Meiqi Dong, Lin Bai, Yanling Sun, Ao Chen, Yanyan Nie",
        "published": "2024-5-1",
        "citations": 0,
        "abstract": "Abstract\nWith the continuous advancement of technology, modern industrial equipment is becoming increasingly complex, integrated, and automated. The complexity of industrial processes often involves multiple variables, strong coupling, nonlinearity, variable operating conditions, and significant noise, making the establishment of accurate remaining useful life (RUL) prediction models a challenging research direction. This paper proposes a lifetime prediction model based on two-path convolution with attention mechanisms and a bidirectional long short-term memory (BiLSTM) network. The model’s front end employs two-path convolution scales and attention modules to extract key fault information from bearings, enhancing the model’s noise resistance. It utilizes adaptive batch normalization and Meta-Aconc activation functions to adaptively adjust the neurons of the model, thereby enhancing its generalization capabilities. The model’s back end uses a BiLSTM network to remember and process the degradation information of bearings, achieving the prediction of bearing RUL. Furthermore, the model’s accuracy is evaluated using root mean square error and a scoring function assessment system. Comparative experiments demonstrate the model’s higher predictive accuracy. Finally, robustness and generalization experiments have proven the model to adapt well in scenarios with noise interference and working condition transitions. This model provides a reference for the prediction of the life of rotating machinery in practical scenarios with strong noise and variable operating conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6501/ad2a31"
    },
    {
        "id": 23485,
        "title": "Bidirectional Long Short-term Neural Network Based on the Attention Mechanism of the Residual Neural Network (ResNet–BiLSTM–Attention) Predicts Porosity through Well Logging Parameters",
        "authors": "Youzhuang Sun, Junhua Zhang, Zhengjun Yu, Yongan Zhang, Zhen Liu",
        "published": "2023-7-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acsomega.3c03247"
    },
    {
        "id": 23486,
        "title": "Robust and efficient keyword spotting using a bidirectional attention LSTM",
        "authors": "Om Prakash Swain, H. Hemanth, Puneet Saran, Mohanaprasad Kothandaraman, Logesh Ravi, Hardik Sailor, K. S. Rajesh",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10772-023-10067-4"
    },
    {
        "id": 23487,
        "title": "A Classification Algorithm for Breast Masses Based on the Combination of Bidirectional ConvLSTM Network and Coordinate Attention Module",
        "authors": "Fangfang Chen, Xiaojin Wang, Yanna Zhang, Yanling Wang",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ricai60863.2023.10489815"
    },
    {
        "id": 23488,
        "title": "Fractional-order long-term price guidance mechanism based on bidirectional prediction with attention mechanism for electric vehicle charging",
        "authors": "Likun Hu, Yi Cao, Linfei Yin",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2024.130639"
    },
    {
        "id": 23489,
        "title": "Multiscale X-Ray Contraband Detection Incorporating Bidirectional Routing Attention",
        "authors": "若璇 王",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/csa.2024.143060"
    },
    {
        "id": 23490,
        "title": "Load Disaggregation Based on a Bidirectional Dilated Residual Network with Multihead Attention",
        "authors": "Yifei Shu, Jieying Kang, Mei Zhou, Qi Yang, Lai Zeng, Xiaomei Yang",
        "published": "2023-6-19",
        "citations": 1,
        "abstract": "Load disaggregation determines appliance-level energy consumption unintrusively from aggregated consumption measured by a single meter. Deep neural networks have been proven to have great potential in load disaggregation. In this article, a temporal convolution network, mainly consisting of residual blocks with bidirectional dilated convolution, the GeLu activation function, and multihead attention, is proposed to improve the prediction accuracy of individual appliances. Bidirectional dilated convolution is applied to enlarge the receptive field and effectively extract load features from historical and future information. Meanwhile, GeLU is introduced into the residual structure to overcome the “dead state” issue of traditional ReLU. Furthermore, multihead attention aims to improve the prediction accuracy by giving different weights according to the importance of different-level load features. The proposed model is validated using the REDD and UK-DALE datasets. Among six existing neural networks, the experimental results demonstrate that the proposed algorithm achieves the least average errors when disaggregating four appliances in terms of mean absolute error (MAE) and signal aggregate error (SAE), respectively, reduced by 22.33% and 60.58% compared with the model with the second-best performance on the REDD dataset. Additionally, the proposed algorithm shows superior results in identifying the on/off state in four appliances from the UK-DALE dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12122736"
    },
    {
        "id": 23491,
        "title": "A prospective approach for human-to-human interaction recognition from Wi-Fi channel data using attention bidirectional gated recurrent neural network with GUI application implementation",
        "authors": "Md Mohi Uddin Khan, Abdullah Bin Shams, Mohsin Sarker Raihan",
        "published": "2024-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17487-z"
    },
    {
        "id": 23492,
        "title": "VideoFACT: Detecting Video Forgeries Using Attention, Scene Context, and Forensic Traces",
        "authors": "Tai D. Nguyen, Shengbang Fang, Matthew C. Stamm",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00837"
    },
    {
        "id": 23493,
        "title": "Blind lane recognition based on context salient attention mechanism and transfer learning",
        "authors": "lin li",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3023724"
    },
    {
        "id": 23494,
        "title": "Graph-Graph Context Dependency Attention for Graph Edit Distance",
        "authors": "Ruiqi Jia, Xianbing Feng, Xiaoqing Lyu, Zhi Tang",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094975"
    },
    {
        "id": 23495,
        "title": "Dynamic and context-dependent stock price prediction using attention modules and news sentiment",
        "authors": "Nicole Königstein",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42521-023-00089-7"
    },
    {
        "id": 23496,
        "title": "Inadequate awareness and attention to non-HDL cholesterol: Undertreatment of high-risk patients in cardiology practice",
        "authors": "G.Ö. Mert, K.U. Mert, O. Basaran, V. Doğan, I. Rencüzoğulları, G. Çinier, M. Kayikcioglu",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.atherosclerosis.2023.06.350"
    },
    {
        "id": 23497,
        "title": "Awareness of the role of responsible citizenship in the context of the development of digital culture",
        "authors": "I. A. Zavodovskyi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/apfs.v042.2023.6"
    },
    {
        "id": 23498,
        "title": "Impact of Situational Awareness of Controllers on Safety Behavior Capacity in the Context of Air Traffic Control System with Manmachine Integration",
        "authors": "Wang Yonggang, Ma Wenting",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.ajtte.20230803.14"
    },
    {
        "id": 23499,
        "title": "Paid attention but needed support: Environmental awareness of Indonesian <scp>MSMEs</scp> during pandemic",
        "authors": "Dahlia Sari, Feri Priatna, Desi Adhariani",
        "published": "2023-12",
        "citations": 2,
        "abstract": "AbstractThis study aims to investigate the factors that instigate micro, small and medium enterprises (MSMEs) environmental awareness during the Covid‐19 pandemic from the attention based view perspective as the main theoretical lens. This topic is motivated by the increasing plastic use by MSMEs during the pandemic due to mobility restrictions. A survey was performed and generated in 485 usable responses which were then analyzed using PLS‐SEM to find the answers of whether the awareness of MSME owners or managers, business motivations, government regulations, social media and implementation constraints influence environmentally friendly practices by MSMEs during the pandemic. Consistent with the predictions based on the attention based view, the results show that all five factors contribute to the environmentally friendly practices by MSMEs during the pandemic. In addition, a support system from the government is needed to increase awareness and to turn it into actions, especially in the form of facilities, infrastructure and training to overcome the constraints in cost, time, and human resources capabilities. Research to investigate environmentally friendly activities carried out by MSMEs during a pandemic is still scant. This research is expected to fill this gap and provides practical as well as theoretical contributions in this area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/bsd2.267"
    },
    {
        "id": 23500,
        "title": "Ambient intelligent framework for modelling critical medical events based on context awareness",
        "authors": "Manjunath Subramaniyam, Srirangapatna Sampathkumararan Parthasar",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "With the rapid pace of communication technology, the modern communication system still encounters challenges in meeting the dynamic requirements of users. Facilitating emergency services for patients without a caretaker side by is quite challenging. This work contributes a solution towards state-of-the-art research problems by introducing a novel architecture using collaboration, coordination and user activity detection using contextual information. A prototype is built and experiment is carried out to emphasize the importance of real-time activity-based context awareness in ambient intelligence (AmI) applications. The primary contributions of this work are introduction of novel architecture and usage of both static and dynamic activity-based contextual parameters. The secondary contribution of this model is to integrate ambient intelligence with context awareness to offer higher accuracy in determining the critical condition of a patient. Initially, analytical models are built using the context-based attributes that consider both clinical and non-clinical entities based on the minimal and essential vital information of patient. This paper further discusses the experimental model, which is highly cost-efficient both from an operational and usage viewpoint. Different assessment environments have been used for assessing the performance of the model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v14i3.pp3106-3115"
    },
    {
        "id": 23501,
        "title": "Teachers’ Awareness of Student-Centered Pedagogy and Assessment in EFL Context",
        "authors": "Mohd Nazim, Ali Abbas Falah Alzubi, Abdul-Hafeed Fakih",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "The academic community unanimously asserts that student-centered pedagogy and assessment (SCPA) practices are indispensable for instructional methodology and evaluation. Existing literature indicates a noticeable, possibly minimal, gap in attention, particularly within the context of Najran University, regarding English teachers' awareness of these two fundamental practices. Consequently, this study investigated English teachers' awareness regarding SCPA practices in the English as a Foreign Language (EFL) context. Additionally, the study sought to analyze participants' responses in correlation with their gender, experience, degree, and specialization. The research objectives were achieved through a survey method, employing a set of instruments comprising a questionnaire and a semi-structured interview conducted with a conveniently chosen sample of 73 faculty members. The results revealed a very high level of awareness among faculty members regarding SCPA practices in the EFL context. Furthermore, gender, experience, degree, and specialization were found to have no significant impact on the responses of the study sample. Qualitative analysis of the semi-structured interviews highlighted the connection between SCPA practices and students' language success, emphasizing factors, such as encouragement, engagement, responsibility, and positive impact. The study's findings provide recommendations and implications for future practices in English language teaching.    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5430/jct.v13n1p13"
    },
    {
        "id": 23502,
        "title": "Context awareness in the electronic format of dialogue",
        "authors": "S. V. Pervukhina",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "Modern dialogical speech is undergoing a major transformation due to the use of electronic communication format, which introduces its own changes in the context of communication. Dialogical speech is characterized by a high dependence on the context. In electronically mediated communication, the situation of communication is no longer the same for the communicators: they are in different places, experiencing different stimuli and communication interference, despite the fact that the communicators continue to maintain a dialogue and exchange replicas. Accordingly, the concept of context needs to be supplemented and reinterpreted in connection with the new conditions of its occurrence that is electronic space. The aim of the study is to find the qualitatively essential components for successful mediated communication, which depend on the context of the communication situation. One strategy for achieving successful communication is to remove possible barriers in communication. For this purpose, the detailing of the context of communication, its influence on the effectiveness of communication is carried out, and the concept of semiotic field of dialogue is developed. Under the semiotic field of dialogue we understand the information, which affects the communicants understanding of each other: the references, the presuppositions of the addressee, the presuppositions of the addressor. The material of the study was dialogic communication within the framework of organizational communication. The specific nature of the discourse of corporations and organizations creates its own unique context that is described in the article. The author has identified several groups of interference in the electronic format of dialogical speech, such as physical interference, informational interference, semantic interference and psychological interference.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18287/2542-0445-2023-29-1-181-187"
    },
    {
        "id": 23503,
        "title": "Context-aware Status Updating: Wireless Scheduling for Maximizing Situational Awareness in Safety-critical Systems",
        "authors": "Tasmeen Zaman Ornee, Md Kamran Chowdhury Shisher, Clement Kam, Yin Sun",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/milcom58377.2023.10356278"
    },
    {
        "id": 23504,
        "title": "Supply chain awareness: theoretical development and empirical test in the nonprofit context",
        "authors": "Sebastián Javier García-Dastugue, Horacio E. Rousseau",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "PurposeManagerial “awareness” of supply chain management (SCM) principles is a key antecedent of SCM adoption. However, supply chain awareness (SCA) provides fertile ground for further development. The authors combine extant research with the attention-based view of the firm to further develop SCA and theorize about its effect in an understudied context.Design/methodology/approachThe authors combine SCA with supply chain orientation, of which awareness is central. The authors combine qualitative and archival data for a 10-year period to test SCA in nonprofits. SCA was measured unobtrusively to avoid respondent bias; then, the authors explore how SCA relates to revenue generation from services provided.FindingsSCA correlates positively with revenue generation. Drawing on a contingency perspective, the authors test two moderators relevant to nonprofits. The positive effect of SCA on revenue is stronger for nonprofits collocated in cities with corporate headquarters but weaker for those with larger boards.Research limitations/implicationsThe study further advances the notion of awareness for studying SCM phenomena and provides evidence of its relevance in the unexamined context of human services nonprofit organizations (NPOs). This work has implications for how attention to SCM principles shapes organizational outcomes, the factors that moderate these relationships and the importance of unobtrusively measuring awareness in SCM research. The authors used WayBack Machine to harvest websites. However, the quality and depth of text obtained prior to 2008 were lower than those of later years. Additionally, archival data for NPOs are limited.Practical implicationsFindings inform about the fit between nonprofit resources, type of board and fit with how to fund operations. This research provides an alternative way for policy makers to assess NPO capacity by focusing on the fundamental SCM concepts.Social implicationsThe authors contribute to the dialogue about NPOs developing financial independence through revenue generation from services sold to end customers.Originality/valueNPOs are seldom studied in SCM. This is an attempt to study NPOs by combining qualitative and quantitative data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ijlm-04-2023-0146"
    }
]