[
    {
        "id": 11971,
        "title": "Part-of-Speech (POS) Tagging",
        "authors": "Raymond S. T. Lee",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-1999-4_3"
    },
    {
        "id": 11972,
        "title": "SIGNIFICANCE OF PART-OF-SPEECH TAGGING (POS-TAGGING) IN NATURAL LANGUAGE PROCESSING (ON THE MATERIAL OF THE CORPUS OF THE KYRGYZ LANGUAGE)",
        "authors": "Aida Askarbekovna Kasieva, Eliza Marlenovna Akylbekova",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.53473/16946324_2022_4_345"
    },
    {
        "id": 11973,
        "title": "Part-of-Speech Tagging via Deep Neural Networks for Northern-Ethiopic Languages",
        "authors": "Jurgita Kapočiūtė-Dzikienė, Senait Gebremichael Tesfagergish",
        "published": "2020-12-19",
        "citations": 8,
        "abstract": "Deep Neural Networks (DNNs) have proven to be especially successful in the area of Natural Language Processing (NLP) and Part-Of-Speech (POS) tagging—which is the process of mapping words to their corresponding POS labels depending on the context. Despite recent development of language technologies, low-resourced languages (such as an East African Tigrinya language), have received too little attention. We investigate the effectiveness of Deep Learning (DL) solutions for the low-resourced Tigrinya language of the Northern-Ethiopic branch. We have selected Tigrinya as the testbed example and have tested state-of-the-art DL approaches seeking to build the most accurate POS tagger. We have evaluated DNN classifiers (Feed Forward Neural Network – FFNN, Long Short-Term Memory method – LSTM, Bidirectional LSTM, and Convolutional Neural Network – CNN) on a top of neural word2vec word embeddings with a small training corpus known as Nagaoka Tigrinya Corpus. To determine the best DNN classifier type, its architecture and hyper-parameter set both manual and automatic hyper-parameter tuning has been performed. BiLSTM method was proved to be the most suitable for our solving task: it achieved the highest accuracy equal to 92% that is 65% above the random baseline.",
        "link": "http://dx.doi.org/10.5755/j01.itc.49.4.26808"
    },
    {
        "id": 11974,
        "title": "Part-of-Speech Tagging",
        "authors": "Dan Tufiș, Radu Ion",
        "published": "2017-10-5",
        "citations": 2,
        "abstract": "One of the fundamental tasks in natural-language processing is the morpho-lexical disambiguation of words occurring in text. Over the last twenty years or so, approaches to part-of-speech tagging based on machine learning techniques have been developed or ported to provide high-accuracy morpho-lexical annotation for an increasing number of languages. Due to recent increases in computing power, together with improvements in tagging technology and the extension of language typologies, part-of-speech tags have become significantly more complex. The need to address multilinguality more directly in the web environment has created a demand for interoperable, harmonized morpho-lexical descriptions across languages. Given the large number of morpho-lexical descriptors for a morphologically complex language, one has to consider ways to avoid the data sparseness threat in standard statistical tagging, yet ensure that full lexicon information is available for each word form in the output. The chapter overviews the current major approaches to part-of-speech tagging.",
        "link": "http://dx.doi.org/10.1093/oxfordhb/9780199573691.013.51"
    },
    {
        "id": 11975,
        "title": "Decoding Neural Activity for Part-of-Speech Tagging (POS)",
        "authors": "Salman Ahmed, Muskaan Singh, Saugat Bhattacharyya, Damien Coyle",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10394253"
    },
    {
        "id": 11976,
        "title": "Bi-directional LSTM–CNN Combined method for Sentiment Analysis in Part of Speech Tagging (PoS)",
        "authors": "N. K. Senthil Kumar, N. Malarvizhi",
        "published": "2020-6",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10772-020-09716-9"
    },
    {
        "id": 11977,
        "title": "Twitter Storytelling Generator Using Latent Dirichlet Allocation and Hidden Markov Model POS-TAG (Part-of-Speech Tagging)",
        "authors": "Yasir Abdur Rohman, Retno Kusumaningrum",
        "published": "2019-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icicos48119.2019.8982411"
    },
    {
        "id": 11978,
        "title": "Part of Speech Tagging",
        "authors": "",
        "published": "2017",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_100357"
    },
    {
        "id": 11979,
        "title": "Using Word Embeddings in Turkish Part of Speech Tagging",
        "authors": "Şevket Can,  ",
        "published": "2021-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18178/ijmlc.2021.11.5.1063"
    },
    {
        "id": 11980,
        "title": "Hierarchical-Task Reservoir for Anytime POS Tagging from Continuous Speech",
        "authors": "Luca Pedrelli, Xavier Hinaut",
        "published": "2020-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207285"
    },
    {
        "id": 11981,
        "title": "Part-of-Speech Tagging",
        "authors": "Felipe Sánchez-Martínez",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003168348-43"
    },
    {
        "id": 11982,
        "title": "Arabic Part Of Speech (POS) Tagging Analysis using Bee Colony Optimization (BCO) Algorithm on Quran Corpus",
        "authors": "Arief Fatchul Huda,  Fauziah, Elis Ratnawulan, Dian Rachmat Gumelar",
        "published": "2021-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwt52862.2021.9678422"
    },
    {
        "id": 11983,
        "title": "A hybrid part-of-speech tagger with annotated Kurdish corpus: advancements in POS tagging",
        "authors": "Dastan Maulud, Karwan Jacksi, Ismael Ali",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "Abstract\nWith the rapid growth of online content written in the Kurdish language, there is an increasing need to make it machine-readable and processable. Part of speech (POS) tagging is a critical aspect of natural language processing (NLP), playing a significant role in applications such as speech recognition, natural language parsing, information retrieval, and multiword term extraction. This study details the creation of the DASTAN corpus, the first POS-annotated corpus for the Sorani Kurdish dialect. The corpus, containing 74,258 words and thirty-eight tags, employs a hybrid approach utilizing the bigram hidden Markov model in combination with the Kurdish rule-based approach to POS tagging. This approach addresses two key problems that arise with rule-based approaches, namely misclassified words and ambiguity-related unanalyzed words. The proposed approach’s accuracy was assessed by training and testing it on the DASTAN corpus, yielding a 96% accuracy rate. Overall, this study’s findings demonstrate the effectiveness of the proposed hybrid approach and its potential to enhance NLP applications for Sorani Kurdish.",
        "link": "http://dx.doi.org/10.1093/llc/fqad066"
    },
    {
        "id": 11984,
        "title": "South China Sea Conflicts Classification Using Named Entity Recognition (NER) and Part-of-Speech (POS) Tagging",
        "authors": "Nur Rafeeqkha Sulaiman, Maheyzah Md Siraj",
        "published": "2020-5-20",
        "citations": 0,
        "abstract": "Internet connects everyone to everything globally. The existence of Internet eases people in completing daily tasks. Thanks to Internet, information is being digitalized and spread openly to the public. Online news articles not only provide us with useful and reliable information and reports, it also eases information extraction and gathering for research purposes especially in Natural Language Processing (NLP) and Machine Learning (ML). The topics regarding the South China Sea have been popular lately due to the rise of conflicts between several countries claim on the islands in the sea. Gathering data through Internet and online sources proves to be easy, but to process a huge amount data and to identify only useful information manually takes a longer time to complete. Extracting important features from a text document can be done by using one or a combination of feature extraction methods. Relevant information and the classification of news articles in relation to the conflicts in South China Sea need to be done. In this paper, a model is proposed to use Named Entity Recognition (NER) that search for and classifies important information regarding to the conflicts. In order to do that, a combination of Part-of-Speech (POS) and NER are needed to extract type of conflicts from the news.  This study also claims to classify news by using Conditional Random Field (CRF) algorithm and Multinomial Naïve Bayes (MNB) as classification methods by training and testing the data. ",
        "link": "http://dx.doi.org/10.11113/ijic.v10n1.255"
    },
    {
        "id": 11985,
        "title": "Part-of-Speech (POS) Tagging for Standard Brunei Malay: A Probabilistic and Neural-Based Approach",
        "authors": "Izzati Mohaimin, Rosyzie A. Apong, Ashrol R. Damit",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12720/jait.14.4.830-837"
    },
    {
        "id": 11986,
        "title": "Parts-of-Speech Tagging in NLP: Utility, Types, and Some Popular POS Taggers",
        "authors": "Soumitra Ghosh, Brojo Kishore Mishra",
        "published": "2020-11-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367808495-6"
    },
    {
        "id": 11987,
        "title": "Masked Part-Of-Speech Model: Does Modeling Long Context Help Unsupervised POS-tagging?",
        "authors": "Xiang Zhou, Shiyue Zhang, Mohit Bansal",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.naacl-main.81"
    },
    {
        "id": 11988,
        "title": "Arabic Part Of Speech (POS) Tagging Analysis using HMM Trigram method on Al-Qur’an Ayah Sentences",
        "authors": "Arief Fatchul Huda, Izki Zakiyah Al-Hamro, Asep Solih Awalluddin, Muhammad Ibnu Pamungkas",
        "published": "2021-8-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icwt52862.2021.9678393"
    },
    {
        "id": 11989,
        "title": "Tagging Efficiency Analysis on Part of Speech Taggers",
        "authors": "Ritu Banga, Pulkit Mehndiratta",
        "published": "2017-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icit.2017.57"
    },
    {
        "id": 11990,
        "title": "A Part-of-Speech Tagset for Morphosyntactic Tagging of Amharic",
        "authors": "Magdalena Krzyżanowska",
        "published": "2018-3-28",
        "citations": 0,
        "abstract": "The aim of the article is to propose a tagset for the morposyntactic tagging of Amharic and to discuss those issues which may seem problematic. The tagset contains forty-seven tags grouped into twelve parts of speech. It is hoped that it provides a starting point for more exhaustive guidelines for prospective annotators.",
        "link": "http://dx.doi.org/10.15460/aethiopica.20.1.1142"
    },
    {
        "id": 11991,
        "title": "Improving accuracy of Part-of-Speech (POS) tagging using hidden markov model and morphological analysis for Myanmar Language",
        "authors": "Dim Lam Cing, Khin Mar Soe",
        "published": "2020-4-1",
        "citations": 2,
        "abstract": "In Natural Language Processing (NLP), Word segmentation and Part-of-Speech (POS) tagging are fundamental tasks. The POS information is also necessary in NLP’s preprocessing work applications such as machine translation (MT), information retrieval (IR), etc. Currently, there are many research efforts in word segmentation and POS tagging developed separately with different methods to get high performance and accuracy. For Myanmar Language, there are also separate word segmentors and POS taggers based on statistical approaches such as Neural Network (NN) and Hidden Markov Models (HMMs). But, as the Myanmar language's complex morphological structure, the OOV problem still exists. To keep away from error and improve segmentation by utilizing POS data, segmentation and labeling should be possible at the same time.The main goal of developing POS tagger for any Language is to improve accuracy of tagging and remove ambiguity in sentences due to language structure. This paper focuses on developing word segmentation and Part-of- Speech (POS) Tagger for Myanmar Language. This paper presented the comparison of separate word segmentation and POS tagging with joint word segmentation and POS tagging.",
        "link": "http://dx.doi.org/10.11591/ijece.v10i2.pp2023-2030"
    },
    {
        "id": 11992,
        "title": "Part of Speech (PoS) Tagging for Konkani Language Using HMM",
        "authors": "Annie Rajan, Ambuja Salgaonkar",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-5987-4_61"
    },
    {
        "id": 11993,
        "title": "Part-of-Speech Tagging using Genetic Algorithm",
        "authors": "Kamaljot Singh",
        "published": "2020-12-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5013/ijssst.a.16.06.11"
    },
    {
        "id": 11994,
        "title": "Deep Learning for Part of Speech (PoS) Tagging: Konkani",
        "authors": "Annie Rajan, Ambuja Salgaonkar, Arshad Shaikh",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-9967-2_32"
    },
    {
        "id": 11995,
        "title": "An empirical study on POS tagging for Vietnamese social media text",
        "authors": "Ngo Xuan Bach, Nguyen Dieu Linh, Tu Minh Phuong",
        "published": "2018-7",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.csl.2017.12.004"
    },
    {
        "id": 11996,
        "title": "POS Tagging",
        "authors": "Walter Daelemans",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_643"
    },
    {
        "id": 11997,
        "title": "Part-of-Speech (POS) Tagging for the Nyishi Language",
        "authors": "Joyir Siram,  Koj Sambyo, Achyuth Sarkar",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-0619-0_17"
    },
    {
        "id": 11998,
        "title": "Part-of-speech (POS) tagging using conditional random field (CRF) model for Khasi corpora",
        "authors": "Sunita Warjri, Partha Pakray, Saralin A. Lyngdoh, Arnab Kumar Maji",
        "published": "2021-12",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10772-021-09860-w"
    },
    {
        "id": 11999,
        "title": "An efficient sentimental analysis using hybrid deep learning and optimization technique for Twitter using parts of speech (POS) tagging",
        "authors": "M. Divyapushpalakshmi, R. Ramalakshmi",
        "published": "2021-6",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10772-021-09801-7"
    },
    {
        "id": 12000,
        "title": "Part of Speech Tagging: Shallow or Deep Learning?",
        "authors": "Robert Östling",
        "published": "2018-6-19",
        "citations": 2,
        "abstract": "Deep neural networks have advanced the state of the art in numerous fields, but they generally suffer from low computational efficiency and the level of improvement compared to more efficient machine learning models is not always significant. We perform a thorough PoS tagging evaluation on the Universal Dependencies treebanks, pitting a state-of-the-art neural network approach against UDPipe and our sparse structured perceptron-based tagger, efselab. In terms of computational efficiency, efselab is three orders of magnitude faster than the neural network model, while being more accurate than either of the other systems on 47 of 65 treebanks.",
        "link": "http://dx.doi.org/10.3384/nejlt.2000-1533.1851"
    },
    {
        "id": 12001,
        "title": "Exploring The Potential of HMMs in Linguistics for Part of Speech (POS) Tagging",
        "authors": "Mahnoor Iftikhar, Raja Hashim Ali, Memoona Saleem, Usama Arshad, Ali Zeeshan Ijaz, Nisar Ali, Muhammad Imad, Muhammad Abu Bakar, Ali Aftab",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icit59216.2023.10335862"
    },
    {
        "id": 12002,
        "title": "Implementing Part-of-Speech Tagging Using Recurrent Neural Networks",
        "authors": "",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009026222.012"
    },
    {
        "id": 12003,
        "title": "10. Part of Speech Tagging",
        "authors": "",
        "published": "2019-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9781474470780-010"
    },
    {
        "id": 12004,
        "title": "Leveraging Pretrained Word Embeddings for Part-of-Speech Tagging of Code Switching Data",
        "authors": "Fahad AlGhamdi, Mona Diab",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w19-1410"
    },
    {
        "id": 12005,
        "title": "Part of Speech Tagging Using Part of Speech Sequence Graph",
        "authors": "Pejman Gholami-Dastgerdi, Mohammad-Reza Feizi-Derakhshi",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s40745-021-00359-4"
    },
    {
        "id": 12006,
        "title": "A single-model approach for Arabic segmentation, POS tagging, and named entity recognition",
        "authors": "Abed Alhakim Freihat, Gabor Bella, Hamdy Mubarak, Fausto Giunchiglia",
        "published": "2018-4",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icnlsp.2018.8374393"
    },
    {
        "id": 12007,
        "title": "Cross-lingual Annotation Projection Is Effective for Neural Part-of-Speech Tagging",
        "authors": "Matthias Huck, Diana Dutka, Alexander Fraser",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w19-1425"
    },
    {
        "id": 12008,
        "title": "Tagging Part of Speech in Hausa Sentences",
        "authors": "Aminu Tukur, Kabir Umar, Anas Saidu Muhammad",
        "published": "2019-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecco48375.2019.9043198"
    },
    {
        "id": 12009,
        "title": "Part of Speech Tagging for Setswana African Language",
        "authors": "M.A. Dibitso, P. A. Owolawi, S.O. Ojo",
        "published": "2019-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/imitec45504.2019.9015871"
    },
    {
        "id": 12010,
        "title": "Part-of-Speech (POS) Tagging Using Deep Learning-Based Approaches on the Designed Khasi POS Corpus",
        "authors": "Sunita Warjri, Partha Pakray, Saralin A. Lyngdoh, Arnab Kumar Maji",
        "published": "2022-5-31",
        "citations": 5,
        "abstract": "Part-of-speech (POS) tagging is one of the research challenging fields in natural language processing (NLP). It requires good knowledge of a particular language with large amounts of data or corpora for feature engineering, which can lead to achieving a good performance of the tagger. Our main contribution in this research work is the designed Khasi POS corpus. Till date, there has been no form of any kind of Khasi corpus developed or formally developed. In the present designed Khasi POS corpus, each word is tagged manually using the designed tagset. Methods of deep learning have been used to experiment with our designed Khasi POS corpus. The POS tagger based on BiLSTM, combinations of BiLSTM with CRF, and character-based embedding with BiLSTM are presented. The main challenges of understanding and handling Natural Language toward Computational linguistics to encounter are anticipated. In the presently designed corpus, we have tried to solve the problems of ambiguities of words concerning their context usage, and also the orthography problems that arise in the designed POS corpus. The designed Khasi corpus size is around 96,100 tokens and consists of 6,616 distinct words. Initially, while running the first few sets of data of around 41,000 tokens in our experiment the taggers are found to yield considerably accurate results. When the Khasi corpus size has been increased to 96,100 tokens, we see an increase in accuracy rate and the analyses are more pertinent. As results, accuracy of 96.81% is achieved for the BiLSTM method, 96.98% for BiLSTM with CRF technique, and 95.86% for character-based with LSTM. Concerning substantial research from the NLP perspectives for Khasi, we also present some of the recently existing POS taggers and other NLP works on the Khasi language for comparative purposes.",
        "link": "http://dx.doi.org/10.1145/3488381"
    },
    {
        "id": 12011,
        "title": "Toward a Standardized and More Accurate Indonesian Part-of-Speech Tagging",
        "authors": "Kemal Kurniawan, Alham Fikri Aji",
        "published": "2018-11",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ialp.2018.8629236"
    },
    {
        "id": 12012,
        "title": "Part of speech tagging for Polish",
        "authors": "Katarzyna Krasnowska-Kieraś, Łukasz Kobyliński",
        "published": "2019-6-26",
        "citations": 0,
        "abstract": "Abstract\nIn this paper we discuss the current state of the art in part-of-speech tagging for Polish. We introduce the problem of POS tagging and point out the key issues in tagging inflected languages, which make this task more difficult in the case of Polish than e.g. English. We also discuss the most important language resources connected with POS tagging, as well as the task of morphological analysis, as it is commonly used as a preliminary step in tagging. We describe the methods that have been applied to the problem of POS tagging for Polish to date and discuss the most current, neural-network based methods in more detail. Finally, we conclude with a general view of this field in the context of Polish and discuss possible future research directions.",
        "link": "http://dx.doi.org/10.1515/psicl-2019-0009"
    },
    {
        "id": 12013,
        "title": "BiLSTM with CRF Part-of-Speech Tagging for Khasi language",
        "authors": "Ransly Hoojon, Dr. Amitabha Nath",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/i3cs58314.2023.10127278"
    },
    {
        "id": 12014,
        "title": "Improve Word Mover's Distance with Part-of-Speech Tagging",
        "authors": "Xiaojun Chen, Li Bai, Dakui Wang, Jinqiao Shi",
        "published": "2018-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr.2018.8546241"
    },
    {
        "id": 12015,
        "title": "A Comprehensive Survey of Techniques Used for Part-of-Speech Tagging of Code-Mixed Social Media Text",
        "authors": "Sunita Sunita, Ajit Kumar, Neetika Neetika",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPart-of-speech tagging faces unique difficulties when dealing with code-mixed social media text, which combines multiple languages in informal content created by users. In India, many web users employ a mixture of regional languages and English on platforms like Facebook, Instagram, and WhatsApp to express their messages and emotions. Text derived from social media is used in a variety of applications, such as speech recognition, machine learning, information retrieval, question answering, sentiment analysis, and named entity recognition. Due to training with monolingual texts, natural language processing tools such as part-of-speech taggers and parsers don't perform well. Assigning grammatical labels to individual words (such as verbs, adjectives, and nouns) is a critical task in natural language processing. This review paper extensively surveys the existing literature on part-of-speech tagging specifically developed for Indian and Foreign code-mixed social media text. We examine and categorize the approaches utilized in prior studies, taking into account the diverse techniques and methodologies employed to handle the complexities of code-mixed data. These approaches encompass rule-based methods, statistical models, and deep learning techniques such as recurrent neural networks and transformers. To enable comprehensive analysis, we compare and evaluate the performance of various state-of-the-art code-mixed part-of-speech taggers using benchmark datasets. We discuss the evaluation metrics used in these studies. Lastly, we explore the challenges introduced by noisy and informal language commonly found in code-mixed social media text. This review paper serves as a valuable resource for researchers and practitioners seeking to understand the current state of the art in code-mixed part-of-speech tagging for social media text. It offers insights into the strengths and weaknesses of existing approaches, identifies research gaps, and proposes potential avenues for future research to advance the field.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3274325/v1"
    },
    {
        "id": 12016,
        "title": "Part-of-speech tagging for Arabic tweets using CRF and Bi-LSTM",
        "authors": "Wasan AlKhwiter, Nora Al-Twairesh",
        "published": "2021-1",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.csl.2020.101138"
    },
    {
        "id": 12017,
        "title": "Stylistic Variation in Social Media Part-of-Speech Tagging",
        "authors": "Murali Raghu Babu Balusu, Taha Merghani, Jacob Eisenstein",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w18-1602"
    },
    {
        "id": 12018,
        "title": "Methods of Tagging Part of Speech of Uzbek Language",
        "authors": "Abjalova Manzura Abdurashetona, Iskandarov Otabek Ismailovich",
        "published": "2021-9-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmk52708.2021.9558900"
    },
    {
        "id": 12019,
        "title": "Word embedding-based Part of Speech tagging in Tamil texts",
        "authors": "Sajeetha Thavareesan, Sinnathamby Mahesan",
        "published": "2020-11-26",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciis51140.2020.9342640"
    },
    {
        "id": 12020,
        "title": "POS Tagging for the Primitive Languages of the World and Introducing a New Set of Universal POS Tagging for Sanskrit",
        "authors": "Anupam Das, Bidisha Choudhury, Shikhar Kumar Sarma",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-5224-1_3"
    },
    {
        "id": 12021,
        "title": "Evaluation of Different Classifiers for Sinhala POS Tagging",
        "authors": "Sandareka Fernando, Surangika Ranathunga",
        "published": "2018-5",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mercon.2018.8421997"
    },
    {
        "id": 12022,
        "title": "Using Part of Speech Tagging for Improving Word2vec Model",
        "authors": "Dima Suleiman, Arafat A. Awajan",
        "published": "2019-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictcs.2019.8923081"
    },
    {
        "id": 12023,
        "title": "Improving part-of-speech tagging in Amharic language using deep neural network",
        "authors": "Sintayehu Hirpassa, G.S. Lehal",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e17175"
    },
    {
        "id": 12024,
        "title": "General Regression Neural Network Based PoS Tagging for Nepali Text",
        "authors": "Archit Yajnik",
        "published": "2018-4-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5121/csit.2018.80603"
    },
    {
        "id": 12025,
        "title": "Practical and Robust Chinese Word Segmentation and PoS Tagging",
        "authors": "Chu-Ren Huang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-38913-9_4"
    },
    {
        "id": 12026,
        "title": "Domain adaptation for part-of-speech tagging of noisy user-generated text",
        "authors": "Luisa März, Dietrich Trautmann, Benjamin Roth",
        "published": "2019",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/n19-1345"
    },
    {
        "id": 12027,
        "title": "Побудова направлених зважених мереж термінів  із застосуванням Part-of-speech tagging",
        "authors": "О. О. Дмитренко",
        "published": "2020-12-29",
        "citations": 0,
        "abstract": "Розглянуто новий метод побудови термінологічних онтологій у вигляді мереж із ключових термінів (ключових слів і словосполучень) текстів, що змістовно пов’язані з певною предметною галуззю. Виокремлення ключових слів і словосполучень з тематичних текстових потоків і подальша побудова направленої зваженої мережі термінів здійснюються на основі застосування більш широкої обробки природної мови, що базується на розбитті на частини мови (Part-of-speech tagging). Комп’ютерну обробку текстових корпусів і побудову направлених зважених мереж термінів представлено у вигляді цілісної методики. У статті показано апробацію запропонованої методики на прикладі відомої народної європейської казки «Little Red Cap» і побудовано направ-лену зважену мережу зі слів і словосполучень, які відповідають окремим ключовим поняттям у досліджуваному творі.",
        "link": "http://dx.doi.org/10.35681/1560-9189.2020.22.4.225914"
    },
    {
        "id": 12028,
        "title": "Part of Speech Tagging for Arabic Long Sentence",
        "authors": "Ahmed H. Aliwy, Duaa A. Al_Raza",
        "published": "2018-8-15",
        "citations": 4,
        "abstract": "Part Of Speech (POS) tagging of Arabic words is a difficult and non-travail task it was studied in details for the last twenty years and its performance affects many applications and tasks in area of natural language processing (NLP). The sentence in Arabic language is very long compared with English sentence. This affect tagging process for any approach deals with complete sentence at once as in Hidden Markov Model HMM tagger. In this paper, new approach is suggested for using HMM and n-grams taggers for tagging Arabic words in a long sentence. The suggested approach is very simple and easy to implement. It is implemented on data set of 1000 documents of 526321 tokens annotated manually (containing punctuations). The results shows that the suggested approach has higher accuracy than HMM and n-gram taggers. The F-measures were 0.888, 0.925 and 0.957 for n-grams, HMM and the suggested approach respectively.",
        "link": "http://dx.doi.org/10.14419/ijet.v7i3.27.17671"
    },
    {
        "id": 12029,
        "title": "New jet tagging techniques at CMS",
        "authors": "Dennis Schwarz",
        "published": "2021-1-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22323/1.390.0778"
    },
    {
        "id": 12030,
        "title": "Part of Speech Tagging Using Bi-LSTM-CRF and Performance Evaluation Based on Tagging Accuracy",
        "authors": "Shilpa Kamath, Chaitra Shivanagoudar, K. G. Karibasappa",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-33-6987-0_25"
    },
    {
        "id": 12031,
        "title": "Amazigh Part Of Speech Tagging using Gated recurrent units (GRU)",
        "authors": "Maarouf Otman, El Ayachi Rachid, Biniz Mohamed",
        "published": "2021-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoa51614.2021.9442662"
    },
    {
        "id": 12032,
        "title": "Romanian Part of Speech Tagging using LSTM Networks",
        "authors": "Beata Lorincz, Maria Nutu, Adriana Stan",
        "published": "2019-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccp48234.2019.8959730"
    },
    {
        "id": 12033,
        "title": "Setswana Part of Speech Tagging",
        "authors": "Gabofetswe Malema, Boago Okgetheng, Moffat Motlhanka",
        "published": "2017-12-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5121/ijnlc.2017.6602"
    },
    {
        "id": 12034,
        "title": "Application of Cloud Desktop in Modern Chinese Multi-category Words Part of Speech Tagging",
        "authors": "Zhendong Song",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.proeng.2017.01.287"
    },
    {
        "id": 12035,
        "title": "Chinese Text Similarity Algorithm Based on Part-of-Speech Tagging and Word Vector Model",
        "authors": "Zhixin Ma",
        "published": "2019",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17706/jcp.14.4.311-317"
    },
    {
        "id": 12036,
        "title": "MALAY PART OF SPEECH TAGGING USING RULED-BASED APPROACH",
        "authors": "Nur Ashikin Halid",
        "published": "2017-12-31",
        "citations": 3,
        "abstract": "The research on part of speech (POS) tagging has been widely applied and used through a variety of approaches, particularly for European languages. But it is more challenging for Asian languages, especially Malay as it has some element of modification from other languages such as English and Arabic. Among the issues that often occur in POS tagging are the existence of ambiguous words and unknown words. Meanwhile, the lack of rules in the existing work has become a major problem in Malay POS tagging. Therefore, this research aims to develop new rules for Malay POS tagging and to compare the performance of this new development with the existing gold standard. This process begins with the collection and selection of the corpus using secondary data, obtained from online daily news which covers several domains. Next, the corpus has gone through the process of pre-processing in raw text of article form which include sentence splitter and tokenization process to generate an unlabeled corpus. POS tag dictionary also has been constructed to form a lexicon that only consists of root words. The rule development process involves detailing every type of POS tag to its suitable rules and get the best rules ordering for each type of this POS. A total of 30 rules including affixation rules and 16 word type relations have been developed in this process. The evaluation process is used to test the precision of the developed POS tagger and to get the best rules ordering. The POS tagging result is compared with existing gold standard. Overall, the test showed good result with an accuracy of 93.06% compared to the gold standard performance of 77.17%. Hence, this research showed better accuracy compared with the gold standard and at the same time, it proves that the addition of a new rules and rules ordering among the factors that contributed to the higher precision in tagging Malay corpus. As an improvement in future studies, the use of compound words should be taken into account because most of these words are used in most news sources. In addition, corpus from social media sources can be used because the content of information disseminated through social media is fast and up-to-date even though the language used for this resource is mostly informal and confronts with noise data issues.",
        "link": "http://dx.doi.org/10.17576/apjitm-2017-0602-09"
    },
    {
        "id": 12037,
        "title": "Cross-Register Projection for Headline Part of Speech Tagging",
        "authors": "Adrian Benton, Hanyang Li, Igor Malioutov",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.emnlp-main.521"
    },
    {
        "id": 12038,
        "title": "Custom Hidden Markov Models for Effective Part-of-Speech Tagging",
        "authors": "Hassan Bin Khalid, Abu Bakar Siddique, Raja Hashim Ali",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icet59753.2023.10374930"
    },
    {
        "id": 12039,
        "title": "New Text Steganography Technique Based on Part-of-Speech Tagging and Format-Preserving Encryption",
        "authors": "",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3837/tiis.2024.01.010"
    },
    {
        "id": 12040,
        "title": "Sequential Alignment Methods for Ensemble Part-of-Speech Tagging",
        "authors": "Jeesu Jung, Sangkeun Jung, Yoon-hyung Roh",
        "published": "2022-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigcomp54360.2022.00042"
    },
    {
        "id": 12041,
        "title": "Automatic Rule Detection and POS Tagging of Punjabi Text",
        "authors": "Er.Davinder Kaur,  , Er.Ubeeka Jain,  ",
        "published": "2017-3-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijecs/v6i3.68"
    },
    {
        "id": 12042,
        "title": "Stem-based PoS tagging for agglutinative languages",
        "authors": "Necva Bolucu, Burcu Can",
        "published": "2017-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siu.2017.7960386"
    },
    {
        "id": 12043,
        "title": "Automatinis kalbos dalių žymėjimas (POS) Tartu estų anglų kalbos mokinių tekstyne: mokinių klaidų poveikis CLAWS7 įrankio tikslumui",
        "authors": "Liina Tammekänd, Reeli Torn-Leesik",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "The present paper, which is a continuation of Tammekänd and Torn-Leesik’s (2022) study, aims to examine how learner errors affect the CLAWS7 tagger’s automated assignment of part-of-speech (POS) tags to a sample of 24,812 words of the Tartu Corpus of Estonian Learner English (TCELE). Learner errors causing tagging errors in the sample were identified, based on which a working error taxonomy was created. The POS-tagged and error-tagged samples were collated and compared to map correlations between learner and tagging errors. Error groups that correlated with significantly increased rates of tagging errors were identified. Possible reasons were suggested to account for the impact of learner errors on the tagger’s performance. The CLAWS7 tagger misanalysed only 2.8% of forms representing learners’ language errors but assigned wrong tags to every fifth spelling error (22%).",
        "link": "http://dx.doi.org/10.15388/taikalbot.2023.20.9"
    },
    {
        "id": 12044,
        "title": "Fine-grained part-of-speech tagging in Nepali text",
        "authors": "Ingroj Shrestha, Shreeya Singh Dhakal",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2021.05.099"
    },
    {
        "id": 12045,
        "title": "A method for constructing concurrent processing model\nof Xiangxi Hmong part-of-speech tagging",
        "authors": "Liping Mo, Cuina Cheng, Songlv Feng",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.55092/pcs2023020021"
    },
    {
        "id": 12046,
        "title": "Persian Ezafe Recognition Using Transformers and Its Role in Part-Of-Speech Tagging",
        "authors": "Ehsan Doostmohammadi, Minoo Nassajian, Adel Rahimi",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.findings-emnlp.86"
    },
    {
        "id": 12047,
        "title": "Survey For Arabic Part of Speech Tagging based on Machine Learning",
        "authors": "Zahra K. Mohammed, Nada A.Z. Abdullah",
        "published": "2022-6-30",
        "citations": 1,
        "abstract": "      The Arabic Language is the native tongue of more than 400 million people around the world,  it is also a language that carries an important religious and international weight.  The Arabic language has taken its share of the huge technological explosion that has swept the world, and therefore it needs to be addressed with natural language processing applications and tasks.\nThis paper aims to survey and gather the most recent research related to Arabic Part of Speech (APoS), pointing to tagger methods used for the Arabic language, which ought to aim to constructing corpus for Arabic tongue. Many AI investigators and researchers have worked and performed POS utilizing various machine-learning methods, such as Hidden-Markov-Model (HMM), Brill, Maximum-Match (MM), decision tree, bee colony, Neural-Network (NN), and other hybrid methods.\nThis survey groups a number of published papers based on the Arabic Language Applications (ALP) towards tagging related problems utilized and approaches with the difference between types of tags used. It addresses and tries to identify the gaps in the current studies putting a foundation for future studies in this field.",
        "link": "http://dx.doi.org/10.24996/ijs.2022.63.6.33"
    },
    {
        "id": 12048,
        "title": "Enhanced Amharic-Arabic Cross-Language Information Retrieval System using Part of Speech Tagging",
        "authors": "Ibrahim Gashaw, HL Shashirekha",
        "published": "2019-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icac347590.2019.9036807"
    },
    {
        "id": 12049,
        "title": "Classification Between Machine Translated Text and Original Text By Part Of Speech Tagging Representation",
        "authors": "Nancirose Piazza",
        "published": "2020-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dsaa49011.2020.00092"
    },
    {
        "id": 12050,
        "title": "Sequence Mixup for Zero-Shot Cross-Lingual Part-Of-Speech Tagging",
        "authors": "Megh Thakkar, Vishwa Shah, Ramit Sawhney, Debdoot Mukherjee",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.mrl-1.22"
    },
    {
        "id": 12051,
        "title": "Geez Part of Speech Tagging Using Deep Learning Approaches",
        "authors": "Habtamu Shiferaw Asmare, Abdulkerim Mohammed Yibre",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ict4da59526.2023.10302264"
    },
    {
        "id": 12052,
        "title": "Joint Part-of-Speech and Language ID Tagging for Code-Switched Data",
        "authors": "Victor Soto, Julia Hirschberg",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w18-3201"
    },
    {
        "id": 12053,
        "title": "Modeling of learning curves with applications to POS tagging",
        "authors": "Manuel Vilares Ferro, Víctor Manuel Darriba Bilbao, Francisco José Ribadas Pena",
        "published": "2017-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.csl.2016.06.001"
    },
    {
        "id": 12054,
        "title": "On a diacritics due part-of-speech tagging ambiguity in Romanian",
        "authors": "Radu Razvan Slavescu, Calin Cenan",
        "published": "2017-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccp.2017.8116992"
    },
    {
        "id": 12055,
        "title": "Part of Speech Tagging for Tamil Language Using Deep Learning",
        "authors": "Hemakasiny Visuwalingam, Ratnasingam Sakuntharaj, Roshan G. Ragel",
        "published": "2021-9-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciis53135.2021.9660738"
    },
    {
        "id": 12056,
        "title": "Distant Supervision from Disparate Sources for Low-Resource Part-of-Speech Tagging",
        "authors": "Barbara Plank, Željko Agić",
        "published": "2018",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/d18-1061"
    },
    {
        "id": 12057,
        "title": "UniBO @ KIPoS: Fine-tuning the Italian “BERTology\" for PoS-tagging Spoken Data",
        "authors": "Fabio Tamburini",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4000/books.aaccademia.7768"
    },
    {
        "id": 12058,
        "title": "Tagging \"Dark-Jet\" at collider",
        "authors": "Mengchao Zhang, Myeonghun Park",
        "published": "2019-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22323/1.340.0002"
    },
    {
        "id": 12059,
        "title": "Jet-Flavour Tagging at FCC-ee",
        "authors": "Kunal Gautam,  ",
        "published": "2022-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22323/1.414.1147"
    },
    {
        "id": 12060,
        "title": "The Pashto Corpus and Machine Learning Model for Automatic POS Tagging",
        "authors": "Ijazul Haq, Weidong Qiu, Jie Guo, Tang Peng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn this study we developed a corpus of the low-resource language – Pashto. The corpus consists of 5 million words, labeled for explicit word-boundaries. And at the time of writing this paper, around 2 million of the words are tagged for Part-of-speech (POS) information. Pashto has no explicit word-delimiter like whitespace in English. The word-boundary markers added to the corpus are not only useful in this study for splitting the text into words, but can also be used in the development of a specialized word segmenter for Pashto. The process of POS tagging was carried out in several rounds where each Round has two sub phases, the automatic POS assignment and manual correction. A specialized web application is developed for manual correction and quality control. The tagset used for tagging is very concise and pragmatic that is developed on the guidelines compatible with the previous standard corpora. In the first Round, the baseline Lexicon-based approach was used for tagging a chunk of 230K word and then manually corrected. Using these tagged words as training data, a Machine Learning (ML) model was trained for tagging the remaining corpus. The purpose of incorporating ML was to improve the accuracy of automatic POS assignment, thus to speed-up the tagging process and reduce the manual effort. Tagging results of the final ML-based model are very satisfactory, which yields an accuracy of 99% and F1-score of 98%. Besides building an automatic POS tagger, the proposed corpus is aimed to be used in countless open research areas in Pashto NLP such as homographs disambiguation, NER, word segmentation, text proofing, constituency and dependency parsing and language modeling etc.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2712906/v1"
    },
    {
        "id": 12061,
        "title": "TEXT CLASSIFICATION WITH FEATURE EXTRACTION AND POS TAGGING USING NB ALGORITHM",
        "authors": "",
        "published": "2020-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.10/092"
    },
    {
        "id": 12062,
        "title": "Deep Learning Techniques for Part of Speech Tagging by Natural Language Processing",
        "authors": "Rushali Dhumal Deshmukh, Arvind Kiwelekar",
        "published": "2020-3",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icimia48430.2020.9074941"
    },
    {
        "id": 12063,
        "title": "POS-tagging a bilingual parallel corpus: methods and challenges",
        "authors": "Irene Doval",
        "published": "2017",
        "citations": 3,
        "abstract": "This paper reviews the author’s experiences of tokenizing and POS tagging a bilingual parallel corpus, the PaGeS Corpus, consisting mostly of German and Spanish fictional texts. This is part of an ongoing process of annotating the corpus for part-of-speech information. This study discusses the specific problems encountered so far. On the one hand, tagging performance degrades significantly when applied to fictional data and, on the other, pre-existing annotation schemes are all language specific. To further improve accuracy during post-editing, the author has developed a common tagset and identified major error patterns.",
        "link": "http://dx.doi.org/10.32714/ricl.05.03"
    },
    {
        "id": 12064,
        "title": "Jet flavour tagging for the ATLAS Experiment",
        "authors": "Martino Centonze,  ",
        "published": "2022-3-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22323/1.380.0169"
    },
    {
        "id": 12065,
        "title": "Deep Neural Network Architecture for Part-of-Speech Tagging for Turkish Language",
        "authors": "Cenk Anil Bahcevan, Emirhan Kutlu, Tugba Yildiz",
        "published": "2018-9",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmk.2018.8566272"
    },
    {
        "id": 12066,
        "title": "A comparison of different part-of-speech tagging technique for text in Bahasa Indonesia",
        "authors": "Ahmad Zuli Amrullah, Rudy Hartanto, I Wayan Mustika",
        "published": "2017-8",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/inaes.2017.8068538"
    },
    {
        "id": 12067,
        "title": "Research on Joint Models for Korean Word Spacing and POS (Part-Of-Speech) Tagging based on Bidirectional LSTM-CRF",
        "authors": "Seon-Wu Kim, Sung-Pil Choi",
        "published": "2018-8-31",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5626/jok.2018.45.8.792"
    },
    {
        "id": 12068,
        "title": "Parts of Speech (POS) Tagging for Dogri Language",
        "authors": "Shivangi Dutta, Bhavna Arora",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-0733-2_37"
    },
    {
        "id": 12069,
        "title": "Tracking and flavor tagging performance at ATLAS",
        "authors": "Carlo Varni,  ",
        "published": "2021-2-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22323/1.390.0793"
    },
    {
        "id": 12070,
        "title": "New Combined Method to Improve Arabic POS Tagging",
        "authors": "Mohamed Labidi",
        "published": "2019-1-31",
        "citations": 2,
        "abstract": "One of the important tasks in Natural language processing is the part of speech tagging. For the Arabic language we have a lot of works but their performances do not rise to the required level, due to the complexity of the task and the Arabic language characteristics. In this work we study a combination between twodifferent approaches for Arabic POS-Taggers. The first one isa maximum entropy-based one, and the second is a statistical/rule-based one. Furthermore, we add a knowledge-based method to annotate Arabic particles. Our idea improves the accuracy rate. We passed from almost 85% to almost 90% using our combined method, which seem promoter.",
        "link": "http://dx.doi.org/10.32629/jai.v1i2.30"
    }
]