[
    {
        "id": 1201,
        "title": "Principal Component Analysis (PCA)",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-91280-6_301260"
    },
    {
        "id": 1202,
        "title": "Principal Component Analysis (PCA)",
        "authors": "Takio Kurita",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63416-2_649"
    },
    {
        "id": 1203,
        "title": "Principal Component Analysis (PCA)",
        "authors": "Takio Kurita",
        "published": "2020",
        "citations": 41,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-03243-2_649-1"
    },
    {
        "id": 1204,
        "title": "An Improved Principal Component Analysis (PCA) Face Recognition Technique using Modular Approach",
        "authors": "",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56831/psen-02-044"
    },
    {
        "id": 1205,
        "title": "PCA, Kernel PCA and Dimensionality Reduction in Hyperspectral Images",
        "authors": "Aloke Datta, Susmita Ghosh, Ashish Ghosh",
        "published": "2018",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6704-4_2"
    },
    {
        "id": 1206,
        "title": "Principal Component Analysis (PCA) and Statistical Tests Using Factoshiny and R Commander.",
        "authors": "Endler Marcel Borges, Matheus Fernandes Filgueiras",
        "published": "No Date",
        "citations": 0,
        "abstract": "Spreadsheets are commonly used for data handling. However, in huge data sets, spreadsheets cannot do statistical tests, such as one-way ANOVA, boxplot, plot of means, principal component analysis (PCA). Most of the students had never worked with programming software such as MATLAB, Phyton, Octave and R project. Hence, in this lab experiment, students analyzed large data sets using R Commander and Factoshiny plugins. Commander and Factoshiny are packages which gives graphical user interface (GUI). GUI plugins allows students with no programming knowledge to run statical tests quickly and easily without having to type a single command line. The class was divided into three parts. First, students analyzed a red wine data set (1599 samples, 11 physicochemical variables, and one qualitative variable) to find correlations between wine quality (qualitative variable) and its physicochemical variables (quantitative variable). Second, they analyzed a white wine data set (4898 samples, 11 physicochemical variables, and one qualitative variable) to find correlations between white wine quality and its physicochemical variables. Third, they analyzed a red wine and white wine data set and found correlations between wine's physicochemical variables and their quality and type. Statistical tests and PCA were carried out using R Commander and Factoshiny, respectively. Due to the graphical interface and simplicity of these two plugins, the class can be concluded in 200 min.",
        "link": "http://dx.doi.org/10.26434/chemrxiv-2021-wt2ck"
    },
    {
        "id": 1207,
        "title": "Principal Component Analysis (PCA) and Statistical Tests Using Factoshiny and R Commander.",
        "authors": "Endler Marcel Borges, Matheus Fernandes Filgueiras",
        "published": "No Date",
        "citations": 0,
        "abstract": "Spreadsheets are commonly used for data handling. However, in huge data sets, spreadsheets cannot do statistical tests, such as one-way ANOVA, boxplot, plot of means, principal component analysis (PCA). Most of the students had never worked with programming software such as MATLAB, Phyton, Octave and R project. Hence, in this lab experiment, students analyzed large data sets using R Commander and Factoshiny plugins. Commander and Factoshiny are packages which gives graphical user interface (GUI). GUI plugins allows students with no programming knowledge to run statical tests quickly and easily without having to type a single command line. The class was divided into three parts. First, students analyzed a red wine data set (1599 samples, 11 physicochemical variables, and one qualitative variable) to find correlations between wine quality (qualitative variable) and its physicochemical variables (quantitative variable). Second, they analyzed a white wine data set (4898 samples, 11 physicochemical variables, and one qualitative variable) to find correlations between white wine quality and its physicochemical variables. Third, they analyzed a red wine and white wine data set and found correlations between wine's physicochemical variables and their quality and type. Statistical tests and PCA were carried out using R Commander and Factoshiny, respectively. Due to the graphical interface and simplicity of these two plugins, the class can be concluded in 200 min.",
        "link": "http://dx.doi.org/10.33774/chemrxiv-2021-wt2ck"
    },
    {
        "id": 1208,
        "title": "PRINCIPAL COMPONENT ANALYSIS AND ITS GENERALIZATIONS FOR ANY TYPE SEQUENCE (PCA-SEQ)",
        "authors": "V.M. Efimov, K.V. Efimov, V.Y. Kovaleva",
        "published": "No Date",
        "citations": 1,
        "abstract": "In the 40s of the last century, Karhunen and Loève proposed a method for processing of one-dimensional numeric time series by converting it into a multidimensional by shifts. In fact, a one-dimensional number series was decomposed into several orthogonal time series. This method has many times been independently developed and applied in practice under various names (EOF, SSA, Caterpillar, etc.). Nowadays, the name SSA (the Singular Spectral Analysis) is most often used. It turned out that it is universal, applicable to any time series without requiring stationary assumptions, automatically decomposes time series into a trend, cyclic components and noise. By the beginning of the 1980s Takens showed that for a dynamical system such a method makes it possible to obtain an attractor from observing only one of these variables, thereby bringing the method to a powerful theoretical basis. In the same years, the practical benefits of phase portraits became clear. In particular, it was used in the analysis and forecast of the animal abundance dynamics.In this paper we propose to extend SSA to one-dimensional sequence of any type elements, including numbers, symbols, figures, etc., and, as a special case, to molecular sequence. Technically, the problem is solved almost the same algorithm as the SSA. The sequence is cut by a sliding window into fragments of a given length. Between all fragments, the matrix of Euclidean distances is calculated. This is always possible. For example, the square root from the Hamming distance between fragments is the Euclidean distance. For the resulting matrix, the principal components are calculated by the principal-coordinate method (PCo). Instead of a distance matrix one can use a matrix of any similarity/dissimilarity indexes and apply methods of multidimensional scaling (MDS). The result will always be PCs in some Euclidean space.We called this method PCA-Seq. It is certainly an exploratory method, as its particular case SSA. For any sequence, including molecular, PCA-Seq without any additional assumptions allows to get its principal components in a numerical form and visualize them in the form of phase portraits. Long-term experience of SSA application for numerical data gives all reasons to believe that PCA-Seq will be not less useful in the analysis of non-numerical data, especially in hypothesizing.PCA-Seq is implemented in the freely distributed Jacobi 4 package (http://mrherrn.github.io/JACOBI4/).",
        "link": "http://dx.doi.org/10.1101/535112"
    },
    {
        "id": 1209,
        "title": "Principal component analysis (PCA) in the morphostructure of male Kabylie donkeys (Equus asinus), Algeria",
        "authors": "",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.51607/22331360.2021.70.2.197"
    },
    {
        "id": 1210,
        "title": "Heart Disease Detection using Iridology with Principal Component Analysis (PCA) and Backpropagation Neural Network",
        "authors": "Leonardus Sandy Ade Putra, R. Rizal Isnanto, Aris Triwiyatno, Vincentius Abdi Gunawan",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009009402570264"
    },
    {
        "id": 1211,
        "title": "K-Means Clustering Using Principal Component Analysis (PCA) Indonesia Multi-Finance Industry Performance Before and During Covid-19",
        "authors": "Sri Mulyaningsih, Jerry Heikal",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21776/ub.apmba.2022.011.02.1"
    },
    {
        "id": 1212,
        "title": "Heart Disease Detection using Iridology with Principal Component Analysis (PCA) and Backpropagation Neural Network",
        "authors": "Leonardus Sandy Ade Putra, R. Rizal Isnanto, Aris Triwiyatno, Vincentius Abdi Gunawan",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009009402510258"
    },
    {
        "id": 1213,
        "title": "Analysis of 46,046 SARS-CoV-2 whole-genomes leveraging principal component analysis (PCA)",
        "authors": "Christiane Scherer, James Grover, Darby Kammeraad, Gabe Rudy, Andreas Scherer",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractSince the beginning of the global SARS-CoV-2 pandemic, there have been a number of efforts to understand the mutations and clusters of genetic lines of the SARS-CoV-2 virus. Until now, phylogenetic analysis methods have been used for this purpose. Here we show that Principal Component Analysis (PCA), which is widely used in population genetics, can not only help us to understand existing findings about the mutation processes of the virus, but can also provide even deeper insights into these processes while being less sensitive to sequencing gaps. Here we describe a comprehensive analysis of a 46,046 SARS-CoV-2 genome sequence dataset downloaded from the GISAID database in June of this year.SummaryPCA provides deep insights into the analysis of large data sets of SARS-CoV-2 genomes, revealing virus lineages that have thus far been unnoticed.",
        "link": "http://dx.doi.org/10.1101/2020.12.20.423682"
    },
    {
        "id": 1214,
        "title": "Principal-Component Analysis (PCA)",
        "authors": "David B. Hibbert",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/iupac.88.0082"
    },
    {
        "id": 1215,
        "title": "Robust PCAs and PCA Using Generalized Mean",
        "authors": "Jiyong Oh, Nojun Kwak",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-10-6704-4_4"
    },
    {
        "id": 1216,
        "title": "Detection of hypertensive retinopathy using principal component analysis (PCA) and backpropagation neural network methods",
        "authors": "Rahmat Arasy,  Basari",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5096735"
    },
    {
        "id": 1217,
        "title": "Principal Component Analysis for any type Sequences (PCA-Seq)",
        "authors": "",
        "published": "2018-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18699/mm-hpc-bbb-2018-11"
    },
    {
        "id": 1218,
        "title": "Principal Component Analysis (PCA)-Supported Underfrequency Load Shedding Algorithm",
        "authors": "Tadej Skrjanc, Rafael Mihalic, Urban Rudez",
        "published": "2020-11-12",
        "citations": 5,
        "abstract": "This research represents a conceptual shift in the process of introducing flexibility into power system frequency stability-related protection. The existing underfrequency load shedding (UFLS) solution, although robust and fast, has often proved to be incapable of adjusting to different operating conditions. It triggers upon detection of frequency threshold violations, and functions by interrupting the electricity supply to a certain number of consumers, both of which values are decided upon beforehand. Consequently, it often does not comply with its main purpose, i.e., bringing frequency decay to a halt. Instead, the power imbalance is often reversed, resulting in equally undesirable frequency overshoots. Researchers have sought a solution to this shortcoming either by increasing the amount of available information (by means of wide-area communication) or through complex changes to all involved protection relays. In this research, we retain the existing concept of UFLS that performs so well for fast-occurring frequency events. The flexible rebalancing of power is achieved by a small and specialized group of intelligent electronic devices (IEDs) with machine learning functionalities. These IEDs interrupt consumers only when the need to do so is detected with a high degree of certainty. Their small number assures the fine-tuning of power rebalancing and, at the same time, poses no serious threat to system stability in cases of malfunction.",
        "link": "http://dx.doi.org/10.3390/en13225896"
    },
    {
        "id": 1219,
        "title": "Principal Component Analysis (PCA) in Smart Growth Theory",
        "authors": "Qingqing Zhang",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/ammee-17.2017.96"
    },
    {
        "id": 1220,
        "title": "Parameter estimation of the structured illumination pattern based on principal component analysis (PCA): PCA-SIM",
        "authors": "Xin Chen, Yiwei Hou, Peng Xi",
        "published": "2023-2-8",
        "citations": 1,
        "abstract": "AbstractPrincipal component analysis (PCA), a common dimensionality reduction method, is introduced into SIM to identify the frequency vectors and pattern phases of the illumination pattern with precise subpixel accuracy, fast speed, and noise-robustness, which is promising for real-time and long-term live-cell imaging.",
        "link": "http://dx.doi.org/10.1038/s41377-022-01043-9"
    },
    {
        "id": 1221,
        "title": "POS0474 FACTORS ASSOCIATED WITH EROSIVE RHEUMATOID ARTHRITIS, A MULTIMARKER PRINCIPAL COMPONENT ANALYSIS (PCA) AND PRINCIPAL COMPONENT REGRESSION (PCR) ANALYSIS",
        "authors": "G. Adami, G. Orsolini, A. Fassio, O. Viapiana, E. Sorio, C. Benini, D. Gatti, D. Bertelle, M. Rossini",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1136/annrheumdis-2023-eular.3624"
    },
    {
        "id": 1222,
        "title": "AN UNSUPERVISED MACHINE LEARNING ALGORITHM: PCA (PRINCIPAL COMPONENT ANALYSIS) COMPREHENSIVE REVIEW",
        "authors": "",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.56726/irjmets49457"
    },
    {
        "id": 1223,
        "title": "PENGENALAN WAJAH MENGGUNAKAN PRINCIPAL COMPONENT ANALYSIS ( PCA ) DAN EIGEN FACE",
        "authors": "Mohammad Sendy Satrio",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "\r\n\r\n\r\n\r\nAbstrak\r\nPengenalan wajah adalah kerangka kerja identitas individu yang memanfaatkan kualitas wajah seseorang. Biometrik adalah bidang ilmiah yang menggunakan karakteristik wajah seseorang untuk menentukan atau mengungkapkan identitas mereka. Pengenalan wajah merupakan salah satu subbidang dari biometrik. Penelitian ini mengembangkan sistem pengenalan wajah yang mengandalkan ekstraksi fitur berdasarkan Principal Component Analysis (PCA). Metode ini mencakup pengambilan bagian-bagian mendasar dari kumpulan data wajah. Pengujian sistem dengan 45 citra wajah asli dilakukan untuk memastikan akurasi sistem pengenalan wajah manusia yang dikembangkan dalam penelitian ini. Akurasi pengenalan gambar yang benar dari sistem ditentukan oleh hasil pengujian sebesar 80%.\r\n\r\n\r\n\r\n",
        "link": "http://dx.doi.org/10.36308/iris.v1i2.521"
    },
    {
        "id": 1224,
        "title": "Image Fusion Based on IHS Transform and Principal Component Analysis (PCA) Transform",
        "authors": "Xiaolei Zhao",
        "published": "2017-12",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icctec.2017.00072"
    },
    {
        "id": 1225,
        "title": "Applications of Principal Component Analysis (PCA) for Fruit Juice Recovery and Quality Analysis",
        "authors": "Debabrata Bera, Lakshmishri Roy, Tanmoy Bhattacharya",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429436963-20"
    },
    {
        "id": 1226,
        "title": "Why most Principal Component Analyses (PCA) in population genetic studies are wrong",
        "authors": "Eran Elhaik",
        "published": "No Date",
        "citations": 6,
        "abstract": "AbstractPrincipal Component Analysis (PCA) is a multivariate analysis that allows reduction of the complexity of datasets while preserving data covariance and visualizing the information on colorful scatterplots, ideally with only a minimal loss of information. PCA applications are extensively used as the foremost analyses in population genetics and related fields (e.g., animal and plant or medical genetics), implemented in well-cited packages like EIGENSOFT and PLINK. PCA outcomes are used to shape study design, identify, and characterize individuals and populations, and draw historical and ethnobiological conclusions on origins, evolution, dispersion, and relatedness. The replicability crisis in science has prompted us to evaluate whether PCA results are reliable, robust, and replicable. We employed an intuitive color-based model alongside human population data for eleven common test cases. We demonstrate that PCA results are artifacts of the data and that they can be easily manipulated to generate desired outcomes. PCA results may not be reliable, robust, or replicable as the field assumes. Our findings raise concerns about the validity of results reported in the literature of population genetics and related fields that place a disproportionate reliance upon PCA outcomes and the insights derived from them. We conclude that PCA may have a biasing role in genetic investigations. An alternative mixed-admixture population genetic model is discussed.",
        "link": "http://dx.doi.org/10.1101/2021.04.11.439381"
    },
    {
        "id": 1227,
        "title": "Principal Component Analysis (PCA)",
        "authors": "Kim-Anh Lê Cao, Zoe Marie Welham",
        "published": "2021-9-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003026860-12"
    },
    {
        "id": 1228,
        "title": "Evaluasi Performa dari Diagram Kontrol Multivariat berbasis Independen Principal Component Analysis (PCA)",
        "authors": "Muhammad Ahsan, Hidayatul Khusna",
        "published": "2018-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12962/j27213862.v1i2.6733"
    },
    {
        "id": 1229,
        "title": "Space-Time-Parameter PCA for Data-Driven Modeling with Application to Bioengineering",
        "authors": "Florian De Vuyst, Claire Dupont, Anne-Virginie Salsac",
        "published": "2022-8-25",
        "citations": 1,
        "abstract": "Principal component analysis is a recognized powerful and practical method in statistics and data science. It can also be used in modeling as a dimensionality reduction tool to achieve low-order models of complex multiphysics or engineering systems. Model-order reduction (MOR) methodologies today are an important topic for engineering design and analysis. Design space exploration or accelerated numerical optimization for example are made easier by the use of reduced-order models. In this chapter, we will talk about the use of higher-order singular value decompositions (HOSVD) applied to spatiotemporal problems that are parameterized by a set of design variables or physical parameters. Here we consider a data-driven reduced order modeling based on a design of computer experiment: from high-dimensional computational results returned by high-fidelity solvers (e.g. finite element ones), the HOSVD allows us to determine spatial, time and parameters principal components. The dynamics of the system can then be retrieved by identifying the low-order discrete dynamical system. As application, we will consider the dynamics of deformable capsules flowing into microchannels. The study of such fluid-structure interaction problems is motivated by the use of microcapsules as innovative drug delivery carriers through blood vessels.",
        "link": "http://dx.doi.org/10.5772/intechopen.103756"
    },
    {
        "id": 1230,
        "title": "OS-PCA: Orthogonal Smoothed Principal Component Analysis Applied to Metabolome Data",
        "authors": "Hiroyuki Yamamoto, Yasumune Nakayama, Hiroshi Tsugawa",
        "published": "2021-3-5",
        "citations": 4,
        "abstract": "Principal component analysis (PCA) has been widely used in metabolomics. However, it is not always possible to detect phenotype-associated principal component (PC) scores. Previously, we proposed a smoothed PCA for samples acquired with a time course or rank order, but hypothesis testing to select significant metabolite candidates was not possible. Here, we modified the smoothed PCA as an orthogonal smoothed PCA (OS-PCA) so that statistical hypothesis testing in OS-PC loadings could be performed with the same PC projections provided by the smoothed PCA. Statistical hypothesis testing is especially useful in metabolomics because biological interpretations are made based on statistically significant metabolites. We applied the OS-PCA method to two real metabolome datasets, one for metabolic turnover analysis and the other for evaluating the taste of Japanese green tea. The OS-PCA successfully extracted similar PC scores as the smoothed PCA; these scores reflected the expected phenotypes. The significant metabolites that were selected using statistical hypothesis testing of OS-PC loading facilitated biological interpretations that were consistent with the results of our previous study. Our results suggest that OS-PCA combined with statistical hypothesis testing of OS-PC loading is a useful method for the analysis of metabolome data.",
        "link": "http://dx.doi.org/10.3390/metabo11030149"
    },
    {
        "id": 1231,
        "title": "Principal component analysis (PCA) on temporal changes of soil health indicators",
        "authors": "Fakher Kardoni",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "Soil health indicators are related to environmental factors, such as nutrient management, crop practices, different cropping systems, and biodiversity. 14 soil health indicators were measured and compared in our study to clarify the impact of different cropping system on soil quality. The primary comparisons were carried out among perennial plants, annual plants, and cover cropping, with an examination of the tillage system and fertilization taken into account during the analysis. Multivariant analysis recorded that the most promising indicators of soil health that related to soil quality and health were organic carbon (OC), total carbon (TC), followed by fall soil total nitrogen (TN). The main factor for clustering treatments based on indicators was N fertilization according to Euclidean distance that was applied to measure similarity of the groups. Although perennials and cover crops recorded more carbon sequestration and TC improvement, corn crops showed the worse impact on soil pH and bulk density (BD). Non-tillage practices significantly increased wet aggregate and soil moisture. The combination of TC field measurements with long-term cropping systems information has improved our understanding of how different cropping practices influence SOC improvement in soil full profile. It would develop appropriate and cost-effective agricultural management activities, maintain or improve carbon soil accumulation to guide farmer decision making, and ultimately advance food and nutritional security.",
        "link": "http://dx.doi.org/10.22146/ipas.85271"
    },
    {
        "id": 1232,
        "title": "Understanding Principal Component Analysis (PCA) in the Azerbaijan Economy: Case Studies of Vegetable and Fruit Sectors",
        "authors": "Ibrahim Niftiyev",
        "published": "No Date",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3782426"
    },
    {
        "id": 1233,
        "title": "Pengenalan Wajah Menggunakan Metode Principal Component Analysis (PCA) dan Canberra Distance",
        "authors": "Perani Rosyani",
        "published": "2017-6-25",
        "citations": 3,
        "abstract": "Wajah merupakan salah satu karakteristik biometrik yang digunakan untuk mengenali seseorang selain karakteristik yang lain seperti ucapan; sidik jari; retina; dll. Wajah adalah struktur multidimesi yang sangat kompleks dan membutuhkan tehnik komputasi yang baik untuk pengenalan. Di dalam penelitian ini; penulis mengambil 10 pose wajah yang berbeda kemudian menggunakan metode PCA untuk pengoptimalan dalam mereduksi dimensi. Setelah citra original di ekstraksi menggunakan PCA maka akan di hitung tingkat kesamaan (similarity degree)  antara gambar test dengan gambar training menggunakan metode jarak. Hasil dari penelitian ini adalah tingkat kesamaan yang dihasilkan setelah proses reduksi dan ekstraksi menggunakan PCA didapatkan rata-rata nilai untuk Canbera Distance adalah 77;59.",
        "link": "http://dx.doi.org/10.32493/informatika.v2i2.1515"
    },
    {
        "id": 1234,
        "title": "78 Principal component analysis (PCA)",
        "authors": "",
        "published": "2020-11-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1515/9783110629453-078"
    },
    {
        "id": 1235,
        "title": "MOM-VMP: Multi-Objective Mayfly Optimization algorithm for VM Placement supported by Principal Component Analysis(PCA) in Cloud Data Center",
        "authors": "Selvam Durairaj, Rajeswari Srid",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nVirtual Machine Placement (VMP) is crucial in a cloud data cen-ter(CDC). It is a critical step carried out as part of the Virtual Machine (VM) placement to allocate the best Physical Machine (PM) to host the VMs. The efficacy of the virtual machine placement strategy has a considerable impact on cloud computing efficiency. The ineffec-tiveness of the VMP approach has a major negative impact on the CDC.Virtualization facilitated VM migration has met the ever-increasing demands of dynamic workload by transferring VMs inside CDC. Many resource management goals, including power efficiency, load balancing, fault tolerance, and system maintenance, are aided VM placement. As a result, VMP needs to assess characteristics that may impact placement performance and energy efficiency. Most past research has concentrated solely on reducing energy consumption while ignoring SLA (service level agreement) breaches, enhancing the resource usage of PMs, and ignoring the over-commitment issue. MOM-VMP To propose a multiobjective Mayfly VMP algorithm (MOM-VMP) meta-heuristic optimization algorithm with a massive CDC with different and multi-dimensional resources to handle these issues. A multi-objective dynamic VMP strategy is employed to reduce resource wastage, overcom-mitment ratio, migration time, SLA violation and energy consumption at the same time. This paper presents a dynamic multi-objective VMP in CDC based on overcommitment resource allocation to influence VM-PM mapping. We validated our method of conducting a performance evaluation study using the CloudSim tool. The experimental findings show that the suggested study decreases energy consumption, makespan, SLA violations, and PM overloading while enhancing resource utilization.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2185603/v1"
    },
    {
        "id": 1236,
        "title": "Regional Inequality Based on Infrastructure Indicators Using Principal Component Analysis (PCA)",
        "authors": "Kikin Windhani, Fajar Hardoyono",
        "published": "2017-9-4",
        "citations": 0,
        "abstract": "This research aimed to identify the development gap among 27 sub-districts in Banyumas Regency based on infrastructure indicators using Principal Component Analysis (PCA). The infrastructure indicators used were the quality of road, lighting, transportation, market, bridges and schools. The data were collected by observation in 27 sub-districts of Banyumas Regency. From the analysis result with PCA, it can be determined that based on infrastructure indicators, the sub-districts in Banyumas Regency were divided into 4 clusters, namely: Cluster I with 1 sub-district; Cluster II with 3 sub-districts; Cluster III with 3 sub-districts, and the remainining 20 sub-districts were in Cluster IV.Keywords: Gap, Infrastructure, Principal Component Analysis (PCA).",
        "link": "http://dx.doi.org/10.20884/1.erjpe.2017.12.2.1136"
    },
    {
        "id": 1237,
        "title": "A Comparison of Principal Component Analysis (PCA) and Linear Dicriminant Analysis (LDA) For Dimensionality Reduction",
        "authors": "",
        "published": "2020-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24214/jecet.b.9.1.00107"
    },
    {
        "id": 1238,
        "title": "Genetic diversity assessment of extant cotton varieties based on Principal Component Analysis (PCA) and cluster analysis of enlisted DUS traits",
        "authors": "",
        "published": "2020-6-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37992/2020.1102.075"
    },
    {
        "id": 1239,
        "title": "PERBANDINGAN ANALISIS STATISTIK MULTIVARIAT PADA BATUBARA DI KABUPATEN TABALONG PROVINSI KALIMANTAN SELATAN MENGGUNAKAN METODE PRINCIPAL COMPONENT ANALYSIS (PCA)",
        "authors": "Fauzan Septiana, Dasapta Erwin Irawan, Achmad Darul",
        "published": "No Date",
        "citations": 0,
        "abstract": "Analisis proksimat merupakan teknik pengujian yang dilakukan pada batubara yang bertujuan untuk mengetahui kandungan pada batubara.  Secara keseluruhan menggunakan metode kualitatif lalu dilakukan pengklasifikasian batubara menggunakan analisis multivariat dan dilakukan klasifikasi secara visual.Data yang telah dianalisis berasal dari Kabupaten Tabalong Provinsi Kalimantan Selatan dengan jumlah data sebanyak 150 conto. Dari lokasi Pasuang-Lunai sebanyak 15 conto, dari lokasi Missim sebanyak 13 conto, dan dari lokasi Upau sebanyak 122 conto. Conto tersebut telah dilakukan uji proksimat sehingga diketahui 4 parameternya, yaitu total moisture (lengas), volatile matter (zat terbang), fixed carbon (karbon tertambat) dan kadar abu. Conto-conto tersebut telah dianalisis menggunakan metode Principal Component Analysis (PCA) dengan perangkat lunak R.Hasil yang didapatkan dengan menggunakan metode Principal Component Analysis (PCA) terdapat 3 klaster yang ada pada lokasi tersebut. Namun terdapat beberapa anomali yang ada. Ada beberapa conto yang seharusnya berada pada klasternya ternyata berada pada klaster yang lain.",
        "link": "http://dx.doi.org/10.31237/osf.io/7wk9a"
    },
    {
        "id": 1240,
        "title": "Principal component Analysis(PCA) normal estimation based on TOF sensor",
        "authors": "Cao Anqi, Ni Xiuhua, Zhang Long",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciibms60103.2023.10347668"
    },
    {
        "id": 1241,
        "title": "A Modular Approach For Facial Expression Recognition using Euler Principal Component Analysis (e-PCA)",
        "authors": " Sujata, Maitry Trivedi, Suman K. Mitra",
        "published": "2018-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aspcon.2018.8748418"
    },
    {
        "id": 1242,
        "title": "Principal Component Analysis (PCA)",
        "authors": "Ekaba Bisong",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-4470-8_26"
    },
    {
        "id": 1243,
        "title": "PRINCIPAL COMPONENT ANALYSIS (PCA) EVALUATION OF LIQUID CHROMATOGRAPHYMASS SPECTROMETRY (LC-MS) DATASETS OF Ganoderma boninense INTRACELLULAR METABOLITES",
        "authors": "NURAZAH ZAIN",
        "published": "2020-11-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21894/jopr.2020.0103"
    },
    {
        "id": 1244,
        "title": "PCA-Pruner: Filter pruning by principal component analysis",
        "authors": "Wei Zhang, Zhiming Wang",
        "published": "2022-8-10",
        "citations": 0,
        "abstract": "Deep Convolutional Neural Networks (CNNs) have been widely used in various domains due to their outstanding performance. However, they simultaneously bring enormous computational overhead, making it difficult to deploy to mobile and edge devices. Therefore, researchers use network compression techniques such as quantization, knowledge distillation and neural network pruning to alleviate this problem. Among network pruning, filter pruning has received broad attention. At present, most of the filter pruning methods need to define pruning rates manually, which is a trial-and-error process and requires rich experimental experience. Some methods obtain global optimal network parameters by Neural Architecture Search (NAS) or Evolutionary Algorithms (EA) to overcome this difficulty. However, they also introduce huge computational burden. To mitigate the above problems, this study proposes a pruning strategy based on Principal Component Analysis (PCA) called PCA-Pruner. Filter weights of a layer is regarded as a set of features, and the number of filters responding to feature dimension. Then, the number of reserved filters in each layer can be determined by PCA which is a classical dimensionality reduction technology. After that, we calculate the L1 norm of each filter in each layer and use it as an importance measurement to prune filters. Experimental results show that PCA-Pruner achieve performance improvements over the state-of-the-arts algorithms. For example, we compress the FLOPs and parameters of ResNet-56 on CIFA-10 by 45.8% and 47.1%, with an increase in accuracy of 0.27%. For ResNet-110 on CIFAR-10, we improve the accuracy by 0.58% and reduce the FLOPs and Params of the model by 58.3% and 56.2%, respectively. Towards ResNet-56 on CIFAR-100 dataset, we achieve a 38.8% FLOPs decrease and 38.0% Params reduction with only 0.69% accuracy loss.",
        "link": "http://dx.doi.org/10.3233/jifs-211555"
    },
    {
        "id": 1245,
        "title": "Evaluation of stretch reflex synergies in the upper limb using principal component analysis (PCA)",
        "authors": "Frida Torell",
        "published": "2023-10-12",
        "citations": 0,
        "abstract": "The dynamic nature of movement and muscle activation emphasizes the importance of a sound experimental design. To ensure that an experiment determines what we intend, the design must be carefully evaluated. Before analyzing data, it is imperative to limit the number of outliers, biases, and skewness. In the present study, a simple center-out experiment was performed by 16 healthy volunteers. The experiment included three load conditions, two preparatory delays, two perturbations, and four targets placed along a diagonal path on a 2D plane. While the participants performed the tasks, the activity of seven arm muscles were monitored using surface electromyography (EMG). Principal component analysis (PCA) was used to evaluate the study design, identify muscle synergies, and assess the effects of individual quirks. With PCA, we can identify the trials that trigger stretch reflexes and pinpoint muscle synergies. The posterior deltoid, triceps long head, and brachioradialis were engaged when targets were in the direction of muscle shortening and the perturbation was applied in the opposite direction. Similarly, the pectoralis and anterior deltoid were engaged when the targets were in the direction of muscle shortening and the perturbation was applied in the opposite direction. The stretch reflexes were not triggered when the perturbation brought the hand in the direction of, or into the target, except if the muscle was pre-loaded. The use of PCA was also proven valuable when evaluating participant performance. While individual quirks are to be expected, failure to perform trials as expected can adversely affect the study results.",
        "link": "http://dx.doi.org/10.1371/journal.pone.0292807"
    },
    {
        "id": 1246,
        "title": "Multivariate Process Capability Indices for Bilateral Specification Region Based on Principal Component Analysis (PCA)",
        "authors": "Ashis Kumar Chakraborty, Moutushi Chatterjee",
        "published": "2021-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429298349-5"
    },
    {
        "id": 1247,
        "title": "Social Progress beyond GDP: A Principal Component Analysis (PCA) of GDP and Twelve Alternative Indicators",
        "authors": "Bing Wang, Tianchi Chen",
        "published": "2022-5-24",
        "citations": 0,
        "abstract": "What social progress is and how to measure it are seemingly plain but essentially intri-cate questions that have not been clarified to date, which has led to various social problems and development failures. Designed after the Great Depression in the 1930s, Gross Domestic Product (GDP) has been, on the one hand, regarded as the greatest invention of the 20th century and is widely accepted as the primary indicator for social progress, but on the other hand, it has been criticized as knowing the price of everything but the value of nothing. The Beyond GDP Movement that has been active since the 2010s has inspired global interest in designing indicators to replace or supplement GDP, but none of them stands out as GDP’s successor. We take 12 influential indicators that consider beyond GDP and carry out a Principal Component Analysis (PCA) to investigate their correlations. The results indicate that GDP per capita (GDPP) can explain 65.61% of the information in the first principal component (PC) and account for 51.10% of the information related to the total 13 indicators, indicating its major role in social progress. Most indicators have strong correlations with GDPP, not beyond, and only the Ecological Footprint per capita (EFP) and Happy Planet Index (HPI) that have negative and weak correlations with GDPP, respectively, can provide new perspectives and values beyond GDP. Social progress is based upon various public values, and the indicators are the measurements of these values. Although GDP and economic values play major roles during social development, other indicators and their potential public values cannot be ignored. Prioritizing these public values and monitoring their indicators are essential to achieving sustainable and comprehensive social progress.",
        "link": "http://dx.doi.org/10.3390/su14116430"
    },
    {
        "id": 1248,
        "title": "Applying principal component analysis (PCA) to the selection of forensic analysis methodologies",
        "authors": "Nigel K. Booker, Peter Knights, J.D. Gates, Richard E. Clegg",
        "published": "2022-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.engfailanal.2021.105937"
    },
    {
        "id": 1249,
        "title": "Principal component analysis (PCA)",
        "authors": "Nickolay Trendafilov, Michele Gallo",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-76974-1_4"
    },
    {
        "id": 1250,
        "title": "Identifikasi Kualitas Buah Tomat dengan Metode PCA (Principal Component Analysis) dan Backpropagation",
        "authors": "Umi Murdika, Muhammad Alif, Yessi Mulyani",
        "published": "2021-10-25",
        "citations": 0,
        "abstract": "Intisari — Analisis komponen utama atau principal component analysis merupakan suatu metode yang digunakan dalam menganalisis kumpulan dataset untuk meringkas karakteristik utama mereka. Metode PCA ini mengurangi dimensi dataset dengan memproyeksikan setiap titik data ke hanya beberapa komponen utama pertama untuk mendapatkan data berdimensi lebih rendah sambil mempertahankan sebanyak mungkin variasi data.  Pada penelitian ini digunakan metode PCA untuk memproyeksikan data citra sehingga diperoleh data ekstraksi ciri dengan dimensi yang lebih kecil. Selanjutnya metode Backpropagation diterapkan untuk melakukan proses identifikasi. Dataset yang digunakan sebanyak 30 dataset yang terdiri dari 10 buah citra uji dan 20 data latih. Dari simulasi yang dilakukan diperoleh kesimpulan bahwa Metode PCA yang diterapkan berhasil mengurangi dimensi data. Identifikasi kualitas buah tomat menggunakan metode Back-propagation menunjukkan tingkat ketepatan dengan akurasi mencapai 76,7%. Nilai akurasi tersebut menunjukkan bahwa sistem ini telah berjalan dengan baik.\r\nKata kunci — Back-propagation,  PCA (Principal Componenet Analisys), Pengolahan Citra, JST (Jaringan Syaraf Tiruan).\r\n \r\n \r\nAbstract — Principal component analysis is a method used in analyzing datasets to summarize their main characteristics. This PCA method reduces the dimension of the dataset by projecting each data point onto only the first few principal components to obtain lower dimensional data while maintaining as much variation of the data as possible. In this study, the PCA method was used to project image data in order to obtain feature extraction data with smaller dimensions. Furthermore, the Backpropagation method is applied to carry out the identification process. The dataset used is 30 data consisting of 10 test images data and 20 training data. From the simulation, it can be concluded that the PCA method applied has succeeded in reducing the dimensions of the data. Identification of tomato fruit quality using the Back-propagation method shows the level of accuracy with an accuracy of 76.7%. it indicates that this system has been running well.\r\nKeywords — Backpropagation, PCA (Principal Component Analysis), Image Processing, ANN (Artificial Neural Networks).",
        "link": "http://dx.doi.org/10.23960/elc.v15n3.2240"
    },
    {
        "id": 1251,
        "title": "Principal Component Analysis (PCA) for Powder Diffraction Data: Towards Unblinded Applications",
        "authors": "Dmitry Chernyshov, Iurii Dovgaliuk, Vadim Dyadkin, Wouter van Beek",
        "published": "2020-7-5",
        "citations": 10,
        "abstract": "We analyze the application of Principal Component Analysis (PCA) for untangling the main contributions to changing diffracted intensities upon variation of site occupancy and lattice dimensions induced by external stimuli. The information content of the PCA output consists of certain functions of Bragg angles (loadings) and their evolution characteristics that depend on external variables like pressure or temperature (scores). The physical meaning of the PCA output is to date not well understood. Therefore, in this paper, the intensity contributions are first derived analytically, then compared with the PCA components for model data; finally PCA is applied for the real data on isothermal gas uptake by nanoporous framework    γ   –Mg(BH     4    )     2    . We show that, in close agreement with previous analysis of modulation diffraction, the variation of intensity of Bragg lines and the displacements of their positions results in a series of PCA components. Every PCA extracted component may be a mixture of terms carrying information on the average structure, active sub-structure, and their cross-term. The rotational ambiguities, that are an inherently part of PCA extraction, are at the origin of the mixing. For the experimental case considered in the paper, the extraction of the physically meaningful loadings and scores can only be achieved with a rotational correction. Finally, practical recommendations for non-blind applications, i.e., what boundary conditions to apply for the the rotational correction, of PCA for diffraction data are given.",
        "link": "http://dx.doi.org/10.3390/cryst10070581"
    },
    {
        "id": 1252,
        "title": "EXPLORING ATTITUDES AND LEARNING STYLES OF STATISTICS LEARNERS USING PRINCIPAL COMPONENT ANALYSIS (PCA) AND MULTIDIMENSIONAL SCALING (MDS) APPROACH",
        "authors": "Afiqah Hamidi, Zamalia Mahmud",
        "published": "2021-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21125/edulearn.2021.0342"
    },
    {
        "id": 1253,
        "title": "Principal Component Analysis (PCA) and hierarchial clustering in tobacco (Nicotiana tabacum L.) for yield and yield attributing traits",
        "authors": "",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37992/2023.1402.062"
    },
    {
        "id": 1254,
        "title": "Evaluation of Carcass Characteristics of Japanese Quail Using Principal Component Analysis (PCA)",
        "authors": "Fatma Desouki Mohammed Abdallah",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17582/journal.aavs/2022/10.4.771.778"
    },
    {
        "id": 1255,
        "title": "Principal Component Analysis (PCA) in the Body Measurements of Nguni Cows",
        "authors": "Thobela Louis Tyasi, Widya Pintaka Bayu Putra",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17582/journal.pjz/20210605170634"
    },
    {
        "id": 1256,
        "title": "SISTEM PRESENSI PENGENALAN WAJAH DENGAN METODE PRINCIPAL COMPONENT ANALYSIS (PCA)",
        "authors": "EKO SUDARYANTO, ASEP SURYANTO",
        "published": "2021-2-4",
        "citations": 0,
        "abstract": "ABSTRAKPada kegiatan belajar mengajar diadakan presensi. Presensi ini digunakan selain pihak pelajar juga digunakan oleh instanasi yang mengadakan kegiatan belajar mengajar. Dalam mengikuti perkuliahan kehadiran mahasiswa akan dicatat dalam presensi kehadiran.Algoritma Principal Component Analysis (PCA) yaitu salah satu metode yang dapat digunakan untuk mengolah citra wajah seseorang sehingga secara otomatis sistem akan mengenali wajah seseorang melalui ciri-ciri utamanya seperti mata, hidung, bibir, alis sebagai identitas. Tujuan dari penelitian ini adalah untuk merancang sistem presensi pengenalan wajah dengan menggunakan metode PCA dan mengetahui tingkat akurasi dari sistem presensi pengenalan wajah. Metode penelitian yang digunakan adalah metode waterfall. Hasil penelitian iniberhasil merancang aplikasi presensi mahasiswa berbasis pengenalan wajah dengan menerapkan Algoritma Principal Component Analysis (PCA). Tingkat keberhasilan pengenalan wajah dengan rata-rata nilai mencapai 88%. Untuk nilai keberhasilan pengenalan wajah tertinggi yaitu 90% sedangkan terendah yaitu 75%.Kata Kunci : presensi, pengenalan wajah, algoritma PCA.Â ABSTRACTIn teaching and learning activities, attendance is held. This presence is used in addition to the students as well as by institutions that hold teaching and learning activities. In attending lectures, student attendance will be recorded in attendance. Principal Component Analysis (PCA) algorithm is a method that can be used to process a person's face image so that the system will automatically recognize a person's face through its main characteristics such as eyes, nose, lips, eyebrows as identity. The purpose of this study was to design a facial recognition presence system using the PCA method and to determine the accuracy level of the facial recognition presence system. The research method used is the waterfall method. The results of this study succeeded in designing a face recognition-based student presence application by applying the Principal Component Analysis (PCA) Algorithm. The success rate of face recognition with an average score of 88%. The highest success rate for facial recognition is 90% while the lowest is 75%.Keywords: presence, face recognition, PCA algorithm.",
        "link": "http://dx.doi.org/10.53810/jt.v21i2.378"
    },
    {
        "id": 1257,
        "title": "Deteksi Kavitasi Berbasis Getaran Pada Pompa Sentrifugal Menggunakan Principal Component Analysis (PCA)",
        "authors": "Berli Paripurna Kamiel, Ikhsan Aprima Kausar",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18196/st.212219"
    },
    {
        "id": 1258,
        "title": "Specific Emitter Identification with Principal Component Analysis (PCA) Dimensionality Reduction and Convolutional Neural Network",
        "authors": "Gianmarco Baldini, Fausto Bonavitacola",
        "published": "2023-7-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10215809"
    },
    {
        "id": 1259,
        "title": "Face Recognition based Feature Extraction using  Principal Component Analysis (PCA)",
        "authors": "Muhammad Zulfahmi Nasution",
        "published": "2020-1-20",
        "citations": 6,
        "abstract": "The human face is an entity that has semantic features. Face detection is the first step before face recognition. Face recognition technique is an identification process based on facial features. One feature extraction approach for facial recognition techniques is the Principal Component Analysis (PCA) method. The PCA method is used to simplify facial features and characteristics in order to obtain proportions that are able to represent the characteristics of the original face. The purpose of this research is to construct facial patterns stored in a digital image database. The process of pattern construction and face recognition starts from objects in the form of face images, side detection, pattern construction until it can determine the similarity of face patterns to proceed as face recognition. In this research, a program has been designed to test some samples of face data stored in a digital image database so that it can provide a similarity in the face patterns being observed and its introduction using PCA",
        "link": "http://dx.doi.org/10.31289/jite.v3i2.3132"
    },
    {
        "id": 1260,
        "title": "Community awareness about disaster preparedness: Principal component analysis (PCA)",
        "authors": "Abdullelah Thobaity, Modi Moteri",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5455/mjhs.2021.01.012"
    },
    {
        "id": 1261,
        "title": "Comparing Principal Component Analysis (PCA) and -Variational Autoencoder (ß-VAE) for Anomaly Detection in Selective Laser Melting (SLM) Process Data",
        "authors": "J. Voigt, M. Moeckel",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23967/wccm-eccomas.2020.144"
    },
    {
        "id": 1262,
        "title": "Appendix IV:",
        "authors": "",
        "published": "2020-4-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv1zcm2fh.11"
    },
    {
        "id": 1263,
        "title": "Analysis of Filters in Performance Assessment of Principal Component Analysis (PCA) based Face Recognition System",
        "authors": "Amirzeb Badshah, Akhtar Hussian Khalil, Naveed Islam,  Hafeez-Ur-Rehman",
        "published": "2019-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itt48889.2019.9075089"
    },
    {
        "id": 1264,
        "title": "Improving the efficiency measurement index using principal component analysis (PCA)",
        "authors": "Ahmed Husham Mohammed, Marwan Abdul Hameed Ashour",
        "published": "2022-6-24",
        "citations": 0,
        "abstract": "This study aims at presenting an approach capable of improving the efficiency measurement index using the Principal Component Analysis. The main reason for the adoption of this approach in measurement process lies in the fact that during an analysis of data envelopment, there is often discrimination problems among measurement units, whether a measurement unit is efficient or not, especially there is a large number of variables (inputs and outputs). As to the size of a sample to be studied, and for addressing this problem, the Principal Component Analysis is adopted in this study, which is deemed one of the important statistical tools in decreasing original variable dimensions. For obtaining new variables representing principal components, factors for each variable have been identified, which works on determining its effect. Therefore, this study brings to light an integrated approach between two procedures: PCA-DEA, taking part in enhancing results of the efficiency measurement index. This approach has been applied to a problem related to the state financial management of the Iraqi Budget for the years (2005 – 2019). As per the decrease principal accomplished through the use of PCA, efficient years are identified.",
        "link": "http://dx.doi.org/10.53730/ijhs.v6ns4.9620"
    },
    {
        "id": 1265,
        "title": "Principal Component Analysis as a tool for analyzing translation style.",
        "authors": "Chang-soo. Lee,  ",
        "published": "2020-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20305/it202003117140"
    },
    {
        "id": 1266,
        "title": "Groundwater quality model through the combined use of principal component analysis (PCA) and multiple linear regression (MLR) Case study: Maturín’s aquifers, Monagas, Venezuela",
        "authors": "",
        "published": "2020-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26461/20.02"
    },
    {
        "id": 1267,
        "title": "Black–Litterman asset allocation model based on principal component analysis (PCA) under uncertainty",
        "authors": "Ding Lei",
        "published": "2019-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10586-018-1864-1"
    },
    {
        "id": 1268,
        "title": "Alzheimer's disease prediction using machine learning techniques and principal component analysis (PCA)",
        "authors": "M. Sudharsan, G. Thailambal",
        "published": "2023",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.matpr.2021.03.061"
    },
    {
        "id": 1269,
        "title": "Developing a Satisfactory Input for Project Complexity Model Using Principal Component Analysis (PCA)",
        "authors": "Bac Dao, Stuart Anderson, Behzad Esmaeili",
        "published": "2017-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1061/9780784480847.016"
    },
    {
        "id": 1270,
        "title": "ANALISIS GAYA KEPEMIMPINAN KEPALA KELURAHAN WAIHAONG MENGGUNAKAN METODE PRINCIPAL COMPONENT ANALYSIS (PCA)",
        "authors": "Rohni Natalin Damanik, Wilma Latuny, Victor O. Lawalata",
        "published": "2021-10-31",
        "citations": 0,
        "abstract": "Keberhasilan suatu organisasi atau instansi pemerintahan, dipengaruhi oleh gaya kepemimpinan yang diterapkan oleh pemimpinnya. Semakin baik gaya kepemimpinan yang diterapkan, akan memberikan dampak yang positif bagi kemajuan organisasi tersebut. Kelurahan Waihaong merupakan salah satu kelurahan yang berada di kota Ambon, dengan jumlah penduduk sebanyak 6.413 jiwa. Penelitian ini bertujuan untuk menganalisis gaya kepemimpinan kepala kelurahan Waihaong. Teknik pengambilan sampel dilakukan dengan multistage random sampling dengan jumlah sampel sebanyak 79 responden. Metode analisis data yang digunakan adalan PCA (Principal Component Analysis). Hasil penelitian menemukan bahwa kepala kelurahan Waihaong memiliki 2 jenis gaya kepemimpinan, yaitu gaya kepemimpinan transformasional dan demokrasi.",
        "link": "http://dx.doi.org/10.30598/i-tabaos.2021.1.1.39-48"
    },
    {
        "id": 1271,
        "title": "Pengenalan Citra Wajah Sebagai Identifier Menggunakan Metode Principal Component Analysis (PCA)",
        "authors": "Aris Budi, Suma'inna Suma'inna, Hata Maulana",
        "published": "2018-1-15",
        "citations": 1,
        "abstract": "ABSTRAK  Pengenalan wajah merupakan sebuah sistem identifikasi pribadi yang menggunakan karakteristik wajah seseorang. Pengenalan wajah sendiri merupakan suatu cabang ilmu biometrik, yaitu suatu bidang keilmuan yang menggunakan karakteristik fisik dari seseorang untuk menentukan atau mengungkapkan identitasnya. Sistem yang dikembangkan dalam tugas akhir ini adalah sebuah sistem pengenalan wajah yang menggunakan ekstraksi fitur berbasis Principal Component Analysis (PCA). Teknik ini melibatkan pengambilan komponen utama dari database wajah. Untuk mengetahui keakuratan sistem pengenalan wajah manusia yang dirancang pada tugas akhir ini, telah dilakukan uji coba sistem dengan menggunakan input sebanyak 60 citra wajah dari database. Dari hasil pengujian sistem ini, didapatkan hasil performansi sistem adalah 80% dalam mengenali citra input dengan benar.   Kata kunci : pengenalan wajah, biometrik, PCA.",
        "link": "http://dx.doi.org/10.15408/jti.v9i2.5608"
    },
    {
        "id": 1272,
        "title": "Usability Analysis using Principal Component Analysis (PCA) Method for Online Fish Auction Application",
        "authors": " Ermatita, Ika Nurlaili Isnainiyah, Yulnelly Yulnelly, Amalia Nurul Balqis",
        "published": "2019-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icimcis48181.2019.8985225"
    },
    {
        "id": 1273,
        "title": "Analysis of Vocational School Development Based on Regional Potential Using Principal Component Analysis (PCA)",
        "authors": "Saripudin S., Ida Bagus Budiyanto",
        "published": "2020-3-4",
        "citations": 0,
        "abstract": "This study aims to analyze the development of Vocational High School (SMK) based on regional potential in Cimahi City, Indonesia. This study is descriptive research. This study was conducted in Cimahi City, West Java Province, Indonesia. The population and sample of this study were all the potentials of the region and the industrial fields in the City of Cimahi, West Java and the fields/programs/competencies of SMKs in the City of Cimahi. Data in this study were collected using documentation, interview and observation methods. The Principle Component Analysis (PCA) was used as the method of analyzing regional potentials using Minitab Statistical Software version 14. Based on the results of this study it was found that the development of Vocational High Schools is based on regional potential in Cimahi City and based on the analysis of Vocational Development Levels in Cimahi City by using the PCA analysis method based on indicators education such as Total Population Ages 16-18, Student Ratio per School, Student Ratio per Class, Student Ratio per Teacher, and Gross Participation Rate (GPR) in 3 (three) Districts of Cimahi City found that the lowest PCA 1 for the three districts is in South Cimahi District (-1026.02). This means that the priority location I for the development of SMK is South Cimahi District. It is then followed by Central Cimahi Subdistrict (-644.19) which becomes priority location II for the development of SMK. And Priority III is the District of North Cimahi (-435.5). With these findings, the Office of Education, especially in the area of Vocational Secondary Education in the Cimahi City, West Java, should pay attention to the development of vocational schools which requires careful study in establishing vocational schools based on the potential of the region.",
        "link": "http://dx.doi.org/10.17509/invotec.v16i1.23515"
    },
    {
        "id": 1274,
        "title": "Classification of Anemia Images Based on Principal Component Analysis (PCA)",
        "authors": "Asma I. Hussein, Nidaa F. Hassan",
        "published": "2017-11-19",
        "citations": 0,
        "abstract": "Blood cells are composed of erythrocytes (Red Blood Cells (RBCs)), the shape of RBC changes when the body suffers from different diseases such as Anemia. Classification of such diseases helps the medical technician to decide the type of Anemia in Laboratory analyzes in the hospitals. This paper proposed an automatic classification algorithm, which discriminates the different types of Anemia using Principal Component Analysis (PCA) algorithm and Decision tree. The proposed algorithm consists of four steps, at the first step preprocessing steps are applied on the RBC image, these RBC images then segmented in the second step, features are extracted using moment invariant in third step, this features are considered input to PCA so as to produced features vectors, at a final step features vector are inputted to Decision Tree to classify RBC image. Best classifications rates are (92%) obtained when using PCA algorithm compared with (74.1 %) which are obtained without applying PCA algorithm.",
        "link": "http://dx.doi.org/10.23851/mjs.v28i1.319"
    },
    {
        "id": 1275,
        "title": "Face recognition based on principal component analysis (PCA)",
        "authors": "Caihua Qiu, Feng Ding",
        "published": "2022-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aiam57466.2022.00185"
    },
    {
        "id": 1276,
        "title": "Aplikasi teknik principal component analysis (pca) untuk penyepakatan data pada kompresosr multi tahap",
        "authors": "Wielianto Yudha, Tri Partono Adhi",
        "published": "2018-10-2",
        "citations": 0,
        "abstract": "Application of principal component analysis (pca) tecnique for data reconsiliation in multi stage compresor.The latest development of gross error detection has been focused on the use of multivariate statistical techniques. These techniques give more accurate and correct detection in determining the variables suspected to contain gross error. These techniques are reliable to solve the problem of correlation present in measurement data. As one of multivariate statistical technique, PCA can be used to detect gross error in the measurement. The objectives of this research are to apply PCA for detection and identification of gross error in measurement data, to apply data reconciliation technique to obtain reconciled data, and to investigate application of PCA leading to its use in the dynamic data reconciliation. In this research, the operation of multistage compressor in urea fertilizer plant is chosen as the studied case. The results of this research prove that PCA can be applied for detection and identification of gross error in measurement data of mass flow, pressure, and temperature. PCA application on steady state data reconciliation can be usedfor detection the location of gross error in the measurement data. Gross error in the data can be eliminated and corrected exactly. Moreover, PCA can be used to detect and isolate fault quickly leading to its use in the dynamic data reconciliation. Nevertheless, process knowledge base must be collected first before the application of PCA. If the process knowledge is more complete, the confidence of the inference becomes higher.Keywords: Measurement Data, Gross Error, Data Reconciliation, PCA AbstrakDalam perkembangannya, deteksi kesalahan nyata dilakukan dengan teknik statistik multi varia bel untuk mendapatkan hasil yang lebih akurat dan benar dalam penentuan varia bel yang menyebabkan kesalahan  nyata  tersebut.  Teknik  statistik  multivariabel  dikenal  handal  dalam  mengatasi permasalahan dimana terdapat korelasi diantara varia bel proses yang diukur. PCA sebagai salah satu teknik ana/isis statistik kuantitatifmultivariabel dikenal baik untuk mendeteksi kesalahannyata pada pengukuran. Penelitian ini dilaksanakan dengan tujuan untuk menerapkan PCA dalam deteksi dan identifikasi kesalahan nyata pada data pengukuran, menerapkan teknik penyepakatan data untuk  memperoleh  data pengukuran  yang  tersepakati,  dan  mengkaji penerapan  PCA pada penyepakatan data secara dinamik. Dalam penelitian ini, operasi kompresor multi tahap dalam pabrik pupuk urea dipilih sebagai studi kasus. Hasil dari penelitian ini membuktikan bahwa teknik PCA dapat diterapkan untuk deteksi dan identifikasi kesalahan nyata pada data pengukuranlaju afir, tekanan, dan temperatur. Aplikasi  teknik PCA pada penyepakatan  data keadaan tunak dapat digunakan untuk mendeteksi letak kesalahan nyata pada data pengukuran sehingga eliminasi atau koreksi terhadap data yang mengandung kesalahan nyata tersebut dapat dilakukan dengan tepat. Selain itu, teknik PCA dapat digunakan untuk mendeteksi dan melokalisir kesalahan dengan cepat sehingga teknik ini memungkinkan untuk diterapkan pada penyepakatan data dinamik. Akan tetapi, aplikasi teknik PCA ini perlu diawali dengan pengumpulan pengetahuan proses yang lengkap sehingga tingkat keyakinan terhadap keputusan penerimaan ataupenolakan suatu data lebih tinggi.Kata Kunci: Data Pengukuran, Kesalahan Nyata, Penyepakatan Data, PCA",
        "link": "http://dx.doi.org/10.5614/jtki.2006.5.2.3"
    },
    {
        "id": 1277,
        "title": "Human face detection based on skin color with principal component analysis (PCA) algorithm",
        "authors": "Dorsa Kiaei, Saeed Tavakoli",
        "published": "2019-11-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2540481"
    },
    {
        "id": 1278,
        "title": "Study of Principal Component Analysis (PCA) as a Face Recognition Method",
        "authors": "Amina. R. Shtewi",
        "published": "2022-4-17",
        "citations": 1,
        "abstract": "Face recognition is a biometric technique that can be used for a variety of purposes, such as national security, access control, identity fraud, banking, and finding missing children. Faces are highly dynamic and facial features are not always easily extracted, which can lead to discarding textural information like the smoothness of faces, a hairstyle that, might contain strong identity information. In addition, brightness, scale, and facial expressions play a significant role in the face-recognizing process. Therefore, face recognition is considered as a difficult problem. To figure out this problem effective methods using databases techniques are needed. This paper describes face recognition methods and their structure. Based on Wen Yi Zhao and Rama Chellappa work the face recognition methods are divided into three groups: a holistic approach, feature-based approach, and hybrid approach, where Principal Component Analysis PCA, a holistic approach method, is presented as a mathematical technique that can assist the process of face recognition. Also, the paper shows how the PCA is used to extract facial features by removing the principal components of the available multidimensional data.",
        "link": "http://dx.doi.org/10.37375/sjfssu.v2i1.218"
    },
    {
        "id": 1279,
        "title": "Deteksi Keaslian Citra Menggunakan Metode Error Level Analysis (ELA) dan Principal Component Analysis (PCA)",
        "authors": "Dewi Astria Faroek, Rusydi Umar, Imam Riadi",
        "published": "2020-2-4",
        "citations": 0,
        "abstract": "Kemajuan teknologi yang ada pada citra digital mempengaruhi banyak kemungkinan pada perangkat pencitraan dengan resolusi yang tinggi dengan biaya yang rendah. Hal ini dapat dimanfaatkan oleh pihak-pihak tertentu dalam memanipulasi citra digital agar lebih baik hingga sangat jauh dari hasil citra aslinya. Pemalsuan citra adalah proses manipulasi pada sebagian atau seluruh daerah citra baik terhadap isi maupun konteks citra dengan bantuan teknik pemrosesan citra digital. Dengan manipulasi citra ini banyak pihak yang dapat melakukan sebuah tindakan kejahatan. Definisi forensik citra merupakan bidang ilmu yang digunakan untuk mengidentifikasi asal dan menverifikasi keaslian sebuah citra tersebut. Hal yang mendasari dalam melakukan deteksi keaslian citra adalah melakukan perbandingan antara dua image dan dua metode yaitu metode Error Level Analysis (ELA) dan Principal Component Analysis (PCA) dengan menggunakan tools forensically-beta. Penelitian ini diharapkan menunjukkan hasil yang baik dalam mendeteksi objek pada citra sehingga dapat membantu dalam mendeteksi citra yang asli dan citra yang telah dimanipulasi berdasarkan metode ELA dan PCA.",
        "link": "http://dx.doi.org/10.22441/format.2019.v8.i2.006"
    },
    {
        "id": 1280,
        "title": "Factor analysis of beef gravel quality using Principal Component Analysis (PCA)",
        "authors": "Faula Arina, Atia Sonda, Devalia Elisabeth, Dhini Hamidah, Kiswa Safira Okataviani",
        "published": "2022-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36055/jiss.v8i2.17277"
    },
    {
        "id": 1281,
        "title": "Variable Selection in Nonlinear Principal Component Analysis",
        "authors": "Hiroko Katayama, Yuichi Mori, Masahiro Kuroda",
        "published": "2022-8-25",
        "citations": 1,
        "abstract": "Principal components analysis (PCA) is a popular dimension reduction method and is applied to analyze quantitative data. For PCA to qualitative data, nonlinear PCA can be applied, where the data are quantified by using optimal scaling that nonlinearly transforms qualitative data into quantitative data. Then nonlinear PCA reveals nonlinear relationships among variables with different measurement levels. Using this quantification, we can consider variable selection in the context of PCA for qualitative data. In PCA for quantitative data, modified PCA (M.PCA) of Tanaka and Mori derives principal components which are computed as a linear combination of a subset of variables but can reproduce all the variables very well. This means that M.PCA can select a reasonable subset of variables with different measurement levels if it is extended so as to deal with qualitative data by using the idea of nonlinear PCA. A nonlinear M.PCA is therefore proposed for variable selection in nonlinear PCA. The method, in this chapter, is based on the idea in “Nonlinear Principal Component Analysis and its Applications” by Mori et al. (Springer). The performance of the method is evaluated in a numerical example.",
        "link": "http://dx.doi.org/10.5772/intechopen.103758"
    },
    {
        "id": 1282,
        "title": "Principal Component Analysis in Financial Data Science",
        "authors": "Stefana Janićijević, Vule Mizdraković, Maja Kljajić",
        "published": "2022-8-25",
        "citations": 1,
        "abstract": "Numerous methods exist aimed at examining patterns in structured and unstructured financial data. Applications of these methods include fraud detection, risk management, credit allocation, assessment of the risk of default, customer analytics, trading prediction, and many others, creating a broad field of research named Financial data science. A problem within the field that remains significantly under-researched, yet very important, is that of differentiating between the three major types of business activities—merchandising, manufacturing, and service based on the structured data available in financial reports. It can be argued that, due to the inherent idiosyncrasies of the three types of business activities, methods for assessment of the risk of default, methods for credit allocation, and methods for fraud detection would all see an improved performance if reliable information on the percentage of entities’ business activities allocated to the three major activities would be available. To this end, in this paper, we propose a clustering procedure that relies on Principal Component Analysis (PCA) for dimensionality reduction and feature selection. The procedure is presented using a large empirical data set comprising complete financial reports for various business entities operating in the Republic in Serbia, that pertain to the reporting period 2019.",
        "link": "http://dx.doi.org/10.5772/intechopen.102928"
    },
    {
        "id": 1283,
        "title": "Based on Principal Component Analysis (Pca) of the influence factors of sports dance development research",
        "authors": "Xiaoyun Shi",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1051/ncssc/201701033"
    },
    {
        "id": 1284,
        "title": "Klasifikasi DNA Microarray Menggunakan Principal Component Analysis (PCA) dan Artificial Neural Network (ANN)",
        "authors": "Dian Atia Ihsani, Achmad Arifin, Muhammad Hilman Fatoni",
        "published": "2020-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12962/j23373539.v9i1.51637"
    },
    {
        "id": 1285,
        "title": "Mantle sources of Cenozoic volcanic activities around the South China Sea revealed by geochemical and isotopic data using the principal component analysis (PCA)",
        "authors": "Shuangshuang Chen, Zewei Wang, Rui Gao",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nPrincipal component analysis (PCA) was conducted to analyze geochemical and isotopic data and interpret the characteristics and types of mantle sources of Cenozoic volcanic activities around the South China Sea (SCS). Fifteen trace element indicators and five isotopic indicators were surveyed from 623 volcanic rock samples obtained from the SCS, Hainan Island, Fujian–Zhejiang, Taiwan, Vietnam, and Thailand to characterize the geochemical properties of the volcanic rocks, determine the types of mantle sources, and assess the influence degree of each mantle source. Two principal components (PCs) were extracted by PCA based on trace elements and Sr–Nd–Pb isotopic ratios, which are an enriched oceanic island basalt-type mantle plume and a depleted mid-ocean ridge basalt-type spreading ridge. In the Southeast Asian region, the influence of Hainan mantle plume on younger volcanic activities (< 13 Ma) was greater than that on older ones (> 13 Ma) in the same location. PCA was used to verify the mantle plume–ridge interaction model of volcanic activities beneath the expansion center of the SCS and refute the hypothesis that the tension in the SCS is triggered by the Hainan plume. The results of this study demonstrate the efficiency and applicability of PCA to the discussion of mantle sources of volcanic activities and provide a new method with which to analyze geochemical data.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-148976/v1"
    },
    {
        "id": 1286,
        "title": "Modulation format/bit rate recognition based on principal component analysis (PCA) and artificial neural networks (ANNs): erratum",
        "authors": "Junhe Zhou, Panpan Fan",
        "published": "2020-1-15",
        "citations": 0,
        "abstract": "The aim of this erratum is to add an omitted reference.",
        "link": "http://dx.doi.org/10.1364/osac.386233"
    },
    {
        "id": 1287,
        "title": "Using Principal Component Analysis (PCA) Method to Optimize a Depleted Underground Gas Storage: A Case Study",
        "authors": "M. Arabi, M. Asareh, E. Toloei",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3997/2214-4609.202320015"
    },
    {
        "id": 1288,
        "title": "SuSiE PCA: A scalable Bayesian variable selection technique for principal component analysis",
        "authors": "Dong Yuan, Nicholas Mancuso",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.isci.2023.108181"
    },
    {
        "id": 1289,
        "title": "Modeling and Analysis of the DSR Complex Shear Modulus Using the Principal Component Analysis (PCA)",
        "authors": "M.A. Khasawneh, D.M. Al-Oqaily",
        "published": "2019-12-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3923/jas.2020.1.13"
    },
    {
        "id": 1290,
        "title": "Analysis of the Influence of Social and Economic Factors on COVID-19 Cases with the Principal Component Analysis (PCA) Method",
        "authors": "Ferry Vincenttius Ferdinand, Xenia Virrienza, Helena Margaretha",
        "published": "2022-4-24",
        "citations": 0,
        "abstract": "Coronavirus Disease 2019 (COVID-19) is a disease caused by the SARS-CoV-2 virus which infects the human respiratory. On March 11, 2019, World Health Organization (WHO) officially declared the COVID-19 outbreak as a global pandemic because in less than three months it had infected more than 120,000 people in 123 countries from Asia, Europe, United States, to South Africa. This rapid growth of cases is caused by many factors. Therefore, the author wants to examine social and economic factors in 29 countries regarding the COVID-19 case. In this study, the author uses 122 variables; consisting of 107 variables from social factors and 15 variables from economic factors. Because the number of variables used was quite large, the author reduced the data using the Principal Component Analysis (PCA). Then, 15 main components are formed from the results of the application of PCA carried out on 122 variables. It will then be used to form a regression equation for the COVID-19 case which consists of the average new cases of COVID-19 per day, the rate of infected population COVID-19, the percentage of deaths caused by COVID-19, and the percentile of the new cases of COVID-19 per day.",
        "link": "http://dx.doi.org/10.56573/gcistem.v1i.19"
    },
    {
        "id": 1291,
        "title": "Physico-Chemical Analysis and Modelling of Ground Water Quality Parameters Using Water Quality Index Method (WQI) and Principal Component Analysis (PCA)",
        "authors": "Ilaboya IR",
        "published": "2018-5-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32474/tceia.2018.02.000134"
    },
    {
        "id": 1292,
        "title": "Principal Component Analysis (PCA)",
        "authors": "B. K. Tripathy, S Anveshrithaa, Shrusti Ghela",
        "published": "2021-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003190554-2"
    },
    {
        "id": 1293,
        "title": "Two-Handed Bangla Sign Language Recognition Using Principal Component Analysis (PCA) And KNN Algorithm",
        "authors": "Promila Haque, Badhon Das, Nazmun Nahar Kaspy",
        "published": "2019-2",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecace.2019.8679185"
    },
    {
        "id": 1294,
        "title": "Analisis Principal Component Analysis (PCA) dalam Penentuan Faktor Kepuasan Pengunjung terhadap Layanan Perpustakaan Digilib",
        "authors": "Sudianto Manullang, Dita Aryani, Hanifah Rusydah",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "Maximum management of the library, especially improving services to users is a must that needs to be evaluated by the library manager. Visitor satisfaction is difficult to measure because it relates to the high and low expectations of visitors to the service they want. The purpose of this study is to investigate the most important factors or components in aspects of visitor satisfaction. So that it can increase satisfaction appropriately so that the library can carry out the right strategy to maintain and provide the best quality service. The subjects of this study were students with 2019 – 2022 status. 120 samples were taken using a random sampling technique. The collected data will be analyzed using the Principal Component Analysis (PCA) method. The PCA analysis process was carried out in several stages, namely the Bartlett's test, testing the KMO value, testing the correlation matrix, PCA analysis, and interpreting the PCA results. Findings from PCA analysis by reducing 12 correlated variables into 2 factors, namely reference services and facilities and infrastructure. The results of this study indicate that the facilities and infrastructure factor have a greater cumulative percentage of variance compared to the reference service factor, which is equal to 51,387%.",
        "link": "http://dx.doi.org/10.29408/edumatic.v7i1.14839"
    },
    {
        "id": 1295,
        "title": "Weather Classification Based on Hybrid Cloud Image Using Principal Component Analysis (PCA) and Linear Discriminant Analysis (LDA)",
        "authors": "Yulia Hapsari,  Syamsuryadi",
        "published": "2019-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1742-6596/1167/1/012064"
    },
    {
        "id": 1296,
        "title": "Pengembangan Klasifikasi Berbagai Jenis Beras Dengan Menggunkan NIRS Metode PCA (Principal Component Analysis)",
        "authors": "Mufazzal Assayuti, Fachruddin Fachruddin, Zulfahrizal Zulfahrizal",
        "published": "2020-2-1",
        "citations": 0,
        "abstract": "Abstrak. Tujuan dari penelitian ini adalah membangun model pendugaan keaslian beras Aceh menggunakan metode Principal Component Analysis (PCA). Penelitian ini menggunakan beras Sigupai, beras Tangse, beras IR-64, beras Thailand, dan beras Vietnam. Jumlah sampel yang digunakan pada penelitian ini adalah 110 sampel. Spektrum yang diambil pada penelitian ini berasal dari beras murni tanpa pencampuran dan beras dengan pencampuran 75% dan 25% untuk masing-masing beras Aceh dan beras BULOG. Pengambilan spektrum beras menggunakan Self developed FT-IR IPTEK T-1516. Hasil yang didapat pada penelitian ini yaitu: (1) NIRS dengan metode PCA mampu membedakan beras Aceh dengan beras BULOG baik dalam keadaan tanpa pencampuran maupun dengan pencampuran. (2) Analisis spektrum NIRS beras menunjukkan keberadaan kandungan karbohidrat pada panjang gelombang 4297cm-1 – 4462 cm-1. Protein terletak pada panjang gelombang 4698 cm-1  - 4879 cm-1.  Kadar air terletak pada panjang gelombang 5087 cm-1 –  5188 cm-1. Puncak gelombang 5708 cm-1 – 5805 cm-1  dan 8196 cm-1 – 8389 cm-1  menunjukkan senyawa kimia lemak. Panjang gelombang 6827 cm-1 – 6969 cm-1 menunjukkan senyawa kimia protein dan kadar air.Development classification of various types rice using NIRS PCA (Principal Component Analysis) methodAbstract. The purpose of this research is to develop a model for estimating the authenticity of Aceh rice using the Principal Component Analysis (PCA) method. This research uses Sigupai rice, Tangse rice, IR-64 rice, Thai rice, and Vietnamese rice. The number of samples used in this study was 110 samples. The spectrum taken in this study was 100% of each rice, and mixing of 75% and 25% rice between Aceh rice and BULOG rice. Intake of rice spectrum using Self-developed FT-IR IPTEK T-1516. The results obtained in this study are: (1) NIRS with PCA method is able to group Aceh rice with BULOG rice both in a state without mixing or by mixing. (2) Analysis of the rice NIRS spectrum showed the presence of carbohydrate content at wavelengths of 4297cm-1 - 4462 cm-1. Protein content at wavelength 4698 cm-1 - 4879 cm-1. Water content at a wavelength of 5087 cm-1 - 5188 cm-1. Wavelength of 5708 cm-1 - 5805 cm-1 and 8196 cm-1 - 8389 cm- 1 shows the fat content. Wavelength 6827 cm-1 - 6969 cm-1 shows the protein and water content.",
        "link": "http://dx.doi.org/10.17969/jimfp.v5i1.13627"
    },
    {
        "id": 1297,
        "title": "Comparative Study of Principal Component Analysis (PCA) based on Decision Tree Algorithms",
        "authors": "Aung Nway Oo",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31695/ijasre.2018.32767"
    },
    {
        "id": 1298,
        "title": "Identification of Dominant Air Pollutants Over Hyderabad Using Principal Component Analysis (PCA)",
        "authors": "N. Vasudha, P. Venkateswara Rao",
        "published": "2022-12-1",
        "citations": 0,
        "abstract": "The study aims to bring out the interdependence of the air pollutant components through Correlation and Principal Component Analysis (PCA) to identify the sources causing air pollution in Residential, Resident cum Industrial and Industrial areas of Hyderabad. For this purpose, daily data (from 1st January 2018 to 31st December 2020) of air pollutants recorded by Continuous Ambient Air Quality Monitoring Stations (CAAQMS) that includes 15 air pollution-causing components was collected from the Centre Pollution Control Board (CPCB) website. Data from Residential (Hyderabad Central University (HCU)), Residential and Industrial (ICRISAT-Patencheru), and purely Industrial (Pashmylaram) areas were analyzed and it was identified that 5 majorly contributed pollutants at HCU were due to residential activities however, 5 major pollutants at ICRISAT and Pashmylaram were due to vehicular traffic and industry emissions. The purpose of the study was to figure out the sources of air pollutants and their interdependency under different local conditions. The findings of the study may help the policymakers and authorities concerned to implement different strategies and take necessary steps to keep the pollution levels under control.",
        "link": "http://dx.doi.org/10.46488/nept.2022.v21i04.020"
    },
    {
        "id": 1299,
        "title": "Principal Component Analysis(PCA) Use for Keywords Research Characterization. Case Study: Environment and Renewable Energy Community Interest",
        "authors": "Yassine El Moudene, Jaafar Idrais, Abderrahim Sabour",
        "published": "2019-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icocs.2019.8930789"
    },
    {
        "id": 1300,
        "title": "The Klasifikasi Jenis Ikan Berbasis Jaringan Saraf Tiruan Menggunakan Algoritma Principal Component Analysis (PCA)",
        "authors": "Arif Lumute Unihehu, Imam Suharjo",
        "published": "2021-9-3",
        "citations": 0,
        "abstract": "Fish are cold-blooded animals that are widely used by humans. Fish are a diverse group of poikilothermic vertebrates with more than 27,000 species worldwide. A large number of fish species becomes a problem in distinguishing the types of fish. The purpose of this study was to create a fish type classification system based on the texture of artificial neural network-based fish imagery using K-Nearest Neighbors and Principal Component Analysis (PCA) algorithms. The data was taken through direct exploration and retrieved directly by researchers. The data only uses 3 types of fish as the object of further research conducted training and testing test data in the first, second, and third classes only one can not be recognized by the system, while the other data can be recognized by the percentage of success of 93% (Ninety-three percent).",
        "link": "http://dx.doi.org/10.35329/jiik.v7i2.200"
    }
]